{
    "id": "b3mnw62ywiq53t4hjjvvcad7ady3vga6",
    "title": "A Multilingual semantic wiki based on Attempto Controlled English and Grammatical Framework",
    "info": {
        "introducer": [
            "Jens Lehmann, Department of Business Information Systems, University of Leipzig"
        ],
        "author": [
            "Kaarel Kaljurand, Institute of Computational Linguistics, University of Zurich"
        ],
        "published": "July 8, 2013",
        "recorded": "May 2013",
        "category": [
            "Top->Computer Science->Semantic Web",
            "Top->Computer Science->Big Data"
        ]
    },
    "url": "http://videolectures.net/eswc2013_kaljurand_semantic/",
    "segmentation": [
        [
            "Good afternoon, my name is Carter Gollier and this is joint work with.",
            "To be a school who is awesome sitting here.",
            "What we did was we took two existing technologies.",
            "Attempto controlled English and grammatical framework, and we put them together and got multilingual semantic wiki."
        ],
        [
            "So first I'll discuss what Vicky's are.",
            "What current week is our current Vicky systems?",
            "So in general there are user friendly collaborative environments for knowledge management and typically this.",
            "Content that is put into wikis in Uncle Straight Natural language.",
            "And therefore it's not easily automatically processable, so you cannot easily.",
            "So you cannot ask reach questions about the wiki content to cannot copy content from one article into another one.",
            "If these articles are in different languages, let's say and still maintain some consistency.",
            "Um?",
            "And every week is powered by some software.",
            "For instance, Mediawiki powers Wikipedia.",
            "To deal with this problem that.",
            "Vicky Content is not easily processable automatically.",
            "Semantic wikis were invented.",
            "The idea was to add a bit of semantics.",
            "In addition to the natural language content.",
            "So then you can do some automatic reasoning, and typically this semantics is in in RDF triples and there is still the natural language content, so there are kind of two languages in parallel.",
            "One example is Semantic Mediawiki.",
            "What we've been working on is so-called controlled natural language.",
            "Based semantic wiki.",
            "Weather it's just one language that the user sees.",
            "That's a fragment of some natural language.",
            "In our case, it's English.",
            "And the users put sentence into the week in this language.",
            "And this is also a formal language, so.",
            "Underneath you can do reasoning.",
            "And becausw.",
            "All the former methods are hidden.",
            "You can have quite expressive reasoning underneath.",
            "And the system that we developed or to be as developed for that is called a squeaky."
        ],
        [
            "Now in this work.",
            "We take the speaker system and make it multilingual, so we got multilingual seaonal bassomatic wiki.",
            "And multilinguality means that there are many languages.",
            "Involved in the wiki, some of them are natural like English in German, some of formal like first of logic, coral where focusing on all currently.",
            "The user interface can be in different languages.",
            "It's still C&L based, meaning that there are formal grammars formal methods, but these are hidden, so that's the philosophy of CNL.",
            "And it's semantic.",
            "In the sense that we can do this question answering and consistency checking, and now for the multilingual wikis we can do.",
            "Automatic synchronization of wiki content which is in different languages.",
            "And it's still user friendly and collaborative.",
            "So it's still a wiki."
        ],
        [
            "Some use cases what we are working on for this paper that we worked on was a multi lingual ontology editor.",
            "Who are we?",
            "Let the users manage vocabulary about geography.",
            "And this is bored by all reasoning.",
            "Some other use cases which are more remote from semantic web could be for instance tourist Facebook.",
            "So this is more about the multilinguality aspect that one would want to see a wiki page in multiple languages.",
            "In parallel, so the wiki page would be then phrases from tourist Facebook.",
            "Or a more ontology like catalog of museum objects.",
            "And possibly what David Karger proposed semantic web?",
            "If this, then that kind of action rule systems could also be maybe implemented on this platform.",
            "So."
        ],
        [
            "The background check."
        ],
        [
            "Large that we used.",
            "Um?",
            "Or attempted controlled English and grammatical framework and the briefly introduced both of these.",
            "Attempto controlled English is a subset of natural English, so.",
            "There are certain English syntactic structures which are not allowed in this fragment, but what is allowed is mostly inspired by logic and 1st logic.",
            "So we have disjunction, conjunction, negation if then.",
            "And these operate on various phrasal levels.",
            "You can have conjunctions of nouns and conjunction of verbs and verb phrases, relative clauses.",
            "Then there are anaphoric references like pronouns, definite noun phrases which correspond to.",
            "Variables and variable sharing in formal languages.",
            "Various kind of quantifiers.",
            "And different kinds of content words.",
            "The grammar is fixed by the designers of this language.",
            "With users can change the content word vocabulary.",
            "One key thing with attempted controlled English is that it does not allow any structural ambiguity.",
            "Every sentence that you put in gets a single parse tree, which means that we have to deal with certain natural language.",
            "Ambiguity such as anaphora resolution, for instance, the sentence France borders Spain, and it borders Portugal.",
            "It's not entirely clear what is it.",
            "Points to but in ace it always points to the preceding nouns.",
            "In this case Spain.",
            "And so we deal with all kinds of classical NLP ambiguities like quantifier scope and attachment, and so, and we have developed a mapping to all sexually bidirectional mapping, so you can also verbalize all ontologies in in ACE.",
            "And.",
            "It's kind of user oriented.",
            "We have documentation that describes this interpretation rules in this construction rules.",
            "Explaining these's restrictions from English."
        ],
        [
            "There is an example with two examples of a sentences, so one is a question.",
            "And how we map them to all so we can deal with fairly complex sentences which are.",
            "So relative clauses and negations on the English side and.",
            "And intersections, complements and extensional quantifiers on the logic side.",
            "And questions then currently.",
            "So we handle subtype of questions with one query pronoun which then Maps to all class expressions."
        ],
        [
            "And on top of that language, we have developed the ACE wiki system which allows you to.",
            "It's a collaborative environment.",
            "You can write a sentences.",
            "And because the language is restricted syntactically, you have this nice look ahead editor or predictive editor that helps you complete sentence in such a way that they are syntactically correct.",
            "And it basically has all the ace features.",
            "It's monolinguals, just this one language.",
            "Ace as a fixed grammar, which the users cannot change.",
            "And it doesn't tolerate any ambiguity, so it interprets everything in one way."
        ],
        [
            "Now grammatical framework.",
            "It's kind of a functional programming language which is optimized for.",
            "Writing natural language grammars so it has.",
            "Support for various natural language things like case endings and long distance dependencies.",
            "And it comes with a nice and big library that already implements all this common constructs.",
            "For many languages so that you can introduce them and don't have to know the details of all these languages.",
            "The way it works on the language level is that.",
            "You describe so-called abstract syntax, which is language neutral.",
            "So the example there is border.",
            "You basically say that border is a function which takes 2 arguments of type country and it creates.",
            "An object of type relation, and then for each language you describe how this function is linearized or how this.",
            "Function is.",
            "Turned into a concrete string that can be parsed and generated.",
            "And they they have to deal with things like case ending.",
            "So in English you want to have a nominative case in Estonian.",
            "You might want to have a genitive case in the.",
            "In the subject position and the words are of course different, so you have to handle that.",
            "And everything is bidirectional, so you get translation out of it so you can parse the string.",
            "Into these trees which use these abstract functions.",
            "And then you can linearize these trees as strings in some other language.",
            "And now it has very still support, and it's quite a nice framework to work in.",
            "It's very powerful, so these examples that I showed don't really cover its power."
        ],
        [
            "And the nice thing about this framework is this comes with this resource, library.",
            "For instance, you want to generate the clause.",
            "Just called this function, which takes certain arguments, noun phrase and word phrase, and.",
            "And it does it for you.",
            "Covers currently 30 languages.",
            "So we relied on this a lot."
        ],
        [
            "So what we did we put this weekend chief together?"
        ],
        [
            "To do that, we first implemented the ace Cameron in the Chief Framework.",
            "Try to cover all the languages that the Resource, Library supports.",
            "But we didn't really fine tune it to any particular language, but this can be done also later.",
            "By native speakers and so on.",
            "And then.",
            "We generalize this wiki to made it access the GF tools.",
            "An added very support tool.",
            "Handle multilinguality and ambiguity.",
            "And also grammar editing and I will show now office."
        ],
        [
            "So the about the implementation of this grammar.",
            "So the idea was to.",
            "Have 'em have a way to go basically from.",
            "From any language.",
            "That is available in this multi lingual grammar interface.",
            "Or back from Ace to any language, and because for Ace we have various tools such as mapping to all.",
            "We can then effectively go from finish to land and back.",
            "Using this grammar and this existing age tools."
        ],
        [
            "So here is an example for German.",
            "If you have a German sentence.",
            "Yeah, the slant is neat and I'm a grants this time being in land.",
            "You can parse it into this GF three, so this is a tree that is specific to this grammar so the users don't see this actually.",
            "But this is a way to convert the German sentence two to Ace.",
            "And then the ace.",
            "We can map Joel so effectively we can go from German to Alden."
        ],
        [
            "For the implementation, we relied on some existing work by the creators of GF.",
            "They first got this idea to describe a sin in the GF framework.",
            "But we really focused on the subset of the face that can be cleanly mapped all and made sure that there's full coverage.",
            "Um?",
            "And currently we support about 20 languages.",
            "Mostly European languages, but there are some.",
            "Asian languages as well.",
            "And the idea is to really make the implementation.",
            "Always called the Resource, Library so that if there is some.",
            "Improvement in the Resource, library.",
            "We immediately benefit from it.",
            "Now there are some.",
            "Um?",
            "Deficiencies in this implementation.",
            "These anaphoric references and handling them.",
            "In a.",
            "In a formerly clean way is very important for Ace, but the GF framework.",
            "Did not allow us to implement this.",
            "Nicely, but in practice it didn't seem to be a big problem.",
            "And also some of these languages are not completely covered because the resource, library did not cover all these syntactic structures that we have in Ace.",
            "So this has to be done.",
            "Especially like extending.",
            "The library, and if you don't have competence in some of these languages, then it's very hard."
        ],
        [
            "So here is an translation example.",
            "Every person that speaks a language X does not forget text.",
            "It's a bit artificial example, but I wanted to demonstrate various things.",
            "For instance, that.",
            "So the negation particle in English, not German, nicht, can be in various places, and this framework handles that.",
            "In Finnish, the the variable takes a case ending.",
            "What comes after: in the other language doesn't happen.",
            "Then in Russian, the object of the verb speak as a preposition.",
            "And things like this.",
            "And the outcome is.",
            "Nice professional sentences.",
            "These might contain some mistakes, but.",
            "The idea is that even if there are mistakes, they are fixable.",
            "It's like program that you can fix.",
            "It's not statistical machine translation.",
            "Which is very difficult to kind of influence."
        ],
        [
            "How to integrate Ace Wiki with GF?",
            "We are now accessing the GF tools available through web services.",
            "We we changed the underlying representation in a switch used to be a sentence is now it's.",
            "Sets of trees which can be then linearized so the wiki content is completely language neutral, but whoever reads it can then pick the the language in which he wants to see it, and it can also represent ambiguity.",
            "So the set of trees is corresponds to an ambiguous sentence.",
            "There's still the look ahead editor.",
            "Which can now be used with any of the languages that are supported.",
            "And we also added grammar editing.",
            "This was necessary because in order to add new words to Vicki.",
            "You technically need to edit the grammar.",
            "But in fact you can do any changes to the comma completely changed language.",
            "And grammar is just GF.",
            "Grammars are very modular, so we can map Crown modules to wiki pages in quite."
        ],
        [
            "Simple wait.",
            "So now come some examples, screenshots.",
            "Here is an example or article about the Swiss River presented in two languages, so the users can select.",
            "There is a left sidebar where they can choose the language.",
            "And immediately change the language of the content.",
            "And if they want to change something.",
            "A sentence then they can just open the lookahead editor.",
            "And it proposes the next token award.",
            "And the correct language."
        ],
        [
            "Ambiguity resolution example.",
            "Sometimes it happens that.",
            "Um?",
            "There is a sentence so entered by a German speaker, for instance.",
            "And the German speaker does not realize that it's an ambiguous sentence.",
            "In this case, so there are two completely different meanings.",
            "the Rhine flows through a city that contains Switzerland or the right flows through a city that Switzerland contains.",
            "So this ambiguity is revealed in another language.",
            "So here we want to benefit from the fact that the wiki is a collaborative environment.",
            "Somebody put in an ambiguous sentence without realizing it, but this is actually revealed in another language.",
            "And we can also design.",
            "A more artificial looking language, which is kind of based on German.",
            "That also reveals this ambiguity, so you don't necessarily need to have another language speaker to disambiguate stuff for you."
        ],
        [
            "So example of background model page in this case.",
            "It's quite the top level module which lists all the abstract functions.",
            "And then links this module to.",
            "All the other modules while such wiki linking."
        ],
        [
            "Example of a automatic question answering in Spanish and consistency checking.",
            "So person as described with the landlocked countries, and then now he wants to ask questions like what is a landlocked country where is not landlocked country.",
            "And maybe added an incorrect sentence such as.",
            "Liechtenstein borders a country.",
            "Which is not a landlocked country.",
            "And this turns out to be incorrect."
        ],
        [
            "We did two kinds of evaluations for this work.",
            "One was to just focus on the grammar.",
            "So this multi lingual grammar that can translate a sentence into lots of different languages.",
            "We made sure that so we generated hundreds a sentences.",
            "Make sure that discover interesting things.",
            "First of all, they cover all the functions of the grammar in this grammatical constructs, and they also cover interesting all axiom structures like subclass and range and so on.",
            "And the idea was to.",
            "As the users, whether the translations of these sentence into other languages are correct, we also use Google Translate just to get some idea of how Google.",
            "Translates these sentences.",
            "Results were well.",
            "Users preferred our translations, which is kind of obvious.",
            "This in a way unfair study.",
            "About the important thing for us was that many changes that they proposed to our translations were just stylistic.",
            "So they didn't.",
            "The users were not trained in attempt to control the English or the idea of control natural language, so they wanted to make the sentence look nicer.",
            "But ace.",
            "Wants to have certain redundancy.",
            "Or more more verbose knus in some cases."
        ],
        [
            "So here are some examples.",
            "We don't do that well in all the languages, but.",
            "The problems are fixable, so in Finnish were quite good and so this shows that if one fixes the box in the grammar can get almost perfect results."
        ],
        [
            "The other evaluation was.",
            "We developed 500 words geography vocabulary in three languages.",
            "Then we asked users.",
            "We have 30 users.",
            "Do you write?",
            "Into the victim and tagged him either true or false.",
            "Whether the sentence that they added was true.",
            "In their opinion or false?",
            "And the same users also were asked to look at an article where somebody else had put in sentences.",
            "And taxis is true or false, and these sentences that they saw in some case in one case where translated in the other case where the originals.",
            "So we wanted to see whether translation affects the agreement.",
            "And it did not, which was.",
            "Nice verification and also the.",
            "The nice thing was that the users discovered all the functions of the camera, so they really used all the constructs so they were not.",
            "These constructs were discoverable through the lookahead editor."
        ],
        [
            "I think there's a lot of future work to be done.",
            "One thing is to generalize this architecture to handle other kinds of grammars our grammar.",
            "Well, so wikis kind of optimized for such ontology editing.",
            "Also improve the collaborative grammar editing features currently, or editing the chief source code, basically which is.",
            "Not that user friendly.",
            "Reasoning can be used to improve ambiguity management.",
            "And the wiki content itself can somehow should be made to contribute back to the.",
            "Design of the lookahead editor and maybe help documentation for.",
            "And you users."
        ],
        [
            "So this is my last slide just to.",
            "Provide some links.",
            "All the software that we developed is open source and on kitap typically so it can be easily forked.",
            "So I talked about multilingual Ace grammar.",
            "Source code is available multilingual, senile based semantic wiki engine.",
            "We did this in a. EU project called Malta, which just finishes in two days.",
            "Our deliverable's are in work package 11.",
            "There is more information about this evaluation there.",
            "And there are two general projects underlying all this attempted project and the grammatical framework project.",
            "But if you're interested in the grammatical framework, then there is a summer school this August.",
            "In Bavaria check out the link.",
            "Thank you.",
            "So every sentence that's written in Ace is that a?",
            "Constructed natural language or constraint.",
            "Sorry natural language sentence.",
            "Yes, in the sense that it has a formal grammar.",
            "It does a formal grammar.",
            "So it's built, so there's no content that's just typed in as on Wikipedia, for example.",
            "Say again all of the all of the human readable content on Ace wiki is generated through a constrained natural language.",
            "Yes, OK, interesting.",
            "Have you done studies on the General Express ability of this in any language?",
            "Do people do people feel that they can express everything they wish to express in a constrained natural language on the wiki?",
            "They definitely cannot, so this is something that our traditions show little does that vary between languages.",
            "Do you have any idea that might work better in?",
            "Don't know and my final question is, do you showed that it worked better in some languages?",
            "Another you would slide with different, yet we just missed it.",
            "Here you go and you mentioned that one factor was how much it was fixed.",
            "You said finish by 4 if for example with finish.",
            "If I recall what you said correctly.",
            "That had succeeded because people were able to tweak the code out.",
            "Fine tuned, correct the programming code.",
            "Is.",
            "Not a wiki users, but administrators this client over the designers of the Resource, library.",
            "OK, they were finished.",
            "I take it and they couldn't make it this week.",
            "Is there nothing inherent of the grammar of the languages themselves that cause varying automatic translate ability?",
            "I'm not sure well there must be some things, but all all languages share certain things like coordination, negation and relative clauses, and we rely on that basically.",
            "A very simple question.",
            "Where did do you get your dictionaries from?",
            "For all these languages and dictionaries might be well usable everywhere, so you might use general ones, right?",
            "Yes, so there is work on extracting lexicons from.",
            "Wordnet and so on.",
            "And we did this also in the multi project.",
            "But for this evaluation we just hand coded it.",
            "We use an Excel spreadsheet to create the lexicon of 500 words.",
            "About geography, that's how we made it, but.",
            "Ideally, such things should be.",
            "Imported from somewhere.",
            "Thank you.",
            "OK thanks, so we are exactly in time, so let's thank the speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good afternoon, my name is Carter Gollier and this is joint work with.",
                    "label": 0
                },
                {
                    "sent": "To be a school who is awesome sitting here.",
                    "label": 0
                },
                {
                    "sent": "What we did was we took two existing technologies.",
                    "label": 0
                },
                {
                    "sent": "Attempto controlled English and grammatical framework, and we put them together and got multilingual semantic wiki.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first I'll discuss what Vicky's are.",
                    "label": 0
                },
                {
                    "sent": "What current week is our current Vicky systems?",
                    "label": 0
                },
                {
                    "sent": "So in general there are user friendly collaborative environments for knowledge management and typically this.",
                    "label": 1
                },
                {
                    "sent": "Content that is put into wikis in Uncle Straight Natural language.",
                    "label": 0
                },
                {
                    "sent": "And therefore it's not easily automatically processable, so you cannot easily.",
                    "label": 1
                },
                {
                    "sent": "So you cannot ask reach questions about the wiki content to cannot copy content from one article into another one.",
                    "label": 0
                },
                {
                    "sent": "If these articles are in different languages, let's say and still maintain some consistency.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And every week is powered by some software.",
                    "label": 0
                },
                {
                    "sent": "For instance, Mediawiki powers Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "To deal with this problem that.",
                    "label": 0
                },
                {
                    "sent": "Vicky Content is not easily processable automatically.",
                    "label": 0
                },
                {
                    "sent": "Semantic wikis were invented.",
                    "label": 0
                },
                {
                    "sent": "The idea was to add a bit of semantics.",
                    "label": 1
                },
                {
                    "sent": "In addition to the natural language content.",
                    "label": 0
                },
                {
                    "sent": "So then you can do some automatic reasoning, and typically this semantics is in in RDF triples and there is still the natural language content, so there are kind of two languages in parallel.",
                    "label": 0
                },
                {
                    "sent": "One example is Semantic Mediawiki.",
                    "label": 1
                },
                {
                    "sent": "What we've been working on is so-called controlled natural language.",
                    "label": 0
                },
                {
                    "sent": "Based semantic wiki.",
                    "label": 0
                },
                {
                    "sent": "Weather it's just one language that the user sees.",
                    "label": 0
                },
                {
                    "sent": "That's a fragment of some natural language.",
                    "label": 0
                },
                {
                    "sent": "In our case, it's English.",
                    "label": 0
                },
                {
                    "sent": "And the users put sentence into the week in this language.",
                    "label": 0
                },
                {
                    "sent": "And this is also a formal language, so.",
                    "label": 0
                },
                {
                    "sent": "Underneath you can do reasoning.",
                    "label": 0
                },
                {
                    "sent": "And becausw.",
                    "label": 0
                },
                {
                    "sent": "All the former methods are hidden.",
                    "label": 0
                },
                {
                    "sent": "You can have quite expressive reasoning underneath.",
                    "label": 0
                },
                {
                    "sent": "And the system that we developed or to be as developed for that is called a squeaky.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now in this work.",
                    "label": 0
                },
                {
                    "sent": "We take the speaker system and make it multilingual, so we got multilingual seaonal bassomatic wiki.",
                    "label": 0
                },
                {
                    "sent": "And multilinguality means that there are many languages.",
                    "label": 0
                },
                {
                    "sent": "Involved in the wiki, some of them are natural like English in German, some of formal like first of logic, coral where focusing on all currently.",
                    "label": 0
                },
                {
                    "sent": "The user interface can be in different languages.",
                    "label": 1
                },
                {
                    "sent": "It's still C&L based, meaning that there are formal grammars formal methods, but these are hidden, so that's the philosophy of CNL.",
                    "label": 1
                },
                {
                    "sent": "And it's semantic.",
                    "label": 1
                },
                {
                    "sent": "In the sense that we can do this question answering and consistency checking, and now for the multilingual wikis we can do.",
                    "label": 0
                },
                {
                    "sent": "Automatic synchronization of wiki content which is in different languages.",
                    "label": 0
                },
                {
                    "sent": "And it's still user friendly and collaborative.",
                    "label": 0
                },
                {
                    "sent": "So it's still a wiki.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some use cases what we are working on for this paper that we worked on was a multi lingual ontology editor.",
                    "label": 0
                },
                {
                    "sent": "Who are we?",
                    "label": 0
                },
                {
                    "sent": "Let the users manage vocabulary about geography.",
                    "label": 0
                },
                {
                    "sent": "And this is bored by all reasoning.",
                    "label": 0
                },
                {
                    "sent": "Some other use cases which are more remote from semantic web could be for instance tourist Facebook.",
                    "label": 0
                },
                {
                    "sent": "So this is more about the multilinguality aspect that one would want to see a wiki page in multiple languages.",
                    "label": 0
                },
                {
                    "sent": "In parallel, so the wiki page would be then phrases from tourist Facebook.",
                    "label": 1
                },
                {
                    "sent": "Or a more ontology like catalog of museum objects.",
                    "label": 1
                },
                {
                    "sent": "And possibly what David Karger proposed semantic web?",
                    "label": 0
                },
                {
                    "sent": "If this, then that kind of action rule systems could also be maybe implemented on this platform.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The background check.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Large that we used.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Or attempted controlled English and grammatical framework and the briefly introduced both of these.",
                    "label": 0
                },
                {
                    "sent": "Attempto controlled English is a subset of natural English, so.",
                    "label": 1
                },
                {
                    "sent": "There are certain English syntactic structures which are not allowed in this fragment, but what is allowed is mostly inspired by logic and 1st logic.",
                    "label": 0
                },
                {
                    "sent": "So we have disjunction, conjunction, negation if then.",
                    "label": 0
                },
                {
                    "sent": "And these operate on various phrasal levels.",
                    "label": 0
                },
                {
                    "sent": "You can have conjunctions of nouns and conjunction of verbs and verb phrases, relative clauses.",
                    "label": 1
                },
                {
                    "sent": "Then there are anaphoric references like pronouns, definite noun phrases which correspond to.",
                    "label": 0
                },
                {
                    "sent": "Variables and variable sharing in formal languages.",
                    "label": 1
                },
                {
                    "sent": "Various kind of quantifiers.",
                    "label": 1
                },
                {
                    "sent": "And different kinds of content words.",
                    "label": 0
                },
                {
                    "sent": "The grammar is fixed by the designers of this language.",
                    "label": 0
                },
                {
                    "sent": "With users can change the content word vocabulary.",
                    "label": 0
                },
                {
                    "sent": "One key thing with attempted controlled English is that it does not allow any structural ambiguity.",
                    "label": 0
                },
                {
                    "sent": "Every sentence that you put in gets a single parse tree, which means that we have to deal with certain natural language.",
                    "label": 0
                },
                {
                    "sent": "Ambiguity such as anaphora resolution, for instance, the sentence France borders Spain, and it borders Portugal.",
                    "label": 1
                },
                {
                    "sent": "It's not entirely clear what is it.",
                    "label": 0
                },
                {
                    "sent": "Points to but in ace it always points to the preceding nouns.",
                    "label": 0
                },
                {
                    "sent": "In this case Spain.",
                    "label": 0
                },
                {
                    "sent": "And so we deal with all kinds of classical NLP ambiguities like quantifier scope and attachment, and so, and we have developed a mapping to all sexually bidirectional mapping, so you can also verbalize all ontologies in in ACE.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "It's kind of user oriented.",
                    "label": 0
                },
                {
                    "sent": "We have documentation that describes this interpretation rules in this construction rules.",
                    "label": 0
                },
                {
                    "sent": "Explaining these's restrictions from English.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There is an example with two examples of a sentences, so one is a question.",
                    "label": 0
                },
                {
                    "sent": "And how we map them to all so we can deal with fairly complex sentences which are.",
                    "label": 0
                },
                {
                    "sent": "So relative clauses and negations on the English side and.",
                    "label": 0
                },
                {
                    "sent": "And intersections, complements and extensional quantifiers on the logic side.",
                    "label": 0
                },
                {
                    "sent": "And questions then currently.",
                    "label": 0
                },
                {
                    "sent": "So we handle subtype of questions with one query pronoun which then Maps to all class expressions.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And on top of that language, we have developed the ACE wiki system which allows you to.",
                    "label": 1
                },
                {
                    "sent": "It's a collaborative environment.",
                    "label": 0
                },
                {
                    "sent": "You can write a sentences.",
                    "label": 0
                },
                {
                    "sent": "And because the language is restricted syntactically, you have this nice look ahead editor or predictive editor that helps you complete sentence in such a way that they are syntactically correct.",
                    "label": 0
                },
                {
                    "sent": "And it basically has all the ace features.",
                    "label": 0
                },
                {
                    "sent": "It's monolinguals, just this one language.",
                    "label": 0
                },
                {
                    "sent": "Ace as a fixed grammar, which the users cannot change.",
                    "label": 1
                },
                {
                    "sent": "And it doesn't tolerate any ambiguity, so it interprets everything in one way.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now grammatical framework.",
                    "label": 0
                },
                {
                    "sent": "It's kind of a functional programming language which is optimized for.",
                    "label": 1
                },
                {
                    "sent": "Writing natural language grammars so it has.",
                    "label": 0
                },
                {
                    "sent": "Support for various natural language things like case endings and long distance dependencies.",
                    "label": 0
                },
                {
                    "sent": "And it comes with a nice and big library that already implements all this common constructs.",
                    "label": 0
                },
                {
                    "sent": "For many languages so that you can introduce them and don't have to know the details of all these languages.",
                    "label": 1
                },
                {
                    "sent": "The way it works on the language level is that.",
                    "label": 0
                },
                {
                    "sent": "You describe so-called abstract syntax, which is language neutral.",
                    "label": 0
                },
                {
                    "sent": "So the example there is border.",
                    "label": 0
                },
                {
                    "sent": "You basically say that border is a function which takes 2 arguments of type country and it creates.",
                    "label": 0
                },
                {
                    "sent": "An object of type relation, and then for each language you describe how this function is linearized or how this.",
                    "label": 0
                },
                {
                    "sent": "Function is.",
                    "label": 0
                },
                {
                    "sent": "Turned into a concrete string that can be parsed and generated.",
                    "label": 0
                },
                {
                    "sent": "And they they have to deal with things like case ending.",
                    "label": 0
                },
                {
                    "sent": "So in English you want to have a nominative case in Estonian.",
                    "label": 0
                },
                {
                    "sent": "You might want to have a genitive case in the.",
                    "label": 0
                },
                {
                    "sent": "In the subject position and the words are of course different, so you have to handle that.",
                    "label": 1
                },
                {
                    "sent": "And everything is bidirectional, so you get translation out of it so you can parse the string.",
                    "label": 0
                },
                {
                    "sent": "Into these trees which use these abstract functions.",
                    "label": 0
                },
                {
                    "sent": "And then you can linearize these trees as strings in some other language.",
                    "label": 1
                },
                {
                    "sent": "And now it has very still support, and it's quite a nice framework to work in.",
                    "label": 0
                },
                {
                    "sent": "It's very powerful, so these examples that I showed don't really cover its power.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the nice thing about this framework is this comes with this resource, library.",
                    "label": 0
                },
                {
                    "sent": "For instance, you want to generate the clause.",
                    "label": 1
                },
                {
                    "sent": "Just called this function, which takes certain arguments, noun phrase and word phrase, and.",
                    "label": 0
                },
                {
                    "sent": "And it does it for you.",
                    "label": 0
                },
                {
                    "sent": "Covers currently 30 languages.",
                    "label": 0
                },
                {
                    "sent": "So we relied on this a lot.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what we did we put this weekend chief together?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To do that, we first implemented the ace Cameron in the Chief Framework.",
                    "label": 0
                },
                {
                    "sent": "Try to cover all the languages that the Resource, Library supports.",
                    "label": 0
                },
                {
                    "sent": "But we didn't really fine tune it to any particular language, but this can be done also later.",
                    "label": 1
                },
                {
                    "sent": "By native speakers and so on.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 1
                },
                {
                    "sent": "We generalize this wiki to made it access the GF tools.",
                    "label": 0
                },
                {
                    "sent": "An added very support tool.",
                    "label": 0
                },
                {
                    "sent": "Handle multilinguality and ambiguity.",
                    "label": 0
                },
                {
                    "sent": "And also grammar editing and I will show now office.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the about the implementation of this grammar.",
                    "label": 0
                },
                {
                    "sent": "So the idea was to.",
                    "label": 0
                },
                {
                    "sent": "Have 'em have a way to go basically from.",
                    "label": 0
                },
                {
                    "sent": "From any language.",
                    "label": 0
                },
                {
                    "sent": "That is available in this multi lingual grammar interface.",
                    "label": 0
                },
                {
                    "sent": "Or back from Ace to any language, and because for Ace we have various tools such as mapping to all.",
                    "label": 0
                },
                {
                    "sent": "We can then effectively go from finish to land and back.",
                    "label": 0
                },
                {
                    "sent": "Using this grammar and this existing age tools.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here is an example for German.",
                    "label": 0
                },
                {
                    "sent": "If you have a German sentence.",
                    "label": 0
                },
                {
                    "sent": "Yeah, the slant is neat and I'm a grants this time being in land.",
                    "label": 0
                },
                {
                    "sent": "You can parse it into this GF three, so this is a tree that is specific to this grammar so the users don't see this actually.",
                    "label": 0
                },
                {
                    "sent": "But this is a way to convert the German sentence two to Ace.",
                    "label": 0
                },
                {
                    "sent": "And then the ace.",
                    "label": 0
                },
                {
                    "sent": "We can map Joel so effectively we can go from German to Alden.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For the implementation, we relied on some existing work by the creators of GF.",
                    "label": 0
                },
                {
                    "sent": "They first got this idea to describe a sin in the GF framework.",
                    "label": 0
                },
                {
                    "sent": "But we really focused on the subset of the face that can be cleanly mapped all and made sure that there's full coverage.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And currently we support about 20 languages.",
                    "label": 0
                },
                {
                    "sent": "Mostly European languages, but there are some.",
                    "label": 0
                },
                {
                    "sent": "Asian languages as well.",
                    "label": 0
                },
                {
                    "sent": "And the idea is to really make the implementation.",
                    "label": 0
                },
                {
                    "sent": "Always called the Resource, Library so that if there is some.",
                    "label": 0
                },
                {
                    "sent": "Improvement in the Resource, library.",
                    "label": 0
                },
                {
                    "sent": "We immediately benefit from it.",
                    "label": 0
                },
                {
                    "sent": "Now there are some.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Deficiencies in this implementation.",
                    "label": 1
                },
                {
                    "sent": "These anaphoric references and handling them.",
                    "label": 0
                },
                {
                    "sent": "In a.",
                    "label": 0
                },
                {
                    "sent": "In a formerly clean way is very important for Ace, but the GF framework.",
                    "label": 0
                },
                {
                    "sent": "Did not allow us to implement this.",
                    "label": 0
                },
                {
                    "sent": "Nicely, but in practice it didn't seem to be a big problem.",
                    "label": 0
                },
                {
                    "sent": "And also some of these languages are not completely covered because the resource, library did not cover all these syntactic structures that we have in Ace.",
                    "label": 0
                },
                {
                    "sent": "So this has to be done.",
                    "label": 1
                },
                {
                    "sent": "Especially like extending.",
                    "label": 0
                },
                {
                    "sent": "The library, and if you don't have competence in some of these languages, then it's very hard.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here is an translation example.",
                    "label": 0
                },
                {
                    "sent": "Every person that speaks a language X does not forget text.",
                    "label": 1
                },
                {
                    "sent": "It's a bit artificial example, but I wanted to demonstrate various things.",
                    "label": 0
                },
                {
                    "sent": "For instance, that.",
                    "label": 0
                },
                {
                    "sent": "So the negation particle in English, not German, nicht, can be in various places, and this framework handles that.",
                    "label": 0
                },
                {
                    "sent": "In Finnish, the the variable takes a case ending.",
                    "label": 0
                },
                {
                    "sent": "What comes after: in the other language doesn't happen.",
                    "label": 0
                },
                {
                    "sent": "Then in Russian, the object of the verb speak as a preposition.",
                    "label": 0
                },
                {
                    "sent": "And things like this.",
                    "label": 0
                },
                {
                    "sent": "And the outcome is.",
                    "label": 0
                },
                {
                    "sent": "Nice professional sentences.",
                    "label": 0
                },
                {
                    "sent": "These might contain some mistakes, but.",
                    "label": 0
                },
                {
                    "sent": "The idea is that even if there are mistakes, they are fixable.",
                    "label": 0
                },
                {
                    "sent": "It's like program that you can fix.",
                    "label": 0
                },
                {
                    "sent": "It's not statistical machine translation.",
                    "label": 0
                },
                {
                    "sent": "Which is very difficult to kind of influence.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How to integrate Ace Wiki with GF?",
                    "label": 0
                },
                {
                    "sent": "We are now accessing the GF tools available through web services.",
                    "label": 0
                },
                {
                    "sent": "We we changed the underlying representation in a switch used to be a sentence is now it's.",
                    "label": 0
                },
                {
                    "sent": "Sets of trees which can be then linearized so the wiki content is completely language neutral, but whoever reads it can then pick the the language in which he wants to see it, and it can also represent ambiguity.",
                    "label": 1
                },
                {
                    "sent": "So the set of trees is corresponds to an ambiguous sentence.",
                    "label": 0
                },
                {
                    "sent": "There's still the look ahead editor.",
                    "label": 0
                },
                {
                    "sent": "Which can now be used with any of the languages that are supported.",
                    "label": 0
                },
                {
                    "sent": "And we also added grammar editing.",
                    "label": 0
                },
                {
                    "sent": "This was necessary because in order to add new words to Vicki.",
                    "label": 0
                },
                {
                    "sent": "You technically need to edit the grammar.",
                    "label": 0
                },
                {
                    "sent": "But in fact you can do any changes to the comma completely changed language.",
                    "label": 0
                },
                {
                    "sent": "And grammar is just GF.",
                    "label": 1
                },
                {
                    "sent": "Grammars are very modular, so we can map Crown modules to wiki pages in quite.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Simple wait.",
                    "label": 0
                },
                {
                    "sent": "So now come some examples, screenshots.",
                    "label": 0
                },
                {
                    "sent": "Here is an example or article about the Swiss River presented in two languages, so the users can select.",
                    "label": 0
                },
                {
                    "sent": "There is a left sidebar where they can choose the language.",
                    "label": 0
                },
                {
                    "sent": "And immediately change the language of the content.",
                    "label": 0
                },
                {
                    "sent": "And if they want to change something.",
                    "label": 0
                },
                {
                    "sent": "A sentence then they can just open the lookahead editor.",
                    "label": 0
                },
                {
                    "sent": "And it proposes the next token award.",
                    "label": 0
                },
                {
                    "sent": "And the correct language.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ambiguity resolution example.",
                    "label": 0
                },
                {
                    "sent": "Sometimes it happens that.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "There is a sentence so entered by a German speaker, for instance.",
                    "label": 0
                },
                {
                    "sent": "And the German speaker does not realize that it's an ambiguous sentence.",
                    "label": 0
                },
                {
                    "sent": "In this case, so there are two completely different meanings.",
                    "label": 0
                },
                {
                    "sent": "the Rhine flows through a city that contains Switzerland or the right flows through a city that Switzerland contains.",
                    "label": 0
                },
                {
                    "sent": "So this ambiguity is revealed in another language.",
                    "label": 0
                },
                {
                    "sent": "So here we want to benefit from the fact that the wiki is a collaborative environment.",
                    "label": 0
                },
                {
                    "sent": "Somebody put in an ambiguous sentence without realizing it, but this is actually revealed in another language.",
                    "label": 0
                },
                {
                    "sent": "And we can also design.",
                    "label": 0
                },
                {
                    "sent": "A more artificial looking language, which is kind of based on German.",
                    "label": 0
                },
                {
                    "sent": "That also reveals this ambiguity, so you don't necessarily need to have another language speaker to disambiguate stuff for you.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So example of background model page in this case.",
                    "label": 0
                },
                {
                    "sent": "It's quite the top level module which lists all the abstract functions.",
                    "label": 0
                },
                {
                    "sent": "And then links this module to.",
                    "label": 0
                },
                {
                    "sent": "All the other modules while such wiki linking.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Example of a automatic question answering in Spanish and consistency checking.",
                    "label": 0
                },
                {
                    "sent": "So person as described with the landlocked countries, and then now he wants to ask questions like what is a landlocked country where is not landlocked country.",
                    "label": 0
                },
                {
                    "sent": "And maybe added an incorrect sentence such as.",
                    "label": 0
                },
                {
                    "sent": "Liechtenstein borders a country.",
                    "label": 0
                },
                {
                    "sent": "Which is not a landlocked country.",
                    "label": 0
                },
                {
                    "sent": "And this turns out to be incorrect.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We did two kinds of evaluations for this work.",
                    "label": 0
                },
                {
                    "sent": "One was to just focus on the grammar.",
                    "label": 0
                },
                {
                    "sent": "So this multi lingual grammar that can translate a sentence into lots of different languages.",
                    "label": 0
                },
                {
                    "sent": "We made sure that so we generated hundreds a sentences.",
                    "label": 0
                },
                {
                    "sent": "Make sure that discover interesting things.",
                    "label": 0
                },
                {
                    "sent": "First of all, they cover all the functions of the grammar in this grammatical constructs, and they also cover interesting all axiom structures like subclass and range and so on.",
                    "label": 0
                },
                {
                    "sent": "And the idea was to.",
                    "label": 0
                },
                {
                    "sent": "As the users, whether the translations of these sentence into other languages are correct, we also use Google Translate just to get some idea of how Google.",
                    "label": 1
                },
                {
                    "sent": "Translates these sentences.",
                    "label": 0
                },
                {
                    "sent": "Results were well.",
                    "label": 0
                },
                {
                    "sent": "Users preferred our translations, which is kind of obvious.",
                    "label": 0
                },
                {
                    "sent": "This in a way unfair study.",
                    "label": 0
                },
                {
                    "sent": "About the important thing for us was that many changes that they proposed to our translations were just stylistic.",
                    "label": 0
                },
                {
                    "sent": "So they didn't.",
                    "label": 0
                },
                {
                    "sent": "The users were not trained in attempt to control the English or the idea of control natural language, so they wanted to make the sentence look nicer.",
                    "label": 0
                },
                {
                    "sent": "But ace.",
                    "label": 0
                },
                {
                    "sent": "Wants to have certain redundancy.",
                    "label": 0
                },
                {
                    "sent": "Or more more verbose knus in some cases.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here are some examples.",
                    "label": 0
                },
                {
                    "sent": "We don't do that well in all the languages, but.",
                    "label": 0
                },
                {
                    "sent": "The problems are fixable, so in Finnish were quite good and so this shows that if one fixes the box in the grammar can get almost perfect results.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The other evaluation was.",
                    "label": 0
                },
                {
                    "sent": "We developed 500 words geography vocabulary in three languages.",
                    "label": 0
                },
                {
                    "sent": "Then we asked users.",
                    "label": 0
                },
                {
                    "sent": "We have 30 users.",
                    "label": 0
                },
                {
                    "sent": "Do you write?",
                    "label": 0
                },
                {
                    "sent": "Into the victim and tagged him either true or false.",
                    "label": 1
                },
                {
                    "sent": "Whether the sentence that they added was true.",
                    "label": 0
                },
                {
                    "sent": "In their opinion or false?",
                    "label": 0
                },
                {
                    "sent": "And the same users also were asked to look at an article where somebody else had put in sentences.",
                    "label": 1
                },
                {
                    "sent": "And taxis is true or false, and these sentences that they saw in some case in one case where translated in the other case where the originals.",
                    "label": 0
                },
                {
                    "sent": "So we wanted to see whether translation affects the agreement.",
                    "label": 0
                },
                {
                    "sent": "And it did not, which was.",
                    "label": 0
                },
                {
                    "sent": "Nice verification and also the.",
                    "label": 0
                },
                {
                    "sent": "The nice thing was that the users discovered all the functions of the camera, so they really used all the constructs so they were not.",
                    "label": 0
                },
                {
                    "sent": "These constructs were discoverable through the lookahead editor.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I think there's a lot of future work to be done.",
                    "label": 0
                },
                {
                    "sent": "One thing is to generalize this architecture to handle other kinds of grammars our grammar.",
                    "label": 1
                },
                {
                    "sent": "Well, so wikis kind of optimized for such ontology editing.",
                    "label": 1
                },
                {
                    "sent": "Also improve the collaborative grammar editing features currently, or editing the chief source code, basically which is.",
                    "label": 1
                },
                {
                    "sent": "Not that user friendly.",
                    "label": 0
                },
                {
                    "sent": "Reasoning can be used to improve ambiguity management.",
                    "label": 0
                },
                {
                    "sent": "And the wiki content itself can somehow should be made to contribute back to the.",
                    "label": 0
                },
                {
                    "sent": "Design of the lookahead editor and maybe help documentation for.",
                    "label": 0
                },
                {
                    "sent": "And you users.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is my last slide just to.",
                    "label": 0
                },
                {
                    "sent": "Provide some links.",
                    "label": 0
                },
                {
                    "sent": "All the software that we developed is open source and on kitap typically so it can be easily forked.",
                    "label": 0
                },
                {
                    "sent": "So I talked about multilingual Ace grammar.",
                    "label": 1
                },
                {
                    "sent": "Source code is available multilingual, senile based semantic wiki engine.",
                    "label": 1
                },
                {
                    "sent": "We did this in a. EU project called Malta, which just finishes in two days.",
                    "label": 0
                },
                {
                    "sent": "Our deliverable's are in work package 11.",
                    "label": 0
                },
                {
                    "sent": "There is more information about this evaluation there.",
                    "label": 0
                },
                {
                    "sent": "And there are two general projects underlying all this attempted project and the grammatical framework project.",
                    "label": 0
                },
                {
                    "sent": "But if you're interested in the grammatical framework, then there is a summer school this August.",
                    "label": 0
                },
                {
                    "sent": "In Bavaria check out the link.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "So every sentence that's written in Ace is that a?",
                    "label": 0
                },
                {
                    "sent": "Constructed natural language or constraint.",
                    "label": 0
                },
                {
                    "sent": "Sorry natural language sentence.",
                    "label": 0
                },
                {
                    "sent": "Yes, in the sense that it has a formal grammar.",
                    "label": 0
                },
                {
                    "sent": "It does a formal grammar.",
                    "label": 0
                },
                {
                    "sent": "So it's built, so there's no content that's just typed in as on Wikipedia, for example.",
                    "label": 0
                },
                {
                    "sent": "Say again all of the all of the human readable content on Ace wiki is generated through a constrained natural language.",
                    "label": 0
                },
                {
                    "sent": "Yes, OK, interesting.",
                    "label": 0
                },
                {
                    "sent": "Have you done studies on the General Express ability of this in any language?",
                    "label": 0
                },
                {
                    "sent": "Do people do people feel that they can express everything they wish to express in a constrained natural language on the wiki?",
                    "label": 0
                },
                {
                    "sent": "They definitely cannot, so this is something that our traditions show little does that vary between languages.",
                    "label": 0
                },
                {
                    "sent": "Do you have any idea that might work better in?",
                    "label": 0
                },
                {
                    "sent": "Don't know and my final question is, do you showed that it worked better in some languages?",
                    "label": 0
                },
                {
                    "sent": "Another you would slide with different, yet we just missed it.",
                    "label": 0
                },
                {
                    "sent": "Here you go and you mentioned that one factor was how much it was fixed.",
                    "label": 0
                },
                {
                    "sent": "You said finish by 4 if for example with finish.",
                    "label": 0
                },
                {
                    "sent": "If I recall what you said correctly.",
                    "label": 0
                },
                {
                    "sent": "That had succeeded because people were able to tweak the code out.",
                    "label": 0
                },
                {
                    "sent": "Fine tuned, correct the programming code.",
                    "label": 0
                },
                {
                    "sent": "Is.",
                    "label": 0
                },
                {
                    "sent": "Not a wiki users, but administrators this client over the designers of the Resource, library.",
                    "label": 0
                },
                {
                    "sent": "OK, they were finished.",
                    "label": 0
                },
                {
                    "sent": "I take it and they couldn't make it this week.",
                    "label": 0
                },
                {
                    "sent": "Is there nothing inherent of the grammar of the languages themselves that cause varying automatic translate ability?",
                    "label": 0
                },
                {
                    "sent": "I'm not sure well there must be some things, but all all languages share certain things like coordination, negation and relative clauses, and we rely on that basically.",
                    "label": 0
                },
                {
                    "sent": "A very simple question.",
                    "label": 0
                },
                {
                    "sent": "Where did do you get your dictionaries from?",
                    "label": 0
                },
                {
                    "sent": "For all these languages and dictionaries might be well usable everywhere, so you might use general ones, right?",
                    "label": 0
                },
                {
                    "sent": "Yes, so there is work on extracting lexicons from.",
                    "label": 0
                },
                {
                    "sent": "Wordnet and so on.",
                    "label": 0
                },
                {
                    "sent": "And we did this also in the multi project.",
                    "label": 0
                },
                {
                    "sent": "But for this evaluation we just hand coded it.",
                    "label": 0
                },
                {
                    "sent": "We use an Excel spreadsheet to create the lexicon of 500 words.",
                    "label": 0
                },
                {
                    "sent": "About geography, that's how we made it, but.",
                    "label": 0
                },
                {
                    "sent": "Ideally, such things should be.",
                    "label": 0
                },
                {
                    "sent": "Imported from somewhere.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "OK thanks, so we are exactly in time, so let's thank the speaker again.",
                    "label": 0
                }
            ]
        }
    }
}