{
    "id": "b74s5xkjqhuzb5aiibm5ieqmr2v2caav",
    "title": "Wisdom of the Crowds - What to make of web-based sentiment?",
    "info": {
        "author": [
            "Ulli F. P. Spankowski, Börse Stuttgart AG"
        ],
        "published": "April 11, 2012",
        "recorded": "March 2012",
        "category": [
            "Top->Computer Science->Crowdsourcing"
        ]
    },
    "url": "http://videolectures.net/firstworkshop2012_spankowski_wisdom/",
    "segmentation": [
        [
            "Thank you very much.",
            "First of all for your attention and for your patience.",
            "We've been a little bit overtime.",
            "My name is only Fredrik Paulsen, Kowski, I'm associate director at Stuttgart Financial, which is part of versus Stuttgart Group and in the next couple of minutes I'll present you what else we can do with web based sentiment analysis and I would like to start this presentation with the short experiment.",
            "It's a little bit of a strange experiment 'cause I would like all of you to leave and I would like you to go home.",
            "But don't get too excited.",
            "It's an hypothetical experiment, so please stay here and let's just suppose you go home like it's been a long day, and it's been very interesting conference here and have met a lot of interesting people.",
            "Maybe you have a short coffee later, but then eventually you go home.",
            "And when you arrive at home, it's around 6:37 o'clock.",
            "You sit down on your sofa, you relax, turn on the television and on the television you might switch to.",
            "Kind of chinqua.",
            "I think you have it here and you will see Jerry Scotti and you will see Gerry Scotti in his show.",
            "Who wants to be a millionaire?",
            "And in this show, like every other day before, during the week you see a candidate.",
            "This candidate really suffers and tries hard to win the million right?",
            "He has to answer a lot of questions, but eventually he will come to a point where he will not be able to.",
            "Answer the question anymore and then there are several choices.",
            "One of them is the Joker.",
            "He can ask the audience.",
            "And he will ask the audience an if he's or she is a lucky person.",
            "The audience is, let's suppose, averagely intelligent and.",
            "Let's suppose the question is not too hard.",
            "Then the audience can decide which will be the right question and."
        ],
        [
            "After I don't know a couple of seconds, there eventually will be an answer, and in most of the times the audience is not performing too bad.",
            "So what did we learn from that?",
            "If you ask more people eventually if the question is not too hard, he will get the right answer.",
            "So I could ask you about the stock prices for tomorrow and then I will just become rich because you tell me the right answer, right?",
            "So yeah.",
            "Of course I overestimated, but that doesn't mean that you're you're over intelligent, I'm pretty sure, but it's just a matter that the question is too hard.",
            "Plus, we all know that nobody can predict the future.",
            "However, what you can do, and you can do that a lot better than I. I have less information about tomorrow, tomorrow, stock market prices, then all of us together because if the group gets bigger and bigger and the swarm, you might also call group or Swarm intelligence gets bigger.",
            "There is more and more information incorporated and I could actually ask you about relevant information about what's happening.",
            "You can tell me the stock prices for tomorrow, but you can give me information about what's happening tomorrow.",
            "So if I have more information about what's happening tomorrow.",
            "Maybe some of you know that there will be a large corporate event at Uni Credit or any other interesting information that could move stock prices.",
            "We could collect all this information and collect it, filter it, analyze it, and then at the end we could actually have something that helps us in our decision making process.",
            "And this is exactly what we're trying to do and what you see on the slide.",
            "This is what we're trying to do with.",
            "First we try to collect and filter and.",
            "Analyze data that helps us to make decisions in the financial decision making process.",
            "So we are lucky not like the guy with Gerry Scotti.",
            "The audience is not restricted.",
            "The audience is huge.",
            "The audience is the Internet.",
            "It's the web.",
            "So we are enormously lucky to have a huge data source.",
            "This is basically what the project is about.",
            "I forgot one very important thing before I started on your chairs.",
            "You see the questionnaires and I would kindly remind you if you could maybe fill out the questionnaire so we can improve our process here of the first project.",
            "And if you're too tired, which I totally understand, just leave us your email address on the questionnaires and we can give you further information about our research progress.",
            "So let's."
        ],
        [
            "Get back to the let's get back to the presentation.",
            "As you can see here, the field we are researching and it's not completely new.",
            "It's here.",
            "I just put a couple of newspaper articles and you can see that it's been years that the research was going on in machine learning and sentiment extraction.",
            "And of course it gets more and more important.",
            "They are already hedge funds trading on Twitter, so this was probably referring to the question that.",
            "You ask before there are already market participants that take sentiment from the web and trade on it.",
            "There are London based hedge funds that try to make money on that so you can see that it's been on for quite awhile, but."
        ],
        [
            "The market is getting bigger and bigger and and everybody is getting more and more interested in this field and you can see here just a couple of logos that are all companies that provide interesting information about Twitter based information which is related to the financial markets."
        ],
        [
            "Also, we've heard before that algorithmic trading is a very, very important point that goes together with information, so companies are now.",
            "Structuring data they use semi structured data and.",
            "Provide this data in a way that algorithms can read it a lot better.",
            "And of course a lot faster than we can, so let's just switch over."
        ],
        [
            "To the real interesting part, what else we can do with the Twitter sentiment and what you can see here on this slide is.",
            "Two occult tweet minister and this is actually a real interesting thing because during the 2010 elections in the UK there has been this tool and what they did, they collected tweets.",
            "They collected tweets from 433 of the candidates that were, well, the candidates for the UK elections.",
            "Of the total 650 I guess and.",
            "They were collecting the tweets and analyzing them for positive and negative sentiment and also counting the amount and tried to get a prediction of what the result of the election might be.",
            "And as you can see on the right hand side the.",
            "The results was that it was Conservatives, 35% Labour, 30 and Liberal Democrats 27% and the others were 8% and the actual results after the UK election.",
            "You can see on the bottom and you can see that there has been.",
            "A pretty good guess of this Twitter tool for predicting the elections, and this has been six weeks before the election during like the Election Day and the longer it went, the better were the predictions and the most interesting thing about this is that you know that each country has, like opinion polls for Election Day and during the whole day there giving statuses about who might be winning, who might be losing.",
            "This tool actually.",
            "Beat all of them except for one.",
            "So this tool was better than most of the regular opinion polls that you had for the outcome of the election.",
            "So this is another area not related to finance, which is really interesting where this technology can also be used on the next."
        ],
        [
            "Slide you see a very weird looking graph.",
            "The researchers who conducted this who conducted the study collected over 100 million news article News article which were published news articles which were available online, and they analyzed all of those news article in two ways.",
            "One was mood, positive negative and the other was location.",
            "Which location was mentioned in the articles and after they had analyzed these two Mouton location, they averaged a sentiment index of those news articles and what you can see here is, for instance the sentiment of Egypt.",
            "So what they did from 1979 till January 2011 the average all news articles which mentioned City.",
            "In Egypt, and then they created this sentiment of Egyptian newspaper articles.",
            "And of course you get an average overtime and you get a deviation.",
            "Sometimes if something good or bad happens.",
            "So what you can see here, there are like three major bad events that were happening in January 91 in January 2003, and it always seems to be January well.",
            "January 2011 one was the first one is connected to the Iraq war.",
            "The second one was to the bombardment again.",
            "Iraq and the last one interesting.",
            "Lee was in January 4 weeks before President Mubarak rejoined Re not Rejoint resigned, resigned from his presidency so.",
            "Um, this analysis was conducted ex post, of course, but there is a tendency, as you can also see in our project that you could do this real time.",
            "You could do this, or near real time that you could actually analyze news data feeds that fast as you've seen before, if news can be processed that way.",
            "There's also the possibility to do this.",
            "Um?"
        ],
        [
            "Our next example is also pretty interesting.",
            "Um?",
            "It means that Twitter or persons can be much more accurate in predicting the geographical center of an earthquake than the regular state of the art physical detection tools.",
            "What those researchers did, they said OK, every human being which uses Twitter is like a little sensor wandering around.",
            "And once you realize the natural catastrofe.",
            "Maybe an earthquake in this case, maybe a tornado something like this you start Twittering and the closer in the case of the earthquake, the closer you are to the earthquake to the center of the earthquake.",
            "The more people would Twitter in this area because they actually sense it.",
            "Their little sensors so you can result basically said that you can be more precise in predicting the exact center of an earthquake.",
            "By using Twitter then by using the commercial the regular physical tools that they have.",
            "Am the bad thing, however, is that if the sensors are too close to the center, you might only be able to use them once, which is not so nice, but."
        ],
        [
            "Let me come to the last example of how we could use this web based sentiment and this is also really interesting.",
            "It also goes into the geographical direction.",
            "What you can see on this slide is a map map of the world, and again it's the researcher that also did the prediction of the Egyptian Revolution of the Arab Spring.",
            "That could also.",
            "Track down where Osama bin Laden was found.",
            "Well, he couldn't track down exactly where he was found, but he could track down where Osama bin Laden has been hiding.",
            "Four to six weeks before that.",
            "Not even six months before that, they knew that it had to be in a 200 kilometer range of where he actually was captured.",
            "What he did is again he read all the news articles which were related to Osama bin Laden, and he was checking where they were from, and everybody was thinking, OK, Osama bin Laden is hiding behind some rocks somewhere in Afghanistan, right?",
            "Well.",
            "He was actually found not in Afghanistan, but in Pakistan.",
            "From the research that they did, 49% of the articles contained Pakistan as the possible area where Osama bin Laden is hiding the top two cities which were mentioned were not somewhere in Afghanistan, who wasn't Kabul or anything like that.",
            "But it was Islamabad and Per Sheva which are both in northern Pakistan so.",
            "At the end where he was captured at Auto Berf.",
            "Something like this?",
            "It's just 200 kilometers away from the cities that were actually on the top top list.",
            "The top two cities where were people writing about it for articles where the city was mentioned in combination with the name of Osama bin Laden, so you could see that these are some examples that go way beyond our financial thinking.",
            "I mean, we're all coming from the financial domain when we.",
            "See a tool as has been presented so far here.",
            "They're all little dollar signs coming in our eyes because we think they could be used commercially very well, but there are also a lot of other areas where we could use the technology that we're currently developing, so."
        ],
        [
            "So again, here is the overview.",
            "The really interesting point about the first project is that we combine the unstructured data from the web with hard fact data that's already there, and this hasn't been done so far.",
            "So this is like the big one of the big motivations behind it, so thanks."
        ],
        [
            "Very much for your attention and thanks a lot for your patience."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "First of all for your attention and for your patience.",
                    "label": 0
                },
                {
                    "sent": "We've been a little bit overtime.",
                    "label": 0
                },
                {
                    "sent": "My name is only Fredrik Paulsen, Kowski, I'm associate director at Stuttgart Financial, which is part of versus Stuttgart Group and in the next couple of minutes I'll present you what else we can do with web based sentiment analysis and I would like to start this presentation with the short experiment.",
                    "label": 0
                },
                {
                    "sent": "It's a little bit of a strange experiment 'cause I would like all of you to leave and I would like you to go home.",
                    "label": 0
                },
                {
                    "sent": "But don't get too excited.",
                    "label": 0
                },
                {
                    "sent": "It's an hypothetical experiment, so please stay here and let's just suppose you go home like it's been a long day, and it's been very interesting conference here and have met a lot of interesting people.",
                    "label": 0
                },
                {
                    "sent": "Maybe you have a short coffee later, but then eventually you go home.",
                    "label": 0
                },
                {
                    "sent": "And when you arrive at home, it's around 6:37 o'clock.",
                    "label": 0
                },
                {
                    "sent": "You sit down on your sofa, you relax, turn on the television and on the television you might switch to.",
                    "label": 0
                },
                {
                    "sent": "Kind of chinqua.",
                    "label": 0
                },
                {
                    "sent": "I think you have it here and you will see Jerry Scotti and you will see Gerry Scotti in his show.",
                    "label": 0
                },
                {
                    "sent": "Who wants to be a millionaire?",
                    "label": 0
                },
                {
                    "sent": "And in this show, like every other day before, during the week you see a candidate.",
                    "label": 0
                },
                {
                    "sent": "This candidate really suffers and tries hard to win the million right?",
                    "label": 0
                },
                {
                    "sent": "He has to answer a lot of questions, but eventually he will come to a point where he will not be able to.",
                    "label": 0
                },
                {
                    "sent": "Answer the question anymore and then there are several choices.",
                    "label": 0
                },
                {
                    "sent": "One of them is the Joker.",
                    "label": 0
                },
                {
                    "sent": "He can ask the audience.",
                    "label": 0
                },
                {
                    "sent": "And he will ask the audience an if he's or she is a lucky person.",
                    "label": 0
                },
                {
                    "sent": "The audience is, let's suppose, averagely intelligent and.",
                    "label": 0
                },
                {
                    "sent": "Let's suppose the question is not too hard.",
                    "label": 0
                },
                {
                    "sent": "Then the audience can decide which will be the right question and.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "After I don't know a couple of seconds, there eventually will be an answer, and in most of the times the audience is not performing too bad.",
                    "label": 0
                },
                {
                    "sent": "So what did we learn from that?",
                    "label": 0
                },
                {
                    "sent": "If you ask more people eventually if the question is not too hard, he will get the right answer.",
                    "label": 0
                },
                {
                    "sent": "So I could ask you about the stock prices for tomorrow and then I will just become rich because you tell me the right answer, right?",
                    "label": 0
                },
                {
                    "sent": "So yeah.",
                    "label": 0
                },
                {
                    "sent": "Of course I overestimated, but that doesn't mean that you're you're over intelligent, I'm pretty sure, but it's just a matter that the question is too hard.",
                    "label": 0
                },
                {
                    "sent": "Plus, we all know that nobody can predict the future.",
                    "label": 0
                },
                {
                    "sent": "However, what you can do, and you can do that a lot better than I. I have less information about tomorrow, tomorrow, stock market prices, then all of us together because if the group gets bigger and bigger and the swarm, you might also call group or Swarm intelligence gets bigger.",
                    "label": 0
                },
                {
                    "sent": "There is more and more information incorporated and I could actually ask you about relevant information about what's happening.",
                    "label": 0
                },
                {
                    "sent": "You can tell me the stock prices for tomorrow, but you can give me information about what's happening tomorrow.",
                    "label": 0
                },
                {
                    "sent": "So if I have more information about what's happening tomorrow.",
                    "label": 0
                },
                {
                    "sent": "Maybe some of you know that there will be a large corporate event at Uni Credit or any other interesting information that could move stock prices.",
                    "label": 0
                },
                {
                    "sent": "We could collect all this information and collect it, filter it, analyze it, and then at the end we could actually have something that helps us in our decision making process.",
                    "label": 0
                },
                {
                    "sent": "And this is exactly what we're trying to do and what you see on the slide.",
                    "label": 0
                },
                {
                    "sent": "This is what we're trying to do with.",
                    "label": 0
                },
                {
                    "sent": "First we try to collect and filter and.",
                    "label": 0
                },
                {
                    "sent": "Analyze data that helps us to make decisions in the financial decision making process.",
                    "label": 0
                },
                {
                    "sent": "So we are lucky not like the guy with Gerry Scotti.",
                    "label": 0
                },
                {
                    "sent": "The audience is not restricted.",
                    "label": 0
                },
                {
                    "sent": "The audience is huge.",
                    "label": 0
                },
                {
                    "sent": "The audience is the Internet.",
                    "label": 0
                },
                {
                    "sent": "It's the web.",
                    "label": 0
                },
                {
                    "sent": "So we are enormously lucky to have a huge data source.",
                    "label": 0
                },
                {
                    "sent": "This is basically what the project is about.",
                    "label": 0
                },
                {
                    "sent": "I forgot one very important thing before I started on your chairs.",
                    "label": 0
                },
                {
                    "sent": "You see the questionnaires and I would kindly remind you if you could maybe fill out the questionnaire so we can improve our process here of the first project.",
                    "label": 0
                },
                {
                    "sent": "And if you're too tired, which I totally understand, just leave us your email address on the questionnaires and we can give you further information about our research progress.",
                    "label": 0
                },
                {
                    "sent": "So let's.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Get back to the let's get back to the presentation.",
                    "label": 0
                },
                {
                    "sent": "As you can see here, the field we are researching and it's not completely new.",
                    "label": 0
                },
                {
                    "sent": "It's here.",
                    "label": 0
                },
                {
                    "sent": "I just put a couple of newspaper articles and you can see that it's been years that the research was going on in machine learning and sentiment extraction.",
                    "label": 0
                },
                {
                    "sent": "And of course it gets more and more important.",
                    "label": 0
                },
                {
                    "sent": "They are already hedge funds trading on Twitter, so this was probably referring to the question that.",
                    "label": 0
                },
                {
                    "sent": "You ask before there are already market participants that take sentiment from the web and trade on it.",
                    "label": 0
                },
                {
                    "sent": "There are London based hedge funds that try to make money on that so you can see that it's been on for quite awhile, but.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The market is getting bigger and bigger and and everybody is getting more and more interested in this field and you can see here just a couple of logos that are all companies that provide interesting information about Twitter based information which is related to the financial markets.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, we've heard before that algorithmic trading is a very, very important point that goes together with information, so companies are now.",
                    "label": 0
                },
                {
                    "sent": "Structuring data they use semi structured data and.",
                    "label": 0
                },
                {
                    "sent": "Provide this data in a way that algorithms can read it a lot better.",
                    "label": 0
                },
                {
                    "sent": "And of course a lot faster than we can, so let's just switch over.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To the real interesting part, what else we can do with the Twitter sentiment and what you can see here on this slide is.",
                    "label": 0
                },
                {
                    "sent": "Two occult tweet minister and this is actually a real interesting thing because during the 2010 elections in the UK there has been this tool and what they did, they collected tweets.",
                    "label": 0
                },
                {
                    "sent": "They collected tweets from 433 of the candidates that were, well, the candidates for the UK elections.",
                    "label": 0
                },
                {
                    "sent": "Of the total 650 I guess and.",
                    "label": 0
                },
                {
                    "sent": "They were collecting the tweets and analyzing them for positive and negative sentiment and also counting the amount and tried to get a prediction of what the result of the election might be.",
                    "label": 0
                },
                {
                    "sent": "And as you can see on the right hand side the.",
                    "label": 0
                },
                {
                    "sent": "The results was that it was Conservatives, 35% Labour, 30 and Liberal Democrats 27% and the others were 8% and the actual results after the UK election.",
                    "label": 1
                },
                {
                    "sent": "You can see on the bottom and you can see that there has been.",
                    "label": 0
                },
                {
                    "sent": "A pretty good guess of this Twitter tool for predicting the elections, and this has been six weeks before the election during like the Election Day and the longer it went, the better were the predictions and the most interesting thing about this is that you know that each country has, like opinion polls for Election Day and during the whole day there giving statuses about who might be winning, who might be losing.",
                    "label": 0
                },
                {
                    "sent": "This tool actually.",
                    "label": 0
                },
                {
                    "sent": "Beat all of them except for one.",
                    "label": 0
                },
                {
                    "sent": "So this tool was better than most of the regular opinion polls that you had for the outcome of the election.",
                    "label": 0
                },
                {
                    "sent": "So this is another area not related to finance, which is really interesting where this technology can also be used on the next.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Slide you see a very weird looking graph.",
                    "label": 0
                },
                {
                    "sent": "The researchers who conducted this who conducted the study collected over 100 million news article News article which were published news articles which were available online, and they analyzed all of those news article in two ways.",
                    "label": 0
                },
                {
                    "sent": "One was mood, positive negative and the other was location.",
                    "label": 0
                },
                {
                    "sent": "Which location was mentioned in the articles and after they had analyzed these two Mouton location, they averaged a sentiment index of those news articles and what you can see here is, for instance the sentiment of Egypt.",
                    "label": 0
                },
                {
                    "sent": "So what they did from 1979 till January 2011 the average all news articles which mentioned City.",
                    "label": 0
                },
                {
                    "sent": "In Egypt, and then they created this sentiment of Egyptian newspaper articles.",
                    "label": 0
                },
                {
                    "sent": "And of course you get an average overtime and you get a deviation.",
                    "label": 0
                },
                {
                    "sent": "Sometimes if something good or bad happens.",
                    "label": 0
                },
                {
                    "sent": "So what you can see here, there are like three major bad events that were happening in January 91 in January 2003, and it always seems to be January well.",
                    "label": 0
                },
                {
                    "sent": "January 2011 one was the first one is connected to the Iraq war.",
                    "label": 0
                },
                {
                    "sent": "The second one was to the bombardment again.",
                    "label": 0
                },
                {
                    "sent": "Iraq and the last one interesting.",
                    "label": 0
                },
                {
                    "sent": "Lee was in January 4 weeks before President Mubarak rejoined Re not Rejoint resigned, resigned from his presidency so.",
                    "label": 0
                },
                {
                    "sent": "Um, this analysis was conducted ex post, of course, but there is a tendency, as you can also see in our project that you could do this real time.",
                    "label": 0
                },
                {
                    "sent": "You could do this, or near real time that you could actually analyze news data feeds that fast as you've seen before, if news can be processed that way.",
                    "label": 0
                },
                {
                    "sent": "There's also the possibility to do this.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our next example is also pretty interesting.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "It means that Twitter or persons can be much more accurate in predicting the geographical center of an earthquake than the regular state of the art physical detection tools.",
                    "label": 0
                },
                {
                    "sent": "What those researchers did, they said OK, every human being which uses Twitter is like a little sensor wandering around.",
                    "label": 0
                },
                {
                    "sent": "And once you realize the natural catastrofe.",
                    "label": 0
                },
                {
                    "sent": "Maybe an earthquake in this case, maybe a tornado something like this you start Twittering and the closer in the case of the earthquake, the closer you are to the earthquake to the center of the earthquake.",
                    "label": 0
                },
                {
                    "sent": "The more people would Twitter in this area because they actually sense it.",
                    "label": 0
                },
                {
                    "sent": "Their little sensors so you can result basically said that you can be more precise in predicting the exact center of an earthquake.",
                    "label": 0
                },
                {
                    "sent": "By using Twitter then by using the commercial the regular physical tools that they have.",
                    "label": 0
                },
                {
                    "sent": "Am the bad thing, however, is that if the sensors are too close to the center, you might only be able to use them once, which is not so nice, but.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let me come to the last example of how we could use this web based sentiment and this is also really interesting.",
                    "label": 0
                },
                {
                    "sent": "It also goes into the geographical direction.",
                    "label": 0
                },
                {
                    "sent": "What you can see on this slide is a map map of the world, and again it's the researcher that also did the prediction of the Egyptian Revolution of the Arab Spring.",
                    "label": 0
                },
                {
                    "sent": "That could also.",
                    "label": 0
                },
                {
                    "sent": "Track down where Osama bin Laden was found.",
                    "label": 1
                },
                {
                    "sent": "Well, he couldn't track down exactly where he was found, but he could track down where Osama bin Laden has been hiding.",
                    "label": 0
                },
                {
                    "sent": "Four to six weeks before that.",
                    "label": 0
                },
                {
                    "sent": "Not even six months before that, they knew that it had to be in a 200 kilometer range of where he actually was captured.",
                    "label": 0
                },
                {
                    "sent": "What he did is again he read all the news articles which were related to Osama bin Laden, and he was checking where they were from, and everybody was thinking, OK, Osama bin Laden is hiding behind some rocks somewhere in Afghanistan, right?",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "He was actually found not in Afghanistan, but in Pakistan.",
                    "label": 0
                },
                {
                    "sent": "From the research that they did, 49% of the articles contained Pakistan as the possible area where Osama bin Laden is hiding the top two cities which were mentioned were not somewhere in Afghanistan, who wasn't Kabul or anything like that.",
                    "label": 0
                },
                {
                    "sent": "But it was Islamabad and Per Sheva which are both in northern Pakistan so.",
                    "label": 0
                },
                {
                    "sent": "At the end where he was captured at Auto Berf.",
                    "label": 0
                },
                {
                    "sent": "Something like this?",
                    "label": 0
                },
                {
                    "sent": "It's just 200 kilometers away from the cities that were actually on the top top list.",
                    "label": 0
                },
                {
                    "sent": "The top two cities where were people writing about it for articles where the city was mentioned in combination with the name of Osama bin Laden, so you could see that these are some examples that go way beyond our financial thinking.",
                    "label": 0
                },
                {
                    "sent": "I mean, we're all coming from the financial domain when we.",
                    "label": 0
                },
                {
                    "sent": "See a tool as has been presented so far here.",
                    "label": 0
                },
                {
                    "sent": "They're all little dollar signs coming in our eyes because we think they could be used commercially very well, but there are also a lot of other areas where we could use the technology that we're currently developing, so.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So again, here is the overview.",
                    "label": 0
                },
                {
                    "sent": "The really interesting point about the first project is that we combine the unstructured data from the web with hard fact data that's already there, and this hasn't been done so far.",
                    "label": 0
                },
                {
                    "sent": "So this is like the big one of the big motivations behind it, so thanks.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Very much for your attention and thanks a lot for your patience.",
                    "label": 0
                }
            ]
        }
    }
}