{
    "id": "bb4hpuncroy5qdnkojyaqeola7muc232",
    "title": "Current Approaches to Personalized Web Search",
    "info": {
        "author": [
            "Paul-Alexandre Chirita, Leibniz University of Hannover"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "May 2006",
        "category": [
            "Top->Computer Science->Information Retrieval",
            "Top->Computer Science->Web Mining"
        ]
    },
    "url": "http://videolectures.net/fws06_chirita_capws/",
    "segmentation": [
        [
            "OK, so we are going to start with personalized web search.",
            "This talk is a bit different from what we've seen so far.",
            "I'm not really going to focus on what we do on this area.",
            "We have bought 4 papers but rather on getting an overview and then trying to sketch some future directions.",
            "And the hope is that in the end you will dismiss some of these directions and hopefully also suggest some other ones.",
            "OK, so what's this personalized search about?"
        ],
        [
            "Let's say we have this query Canon book I took on Yahoo example because it's really good.",
            "So what do we get?",
            "We get bookstores.",
            "We get a blog about some sci-fi book.",
            "We get the page about music too, about photography, about Canon camera.",
            "One literature, it's literature book about Shakespeare and religious page good sampling.",
            "But if I'm interested only in music, it's not really useful.",
            "So personalization says that if I send the same query but I."
        ],
        [
            "So have a user profile at the search engine side or at the client side, but which is taken into account.",
            "Then I get all the results about my interest music in this case.",
            "Besides the study by Search Engine Watch, I think last year said that 80% of the users would actually prefer to have this thing available.",
            "OK, now that we know."
        ],
        [
            "Where we are.",
            "Let's see what we're talking about, so I'm going to start with user profiling.",
            "I think this is an important component, which is a bit negligent in the personalized search papers, and then we're going to see three areas, three directions to do the personalization.",
            "First is to build it in Pagerank itself, then to filter out all the results which are not interesting, and then to use the personalization itself as a different ranking factor.",
            "And then of course, sketch these future directions I mentioned.",
            "OK."
        ],
        [
            "So briefly, about profiling for profiling, we have really a lot of sources."
        ],
        [
            "A lot of data we have log behavior.",
            "Total visit time clicks, bookmarks.",
            "Client location can be relatively easily gathered.",
            "Previous queries and some client side data which is even richer.",
            "So we have a lot of stuff and we even have a lot of good algorithms to infer the profiles.",
            "This inference process is actually done in 2 steps.",
            "First you do some cleaning like for HTTP the requests for images and stuff like that and then you apply the machine learning goal statistics and get some representative user profile.",
            "Now the problem is that most of the papers stop here.",
            "Or start from here.",
            "So there is not real real coupling between the papers on personal personalized search and the papers on user profiling these areas, I guess should be more coupled in the future.",
            "Anyway, um, the papers which focus on personalized search, because this is our goal here, usually consider the profile explained either with categories with a list of URLs.",
            "This is the most popular approach.",
            "The bag of words and even more complex stuff.",
            "I also put some references here, but I guess they are not visible.",
            "Idea was to have them online such that you can use them afterwards.",
            "OK, so."
        ],
        [
            "So so now the main thing the personalization.",
            "Oh, this was changed anyway."
        ],
        [
            "So the biased Pagerank was proposed even from the very beginning.",
            "I guess everybody knows this formula and bias page rank means that in this evector you don't have a uniform distribution.",
            "The profile is usually expressed as a list of URLs.",
            "As I said, of course you can do various weights for this in the vector.",
            "You get pretty good with results with that, it seems nobody.",
            "Actually, I think nobody really tested that.",
            "But you get a lot of disadvantages.",
            "First, it's really time consuming to you do that for all users, and it's a lot of space to store one personalized Pagerank vector for each person.",
            "Um?",
            "OK, so then."
        ],
        [
            "Many extensions came after this, the first popular one was topic sensitive Pagerank.",
            "The idea here is that you bias Pagerank on each of the 16 top level categories of ODP.",
            "And then at runtime you compute the similarity between the query and each of these categories.",
            "And you use this similarity scores to combine these 16 vectors into one which you then use to rank the results.",
            "The good part is that this is really an adaptive algorithm.",
            "It's probably the only one which adapts to the query.",
            "The bad part is that it's not really personalization, at least not this basic form, but All in all, all users would get the same results.",
            "It's so it's adaptive to the query.",
            "Not to the user.",
            "And of course, it's limited to these 16 broad categories.",
            "There were many other papers on this.",
            "I won't insist on them.",
            "You can bias on preferred URL domains.",
            "You can bias on hubs.",
            "You can basically bias on anything.",
            "Lay."
        ],
        [
            "After we got.",
            "Another approach to make this scalable so.",
            "Their basic idea was to express the personalized Pagerank vector for a set S as a linear combination of simpler personalized page rank vectors.",
            "These ones, which they call basis hub vectors and they are computing with using only one non zero entry in the evector.",
            "Namely, for this node V. And then these vectors still occupy a lot of space.",
            "So the idea was then to split them into a hub.",
            "Skeletonwitch is common to everybody, and it's stored offline, and the partial vector which encodes the specifically the specificity of each user.",
            "Still, this was pretty time consuming.",
            "We worked with it and those who work with it now.",
            "It's not really scalable, even though they say it is.",
            "So."
        ],
        [
            "A few papers came afterwards.",
            "First, there was a paper on sampling.",
            "Actually, there were two one on the web algorithms Workshop and one in the Journal Internet mathematics.",
            "The idea here was.",
            "That if you want to compute this basis vector, this personalized Pagerank vector for only one on zero entry in node U, then the.",
            "A random walk of length K would end in a node V with a probability equal to the personalized page rank of that node B.",
            "This was OK, but this was still an approximation because to compute that you basically approximate the scores, so better approximations came up this year.",
            "They were presented yesterday already.",
            "One was rounding so two round or partial values to prescribe epsilon, and one was count mean sketching, in which you replace the personalized Pagerank vector with a randomized approximation.",
            "OK, another paper from this year focuses on combining these two and what do they do they?"
        ],
        [
            "Learn the user profile corresponding of these 16 ODP categories and they applied two simple methods, linear regression and maximum likelihood estimator on the click history and they get some weights which represent the user interests in these 16 topics.",
            "And then these weights are always combined so it's no longer query dependent but it's user dependent.",
            "Of course, it's again limited to these 16 broad categories.",
            "OK, that's what we have in the page."
        ],
        [
            "Junk area the second is filtering results.",
            "This is a simpler area."
        ],
        [
            "And the algorithms are pretty straightforward.",
            "I would say so.",
            "One approach is to restrict the results to what you're interested.",
            "Like you define some ODP categories which you are interested in and then at runtime only one hand you get results which are filtered only for this category and you get the search engine results.",
            "And these two are combined.",
            "You can either use the bag of words as in this paper, or you can use classification as in this one.",
            "Then another idea is to.",
            "Simply define some keywords which you are interested in, like which are used as cluster labels and the search engine would filter these clusters to show them to you first.",
            "OK."
        ],
        [
            "The separate ranking factor approaches they basically."
        ],
        [
            "Came out Becausw the page rank based approaches were not scalable and output filtering approaches were not really good.",
            "The main idea here was.",
            "To have a profile and to use the distance between the profile and each of the output URL.",
            "And there are different ways to express the profile and different ways to express the distance.",
            "And these were basically the areas of research.",
            "So gamma, for instance, use the bag of words for the profile, and they had this interesting separation between permanent and recent profile, which is quite straightforward, but they investigated it a lot and then the search results are re ranked according to the cosine similarity.",
            "I guess this is not really.",
            "Perfect in general with using bags of words becausw I guess they are a bit too granular.",
            "A better approach would be perhaps to use categories again.",
            "Here you have the previous browsing history classified, uh, two different topics and you have different levels of confidence and then you have the search results which are also classified into the same topics with different level of confidence and the idea here is just to combine these two scores into one ranking.",
            "Yet."
        ],
        [
            "These approaches are quite time consuming because you have to do a lot of stuff at runtime and then.",
            "All all of them are invading well, are not really invading privacy, but they request a lot of data from the user.",
            "They need basically all the browsing behavior.",
            "So what we did later was to focus again on the categories, but learn them using only the search queries, which is still a bit invasive but less.",
            "Actually, as we will see later, this can be even further improved and the idea was that you have a separate ranking factor, which is the conceptual distance between the topics in the ODP and the topics associated to each of the URLs which are output by the search engine.",
            "Of course, this is just a separate ranking factor as it said because only about 40% of the top of Yahoo and Google results.",
            "Are already classified in either the ODP or in the Yahoo Directory.",
            "Anyway, we were surprised.",
            "In fact, This is why we did this research.",
            "We first found out that forty 4050% are in the taxonomy, and then we did it and we were surprised to have to see this big number."
        ],
        [
            "OK about future directions.",
            "First 2 Reese."
        ],
        [
            "Papers one is Cubist VD.",
            "It's the idea they had was to do LSA on users, queries and paged clicked.",
            "3 dimensional essay.",
            "So it's really time consuming.",
            "It seems to give good results you can you can recommend queries or pages to the same user for example.",
            "A better approach, which we're working on right now, would be to explore personal, personal data like what you have on the desktop, and this paper was modifying the BM 25 to incorporate external scores.",
            "So you get the search query for the web, but you collect automatically the relevance score from the desktop and then you get different weights for the query terms and you reorder the search output according to this weights.",
            "Teevan and Suzan showed that they have relatively minor improvements, but I think we can do a lot more here in fact.",
            "OK about the future die."
        ],
        [
            "Actions, so one would be this.",
            "The complex profiles like taken from the desktop and the advantage would be that they are private in the sense that they stay locally on the client side and they are also richer becausw they contain a lot of data, even more than the browsing history.",
            "Then it would be more adaptivity.",
            "This is a bit orthogonal, but I think it's important 'cause there are really few algorithms who make the personalized algorithm dependent on the query ambiguity and some queries really need a lot of personalizations and some others are quite clear.",
            "And finally, more social to.",
            "Exploit the wisdom of the crowd.",
            "Basically, as were said yesterday, so we can reach the profiles from our neighbors and our similar users, friends and so on.",
            "OK, that's"
        ],
        [
            "Should beat thank you.",
            "But it's time for quest.",
            "Higher quality, more coming back question.",
            "If you go back to your first example, then I wonder if music shouldn't be in the query in rather than in the file, so I'm wondering if.",
            "He thought he was a pro, flies out there, or after he did not cause people or other real steel through query writing system.",
            "I see your point, so here."
        ],
        [
            "I mean, well, this is actually what I did here.",
            "Becausw, I don't have personalized search on Yahoo myself, so I expanded the query.",
            "But then how would you expand the query?",
            "In fact you have to have a system which does the expansion for you.",
            "Ah, yes it is.",
            "It is.",
            "But.",
            "I understand that.",
            "And.",
            "Awesome.",
            "Yeah, I understand what you mean, so it's definitely evolving.",
            "We we moved from 2.1 query keywords to about 2.4 but we moved in a lot of years so it's evolving so slow that it will take perhaps 20 years.",
            "And then in this time the size of the web will increase.",
            "So I'm not really convinced that we will.",
            "Be able to put out personalization even in the future, because of course it increases, but the web increases as well.",
            "So we have a.",
            "Contradictory stuff.",
            "Query concerning privacy you mentioned at the end is desktop based things.",
            "Do they run on the client?",
            "Yes they would run on the client that list.",
            "This is how I see them.",
            "And what's your vision for the last point, integrating this social data and how do you this is more vague so we are more or less finished with the client approach.",
            "We're working on adaptivity a bit and the last is more likely a future work.",
            "You could, for instance do like collaborative filtering between the users.",
            "But that's quite time consuming on the web, so it puts out the data again if you use to the collaborative filtering, that's that's what I mean.",
            "You get enhanced profiles.",
            "We also thought awhile about how can you have social things on the one hand, so you combine multiple users things but also client based.",
            "I see the same time, so how can you combine the information without?",
            "I guess I guess it's difficult, but it's really difficult, but it's possible, like if you have a peer to peer network and users would share some of their data, you could incorporate that in your profile, but I guess the difficulty would come up into selecting which of these shared data to incorporate, because probably not everything will be relevant even if they are all in your social network, and even if they are all your friends.",
            "So.",
            "Years ago more information.",
            "Yeah.",
            "How are you classifying this stuff on Delos?",
            "So this can be found.",
            "You mean this paper?",
            "The last one.",
            "Haha so this is."
        ],
        [
            "Done through search or through classification is 2 classification, so they use Bayesian classifiers so they use existing code base.",
            "So let's think again, the speaker and."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so we are going to start with personalized web search.",
                    "label": 0
                },
                {
                    "sent": "This talk is a bit different from what we've seen so far.",
                    "label": 0
                },
                {
                    "sent": "I'm not really going to focus on what we do on this area.",
                    "label": 0
                },
                {
                    "sent": "We have bought 4 papers but rather on getting an overview and then trying to sketch some future directions.",
                    "label": 0
                },
                {
                    "sent": "And the hope is that in the end you will dismiss some of these directions and hopefully also suggest some other ones.",
                    "label": 0
                },
                {
                    "sent": "OK, so what's this personalized search about?",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's say we have this query Canon book I took on Yahoo example because it's really good.",
                    "label": 0
                },
                {
                    "sent": "So what do we get?",
                    "label": 0
                },
                {
                    "sent": "We get bookstores.",
                    "label": 0
                },
                {
                    "sent": "We get a blog about some sci-fi book.",
                    "label": 0
                },
                {
                    "sent": "We get the page about music too, about photography, about Canon camera.",
                    "label": 0
                },
                {
                    "sent": "One literature, it's literature book about Shakespeare and religious page good sampling.",
                    "label": 0
                },
                {
                    "sent": "But if I'm interested only in music, it's not really useful.",
                    "label": 0
                },
                {
                    "sent": "So personalization says that if I send the same query but I.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So have a user profile at the search engine side or at the client side, but which is taken into account.",
                    "label": 0
                },
                {
                    "sent": "Then I get all the results about my interest music in this case.",
                    "label": 0
                },
                {
                    "sent": "Besides the study by Search Engine Watch, I think last year said that 80% of the users would actually prefer to have this thing available.",
                    "label": 0
                },
                {
                    "sent": "OK, now that we know.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Where we are.",
                    "label": 0
                },
                {
                    "sent": "Let's see what we're talking about, so I'm going to start with user profiling.",
                    "label": 0
                },
                {
                    "sent": "I think this is an important component, which is a bit negligent in the personalized search papers, and then we're going to see three areas, three directions to do the personalization.",
                    "label": 0
                },
                {
                    "sent": "First is to build it in Pagerank itself, then to filter out all the results which are not interesting, and then to use the personalization itself as a different ranking factor.",
                    "label": 0
                },
                {
                    "sent": "And then of course, sketch these future directions I mentioned.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So briefly, about profiling for profiling, we have really a lot of sources.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A lot of data we have log behavior.",
                    "label": 0
                },
                {
                    "sent": "Total visit time clicks, bookmarks.",
                    "label": 1
                },
                {
                    "sent": "Client location can be relatively easily gathered.",
                    "label": 1
                },
                {
                    "sent": "Previous queries and some client side data which is even richer.",
                    "label": 0
                },
                {
                    "sent": "So we have a lot of stuff and we even have a lot of good algorithms to infer the profiles.",
                    "label": 0
                },
                {
                    "sent": "This inference process is actually done in 2 steps.",
                    "label": 0
                },
                {
                    "sent": "First you do some cleaning like for HTTP the requests for images and stuff like that and then you apply the machine learning goal statistics and get some representative user profile.",
                    "label": 0
                },
                {
                    "sent": "Now the problem is that most of the papers stop here.",
                    "label": 0
                },
                {
                    "sent": "Or start from here.",
                    "label": 1
                },
                {
                    "sent": "So there is not real real coupling between the papers on personal personalized search and the papers on user profiling these areas, I guess should be more coupled in the future.",
                    "label": 0
                },
                {
                    "sent": "Anyway, um, the papers which focus on personalized search, because this is our goal here, usually consider the profile explained either with categories with a list of URLs.",
                    "label": 0
                },
                {
                    "sent": "This is the most popular approach.",
                    "label": 1
                },
                {
                    "sent": "The bag of words and even more complex stuff.",
                    "label": 0
                },
                {
                    "sent": "I also put some references here, but I guess they are not visible.",
                    "label": 0
                },
                {
                    "sent": "Idea was to have them online such that you can use them afterwards.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So so now the main thing the personalization.",
                    "label": 0
                },
                {
                    "sent": "Oh, this was changed anyway.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the biased Pagerank was proposed even from the very beginning.",
                    "label": 0
                },
                {
                    "sent": "I guess everybody knows this formula and bias page rank means that in this evector you don't have a uniform distribution.",
                    "label": 0
                },
                {
                    "sent": "The profile is usually expressed as a list of URLs.",
                    "label": 0
                },
                {
                    "sent": "As I said, of course you can do various weights for this in the vector.",
                    "label": 0
                },
                {
                    "sent": "You get pretty good with results with that, it seems nobody.",
                    "label": 0
                },
                {
                    "sent": "Actually, I think nobody really tested that.",
                    "label": 0
                },
                {
                    "sent": "But you get a lot of disadvantages.",
                    "label": 0
                },
                {
                    "sent": "First, it's really time consuming to you do that for all users, and it's a lot of space to store one personalized Pagerank vector for each person.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "OK, so then.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Many extensions came after this, the first popular one was topic sensitive Pagerank.",
                    "label": 0
                },
                {
                    "sent": "The idea here is that you bias Pagerank on each of the 16 top level categories of ODP.",
                    "label": 0
                },
                {
                    "sent": "And then at runtime you compute the similarity between the query and each of these categories.",
                    "label": 0
                },
                {
                    "sent": "And you use this similarity scores to combine these 16 vectors into one which you then use to rank the results.",
                    "label": 0
                },
                {
                    "sent": "The good part is that this is really an adaptive algorithm.",
                    "label": 0
                },
                {
                    "sent": "It's probably the only one which adapts to the query.",
                    "label": 0
                },
                {
                    "sent": "The bad part is that it's not really personalization, at least not this basic form, but All in all, all users would get the same results.",
                    "label": 0
                },
                {
                    "sent": "It's so it's adaptive to the query.",
                    "label": 0
                },
                {
                    "sent": "Not to the user.",
                    "label": 0
                },
                {
                    "sent": "And of course, it's limited to these 16 broad categories.",
                    "label": 0
                },
                {
                    "sent": "There were many other papers on this.",
                    "label": 0
                },
                {
                    "sent": "I won't insist on them.",
                    "label": 0
                },
                {
                    "sent": "You can bias on preferred URL domains.",
                    "label": 0
                },
                {
                    "sent": "You can bias on hubs.",
                    "label": 0
                },
                {
                    "sent": "You can basically bias on anything.",
                    "label": 0
                },
                {
                    "sent": "Lay.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "After we got.",
                    "label": 0
                },
                {
                    "sent": "Another approach to make this scalable so.",
                    "label": 0
                },
                {
                    "sent": "Their basic idea was to express the personalized Pagerank vector for a set S as a linear combination of simpler personalized page rank vectors.",
                    "label": 0
                },
                {
                    "sent": "These ones, which they call basis hub vectors and they are computing with using only one non zero entry in the evector.",
                    "label": 0
                },
                {
                    "sent": "Namely, for this node V. And then these vectors still occupy a lot of space.",
                    "label": 0
                },
                {
                    "sent": "So the idea was then to split them into a hub.",
                    "label": 0
                },
                {
                    "sent": "Skeletonwitch is common to everybody, and it's stored offline, and the partial vector which encodes the specifically the specificity of each user.",
                    "label": 0
                },
                {
                    "sent": "Still, this was pretty time consuming.",
                    "label": 0
                },
                {
                    "sent": "We worked with it and those who work with it now.",
                    "label": 0
                },
                {
                    "sent": "It's not really scalable, even though they say it is.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A few papers came afterwards.",
                    "label": 0
                },
                {
                    "sent": "First, there was a paper on sampling.",
                    "label": 0
                },
                {
                    "sent": "Actually, there were two one on the web algorithms Workshop and one in the Journal Internet mathematics.",
                    "label": 0
                },
                {
                    "sent": "The idea here was.",
                    "label": 0
                },
                {
                    "sent": "That if you want to compute this basis vector, this personalized Pagerank vector for only one on zero entry in node U, then the.",
                    "label": 0
                },
                {
                    "sent": "A random walk of length K would end in a node V with a probability equal to the personalized page rank of that node B.",
                    "label": 0
                },
                {
                    "sent": "This was OK, but this was still an approximation because to compute that you basically approximate the scores, so better approximations came up this year.",
                    "label": 0
                },
                {
                    "sent": "They were presented yesterday already.",
                    "label": 0
                },
                {
                    "sent": "One was rounding so two round or partial values to prescribe epsilon, and one was count mean sketching, in which you replace the personalized Pagerank vector with a randomized approximation.",
                    "label": 0
                },
                {
                    "sent": "OK, another paper from this year focuses on combining these two and what do they do they?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Learn the user profile corresponding of these 16 ODP categories and they applied two simple methods, linear regression and maximum likelihood estimator on the click history and they get some weights which represent the user interests in these 16 topics.",
                    "label": 0
                },
                {
                    "sent": "And then these weights are always combined so it's no longer query dependent but it's user dependent.",
                    "label": 0
                },
                {
                    "sent": "Of course, it's again limited to these 16 broad categories.",
                    "label": 0
                },
                {
                    "sent": "OK, that's what we have in the page.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Junk area the second is filtering results.",
                    "label": 0
                },
                {
                    "sent": "This is a simpler area.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the algorithms are pretty straightforward.",
                    "label": 0
                },
                {
                    "sent": "I would say so.",
                    "label": 0
                },
                {
                    "sent": "One approach is to restrict the results to what you're interested.",
                    "label": 0
                },
                {
                    "sent": "Like you define some ODP categories which you are interested in and then at runtime only one hand you get results which are filtered only for this category and you get the search engine results.",
                    "label": 0
                },
                {
                    "sent": "And these two are combined.",
                    "label": 0
                },
                {
                    "sent": "You can either use the bag of words as in this paper, or you can use classification as in this one.",
                    "label": 0
                },
                {
                    "sent": "Then another idea is to.",
                    "label": 0
                },
                {
                    "sent": "Simply define some keywords which you are interested in, like which are used as cluster labels and the search engine would filter these clusters to show them to you first.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The separate ranking factor approaches they basically.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Came out Becausw the page rank based approaches were not scalable and output filtering approaches were not really good.",
                    "label": 0
                },
                {
                    "sent": "The main idea here was.",
                    "label": 0
                },
                {
                    "sent": "To have a profile and to use the distance between the profile and each of the output URL.",
                    "label": 0
                },
                {
                    "sent": "And there are different ways to express the profile and different ways to express the distance.",
                    "label": 0
                },
                {
                    "sent": "And these were basically the areas of research.",
                    "label": 0
                },
                {
                    "sent": "So gamma, for instance, use the bag of words for the profile, and they had this interesting separation between permanent and recent profile, which is quite straightforward, but they investigated it a lot and then the search results are re ranked according to the cosine similarity.",
                    "label": 0
                },
                {
                    "sent": "I guess this is not really.",
                    "label": 0
                },
                {
                    "sent": "Perfect in general with using bags of words becausw I guess they are a bit too granular.",
                    "label": 0
                },
                {
                    "sent": "A better approach would be perhaps to use categories again.",
                    "label": 0
                },
                {
                    "sent": "Here you have the previous browsing history classified, uh, two different topics and you have different levels of confidence and then you have the search results which are also classified into the same topics with different level of confidence and the idea here is just to combine these two scores into one ranking.",
                    "label": 0
                },
                {
                    "sent": "Yet.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "These approaches are quite time consuming because you have to do a lot of stuff at runtime and then.",
                    "label": 0
                },
                {
                    "sent": "All all of them are invading well, are not really invading privacy, but they request a lot of data from the user.",
                    "label": 0
                },
                {
                    "sent": "They need basically all the browsing behavior.",
                    "label": 0
                },
                {
                    "sent": "So what we did later was to focus again on the categories, but learn them using only the search queries, which is still a bit invasive but less.",
                    "label": 1
                },
                {
                    "sent": "Actually, as we will see later, this can be even further improved and the idea was that you have a separate ranking factor, which is the conceptual distance between the topics in the ODP and the topics associated to each of the URLs which are output by the search engine.",
                    "label": 1
                },
                {
                    "sent": "Of course, this is just a separate ranking factor as it said because only about 40% of the top of Yahoo and Google results.",
                    "label": 1
                },
                {
                    "sent": "Are already classified in either the ODP or in the Yahoo Directory.",
                    "label": 0
                },
                {
                    "sent": "Anyway, we were surprised.",
                    "label": 0
                },
                {
                    "sent": "In fact, This is why we did this research.",
                    "label": 0
                },
                {
                    "sent": "We first found out that forty 4050% are in the taxonomy, and then we did it and we were surprised to have to see this big number.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK about future directions.",
                    "label": 0
                },
                {
                    "sent": "First 2 Reese.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Papers one is Cubist VD.",
                    "label": 0
                },
                {
                    "sent": "It's the idea they had was to do LSA on users, queries and paged clicked.",
                    "label": 0
                },
                {
                    "sent": "3 dimensional essay.",
                    "label": 0
                },
                {
                    "sent": "So it's really time consuming.",
                    "label": 0
                },
                {
                    "sent": "It seems to give good results you can you can recommend queries or pages to the same user for example.",
                    "label": 0
                },
                {
                    "sent": "A better approach, which we're working on right now, would be to explore personal, personal data like what you have on the desktop, and this paper was modifying the BM 25 to incorporate external scores.",
                    "label": 0
                },
                {
                    "sent": "So you get the search query for the web, but you collect automatically the relevance score from the desktop and then you get different weights for the query terms and you reorder the search output according to this weights.",
                    "label": 0
                },
                {
                    "sent": "Teevan and Suzan showed that they have relatively minor improvements, but I think we can do a lot more here in fact.",
                    "label": 0
                },
                {
                    "sent": "OK about the future die.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actions, so one would be this.",
                    "label": 0
                },
                {
                    "sent": "The complex profiles like taken from the desktop and the advantage would be that they are private in the sense that they stay locally on the client side and they are also richer becausw they contain a lot of data, even more than the browsing history.",
                    "label": 0
                },
                {
                    "sent": "Then it would be more adaptivity.",
                    "label": 0
                },
                {
                    "sent": "This is a bit orthogonal, but I think it's important 'cause there are really few algorithms who make the personalized algorithm dependent on the query ambiguity and some queries really need a lot of personalizations and some others are quite clear.",
                    "label": 0
                },
                {
                    "sent": "And finally, more social to.",
                    "label": 0
                },
                {
                    "sent": "Exploit the wisdom of the crowd.",
                    "label": 0
                },
                {
                    "sent": "Basically, as were said yesterday, so we can reach the profiles from our neighbors and our similar users, friends and so on.",
                    "label": 0
                },
                {
                    "sent": "OK, that's",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Should beat thank you.",
                    "label": 0
                },
                {
                    "sent": "But it's time for quest.",
                    "label": 0
                },
                {
                    "sent": "Higher quality, more coming back question.",
                    "label": 0
                },
                {
                    "sent": "If you go back to your first example, then I wonder if music shouldn't be in the query in rather than in the file, so I'm wondering if.",
                    "label": 0
                },
                {
                    "sent": "He thought he was a pro, flies out there, or after he did not cause people or other real steel through query writing system.",
                    "label": 0
                },
                {
                    "sent": "I see your point, so here.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I mean, well, this is actually what I did here.",
                    "label": 0
                },
                {
                    "sent": "Becausw, I don't have personalized search on Yahoo myself, so I expanded the query.",
                    "label": 0
                },
                {
                    "sent": "But then how would you expand the query?",
                    "label": 0
                },
                {
                    "sent": "In fact you have to have a system which does the expansion for you.",
                    "label": 0
                },
                {
                    "sent": "Ah, yes it is.",
                    "label": 0
                },
                {
                    "sent": "It is.",
                    "label": 0
                },
                {
                    "sent": "But.",
                    "label": 0
                },
                {
                    "sent": "I understand that.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Awesome.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I understand what you mean, so it's definitely evolving.",
                    "label": 0
                },
                {
                    "sent": "We we moved from 2.1 query keywords to about 2.4 but we moved in a lot of years so it's evolving so slow that it will take perhaps 20 years.",
                    "label": 0
                },
                {
                    "sent": "And then in this time the size of the web will increase.",
                    "label": 0
                },
                {
                    "sent": "So I'm not really convinced that we will.",
                    "label": 0
                },
                {
                    "sent": "Be able to put out personalization even in the future, because of course it increases, but the web increases as well.",
                    "label": 0
                },
                {
                    "sent": "So we have a.",
                    "label": 0
                },
                {
                    "sent": "Contradictory stuff.",
                    "label": 0
                },
                {
                    "sent": "Query concerning privacy you mentioned at the end is desktop based things.",
                    "label": 0
                },
                {
                    "sent": "Do they run on the client?",
                    "label": 0
                },
                {
                    "sent": "Yes they would run on the client that list.",
                    "label": 0
                },
                {
                    "sent": "This is how I see them.",
                    "label": 0
                },
                {
                    "sent": "And what's your vision for the last point, integrating this social data and how do you this is more vague so we are more or less finished with the client approach.",
                    "label": 0
                },
                {
                    "sent": "We're working on adaptivity a bit and the last is more likely a future work.",
                    "label": 0
                },
                {
                    "sent": "You could, for instance do like collaborative filtering between the users.",
                    "label": 0
                },
                {
                    "sent": "But that's quite time consuming on the web, so it puts out the data again if you use to the collaborative filtering, that's that's what I mean.",
                    "label": 0
                },
                {
                    "sent": "You get enhanced profiles.",
                    "label": 0
                },
                {
                    "sent": "We also thought awhile about how can you have social things on the one hand, so you combine multiple users things but also client based.",
                    "label": 0
                },
                {
                    "sent": "I see the same time, so how can you combine the information without?",
                    "label": 0
                },
                {
                    "sent": "I guess I guess it's difficult, but it's really difficult, but it's possible, like if you have a peer to peer network and users would share some of their data, you could incorporate that in your profile, but I guess the difficulty would come up into selecting which of these shared data to incorporate, because probably not everything will be relevant even if they are all in your social network, and even if they are all your friends.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Years ago more information.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "How are you classifying this stuff on Delos?",
                    "label": 0
                },
                {
                    "sent": "So this can be found.",
                    "label": 0
                },
                {
                    "sent": "You mean this paper?",
                    "label": 0
                },
                {
                    "sent": "The last one.",
                    "label": 0
                },
                {
                    "sent": "Haha so this is.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Done through search or through classification is 2 classification, so they use Bayesian classifiers so they use existing code base.",
                    "label": 0
                },
                {
                    "sent": "So let's think again, the speaker and.",
                    "label": 0
                }
            ]
        }
    }
}