{
    "id": "bdfrmd6airbsyi7qi4j5pt7pfejltwjq",
    "title": "Implementation of an Open Science Policy in the context of management of CLARIN language resources: a need for changes?",
    "info": {
        "author": [
            "Aleksei Kelli, University of Tartu",
            "Penny Labropoulou, Institute for Language and Speech Processing (ILSP / \"Athena\" R.C.)"
        ],
        "published": "Oct. 17, 2017",
        "recorded": "September 2017",
        "category": [
            "Top->Humanities",
            "Top->Social Sciences"
        ]
    },
    "url": "http://videolectures.net/clarinannualconference2017_labropoulou_kelli_open/",
    "segmentation": [
        [
            "Clara."
        ],
        [
            "Is researching."
        ],
        [
            "Structure and the opener.",
            "the European Open Science Cloud is going to be based on infrastructures, so it's very important that in the chlorine value proposition client says that it's not not a song along along facility but well embedded in the European research infrastructure landscape at large, and so it's fully committed to the European Open science policies, including reuse of data.",
            "But is this really reflected in the way we manage?",
            "We show language resource is in the chlorine.",
            "Yellow for instance."
        ],
        [
            "First of all, let's have a quick look at what open science on open openness mean.",
            "Open science is based on cooperative work, collaboration, cooperation.",
            "Digital technologies are the keywords for open science together with diffusion of knowledge and diffusion of knowledge means Open Access.",
            "There's.",
            "An Open Access movement with various declarations taking the Berlin Declaration, we have three criteria for Open Access of resources.",
            "They must cover research results.",
            "All kinds of research results, all kinds of raw original data and metadata, pictures, text, etc.",
            "They need to come together with a license that will allow users to not only use the resource but also to distribute it.",
            "And to make derivatives and be able to re distribute them.",
            "These are very important.",
            "The results must be in some kind of digital format and it should be deposited somewhere where people can have access at all times.",
            "Another declaration you can see that all the definitions are overlapping, not exactly the same, but openness from the open Knowledge international states.",
            "Again, 3 criteria availability and access reuse and redistribution, and universal participation.",
            "So on the one hand we have opened."
        ],
        [
            "Science, on the other hand, we have the licensing categorisation schemes, broad overview.",
            "Their main objective is to fori indexing in data catalogs.",
            "They help users to search through them.",
            "So if you're going to the vlog, there's a facet their availability and you can limit your search into resources that can be used only for research purposes or by anyone through the public and the academic.",
            "Elements.",
            "They give you first Kings on what users can do with resources.",
            "So for instance Europeana has preferred to label a similar facet as.",
            "Can I use it, the users know whether they can use it for anything free reuse or with some limitations, and there you get some licenses which are standard and people know that.",
            "For instance for create Sissy byansi means Creative Commons and they need to attribute and they can only use it.",
            "For noncommercial uses.",
            "They're not replacing licenses there.",
            "Trying to do something else help the users spot some things even easier way.",
            "There are two broad approaches to licensing categorisation in one of the first, one is dissecting licenses into the features, the attributes, the conditions of use that allow users to do something with them.",
            "We have such paradigms in the Clarion conditions of use or the meta share, and this how all both being taken.",
            "By the Creative Commons license features, I mean Creative Commons became first, the other came after they mainly using license electors.",
            "You help people select the license if they want to use with the resource.",
            "I'm not going to go into them because I don't have the time to do that and they're also used in some repositories like the Greek clairin where you can select for instance academic or non commercial use share alike and y'all can see.",
            "All the resources that have this conditions of use.",
            "I had noticed it, but the chlorine d'espace also has this facet.",
            "So the second approach into licensing categorisation has to do with like grouping licenses together is based on a feature which you deem of ways or important.",
            "This is what we do with acquiring license categories, and Alex A is going to explain that a little bit late."
        ],
        [
            "Sure.",
            "I'm going to take a look into a closer look into two initiatives that have to do with.",
            "Licensing schemes and the first one is a core controlled vocabulary of access rights.",
            "Core is a Confederation of Open Access repositories.",
            "It mainly targets scholarly publications, but lately more lately other research data as well, such as datasets and software.",
            "They specifically say that the vocabulary includes concepts to declare the access status of a resource, just as we say in Clarion availability, they consider access more important.",
            "They have four terms, Open Access, embargoed access, restricted access, and metadata for our discussions in revisiting the licensing scheme.",
            "I think the most important ones are the open and the restricted access.",
            "If we look at Open Access, it refers to resource.",
            "That is immediately and permanently online.",
            "Free for all without any financial debt and technical barriers.",
            "If you have to log in, even if it's with your academic login or Facebook login or whatever to get a resource, it's not open, it's restricted access.",
            "If you have to ask for authorization from the resource owner resource distributor, it's restricted."
        ],
        [
            "Another initiative that gives us some food for thinking is comes from a joint initiative of Europeana and the Digital Public Library of America.",
            "Um, they mainly target any kind of digital cultural object or their images.",
            "Cultural heritage institutions and aggregators.",
            "The right statements are high level summaries of the underlying rights status.",
            "We had access and availability.",
            "We have rights.",
            "Why?",
            "Because Copyright is very important for cultural objects, their original creations.",
            "So Copyright is more important than access to this community.",
            "So they have three categories based on Copyright, which are further divided into 12 right statements in Copyright with out of Copyright and cases where the Copyright is not determined, either because they haven't been able to find who the copywriter owner is or because they simply haven't searched for them.",
            "I think for our discussion again the two things that we should look into is that there are specific statements that, for instance in Copyright that also.",
            "Give an indication of the use that is permitted if you say considerations that something is in Copyright and educational use for is permitting.",
            "It doesn't mean that you cannot use it for other things, but at least for educational use it shown you do not have to ask further."
        ],
        [
            "Further authorization from the Resource Line owner.",
            "So what are the lessons we learn from such licensing schemes?",
            "They have controlled vocabularies, very clear and published semantics.",
            "There have their own specific curries, which means that anyone else can link to them and say that they have similar concepts or not.",
            "There's an effort to standardize all over Europe and all over the world, basically internationally sets.",
            "License categories.",
            "And when creating them you need to address your own user community.",
            "As I said before, the distinguishing point between the two initiatives was access Copyright and we got games of mixed schema in the right statement where you also point out specific uses and I give the floor 2.",
            "Alexej"
        ],
        [
            "Continue.",
            "So thank you Penny, you gave some.",
            "Who are you?",
            "And now I will discuss some of the practical results of our our analysis.",
            "And actually actually, the reason for this paper, it was practical.",
            "It was not like interest driven that he wanted to find out something new, but actually we had discussion whether the current division public academic restricted is good and there are several arguments that it is not very good.",
            "It goes like restricted is like bad image restricted.",
            "You should allow everything to do and then and public is not really clear and then and so this was the basis and to continue with this basis we decided that we should write something because it's easier when you just write down all these arguments.",
            "Otherwise one side says one thing and the other side the other thing.",
            "And so we tried to summarize summarize this.",
            "And before before I explained the results here I I think that the current division.",
            "It's based on the nature of resources.",
            "Becausw resources are rather complex from legal point of view.",
            "They're covered with very different rights, cost.",
            "For instance, when you when you when you use some like written materials and book since Copyright protected when you use some or all texts, then it involves also privacy rights, personal data protection, even performance right?",
            "So very many rights based very many rights are covering the material which is used and then this resources developed.",
            "Then it's also called this very many rights.",
            "So, and I think that all these problems come from the nature of resources.",
            "It's not division, but it's a nature and all this complicated legal issues."
        ],
        [
            "Because when we look how from legal point of view resources are created.",
            "Actually it's like 2 models.",
            "One is also in formal model but but but main two models is versus exception model.",
            "Hey, Copyright in some.",
            "In some countries, Copyright law says that you can use material for research purposes, and so researchers are relying on it, but not in all countries.",
            "If we don't have this kind of regulation, then it should be contract model.",
            "But very often I think that in case in in case how resources are created very often, there is no exception model, there is no contract models, just used specially with old resources and to some extent their illegal and and this causes additional problems so.",
            "To somehow managed hold these complexities with resources, it was already long time ago when crystalline denonville dioxin and they developed this division public academic restricted whether it's like perfect Division I don't think it's perfect, but but but it has worked and and I think it is still working.",
            "Yeah, 'cause 'cause the idea of current would be to make everything open.",
            "But the problem is we cannot do it cannot do it because there are too many restrictions.",
            "Cooperate has been expanding overtime, it's more and more rights which makes things more and more complicated.",
            "And of course one thing which we face also in Europe is moral rights of voters.",
            "One thing is that economic rights which give you right to copy but also economic rights and economic rights are moral rights make things even more complicated, maybe just to give you.",
            "An example from different fields from different fields.",
            "There have been cases involving colorization of movies was asked for jungle by John Houston, whose movie was colorized thirsty.",
            "Smalls black and white, and then this colorized.",
            "There was like dispute whether it's corporate infringement or not.",
            "Yes, it was infringement, and in certain jurisdiction.",
            "As I was also on different case involved silence, you know those who are singing on island and just inviting sailors aware, and in the case was that there was a painting commissioned.",
            "And then the silence.",
            "Usually there make it, and so this person commissioned this painting and and he had his painting.",
            "And then he changed his mind.",
            "He thought that it's not good idea to have naked science and he hired another artist who put some clothes on on this silence and 1st artist found out and tooth and what court?",
            "What court said?",
            "Court said that actually, do you have to take off all clothes because first they were naked and and this is the concept of moral rights and and actually this moral rights could also affect the IT could also affect the resources.",
            "Of course, to some extent you're like changing that you're modifying, but it's integrity, right?",
            "So then when I write the Pooh, and maybe I don't want it to be changed or don't want to do any any technical things.",
            "And so this is the concept of our of our resources, and the question is.",
            "Where is a different categorization would help.",
            "Now we have power back on risk and and what would be."
        ],
        [
            "Like the different.",
            "As a different categorization, different categorization would be that we say open instead of publicly said, say open, and of course open could be more compatible with all this European Union policies, which saying that are open science open data.",
            "But the problem is that hoop and doesn't make things any clearer cause.",
            "We can't always understand what public means but but when we say open, we also can't understand what open means that's replacing one confusing concept with another one I. I don't think it makes things much better, so it's not first first, first, of course, we have this policy arguments and jazz and jazz are other category which is sometimes criticized.",
            "This academic user credentials.",
            "What does it mean?",
            "Can I?",
            "Can I use it?",
            "I don't know.",
            "Can some companies do research based on this academic user for each research purposes?",
            "But the problem is that.",
            "If we replace this AKA use academic use, we say that non commercial then non commercial is also confusing.",
            "We don't know what non commercial means.",
            "Cause for instance when researchers do some research.",
            "It also involves some money.",
            "You get some research grants.",
            "Maybe you play some results where on website when you have some logos.",
            "When you get some money for someone and and then so there is no understanding what commercial and non commercial uses.",
            "So I don't think that is replacing AKA category would help.",
            "And so.",
            "We did some research, discussion and and and actually we we didn't.",
            "You don't get any like good results.",
            "Maybe we don't know what is the best best way forward.",
            "I think that probably we need to work more on this on this issue and the reason actually is that when we are working more on this issue, we should also consider personal data protection reform.",
            "We should also consider personal data protection reform 'cause this categories they don't reflect only cooperate, they also they reflect the access.",
            "How you can access and it's not only corporate, it's also.",
            "It's also personal data is some privacy issues and an answer woman.",
            "And at the moment, my conclusion is that.",
            "Then you have a dog that bites and you rename.",
            "This dog gives some very sweet name.",
            "It does not mean that the dog doesn't bite anymore.",
            "So and so I think that the dog is a problem with the name.",
            "So thank you for your attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Clara.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is researching.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Structure and the opener.",
                    "label": 0
                },
                {
                    "sent": "the European Open Science Cloud is going to be based on infrastructures, so it's very important that in the chlorine value proposition client says that it's not not a song along along facility but well embedded in the European research infrastructure landscape at large, and so it's fully committed to the European Open science policies, including reuse of data.",
                    "label": 1
                },
                {
                    "sent": "But is this really reflected in the way we manage?",
                    "label": 0
                },
                {
                    "sent": "We show language resource is in the chlorine.",
                    "label": 0
                },
                {
                    "sent": "Yellow for instance.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First of all, let's have a quick look at what open science on open openness mean.",
                    "label": 0
                },
                {
                    "sent": "Open science is based on cooperative work, collaboration, cooperation.",
                    "label": 1
                },
                {
                    "sent": "Digital technologies are the keywords for open science together with diffusion of knowledge and diffusion of knowledge means Open Access.",
                    "label": 0
                },
                {
                    "sent": "There's.",
                    "label": 0
                },
                {
                    "sent": "An Open Access movement with various declarations taking the Berlin Declaration, we have three criteria for Open Access of resources.",
                    "label": 0
                },
                {
                    "sent": "They must cover research results.",
                    "label": 0
                },
                {
                    "sent": "All kinds of research results, all kinds of raw original data and metadata, pictures, text, etc.",
                    "label": 0
                },
                {
                    "sent": "They need to come together with a license that will allow users to not only use the resource but also to distribute it.",
                    "label": 0
                },
                {
                    "sent": "And to make derivatives and be able to re distribute them.",
                    "label": 0
                },
                {
                    "sent": "These are very important.",
                    "label": 0
                },
                {
                    "sent": "The results must be in some kind of digital format and it should be deposited somewhere where people can have access at all times.",
                    "label": 0
                },
                {
                    "sent": "Another declaration you can see that all the definitions are overlapping, not exactly the same, but openness from the open Knowledge international states.",
                    "label": 0
                },
                {
                    "sent": "Again, 3 criteria availability and access reuse and redistribution, and universal participation.",
                    "label": 1
                },
                {
                    "sent": "So on the one hand we have opened.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Science, on the other hand, we have the licensing categorisation schemes, broad overview.",
                    "label": 0
                },
                {
                    "sent": "Their main objective is to fori indexing in data catalogs.",
                    "label": 1
                },
                {
                    "sent": "They help users to search through them.",
                    "label": 0
                },
                {
                    "sent": "So if you're going to the vlog, there's a facet their availability and you can limit your search into resources that can be used only for research purposes or by anyone through the public and the academic.",
                    "label": 0
                },
                {
                    "sent": "Elements.",
                    "label": 0
                },
                {
                    "sent": "They give you first Kings on what users can do with resources.",
                    "label": 1
                },
                {
                    "sent": "So for instance Europeana has preferred to label a similar facet as.",
                    "label": 0
                },
                {
                    "sent": "Can I use it, the users know whether they can use it for anything free reuse or with some limitations, and there you get some licenses which are standard and people know that.",
                    "label": 0
                },
                {
                    "sent": "For instance for create Sissy byansi means Creative Commons and they need to attribute and they can only use it.",
                    "label": 1
                },
                {
                    "sent": "For noncommercial uses.",
                    "label": 0
                },
                {
                    "sent": "They're not replacing licenses there.",
                    "label": 0
                },
                {
                    "sent": "Trying to do something else help the users spot some things even easier way.",
                    "label": 1
                },
                {
                    "sent": "There are two broad approaches to licensing categorisation in one of the first, one is dissecting licenses into the features, the attributes, the conditions of use that allow users to do something with them.",
                    "label": 0
                },
                {
                    "sent": "We have such paradigms in the Clarion conditions of use or the meta share, and this how all both being taken.",
                    "label": 1
                },
                {
                    "sent": "By the Creative Commons license features, I mean Creative Commons became first, the other came after they mainly using license electors.",
                    "label": 1
                },
                {
                    "sent": "You help people select the license if they want to use with the resource.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to go into them because I don't have the time to do that and they're also used in some repositories like the Greek clairin where you can select for instance academic or non commercial use share alike and y'all can see.",
                    "label": 0
                },
                {
                    "sent": "All the resources that have this conditions of use.",
                    "label": 0
                },
                {
                    "sent": "I had noticed it, but the chlorine d'espace also has this facet.",
                    "label": 0
                },
                {
                    "sent": "So the second approach into licensing categorisation has to do with like grouping licenses together is based on a feature which you deem of ways or important.",
                    "label": 0
                },
                {
                    "sent": "This is what we do with acquiring license categories, and Alex A is going to explain that a little bit late.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sure.",
                    "label": 0
                },
                {
                    "sent": "I'm going to take a look into a closer look into two initiatives that have to do with.",
                    "label": 0
                },
                {
                    "sent": "Licensing schemes and the first one is a core controlled vocabulary of access rights.",
                    "label": 0
                },
                {
                    "sent": "Core is a Confederation of Open Access repositories.",
                    "label": 1
                },
                {
                    "sent": "It mainly targets scholarly publications, but lately more lately other research data as well, such as datasets and software.",
                    "label": 1
                },
                {
                    "sent": "They specifically say that the vocabulary includes concepts to declare the access status of a resource, just as we say in Clarion availability, they consider access more important.",
                    "label": 1
                },
                {
                    "sent": "They have four terms, Open Access, embargoed access, restricted access, and metadata for our discussions in revisiting the licensing scheme.",
                    "label": 0
                },
                {
                    "sent": "I think the most important ones are the open and the restricted access.",
                    "label": 0
                },
                {
                    "sent": "If we look at Open Access, it refers to resource.",
                    "label": 1
                },
                {
                    "sent": "That is immediately and permanently online.",
                    "label": 0
                },
                {
                    "sent": "Free for all without any financial debt and technical barriers.",
                    "label": 0
                },
                {
                    "sent": "If you have to log in, even if it's with your academic login or Facebook login or whatever to get a resource, it's not open, it's restricted access.",
                    "label": 0
                },
                {
                    "sent": "If you have to ask for authorization from the resource owner resource distributor, it's restricted.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another initiative that gives us some food for thinking is comes from a joint initiative of Europeana and the Digital Public Library of America.",
                    "label": 1
                },
                {
                    "sent": "Um, they mainly target any kind of digital cultural object or their images.",
                    "label": 0
                },
                {
                    "sent": "Cultural heritage institutions and aggregators.",
                    "label": 0
                },
                {
                    "sent": "The right statements are high level summaries of the underlying rights status.",
                    "label": 0
                },
                {
                    "sent": "We had access and availability.",
                    "label": 0
                },
                {
                    "sent": "We have rights.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because Copyright is very important for cultural objects, their original creations.",
                    "label": 0
                },
                {
                    "sent": "So Copyright is more important than access to this community.",
                    "label": 0
                },
                {
                    "sent": "So they have three categories based on Copyright, which are further divided into 12 right statements in Copyright with out of Copyright and cases where the Copyright is not determined, either because they haven't been able to find who the copywriter owner is or because they simply haven't searched for them.",
                    "label": 0
                },
                {
                    "sent": "I think for our discussion again the two things that we should look into is that there are specific statements that, for instance in Copyright that also.",
                    "label": 0
                },
                {
                    "sent": "Give an indication of the use that is permitted if you say considerations that something is in Copyright and educational use for is permitting.",
                    "label": 0
                },
                {
                    "sent": "It doesn't mean that you cannot use it for other things, but at least for educational use it shown you do not have to ask further.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Further authorization from the Resource Line owner.",
                    "label": 0
                },
                {
                    "sent": "So what are the lessons we learn from such licensing schemes?",
                    "label": 0
                },
                {
                    "sent": "They have controlled vocabularies, very clear and published semantics.",
                    "label": 1
                },
                {
                    "sent": "There have their own specific curries, which means that anyone else can link to them and say that they have similar concepts or not.",
                    "label": 1
                },
                {
                    "sent": "There's an effort to standardize all over Europe and all over the world, basically internationally sets.",
                    "label": 0
                },
                {
                    "sent": "License categories.",
                    "label": 1
                },
                {
                    "sent": "And when creating them you need to address your own user community.",
                    "label": 0
                },
                {
                    "sent": "As I said before, the distinguishing point between the two initiatives was access Copyright and we got games of mixed schema in the right statement where you also point out specific uses and I give the floor 2.",
                    "label": 0
                },
                {
                    "sent": "Alexej",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Continue.",
                    "label": 0
                },
                {
                    "sent": "So thank you Penny, you gave some.",
                    "label": 0
                },
                {
                    "sent": "Who are you?",
                    "label": 0
                },
                {
                    "sent": "And now I will discuss some of the practical results of our our analysis.",
                    "label": 0
                },
                {
                    "sent": "And actually actually, the reason for this paper, it was practical.",
                    "label": 0
                },
                {
                    "sent": "It was not like interest driven that he wanted to find out something new, but actually we had discussion whether the current division public academic restricted is good and there are several arguments that it is not very good.",
                    "label": 0
                },
                {
                    "sent": "It goes like restricted is like bad image restricted.",
                    "label": 0
                },
                {
                    "sent": "You should allow everything to do and then and public is not really clear and then and so this was the basis and to continue with this basis we decided that we should write something because it's easier when you just write down all these arguments.",
                    "label": 0
                },
                {
                    "sent": "Otherwise one side says one thing and the other side the other thing.",
                    "label": 0
                },
                {
                    "sent": "And so we tried to summarize summarize this.",
                    "label": 0
                },
                {
                    "sent": "And before before I explained the results here I I think that the current division.",
                    "label": 0
                },
                {
                    "sent": "It's based on the nature of resources.",
                    "label": 0
                },
                {
                    "sent": "Becausw resources are rather complex from legal point of view.",
                    "label": 0
                },
                {
                    "sent": "They're covered with very different rights, cost.",
                    "label": 0
                },
                {
                    "sent": "For instance, when you when you when you use some like written materials and book since Copyright protected when you use some or all texts, then it involves also privacy rights, personal data protection, even performance right?",
                    "label": 0
                },
                {
                    "sent": "So very many rights based very many rights are covering the material which is used and then this resources developed.",
                    "label": 0
                },
                {
                    "sent": "Then it's also called this very many rights.",
                    "label": 0
                },
                {
                    "sent": "So, and I think that all these problems come from the nature of resources.",
                    "label": 0
                },
                {
                    "sent": "It's not division, but it's a nature and all this complicated legal issues.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Because when we look how from legal point of view resources are created.",
                    "label": 0
                },
                {
                    "sent": "Actually it's like 2 models.",
                    "label": 0
                },
                {
                    "sent": "One is also in formal model but but but main two models is versus exception model.",
                    "label": 1
                },
                {
                    "sent": "Hey, Copyright in some.",
                    "label": 0
                },
                {
                    "sent": "In some countries, Copyright law says that you can use material for research purposes, and so researchers are relying on it, but not in all countries.",
                    "label": 0
                },
                {
                    "sent": "If we don't have this kind of regulation, then it should be contract model.",
                    "label": 1
                },
                {
                    "sent": "But very often I think that in case in in case how resources are created very often, there is no exception model, there is no contract models, just used specially with old resources and to some extent their illegal and and this causes additional problems so.",
                    "label": 0
                },
                {
                    "sent": "To somehow managed hold these complexities with resources, it was already long time ago when crystalline denonville dioxin and they developed this division public academic restricted whether it's like perfect Division I don't think it's perfect, but but but it has worked and and I think it is still working.",
                    "label": 0
                },
                {
                    "sent": "Yeah, 'cause 'cause the idea of current would be to make everything open.",
                    "label": 0
                },
                {
                    "sent": "But the problem is we cannot do it cannot do it because there are too many restrictions.",
                    "label": 0
                },
                {
                    "sent": "Cooperate has been expanding overtime, it's more and more rights which makes things more and more complicated.",
                    "label": 0
                },
                {
                    "sent": "And of course one thing which we face also in Europe is moral rights of voters.",
                    "label": 0
                },
                {
                    "sent": "One thing is that economic rights which give you right to copy but also economic rights and economic rights are moral rights make things even more complicated, maybe just to give you.",
                    "label": 0
                },
                {
                    "sent": "An example from different fields from different fields.",
                    "label": 0
                },
                {
                    "sent": "There have been cases involving colorization of movies was asked for jungle by John Houston, whose movie was colorized thirsty.",
                    "label": 0
                },
                {
                    "sent": "Smalls black and white, and then this colorized.",
                    "label": 0
                },
                {
                    "sent": "There was like dispute whether it's corporate infringement or not.",
                    "label": 0
                },
                {
                    "sent": "Yes, it was infringement, and in certain jurisdiction.",
                    "label": 0
                },
                {
                    "sent": "As I was also on different case involved silence, you know those who are singing on island and just inviting sailors aware, and in the case was that there was a painting commissioned.",
                    "label": 0
                },
                {
                    "sent": "And then the silence.",
                    "label": 0
                },
                {
                    "sent": "Usually there make it, and so this person commissioned this painting and and he had his painting.",
                    "label": 0
                },
                {
                    "sent": "And then he changed his mind.",
                    "label": 0
                },
                {
                    "sent": "He thought that it's not good idea to have naked science and he hired another artist who put some clothes on on this silence and 1st artist found out and tooth and what court?",
                    "label": 0
                },
                {
                    "sent": "What court said?",
                    "label": 0
                },
                {
                    "sent": "Court said that actually, do you have to take off all clothes because first they were naked and and this is the concept of moral rights and and actually this moral rights could also affect the IT could also affect the resources.",
                    "label": 0
                },
                {
                    "sent": "Of course, to some extent you're like changing that you're modifying, but it's integrity, right?",
                    "label": 0
                },
                {
                    "sent": "So then when I write the Pooh, and maybe I don't want it to be changed or don't want to do any any technical things.",
                    "label": 0
                },
                {
                    "sent": "And so this is the concept of our of our resources, and the question is.",
                    "label": 0
                },
                {
                    "sent": "Where is a different categorization would help.",
                    "label": 0
                },
                {
                    "sent": "Now we have power back on risk and and what would be.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like the different.",
                    "label": 0
                },
                {
                    "sent": "As a different categorization, different categorization would be that we say open instead of publicly said, say open, and of course open could be more compatible with all this European Union policies, which saying that are open science open data.",
                    "label": 0
                },
                {
                    "sent": "But the problem is that hoop and doesn't make things any clearer cause.",
                    "label": 0
                },
                {
                    "sent": "We can't always understand what public means but but when we say open, we also can't understand what open means that's replacing one confusing concept with another one I. I don't think it makes things much better, so it's not first first, first, of course, we have this policy arguments and jazz and jazz are other category which is sometimes criticized.",
                    "label": 0
                },
                {
                    "sent": "This academic user credentials.",
                    "label": 0
                },
                {
                    "sent": "What does it mean?",
                    "label": 0
                },
                {
                    "sent": "Can I?",
                    "label": 0
                },
                {
                    "sent": "Can I use it?",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "Can some companies do research based on this academic user for each research purposes?",
                    "label": 0
                },
                {
                    "sent": "But the problem is that.",
                    "label": 0
                },
                {
                    "sent": "If we replace this AKA use academic use, we say that non commercial then non commercial is also confusing.",
                    "label": 0
                },
                {
                    "sent": "We don't know what non commercial means.",
                    "label": 0
                },
                {
                    "sent": "Cause for instance when researchers do some research.",
                    "label": 0
                },
                {
                    "sent": "It also involves some money.",
                    "label": 0
                },
                {
                    "sent": "You get some research grants.",
                    "label": 0
                },
                {
                    "sent": "Maybe you play some results where on website when you have some logos.",
                    "label": 0
                },
                {
                    "sent": "When you get some money for someone and and then so there is no understanding what commercial and non commercial uses.",
                    "label": 0
                },
                {
                    "sent": "So I don't think that is replacing AKA category would help.",
                    "label": 0
                },
                {
                    "sent": "And so.",
                    "label": 0
                },
                {
                    "sent": "We did some research, discussion and and and actually we we didn't.",
                    "label": 0
                },
                {
                    "sent": "You don't get any like good results.",
                    "label": 0
                },
                {
                    "sent": "Maybe we don't know what is the best best way forward.",
                    "label": 0
                },
                {
                    "sent": "I think that probably we need to work more on this on this issue and the reason actually is that when we are working more on this issue, we should also consider personal data protection reform.",
                    "label": 0
                },
                {
                    "sent": "We should also consider personal data protection reform 'cause this categories they don't reflect only cooperate, they also they reflect the access.",
                    "label": 0
                },
                {
                    "sent": "How you can access and it's not only corporate, it's also.",
                    "label": 0
                },
                {
                    "sent": "It's also personal data is some privacy issues and an answer woman.",
                    "label": 0
                },
                {
                    "sent": "And at the moment, my conclusion is that.",
                    "label": 0
                },
                {
                    "sent": "Then you have a dog that bites and you rename.",
                    "label": 0
                },
                {
                    "sent": "This dog gives some very sweet name.",
                    "label": 0
                },
                {
                    "sent": "It does not mean that the dog doesn't bite anymore.",
                    "label": 0
                },
                {
                    "sent": "So and so I think that the dog is a problem with the name.",
                    "label": 0
                },
                {
                    "sent": "So thank you for your attention.",
                    "label": 0
                }
            ]
        }
    }
}