{
    "id": "bkqfrfz5xrbag3mfr7knwvd7pugzg4p7",
    "title": "A Use Case in Semantic Modelling and Ranking for the Sensor Web",
    "info": {
        "author": [
            "Liliana Cabral, Knowledge Media Institute (KMI), Open University (OU)"
        ],
        "published": "Dec. 19, 2014",
        "recorded": "October 2014",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2014_cabral_use_case_semantic_modelling/",
    "segmentation": [
        [
            "I work at the CSI row in Tasmania, Australia.",
            "So my talk is going to be about the use casing Samantha Mobilians ranking for the sense Web.",
            "I'm going to start with motivation and I use case within our project on the domain of viticulture.",
            "And then I'm going to talk about the both of US sensor data infrastructure that is used.",
            "And."
        ],
        [
            "The sensor problem college that they developed as an extension of semantic extension of these data infrastructure.",
            "And then I go into the approach and semantic modeling and the ranking that we have.",
            "Developed"
        ],
        [
            "Um?",
            "So that.",
            "This project is about managing disease risk and monitoring Frost in vineyards and supporting farmers and vineyard managers in making decisions about crop development.",
            "By using apps.",
            "And the goal is to improve productivity and.",
            "By using low-cost sensing around the vineyard.",
            "Um?"
        ],
        [
            "So our motivation comes from the user requirements.",
            "So what the user needs need to to monitor their crops is situational awareness of the environmental conditions in the vineyard.",
            "They want to visualize raw sense data and the derived variables that they need and prediction models.",
            "But especially, they they wanted to.",
            "Use sensors and observations that are fit for a purpose.",
            "So that means that in the.",
            "Within of the vineyard or between vineyards.",
            "Different types of environmental conditions are possible and affect how disease develops.",
            "Frost develops in specific parts.",
            "So as part of the fit for purpose ranking that we're trying to develop here, the important thing is to.",
            "The work that we have been doing is in finding input data to predictive model.",
            "And this is around the observations and around the sensors.",
            "So the observed phenomena, the measurement for properties and.",
            "Location, data quality and the network that's being used."
        ],
        [
            "So as part of the user requirements, we we sit with the plant pathologists and and the managers and they told us what type of variables are important for them to to monitor the vineyard and this is just a list of.",
            "Up of the variables that they use and here we see that this very simple analytics, but already combination of sensor raw data that is.",
            "Available from the sensors that are diploid.",
            "So they use temperature, humidity, rainfall.",
            "Lift witness and then a combination of this that goes into the calculations of the predictive models.",
            "So."
        ],
        [
            "I'm.",
            "Then I start with a use case that we've used in this work and it's about botrytis bunch rot, so this is fungus that cause brought in the Grapevine as we see here so.",
            "And it needs the right environmental conditions to develop.",
            "Hence usually when you have cloudy moist weather and with that.",
            "Temperature range between 1821 and keeps on rainy."
        ],
        [
            "I'm.",
            "So it's important for for the farmers to to.",
            "Predict the risk of botrytis to avoid losing the crop, and there are two key environment variables that is involved in the risk one is temperature.",
            "This surface wetness duration, so we have.",
            "The sensors for that they live wetness sensor, for example, measures the electrical resistance of changes in the.",
            "Presence of free water.",
            "So one of the."
        ],
        [
            "Variables that we use is the Bacchus that describes the effect of the temperature in the risk of botrytis, and then it shows that.",
            "For each wet hour, then the temperature affects that risk."
        ],
        [
            "So the package index is derived variable that's used commercially already, and so for example, tools such as this example here use the.",
            "The bug is to show the index increasing with it wet hour and it turns right when the risk is is high.",
            "So there's that."
        ],
        [
            "This variable is used.",
            "As part over the early season model.",
            "So when the Bakassi next is accumulated daily.",
            "In Indy, during the crop development phase.",
            "That range from the 5% cap fall and Verizon which is from flowering to the when the great start to ripe."
        ],
        [
            "So the our experts have calculated that if that accumulated by scenic state more than 20 days above a threshold line, then they have a high risk.",
            "So this is in the early season model that predict this.",
            "And the model is.",
            "Can can?",
            "Produce predictive line from regression on the accumulator buckets index and.",
            "And then and also a threshold line based in the historical data that they have.",
            "Collect."
        ],
        [
            "So I'm going to come back to this example.",
            "I'm going to talk about the sensor infrastructure that we use in the."
        ],
        [
            "Object.",
            "And the that's called a.",
            "It is a butene infrastructure called Central Cloud.",
            "And.",
            "It does what most of these infrastructure do.",
            "They provide sensory stream processing, data ingestion from different types of sensors?",
            "Answer Data management in this case is we use Mongo DB data storage and we have Jason documents and format the data.",
            "We also have a Web API that uses rest to access the data and.",
            "The URL pattern for access is based on.",
            "Network IDs, Plataform sensors and phenomena that resembles the way that the sensor networks are deployed in this environment.",
            "Then we have also.",
            "Installation of Time series and a few statistical calculations that it can be provided as part of the idea.",
            "Um?"
        ],
        [
            "So that's a snapshot of Jason Document, so most of these documents have metadata, so it's a lot more about the networks, the platforms and sisters.",
            "Such as the location.",
            "For example, we have long today and latitude for for the platforms and for the sensors, and we have information about the last data that the observation.",
            "It was measured and then links to the observation values as time series itself.",
            "Um?"
        ],
        [
            "So this is just a snapshot of one of the visualization tools that we have.",
            "It just shows how the.",
            "The data is virtually structured as documents and follows this hierarchy of network.",
            "Platform sensors and observations so sensor cloud can be seen as a collection of sensor networks.",
            "That in this case, each vineyard is a network, and it expands into the platforms that are diploid and for example, the weather station is a platform.",
            "This weather stations can be exploited in the sensors that it supports, like the Campbell for for air temperature, and then this expands into the observation, let's given.",
            "But it has a graph visualization for it."
        ],
        [
            "So on top of this data infrastructure we have workflows that we are used to.",
            "To calculate the variables, these are Kepler workflows and we have a catalog of models.",
            "And they have the virus, so this workflow gets the.",
            "These descriptions and it knows which inputs are used in a certain model, and these are the sensory strengths that goes as input."
        ],
        [
            "So that you talk about the semantic part."
        ],
        [
            "We have extended the sensor cloud with some components to convert RDF from Jason and using this sensor cloud list I'm going to.",
            "Talk about later and that provides this the right hand side here that is added to the components of that I talked before.",
            "Um?",
            "So we."
        ],
        [
            "Created a sensor code on foliage, not.",
            "In the sense of being a new ontology for sensor data.",
            "But this is an umbrella and told you that.",
            "Put together or.",
            "Accepts that are useful and most of these concepts comes from the SSN ontology, so the prefix in the boxes here in the dark boxes are the ones that we have imported.",
            "So of course we use the SSN ontology.",
            "But then it it season ontology at the reflects the structure that we saw before over networks, platforms, sensors and observed data.",
            "And also use Geo location to get the coordinates of this order sensor and the observation and measurement ontology too, for metadata observation."
        ],
        [
            "So of course, in Subclassing SSN we get access.",
            "To all the.",
            "Relationships that SSN offers and then you see that this is a very comprehensive ontology.",
            "What we had to do is to extend that."
        ],
        [
            "2.",
            "Um?",
            "To be able to to get the data and the relationships that we need for the applications that we are developing.",
            "So in that is in around sensor distribution, the properties and the measurement capabilities of a sensor."
        ],
        [
            "So I'm just going to give some examples of what how we extended.",
            "So for example, we needed to express something like the data some over the Packers index and the inputs of discussing this as being left wetness and at temperature so that we could.",
            "Find the right type of sensor so we have added the concepts such as functional, modify and temporal modifier and has property part.",
            "So in this example here you see that as part of observed phenomena which is in this case the SSN observation we.",
            "We can say.",
            "That"
        ],
        [
            "The sum of Bacchus index has functional modifier.",
            "It's called total and the temporal modifier that is called daily.",
            "And in this case the.",
            "Of seven property, which is the Bacchus index, it is has two parts.",
            "One is they live witness and the other one is the temperature.",
            "So.",
            "This is going to be used as part of of the ranking and we want a selection.",
            "For example, if you want to search for hourly air temperature then we can do this as.",
            "In this type of sparkle query, where he can also use the Izzone Ness in the.",
            "Temperature and."
        ],
        [
            "And in the unit of measure is a standardized way.",
            "We also need to know to express sensor calibrations in time.",
            "That's one thing that's SSN doesn't do.",
            "It represents is visas restrictions in class, so we need to.",
            "Instances of a sense so that we could do something like finding the less calibration.",
            "So this is an example that use the measurement capability over sensor and use the concept of collaboration event as a.",
            "A type of condition."
        ],
        [
            "And this is a number of instances that are generated that.",
            "From the sensor cloud that is enables us to get there.",
            "Not gonna go through the detail."
        ],
        [
            "Here is so.",
            "Time, um?"
        ],
        [
            "And that other types of.",
            "Of properties that we need, such as the end time and maximum and minimum interval in this measurement capability."
        ],
        [
            "So they had ranking approach."
        ],
        [
            "The question that we're asking for is and how I could select temperature sensors to compute accumulator Bacchus index given a set of criteria such as the proximity of the sensor to the vineyard, the completeness of the time series, if it has caps on auto, and calibration history.",
            "So in our method we use.",
            "And it depends on this RDF repository of the annotated resource, according to a seal, and then we defined fitness functions and fitness statements and queries so that we have a way to talk about fit for purpose selection and ranking.",
            "So the fitness function would give us a value to quantify a quality criterion for the sensor, such as the distance, location, or the number of gaps and fitness function statements that are able to define.",
            "That used the fitness function too.",
            "Talk to qualify the census as unfit or fit for for particular."
        ],
        [
            "Purpose and how important this criteria is, so in more details of fitness function will access."
        ],
        [
            "They they are deaf repositories, verse backward and computer value that is going to be the base of the ranking and the fitness function statement will.",
            "Using that fitness functions with constraint that value and exclude the sensors that don't pass that constraints and it waits it fitness function and it also offers operator."
        ],
        [
            "To sort.",
            "Then so the fitness quotes is just a evaluation over this fitness functions statements and it's implemented as in our ranking algorithm.",
            "So basically what we're doing is to select the.",
            "Observed phenomena as one of the queries that we had before and computed individual rankings for each fitness functional statement and an aggregation is called over all the fitness functions and then sort this."
        ],
        [
            "So we want to test if this ranking algorithm was able to find the optimal solution for as in the case of ranking.",
            "So what we did was to.",
            "To run the accumulated Pakistan disks that we saw before with different temperature sensors, fixing the leaf wetness input and and get the optimal result.",
            "So we use two different types, So what it shows here is that by running the ABI with different temperature sense, we get that the best sense for those that.",
            "In which the output is closest to the baseline.",
            "So we use the spatial distance and a gap count.",
            "Our fitness functions, an aggregate of these two.",
            "And then we.",
            "We compute this for different times as well, and what we so we show is that if we aggregate.",
            "And wait.",
            "They fit in the swing, so for the gap count we get the best result."
        ],
        [
            "And so the results.",
            "So that the way we benefit from combined different fitness that combining fitness functions statements to receive optimal is better to get optimal results in different situations.",
            "And the."
        ],
        [
            "Quality of the ranking depends on the sensitivity of the model.",
            "So we need the.",
            "The model is too.",
            "To capture the sensitivity of the model.",
            "So we propose ontology based framework for finding observation later.",
            "That's fit for purpose.",
            "We applied best practicing extending SN.",
            "Um?",
            "We model the model accounts for the fact that since measurement needs.",
            "Not necessary to be fixed overtime we can use a C 04 or infrastructures with similar requirements."
        ],
        [
            "The ranking has a strong focus on the semantic modeling and and allowing the fitness function consider complex expressions of fitness for purpose.",
            "And I'll finish here."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I work at the CSI row in Tasmania, Australia.",
                    "label": 0
                },
                {
                    "sent": "So my talk is going to be about the use casing Samantha Mobilians ranking for the sense Web.",
                    "label": 1
                },
                {
                    "sent": "I'm going to start with motivation and I use case within our project on the domain of viticulture.",
                    "label": 0
                },
                {
                    "sent": "And then I'm going to talk about the both of US sensor data infrastructure that is used.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The sensor problem college that they developed as an extension of semantic extension of these data infrastructure.",
                    "label": 0
                },
                {
                    "sent": "And then I go into the approach and semantic modeling and the ranking that we have.",
                    "label": 0
                },
                {
                    "sent": "Developed",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So that.",
                    "label": 0
                },
                {
                    "sent": "This project is about managing disease risk and monitoring Frost in vineyards and supporting farmers and vineyard managers in making decisions about crop development.",
                    "label": 1
                },
                {
                    "sent": "By using apps.",
                    "label": 0
                },
                {
                    "sent": "And the goal is to improve productivity and.",
                    "label": 0
                },
                {
                    "sent": "By using low-cost sensing around the vineyard.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So our motivation comes from the user requirements.",
                    "label": 1
                },
                {
                    "sent": "So what the user needs need to to monitor their crops is situational awareness of the environmental conditions in the vineyard.",
                    "label": 1
                },
                {
                    "sent": "They want to visualize raw sense data and the derived variables that they need and prediction models.",
                    "label": 0
                },
                {
                    "sent": "But especially, they they wanted to.",
                    "label": 0
                },
                {
                    "sent": "Use sensors and observations that are fit for a purpose.",
                    "label": 1
                },
                {
                    "sent": "So that means that in the.",
                    "label": 0
                },
                {
                    "sent": "Within of the vineyard or between vineyards.",
                    "label": 0
                },
                {
                    "sent": "Different types of environmental conditions are possible and affect how disease develops.",
                    "label": 0
                },
                {
                    "sent": "Frost develops in specific parts.",
                    "label": 0
                },
                {
                    "sent": "So as part of the fit for purpose ranking that we're trying to develop here, the important thing is to.",
                    "label": 1
                },
                {
                    "sent": "The work that we have been doing is in finding input data to predictive model.",
                    "label": 0
                },
                {
                    "sent": "And this is around the observations and around the sensors.",
                    "label": 0
                },
                {
                    "sent": "So the observed phenomena, the measurement for properties and.",
                    "label": 0
                },
                {
                    "sent": "Location, data quality and the network that's being used.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So as part of the user requirements, we we sit with the plant pathologists and and the managers and they told us what type of variables are important for them to to monitor the vineyard and this is just a list of.",
                    "label": 0
                },
                {
                    "sent": "Up of the variables that they use and here we see that this very simple analytics, but already combination of sensor raw data that is.",
                    "label": 0
                },
                {
                    "sent": "Available from the sensors that are diploid.",
                    "label": 0
                },
                {
                    "sent": "So they use temperature, humidity, rainfall.",
                    "label": 0
                },
                {
                    "sent": "Lift witness and then a combination of this that goes into the calculations of the predictive models.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "Then I start with a use case that we've used in this work and it's about botrytis bunch rot, so this is fungus that cause brought in the Grapevine as we see here so.",
                    "label": 1
                },
                {
                    "sent": "And it needs the right environmental conditions to develop.",
                    "label": 1
                },
                {
                    "sent": "Hence usually when you have cloudy moist weather and with that.",
                    "label": 0
                },
                {
                    "sent": "Temperature range between 1821 and keeps on rainy.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "So it's important for for the farmers to to.",
                    "label": 0
                },
                {
                    "sent": "Predict the risk of botrytis to avoid losing the crop, and there are two key environment variables that is involved in the risk one is temperature.",
                    "label": 0
                },
                {
                    "sent": "This surface wetness duration, so we have.",
                    "label": 0
                },
                {
                    "sent": "The sensors for that they live wetness sensor, for example, measures the electrical resistance of changes in the.",
                    "label": 1
                },
                {
                    "sent": "Presence of free water.",
                    "label": 0
                },
                {
                    "sent": "So one of the.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Variables that we use is the Bacchus that describes the effect of the temperature in the risk of botrytis, and then it shows that.",
                    "label": 0
                },
                {
                    "sent": "For each wet hour, then the temperature affects that risk.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the package index is derived variable that's used commercially already, and so for example, tools such as this example here use the.",
                    "label": 0
                },
                {
                    "sent": "The bug is to show the index increasing with it wet hour and it turns right when the risk is is high.",
                    "label": 1
                },
                {
                    "sent": "So there's that.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This variable is used.",
                    "label": 0
                },
                {
                    "sent": "As part over the early season model.",
                    "label": 0
                },
                {
                    "sent": "So when the Bakassi next is accumulated daily.",
                    "label": 0
                },
                {
                    "sent": "In Indy, during the crop development phase.",
                    "label": 0
                },
                {
                    "sent": "That range from the 5% cap fall and Verizon which is from flowering to the when the great start to ripe.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the our experts have calculated that if that accumulated by scenic state more than 20 days above a threshold line, then they have a high risk.",
                    "label": 1
                },
                {
                    "sent": "So this is in the early season model that predict this.",
                    "label": 0
                },
                {
                    "sent": "And the model is.",
                    "label": 0
                },
                {
                    "sent": "Can can?",
                    "label": 0
                },
                {
                    "sent": "Produce predictive line from regression on the accumulator buckets index and.",
                    "label": 0
                },
                {
                    "sent": "And then and also a threshold line based in the historical data that they have.",
                    "label": 0
                },
                {
                    "sent": "Collect.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'm going to come back to this example.",
                    "label": 0
                },
                {
                    "sent": "I'm going to talk about the sensor infrastructure that we use in the.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Object.",
                    "label": 0
                },
                {
                    "sent": "And the that's called a.",
                    "label": 0
                },
                {
                    "sent": "It is a butene infrastructure called Central Cloud.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "It does what most of these infrastructure do.",
                    "label": 0
                },
                {
                    "sent": "They provide sensory stream processing, data ingestion from different types of sensors?",
                    "label": 1
                },
                {
                    "sent": "Answer Data management in this case is we use Mongo DB data storage and we have Jason documents and format the data.",
                    "label": 1
                },
                {
                    "sent": "We also have a Web API that uses rest to access the data and.",
                    "label": 0
                },
                {
                    "sent": "The URL pattern for access is based on.",
                    "label": 0
                },
                {
                    "sent": "Network IDs, Plataform sensors and phenomena that resembles the way that the sensor networks are deployed in this environment.",
                    "label": 0
                },
                {
                    "sent": "Then we have also.",
                    "label": 0
                },
                {
                    "sent": "Installation of Time series and a few statistical calculations that it can be provided as part of the idea.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's a snapshot of Jason Document, so most of these documents have metadata, so it's a lot more about the networks, the platforms and sisters.",
                    "label": 0
                },
                {
                    "sent": "Such as the location.",
                    "label": 0
                },
                {
                    "sent": "For example, we have long today and latitude for for the platforms and for the sensors, and we have information about the last data that the observation.",
                    "label": 0
                },
                {
                    "sent": "It was measured and then links to the observation values as time series itself.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is just a snapshot of one of the visualization tools that we have.",
                    "label": 0
                },
                {
                    "sent": "It just shows how the.",
                    "label": 0
                },
                {
                    "sent": "The data is virtually structured as documents and follows this hierarchy of network.",
                    "label": 0
                },
                {
                    "sent": "Platform sensors and observations so sensor cloud can be seen as a collection of sensor networks.",
                    "label": 1
                },
                {
                    "sent": "That in this case, each vineyard is a network, and it expands into the platforms that are diploid and for example, the weather station is a platform.",
                    "label": 0
                },
                {
                    "sent": "This weather stations can be exploited in the sensors that it supports, like the Campbell for for air temperature, and then this expands into the observation, let's given.",
                    "label": 0
                },
                {
                    "sent": "But it has a graph visualization for it.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So on top of this data infrastructure we have workflows that we are used to.",
                    "label": 0
                },
                {
                    "sent": "To calculate the variables, these are Kepler workflows and we have a catalog of models.",
                    "label": 1
                },
                {
                    "sent": "And they have the virus, so this workflow gets the.",
                    "label": 0
                },
                {
                    "sent": "These descriptions and it knows which inputs are used in a certain model, and these are the sensory strengths that goes as input.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that you talk about the semantic part.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have extended the sensor cloud with some components to convert RDF from Jason and using this sensor cloud list I'm going to.",
                    "label": 1
                },
                {
                    "sent": "Talk about later and that provides this the right hand side here that is added to the components of that I talked before.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So we.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Created a sensor code on foliage, not.",
                    "label": 0
                },
                {
                    "sent": "In the sense of being a new ontology for sensor data.",
                    "label": 0
                },
                {
                    "sent": "But this is an umbrella and told you that.",
                    "label": 0
                },
                {
                    "sent": "Put together or.",
                    "label": 0
                },
                {
                    "sent": "Accepts that are useful and most of these concepts comes from the SSN ontology, so the prefix in the boxes here in the dark boxes are the ones that we have imported.",
                    "label": 0
                },
                {
                    "sent": "So of course we use the SSN ontology.",
                    "label": 0
                },
                {
                    "sent": "But then it it season ontology at the reflects the structure that we saw before over networks, platforms, sensors and observed data.",
                    "label": 0
                },
                {
                    "sent": "And also use Geo location to get the coordinates of this order sensor and the observation and measurement ontology too, for metadata observation.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So of course, in Subclassing SSN we get access.",
                    "label": 0
                },
                {
                    "sent": "To all the.",
                    "label": 0
                },
                {
                    "sent": "Relationships that SSN offers and then you see that this is a very comprehensive ontology.",
                    "label": 0
                },
                {
                    "sent": "What we had to do is to extend that.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "To be able to to get the data and the relationships that we need for the applications that we are developing.",
                    "label": 0
                },
                {
                    "sent": "So in that is in around sensor distribution, the properties and the measurement capabilities of a sensor.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'm just going to give some examples of what how we extended.",
                    "label": 0
                },
                {
                    "sent": "So for example, we needed to express something like the data some over the Packers index and the inputs of discussing this as being left wetness and at temperature so that we could.",
                    "label": 0
                },
                {
                    "sent": "Find the right type of sensor so we have added the concepts such as functional, modify and temporal modifier and has property part.",
                    "label": 0
                },
                {
                    "sent": "So in this example here you see that as part of observed phenomena which is in this case the SSN observation we.",
                    "label": 1
                },
                {
                    "sent": "We can say.",
                    "label": 0
                },
                {
                    "sent": "That",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The sum of Bacchus index has functional modifier.",
                    "label": 0
                },
                {
                    "sent": "It's called total and the temporal modifier that is called daily.",
                    "label": 0
                },
                {
                    "sent": "And in this case the.",
                    "label": 0
                },
                {
                    "sent": "Of seven property, which is the Bacchus index, it is has two parts.",
                    "label": 0
                },
                {
                    "sent": "One is they live witness and the other one is the temperature.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This is going to be used as part of of the ranking and we want a selection.",
                    "label": 0
                },
                {
                    "sent": "For example, if you want to search for hourly air temperature then we can do this as.",
                    "label": 1
                },
                {
                    "sent": "In this type of sparkle query, where he can also use the Izzone Ness in the.",
                    "label": 0
                },
                {
                    "sent": "Temperature and.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in the unit of measure is a standardized way.",
                    "label": 0
                },
                {
                    "sent": "We also need to know to express sensor calibrations in time.",
                    "label": 0
                },
                {
                    "sent": "That's one thing that's SSN doesn't do.",
                    "label": 0
                },
                {
                    "sent": "It represents is visas restrictions in class, so we need to.",
                    "label": 0
                },
                {
                    "sent": "Instances of a sense so that we could do something like finding the less calibration.",
                    "label": 0
                },
                {
                    "sent": "So this is an example that use the measurement capability over sensor and use the concept of collaboration event as a.",
                    "label": 0
                },
                {
                    "sent": "A type of condition.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is a number of instances that are generated that.",
                    "label": 0
                },
                {
                    "sent": "From the sensor cloud that is enables us to get there.",
                    "label": 0
                },
                {
                    "sent": "Not gonna go through the detail.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here is so.",
                    "label": 0
                },
                {
                    "sent": "Time, um?",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that other types of.",
                    "label": 0
                },
                {
                    "sent": "Of properties that we need, such as the end time and maximum and minimum interval in this measurement capability.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So they had ranking approach.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The question that we're asking for is and how I could select temperature sensors to compute accumulator Bacchus index given a set of criteria such as the proximity of the sensor to the vineyard, the completeness of the time series, if it has caps on auto, and calibration history.",
                    "label": 0
                },
                {
                    "sent": "So in our method we use.",
                    "label": 0
                },
                {
                    "sent": "And it depends on this RDF repository of the annotated resource, according to a seal, and then we defined fitness functions and fitness statements and queries so that we have a way to talk about fit for purpose selection and ranking.",
                    "label": 1
                },
                {
                    "sent": "So the fitness function would give us a value to quantify a quality criterion for the sensor, such as the distance, location, or the number of gaps and fitness function statements that are able to define.",
                    "label": 0
                },
                {
                    "sent": "That used the fitness function too.",
                    "label": 0
                },
                {
                    "sent": "Talk to qualify the census as unfit or fit for for particular.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Purpose and how important this criteria is, so in more details of fitness function will access.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They they are deaf repositories, verse backward and computer value that is going to be the base of the ranking and the fitness function statement will.",
                    "label": 0
                },
                {
                    "sent": "Using that fitness functions with constraint that value and exclude the sensors that don't pass that constraints and it waits it fitness function and it also offers operator.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To sort.",
                    "label": 0
                },
                {
                    "sent": "Then so the fitness quotes is just a evaluation over this fitness functions statements and it's implemented as in our ranking algorithm.",
                    "label": 0
                },
                {
                    "sent": "So basically what we're doing is to select the.",
                    "label": 0
                },
                {
                    "sent": "Observed phenomena as one of the queries that we had before and computed individual rankings for each fitness functional statement and an aggregation is called over all the fitness functions and then sort this.",
                    "label": 1
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we want to test if this ranking algorithm was able to find the optimal solution for as in the case of ranking.",
                    "label": 0
                },
                {
                    "sent": "So what we did was to.",
                    "label": 0
                },
                {
                    "sent": "To run the accumulated Pakistan disks that we saw before with different temperature sensors, fixing the leaf wetness input and and get the optimal result.",
                    "label": 1
                },
                {
                    "sent": "So we use two different types, So what it shows here is that by running the ABI with different temperature sense, we get that the best sense for those that.",
                    "label": 0
                },
                {
                    "sent": "In which the output is closest to the baseline.",
                    "label": 0
                },
                {
                    "sent": "So we use the spatial distance and a gap count.",
                    "label": 0
                },
                {
                    "sent": "Our fitness functions, an aggregate of these two.",
                    "label": 0
                },
                {
                    "sent": "And then we.",
                    "label": 1
                },
                {
                    "sent": "We compute this for different times as well, and what we so we show is that if we aggregate.",
                    "label": 0
                },
                {
                    "sent": "And wait.",
                    "label": 0
                },
                {
                    "sent": "They fit in the swing, so for the gap count we get the best result.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so the results.",
                    "label": 0
                },
                {
                    "sent": "So that the way we benefit from combined different fitness that combining fitness functions statements to receive optimal is better to get optimal results in different situations.",
                    "label": 1
                },
                {
                    "sent": "And the.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Quality of the ranking depends on the sensitivity of the model.",
                    "label": 0
                },
                {
                    "sent": "So we need the.",
                    "label": 0
                },
                {
                    "sent": "The model is too.",
                    "label": 0
                },
                {
                    "sent": "To capture the sensitivity of the model.",
                    "label": 0
                },
                {
                    "sent": "So we propose ontology based framework for finding observation later.",
                    "label": 1
                },
                {
                    "sent": "That's fit for purpose.",
                    "label": 0
                },
                {
                    "sent": "We applied best practicing extending SN.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "We model the model accounts for the fact that since measurement needs.",
                    "label": 1
                },
                {
                    "sent": "Not necessary to be fixed overtime we can use a C 04 or infrastructures with similar requirements.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The ranking has a strong focus on the semantic modeling and and allowing the fitness function consider complex expressions of fitness for purpose.",
                    "label": 0
                },
                {
                    "sent": "And I'll finish here.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": []
        }
    }
}