{
    "id": "bnsmztzrs6giehpfvfooa5okltn4znjx",
    "title": "Using Data for Social Good",
    "info": {
        "author": [
            "Rayid Ghani, Center for Data Science and Public Policy, University of Chicago"
        ],
        "published": "June 23, 2014",
        "recorded": "April 2014",
        "category": [
            "Top->Social Sciences->Education",
            "Top->Social Sciences->Society->Public Policy"
        ]
    },
    "url": "http://videolectures.net/ocwc2014_ghani_social_good/",
    "segmentation": [
        [
            "Thank you Colin.",
            "It is really good to be here and it's my second OSW for global conference and the first one I went to was about three years ago.",
            "This was the 10 year.",
            "In Cambridge, and that was an interesting time for me personally, because.",
            "I was trying to figure out what I really wanted to do when I sort of grew up right, so I had spent a lot of time as a computer scientist in a research lab working on really interesting research problems, mostly applied to businesses, but that wasn't satisfying enough that was intellectually satisfying, not sort of socially satisfying.",
            "I wasn't really making a social impact, so I was very good on the data side.",
            "Social good was sort of an afterthought on the weekends when I would, you know, help kids with something good.",
            "Teach students and that that kind of thing.",
            "That sort of was it was a side thing and about three years ago was when I really thought that can happen.",
            "I need to put these two things together.",
            "And I was talking to a couple of people over here, including media and marketing, so we're going to this CWC global Conference and Cambridge.",
            "You should see what kind of people work people are doing.",
            "It's closer to what you're interested in, so I went over there an that was really.",
            "Inspiring in many many, many ways right.",
            "There were people there who were interested in research, but they were really more interested in making an impact impact in education, impact and sort of making things equal for people around the world.",
            "And then we start sort of was that got me along the path of thinking about how would I do the same thing because I am not the best person to create educational content.",
            "I'm better at doing other things and that led me to basically a couple of months after that.",
            "So live in Chicago, Chicago happened to be the place where Obama started his reelection campaign and they happen to hear that I was thinking about leaving my job and looking for something that had slightly more social impact than than I was doing before.",
            "And they asked me to come join the team and that was sort of a transition point for me where I started looking at data, not just something you would sort of do for business reasons, but also something that could take a large part of society, an mobilize them towards some sort of collective action, right?",
            "How do you?",
            "And the summary coming out of the Obama campaign.",
            "So you guys here must have heard about, you know lots of things around the hype around data in social media and all sorts of buzzwords around the campaign.",
            "For me personally, that the lesson coming out of a large election campaign like that which spent you know, ridiculous amount of money.",
            "A billion dollars had about 2 1/2 million volunteers that the key takeaway for me was that that we were able to mobilize around 2 1/2 million people as volunteers in the country and direct them in a way that was able to achieve very specific outcomes.",
            "Ann and we will do that through data was part of it, but I think you know primarily was taking people's motivations.",
            "That excitement, their enthusiasm that doesn't come from data that has to be other things that has to be your policy is it has to be.",
            "What your exciting people about?",
            "But then, once they're excited, what do you ask them to do?",
            "And just ask them to, you know post on Twitter.",
            "Completely useless for most practical purposes.",
            "Or you can ask them to talk to their friends and convince them to vote much more useful if you're trying to win the election an so that wasn't, we need to take away when I left finished elections going very same place where I was three years ago is OK.",
            "I've done that.",
            "Now how do I do?",
            "How do I sort of sustain work like that?",
            "An one of the things that surprise me which to you guys shouldn't should be sort of obvious as there are lots of problems in the world.",
            "That we can solve using data and a lot of the big social issues.",
            "That is not a new concept except if you go into a computer science Graduate School and tell students that you get very puzzled looks on their faces and I sort of an experience that it was probably expected them to sort of say yeah yeah, yeah we know education and health and energy and public safety are all issues.",
            "We can do something about, but one there is no money in these problems.",
            "You know like rather go to Google and Facebook and LinkedIn and Foursquare and Pinterest and Twitter and.",
            "Name your other.",
            "You know finance and hedge funds.",
            "I'd rather go there and make a lot of money, but then these problems don't have any money in there too.",
            "It's not very sexy to work on, you know health care and education.",
            "You know it's why would I do that?",
            "Why?",
            "If I can predict which friends you're going to have on Facebook, it's much more exciting.",
            "Then the response I got instead was not that their fonts was, huh, you?",
            "These are problems that we can actually do something about.",
            "There's data around it and that we can make an impact.",
            "There was a surprise for them so that.",
            "Plus, talking to a lot of NGOs, nonprofits, foundations, who were, you know, every day in their lives trying to to to do sort of what we would call social good.",
            "They were really struggling with using data better, right?",
            "So you here again, everybody is talking about big data or kinds of data, and nobody really knows what to do with it, specially when it comes to governments and nonprofits and people who are really trying to solve the larger problems other than search rankings.",
            "And friends suggestions.",
            "And so I think the challenges they were facing with one they didn't have people to do this kind of work.",
            "The people who had those skills were not interested in doing these in working on these problems, not because they weren't interested in general, but because they had no idea these problems existed.",
            "The people who had the interests didn't have the skills, so people who are typically in government and nonprofits don't have these these skills.",
            "The second thing was that they didn't really have examples from which to sort of get motivated by.",
            "It's very hard to start doing something new if you see none of your peers doing it and it only examples you see that are successful are coming from very large companies.",
            "Again, Google and Twitter who have a lot more money than most nonprofits do.",
            "The third problem was if they wanted to get started.",
            "Let's say they had the motivation.",
            "They were excited and they finally could find the people.",
            "Maybe one person that they always hire, which is the data person.",
            "They didn't really know.",
            "They don't really have any tools to start with.",
            "You know the computer science machine learning data mining community.",
            "Has been pretty good at putting out lots of code out there.",
            "It is open source but not solutions, not something somebody could take their very few of those out there where you know somebody who's not very well trained has a problem.",
            "Can just take something and start using it and build on the on top of that and so that those are the challenges that kind of motivate me to think about.",
            "How do we start solving that problem?",
            "How do we start creating more people with the skills and the interest and the passion to solve large high impact social problems?",
            "How do we give these organizations examples of work that they can say?",
            "Yes, I can do that.",
            "It's not just for large corporations who have invested years and years and and billions of dollars.",
            "And then how do we give them tools that they can start working on?",
            "They can start from and build on top of.",
            "The first step that led me towards that was about a year ago very sort of last minute.",
            "So I join you in Chicago about a year ago and the idea was to be able to bring together people with computer science, statistics, social Sciences, econometrics, public policy backgrounds and start working towards problems that require all of those.",
            "It's not a siloed solution an we started off with the program.",
            "I called data science for social good.",
            "And that was a program launched about a year ago, so Summer Fellowship program.",
            "The goal was initially to get students and get them to come to Chicago.",
            "So we had.",
            "We started this program last summer and last the first year we had."
        ],
        [
            "About 36 students and then this is sort of the CS program we got about 36 students to come to Chicago and there from mostly graduate students, mostly computer science, some statistics, some ikkicon policy, social Sciences, and kind of put them together with mentors for summers over 12 weeks from June to September, they spent the summer working on projects that we painfully created with lots of nonprofits and governments, right?",
            "So we talked to lots of government agencies, will talk to you when we talked to nonprofits and created projects with real data with real problems.",
            "That we could use to not only train these students, but also inspire them 'cause the three month period is is not enough for either.",
            "So you can train people a little bit, but if they get excited about these problems they will continue to work on these things.",
            "And that was sort of the goal is get them along a path that they can do something useful.",
            "Was surprising, I'll tell you a bit more about the program, but was sort of interesting was.",
            "The announcement the first announcement went out of March 15th and it was a last minute program.",
            "We were starting up.",
            "We got funding for it and wanted to start June 1st where everything starts so March 15th I send out an email to pretty much most of my friends who are in different graduate schools teaching and said here's an application form.",
            "Get your students to apply to this program.",
            "Deadline is April 1st, so it's two weeks left in two weeks we got."
        ],
        [
            "About 600 applications for this program and it was not very well advertised.",
            "It was just a very last minute program and that got me sort of surprising was that it came from everywhere around the world.",
            "I know it wasn't.",
            "We weren't really going to get a global audience, mostly because getting visas to the US is a pain.",
            "US is not very good at letting people in or let me in many other things too, but so we weren't really trying to deal with that problem, But what was?",
            "Inspiring and surprising at the same time was that we got a lot of interest from people and the common thing we heard from a lot of people was that they they would love to do something like this, but there was no venue that existed for them to take advantage of these skills.",
            "It wasn't again the same thing as I talked about before.",
            "Is people were interested but didn't know what to do about it.",
            "How to get there?",
            "So what I want to do is quickly show you instead of talking more about it myself through a video that we made with some of the students that were part of this.",
            "So you can give you a flavor of who was there and what kind of students, and then I'll jump into giving you more concrete examples of what kind of projects we did, and then what's possible to do if you start putting data together with these things.",
            "So let me show you a quick video."
        ],
        [
            "The goal of the data signs for social Good Fellowship is really to take data scientists and train them to work on problems to solve problems that actually matter and what I mean by that is people who have computer science and statistics and economics and policy and analytical skills.",
            "Giving them an environment where they learn how to not only solve real problems, but focus on problems that have social impact in areas such as education and energy and healthcare and transportation, public safety.",
            "So we wanted to do was build this hybrid person who has all these different skills but also understands how to take real problems, communicate with people about those problems, solve them and then help figure out a way to transfer and transition those solutions into the real world to the partner organizations.",
            "I saw this advertisement for the Fellowship and it said data science and social good, and I thought to myself, wow, that's.",
            "That's exactly what I'm looking for, something that has all the neat data technology.",
            "Those interesting problems, those fun problems as hard problems, but problems in the area of social goods.",
            "Something that is able to improve people's lives.",
            "I heard about the program through my advisor.",
            "He pulled me in since the beginning just because I understand the amount of good that you can do with a little bit of data.",
            "The reason that we're doing this program with Argon in the University of Chicago, and the reason that this is the right place to do this is that this is one of the few places where we have the right expertise in the system Sciences and then the social scientists to bring together.",
            "And to answer these questions in a way that's much more holistic than just looking at one or the other.",
            "My background is in astrophysics, an I found that coming from the hard Sciences to this program.",
            "It was a really interesting transition because I was still working with students, but I was doing so in a way that was expected to produce results rather than just papers.",
            "I'm working with Nurse Family Partnership, but their home Visitation program they send nurses into the homes of at risk women first time mothers.",
            "My team is working with the new government organization called the Cook County Land Bank.",
            "We're creating a new analytical tool to help the organization decide which properties to invest in have the greatest impact and reversing neighborhood decline our project this summer was working with Mesa public Schools.",
            "Identify cases of missed educational opportunities and ensure that students go to college.",
            "Is that best serve their educational potential of my team?",
            "Is working with the CTA.",
            "We're working on a problem that affects a lot of people around many cities, which is crowding on buses.",
            "There been a lot of learning launches, a lot of talks and a lot of this person to person.",
            "Opportunities to hit the white board and to be learning different programming tools.",
            "You know, different packages within tools that a lot of people when they came in.",
            "They really cared a lot about technical problems and what you sort of notices.",
            "We start talking to our partners.",
            "They go out in the field and see how things these things get implemented, how the data is actually collected.",
            "So they went from thinking of a spreadsheet or database as a data set to actual people behind them.",
            "Actual stories.",
            "The goal is to provide these women with the source of support and health education.",
            "Hopefully this will make my share of a more viable part of our public transit system by inferring a lot of these funding relationships.",
            "We let nonprofits spend a lot less time searching for information on the web and actually doing the work that they're trying to do to make the world a better place.",
            "Thank you for your time.",
            "We started off from such different backgrounds from such different parts of the world, and we've really come together with this common purpose and goal.",
            "You'll spend your mornings at City Hall working to understand the problem with city faces, then afternoons coding together as a team, trying to solve that problem each day is so full and fulfilling.",
            "You can't wait for the next one.",
            "I can't think of a better way to spend your summer.",
            "I wish I could do DSG for the rest of my life.",
            "Honestly, it's been a lot of fun and this is the kind of work I want to do.",
            "You know, I'm interested in applying.",
            "Quantitatively grounded analysis and ways of thinking to problems that you know really keep me up at night to problems.",
            "I think it really matters.",
            "So hopefully."
        ],
        [
            "And it gives you the kind of students we had.",
            "I think one thing that that if I was back three years ago in my computer science world, all these people were people I would never have encountered.",
            "'cause we sort of live in very siloed world where only dealing with people who work on exactly the same research problems as as we do anyone interested.",
            "But here was we were able to really take people from different areas kind of bring him on board until the same problems 'cause they all cared about solving specific problems as opposed to tide to their their own.",
            "Area so we got computer science people, machine learning, people, stats, people, economics, public policy.",
            "We had a person doing criminal justice.",
            "It a sociologist.",
            "We had linguistics people an the goal is to really train them all together using specific projects or so.",
            "Everybody worked on a real project.",
            "So what I want to do is give you a flavor of what kind of things you know we hear about typically with data is generally even you hear bout data you hear bout, you know marketing and finance an surveillance.",
            "And those are those are the big.",
            "Uses of data.",
            "Turns out, I think that is much more useful for many, many many other things, right?",
            "So here's some list of partners and this was really the key for making this program work.",
            "Is having strong partners who were able to work with us to give us real problems that were motivating, inspiring, and then use our results to do something with impact, right?",
            "So we got one of the projects we worked with was.",
            "With."
        ],
        [
            "This organization called County line banking.",
            "This is in Chicago or the larger Chicago area and one of the problems that they were facing that there were lots of abandoned properties.",
            "Homes that people left because they couldn't pay their mortgage and they just abandoned them and that is happening all over Chicago and all over the US.",
            "So the they were struggling was they had some funding to figure out where to invest, which properties to invest in in terms of build rebuilding them.",
            "Paying somebody to live in them, whatever needs to be done, what do you do to these properties that return that sort of results in the most economic impact to the surrounding areas?",
            "And you know, typically if this is the government you know you don't take the rational decision.",
            "You just sort of do something, do a press release, and move on with this organization was really interested in doing was.",
            "Let's figure out the actual impact of each of our actions so we can look at data ANAN kind of use, a tool to do some data analysis, and then look at see, figure out where to impact needs to be.",
            "In order to take where the the actions need to make the most impact, so we help them look through date, property, data, economic data, business data over the summer in these areas and help them figure out where they should be investing an an where the investments make the most sense in terms of different kinds of impact.",
            "Now the interesting thing here is that often these organizations don't know what they are trying to optimize.",
            "You know when you ask them what you want to do?",
            "When I improve community and improve economic activity, what does that mean?",
            "Are you trying to get more people to live in this area?",
            "Are you trying to get more businesses to come in this area?",
            "Are you trying to increase the revenue for those businesses you're trying to figure out?",
            "How do you invest so there are lots of competing goals and just talking through data methods helps them think through these options.",
            "Think through these goals and really figure out what are they really trying to achieve."
        ],
        [
            "I'm not going to go into too much detail in each project, but the second one of the problems we work with is a public transit where again, a lot of bus and train or systems are not the most optimized systems and the way they typically.",
            "So this one that we were working with, what they would do is they would see you know buses had a schedule and at some point traffic would happen and buses would start bunching together, right?",
            "So you sort of have this problem of you have a bus over here.",
            "Shops in traffic.",
            "There's a bus right after it, so they just make one.",
            "They make it ad hoc decision.",
            "Well, let's just let's this bus go express.",
            "And they have no idea what the impact of that is to the rest of the system.",
            "They're just optimizing that bus.",
            "And So what we did with them as we looked at all the tracking data over each bus has a GPS sensor.",
            "And then when you go into a bus it also records.",
            "You know how many people are getting in getting off, so we use that to basically figure, predict not just the demand of the the bus at each stop, but then built them a tool that they could use to simulate the effect of these kinds of changing.",
            "So if things are bunching up and you say this bus needs to go for.",
            "Stops Express not only how does it affect the people at those stops, but then, where would those people end up going with the bus?",
            "They would take what we visit, impact over on the entire system and then help them improve.",
            "Improve that."
        ],
        [
            "This was an interesting program as a nonprofit that's called Nurse Family Partnership.",
            "It's it's a nonprofit that's been going on for about 20 ish years and they started off with some controlled experiments that did to show that if you put a nurse together with an expecting mother, typically young, first time unmarried.",
            "And low economic status mother.",
            "It's the outcomes are good for both the kid who was born and for the mother as well.",
            "So they had been working for many many years as part of some funding up in you have heard about the Obamacare happening in the US as part of that they were being asked to help them figure out how much impact they've had so they can be allocated.",
            "These programs can be allocated the right amount of money.",
            "And so when you ask a nonprofit how much impact you've had, they they sort of we've been working for 20 years.",
            "We've helped this many people.",
            "We don't know how to quantify that impact, so they came to us for help in trying to figure out how do I quantify that impact and the normal answer would be let's run some experiments like, well, you can't really run.",
            "Experiments have been already doing this work for 20 years.",
            "How do we quantify that?",
            "So what we did with them was we looked at their data over the past several years of who are the mothers they have.",
            "They have treated, they worked with and what sorts of outcomes they cared about.",
            "So we looked at a few different indicators.",
            "The kind of things that cared about where breastfeeding rates with and without them.",
            "Immunization rates for kids with and without them.",
            "And because they don't really have a control group in there.",
            "What we did was going to use this technique, which in econometrics called matching as you find similar people in because what you do is if you took the average immunization rate of the people they had treated, it wouldn't be very high.",
            "It might be 84%, whereas the average population might be 88%.",
            "So if you just look at that as well, that they actually hurt these people, it would have been 88 if you hadn't touched them in any way.",
            "Now you move them to 84.",
            "Except that's not correct because the people they had treated would have been 65 without them.",
            "But you don't really know that.",
            "So what we did was we use a very simple thing called propensity matching where we took model to see you know, these are the people who are very similar to the ones you treated, but you didn't treat for different reasons.",
            "They weren't in the right location, they just only treat that many people in a given weekend and you picked randomly or somewhat semi randomly.",
            "So we made a few assumptions.",
            "But the idea was to kind of give them at least ballpark order of magnitude numbers.",
            "That they could go back and say, here's the approximate.",
            "Impact we've had because that number would need to be decided, right?",
            "It wasn't.",
            "It was going to be done randomly if they didn't come up with a semi connotative, analytical, rational method that could be justified.",
            "So we work with them and what we're doing this summer is continuing this work from going from impact measurement to more.",
            "How do I figure out who I should treat by looking at who I can have the most impact on?",
            "And then when I want to treat them, what's the right treatment today?",
            "They basically have one program that they find a person and they work with that person for that amount of time.",
            "Well, they sort of realized doing this kind of analysis.",
            "Is that different kinds of treatments work better for different people, which is again obvious to sort of an average person, but you still don't know what the treatment needs to be.",
            "So what we're working with them this summer is trying to figure out how do you, what they called dosage, how much interaction does a person need, after which the impact is really not that much.",
            "There's no plateaus.",
            "Can you figure out that that dosage amount of effort required for each person and use that to treat these people?"
        ],
        [
            "This was a project with the hospital and the code.",
            "Blue is basically cardiac arrest.",
            "People go into cardiac arrest and there are two problems with cardiac arrest with code Blue One is unfortunately person dies most of the time.",
            "The second problem is that there's opportunity cost, so if you've watched TV shows like the ER and when if code Blue happens everybody drops everything else and goes to that patient.",
            "So your chances of saving that person are pretty low.",
            "But you're also dropping everything else, and so there's opportunity cost.",
            "So right now there is really most.",
            "Hospitals have a very simple rule based system that they.",
            "If this happens, then this person might go into code blue or the next X number of minutes.",
            "So they're not very proactive about it.",
            "What we did, we looked at their data an built a protective model that would predict this person is going to go into cardiac arrest in the next.",
            "You know, we had sort of an R2 hours 4 hours.",
            "8 hours and using that could reallocate different different kinds of resource, right?",
            "So if we predicted this person might go into code blue in the next R, and if a doctor is kind of doing a routine round and checkups?",
            "Well, let's just spend some more time with this person now so you don't have the opportunity cost later.",
            "And so the key here is to have a lot of examples I'm giving is there is sort of the first problem of some sort of prediction, but then the second problem of how do you use that prediction to change your decisions?",
            "'cause you could just keep predicting code blue code, blue code, blue all the time and not do anything with it.",
            "'cause it's often not easy to take.",
            "The next step is how do I change my action now that I can do something better and over here we really work with him to figure out how do you allocate your resources afterwards better?"
        ],
        [
            "This was a project we work with this nonprofit, called Ushahidi, which came out of the Kenyan elections a few years ago and they built this crowdsourcing tool which was really designed to when a disaster is happening or a big event is happening that could have problems like elections in many countries.",
            "We actually in the bombing campaign use the same system people.",
            "If you could set up the system and then people start sending text messages, tweets, emails, whatever they want to report different problems.",
            "So they might say you know there is violence going on in this area or there an earthquake happens.",
            "Medical help is needed over here.",
            "This person needs some sort of support, and so people just send data messages in different forms to that.",
            "The way the system works.",
            "Right now it is really crowdsourced, which is great, but it requires humans and mostly all volunteers to do a few different things.",
            "A message comes in and somebody has to 1st figure out what language is it in.",
            "Because it's system that's deployed all across the world.",
            "So you're detecting the language and then your routing it.",
            "The person who knows that language, the person who knows that language looks at this and says, oh, this is about medical help, so they tag it with medical help.",
            "It has to be structured.",
            "Otherwise how would you provide that you have to write it the right people?",
            "Then they have to router that people.",
            "There's often sensitive information in these in these things they give names of people, phone numbers, text message numbers, email addresses, and and often in these type of things those are sensitive pieces of information that you don't want to give out.",
            "Specially in you know Kenyan elections.",
            "If somebody complains about voting fraud or somebody is harassing me so then they redact information that take out names, and then they sort of do something with it, right?",
            "So that's a pretty expensive process, an A lot of these things can be fairly well automated.",
            "There are lots of tools out there, lots of methods that people have developed that can detect language that can do translation that can do reduction that can do classification into these type of things.",
            "So a lot of these things already exist that just weren't being used in this area.",
            "So we worked with this nonprofit and there's an there.",
            "The open source software to basically add a module in there that would do all these different things to make the system a lot more collaborative between the computer and the human where the computer would suggest you know which would detect the language, it would start tagging things.",
            "It would start suggesting redaction candidates and then he was kind of just say Yep.",
            "Yep, Yep, that looks right and then publish it out.",
            "So that was something that's in that software now deployed."
        ],
        [
            "Um, this problem was an interesting problem that this was.",
            "This is a school system in Arizona Mesa Public School System and they heard about our program pretty early on an they sort of emailed me saying, you know, we love this kind of idea of using data.",
            "We've been trying to figure out how to use data.",
            "We have have a big problem in our big problem is that are we think we have smart students, but they don't really go to college or when they do go to college, they go to a lot of the people who are local in the US.",
            "At these two year community colleges they are local Community College.",
            "And the graduation rate.",
            "There is about 13%.",
            "That's 1 three and we don't know we can.",
            "We can if we only knew which students were sort of capable of going to a better college, we could help them along that path.",
            "But we don't know which ones, so we can't really target all of them.",
            "We don't have resources, so this broader problem is called under matching, where if you are a student who is capable and motivated to go to some kind of higher education system.",
            "But you don't go there, you don't apply.",
            "You don't even know about the man that's called under matching, and it happens for many reasons.",
            "You know you would sort of say, well, everybody knows how to apply to college, but turns out that's not true if you don't have anybody else around you who has ever been to college who's ever applied to college, it's not obvious how you would do that.",
            "People don't apply to college because one they think it's too expensive.",
            "They don't know there are scholarship opportunities.",
            "Again, this is a USA college is very expensive, but there are alternative opportunities.",
            "Some people don't apply to college because I think it's too expensive to apply 'cause it cost $100 application fees to apply to each college, but they don't know is you can get an application fee waiver if you qualify.",
            "Some people have college because I think so I probably can't get in because I don't know anybody else who's gotten into that University.",
            "So they came to us with this problem and then they said, well, we've been putting all our data together about our students for the past several years, and then we bought a copy of this software called SPSS, which is for those.",
            "If you don't know, it's a stats analysis software, but we don't really know what to do with that software.",
            "Can you guys help us?",
            "And so we started working with them last summer an we did a couple of different things.",
            "One is they had put together data about their students.",
            "Throughout each school year, so their grades, their test scores there, how often they come to school, where they live, and then they had data on where they went to college college, did they?",
            "How they continue through college and University and that they graduated from college, right?",
            "So they had basically the whole stream of data about students.",
            "For many many many many years.",
            "So what we did with them initially was two kinds of things.",
            "One is we looked at that data and 1st build a model to predict who is likely to.",
            "Apply to college, get into college, an earthly who's likely to get into college and graduate from college, right?",
            "Because if they if they don't get in and they apply, that's not really a good thing.",
            "If they don't graduate on a good thing.",
            "So one is, you know, can we predict some sort of potential of these students where they are capable of graduating from these kinds of colleges?",
            "Second thing is, can we predict if they're going to apply to these colleges at all?",
            "And if we put the two together so we put these two things together and gave the school a ranked list for each of their schools?",
            "For students who are?",
            "Most capable of going to this college and graduating, but also most likely not to apply to these things.",
            "So for the highest risk, students with the highest potential and gave them a list of sort of film going down so the beginning when they looked at this list, they were sort of not sceptical, but like OK, well that's the list I've met.",
            "I'm sure it's you know, it may be right, so they start looking at it looking at it more and said, oh, that's interesting.",
            "The people we had done so they had done a survey at the end of the school year asking people where you're applying to college.",
            "And because we started working with them.",
            "Before that we didn't get that data, so they look.",
            "They didn't say oh the people who had who were high on your list when we ask them where they're applying to college had left it pretty much blank.",
            "There was no answer and the people who were at the bottom of our list the least risk students had a list of list of schools.",
            "So my first reaction was oh so when then then this is useless for you, right?",
            "Because you already know the answer, which students to target and they said, well, no, because if you ask them this question, it helps you get it.",
            "Half the students will leave it blank and so we don't.",
            "Our resources that we have in order to do interventions with these students are fairly limited, so we really needed a ranked list.",
            "We don't need sort of groupings of people.",
            "The second thing was that as they started looking at this data more and more, they realized that they could start running these interventions through in the US again that these guidance school guidance counselors in schools who help you get into college, but they are overwhelmed with you.",
            "Know the ratio of students to the counselors is is pretty large and so they really overwhelmed.",
            "So what we could have helped them do is figure out.",
            "Which students need to be targeted in order for these interventions for these interventions so that they end up applying to college and we're doing basic result of that is continuing this work with a larger number of schools so they went out and got a lot of other schools and we're still continuing this kind of work with a lot of other school systems, not just on college admissions, but in general around how to take how to use the student records better in order to college retention, to do better student education plans, and really sort of start going and doing.",
            "More interesting things and helping them be more data driven because I think one of the challenges in.",
            "In a lot of this kind of work, is you really have to bring together a lot of different disciplines, right?",
            "So typically if you loaded the computer science world in the machine learning world, people are fascinated by predictions.",
            "Everybody is talking about.",
            "Predictions and predictions are great.",
            "We are really good at that.",
            "At this point we can predict you're going to go to this college, but often with the world really wants is the next step of behavior change, right?",
            "I once I've predicted you're not going to go to college, I can say, OK, good for you.",
            "I'm not, you know, I've predicted that I'm done with my job, but what's really important here is prediction is useless if I can't do any interventions with them.",
            "If I can't change their behavior and social scientists have been really focused a lot on behavior changes, spend a lot of time trying to do experiments to figure out how do I.",
            "How do I get people to do something that's good for them?",
            "Or in some cases, bad for them?",
            "Unfortunately, like making them buy cigarettes, for example, where people are really good at that.",
            "But I think the key is to sort of bring together these two disciplines.",
            "Where you're starting to put together large scale data analysis, computational techniques that people machine learning, and stats in computer science have been building, but then putting them together with a lot of social science work where you're really focused on large social problems and changing behaviors of people at a very large scale.",
            "And that's sort of the idea for a lot of these different projects.",
            "And it's not just sort of the summer program in Chicago, there's a lot of other things that are starting up in this area, so there's an organization New York called data kind, and what they do is.",
            "They put together volunteers with data skills with nonprofits who have interesting problems like, like we're working on there, just more doing it on a volunteer basis.",
            "There are other universities who are starting to look at these programs.",
            "Say, you know there are students who are interested in this.",
            "So Georgia Tech is running a very version of our program this summer to see how they can work with City of Atlanta to do the same thing we have been talking to a lot of different universities.",
            "NYU in Columbia and Stanford and Berkeley and Santa Cruz.",
            "As well as other European universities are going to see how do we take this interest and excitement from students who are really excited about this thing and all the problems that exist out there, right?",
            "So a lot of the projects I've talked about where US based now.",
            "It's not because the most critical problem society are happening in the US.",
            "That's not true at all, but you sort of need some basic infrastructure to solve these problems and a lot of the infrastructure today is really.",
            "Mostly exists in the developing world, and so the idea is that if we can start solving these problems and Start learning about what kind of infrastructure do you need to build.",
            "If you're starting to collect education data and healthcare data in the US and in developing countries in the Western Europe, you've got the infrastructure to collect a lot of data, maybe only a small part of it is useful.",
            "So if you can learn and figure out what parts of it are useful, you can take that information and then help build infrastructures in other countries.",
            "You don't need to collect 300 pieces of data if you're building a new system in a developing country where you have resources are very limited.",
            "You just need these 20 pieces, but you don't know which 20 pieces, right?",
            "So by doing this kind of work in areas where infrastructure is already exist, you can start putting together sort of trainings and materials that help people build these systems in other countries.",
            "So there Chicago we're running some of my colleagues at running a program in India that's a yearlong fellowship where they're sending about five teams of students for a year to work with community development organizations in India and one of the things we've been talking about is is combining this program.",
            "With the summer program where the students start off by looking at data about those communities, doing some analysis, and then spending a year on the ground in the field is one of the things that's, you know.",
            "Computer scientists are not very good at, is being in the field like we like to fit in front of the computer and look at spreadsheets and databases and build models and one of the things that was interesting about the summer program was I had to really force a lot of these students to look at the data at least and go out in the field and figure out you know how many buses are there in this city.",
            "How many people use those buses as opposed to.",
            "A matrix that they're analyzing without having any context, and so I think going out into the field is really important, and the only way you can do that.",
            "As if you have a lot of buying support from these organizations, and so I think that's sort of the key for a lot of these programs.",
            "Basically what I wanted to do now I'm gonna leave time for questions one does give you guys an overview of one.",
            "There is a lot of interest in in in in students.",
            "People with these skills to work on these types of problems and I think you know the what you guys are sort of could be very helpful and is articulating those problems.",
            "Right?",
            "What are the big problems in education?",
            "What are the big problems in content development where the big problems in giving access to educational content?",
            "Because you guys are the ones who have who have those ideas who deal with those problems.",
            "There are a lot of these people who have skills in data analysis in computer science and stats and social Sciences.",
            "Who would love to help with those problems?",
            "I mean, you know that was looking through some of the when I was sitting in these talks.",
            "You know there are a lot of problems like we could do something about that, but those people have no idea that you have these problems because we only talk about them.",
            "You know, in in these places and not outside where you could really get help.",
            "And so I think one of the things that we really helpful is to use other venues to talk about these types of things, right?",
            "So for example, this, there's a conference called KDD, took Knowledge Discovery and data mining.",
            "It is sort of the big the main computer science conference on data analysis.",
            "It's happening in New York in August, and the theme for that conference is social good.",
            "And the idea is that we want to get people from outside our community to come.",
            "Basically just talk about problems so that we can better understand what those problems are.",
            "An hopefully guide, motivate and influence the research that's happening.",
            "This is going to happen regardless, so I'd rather be focused on problems that actually have an impact, then focused on problems of Google and LinkedIn and Yahoo and Foursquare and Twitter, which is what happens today because they come and talk about their problems.",
            "Nobody else comes so with that kind of leave time for questions, but an happy to take questions now and as well as I'm around.",
            "Next couple of days.",
            "So happy to talk if you have interesting problems.",
            "If you have, you know you've been working on these type of things.",
            "I'm always looking for sort of more people to collaborate with, so thank you."
        ],
        [
            "I have one comment and one maybe a little bit provocative question where I would like to get your opinion on so the comment is.",
            "I personally don't like the term big data.",
            "I know it's not the big password.",
            "I prefer the term data mining because that's most mostly it's done.",
            "Now my question is so this is very recent activity and now data mining and machine learning techniques are being injected in these public service.",
            "Domains now if remember like 15 years ago.",
            "Data mining was a standard technique in commercial businesses.",
            "So Walmart had a first petabyte data warehouse.",
            "They were frequently mining it and optimizing their their pricing of products of chip prices go up when the when the beer prices are on sale and things like that and credit companies were always doing data mining to detect fraudulent.",
            "Transactions etc.",
            "So I know these are non profit businesses as we would call them but in the end I mean they're operating on public money tax, money bus services are actually sort of semi profit company.",
            "They don't need to make profit but they should at least break Even so they have an interest in getting the most out of the money, taxpayer money or wherever the funding comes from in order to offer the best services.",
            "Why in the world did it take so long to pick up on technology?",
            "Why do policymakers that really have to make informed decisions not rely heavily on third data analysis, but always do these gut feeling decisions?",
            "I mean, This is Money well invested.",
            "What is your opinion?",
            "Why?",
            "Why is it so difficult to get it to policymakers, right?",
            "You should have asked this question yesterday.",
            "So yeah, the right people there yesterday to ask that question and see what they say because they are the people to question these.",
            "Yeah, but you know you've been working with them.",
            "I'm pretty sure you will give them more honest answer then they would give.",
            "Yeah 'cause I'm not running for any office so I can.",
            "I can give you an answer.",
            "So I think so.",
            "Your first question was or comment was, you don't like the term big data.",
            "You prefer data mining.",
            "So if you notice in my slides, there was no big data anywhere, right?",
            "Because I think it's I have a feeling it's a buzzword type.",
            "It's marketing IBM wants to sell products.",
            "They'll put it up there, that's fine, whatever that they can do.",
            "All that all I care about is people doing slightly more rational decision making, right?",
            "So whatever you if you, if you prefer data mining and call it that the problem as I talked as I work with people outside the core area, different terms mean different things to them.",
            "So to most people in social Sciences, public policy, even government data mining means one of two things.",
            "Either we're looking at, you know, private data of individuals and trying to find something really deep that's bad about them, or data mining means looking for random correlations.",
            "So both of those are not accurate, and so I sort of use all synonyms at the same time.",
            "So whatever you take it to mean, you can use that term, but I think that's the right way for people to at least.",
            "Broadened the scope where if you, I would just say data mining without explaining it and people would say, well we don't do that like no, no you do.",
            "It's just you call it something else.",
            "Think so.",
            "So what you were saying about nonprofits and the yeah?",
            "I mean, they're optimizing something an so the first thing is they're optimizing something, but often they don't know what they're optimizing, so they want to get the bus service, for example.",
            "They certainly shouldn't be optimizing profit, because that's not their goal there.",
            "Being giving money to make things better for the people there serving now, they've never been able to articulate what is it mathematically that they're optimizing, right?",
            "So I would argue they are making it possible, so you could you could imagine.",
            "The goal could be the shortest commute time, average shortest commute time for the entire city, like that's a good goal, but you could also say, well, you know a lot of people don't need to get to their work on time, so maybe you want to Max it.",
            "You want to minimize the Max transit time, right?",
            "So that's life makes life better for people who are living really far away or you want to make the decrease the transit time for people who are living in the least accessible places, or in the poorest neighborhoods.",
            "Or the people who need help the most.",
            "And so you could have all sorts of things, but they don't think about them that way.",
            "So I think the good thing about talking about them through data is that you make them force you busy forced them to think about these choices because policy is being implemented in code that forces you to make a decision.",
            "You can't just hand wave and do a campaign speech and say I will make things better for everyone like no.",
            "Well, I'm looking at your code, and that code is not making things better for everyone.",
            "It's optimizing for this group of people, and I think that's something that politicians.",
            "Our our haven't quite figured out but small pockets of these organizations are being forced to think that way.",
            "The reason they haven't been forced thing that way is for one thing, the data hasn't been around right, so companies spent a lot of time.",
            "Companies have spent a lot of time investing in data warehousing because they could make money from it.",
            "The nonprofit never had the extra money to kind of spend think long term.",
            "There always thinking short term because their money is often year to year and they haven't been able to do that was until recently.",
            "If you wanted to get data on just crime data right?",
            "That should be public.",
            "If a crime happens, it should be on somewhere until about two years ago there was no crime data that was publicly available.",
            "city of Chicago was the first one to put time better from 2001, 2011 publicly on the website.",
            "You can download use it for anything New York has done that now.",
            "But outside the US, you know if you go and say, give me crime data about a country which will be public.",
            "It doesn't exist.",
            "So I think the lack of data.",
            "It was the biggest thing because there's no investment in data.",
            "Nobody really was focusing on it, and the side effect of the big data hype has been people have at least started to think about how we should be storing some data.",
            "We don't know what to do with it right now, but let's at least start collecting some data which is a start for people like me to say, OK, Now you're collecting some data?",
            "Let me do something useful with it.",
            "Because before that I would have been useless 'cause I could have said the same thing.",
            "I'm interested in doing this, but there was no way for me to make it real.",
            "Now there is, so I think that's been the the main lack of urgency, lack of data, and then this lack of awareness and to right now if you go to a non profit they'll at least acknowledge that they are interested in data.",
            "They probably are not doing anything.",
            "10 years ago data was not something they cared about.",
            "You know 'cause they are busy doing their everyday work.",
            "So I think that's what's that's the biggest change that's happened is that they've been collecting it now.",
            "And they're making it accessible, and that hopefully does something useful.",
            "There's a long answer.",
            "Well, I'm missing a little bit the why part, why, why didn't politicians think about it earlier?",
            "Why didn't they start collecting data?",
            "I mean, it's so obvious if industry does it.",
            "Why don't you start thinking about doing it yourself?",
            "There seems to be a reason by industry doesn't they?",
            "Don't do anything for nothing.",
            "Well, energy industry does it because they think you can optimize profits, whereas politicians have different goals and those goals may not be rational goals which may not be.",
            "You can't get better.",
            "Go if they can optimize their goals using data.",
            "Why would they do use data?",
            "And often the the non rational goals are harder to optimize with data so that is not the first thing you do.",
            "Politicians are also looking very short term right there.",
            "They're worried about the next election.",
            "Anyway, that's just I'm being recorded, so I will stop now.",
            "Hello I was wondering to what extent open this is important to your work.",
            "It's a good question.",
            "I didn't mention that.",
            "That's one of the things sort of a precondition for everything we do every every partner we work with every project we do want to be open in sort of three ways.",
            "One is obviously whatever code we write.",
            "Whatever methods we develop, their open sourced an we don't only do open source, then we also publicize them to the right people so they can use it.",
            "Could just open sourcing.",
            "It is pointless if nobody knows it exists two open this is.",
            "We are very clear in.",
            "In telling people that we will talk about the work we're doing, what kind of problems we're solving because more people need to know about and get motivated and excited.",
            "Hopefully three open.",
            "This is in the results.",
            "We want.",
            "We know if I find out that that the policy somebody had come up with was hurting a group of people, we want to be open about, not sort of criticizing them but making it, making people aware that this happened doesn't mean that we're going to go and tell New York Times what we found first.",
            "We might work with the organization first, try to fix things.",
            "And then let people know that.",
            "So I think the openness needs to happen and that is, I mean, that's sort of part of the reason why governments are often afraid to make data public because you don't know what you will find in there.",
            "You might find out that they were doing some things incorrectly, and then that'll be a scandal.",
            "So nobody wants to have that happen.",
            "But at the same time, you know if we make a deal with these people that we will only say good things about you.",
            "And if we find something bad, will hide it.",
            "That is sort of not in the spirit of the program, so we're kind of working.",
            "It's sort of a balance of getting the trust and the buying of these partners.",
            "They're not afraid of sharing things with us because every project we do, we're using internal data to these organizations that is not publicly accessible, and so they have to trust us that we were really helping them.",
            "Which is why we're starting with a very concrete problem.",
            "But then we're making sure that that we are talking about what we're doing.",
            "We're open sourcing everything we do, where documenting everything we do.",
            "We have sort of, you know, there's a. GitHub repository for every project with a description of what we did, how to use it.",
            "We have several projects that are being used actually actively on your building.",
            "On top of it, so it is extremely important because that's really the only way this type of work will be sustained.",
            "It's I don't think in the short term there's enough money to fund these projects separately, right?",
            "So a lot of this work is going to happen through volunteers through people who are excited who want to spend a few days.",
            "And today often those people.",
            "Take some data and put it on a map, but that's sort of the standard.",
            "If you sort of look at people who do anything with you, know nonprofits and government data they put in a map because it's really easy.",
            "You can do that, and two because they don't know what are the real critical problems out there.",
            "So our hope is that if we make these problems open and give people a little nudge on, you know, here's the interesting things that you can do that have an impact.",
            "They will start building on top of that and doing more of this and also continue making it open.",
            "Thank you.",
            "Do you ever foresee data science for the social good becoming, say, a degree program or spend other students you Chicago in the short term?",
            "That's it.",
            "Yeah, I should have mentioned that.",
            "So we are August.",
            "We're getting our first class of people into our graduate programs called computation Analysis of Public Policy.",
            "So it's a joint Masters program right now between computer science Department in the Public Policy School, and the idea is to train people who have an interest in public policy in in government, in non profits, and give them the training to be better.",
            "Computationally and analytically and statistically so so that that's going to turn into a PhD program with so absolutely.",
            "And I think that's happened to Carnegie Mellon has a similar public policy in machine learning program.",
            "There are some other universities that are right now.",
            "The buzzword is, you know, data science Masters programs, right?",
            "Because there's a ton of money in there, and people should do that because everybody should be data literate.",
            "That's not a bad thing, but I think what we're really focused on is is giving them at least the the tools to do useful things than just of things with data.",
            "So yeah, there there there is.",
            "There's both a Masters programs going to PhD program.",
            "The Fellowship program we're working on extending it to be throughout the year, so summer will be a more focused in on 12 to 15 projects this year.",
            "We have about 48 fellows who are coming in.",
            "And but then we'll take handful of these projects and make them more longer term because they can't be done in three months.",
            "They need longer, they have bigger research problems and need to be experiments that need to happen throughout the year.",
            "So we're extending the projects for the whole year.",
            "And then we're also getting graduate students to come in and work with us through the Masters and PhD programs.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you Colin.",
                    "label": 0
                },
                {
                    "sent": "It is really good to be here and it's my second OSW for global conference and the first one I went to was about three years ago.",
                    "label": 0
                },
                {
                    "sent": "This was the 10 year.",
                    "label": 0
                },
                {
                    "sent": "In Cambridge, and that was an interesting time for me personally, because.",
                    "label": 0
                },
                {
                    "sent": "I was trying to figure out what I really wanted to do when I sort of grew up right, so I had spent a lot of time as a computer scientist in a research lab working on really interesting research problems, mostly applied to businesses, but that wasn't satisfying enough that was intellectually satisfying, not sort of socially satisfying.",
                    "label": 0
                },
                {
                    "sent": "I wasn't really making a social impact, so I was very good on the data side.",
                    "label": 0
                },
                {
                    "sent": "Social good was sort of an afterthought on the weekends when I would, you know, help kids with something good.",
                    "label": 0
                },
                {
                    "sent": "Teach students and that that kind of thing.",
                    "label": 0
                },
                {
                    "sent": "That sort of was it was a side thing and about three years ago was when I really thought that can happen.",
                    "label": 0
                },
                {
                    "sent": "I need to put these two things together.",
                    "label": 0
                },
                {
                    "sent": "And I was talking to a couple of people over here, including media and marketing, so we're going to this CWC global Conference and Cambridge.",
                    "label": 0
                },
                {
                    "sent": "You should see what kind of people work people are doing.",
                    "label": 0
                },
                {
                    "sent": "It's closer to what you're interested in, so I went over there an that was really.",
                    "label": 0
                },
                {
                    "sent": "Inspiring in many many, many ways right.",
                    "label": 0
                },
                {
                    "sent": "There were people there who were interested in research, but they were really more interested in making an impact impact in education, impact and sort of making things equal for people around the world.",
                    "label": 0
                },
                {
                    "sent": "And then we start sort of was that got me along the path of thinking about how would I do the same thing because I am not the best person to create educational content.",
                    "label": 0
                },
                {
                    "sent": "I'm better at doing other things and that led me to basically a couple of months after that.",
                    "label": 0
                },
                {
                    "sent": "So live in Chicago, Chicago happened to be the place where Obama started his reelection campaign and they happen to hear that I was thinking about leaving my job and looking for something that had slightly more social impact than than I was doing before.",
                    "label": 0
                },
                {
                    "sent": "And they asked me to come join the team and that was sort of a transition point for me where I started looking at data, not just something you would sort of do for business reasons, but also something that could take a large part of society, an mobilize them towards some sort of collective action, right?",
                    "label": 0
                },
                {
                    "sent": "How do you?",
                    "label": 0
                },
                {
                    "sent": "And the summary coming out of the Obama campaign.",
                    "label": 0
                },
                {
                    "sent": "So you guys here must have heard about, you know lots of things around the hype around data in social media and all sorts of buzzwords around the campaign.",
                    "label": 0
                },
                {
                    "sent": "For me personally, that the lesson coming out of a large election campaign like that which spent you know, ridiculous amount of money.",
                    "label": 0
                },
                {
                    "sent": "A billion dollars had about 2 1/2 million volunteers that the key takeaway for me was that that we were able to mobilize around 2 1/2 million people as volunteers in the country and direct them in a way that was able to achieve very specific outcomes.",
                    "label": 0
                },
                {
                    "sent": "Ann and we will do that through data was part of it, but I think you know primarily was taking people's motivations.",
                    "label": 0
                },
                {
                    "sent": "That excitement, their enthusiasm that doesn't come from data that has to be other things that has to be your policy is it has to be.",
                    "label": 0
                },
                {
                    "sent": "What your exciting people about?",
                    "label": 0
                },
                {
                    "sent": "But then, once they're excited, what do you ask them to do?",
                    "label": 0
                },
                {
                    "sent": "And just ask them to, you know post on Twitter.",
                    "label": 0
                },
                {
                    "sent": "Completely useless for most practical purposes.",
                    "label": 0
                },
                {
                    "sent": "Or you can ask them to talk to their friends and convince them to vote much more useful if you're trying to win the election an so that wasn't, we need to take away when I left finished elections going very same place where I was three years ago is OK.",
                    "label": 0
                },
                {
                    "sent": "I've done that.",
                    "label": 0
                },
                {
                    "sent": "Now how do I do?",
                    "label": 0
                },
                {
                    "sent": "How do I sort of sustain work like that?",
                    "label": 0
                },
                {
                    "sent": "An one of the things that surprise me which to you guys shouldn't should be sort of obvious as there are lots of problems in the world.",
                    "label": 0
                },
                {
                    "sent": "That we can solve using data and a lot of the big social issues.",
                    "label": 0
                },
                {
                    "sent": "That is not a new concept except if you go into a computer science Graduate School and tell students that you get very puzzled looks on their faces and I sort of an experience that it was probably expected them to sort of say yeah yeah, yeah we know education and health and energy and public safety are all issues.",
                    "label": 0
                },
                {
                    "sent": "We can do something about, but one there is no money in these problems.",
                    "label": 0
                },
                {
                    "sent": "You know like rather go to Google and Facebook and LinkedIn and Foursquare and Pinterest and Twitter and.",
                    "label": 0
                },
                {
                    "sent": "Name your other.",
                    "label": 0
                },
                {
                    "sent": "You know finance and hedge funds.",
                    "label": 0
                },
                {
                    "sent": "I'd rather go there and make a lot of money, but then these problems don't have any money in there too.",
                    "label": 0
                },
                {
                    "sent": "It's not very sexy to work on, you know health care and education.",
                    "label": 0
                },
                {
                    "sent": "You know it's why would I do that?",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "If I can predict which friends you're going to have on Facebook, it's much more exciting.",
                    "label": 0
                },
                {
                    "sent": "Then the response I got instead was not that their fonts was, huh, you?",
                    "label": 0
                },
                {
                    "sent": "These are problems that we can actually do something about.",
                    "label": 0
                },
                {
                    "sent": "There's data around it and that we can make an impact.",
                    "label": 0
                },
                {
                    "sent": "There was a surprise for them so that.",
                    "label": 0
                },
                {
                    "sent": "Plus, talking to a lot of NGOs, nonprofits, foundations, who were, you know, every day in their lives trying to to to do sort of what we would call social good.",
                    "label": 0
                },
                {
                    "sent": "They were really struggling with using data better, right?",
                    "label": 1
                },
                {
                    "sent": "So you here again, everybody is talking about big data or kinds of data, and nobody really knows what to do with it, specially when it comes to governments and nonprofits and people who are really trying to solve the larger problems other than search rankings.",
                    "label": 0
                },
                {
                    "sent": "And friends suggestions.",
                    "label": 0
                },
                {
                    "sent": "And so I think the challenges they were facing with one they didn't have people to do this kind of work.",
                    "label": 0
                },
                {
                    "sent": "The people who had those skills were not interested in doing these in working on these problems, not because they weren't interested in general, but because they had no idea these problems existed.",
                    "label": 0
                },
                {
                    "sent": "The people who had the interests didn't have the skills, so people who are typically in government and nonprofits don't have these these skills.",
                    "label": 0
                },
                {
                    "sent": "The second thing was that they didn't really have examples from which to sort of get motivated by.",
                    "label": 0
                },
                {
                    "sent": "It's very hard to start doing something new if you see none of your peers doing it and it only examples you see that are successful are coming from very large companies.",
                    "label": 0
                },
                {
                    "sent": "Again, Google and Twitter who have a lot more money than most nonprofits do.",
                    "label": 0
                },
                {
                    "sent": "The third problem was if they wanted to get started.",
                    "label": 0
                },
                {
                    "sent": "Let's say they had the motivation.",
                    "label": 0
                },
                {
                    "sent": "They were excited and they finally could find the people.",
                    "label": 0
                },
                {
                    "sent": "Maybe one person that they always hire, which is the data person.",
                    "label": 0
                },
                {
                    "sent": "They didn't really know.",
                    "label": 0
                },
                {
                    "sent": "They don't really have any tools to start with.",
                    "label": 0
                },
                {
                    "sent": "You know the computer science machine learning data mining community.",
                    "label": 0
                },
                {
                    "sent": "Has been pretty good at putting out lots of code out there.",
                    "label": 0
                },
                {
                    "sent": "It is open source but not solutions, not something somebody could take their very few of those out there where you know somebody who's not very well trained has a problem.",
                    "label": 0
                },
                {
                    "sent": "Can just take something and start using it and build on the on top of that and so that those are the challenges that kind of motivate me to think about.",
                    "label": 0
                },
                {
                    "sent": "How do we start solving that problem?",
                    "label": 0
                },
                {
                    "sent": "How do we start creating more people with the skills and the interest and the passion to solve large high impact social problems?",
                    "label": 0
                },
                {
                    "sent": "How do we give these organizations examples of work that they can say?",
                    "label": 0
                },
                {
                    "sent": "Yes, I can do that.",
                    "label": 0
                },
                {
                    "sent": "It's not just for large corporations who have invested years and years and and billions of dollars.",
                    "label": 0
                },
                {
                    "sent": "And then how do we give them tools that they can start working on?",
                    "label": 0
                },
                {
                    "sent": "They can start from and build on top of.",
                    "label": 0
                },
                {
                    "sent": "The first step that led me towards that was about a year ago very sort of last minute.",
                    "label": 0
                },
                {
                    "sent": "So I join you in Chicago about a year ago and the idea was to be able to bring together people with computer science, statistics, social Sciences, econometrics, public policy backgrounds and start working towards problems that require all of those.",
                    "label": 0
                },
                {
                    "sent": "It's not a siloed solution an we started off with the program.",
                    "label": 0
                },
                {
                    "sent": "I called data science for social good.",
                    "label": 1
                },
                {
                    "sent": "And that was a program launched about a year ago, so Summer Fellowship program.",
                    "label": 0
                },
                {
                    "sent": "The goal was initially to get students and get them to come to Chicago.",
                    "label": 0
                },
                {
                    "sent": "So we had.",
                    "label": 0
                },
                {
                    "sent": "We started this program last summer and last the first year we had.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About 36 students and then this is sort of the CS program we got about 36 students to come to Chicago and there from mostly graduate students, mostly computer science, some statistics, some ikkicon policy, social Sciences, and kind of put them together with mentors for summers over 12 weeks from June to September, they spent the summer working on projects that we painfully created with lots of nonprofits and governments, right?",
                    "label": 0
                },
                {
                    "sent": "So we talked to lots of government agencies, will talk to you when we talked to nonprofits and created projects with real data with real problems.",
                    "label": 0
                },
                {
                    "sent": "That we could use to not only train these students, but also inspire them 'cause the three month period is is not enough for either.",
                    "label": 0
                },
                {
                    "sent": "So you can train people a little bit, but if they get excited about these problems they will continue to work on these things.",
                    "label": 0
                },
                {
                    "sent": "And that was sort of the goal is get them along a path that they can do something useful.",
                    "label": 0
                },
                {
                    "sent": "Was surprising, I'll tell you a bit more about the program, but was sort of interesting was.",
                    "label": 0
                },
                {
                    "sent": "The announcement the first announcement went out of March 15th and it was a last minute program.",
                    "label": 0
                },
                {
                    "sent": "We were starting up.",
                    "label": 0
                },
                {
                    "sent": "We got funding for it and wanted to start June 1st where everything starts so March 15th I send out an email to pretty much most of my friends who are in different graduate schools teaching and said here's an application form.",
                    "label": 0
                },
                {
                    "sent": "Get your students to apply to this program.",
                    "label": 0
                },
                {
                    "sent": "Deadline is April 1st, so it's two weeks left in two weeks we got.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About 600 applications for this program and it was not very well advertised.",
                    "label": 0
                },
                {
                    "sent": "It was just a very last minute program and that got me sort of surprising was that it came from everywhere around the world.",
                    "label": 0
                },
                {
                    "sent": "I know it wasn't.",
                    "label": 0
                },
                {
                    "sent": "We weren't really going to get a global audience, mostly because getting visas to the US is a pain.",
                    "label": 0
                },
                {
                    "sent": "US is not very good at letting people in or let me in many other things too, but so we weren't really trying to deal with that problem, But what was?",
                    "label": 0
                },
                {
                    "sent": "Inspiring and surprising at the same time was that we got a lot of interest from people and the common thing we heard from a lot of people was that they they would love to do something like this, but there was no venue that existed for them to take advantage of these skills.",
                    "label": 0
                },
                {
                    "sent": "It wasn't again the same thing as I talked about before.",
                    "label": 0
                },
                {
                    "sent": "Is people were interested but didn't know what to do about it.",
                    "label": 0
                },
                {
                    "sent": "How to get there?",
                    "label": 0
                },
                {
                    "sent": "So what I want to do is quickly show you instead of talking more about it myself through a video that we made with some of the students that were part of this.",
                    "label": 0
                },
                {
                    "sent": "So you can give you a flavor of who was there and what kind of students, and then I'll jump into giving you more concrete examples of what kind of projects we did, and then what's possible to do if you start putting data together with these things.",
                    "label": 0
                },
                {
                    "sent": "So let me show you a quick video.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The goal of the data signs for social Good Fellowship is really to take data scientists and train them to work on problems to solve problems that actually matter and what I mean by that is people who have computer science and statistics and economics and policy and analytical skills.",
                    "label": 0
                },
                {
                    "sent": "Giving them an environment where they learn how to not only solve real problems, but focus on problems that have social impact in areas such as education and energy and healthcare and transportation, public safety.",
                    "label": 0
                },
                {
                    "sent": "So we wanted to do was build this hybrid person who has all these different skills but also understands how to take real problems, communicate with people about those problems, solve them and then help figure out a way to transfer and transition those solutions into the real world to the partner organizations.",
                    "label": 0
                },
                {
                    "sent": "I saw this advertisement for the Fellowship and it said data science and social good, and I thought to myself, wow, that's.",
                    "label": 0
                },
                {
                    "sent": "That's exactly what I'm looking for, something that has all the neat data technology.",
                    "label": 0
                },
                {
                    "sent": "Those interesting problems, those fun problems as hard problems, but problems in the area of social goods.",
                    "label": 0
                },
                {
                    "sent": "Something that is able to improve people's lives.",
                    "label": 0
                },
                {
                    "sent": "I heard about the program through my advisor.",
                    "label": 0
                },
                {
                    "sent": "He pulled me in since the beginning just because I understand the amount of good that you can do with a little bit of data.",
                    "label": 0
                },
                {
                    "sent": "The reason that we're doing this program with Argon in the University of Chicago, and the reason that this is the right place to do this is that this is one of the few places where we have the right expertise in the system Sciences and then the social scientists to bring together.",
                    "label": 0
                },
                {
                    "sent": "And to answer these questions in a way that's much more holistic than just looking at one or the other.",
                    "label": 0
                },
                {
                    "sent": "My background is in astrophysics, an I found that coming from the hard Sciences to this program.",
                    "label": 0
                },
                {
                    "sent": "It was a really interesting transition because I was still working with students, but I was doing so in a way that was expected to produce results rather than just papers.",
                    "label": 0
                },
                {
                    "sent": "I'm working with Nurse Family Partnership, but their home Visitation program they send nurses into the homes of at risk women first time mothers.",
                    "label": 0
                },
                {
                    "sent": "My team is working with the new government organization called the Cook County Land Bank.",
                    "label": 0
                },
                {
                    "sent": "We're creating a new analytical tool to help the organization decide which properties to invest in have the greatest impact and reversing neighborhood decline our project this summer was working with Mesa public Schools.",
                    "label": 0
                },
                {
                    "sent": "Identify cases of missed educational opportunities and ensure that students go to college.",
                    "label": 0
                },
                {
                    "sent": "Is that best serve their educational potential of my team?",
                    "label": 0
                },
                {
                    "sent": "Is working with the CTA.",
                    "label": 0
                },
                {
                    "sent": "We're working on a problem that affects a lot of people around many cities, which is crowding on buses.",
                    "label": 0
                },
                {
                    "sent": "There been a lot of learning launches, a lot of talks and a lot of this person to person.",
                    "label": 0
                },
                {
                    "sent": "Opportunities to hit the white board and to be learning different programming tools.",
                    "label": 0
                },
                {
                    "sent": "You know, different packages within tools that a lot of people when they came in.",
                    "label": 0
                },
                {
                    "sent": "They really cared a lot about technical problems and what you sort of notices.",
                    "label": 0
                },
                {
                    "sent": "We start talking to our partners.",
                    "label": 0
                },
                {
                    "sent": "They go out in the field and see how things these things get implemented, how the data is actually collected.",
                    "label": 0
                },
                {
                    "sent": "So they went from thinking of a spreadsheet or database as a data set to actual people behind them.",
                    "label": 0
                },
                {
                    "sent": "Actual stories.",
                    "label": 0
                },
                {
                    "sent": "The goal is to provide these women with the source of support and health education.",
                    "label": 0
                },
                {
                    "sent": "Hopefully this will make my share of a more viable part of our public transit system by inferring a lot of these funding relationships.",
                    "label": 0
                },
                {
                    "sent": "We let nonprofits spend a lot less time searching for information on the web and actually doing the work that they're trying to do to make the world a better place.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your time.",
                    "label": 0
                },
                {
                    "sent": "We started off from such different backgrounds from such different parts of the world, and we've really come together with this common purpose and goal.",
                    "label": 0
                },
                {
                    "sent": "You'll spend your mornings at City Hall working to understand the problem with city faces, then afternoons coding together as a team, trying to solve that problem each day is so full and fulfilling.",
                    "label": 0
                },
                {
                    "sent": "You can't wait for the next one.",
                    "label": 0
                },
                {
                    "sent": "I can't think of a better way to spend your summer.",
                    "label": 0
                },
                {
                    "sent": "I wish I could do DSG for the rest of my life.",
                    "label": 0
                },
                {
                    "sent": "Honestly, it's been a lot of fun and this is the kind of work I want to do.",
                    "label": 0
                },
                {
                    "sent": "You know, I'm interested in applying.",
                    "label": 0
                },
                {
                    "sent": "Quantitatively grounded analysis and ways of thinking to problems that you know really keep me up at night to problems.",
                    "label": 0
                },
                {
                    "sent": "I think it really matters.",
                    "label": 0
                },
                {
                    "sent": "So hopefully.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it gives you the kind of students we had.",
                    "label": 0
                },
                {
                    "sent": "I think one thing that that if I was back three years ago in my computer science world, all these people were people I would never have encountered.",
                    "label": 0
                },
                {
                    "sent": "'cause we sort of live in very siloed world where only dealing with people who work on exactly the same research problems as as we do anyone interested.",
                    "label": 0
                },
                {
                    "sent": "But here was we were able to really take people from different areas kind of bring him on board until the same problems 'cause they all cared about solving specific problems as opposed to tide to their their own.",
                    "label": 0
                },
                {
                    "sent": "Area so we got computer science people, machine learning, people, stats, people, economics, public policy.",
                    "label": 0
                },
                {
                    "sent": "We had a person doing criminal justice.",
                    "label": 0
                },
                {
                    "sent": "It a sociologist.",
                    "label": 0
                },
                {
                    "sent": "We had linguistics people an the goal is to really train them all together using specific projects or so.",
                    "label": 0
                },
                {
                    "sent": "Everybody worked on a real project.",
                    "label": 0
                },
                {
                    "sent": "So what I want to do is give you a flavor of what kind of things you know we hear about typically with data is generally even you hear bout data you hear bout, you know marketing and finance an surveillance.",
                    "label": 0
                },
                {
                    "sent": "And those are those are the big.",
                    "label": 0
                },
                {
                    "sent": "Uses of data.",
                    "label": 0
                },
                {
                    "sent": "Turns out, I think that is much more useful for many, many many other things, right?",
                    "label": 0
                },
                {
                    "sent": "So here's some list of partners and this was really the key for making this program work.",
                    "label": 0
                },
                {
                    "sent": "Is having strong partners who were able to work with us to give us real problems that were motivating, inspiring, and then use our results to do something with impact, right?",
                    "label": 0
                },
                {
                    "sent": "So we got one of the projects we worked with was.",
                    "label": 0
                },
                {
                    "sent": "With.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This organization called County line banking.",
                    "label": 0
                },
                {
                    "sent": "This is in Chicago or the larger Chicago area and one of the problems that they were facing that there were lots of abandoned properties.",
                    "label": 1
                },
                {
                    "sent": "Homes that people left because they couldn't pay their mortgage and they just abandoned them and that is happening all over Chicago and all over the US.",
                    "label": 0
                },
                {
                    "sent": "So the they were struggling was they had some funding to figure out where to invest, which properties to invest in in terms of build rebuilding them.",
                    "label": 0
                },
                {
                    "sent": "Paying somebody to live in them, whatever needs to be done, what do you do to these properties that return that sort of results in the most economic impact to the surrounding areas?",
                    "label": 0
                },
                {
                    "sent": "And you know, typically if this is the government you know you don't take the rational decision.",
                    "label": 0
                },
                {
                    "sent": "You just sort of do something, do a press release, and move on with this organization was really interested in doing was.",
                    "label": 0
                },
                {
                    "sent": "Let's figure out the actual impact of each of our actions so we can look at data ANAN kind of use, a tool to do some data analysis, and then look at see, figure out where to impact needs to be.",
                    "label": 0
                },
                {
                    "sent": "In order to take where the the actions need to make the most impact, so we help them look through date, property, data, economic data, business data over the summer in these areas and help them figure out where they should be investing an an where the investments make the most sense in terms of different kinds of impact.",
                    "label": 0
                },
                {
                    "sent": "Now the interesting thing here is that often these organizations don't know what they are trying to optimize.",
                    "label": 0
                },
                {
                    "sent": "You know when you ask them what you want to do?",
                    "label": 0
                },
                {
                    "sent": "When I improve community and improve economic activity, what does that mean?",
                    "label": 0
                },
                {
                    "sent": "Are you trying to get more people to live in this area?",
                    "label": 0
                },
                {
                    "sent": "Are you trying to get more businesses to come in this area?",
                    "label": 0
                },
                {
                    "sent": "Are you trying to increase the revenue for those businesses you're trying to figure out?",
                    "label": 0
                },
                {
                    "sent": "How do you invest so there are lots of competing goals and just talking through data methods helps them think through these options.",
                    "label": 0
                },
                {
                    "sent": "Think through these goals and really figure out what are they really trying to achieve.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm not going to go into too much detail in each project, but the second one of the problems we work with is a public transit where again, a lot of bus and train or systems are not the most optimized systems and the way they typically.",
                    "label": 0
                },
                {
                    "sent": "So this one that we were working with, what they would do is they would see you know buses had a schedule and at some point traffic would happen and buses would start bunching together, right?",
                    "label": 0
                },
                {
                    "sent": "So you sort of have this problem of you have a bus over here.",
                    "label": 0
                },
                {
                    "sent": "Shops in traffic.",
                    "label": 0
                },
                {
                    "sent": "There's a bus right after it, so they just make one.",
                    "label": 0
                },
                {
                    "sent": "They make it ad hoc decision.",
                    "label": 0
                },
                {
                    "sent": "Well, let's just let's this bus go express.",
                    "label": 0
                },
                {
                    "sent": "And they have no idea what the impact of that is to the rest of the system.",
                    "label": 0
                },
                {
                    "sent": "They're just optimizing that bus.",
                    "label": 0
                },
                {
                    "sent": "And So what we did with them as we looked at all the tracking data over each bus has a GPS sensor.",
                    "label": 0
                },
                {
                    "sent": "And then when you go into a bus it also records.",
                    "label": 0
                },
                {
                    "sent": "You know how many people are getting in getting off, so we use that to basically figure, predict not just the demand of the the bus at each stop, but then built them a tool that they could use to simulate the effect of these kinds of changing.",
                    "label": 0
                },
                {
                    "sent": "So if things are bunching up and you say this bus needs to go for.",
                    "label": 0
                },
                {
                    "sent": "Stops Express not only how does it affect the people at those stops, but then, where would those people end up going with the bus?",
                    "label": 0
                },
                {
                    "sent": "They would take what we visit, impact over on the entire system and then help them improve.",
                    "label": 0
                },
                {
                    "sent": "Improve that.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This was an interesting program as a nonprofit that's called Nurse Family Partnership.",
                    "label": 0
                },
                {
                    "sent": "It's it's a nonprofit that's been going on for about 20 ish years and they started off with some controlled experiments that did to show that if you put a nurse together with an expecting mother, typically young, first time unmarried.",
                    "label": 0
                },
                {
                    "sent": "And low economic status mother.",
                    "label": 0
                },
                {
                    "sent": "It's the outcomes are good for both the kid who was born and for the mother as well.",
                    "label": 0
                },
                {
                    "sent": "So they had been working for many many years as part of some funding up in you have heard about the Obamacare happening in the US as part of that they were being asked to help them figure out how much impact they've had so they can be allocated.",
                    "label": 0
                },
                {
                    "sent": "These programs can be allocated the right amount of money.",
                    "label": 0
                },
                {
                    "sent": "And so when you ask a nonprofit how much impact you've had, they they sort of we've been working for 20 years.",
                    "label": 0
                },
                {
                    "sent": "We've helped this many people.",
                    "label": 0
                },
                {
                    "sent": "We don't know how to quantify that impact, so they came to us for help in trying to figure out how do I quantify that impact and the normal answer would be let's run some experiments like, well, you can't really run.",
                    "label": 0
                },
                {
                    "sent": "Experiments have been already doing this work for 20 years.",
                    "label": 0
                },
                {
                    "sent": "How do we quantify that?",
                    "label": 0
                },
                {
                    "sent": "So what we did with them was we looked at their data over the past several years of who are the mothers they have.",
                    "label": 0
                },
                {
                    "sent": "They have treated, they worked with and what sorts of outcomes they cared about.",
                    "label": 0
                },
                {
                    "sent": "So we looked at a few different indicators.",
                    "label": 0
                },
                {
                    "sent": "The kind of things that cared about where breastfeeding rates with and without them.",
                    "label": 0
                },
                {
                    "sent": "Immunization rates for kids with and without them.",
                    "label": 0
                },
                {
                    "sent": "And because they don't really have a control group in there.",
                    "label": 0
                },
                {
                    "sent": "What we did was going to use this technique, which in econometrics called matching as you find similar people in because what you do is if you took the average immunization rate of the people they had treated, it wouldn't be very high.",
                    "label": 0
                },
                {
                    "sent": "It might be 84%, whereas the average population might be 88%.",
                    "label": 0
                },
                {
                    "sent": "So if you just look at that as well, that they actually hurt these people, it would have been 88 if you hadn't touched them in any way.",
                    "label": 0
                },
                {
                    "sent": "Now you move them to 84.",
                    "label": 0
                },
                {
                    "sent": "Except that's not correct because the people they had treated would have been 65 without them.",
                    "label": 0
                },
                {
                    "sent": "But you don't really know that.",
                    "label": 0
                },
                {
                    "sent": "So what we did was we use a very simple thing called propensity matching where we took model to see you know, these are the people who are very similar to the ones you treated, but you didn't treat for different reasons.",
                    "label": 0
                },
                {
                    "sent": "They weren't in the right location, they just only treat that many people in a given weekend and you picked randomly or somewhat semi randomly.",
                    "label": 0
                },
                {
                    "sent": "So we made a few assumptions.",
                    "label": 0
                },
                {
                    "sent": "But the idea was to kind of give them at least ballpark order of magnitude numbers.",
                    "label": 0
                },
                {
                    "sent": "That they could go back and say, here's the approximate.",
                    "label": 0
                },
                {
                    "sent": "Impact we've had because that number would need to be decided, right?",
                    "label": 0
                },
                {
                    "sent": "It wasn't.",
                    "label": 0
                },
                {
                    "sent": "It was going to be done randomly if they didn't come up with a semi connotative, analytical, rational method that could be justified.",
                    "label": 0
                },
                {
                    "sent": "So we work with them and what we're doing this summer is continuing this work from going from impact measurement to more.",
                    "label": 0
                },
                {
                    "sent": "How do I figure out who I should treat by looking at who I can have the most impact on?",
                    "label": 0
                },
                {
                    "sent": "And then when I want to treat them, what's the right treatment today?",
                    "label": 0
                },
                {
                    "sent": "They basically have one program that they find a person and they work with that person for that amount of time.",
                    "label": 0
                },
                {
                    "sent": "Well, they sort of realized doing this kind of analysis.",
                    "label": 0
                },
                {
                    "sent": "Is that different kinds of treatments work better for different people, which is again obvious to sort of an average person, but you still don't know what the treatment needs to be.",
                    "label": 0
                },
                {
                    "sent": "So what we're working with them this summer is trying to figure out how do you, what they called dosage, how much interaction does a person need, after which the impact is really not that much.",
                    "label": 0
                },
                {
                    "sent": "There's no plateaus.",
                    "label": 0
                },
                {
                    "sent": "Can you figure out that that dosage amount of effort required for each person and use that to treat these people?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This was a project with the hospital and the code.",
                    "label": 0
                },
                {
                    "sent": "Blue is basically cardiac arrest.",
                    "label": 0
                },
                {
                    "sent": "People go into cardiac arrest and there are two problems with cardiac arrest with code Blue One is unfortunately person dies most of the time.",
                    "label": 0
                },
                {
                    "sent": "The second problem is that there's opportunity cost, so if you've watched TV shows like the ER and when if code Blue happens everybody drops everything else and goes to that patient.",
                    "label": 0
                },
                {
                    "sent": "So your chances of saving that person are pretty low.",
                    "label": 0
                },
                {
                    "sent": "But you're also dropping everything else, and so there's opportunity cost.",
                    "label": 0
                },
                {
                    "sent": "So right now there is really most.",
                    "label": 0
                },
                {
                    "sent": "Hospitals have a very simple rule based system that they.",
                    "label": 0
                },
                {
                    "sent": "If this happens, then this person might go into code blue or the next X number of minutes.",
                    "label": 1
                },
                {
                    "sent": "So they're not very proactive about it.",
                    "label": 0
                },
                {
                    "sent": "What we did, we looked at their data an built a protective model that would predict this person is going to go into cardiac arrest in the next.",
                    "label": 0
                },
                {
                    "sent": "You know, we had sort of an R2 hours 4 hours.",
                    "label": 0
                },
                {
                    "sent": "8 hours and using that could reallocate different different kinds of resource, right?",
                    "label": 0
                },
                {
                    "sent": "So if we predicted this person might go into code blue in the next R, and if a doctor is kind of doing a routine round and checkups?",
                    "label": 0
                },
                {
                    "sent": "Well, let's just spend some more time with this person now so you don't have the opportunity cost later.",
                    "label": 0
                },
                {
                    "sent": "And so the key here is to have a lot of examples I'm giving is there is sort of the first problem of some sort of prediction, but then the second problem of how do you use that prediction to change your decisions?",
                    "label": 0
                },
                {
                    "sent": "'cause you could just keep predicting code blue code, blue code, blue all the time and not do anything with it.",
                    "label": 0
                },
                {
                    "sent": "'cause it's often not easy to take.",
                    "label": 0
                },
                {
                    "sent": "The next step is how do I change my action now that I can do something better and over here we really work with him to figure out how do you allocate your resources afterwards better?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This was a project we work with this nonprofit, called Ushahidi, which came out of the Kenyan elections a few years ago and they built this crowdsourcing tool which was really designed to when a disaster is happening or a big event is happening that could have problems like elections in many countries.",
                    "label": 0
                },
                {
                    "sent": "We actually in the bombing campaign use the same system people.",
                    "label": 0
                },
                {
                    "sent": "If you could set up the system and then people start sending text messages, tweets, emails, whatever they want to report different problems.",
                    "label": 0
                },
                {
                    "sent": "So they might say you know there is violence going on in this area or there an earthquake happens.",
                    "label": 0
                },
                {
                    "sent": "Medical help is needed over here.",
                    "label": 0
                },
                {
                    "sent": "This person needs some sort of support, and so people just send data messages in different forms to that.",
                    "label": 0
                },
                {
                    "sent": "The way the system works.",
                    "label": 0
                },
                {
                    "sent": "Right now it is really crowdsourced, which is great, but it requires humans and mostly all volunteers to do a few different things.",
                    "label": 0
                },
                {
                    "sent": "A message comes in and somebody has to 1st figure out what language is it in.",
                    "label": 0
                },
                {
                    "sent": "Because it's system that's deployed all across the world.",
                    "label": 0
                },
                {
                    "sent": "So you're detecting the language and then your routing it.",
                    "label": 0
                },
                {
                    "sent": "The person who knows that language, the person who knows that language looks at this and says, oh, this is about medical help, so they tag it with medical help.",
                    "label": 0
                },
                {
                    "sent": "It has to be structured.",
                    "label": 0
                },
                {
                    "sent": "Otherwise how would you provide that you have to write it the right people?",
                    "label": 0
                },
                {
                    "sent": "Then they have to router that people.",
                    "label": 0
                },
                {
                    "sent": "There's often sensitive information in these in these things they give names of people, phone numbers, text message numbers, email addresses, and and often in these type of things those are sensitive pieces of information that you don't want to give out.",
                    "label": 0
                },
                {
                    "sent": "Specially in you know Kenyan elections.",
                    "label": 0
                },
                {
                    "sent": "If somebody complains about voting fraud or somebody is harassing me so then they redact information that take out names, and then they sort of do something with it, right?",
                    "label": 0
                },
                {
                    "sent": "So that's a pretty expensive process, an A lot of these things can be fairly well automated.",
                    "label": 0
                },
                {
                    "sent": "There are lots of tools out there, lots of methods that people have developed that can detect language that can do translation that can do reduction that can do classification into these type of things.",
                    "label": 0
                },
                {
                    "sent": "So a lot of these things already exist that just weren't being used in this area.",
                    "label": 0
                },
                {
                    "sent": "So we worked with this nonprofit and there's an there.",
                    "label": 0
                },
                {
                    "sent": "The open source software to basically add a module in there that would do all these different things to make the system a lot more collaborative between the computer and the human where the computer would suggest you know which would detect the language, it would start tagging things.",
                    "label": 0
                },
                {
                    "sent": "It would start suggesting redaction candidates and then he was kind of just say Yep.",
                    "label": 0
                },
                {
                    "sent": "Yep, Yep, that looks right and then publish it out.",
                    "label": 0
                },
                {
                    "sent": "So that was something that's in that software now deployed.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um, this problem was an interesting problem that this was.",
                    "label": 0
                },
                {
                    "sent": "This is a school system in Arizona Mesa Public School System and they heard about our program pretty early on an they sort of emailed me saying, you know, we love this kind of idea of using data.",
                    "label": 0
                },
                {
                    "sent": "We've been trying to figure out how to use data.",
                    "label": 0
                },
                {
                    "sent": "We have have a big problem in our big problem is that are we think we have smart students, but they don't really go to college or when they do go to college, they go to a lot of the people who are local in the US.",
                    "label": 0
                },
                {
                    "sent": "At these two year community colleges they are local Community College.",
                    "label": 0
                },
                {
                    "sent": "And the graduation rate.",
                    "label": 0
                },
                {
                    "sent": "There is about 13%.",
                    "label": 0
                },
                {
                    "sent": "That's 1 three and we don't know we can.",
                    "label": 0
                },
                {
                    "sent": "We can if we only knew which students were sort of capable of going to a better college, we could help them along that path.",
                    "label": 0
                },
                {
                    "sent": "But we don't know which ones, so we can't really target all of them.",
                    "label": 0
                },
                {
                    "sent": "We don't have resources, so this broader problem is called under matching, where if you are a student who is capable and motivated to go to some kind of higher education system.",
                    "label": 0
                },
                {
                    "sent": "But you don't go there, you don't apply.",
                    "label": 0
                },
                {
                    "sent": "You don't even know about the man that's called under matching, and it happens for many reasons.",
                    "label": 0
                },
                {
                    "sent": "You know you would sort of say, well, everybody knows how to apply to college, but turns out that's not true if you don't have anybody else around you who has ever been to college who's ever applied to college, it's not obvious how you would do that.",
                    "label": 0
                },
                {
                    "sent": "People don't apply to college because one they think it's too expensive.",
                    "label": 0
                },
                {
                    "sent": "They don't know there are scholarship opportunities.",
                    "label": 0
                },
                {
                    "sent": "Again, this is a USA college is very expensive, but there are alternative opportunities.",
                    "label": 0
                },
                {
                    "sent": "Some people don't apply to college because I think it's too expensive to apply 'cause it cost $100 application fees to apply to each college, but they don't know is you can get an application fee waiver if you qualify.",
                    "label": 0
                },
                {
                    "sent": "Some people have college because I think so I probably can't get in because I don't know anybody else who's gotten into that University.",
                    "label": 0
                },
                {
                    "sent": "So they came to us with this problem and then they said, well, we've been putting all our data together about our students for the past several years, and then we bought a copy of this software called SPSS, which is for those.",
                    "label": 0
                },
                {
                    "sent": "If you don't know, it's a stats analysis software, but we don't really know what to do with that software.",
                    "label": 0
                },
                {
                    "sent": "Can you guys help us?",
                    "label": 0
                },
                {
                    "sent": "And so we started working with them last summer an we did a couple of different things.",
                    "label": 0
                },
                {
                    "sent": "One is they had put together data about their students.",
                    "label": 0
                },
                {
                    "sent": "Throughout each school year, so their grades, their test scores there, how often they come to school, where they live, and then they had data on where they went to college college, did they?",
                    "label": 0
                },
                {
                    "sent": "How they continue through college and University and that they graduated from college, right?",
                    "label": 0
                },
                {
                    "sent": "So they had basically the whole stream of data about students.",
                    "label": 0
                },
                {
                    "sent": "For many many many many years.",
                    "label": 0
                },
                {
                    "sent": "So what we did with them initially was two kinds of things.",
                    "label": 0
                },
                {
                    "sent": "One is we looked at that data and 1st build a model to predict who is likely to.",
                    "label": 0
                },
                {
                    "sent": "Apply to college, get into college, an earthly who's likely to get into college and graduate from college, right?",
                    "label": 0
                },
                {
                    "sent": "Because if they if they don't get in and they apply, that's not really a good thing.",
                    "label": 0
                },
                {
                    "sent": "If they don't graduate on a good thing.",
                    "label": 0
                },
                {
                    "sent": "So one is, you know, can we predict some sort of potential of these students where they are capable of graduating from these kinds of colleges?",
                    "label": 0
                },
                {
                    "sent": "Second thing is, can we predict if they're going to apply to these colleges at all?",
                    "label": 0
                },
                {
                    "sent": "And if we put the two together so we put these two things together and gave the school a ranked list for each of their schools?",
                    "label": 0
                },
                {
                    "sent": "For students who are?",
                    "label": 0
                },
                {
                    "sent": "Most capable of going to this college and graduating, but also most likely not to apply to these things.",
                    "label": 0
                },
                {
                    "sent": "So for the highest risk, students with the highest potential and gave them a list of sort of film going down so the beginning when they looked at this list, they were sort of not sceptical, but like OK, well that's the list I've met.",
                    "label": 0
                },
                {
                    "sent": "I'm sure it's you know, it may be right, so they start looking at it looking at it more and said, oh, that's interesting.",
                    "label": 0
                },
                {
                    "sent": "The people we had done so they had done a survey at the end of the school year asking people where you're applying to college.",
                    "label": 0
                },
                {
                    "sent": "And because we started working with them.",
                    "label": 0
                },
                {
                    "sent": "Before that we didn't get that data, so they look.",
                    "label": 0
                },
                {
                    "sent": "They didn't say oh the people who had who were high on your list when we ask them where they're applying to college had left it pretty much blank.",
                    "label": 0
                },
                {
                    "sent": "There was no answer and the people who were at the bottom of our list the least risk students had a list of list of schools.",
                    "label": 0
                },
                {
                    "sent": "So my first reaction was oh so when then then this is useless for you, right?",
                    "label": 0
                },
                {
                    "sent": "Because you already know the answer, which students to target and they said, well, no, because if you ask them this question, it helps you get it.",
                    "label": 0
                },
                {
                    "sent": "Half the students will leave it blank and so we don't.",
                    "label": 0
                },
                {
                    "sent": "Our resources that we have in order to do interventions with these students are fairly limited, so we really needed a ranked list.",
                    "label": 0
                },
                {
                    "sent": "We don't need sort of groupings of people.",
                    "label": 0
                },
                {
                    "sent": "The second thing was that as they started looking at this data more and more, they realized that they could start running these interventions through in the US again that these guidance school guidance counselors in schools who help you get into college, but they are overwhelmed with you.",
                    "label": 0
                },
                {
                    "sent": "Know the ratio of students to the counselors is is pretty large and so they really overwhelmed.",
                    "label": 0
                },
                {
                    "sent": "So what we could have helped them do is figure out.",
                    "label": 0
                },
                {
                    "sent": "Which students need to be targeted in order for these interventions for these interventions so that they end up applying to college and we're doing basic result of that is continuing this work with a larger number of schools so they went out and got a lot of other schools and we're still continuing this kind of work with a lot of other school systems, not just on college admissions, but in general around how to take how to use the student records better in order to college retention, to do better student education plans, and really sort of start going and doing.",
                    "label": 0
                },
                {
                    "sent": "More interesting things and helping them be more data driven because I think one of the challenges in.",
                    "label": 0
                },
                {
                    "sent": "In a lot of this kind of work, is you really have to bring together a lot of different disciplines, right?",
                    "label": 0
                },
                {
                    "sent": "So typically if you loaded the computer science world in the machine learning world, people are fascinated by predictions.",
                    "label": 0
                },
                {
                    "sent": "Everybody is talking about.",
                    "label": 0
                },
                {
                    "sent": "Predictions and predictions are great.",
                    "label": 0
                },
                {
                    "sent": "We are really good at that.",
                    "label": 0
                },
                {
                    "sent": "At this point we can predict you're going to go to this college, but often with the world really wants is the next step of behavior change, right?",
                    "label": 0
                },
                {
                    "sent": "I once I've predicted you're not going to go to college, I can say, OK, good for you.",
                    "label": 1
                },
                {
                    "sent": "I'm not, you know, I've predicted that I'm done with my job, but what's really important here is prediction is useless if I can't do any interventions with them.",
                    "label": 0
                },
                {
                    "sent": "If I can't change their behavior and social scientists have been really focused a lot on behavior changes, spend a lot of time trying to do experiments to figure out how do I.",
                    "label": 0
                },
                {
                    "sent": "How do I get people to do something that's good for them?",
                    "label": 0
                },
                {
                    "sent": "Or in some cases, bad for them?",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, like making them buy cigarettes, for example, where people are really good at that.",
                    "label": 0
                },
                {
                    "sent": "But I think the key is to sort of bring together these two disciplines.",
                    "label": 0
                },
                {
                    "sent": "Where you're starting to put together large scale data analysis, computational techniques that people machine learning, and stats in computer science have been building, but then putting them together with a lot of social science work where you're really focused on large social problems and changing behaviors of people at a very large scale.",
                    "label": 0
                },
                {
                    "sent": "And that's sort of the idea for a lot of these different projects.",
                    "label": 0
                },
                {
                    "sent": "And it's not just sort of the summer program in Chicago, there's a lot of other things that are starting up in this area, so there's an organization New York called data kind, and what they do is.",
                    "label": 0
                },
                {
                    "sent": "They put together volunteers with data skills with nonprofits who have interesting problems like, like we're working on there, just more doing it on a volunteer basis.",
                    "label": 0
                },
                {
                    "sent": "There are other universities who are starting to look at these programs.",
                    "label": 0
                },
                {
                    "sent": "Say, you know there are students who are interested in this.",
                    "label": 0
                },
                {
                    "sent": "So Georgia Tech is running a very version of our program this summer to see how they can work with City of Atlanta to do the same thing we have been talking to a lot of different universities.",
                    "label": 0
                },
                {
                    "sent": "NYU in Columbia and Stanford and Berkeley and Santa Cruz.",
                    "label": 0
                },
                {
                    "sent": "As well as other European universities are going to see how do we take this interest and excitement from students who are really excited about this thing and all the problems that exist out there, right?",
                    "label": 0
                },
                {
                    "sent": "So a lot of the projects I've talked about where US based now.",
                    "label": 0
                },
                {
                    "sent": "It's not because the most critical problem society are happening in the US.",
                    "label": 0
                },
                {
                    "sent": "That's not true at all, but you sort of need some basic infrastructure to solve these problems and a lot of the infrastructure today is really.",
                    "label": 0
                },
                {
                    "sent": "Mostly exists in the developing world, and so the idea is that if we can start solving these problems and Start learning about what kind of infrastructure do you need to build.",
                    "label": 0
                },
                {
                    "sent": "If you're starting to collect education data and healthcare data in the US and in developing countries in the Western Europe, you've got the infrastructure to collect a lot of data, maybe only a small part of it is useful.",
                    "label": 0
                },
                {
                    "sent": "So if you can learn and figure out what parts of it are useful, you can take that information and then help build infrastructures in other countries.",
                    "label": 0
                },
                {
                    "sent": "You don't need to collect 300 pieces of data if you're building a new system in a developing country where you have resources are very limited.",
                    "label": 0
                },
                {
                    "sent": "You just need these 20 pieces, but you don't know which 20 pieces, right?",
                    "label": 0
                },
                {
                    "sent": "So by doing this kind of work in areas where infrastructure is already exist, you can start putting together sort of trainings and materials that help people build these systems in other countries.",
                    "label": 0
                },
                {
                    "sent": "So there Chicago we're running some of my colleagues at running a program in India that's a yearlong fellowship where they're sending about five teams of students for a year to work with community development organizations in India and one of the things we've been talking about is is combining this program.",
                    "label": 0
                },
                {
                    "sent": "With the summer program where the students start off by looking at data about those communities, doing some analysis, and then spending a year on the ground in the field is one of the things that's, you know.",
                    "label": 0
                },
                {
                    "sent": "Computer scientists are not very good at, is being in the field like we like to fit in front of the computer and look at spreadsheets and databases and build models and one of the things that was interesting about the summer program was I had to really force a lot of these students to look at the data at least and go out in the field and figure out you know how many buses are there in this city.",
                    "label": 0
                },
                {
                    "sent": "How many people use those buses as opposed to.",
                    "label": 0
                },
                {
                    "sent": "A matrix that they're analyzing without having any context, and so I think going out into the field is really important, and the only way you can do that.",
                    "label": 0
                },
                {
                    "sent": "As if you have a lot of buying support from these organizations, and so I think that's sort of the key for a lot of these programs.",
                    "label": 0
                },
                {
                    "sent": "Basically what I wanted to do now I'm gonna leave time for questions one does give you guys an overview of one.",
                    "label": 0
                },
                {
                    "sent": "There is a lot of interest in in in in students.",
                    "label": 0
                },
                {
                    "sent": "People with these skills to work on these types of problems and I think you know the what you guys are sort of could be very helpful and is articulating those problems.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "What are the big problems in education?",
                    "label": 0
                },
                {
                    "sent": "What are the big problems in content development where the big problems in giving access to educational content?",
                    "label": 0
                },
                {
                    "sent": "Because you guys are the ones who have who have those ideas who deal with those problems.",
                    "label": 0
                },
                {
                    "sent": "There are a lot of these people who have skills in data analysis in computer science and stats and social Sciences.",
                    "label": 0
                },
                {
                    "sent": "Who would love to help with those problems?",
                    "label": 0
                },
                {
                    "sent": "I mean, you know that was looking through some of the when I was sitting in these talks.",
                    "label": 0
                },
                {
                    "sent": "You know there are a lot of problems like we could do something about that, but those people have no idea that you have these problems because we only talk about them.",
                    "label": 0
                },
                {
                    "sent": "You know, in in these places and not outside where you could really get help.",
                    "label": 0
                },
                {
                    "sent": "And so I think one of the things that we really helpful is to use other venues to talk about these types of things, right?",
                    "label": 0
                },
                {
                    "sent": "So for example, this, there's a conference called KDD, took Knowledge Discovery and data mining.",
                    "label": 0
                },
                {
                    "sent": "It is sort of the big the main computer science conference on data analysis.",
                    "label": 0
                },
                {
                    "sent": "It's happening in New York in August, and the theme for that conference is social good.",
                    "label": 0
                },
                {
                    "sent": "And the idea is that we want to get people from outside our community to come.",
                    "label": 0
                },
                {
                    "sent": "Basically just talk about problems so that we can better understand what those problems are.",
                    "label": 0
                },
                {
                    "sent": "An hopefully guide, motivate and influence the research that's happening.",
                    "label": 0
                },
                {
                    "sent": "This is going to happen regardless, so I'd rather be focused on problems that actually have an impact, then focused on problems of Google and LinkedIn and Yahoo and Foursquare and Twitter, which is what happens today because they come and talk about their problems.",
                    "label": 0
                },
                {
                    "sent": "Nobody else comes so with that kind of leave time for questions, but an happy to take questions now and as well as I'm around.",
                    "label": 0
                },
                {
                    "sent": "Next couple of days.",
                    "label": 0
                },
                {
                    "sent": "So happy to talk if you have interesting problems.",
                    "label": 0
                },
                {
                    "sent": "If you have, you know you've been working on these type of things.",
                    "label": 0
                },
                {
                    "sent": "I'm always looking for sort of more people to collaborate with, so thank you.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I have one comment and one maybe a little bit provocative question where I would like to get your opinion on so the comment is.",
                    "label": 0
                },
                {
                    "sent": "I personally don't like the term big data.",
                    "label": 0
                },
                {
                    "sent": "I know it's not the big password.",
                    "label": 0
                },
                {
                    "sent": "I prefer the term data mining because that's most mostly it's done.",
                    "label": 0
                },
                {
                    "sent": "Now my question is so this is very recent activity and now data mining and machine learning techniques are being injected in these public service.",
                    "label": 0
                },
                {
                    "sent": "Domains now if remember like 15 years ago.",
                    "label": 0
                },
                {
                    "sent": "Data mining was a standard technique in commercial businesses.",
                    "label": 0
                },
                {
                    "sent": "So Walmart had a first petabyte data warehouse.",
                    "label": 0
                },
                {
                    "sent": "They were frequently mining it and optimizing their their pricing of products of chip prices go up when the when the beer prices are on sale and things like that and credit companies were always doing data mining to detect fraudulent.",
                    "label": 0
                },
                {
                    "sent": "Transactions etc.",
                    "label": 0
                },
                {
                    "sent": "So I know these are non profit businesses as we would call them but in the end I mean they're operating on public money tax, money bus services are actually sort of semi profit company.",
                    "label": 0
                },
                {
                    "sent": "They don't need to make profit but they should at least break Even so they have an interest in getting the most out of the money, taxpayer money or wherever the funding comes from in order to offer the best services.",
                    "label": 0
                },
                {
                    "sent": "Why in the world did it take so long to pick up on technology?",
                    "label": 0
                },
                {
                    "sent": "Why do policymakers that really have to make informed decisions not rely heavily on third data analysis, but always do these gut feeling decisions?",
                    "label": 0
                },
                {
                    "sent": "I mean, This is Money well invested.",
                    "label": 0
                },
                {
                    "sent": "What is your opinion?",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Why is it so difficult to get it to policymakers, right?",
                    "label": 0
                },
                {
                    "sent": "You should have asked this question yesterday.",
                    "label": 0
                },
                {
                    "sent": "So yeah, the right people there yesterday to ask that question and see what they say because they are the people to question these.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but you know you've been working with them.",
                    "label": 0
                },
                {
                    "sent": "I'm pretty sure you will give them more honest answer then they would give.",
                    "label": 0
                },
                {
                    "sent": "Yeah 'cause I'm not running for any office so I can.",
                    "label": 0
                },
                {
                    "sent": "I can give you an answer.",
                    "label": 0
                },
                {
                    "sent": "So I think so.",
                    "label": 0
                },
                {
                    "sent": "Your first question was or comment was, you don't like the term big data.",
                    "label": 0
                },
                {
                    "sent": "You prefer data mining.",
                    "label": 0
                },
                {
                    "sent": "So if you notice in my slides, there was no big data anywhere, right?",
                    "label": 0
                },
                {
                    "sent": "Because I think it's I have a feeling it's a buzzword type.",
                    "label": 0
                },
                {
                    "sent": "It's marketing IBM wants to sell products.",
                    "label": 0
                },
                {
                    "sent": "They'll put it up there, that's fine, whatever that they can do.",
                    "label": 0
                },
                {
                    "sent": "All that all I care about is people doing slightly more rational decision making, right?",
                    "label": 0
                },
                {
                    "sent": "So whatever you if you, if you prefer data mining and call it that the problem as I talked as I work with people outside the core area, different terms mean different things to them.",
                    "label": 0
                },
                {
                    "sent": "So to most people in social Sciences, public policy, even government data mining means one of two things.",
                    "label": 0
                },
                {
                    "sent": "Either we're looking at, you know, private data of individuals and trying to find something really deep that's bad about them, or data mining means looking for random correlations.",
                    "label": 0
                },
                {
                    "sent": "So both of those are not accurate, and so I sort of use all synonyms at the same time.",
                    "label": 0
                },
                {
                    "sent": "So whatever you take it to mean, you can use that term, but I think that's the right way for people to at least.",
                    "label": 0
                },
                {
                    "sent": "Broadened the scope where if you, I would just say data mining without explaining it and people would say, well we don't do that like no, no you do.",
                    "label": 0
                },
                {
                    "sent": "It's just you call it something else.",
                    "label": 0
                },
                {
                    "sent": "Think so.",
                    "label": 0
                },
                {
                    "sent": "So what you were saying about nonprofits and the yeah?",
                    "label": 0
                },
                {
                    "sent": "I mean, they're optimizing something an so the first thing is they're optimizing something, but often they don't know what they're optimizing, so they want to get the bus service, for example.",
                    "label": 0
                },
                {
                    "sent": "They certainly shouldn't be optimizing profit, because that's not their goal there.",
                    "label": 0
                },
                {
                    "sent": "Being giving money to make things better for the people there serving now, they've never been able to articulate what is it mathematically that they're optimizing, right?",
                    "label": 0
                },
                {
                    "sent": "So I would argue they are making it possible, so you could you could imagine.",
                    "label": 0
                },
                {
                    "sent": "The goal could be the shortest commute time, average shortest commute time for the entire city, like that's a good goal, but you could also say, well, you know a lot of people don't need to get to their work on time, so maybe you want to Max it.",
                    "label": 0
                },
                {
                    "sent": "You want to minimize the Max transit time, right?",
                    "label": 0
                },
                {
                    "sent": "So that's life makes life better for people who are living really far away or you want to make the decrease the transit time for people who are living in the least accessible places, or in the poorest neighborhoods.",
                    "label": 0
                },
                {
                    "sent": "Or the people who need help the most.",
                    "label": 0
                },
                {
                    "sent": "And so you could have all sorts of things, but they don't think about them that way.",
                    "label": 0
                },
                {
                    "sent": "So I think the good thing about talking about them through data is that you make them force you busy forced them to think about these choices because policy is being implemented in code that forces you to make a decision.",
                    "label": 0
                },
                {
                    "sent": "You can't just hand wave and do a campaign speech and say I will make things better for everyone like no.",
                    "label": 0
                },
                {
                    "sent": "Well, I'm looking at your code, and that code is not making things better for everyone.",
                    "label": 0
                },
                {
                    "sent": "It's optimizing for this group of people, and I think that's something that politicians.",
                    "label": 0
                },
                {
                    "sent": "Our our haven't quite figured out but small pockets of these organizations are being forced to think that way.",
                    "label": 0
                },
                {
                    "sent": "The reason they haven't been forced thing that way is for one thing, the data hasn't been around right, so companies spent a lot of time.",
                    "label": 0
                },
                {
                    "sent": "Companies have spent a lot of time investing in data warehousing because they could make money from it.",
                    "label": 0
                },
                {
                    "sent": "The nonprofit never had the extra money to kind of spend think long term.",
                    "label": 0
                },
                {
                    "sent": "There always thinking short term because their money is often year to year and they haven't been able to do that was until recently.",
                    "label": 0
                },
                {
                    "sent": "If you wanted to get data on just crime data right?",
                    "label": 0
                },
                {
                    "sent": "That should be public.",
                    "label": 0
                },
                {
                    "sent": "If a crime happens, it should be on somewhere until about two years ago there was no crime data that was publicly available.",
                    "label": 0
                },
                {
                    "sent": "city of Chicago was the first one to put time better from 2001, 2011 publicly on the website.",
                    "label": 1
                },
                {
                    "sent": "You can download use it for anything New York has done that now.",
                    "label": 0
                },
                {
                    "sent": "But outside the US, you know if you go and say, give me crime data about a country which will be public.",
                    "label": 0
                },
                {
                    "sent": "It doesn't exist.",
                    "label": 0
                },
                {
                    "sent": "So I think the lack of data.",
                    "label": 0
                },
                {
                    "sent": "It was the biggest thing because there's no investment in data.",
                    "label": 0
                },
                {
                    "sent": "Nobody really was focusing on it, and the side effect of the big data hype has been people have at least started to think about how we should be storing some data.",
                    "label": 0
                },
                {
                    "sent": "We don't know what to do with it right now, but let's at least start collecting some data which is a start for people like me to say, OK, Now you're collecting some data?",
                    "label": 0
                },
                {
                    "sent": "Let me do something useful with it.",
                    "label": 0
                },
                {
                    "sent": "Because before that I would have been useless 'cause I could have said the same thing.",
                    "label": 0
                },
                {
                    "sent": "I'm interested in doing this, but there was no way for me to make it real.",
                    "label": 0
                },
                {
                    "sent": "Now there is, so I think that's been the the main lack of urgency, lack of data, and then this lack of awareness and to right now if you go to a non profit they'll at least acknowledge that they are interested in data.",
                    "label": 0
                },
                {
                    "sent": "They probably are not doing anything.",
                    "label": 0
                },
                {
                    "sent": "10 years ago data was not something they cared about.",
                    "label": 0
                },
                {
                    "sent": "You know 'cause they are busy doing their everyday work.",
                    "label": 0
                },
                {
                    "sent": "So I think that's what's that's the biggest change that's happened is that they've been collecting it now.",
                    "label": 0
                },
                {
                    "sent": "And they're making it accessible, and that hopefully does something useful.",
                    "label": 0
                },
                {
                    "sent": "There's a long answer.",
                    "label": 0
                },
                {
                    "sent": "Well, I'm missing a little bit the why part, why, why didn't politicians think about it earlier?",
                    "label": 0
                },
                {
                    "sent": "Why didn't they start collecting data?",
                    "label": 0
                },
                {
                    "sent": "I mean, it's so obvious if industry does it.",
                    "label": 0
                },
                {
                    "sent": "Why don't you start thinking about doing it yourself?",
                    "label": 0
                },
                {
                    "sent": "There seems to be a reason by industry doesn't they?",
                    "label": 0
                },
                {
                    "sent": "Don't do anything for nothing.",
                    "label": 0
                },
                {
                    "sent": "Well, energy industry does it because they think you can optimize profits, whereas politicians have different goals and those goals may not be rational goals which may not be.",
                    "label": 0
                },
                {
                    "sent": "You can't get better.",
                    "label": 0
                },
                {
                    "sent": "Go if they can optimize their goals using data.",
                    "label": 0
                },
                {
                    "sent": "Why would they do use data?",
                    "label": 0
                },
                {
                    "sent": "And often the the non rational goals are harder to optimize with data so that is not the first thing you do.",
                    "label": 0
                },
                {
                    "sent": "Politicians are also looking very short term right there.",
                    "label": 0
                },
                {
                    "sent": "They're worried about the next election.",
                    "label": 0
                },
                {
                    "sent": "Anyway, that's just I'm being recorded, so I will stop now.",
                    "label": 0
                },
                {
                    "sent": "Hello I was wondering to what extent open this is important to your work.",
                    "label": 0
                },
                {
                    "sent": "It's a good question.",
                    "label": 0
                },
                {
                    "sent": "I didn't mention that.",
                    "label": 0
                },
                {
                    "sent": "That's one of the things sort of a precondition for everything we do every every partner we work with every project we do want to be open in sort of three ways.",
                    "label": 0
                },
                {
                    "sent": "One is obviously whatever code we write.",
                    "label": 0
                },
                {
                    "sent": "Whatever methods we develop, their open sourced an we don't only do open source, then we also publicize them to the right people so they can use it.",
                    "label": 0
                },
                {
                    "sent": "Could just open sourcing.",
                    "label": 0
                },
                {
                    "sent": "It is pointless if nobody knows it exists two open this is.",
                    "label": 0
                },
                {
                    "sent": "We are very clear in.",
                    "label": 0
                },
                {
                    "sent": "In telling people that we will talk about the work we're doing, what kind of problems we're solving because more people need to know about and get motivated and excited.",
                    "label": 0
                },
                {
                    "sent": "Hopefully three open.",
                    "label": 0
                },
                {
                    "sent": "This is in the results.",
                    "label": 0
                },
                {
                    "sent": "We want.",
                    "label": 0
                },
                {
                    "sent": "We know if I find out that that the policy somebody had come up with was hurting a group of people, we want to be open about, not sort of criticizing them but making it, making people aware that this happened doesn't mean that we're going to go and tell New York Times what we found first.",
                    "label": 0
                },
                {
                    "sent": "We might work with the organization first, try to fix things.",
                    "label": 0
                },
                {
                    "sent": "And then let people know that.",
                    "label": 0
                },
                {
                    "sent": "So I think the openness needs to happen and that is, I mean, that's sort of part of the reason why governments are often afraid to make data public because you don't know what you will find in there.",
                    "label": 0
                },
                {
                    "sent": "You might find out that they were doing some things incorrectly, and then that'll be a scandal.",
                    "label": 0
                },
                {
                    "sent": "So nobody wants to have that happen.",
                    "label": 0
                },
                {
                    "sent": "But at the same time, you know if we make a deal with these people that we will only say good things about you.",
                    "label": 0
                },
                {
                    "sent": "And if we find something bad, will hide it.",
                    "label": 0
                },
                {
                    "sent": "That is sort of not in the spirit of the program, so we're kind of working.",
                    "label": 0
                },
                {
                    "sent": "It's sort of a balance of getting the trust and the buying of these partners.",
                    "label": 0
                },
                {
                    "sent": "They're not afraid of sharing things with us because every project we do, we're using internal data to these organizations that is not publicly accessible, and so they have to trust us that we were really helping them.",
                    "label": 0
                },
                {
                    "sent": "Which is why we're starting with a very concrete problem.",
                    "label": 0
                },
                {
                    "sent": "But then we're making sure that that we are talking about what we're doing.",
                    "label": 0
                },
                {
                    "sent": "We're open sourcing everything we do, where documenting everything we do.",
                    "label": 0
                },
                {
                    "sent": "We have sort of, you know, there's a. GitHub repository for every project with a description of what we did, how to use it.",
                    "label": 0
                },
                {
                    "sent": "We have several projects that are being used actually actively on your building.",
                    "label": 0
                },
                {
                    "sent": "On top of it, so it is extremely important because that's really the only way this type of work will be sustained.",
                    "label": 0
                },
                {
                    "sent": "It's I don't think in the short term there's enough money to fund these projects separately, right?",
                    "label": 0
                },
                {
                    "sent": "So a lot of this work is going to happen through volunteers through people who are excited who want to spend a few days.",
                    "label": 0
                },
                {
                    "sent": "And today often those people.",
                    "label": 0
                },
                {
                    "sent": "Take some data and put it on a map, but that's sort of the standard.",
                    "label": 0
                },
                {
                    "sent": "If you sort of look at people who do anything with you, know nonprofits and government data they put in a map because it's really easy.",
                    "label": 0
                },
                {
                    "sent": "You can do that, and two because they don't know what are the real critical problems out there.",
                    "label": 0
                },
                {
                    "sent": "So our hope is that if we make these problems open and give people a little nudge on, you know, here's the interesting things that you can do that have an impact.",
                    "label": 0
                },
                {
                    "sent": "They will start building on top of that and doing more of this and also continue making it open.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Do you ever foresee data science for the social good becoming, say, a degree program or spend other students you Chicago in the short term?",
                    "label": 0
                },
                {
                    "sent": "That's it.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I should have mentioned that.",
                    "label": 0
                },
                {
                    "sent": "So we are August.",
                    "label": 0
                },
                {
                    "sent": "We're getting our first class of people into our graduate programs called computation Analysis of Public Policy.",
                    "label": 0
                },
                {
                    "sent": "So it's a joint Masters program right now between computer science Department in the Public Policy School, and the idea is to train people who have an interest in public policy in in government, in non profits, and give them the training to be better.",
                    "label": 0
                },
                {
                    "sent": "Computationally and analytically and statistically so so that that's going to turn into a PhD program with so absolutely.",
                    "label": 0
                },
                {
                    "sent": "And I think that's happened to Carnegie Mellon has a similar public policy in machine learning program.",
                    "label": 0
                },
                {
                    "sent": "There are some other universities that are right now.",
                    "label": 0
                },
                {
                    "sent": "The buzzword is, you know, data science Masters programs, right?",
                    "label": 0
                },
                {
                    "sent": "Because there's a ton of money in there, and people should do that because everybody should be data literate.",
                    "label": 0
                },
                {
                    "sent": "That's not a bad thing, but I think what we're really focused on is is giving them at least the the tools to do useful things than just of things with data.",
                    "label": 0
                },
                {
                    "sent": "So yeah, there there there is.",
                    "label": 0
                },
                {
                    "sent": "There's both a Masters programs going to PhD program.",
                    "label": 0
                },
                {
                    "sent": "The Fellowship program we're working on extending it to be throughout the year, so summer will be a more focused in on 12 to 15 projects this year.",
                    "label": 0
                },
                {
                    "sent": "We have about 48 fellows who are coming in.",
                    "label": 0
                },
                {
                    "sent": "And but then we'll take handful of these projects and make them more longer term because they can't be done in three months.",
                    "label": 0
                },
                {
                    "sent": "They need longer, they have bigger research problems and need to be experiments that need to happen throughout the year.",
                    "label": 0
                },
                {
                    "sent": "So we're extending the projects for the whole year.",
                    "label": 0
                },
                {
                    "sent": "And then we're also getting graduate students to come in and work with us through the Masters and PhD programs.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}