{
    "id": "bnvw4cisrws56thqzf7ikzulwwbgsl7l",
    "title": "Digital Muqtabas CTS Integration in CLARIN",
    "info": {
        "author": [
            "Jochen Tiepmar, University of Leipzig"
        ],
        "published": "Oct. 17, 2017",
        "recorded": "September 2017",
        "category": [
            "Top->Humanities",
            "Top->Social Sciences"
        ]
    },
    "url": "http://videolectures.net/clarinannualconference2017_tiepmar_cts_integration/",
    "segmentation": [
        [
            "People, but I'm presenting."
        ],
        [
            "It was a collaboration between two colored myself to color from the oil and instituted by would, myself, and.",
            "Via client team and light switch and the goal was to include.",
            "But digital Muteba state does it.",
            "In the incline in Virtual language Observatory, using the Canonical text service interface that was presented last year.",
            "What?"
        ],
        [
            "The China first presentation is at first by briefly, one to talk about CTS.",
            "Then I will explain the CTS clouding interface.",
            "What it actually means.",
            "I will talk about the data set and as long as last time I thought it would be a good idea to discuss some of the open questions from the paper reviews."
        ],
        [
            "So generally CTS is web service but can be used to request text, data, text resources as data and it uses a unique UN citation citation scheme that is."
        ],
        [
            "Based on the structure of documents, tax documents like chapter in sentence and so on.",
            "So here you can see CSU ends but would be used to refer to a complete document.",
            "The text of a complete document.",
            "And then."
        ],
        [
            "You can refer to each of the site.",
            "Each of the text parts have structural elements on any site."
        ],
        [
            "Kacian level you can."
        ],
        [
            "So to something like this where you refer to a text passage that starts at one text part and ends at another, and."
        ],
        [
            "It's a presentation.",
            "You can do this on character, Colonel loyalty."
        ],
        [
            "CTS request looks like this.",
            "It's a URL.",
            "It starts with the server application obviously.",
            "Then you have a parameter request which is B.",
            "Name of the function that we want to use.",
            "For example, get passage and then you add the function parameters as parameters.",
            "For example, get parameters like.",
            "In this case the CTS.",
            "You the response is an XML document which contains the information about the request and for apply."
        ],
        [
            "But idea for the CTS client interface was to create workflow that includes clearing Doc or creates client documents for every document level.",
            "CTS UN based on the meta information that is served by the CTS."
        ],
        [
            "Each of the documents is then."
        ],
        [
            "Well created with a set of resources and each of the resources are hyperlinks to CTS.",
            "Requests on citation to the text parts on citation level, one in the last years, example of."
        ],
        [
            "Bible data of this was always one book of the Bible.",
            "Like for example Genesis."
        ],
        [
            "In this example."
        ],
        [
            "It's a little bit more heterogen."
        ],
        [
            "The data set that we included is called Digital Motivus and.",
            "It's a collection of Simi Monthly published Journal that was published by Muhammad Quarterly in the early 1900s.",
            "At first in Cairo and later in Damascus.",
            "It contains roughly 4 million tokens and was written by multiple more than 100 offers.",
            "And the texts are apparently available in multiple libraries, but as I understand it, it's kind of scattered distributions, or it's not so easy to find a comprehensive collection of the texts."
        ],
        [
            "The texts are mundane texts or periodicals.",
            "Which makes them interesting, because it can be they can be used to investigate kind of contemporary perspectives on.",
            "Social issues that were relevant at the time and since it spans multiple years, like in the most obvious example, 12 years, we can also be used to investigate how these perspectives changed or evolved over the course of time."
        ],
        [
            "The AIM software project will tour.",
            "For once to validate between Scription against the facsimiles, which as I understand, is especially important because our big OCR is not that good, so there's a lot of correction that needs to be done.",
            "They were using a community based approach.",
            "And the goal was also to make the data eventually citable for humans and machines.",
            "Using open licenses.",
            "They didn't want to reinvent any of the tools, but whatever they wanted to use existing at established solutions and tools.",
            "And as I can see, they also didn't really invent any new thing."
        ],
        [
            "The deliverables are T XML files.",
            "The data is also available as plain text as marked on.",
            "Watsan Bibtex entries are available for each of the articles so they can be a chemically cited.",
            "Using bittrex.",
            "That is an inclusion of or.",
            "The data is also made available using the TI Boilerplate framework, which basically is a.",
            "Set of rendering rules for TI content like, well, the browser renders HTML similar principle.",
            "And the project is organized.",
            "Among others, using it Sotero Coop, which is a collaborative research.",
            "Organization.",
            "Web platform.",
            "But data is made available using GitHub.",
            "And well, yeah, so do I don't want to know do I said the moment but get up.",
            "With the obvious benefits.",
            "Of the system like you can work collaboratively and you have kind of version control system and an Open Access to the data.",
            "The license for the tools and so on are chosen in a way that promotes usability and openness.",
            "Then there's also a DUI for the project."
        ],
        [
            "The current state of the project is vetted, evolved to be open Arabic political additions and I assume that this means that the scope will is getting expanded so that more channels are shown as are added.",
            "Faster, some editorial changes and discussions further going on, including.",
            "The addition of missing parts, which may be sound a little bit weird, but.",
            "Well, at least two colored as he told me that at least the digital motorbus data that can be considered as stable.",
            "And if there are changes then this will mostly be improvements on the meta data which is not very nice in some cases.",
            "And about also working on the improving improvements on of the online availability of the data.",
            "Yeah, but basically.",
            "Baba paper content.",
            "And now I'm going to talk about some of the open questions from the reviews."
        ],
        [
            "One reviewer mentioned, but some of it would be nice to have references in the paper to name web pages which is correct and I forgot to correct this in the papers, but why I edit them here?",
            "There's a project website for the CTS project and also an online presentation for digital media bus as well as the GitHub repository."
        ],
        [
            "Copyright was mentioned and asked how we deal with it.",
            "I don't know.",
            "It's kind of a problem, but I can outsource.",
            "Because from the CTS perspective.",
            "Oh well, CTS doesn't provide a licensing mechanism.",
            "But I edited to be implementation simply.",
            "To be able to solve Creative Commons content.",
            "And the mechanism is basically that the license text that is specified by the editors is added.",
            "To the passage and then you have source governments.",
            "To the original file and the source code for and suspend.",
            "Expanded with the information about the city's request.",
            "To include procedures involve source."
        ],
        [
            "Um, this well yeah, it's kind of an.",
            "Clearing up a misunderstanding or potential misunderstandings or the papers, not about.",
            "Integrating CTS functionality into Klein or something like this but wava using CTS requests or CTS request a static text parts as electronic resources that are included and made available using clubbing."
        ],
        [
            "One editor or reviewer mentioned that it would be good to have pointers to the complete edition.",
            "If you have a CTS.",
            "What happens to the CTS when you can always replace the function name with get capabilities which will return the text inventory and protects inventory, is basically a complete.",
            "Collection or overview about the collection of the documents."
        ],
        [
            "The titles are not very nice, which is 2.",
            "So yeah, maybe I should add this.",
            "The data is available in virtual language observatories.",
            "We can look at it life.",
            "Basically, the titles are not very good, which is basically.",
            "It's the titles.",
            "These are the titles in the source files and we cannot change them.",
            "We need to update for we need to wait for an update in order to have something more meaningful.",
            "So most of the titles are actually the same."
        ],
        [
            "The structure is not very well described.",
            "Which I will skip."
        ],
        [
            "Cause this one is, I think, more important.",
            "All of the resource links are have the same name and the name is CTS.",
            "And this is something that we cannot change, and it simply due to the fact that these names are.",
            "I don't know if they are chosen automatically or we had to choose something based on the, but they are chosen from the file path and file path.",
            "In this case ends with CTS.",
            "So it would be good to have possibility to manually specify a name.",
            "In this case, ma'am.",
            "So we can for example use something like Chapter 1.1 or something like this.",
            "Instead of CTS."
        ],
        [
            "Um, yeah.",
            "One reviewer mentioned that the meter data is a little bit poor, which is true.",
            "Um?",
            "At first, the proposed Sciandra tech well.",
            "Thank you with nice addition that will be added to the text inventory in some future.",
            "Implemented a future state.",
            "And the written text meta data can probably just be assumed for CTS, and it should be automatically added in the next iterations of this workflow."
        ],
        [
            "And here's the contact information and this was who presentation of paper.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People, but I'm presenting.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It was a collaboration between two colored myself to color from the oil and instituted by would, myself, and.",
                    "label": 0
                },
                {
                    "sent": "Via client team and light switch and the goal was to include.",
                    "label": 0
                },
                {
                    "sent": "But digital Muteba state does it.",
                    "label": 0
                },
                {
                    "sent": "In the incline in Virtual language Observatory, using the Canonical text service interface that was presented last year.",
                    "label": 1
                },
                {
                    "sent": "What?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The China first presentation is at first by briefly, one to talk about CTS.",
                    "label": 0
                },
                {
                    "sent": "Then I will explain the CTS clouding interface.",
                    "label": 0
                },
                {
                    "sent": "What it actually means.",
                    "label": 0
                },
                {
                    "sent": "I will talk about the data set and as long as last time I thought it would be a good idea to discuss some of the open questions from the paper reviews.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So generally CTS is web service but can be used to request text, data, text resources as data and it uses a unique UN citation citation scheme that is.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Based on the structure of documents, tax documents like chapter in sentence and so on.",
                    "label": 0
                },
                {
                    "sent": "So here you can see CSU ends but would be used to refer to a complete document.",
                    "label": 0
                },
                {
                    "sent": "The text of a complete document.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can refer to each of the site.",
                    "label": 0
                },
                {
                    "sent": "Each of the text parts have structural elements on any site.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Kacian level you can.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to something like this where you refer to a text passage that starts at one text part and ends at another, and.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's a presentation.",
                    "label": 0
                },
                {
                    "sent": "You can do this on character, Colonel loyalty.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "CTS request looks like this.",
                    "label": 1
                },
                {
                    "sent": "It's a URL.",
                    "label": 0
                },
                {
                    "sent": "It starts with the server application obviously.",
                    "label": 0
                },
                {
                    "sent": "Then you have a parameter request which is B.",
                    "label": 0
                },
                {
                    "sent": "Name of the function that we want to use.",
                    "label": 0
                },
                {
                    "sent": "For example, get passage and then you add the function parameters as parameters.",
                    "label": 0
                },
                {
                    "sent": "For example, get parameters like.",
                    "label": 0
                },
                {
                    "sent": "In this case the CTS.",
                    "label": 0
                },
                {
                    "sent": "You the response is an XML document which contains the information about the request and for apply.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But idea for the CTS client interface was to create workflow that includes clearing Doc or creates client documents for every document level.",
                    "label": 0
                },
                {
                    "sent": "CTS UN based on the meta information that is served by the CTS.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Each of the documents is then.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well created with a set of resources and each of the resources are hyperlinks to CTS.",
                    "label": 0
                },
                {
                    "sent": "Requests on citation to the text parts on citation level, one in the last years, example of.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Bible data of this was always one book of the Bible.",
                    "label": 0
                },
                {
                    "sent": "Like for example Genesis.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this example.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's a little bit more heterogen.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The data set that we included is called Digital Motivus and.",
                    "label": 0
                },
                {
                    "sent": "It's a collection of Simi Monthly published Journal that was published by Muhammad Quarterly in the early 1900s.",
                    "label": 0
                },
                {
                    "sent": "At first in Cairo and later in Damascus.",
                    "label": 1
                },
                {
                    "sent": "It contains roughly 4 million tokens and was written by multiple more than 100 offers.",
                    "label": 0
                },
                {
                    "sent": "And the texts are apparently available in multiple libraries, but as I understand it, it's kind of scattered distributions, or it's not so easy to find a comprehensive collection of the texts.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The texts are mundane texts or periodicals.",
                    "label": 0
                },
                {
                    "sent": "Which makes them interesting, because it can be they can be used to investigate kind of contemporary perspectives on.",
                    "label": 0
                },
                {
                    "sent": "Social issues that were relevant at the time and since it spans multiple years, like in the most obvious example, 12 years, we can also be used to investigate how these perspectives changed or evolved over the course of time.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The AIM software project will tour.",
                    "label": 0
                },
                {
                    "sent": "For once to validate between Scription against the facsimiles, which as I understand, is especially important because our big OCR is not that good, so there's a lot of correction that needs to be done.",
                    "label": 1
                },
                {
                    "sent": "They were using a community based approach.",
                    "label": 1
                },
                {
                    "sent": "And the goal was also to make the data eventually citable for humans and machines.",
                    "label": 0
                },
                {
                    "sent": "Using open licenses.",
                    "label": 0
                },
                {
                    "sent": "They didn't want to reinvent any of the tools, but whatever they wanted to use existing at established solutions and tools.",
                    "label": 1
                },
                {
                    "sent": "And as I can see, they also didn't really invent any new thing.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The deliverables are T XML files.",
                    "label": 0
                },
                {
                    "sent": "The data is also available as plain text as marked on.",
                    "label": 0
                },
                {
                    "sent": "Watsan Bibtex entries are available for each of the articles so they can be a chemically cited.",
                    "label": 0
                },
                {
                    "sent": "Using bittrex.",
                    "label": 0
                },
                {
                    "sent": "That is an inclusion of or.",
                    "label": 0
                },
                {
                    "sent": "The data is also made available using the TI Boilerplate framework, which basically is a.",
                    "label": 0
                },
                {
                    "sent": "Set of rendering rules for TI content like, well, the browser renders HTML similar principle.",
                    "label": 0
                },
                {
                    "sent": "And the project is organized.",
                    "label": 0
                },
                {
                    "sent": "Among others, using it Sotero Coop, which is a collaborative research.",
                    "label": 0
                },
                {
                    "sent": "Organization.",
                    "label": 0
                },
                {
                    "sent": "Web platform.",
                    "label": 0
                },
                {
                    "sent": "But data is made available using GitHub.",
                    "label": 0
                },
                {
                    "sent": "And well, yeah, so do I don't want to know do I said the moment but get up.",
                    "label": 0
                },
                {
                    "sent": "With the obvious benefits.",
                    "label": 0
                },
                {
                    "sent": "Of the system like you can work collaboratively and you have kind of version control system and an Open Access to the data.",
                    "label": 0
                },
                {
                    "sent": "The license for the tools and so on are chosen in a way that promotes usability and openness.",
                    "label": 0
                },
                {
                    "sent": "Then there's also a DUI for the project.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The current state of the project is vetted, evolved to be open Arabic political additions and I assume that this means that the scope will is getting expanded so that more channels are shown as are added.",
                    "label": 0
                },
                {
                    "sent": "Faster, some editorial changes and discussions further going on, including.",
                    "label": 0
                },
                {
                    "sent": "The addition of missing parts, which may be sound a little bit weird, but.",
                    "label": 0
                },
                {
                    "sent": "Well, at least two colored as he told me that at least the digital motorbus data that can be considered as stable.",
                    "label": 0
                },
                {
                    "sent": "And if there are changes then this will mostly be improvements on the meta data which is not very nice in some cases.",
                    "label": 0
                },
                {
                    "sent": "And about also working on the improving improvements on of the online availability of the data.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but basically.",
                    "label": 0
                },
                {
                    "sent": "Baba paper content.",
                    "label": 0
                },
                {
                    "sent": "And now I'm going to talk about some of the open questions from the reviews.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One reviewer mentioned, but some of it would be nice to have references in the paper to name web pages which is correct and I forgot to correct this in the papers, but why I edit them here?",
                    "label": 0
                },
                {
                    "sent": "There's a project website for the CTS project and also an online presentation for digital media bus as well as the GitHub repository.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Copyright was mentioned and asked how we deal with it.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "It's kind of a problem, but I can outsource.",
                    "label": 0
                },
                {
                    "sent": "Because from the CTS perspective.",
                    "label": 0
                },
                {
                    "sent": "Oh well, CTS doesn't provide a licensing mechanism.",
                    "label": 0
                },
                {
                    "sent": "But I edited to be implementation simply.",
                    "label": 0
                },
                {
                    "sent": "To be able to solve Creative Commons content.",
                    "label": 0
                },
                {
                    "sent": "And the mechanism is basically that the license text that is specified by the editors is added.",
                    "label": 0
                },
                {
                    "sent": "To the passage and then you have source governments.",
                    "label": 0
                },
                {
                    "sent": "To the original file and the source code for and suspend.",
                    "label": 0
                },
                {
                    "sent": "Expanded with the information about the city's request.",
                    "label": 0
                },
                {
                    "sent": "To include procedures involve source.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um, this well yeah, it's kind of an.",
                    "label": 0
                },
                {
                    "sent": "Clearing up a misunderstanding or potential misunderstandings or the papers, not about.",
                    "label": 0
                },
                {
                    "sent": "Integrating CTS functionality into Klein or something like this but wava using CTS requests or CTS request a static text parts as electronic resources that are included and made available using clubbing.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One editor or reviewer mentioned that it would be good to have pointers to the complete edition.",
                    "label": 1
                },
                {
                    "sent": "If you have a CTS.",
                    "label": 0
                },
                {
                    "sent": "What happens to the CTS when you can always replace the function name with get capabilities which will return the text inventory and protects inventory, is basically a complete.",
                    "label": 0
                },
                {
                    "sent": "Collection or overview about the collection of the documents.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The titles are not very nice, which is 2.",
                    "label": 0
                },
                {
                    "sent": "So yeah, maybe I should add this.",
                    "label": 0
                },
                {
                    "sent": "The data is available in virtual language observatories.",
                    "label": 0
                },
                {
                    "sent": "We can look at it life.",
                    "label": 0
                },
                {
                    "sent": "Basically, the titles are not very good, which is basically.",
                    "label": 0
                },
                {
                    "sent": "It's the titles.",
                    "label": 0
                },
                {
                    "sent": "These are the titles in the source files and we cannot change them.",
                    "label": 0
                },
                {
                    "sent": "We need to update for we need to wait for an update in order to have something more meaningful.",
                    "label": 0
                },
                {
                    "sent": "So most of the titles are actually the same.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The structure is not very well described.",
                    "label": 0
                },
                {
                    "sent": "Which I will skip.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cause this one is, I think, more important.",
                    "label": 0
                },
                {
                    "sent": "All of the resource links are have the same name and the name is CTS.",
                    "label": 0
                },
                {
                    "sent": "And this is something that we cannot change, and it simply due to the fact that these names are.",
                    "label": 0
                },
                {
                    "sent": "I don't know if they are chosen automatically or we had to choose something based on the, but they are chosen from the file path and file path.",
                    "label": 0
                },
                {
                    "sent": "In this case ends with CTS.",
                    "label": 0
                },
                {
                    "sent": "So it would be good to have possibility to manually specify a name.",
                    "label": 0
                },
                {
                    "sent": "In this case, ma'am.",
                    "label": 0
                },
                {
                    "sent": "So we can for example use something like Chapter 1.1 or something like this.",
                    "label": 0
                },
                {
                    "sent": "Instead of CTS.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um, yeah.",
                    "label": 0
                },
                {
                    "sent": "One reviewer mentioned that the meter data is a little bit poor, which is true.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "At first, the proposed Sciandra tech well.",
                    "label": 0
                },
                {
                    "sent": "Thank you with nice addition that will be added to the text inventory in some future.",
                    "label": 1
                },
                {
                    "sent": "Implemented a future state.",
                    "label": 1
                },
                {
                    "sent": "And the written text meta data can probably just be assumed for CTS, and it should be automatically added in the next iterations of this workflow.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here's the contact information and this was who presentation of paper.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}