{
    "id": "brw5uuxd37n2lirpvsjse6rkvk2esp7r",
    "title": "Phase separation of C9orf 72 dipeptide repeats perturbs stress granule dynamics",
    "info": {
        "author": [
            "Steven Boeynaems, KU Leuven"
        ],
        "published": "July 21, 2017",
        "recorded": "May 2017",
        "category": [
            "Top->Medicine",
            "Top->Medicine->Neuroscience"
        ]
    },
    "url": "http://videolectures.net/encals2017_boeynaems_phase_separation/",
    "segmentation": [
        [
            "Since 2006 we know that TDP Mislocalization an Mississippi cacique and aggregation in the cytoplasm is the main type of pathology in a lesson.",
            "But we still know surprisingly little about molecular underpinnings of both dismiss localization, an aggregation soda."
        ],
        [
            "What we set out to do in this project.",
            "We wanted to know where how the C9 ORF mutation can actually make wild type TDP miss localized and aggregate and so."
        ],
        [
            "Early on we got interested in the Argentine rich DPR's because they were the most toxic in or disease models and true genetic screenings.",
            "Together with the GitLab winded found that be RNG are can induce nucleocytoplasmic transport effects, which could explain why proteins such as TDP start miss Localising in C9 cases but cooties Epr's also act on the aggregation itself."
        ],
        [
            "Well, first take a step back so we're always talking about TDP.",
            "But TDP is not alone there.",
            "There are other RNA binding proteins which are known to aggregate and miss localized and these 26 RNA binding proteins are found in postmortem case studies.",
            "To be miss localized or aggregating disease and 73% or stress granule proteins, and indeed for years stress screens have been a main target in a less.",
            "But what are stress greens really?",
            "So these are non membrane bound organelles that.",
            "Only form under times of stress.",
            "And yeah you can see them here.",
            "You can see these protein blocks in the cytoplasm, but they are completely reversible.",
            "So even though they look like the pathological aggregates because they have quite similar protein content, but they do not behave as aggregates at all."
        ],
        [
            "In fact they are very dynamic if you look at stress granules with life microscopy you can see that these start fusing together overtime and this is not solid like behavior.",
            "This is a clear form of liquid behavior and indeed in recent years it was found that these granules and other non memory bound organelles formed by a process called liquid liquid phase separation."
        ],
        [
            "So this may sound like a very exotic process, but during lunch you had probably some salad dressing and as a perfect example of liquid liquid phase separation, mix oil and water together and you will get oil droplets which confused together overtime into larger droplets.",
            "You really have two liquid, the mixed state and interesting Lee also were struggling as it was believed that hydrophobic interactions, mainly mediated by tyrosine rich residues, were the key drivers of this phase separation behave."
        ],
        [
            "So we want to know if these Argentein Ridge DPR also could function somewhere in phase separation or aggregation of these are name binding proteins.",
            "But your surprise we found they can actually face separate by themselves.",
            "So if we incubate PR just in a test tube it's clear.",
            "But when we add molecular Crowder to the solution so when we force these molecules on top of each other they start interacting and you get this cloudy state and if we put this cloudy sample under microscope you can see their full of these droplets which fuse together overtime to larger droplets.",
            "And we did a lot of biophysics on them and they really behave as liquid's.",
            "So but"
        ],
        [
            "This doesn't make any sense because no PR is 50%, Origin origin is positively charged.",
            "These peptides should repel each other, so we reason there was a need for counter onions in our system to stabilize these arginine arginine interactions.",
            "And we figured out it was actually the phosphate from our buffer.",
            "So what we did here was we incubated PR with the molecular crowding just in water.",
            "Nothing happens, but then we can add different salts and depending on the charge of the onion, so the more negative charge we put into the solution.",
            "We could or could not.",
            "Stabilize phase separation.",
            "So if inorganic salts can do this, we reasoned that maybe also biological anyons could do the same trick.",
            "An RNA which is a main component of service can use is a biological pollinium.",
            "And indeed when we incubate PR with increasing doses of RNA, we get more phase separation.",
            "And by the way we measure here phase separation as stupidity.",
            "So the more clouded assembled the higher determine."
        ],
        [
            "So you could argue we made a very, very basic model of a protein RNA granule and we wanted to slowly increase the complexity of our test tube model system.",
            "So we wanted to start adding cellular proteins and we did a very very basic and simple experiment.",
            "So we took just HeLa.",
            "Cell is 8 spun down insoluble fraction, so we had pure solubilize 8.",
            "If we put that solubilize it back in a test tube, spin it down, we get 0 background, there's no ballot.",
            "However, when we edit BR do this lies eight.",
            "We all of the sudden would get phase separation, socialize it turned cloudy and we could these proteins it Warface separated we could separate them from the solution by mild gentrification and then you can see we got a ballot which we could put on gel.",
            "But we were very surprised because we could 4 text.",
            "We could watch this palette and it wasn't disrupted, so suggesting these were not liquid in directions and these were more like solid aggregates.",
            "So we were a bit puzzled with that.",
            "But we were inspired by the work from Doctor Parker Witches who is shown that sellers can also have a stable core surrounded by weak liquid shell.",
            "So indeed, if you also do mild crosslink experiments with B of A, we stabilize more proteins into the Palace.",
            "So suggesting that we indeed.",
            "Are stabilizing weak liquid interactions."
        ],
        [
            "So of course we wanted to know which proteins are these we performed.",
            "Mass spec analysis.",
            "We identified 874 proteins in these pellets.",
            "And reassuringly when we did some enrichment analysis.",
            "Geo Category is a stress granule, metabolism and arnay metabolism popped up but also protein folding and intracellular protein transport.",
            "As we had found previously.",
            "Also TPR data set overlap with known liquid compartments from the cell being the nucleos and the stress crying."
        ],
        [
            "So what were other characteristics of these proteins?",
            "So these proteins were also reached in low complexity domains, so highly repetitive regions or regions with not a lot of amino asset diversity?",
            "For example, arginine rich domains, which ones more suggested ordinance, could be important in this process?",
            "They were also more disordered than you would expect by chance, and also more supersaturate and supersaturation is an sort of aggregation score which takes in.",
            "To account aggregation propensity and the seller concentration of that protein.",
            "So when these are all hallmarks of proteins, pronterface operation."
        ],
        [
            "So, but I told you we were interesting in these idea of a potential stable core and a liquid shell.",
            "So we found 190 proteins.",
            "Which were.",
            "Enriched in the crosslinked fraction and so we checked for different protein families in there, and the ribosomal proteins for the most intriguing.",
            "So ribosomal proteins of the 60th subunit were not enriched by crosslinking, whereas those of the 40s subunit were, and for years we have known that in a cellar stress granule, the four key S subunit is enriched in distress granule, and a six yes is expelled from the start screen, so even in our very very basic desktop model we could recapitulate some of the specificities.",
            "So Sheated with seller stress granules.",
            "Now."
        ],
        [
            "Of course this is only in the test tube, So what is happening in a living cell?",
            "Well, when we overexpress PR incels we see that it goes to the nucleolus, as was shown previously.",
            "But it also starts forming these granules inside the plasma and they were positive for GBP to suggesting that these are stress granules.",
            "Indeed, PR was also more able to induce stress going on.",
            "For example, a PA.",
            "So this is definitely not only because of the stress of transaction and these PR granules were responsive to the compounds you would expect them to be so arsenite and puromycin increase the number of these granules and cycloheximide decreased the number.",
            "Then there was.",
            "The main question is this biology or is this physics?",
            "So do the stress granules form just because PR initiates a phase separation?",
            "And then recruit structural proteins.",
            "Or do you need a working stress response to do so?",
            "And we tested this idea by using cell lines which had a non phosphorylated form of EF 2A and EF 2A phosphorylation is the key event that kickstarts the stress response.",
            "And indeed when this was an unfavorable forma VF 2A, we couldn't induce stress granules in the same was true for GDP knockout cell lines and GDP is just downstream of the F 2A.",
            "Again, then, we couldn't induce stress granules, so PR struggle.",
            "Induction seems to be still dependent.",
            "On a working stress response."
        ],
        [
            "So PR induces stress granules, but do these guys have exactly the same characteristics?",
            "True frap analysis.",
            "We found that our PR and used Transcranial's were slightly less dynamic compared to arsenite induced Ros panels which we use as a control stress criminal.",
            "But wasn't what was most striking is that there was a difference in the protein content of these granules.",
            "So if we stay in for a general stress granule marker YB one, we don't see a difference.",
            "However, a late stress granule marker DDS six was enriching TPR granules and also a less related protein.",
            "Such a tax in two and TDP 40 three were enriched in TPR induced stress granules compared to control stress creates, so the fact that PR makes these stress less dynamic.",
            "And also recruits more of these aggregation prone proteins.",
            "So just that to us that maybe PR directly interacts with these aggregation prone proteins."
        ],
        [
            "And so we used the first low complexity domain as a model for this.",
            "So first low complexity domain by itself can also face separate, which you can see here, and overtime these droplets will fuse together an coursing through hostile driving.",
            "So it's a very dynamic system.",
            "If you add GP, nothing happens.",
            "However, if you at BR, it seems that like we freeze up, these profus protein droplets, so we reduced the dynamics of this system.",
            "And indeed if we add also THT to these samples, we see that PR addition not only decreases the lack face.",
            "Of TH E increase, but also makes the plateau retire fluorescent value, so suggesting that indeed PR can promote a liquid to solid switch of these prime like domains.",
            "So as a conclusion."
        ],
        [
            "We have shown that there is a strong role for arginine residues besides these tires and residues in liquid and solid phase transition.",
            "We also have shown that PR induces stress going through this integrated stress response and at PR can promote a liquid to solid switch of a LS related proteins.",
            "Now these were all published data and I quickly want to give a teaser of stuff we're still doing so."
        ],
        [
            "We have shown that PR granules can be in used.",
            "Your face arrest can be used by nucleating with a polyanion and so here we incubated with album in with this negative charge protein.",
            "Nothing happens.",
            "However, if we incubate with all these biolog biology related only onions, we see that we can induce PR phase separation, but the extent of phase separation and also like the shape and the dynamics heavily depend on the nucleator species.",
            "And of course we are interested in RNA."
        ],
        [
            "So we did some preliminary experiments with different RNAs so we have a fully a bully U policy in apology.",
            "Apology clearly does something different, forms more these aggregates, whereas the other ones form these droplets.",
            "But even though these droplets look the same, we see that for example the Poly A is far more viscous than the pulley.",
            "You and the policy are with drop but also with droplet Fusion dynamics we can calculate even the viscosity and you see that BA is way more viscous than at.",
            "Bully you or policy so this made us wonder.",
            "We always look at RNA's struggles as maybe simple bystanders, and we think that Brookings dictate the material state of these granules with.",
            "So we're now figuring out ways how to test it in cells to see when we would alter the ornate content of these granules.",
            "We can also alter their dynamics so."
        ],
        [
            "I have to thank loads of people who contributed these projects.",
            "All these collaborators here are funding agencies an I have to thank abstract Committee for selecting me for a talk and you for your attention.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Since 2006 we know that TDP Mislocalization an Mississippi cacique and aggregation in the cytoplasm is the main type of pathology in a lesson.",
                    "label": 0
                },
                {
                    "sent": "But we still know surprisingly little about molecular underpinnings of both dismiss localization, an aggregation soda.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What we set out to do in this project.",
                    "label": 0
                },
                {
                    "sent": "We wanted to know where how the C9 ORF mutation can actually make wild type TDP miss localized and aggregate and so.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Early on we got interested in the Argentine rich DPR's because they were the most toxic in or disease models and true genetic screenings.",
                    "label": 0
                },
                {
                    "sent": "Together with the GitLab winded found that be RNG are can induce nucleocytoplasmic transport effects, which could explain why proteins such as TDP start miss Localising in C9 cases but cooties Epr's also act on the aggregation itself.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, first take a step back so we're always talking about TDP.",
                    "label": 0
                },
                {
                    "sent": "But TDP is not alone there.",
                    "label": 0
                },
                {
                    "sent": "There are other RNA binding proteins which are known to aggregate and miss localized and these 26 RNA binding proteins are found in postmortem case studies.",
                    "label": 0
                },
                {
                    "sent": "To be miss localized or aggregating disease and 73% or stress granule proteins, and indeed for years stress screens have been a main target in a less.",
                    "label": 0
                },
                {
                    "sent": "But what are stress greens really?",
                    "label": 0
                },
                {
                    "sent": "So these are non membrane bound organelles that.",
                    "label": 0
                },
                {
                    "sent": "Only form under times of stress.",
                    "label": 0
                },
                {
                    "sent": "And yeah you can see them here.",
                    "label": 0
                },
                {
                    "sent": "You can see these protein blocks in the cytoplasm, but they are completely reversible.",
                    "label": 0
                },
                {
                    "sent": "So even though they look like the pathological aggregates because they have quite similar protein content, but they do not behave as aggregates at all.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In fact they are very dynamic if you look at stress granules with life microscopy you can see that these start fusing together overtime and this is not solid like behavior.",
                    "label": 0
                },
                {
                    "sent": "This is a clear form of liquid behavior and indeed in recent years it was found that these granules and other non memory bound organelles formed by a process called liquid liquid phase separation.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this may sound like a very exotic process, but during lunch you had probably some salad dressing and as a perfect example of liquid liquid phase separation, mix oil and water together and you will get oil droplets which confused together overtime into larger droplets.",
                    "label": 0
                },
                {
                    "sent": "You really have two liquid, the mixed state and interesting Lee also were struggling as it was believed that hydrophobic interactions, mainly mediated by tyrosine rich residues, were the key drivers of this phase separation behave.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we want to know if these Argentein Ridge DPR also could function somewhere in phase separation or aggregation of these are name binding proteins.",
                    "label": 1
                },
                {
                    "sent": "But your surprise we found they can actually face separate by themselves.",
                    "label": 0
                },
                {
                    "sent": "So if we incubate PR just in a test tube it's clear.",
                    "label": 0
                },
                {
                    "sent": "But when we add molecular Crowder to the solution so when we force these molecules on top of each other they start interacting and you get this cloudy state and if we put this cloudy sample under microscope you can see their full of these droplets which fuse together overtime to larger droplets.",
                    "label": 0
                },
                {
                    "sent": "And we did a lot of biophysics on them and they really behave as liquid's.",
                    "label": 0
                },
                {
                    "sent": "So but",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This doesn't make any sense because no PR is 50%, Origin origin is positively charged.",
                    "label": 0
                },
                {
                    "sent": "These peptides should repel each other, so we reason there was a need for counter onions in our system to stabilize these arginine arginine interactions.",
                    "label": 0
                },
                {
                    "sent": "And we figured out it was actually the phosphate from our buffer.",
                    "label": 0
                },
                {
                    "sent": "So what we did here was we incubated PR with the molecular crowding just in water.",
                    "label": 0
                },
                {
                    "sent": "Nothing happens, but then we can add different salts and depending on the charge of the onion, so the more negative charge we put into the solution.",
                    "label": 0
                },
                {
                    "sent": "We could or could not.",
                    "label": 0
                },
                {
                    "sent": "Stabilize phase separation.",
                    "label": 0
                },
                {
                    "sent": "So if inorganic salts can do this, we reasoned that maybe also biological anyons could do the same trick.",
                    "label": 0
                },
                {
                    "sent": "An RNA which is a main component of service can use is a biological pollinium.",
                    "label": 0
                },
                {
                    "sent": "And indeed when we incubate PR with increasing doses of RNA, we get more phase separation.",
                    "label": 0
                },
                {
                    "sent": "And by the way we measure here phase separation as stupidity.",
                    "label": 0
                },
                {
                    "sent": "So the more clouded assembled the higher determine.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So you could argue we made a very, very basic model of a protein RNA granule and we wanted to slowly increase the complexity of our test tube model system.",
                    "label": 0
                },
                {
                    "sent": "So we wanted to start adding cellular proteins and we did a very very basic and simple experiment.",
                    "label": 1
                },
                {
                    "sent": "So we took just HeLa.",
                    "label": 0
                },
                {
                    "sent": "Cell is 8 spun down insoluble fraction, so we had pure solubilize 8.",
                    "label": 0
                },
                {
                    "sent": "If we put that solubilize it back in a test tube, spin it down, we get 0 background, there's no ballot.",
                    "label": 0
                },
                {
                    "sent": "However, when we edit BR do this lies eight.",
                    "label": 0
                },
                {
                    "sent": "We all of the sudden would get phase separation, socialize it turned cloudy and we could these proteins it Warface separated we could separate them from the solution by mild gentrification and then you can see we got a ballot which we could put on gel.",
                    "label": 0
                },
                {
                    "sent": "But we were very surprised because we could 4 text.",
                    "label": 0
                },
                {
                    "sent": "We could watch this palette and it wasn't disrupted, so suggesting these were not liquid in directions and these were more like solid aggregates.",
                    "label": 0
                },
                {
                    "sent": "So we were a bit puzzled with that.",
                    "label": 0
                },
                {
                    "sent": "But we were inspired by the work from Doctor Parker Witches who is shown that sellers can also have a stable core surrounded by weak liquid shell.",
                    "label": 0
                },
                {
                    "sent": "So indeed, if you also do mild crosslink experiments with B of A, we stabilize more proteins into the Palace.",
                    "label": 0
                },
                {
                    "sent": "So suggesting that we indeed.",
                    "label": 0
                },
                {
                    "sent": "Are stabilizing weak liquid interactions.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So of course we wanted to know which proteins are these we performed.",
                    "label": 0
                },
                {
                    "sent": "Mass spec analysis.",
                    "label": 0
                },
                {
                    "sent": "We identified 874 proteins in these pellets.",
                    "label": 1
                },
                {
                    "sent": "And reassuringly when we did some enrichment analysis.",
                    "label": 0
                },
                {
                    "sent": "Geo Category is a stress granule, metabolism and arnay metabolism popped up but also protein folding and intracellular protein transport.",
                    "label": 0
                },
                {
                    "sent": "As we had found previously.",
                    "label": 0
                },
                {
                    "sent": "Also TPR data set overlap with known liquid compartments from the cell being the nucleos and the stress crying.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what were other characteristics of these proteins?",
                    "label": 0
                },
                {
                    "sent": "So these proteins were also reached in low complexity domains, so highly repetitive regions or regions with not a lot of amino asset diversity?",
                    "label": 0
                },
                {
                    "sent": "For example, arginine rich domains, which ones more suggested ordinance, could be important in this process?",
                    "label": 0
                },
                {
                    "sent": "They were also more disordered than you would expect by chance, and also more supersaturate and supersaturation is an sort of aggregation score which takes in.",
                    "label": 0
                },
                {
                    "sent": "To account aggregation propensity and the seller concentration of that protein.",
                    "label": 0
                },
                {
                    "sent": "So when these are all hallmarks of proteins, pronterface operation.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So, but I told you we were interesting in these idea of a potential stable core and a liquid shell.",
                    "label": 1
                },
                {
                    "sent": "So we found 190 proteins.",
                    "label": 0
                },
                {
                    "sent": "Which were.",
                    "label": 0
                },
                {
                    "sent": "Enriched in the crosslinked fraction and so we checked for different protein families in there, and the ribosomal proteins for the most intriguing.",
                    "label": 0
                },
                {
                    "sent": "So ribosomal proteins of the 60th subunit were not enriched by crosslinking, whereas those of the 40s subunit were, and for years we have known that in a cellar stress granule, the four key S subunit is enriched in distress granule, and a six yes is expelled from the start screen, so even in our very very basic desktop model we could recapitulate some of the specificities.",
                    "label": 1
                },
                {
                    "sent": "So Sheated with seller stress granules.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course this is only in the test tube, So what is happening in a living cell?",
                    "label": 0
                },
                {
                    "sent": "Well, when we overexpress PR incels we see that it goes to the nucleolus, as was shown previously.",
                    "label": 0
                },
                {
                    "sent": "But it also starts forming these granules inside the plasma and they were positive for GBP to suggesting that these are stress granules.",
                    "label": 0
                },
                {
                    "sent": "Indeed, PR was also more able to induce stress going on.",
                    "label": 0
                },
                {
                    "sent": "For example, a PA.",
                    "label": 0
                },
                {
                    "sent": "So this is definitely not only because of the stress of transaction and these PR granules were responsive to the compounds you would expect them to be so arsenite and puromycin increase the number of these granules and cycloheximide decreased the number.",
                    "label": 0
                },
                {
                    "sent": "Then there was.",
                    "label": 0
                },
                {
                    "sent": "The main question is this biology or is this physics?",
                    "label": 0
                },
                {
                    "sent": "So do the stress granules form just because PR initiates a phase separation?",
                    "label": 0
                },
                {
                    "sent": "And then recruit structural proteins.",
                    "label": 0
                },
                {
                    "sent": "Or do you need a working stress response to do so?",
                    "label": 0
                },
                {
                    "sent": "And we tested this idea by using cell lines which had a non phosphorylated form of EF 2A and EF 2A phosphorylation is the key event that kickstarts the stress response.",
                    "label": 0
                },
                {
                    "sent": "And indeed when this was an unfavorable forma VF 2A, we couldn't induce stress granules in the same was true for GDP knockout cell lines and GDP is just downstream of the F 2A.",
                    "label": 0
                },
                {
                    "sent": "Again, then, we couldn't induce stress granules, so PR struggle.",
                    "label": 0
                },
                {
                    "sent": "Induction seems to be still dependent.",
                    "label": 0
                },
                {
                    "sent": "On a working stress response.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So PR induces stress granules, but do these guys have exactly the same characteristics?",
                    "label": 0
                },
                {
                    "sent": "True frap analysis.",
                    "label": 0
                },
                {
                    "sent": "We found that our PR and used Transcranial's were slightly less dynamic compared to arsenite induced Ros panels which we use as a control stress criminal.",
                    "label": 0
                },
                {
                    "sent": "But wasn't what was most striking is that there was a difference in the protein content of these granules.",
                    "label": 0
                },
                {
                    "sent": "So if we stay in for a general stress granule marker YB one, we don't see a difference.",
                    "label": 1
                },
                {
                    "sent": "However, a late stress granule marker DDS six was enriching TPR granules and also a less related protein.",
                    "label": 0
                },
                {
                    "sent": "Such a tax in two and TDP 40 three were enriched in TPR induced stress granules compared to control stress creates, so the fact that PR makes these stress less dynamic.",
                    "label": 0
                },
                {
                    "sent": "And also recruits more of these aggregation prone proteins.",
                    "label": 0
                },
                {
                    "sent": "So just that to us that maybe PR directly interacts with these aggregation prone proteins.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so we used the first low complexity domain as a model for this.",
                    "label": 0
                },
                {
                    "sent": "So first low complexity domain by itself can also face separate, which you can see here, and overtime these droplets will fuse together an coursing through hostile driving.",
                    "label": 0
                },
                {
                    "sent": "So it's a very dynamic system.",
                    "label": 0
                },
                {
                    "sent": "If you add GP, nothing happens.",
                    "label": 0
                },
                {
                    "sent": "However, if you at BR, it seems that like we freeze up, these profus protein droplets, so we reduced the dynamics of this system.",
                    "label": 0
                },
                {
                    "sent": "And indeed if we add also THT to these samples, we see that PR addition not only decreases the lack face.",
                    "label": 0
                },
                {
                    "sent": "Of TH E increase, but also makes the plateau retire fluorescent value, so suggesting that indeed PR can promote a liquid to solid switch of these prime like domains.",
                    "label": 0
                },
                {
                    "sent": "So as a conclusion.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have shown that there is a strong role for arginine residues besides these tires and residues in liquid and solid phase transition.",
                    "label": 1
                },
                {
                    "sent": "We also have shown that PR induces stress going through this integrated stress response and at PR can promote a liquid to solid switch of a LS related proteins.",
                    "label": 0
                },
                {
                    "sent": "Now these were all published data and I quickly want to give a teaser of stuff we're still doing so.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have shown that PR granules can be in used.",
                    "label": 1
                },
                {
                    "sent": "Your face arrest can be used by nucleating with a polyanion and so here we incubated with album in with this negative charge protein.",
                    "label": 0
                },
                {
                    "sent": "Nothing happens.",
                    "label": 0
                },
                {
                    "sent": "However, if we incubate with all these biolog biology related only onions, we see that we can induce PR phase separation, but the extent of phase separation and also like the shape and the dynamics heavily depend on the nucleator species.",
                    "label": 0
                },
                {
                    "sent": "And of course we are interested in RNA.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we did some preliminary experiments with different RNAs so we have a fully a bully U policy in apology.",
                    "label": 0
                },
                {
                    "sent": "Apology clearly does something different, forms more these aggregates, whereas the other ones form these droplets.",
                    "label": 0
                },
                {
                    "sent": "But even though these droplets look the same, we see that for example the Poly A is far more viscous than the pulley.",
                    "label": 0
                },
                {
                    "sent": "You and the policy are with drop but also with droplet Fusion dynamics we can calculate even the viscosity and you see that BA is way more viscous than at.",
                    "label": 0
                },
                {
                    "sent": "Bully you or policy so this made us wonder.",
                    "label": 0
                },
                {
                    "sent": "We always look at RNA's struggles as maybe simple bystanders, and we think that Brookings dictate the material state of these granules with.",
                    "label": 1
                },
                {
                    "sent": "So we're now figuring out ways how to test it in cells to see when we would alter the ornate content of these granules.",
                    "label": 0
                },
                {
                    "sent": "We can also alter their dynamics so.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I have to thank loads of people who contributed these projects.",
                    "label": 0
                },
                {
                    "sent": "All these collaborators here are funding agencies an I have to thank abstract Committee for selecting me for a talk and you for your attention.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}