{
    "id": "btvtrlz6akupe6yttk4hqudjmuw345pi",
    "title": "Identifying events in mobility data",
    "info": {
        "author": [
            "Branko Kavšek, Department of Intelligent Systems, Jožef Stefan Institute"
        ],
        "published": "Nov. 14, 2019",
        "recorded": "October 2019",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Artificial Intelligence"
        ]
    },
    "url": "http://videolectures.net/sikdd2019_kavsek_mobility_data/",
    "segmentation": [
        [
            "So identifying events in mobility data does the title and this is a joint work with Junior Radonich and the guys from the Renssalaer Polytechnic Institute.",
            "So Omar Malik and Bolesta Professor Bowl is low symanski.",
            "Most of you already heard this talk on the retreat, something similar so.",
            "What was the goal here?",
            "And this is still an ongoing research with RPI in the framework of the random Art project.",
            "So until end of November December then we have to finish it yet, so it's going to the tower, the end.",
            "So what does it mean?",
            "Defining what does it mean?",
            "Event and mobility?"
        ],
        [
            "So in event in this case is defined as some action that is the conflict consequence of some user or environment and mobility because we have data of people moving around.",
            "So for example, that is that our event.",
            "So going for sports driving or in the afternoon the weather is cold.",
            "The idea here for identifying events is to build a network of locations where people were moving and frequently visiting places, and then to try to identify what were the triggers that govern the choice of some users going one way and not the other.",
            "So going some days for sports instead of going home, for example, like every other day.",
            "So.",
            "Now we want to try to categorize this event, so we try to describe them with some features and give them some either location features or time features and find irregularities in this event."
        ],
        [
            "So the motivation was to use the data that was collecting during the optimum project.",
            "So in that project, mobile application with revised people install this and their whereabouts were tracked for the duration of the project and.",
            "Our goal here was to perform some causality analysis like explained on the previous slides."
        ],
        [
            "So the data that we had was not really data from the project, but it was data collected later on.",
            "So it was data from that spent in seven years from 5th of July 2012 until 7th of April this year, sorry.",
            "These data were collected mostly Indiana and later we will see we somehow took just the data that were in Slovenia.",
            "And those data were collected every 30 seconds on phone.",
            "So phone sensors of the users were recording this data and every 30 seconds or 30 seconds a snapshot of this was taken.",
            "So this is picture from another.",
            "Paper this is how this stream of data looked like.",
            "So for example 1 user having this application started in .1 move 2.2 in 30 seconds again in 30 seconds 2.3 and then to some point 22.",
            "It can happen in the battery died in the meantime.",
            "So there are many of these streams.",
            "So even for the same user you can have many of those streams.",
            "The thing that my coworkers here here did on this same data was to categorize certain points appearing together, stay points.",
            "So for example, if we are moving in this room or around the Institute, that would not be like 100 points, but then clustered in just one.",
            "So what we took in this paper was we took this first part of the path, then use just one point 4 state point and then the last part of the path.",
            "Or if there are more standpoints then we broke this path into several sub paths.",
            "So we had data about 432 users in the beginning it was around 200,000 of this piece is either this path or a state point.",
            "To around a little bit more 200 and seven 209."
        ],
        [
            "So if we like abstract a little bit this data, it can look like this.",
            "So there's a path.",
            "Then there is a state, point or path standpoint.",
            "And let's say that this colors represent different users.",
            "And.",
            "So.",
            "We can we then try to connect.",
            "Also this routes again, so we already have them.",
            "By connecting state points and paths.",
            "So we have to somehow.",
            "Joined us together."
        ],
        [
            "So the goal identified the most likely path or continuation of route that the person will take from a certain state.",
            "Point is at a certain time what not really identify the most likely path, because this has already been done in another paper, but to identify the causes that govern such choice.",
            "So if we.",
            "Have this historical data then.",
            "Try to do this if I."
        ],
        [
            "Typing this picture so we have like.",
            "Some people going the same piece of route and then all of a sudden we have this Forks.",
            "So two groups are going here.",
            "Maybe one is going here.",
            "So what is the cause that govern this?",
            "Somebody goes here and the other.",
            "Group of people goes here.",
            "So in able to do that, in order to do that, we have to generate sorry some features.",
            "From our data.",
            "So basically we have data about longitude, latitude and times and from the spatial data, longitude and latitude.",
            "What we can do is we can generate some kind of regions and from time data we can generate like day of week, time of day or certain other stuff.",
            "So then it becomes a graph problem.",
            "So before tackling the original problem that is still ongoing work, we try to."
        ],
        [
            "Simplify this and justice.",
            "Limit our data to the to the region of Slovenia so like this."
        ],
        [
            "Wietecha longitude and latitude the.",
            "Rectangle and say OK, we will take just those paths and state points that are all inside this rectangle.",
            "And."
        ],
        [
            "In this way, we ended up with a little bit more than 110,000.",
            "The so-called activities, before they are around 200,000 and out from all those four.",
            "432 users just 227 were the ones that were moving just inside Slovenia and OK.",
            "This was the constraint on the on this rectangle of longitudes and latitudes.",
            "And we say, OK, let's see what are the 20 most frequent locations that people were visiting.",
            "Can generate all these additional features like time of the day is the weekend or not the region.",
            "So is Gordon's courage and Lubiana and other six like in total 6 regions.",
            "And then we say, OK, we will just try to.",
            "Categorise if somebody is coming to some location going out from that location or stay in that location, are there this?",
            "Are there features such that can distinguish between people coming summer going out of summer or staying there?"
        ],
        [
            "So this is the.",
            "Somehow?"
        ],
        [
            "Pre process data.",
            "20 most frequent locations are depicted in these pictures, mostly in the center.",
            "Some is a little bit out and one is here.",
            "So if we forget these two, then we get."
        ],
        [
            "Like a.",
            "This 18 are all around here around the Institute and the most frequent, of course, is jsi."
        ],
        [
            "So this is for example where people went from or two jsi first inside, so this is just from and out of the most frequently."
        ],
        [
            "Creation.",
            "Then for the first experiment, we could do this for all the 20 most frequent locations, but we did it like for the most frequent.",
            "So for jsi.",
            "We take just those parts that end it or started from GSI or just were inside like a state point and our number of examples dropped to 17,000 and something.",
            "And this is pretty much a balanced data set because around 7000 went out 5000.",
            "Something stayed and 5000 and something going in.",
            "So now we have a well defined classification problem that supervised learning because we have a. Discrete class we just used like Vecna and try some classical algorithms.",
            "Do this experiment with temporal cross validation like one time, so classification accuracy."
        ],
        [
            "And we got the following results.",
            "So if we observe."
        ],
        [
            "The numbers here we would see that out is our majority class."
        ],
        [
            "And roughly 40% of all the.",
            "Examples were out, but if we apply the algorithms and I think as the M here yes performed the best I think don't have all the results.",
            "Table and results are around 70%.",
            "So is this good or not?",
            "We don't know because we didn't perform the statistical testing, but it turns out that.",
            "Some pretty obvious rules were discovered, so saying in the morning people are coming to work later, they are going to lunch, so going out and coming in again.",
            "This one has been discovered, so quite some people were moving from GSI to the place of the where the startup companies are, so they're at the post.",
            "No, actually not, not, at least.",
            "So yeah, and I will talk.",
            "So."
        ],
        [
            "Degreased would be.",
            "Yeah, I agree it would probably be one of the other locations here.",
            "I will talk about this later because you can see here.",
            "There is a grid of location and this is due to the fact that we discretize the longitude and latitude to two decimal places.",
            "That proved to be not a good move because we lost some accuracy and."
        ],
        [
            "We got this nasty greed effect OK."
        ],
        [
            "So what were the findings already listed?",
            "So that was one of the finding as well surrounding this logic related to data was not really the best way of going.",
            "So now already we're already doing so.",
            "Further research on using the similar approach like like the guys in the paper when defining state points were using.",
            "So if this points are in a radius of 150 meters, so maybe then it's the same.",
            "Point also including time.",
            "So what was the other thing with it, and?"
        ],
        [
            "This is if we look at this picture here.",
            "Here.",
            "So we really simplified and we just took the 1st and the last.",
            "A coordinate of a path and somehow disregarded everything that is in between so.",
            "This is why we got just this like well known."
        ],
        [
            "Results run on rules.",
            "So now next step is to take all and to see and to try to match this subpaths and really identify what are the causes of these Forks.",
            "OK."
        ],
        [
            "So conclusion.",
            "Some rules were detected, but all those.",
            "Predicted like somehow obvious behavior that we already knew.",
            "Maybe that proves that the algorithm work, but we need further research to see what are really the causality behind this.",
            "People moving around so longer routes will be needed for that.",
            "So taking all the points in between all the 30 interval points and so.",
            "Yeah, basically that's it.",
            "Yes, I tried.",
            "There are some results but I have to find you on a little bit so by the end of the month I should have some more promising results.",
            "So that would be the goal.",
            "So what we need to report explaining explain this for explain this fork and the inclusion of the guys from LP.",
            "They will try to look at the graph properties of the of this network, so maybe some other centrality measures will be.",
            "I don't.",
            "No, but yeah.",
            "This is also that was, that's why we try to work with them there.",
            "Yeah.",
            "Yeah.",
            "Yeah, we generated like 10 or something.",
            "Features most of them tide to the time, but because the space is just the region because you cannot do much more with space, you have longitude, latitude.",
            "You can define the regions somehow.",
            "Ad hoc."
        ],
        [
            "OK, thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So identifying events in mobility data does the title and this is a joint work with Junior Radonich and the guys from the Renssalaer Polytechnic Institute.",
                    "label": 1
                },
                {
                    "sent": "So Omar Malik and Bolesta Professor Bowl is low symanski.",
                    "label": 0
                },
                {
                    "sent": "Most of you already heard this talk on the retreat, something similar so.",
                    "label": 0
                },
                {
                    "sent": "What was the goal here?",
                    "label": 0
                },
                {
                    "sent": "And this is still an ongoing research with RPI in the framework of the random Art project.",
                    "label": 0
                },
                {
                    "sent": "So until end of November December then we have to finish it yet, so it's going to the tower, the end.",
                    "label": 0
                },
                {
                    "sent": "So what does it mean?",
                    "label": 0
                },
                {
                    "sent": "Defining what does it mean?",
                    "label": 0
                },
                {
                    "sent": "Event and mobility?",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in event in this case is defined as some action that is the conflict consequence of some user or environment and mobility because we have data of people moving around.",
                    "label": 1
                },
                {
                    "sent": "So for example, that is that our event.",
                    "label": 1
                },
                {
                    "sent": "So going for sports driving or in the afternoon the weather is cold.",
                    "label": 1
                },
                {
                    "sent": "The idea here for identifying events is to build a network of locations where people were moving and frequently visiting places, and then to try to identify what were the triggers that govern the choice of some users going one way and not the other.",
                    "label": 0
                },
                {
                    "sent": "So going some days for sports instead of going home, for example, like every other day.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Now we want to try to categorize this event, so we try to describe them with some features and give them some either location features or time features and find irregularities in this event.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the motivation was to use the data that was collecting during the optimum project.",
                    "label": 1
                },
                {
                    "sent": "So in that project, mobile application with revised people install this and their whereabouts were tracked for the duration of the project and.",
                    "label": 1
                },
                {
                    "sent": "Our goal here was to perform some causality analysis like explained on the previous slides.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the data that we had was not really data from the project, but it was data collected later on.",
                    "label": 1
                },
                {
                    "sent": "So it was data from that spent in seven years from 5th of July 2012 until 7th of April this year, sorry.",
                    "label": 0
                },
                {
                    "sent": "These data were collected mostly Indiana and later we will see we somehow took just the data that were in Slovenia.",
                    "label": 0
                },
                {
                    "sent": "And those data were collected every 30 seconds on phone.",
                    "label": 1
                },
                {
                    "sent": "So phone sensors of the users were recording this data and every 30 seconds or 30 seconds a snapshot of this was taken.",
                    "label": 0
                },
                {
                    "sent": "So this is picture from another.",
                    "label": 0
                },
                {
                    "sent": "Paper this is how this stream of data looked like.",
                    "label": 0
                },
                {
                    "sent": "So for example 1 user having this application started in .1 move 2.2 in 30 seconds again in 30 seconds 2.3 and then to some point 22.",
                    "label": 0
                },
                {
                    "sent": "It can happen in the battery died in the meantime.",
                    "label": 0
                },
                {
                    "sent": "So there are many of these streams.",
                    "label": 0
                },
                {
                    "sent": "So even for the same user you can have many of those streams.",
                    "label": 0
                },
                {
                    "sent": "The thing that my coworkers here here did on this same data was to categorize certain points appearing together, stay points.",
                    "label": 0
                },
                {
                    "sent": "So for example, if we are moving in this room or around the Institute, that would not be like 100 points, but then clustered in just one.",
                    "label": 0
                },
                {
                    "sent": "So what we took in this paper was we took this first part of the path, then use just one point 4 state point and then the last part of the path.",
                    "label": 0
                },
                {
                    "sent": "Or if there are more standpoints then we broke this path into several sub paths.",
                    "label": 0
                },
                {
                    "sent": "So we had data about 432 users in the beginning it was around 200,000 of this piece is either this path or a state point.",
                    "label": 0
                },
                {
                    "sent": "To around a little bit more 200 and seven 209.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So if we like abstract a little bit this data, it can look like this.",
                    "label": 0
                },
                {
                    "sent": "So there's a path.",
                    "label": 0
                },
                {
                    "sent": "Then there is a state, point or path standpoint.",
                    "label": 0
                },
                {
                    "sent": "And let's say that this colors represent different users.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We can we then try to connect.",
                    "label": 0
                },
                {
                    "sent": "Also this routes again, so we already have them.",
                    "label": 0
                },
                {
                    "sent": "By connecting state points and paths.",
                    "label": 1
                },
                {
                    "sent": "So we have to somehow.",
                    "label": 0
                },
                {
                    "sent": "Joined us together.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the goal identified the most likely path or continuation of route that the person will take from a certain state.",
                    "label": 1
                },
                {
                    "sent": "Point is at a certain time what not really identify the most likely path, because this has already been done in another paper, but to identify the causes that govern such choice.",
                    "label": 1
                },
                {
                    "sent": "So if we.",
                    "label": 0
                },
                {
                    "sent": "Have this historical data then.",
                    "label": 0
                },
                {
                    "sent": "Try to do this if I.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Typing this picture so we have like.",
                    "label": 0
                },
                {
                    "sent": "Some people going the same piece of route and then all of a sudden we have this Forks.",
                    "label": 0
                },
                {
                    "sent": "So two groups are going here.",
                    "label": 0
                },
                {
                    "sent": "Maybe one is going here.",
                    "label": 0
                },
                {
                    "sent": "So what is the cause that govern this?",
                    "label": 0
                },
                {
                    "sent": "Somebody goes here and the other.",
                    "label": 0
                },
                {
                    "sent": "Group of people goes here.",
                    "label": 0
                },
                {
                    "sent": "So in able to do that, in order to do that, we have to generate sorry some features.",
                    "label": 0
                },
                {
                    "sent": "From our data.",
                    "label": 0
                },
                {
                    "sent": "So basically we have data about longitude, latitude and times and from the spatial data, longitude and latitude.",
                    "label": 0
                },
                {
                    "sent": "What we can do is we can generate some kind of regions and from time data we can generate like day of week, time of day or certain other stuff.",
                    "label": 0
                },
                {
                    "sent": "So then it becomes a graph problem.",
                    "label": 0
                },
                {
                    "sent": "So before tackling the original problem that is still ongoing work, we try to.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Simplify this and justice.",
                    "label": 0
                },
                {
                    "sent": "Limit our data to the to the region of Slovenia so like this.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Wietecha longitude and latitude the.",
                    "label": 0
                },
                {
                    "sent": "Rectangle and say OK, we will take just those paths and state points that are all inside this rectangle.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In this way, we ended up with a little bit more than 110,000.",
                    "label": 0
                },
                {
                    "sent": "The so-called activities, before they are around 200,000 and out from all those four.",
                    "label": 0
                },
                {
                    "sent": "432 users just 227 were the ones that were moving just inside Slovenia and OK.",
                    "label": 0
                },
                {
                    "sent": "This was the constraint on the on this rectangle of longitudes and latitudes.",
                    "label": 0
                },
                {
                    "sent": "And we say, OK, let's see what are the 20 most frequent locations that people were visiting.",
                    "label": 1
                },
                {
                    "sent": "Can generate all these additional features like time of the day is the weekend or not the region.",
                    "label": 0
                },
                {
                    "sent": "So is Gordon's courage and Lubiana and other six like in total 6 regions.",
                    "label": 0
                },
                {
                    "sent": "And then we say, OK, we will just try to.",
                    "label": 0
                },
                {
                    "sent": "Categorise if somebody is coming to some location going out from that location or stay in that location, are there this?",
                    "label": 0
                },
                {
                    "sent": "Are there features such that can distinguish between people coming summer going out of summer or staying there?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is the.",
                    "label": 0
                },
                {
                    "sent": "Somehow?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pre process data.",
                    "label": 0
                },
                {
                    "sent": "20 most frequent locations are depicted in these pictures, mostly in the center.",
                    "label": 0
                },
                {
                    "sent": "Some is a little bit out and one is here.",
                    "label": 0
                },
                {
                    "sent": "So if we forget these two, then we get.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like a.",
                    "label": 0
                },
                {
                    "sent": "This 18 are all around here around the Institute and the most frequent, of course, is jsi.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is for example where people went from or two jsi first inside, so this is just from and out of the most frequently.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Creation.",
                    "label": 0
                },
                {
                    "sent": "Then for the first experiment, we could do this for all the 20 most frequent locations, but we did it like for the most frequent.",
                    "label": 0
                },
                {
                    "sent": "So for jsi.",
                    "label": 0
                },
                {
                    "sent": "We take just those parts that end it or started from GSI or just were inside like a state point and our number of examples dropped to 17,000 and something.",
                    "label": 0
                },
                {
                    "sent": "And this is pretty much a balanced data set because around 7000 went out 5000.",
                    "label": 0
                },
                {
                    "sent": "Something stayed and 5000 and something going in.",
                    "label": 0
                },
                {
                    "sent": "So now we have a well defined classification problem that supervised learning because we have a. Discrete class we just used like Vecna and try some classical algorithms.",
                    "label": 0
                },
                {
                    "sent": "Do this experiment with temporal cross validation like one time, so classification accuracy.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we got the following results.",
                    "label": 0
                },
                {
                    "sent": "So if we observe.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The numbers here we would see that out is our majority class.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And roughly 40% of all the.",
                    "label": 0
                },
                {
                    "sent": "Examples were out, but if we apply the algorithms and I think as the M here yes performed the best I think don't have all the results.",
                    "label": 0
                },
                {
                    "sent": "Table and results are around 70%.",
                    "label": 0
                },
                {
                    "sent": "So is this good or not?",
                    "label": 0
                },
                {
                    "sent": "We don't know because we didn't perform the statistical testing, but it turns out that.",
                    "label": 0
                },
                {
                    "sent": "Some pretty obvious rules were discovered, so saying in the morning people are coming to work later, they are going to lunch, so going out and coming in again.",
                    "label": 1
                },
                {
                    "sent": "This one has been discovered, so quite some people were moving from GSI to the place of the where the startup companies are, so they're at the post.",
                    "label": 0
                },
                {
                    "sent": "No, actually not, not, at least.",
                    "label": 0
                },
                {
                    "sent": "So yeah, and I will talk.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Degreased would be.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I agree it would probably be one of the other locations here.",
                    "label": 0
                },
                {
                    "sent": "I will talk about this later because you can see here.",
                    "label": 0
                },
                {
                    "sent": "There is a grid of location and this is due to the fact that we discretize the longitude and latitude to two decimal places.",
                    "label": 0
                },
                {
                    "sent": "That proved to be not a good move because we lost some accuracy and.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We got this nasty greed effect OK.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what were the findings already listed?",
                    "label": 0
                },
                {
                    "sent": "So that was one of the finding as well surrounding this logic related to data was not really the best way of going.",
                    "label": 1
                },
                {
                    "sent": "So now already we're already doing so.",
                    "label": 0
                },
                {
                    "sent": "Further research on using the similar approach like like the guys in the paper when defining state points were using.",
                    "label": 0
                },
                {
                    "sent": "So if this points are in a radius of 150 meters, so maybe then it's the same.",
                    "label": 0
                },
                {
                    "sent": "Point also including time.",
                    "label": 0
                },
                {
                    "sent": "So what was the other thing with it, and?",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is if we look at this picture here.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "So we really simplified and we just took the 1st and the last.",
                    "label": 0
                },
                {
                    "sent": "A coordinate of a path and somehow disregarded everything that is in between so.",
                    "label": 0
                },
                {
                    "sent": "This is why we got just this like well known.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Results run on rules.",
                    "label": 0
                },
                {
                    "sent": "So now next step is to take all and to see and to try to match this subpaths and really identify what are the causes of these Forks.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So conclusion.",
                    "label": 0
                },
                {
                    "sent": "Some rules were detected, but all those.",
                    "label": 1
                },
                {
                    "sent": "Predicted like somehow obvious behavior that we already knew.",
                    "label": 0
                },
                {
                    "sent": "Maybe that proves that the algorithm work, but we need further research to see what are really the causality behind this.",
                    "label": 0
                },
                {
                    "sent": "People moving around so longer routes will be needed for that.",
                    "label": 0
                },
                {
                    "sent": "So taking all the points in between all the 30 interval points and so.",
                    "label": 0
                },
                {
                    "sent": "Yeah, basically that's it.",
                    "label": 0
                },
                {
                    "sent": "Yes, I tried.",
                    "label": 0
                },
                {
                    "sent": "There are some results but I have to find you on a little bit so by the end of the month I should have some more promising results.",
                    "label": 0
                },
                {
                    "sent": "So that would be the goal.",
                    "label": 0
                },
                {
                    "sent": "So what we need to report explaining explain this for explain this fork and the inclusion of the guys from LP.",
                    "label": 0
                },
                {
                    "sent": "They will try to look at the graph properties of the of this network, so maybe some other centrality measures will be.",
                    "label": 0
                },
                {
                    "sent": "I don't.",
                    "label": 0
                },
                {
                    "sent": "No, but yeah.",
                    "label": 0
                },
                {
                    "sent": "This is also that was, that's why we try to work with them there.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, we generated like 10 or something.",
                    "label": 0
                },
                {
                    "sent": "Features most of them tide to the time, but because the space is just the region because you cannot do much more with space, you have longitude, latitude.",
                    "label": 0
                },
                {
                    "sent": "You can define the regions somehow.",
                    "label": 0
                },
                {
                    "sent": "Ad hoc.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}