{
    "id": "buecccb4j7nk44yq53ach675jce43afv",
    "title": "How can public services benefit from the CEF.AT platform",
    "info": {
        "author": [
            "Spyridon Pilos, Directorate-General for Translation, European Commission"
        ],
        "published": "Dec. 20, 2015",
        "recorded": "December 2015",
        "category": [
            "Top->Computer Science->Natural Language Processing",
            "Top->Humanities->Linguistics"
        ]
    },
    "url": "http://videolectures.net/elrc2015_pilos_public_services/",
    "segmentation": [
        [
            "So thank you for this invitation to present the way that public services can benefit from machine translation services.",
            "Within the context of the platform, the 80 platform."
        ],
        [
            "And I'm going to talk about multilingualism and machine translation.",
            "Tell you what you can do already now that is that you can use NTSC.",
            "Public administrations can use MTC and see what would be.",
            "The difference is that you will see with the the new platform."
        ],
        [
            "So in principle you know that for that we need to communicate.",
            "You know the 24 official EU languages, but the interactions are between actors within the Member States.",
            "We do not demonstrations across Member States, the blue lines, and that you see on there on this graph and also between the EU and the national administrations.",
            "So."
        ],
        [
            "The vision I would say is of multilingual Europe is to have a monolingual user experience.",
            "That is, the vision is to have a person who can use a public service in any Member States from any place in the in Europe in the world.",
            "And obtain the information in his or her mother tongue.",
            "So it's really making everything monolingual practically.",
            "Machines."
        ],
        [
            "Relation is I mean, as far as we know the only viable solution to provide quick and cheap access to information in the foreign languages to help people understand information they receive in a foreign language that otherwise they they would not be able to use the information or would require to spend a lot of time and money to have it translated and also to make a multilingual use of the websites more advanced uses of machine translation are.",
            "To support cross lingual information, search and.",
            "Format data, analytics, information mining, etc across languages.",
            "That's why we consider that machine translation is a critically important technology for multilingual Europe."
        ],
        [
            "No, we can say that machine translation users are can be split at the top level.",
            "Let's say two categories.",
            "Those who understand the source language.",
            "And those who started those who do not understand the source language and those who understand both the source and the target language.",
            "So those who do not understand the source language do not have any other.",
            "Option for understanding incoming information that is not in the source that isn't the source language, then machine translation and they can do it quickly to just understand what it is about and decide on the relevance of the information and the subsequent routing.",
            "So if you get a document and you can save time not only by.",
            "Save time at the moment of deciding whether you need the information that is included in the document and deciding whether you can send it for human translation for validation, etc becausw.",
            "You cannot really use machine translation at this stage.",
            "I mean of development of technology with full confidence that what you read is correct.",
            "So that's why you always need for something which is required for text for information that is required to get important decisions, you need people who understand both languages and this can be professional translators who can will use them machine translation as input for providing high quality translation, but.",
            "Machine translation can be used also within.",
            "For example working groups, International working groups where you get in formation in a language in even in in French for example, and you want to launch a national consultation on a subject there you use machine translation.",
            "The expert who speaks both languages since he participate or she participates in the group.",
            "Can get the machine translation do what we call post editing that is correct.",
            "Some in accuracies that may exist.",
            "Terms, endings and such things and forward this to the national level so that the consultation at the national level to his national counterparts so that the consultation at the national level can be carried out in the national language.",
            "But in any case, to take decisions or to publish information that is important for the elements of an institution or of.",
            "Let's say you will always need to go through validation, preferably by professional translators.",
            "No."
        ],
        [
            "NPC which stands for my machine machine translation at the European Commission is already there for you.",
            "The first version was released in June 2013.",
            "All directions between all 24 EU official languages are available.",
            "The technology used this statistical machine translation.",
            "In fact, it's the open source software called Moses, which was Co founded by EU framework programs.",
            "And the development was done over three years with funding by.",
            "There is a program which is a program targeted to supporting interoperability between public administrations, so the service bears the name machine translation at the European Commission, but it has been built for all public administrations.",
            "Hey."
        ],
        [
            "The service as it stands now, it has a web interface where people can connect and submit a request for machine translation and it has the possibility of through APIs through web services to connect to have information system connecting to it and using it machine to machine connections, some special features and unique I would say is that the user interface is available in all 24 languages and user interface, meaning also all the instructions on there.",
            "Explanations on how to use it, etc.",
            "The source document format and the FORMATIC are maintained.",
            "That is, both Doc Excel PowerPoint format, but also the bold italics in the document are maintained to the extent that this is possible.",
            "There are specific output formats for translation, TMX and X Live.",
            "You can receive the translation to your email because you are when you are registered, you give your email.",
            "You can translate multiple documents to multiple languages well, and there is also an indication on our side of quality of the language.",
            "Pairs using an automated metric, an automatic metric called blur and there is you have the possibility to give us feedback.",
            "Uh, through a link that you received together with the translation."
        ],
        [
            "One of the key features of this key aspects of this service is security.",
            "The hosting is in the European Commission data Center.",
            "Access is given through the European Commission Authentication Service and there is the possibility to use it securely, either over a very secure private network, which is called S. Testa and.",
            "I have several administrations across Europe.",
            "Para have this installed and this network is completely separate from the Internet or you can use it over there as well over the Internet through a secure HTTPS connection."
        ],
        [
            "Now once you connect, this is what you get in slowing in.",
            "It's a very simple interface.",
            "We could just drag and drop, select the document that you want, translate you, select the language social language, the target language and how you want to receive the result."
        ],
        [
            "This is for documents and for text is even simpler interface with which we have all been used when using free online machine translation services where you have on one side the box to type your text or copy and paste your text and on the other you have the the output.",
            "You may notice there are some boxes at the bottom which says would say I don't.",
            "I don't want to receive it by email or I wanted the document to be deleted immediately after it is downloaded or delivered.",
            "This is because it's too include increased security.",
            "Of course, if you have secure hosting and then you send the output by email, some people do not consider this.",
            "Secure, and it's not really secure, so you may say that it's confidential document that don't want to receive it by email, and also, although we delete all documents within 24 hours, no document stage on the system over 24 hours.",
            "People said that we would like to delete it immediately after we download so.",
            "Those who use."
        ],
        [
            "System today are European Institution bodies Commission, Parliament Council, the courts, the committees and the banks.",
            "The European banks, I mean European level banks and some online services funded or supported by the UN public administrations in the EU and EEA members countries."
        ],
        [
            "McCarron area.",
            "So we said that then get.",
            "This is a statistical machine translation and it's built on statistical means that it learns from the data as you have seen in the previous presentation.",
            "What are these?",
            "Where do this EU data come from?",
            "They come from the translation.",
            "Department of all EU institutions.",
            "Because we work together and digit is the Commission is managing all the data for all institutions in a shared manner.",
            "So you see the figures there.",
            "We have almost 407 hundred 4700 translators working in all institutions and those people produce everyday translation switch.",
            "Go to Europe is it's our central translation memory at the end of 2014 it had.",
            "725 million sentences growing at 2.6 million per month and they check today the figures.",
            "In fact today it's 900 and 930 million segments today.",
            "Of course, not all languages covers the same volumes.",
            "The Slovenian has around 30 million 31 million segments.",
            "But this is more or less the same as other languages, with the exception of English, French and German.",
            "Now all these documents are about a few subjects and use a new language and that way we can call them kind of EU specific.",
            "An engine's OK. Hey."
        ],
        [
            "No, you can have if you work in a public administration in value, you can have free access to MPC by just getting an individual access username and password and you can see there the link.",
            "Do where you can register.",
            "If you do not already have one and then send us an email asking us to activate the service.",
            "You have to do your registration with your work email, not with personal emails.",
            "And I mean, once we receive the request at this function mailbox digity.",
            "Be there.",
            "I mean we will activate your access and inform you by email and you can start using it.",
            "I meant."
        ],
        [
            "There are online services connected to India DC and this include the internal market Information System which is an intranet for more than 7000 public administrations in the EU Member state solve it and Lex, which is the common gateway to national law, operated by the publication's office as well as circa BC, which is there an intranet that people in the room may know about since it's used by different working groups and which are of the Council different.",
            "Which are called interest groups practically.",
            "So there you can use already empty at the scene.",
            "But each one of."
        ],
        [
            "These services may hide another group of domains.",
            "For example, I am I is 1 platform but but you can use it for 16 different policy areas which are called modules and there's still another eight in the pipeline.",
            "So maybe if you work in one of these areas you can already use empty at DC directly, but also through an online service like like I am I.",
            "And this these services include professional recognition of professional qualifications.",
            "Posting of workers, business registers, etc."
        ],
        [
            "Now what next?",
            "We go from empty at the seat of their safe platform.",
            "And to do this.",
            "We're going to build on the existing empty at this service, but we're not going to be limited to it.",
            "That is to offer machine translation services.",
            "We may acquire other solutions, new technologies, etc, and that that serve better.",
            "Certain groups of languages or certain domains.",
            "And we're going to put emphasis on secure quality and customizable empty for the pan European online services.",
            "The digital service infrastructures that are funded by cell phone which you have been informed in earlier in an earlier speed.",
            "But we would not be limited to them, in fact.",
            "Customers will include any also public administrations at they you level and in the different Member States as well as public services.",
            "Public online services that I mean, I have an interest for cross border cooperation.",
            "But at this stage everything is limited to public services.",
            "And also Safady would not be just machine translation, it will be an multilingualism enabler.",
            "So benefiting from different language technologies to offer better automation of.",
            "Of a language on the web.",
            "And."
        ],
        [
            "When we talk about customization of online services, we practically talk about mean that we were going to offer specific output for different domains, to which correspond the digital service infrastructure subset.",
            "So the 1st six infrastructure that for which we will be working at arabana, the European Digital Library, ODP the pan European Open Data portal.",
            "Would Sir is the EU platform for sharing Member State open data essentially and EU open data, but the main target Member States open data.",
            "The electronics extend system of Social Security information there online dispute resolution platform where the idea is that there is out of court resolution of contractual disputes between consumers and traders.",
            "The injustice portal, the one stop shop for European law and judicial cooperation and Safer Internet activity that is meant to support.",
            "This that drafted the use of the Internet by children and young people."
        ],
        [
            "No.",
            "As I mentioned before, Safady will bring faster and more secure translation.",
            "So if you start using empty ATC and you consider it's not fast enough.",
            "I mean wait for self aid, it will become faster.",
            "In any case, we're trying to improve continuously but safe 84 separate each one of the of the objectives to make it fast.",
            "Then we will have more pan European public online services offering machine translation, but all this would be adapted to the needs of their users.",
            "While right now we just, you just get the the standard.",
            "I would say service.",
            "And.",
            "We will improve quality translation in general and have translation for specific domains specific needs.",
            "Of course, starting with the domains relevant for the Safe Digital service infrastructures and starting with the 1st six that I mentioned before.",
            "And this is where more and better data are needed for all languages and for as many domains as possible.",
            "And This is why we have this activity.",
            "the European Language resource coordination that organizes the meeting you're attending today.",
            "A."
        ],
        [
            "Objectives we have now the EU engines.",
            "They are built on EU translations.",
            "They cover all 24 language.",
            "The date that we have your amiss cover sold 24 languages but we have different volumes so we need more data for the languages for which we do not have enough.",
            "And also you Ramesh and MDC recover EU policies.",
            "Of course they your policy is across domains, but the language is official.",
            "The terminology is the terminology that's used in EU cooperation.",
            "So everyday language is not used.",
            "I give the example usually of I love you.",
            "If you send it to our MTS system it will not give anything.",
            "OK this does not mean it's stupid.",
            "It means that it has grown up that the child has grown up in the protected official invalid environment.",
            "And then empty seat covers many domains, but we cannot at this stage.",
            "We're not focusing on any one of them, and to do this we need more in domain data.",
            "And that's again.",
            "The the language is short coordination action.",
            "So.",
            "A 27."
        ],
        [
            "I would say that for those of you who come from public administrations, you can try already and see what empty at the scene can offer you by sending by registering and sending us a request to connect to the system.",
            "And you can start looking into finding data that can be relevant for your specific domain specific that is of interest for you and the language resource Coordination action is there to help you.",
            "Deliver this data so that we can have a better service for everybody.",
            "Thank you.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So thank you for this invitation to present the way that public services can benefit from machine translation services.",
                    "label": 0
                },
                {
                    "sent": "Within the context of the platform, the 80 platform.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I'm going to talk about multilingualism and machine translation.",
                    "label": 1
                },
                {
                    "sent": "Tell you what you can do already now that is that you can use NTSC.",
                    "label": 0
                },
                {
                    "sent": "Public administrations can use MTC and see what would be.",
                    "label": 0
                },
                {
                    "sent": "The difference is that you will see with the the new platform.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in principle you know that for that we need to communicate.",
                    "label": 0
                },
                {
                    "sent": "You know the 24 official EU languages, but the interactions are between actors within the Member States.",
                    "label": 1
                },
                {
                    "sent": "We do not demonstrations across Member States, the blue lines, and that you see on there on this graph and also between the EU and the national administrations.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The vision I would say is of multilingual Europe is to have a monolingual user experience.",
                    "label": 0
                },
                {
                    "sent": "That is, the vision is to have a person who can use a public service in any Member States from any place in the in Europe in the world.",
                    "label": 1
                },
                {
                    "sent": "And obtain the information in his or her mother tongue.",
                    "label": 1
                },
                {
                    "sent": "So it's really making everything monolingual practically.",
                    "label": 0
                },
                {
                    "sent": "Machines.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Relation is I mean, as far as we know the only viable solution to provide quick and cheap access to information in the foreign languages to help people understand information they receive in a foreign language that otherwise they they would not be able to use the information or would require to spend a lot of time and money to have it translated and also to make a multilingual use of the websites more advanced uses of machine translation are.",
                    "label": 1
                },
                {
                    "sent": "To support cross lingual information, search and.",
                    "label": 0
                },
                {
                    "sent": "Format data, analytics, information mining, etc across languages.",
                    "label": 1
                },
                {
                    "sent": "That's why we consider that machine translation is a critically important technology for multilingual Europe.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No, we can say that machine translation users are can be split at the top level.",
                    "label": 0
                },
                {
                    "sent": "Let's say two categories.",
                    "label": 0
                },
                {
                    "sent": "Those who understand the source language.",
                    "label": 0
                },
                {
                    "sent": "And those who started those who do not understand the source language and those who understand both the source and the target language.",
                    "label": 1
                },
                {
                    "sent": "So those who do not understand the source language do not have any other.",
                    "label": 0
                },
                {
                    "sent": "Option for understanding incoming information that is not in the source that isn't the source language, then machine translation and they can do it quickly to just understand what it is about and decide on the relevance of the information and the subsequent routing.",
                    "label": 0
                },
                {
                    "sent": "So if you get a document and you can save time not only by.",
                    "label": 0
                },
                {
                    "sent": "Save time at the moment of deciding whether you need the information that is included in the document and deciding whether you can send it for human translation for validation, etc becausw.",
                    "label": 0
                },
                {
                    "sent": "You cannot really use machine translation at this stage.",
                    "label": 0
                },
                {
                    "sent": "I mean of development of technology with full confidence that what you read is correct.",
                    "label": 0
                },
                {
                    "sent": "So that's why you always need for something which is required for text for information that is required to get important decisions, you need people who understand both languages and this can be professional translators who can will use them machine translation as input for providing high quality translation, but.",
                    "label": 1
                },
                {
                    "sent": "Machine translation can be used also within.",
                    "label": 0
                },
                {
                    "sent": "For example working groups, International working groups where you get in formation in a language in even in in French for example, and you want to launch a national consultation on a subject there you use machine translation.",
                    "label": 0
                },
                {
                    "sent": "The expert who speaks both languages since he participate or she participates in the group.",
                    "label": 0
                },
                {
                    "sent": "Can get the machine translation do what we call post editing that is correct.",
                    "label": 0
                },
                {
                    "sent": "Some in accuracies that may exist.",
                    "label": 0
                },
                {
                    "sent": "Terms, endings and such things and forward this to the national level so that the consultation at the national level to his national counterparts so that the consultation at the national level can be carried out in the national language.",
                    "label": 0
                },
                {
                    "sent": "But in any case, to take decisions or to publish information that is important for the elements of an institution or of.",
                    "label": 0
                },
                {
                    "sent": "Let's say you will always need to go through validation, preferably by professional translators.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "NPC which stands for my machine machine translation at the European Commission is already there for you.",
                    "label": 0
                },
                {
                    "sent": "The first version was released in June 2013.",
                    "label": 0
                },
                {
                    "sent": "All directions between all 24 EU official languages are available.",
                    "label": 1
                },
                {
                    "sent": "The technology used this statistical machine translation.",
                    "label": 0
                },
                {
                    "sent": "In fact, it's the open source software called Moses, which was Co founded by EU framework programs.",
                    "label": 0
                },
                {
                    "sent": "And the development was done over three years with funding by.",
                    "label": 0
                },
                {
                    "sent": "There is a program which is a program targeted to supporting interoperability between public administrations, so the service bears the name machine translation at the European Commission, but it has been built for all public administrations.",
                    "label": 0
                },
                {
                    "sent": "Hey.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The service as it stands now, it has a web interface where people can connect and submit a request for machine translation and it has the possibility of through APIs through web services to connect to have information system connecting to it and using it machine to machine connections, some special features and unique I would say is that the user interface is available in all 24 languages and user interface, meaning also all the instructions on there.",
                    "label": 0
                },
                {
                    "sent": "Explanations on how to use it, etc.",
                    "label": 0
                },
                {
                    "sent": "The source document format and the FORMATIC are maintained.",
                    "label": 0
                },
                {
                    "sent": "That is, both Doc Excel PowerPoint format, but also the bold italics in the document are maintained to the extent that this is possible.",
                    "label": 0
                },
                {
                    "sent": "There are specific output formats for translation, TMX and X Live.",
                    "label": 1
                },
                {
                    "sent": "You can receive the translation to your email because you are when you are registered, you give your email.",
                    "label": 0
                },
                {
                    "sent": "You can translate multiple documents to multiple languages well, and there is also an indication on our side of quality of the language.",
                    "label": 1
                },
                {
                    "sent": "Pairs using an automated metric, an automatic metric called blur and there is you have the possibility to give us feedback.",
                    "label": 0
                },
                {
                    "sent": "Uh, through a link that you received together with the translation.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One of the key features of this key aspects of this service is security.",
                    "label": 0
                },
                {
                    "sent": "The hosting is in the European Commission data Center.",
                    "label": 0
                },
                {
                    "sent": "Access is given through the European Commission Authentication Service and there is the possibility to use it securely, either over a very secure private network, which is called S. Testa and.",
                    "label": 0
                },
                {
                    "sent": "I have several administrations across Europe.",
                    "label": 0
                },
                {
                    "sent": "Para have this installed and this network is completely separate from the Internet or you can use it over there as well over the Internet through a secure HTTPS connection.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now once you connect, this is what you get in slowing in.",
                    "label": 0
                },
                {
                    "sent": "It's a very simple interface.",
                    "label": 0
                },
                {
                    "sent": "We could just drag and drop, select the document that you want, translate you, select the language social language, the target language and how you want to receive the result.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is for documents and for text is even simpler interface with which we have all been used when using free online machine translation services where you have on one side the box to type your text or copy and paste your text and on the other you have the the output.",
                    "label": 0
                },
                {
                    "sent": "You may notice there are some boxes at the bottom which says would say I don't.",
                    "label": 0
                },
                {
                    "sent": "I don't want to receive it by email or I wanted the document to be deleted immediately after it is downloaded or delivered.",
                    "label": 0
                },
                {
                    "sent": "This is because it's too include increased security.",
                    "label": 0
                },
                {
                    "sent": "Of course, if you have secure hosting and then you send the output by email, some people do not consider this.",
                    "label": 0
                },
                {
                    "sent": "Secure, and it's not really secure, so you may say that it's confidential document that don't want to receive it by email, and also, although we delete all documents within 24 hours, no document stage on the system over 24 hours.",
                    "label": 0
                },
                {
                    "sent": "People said that we would like to delete it immediately after we download so.",
                    "label": 0
                },
                {
                    "sent": "Those who use.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "System today are European Institution bodies Commission, Parliament Council, the courts, the committees and the banks.",
                    "label": 0
                },
                {
                    "sent": "The European banks, I mean European level banks and some online services funded or supported by the UN public administrations in the EU and EEA members countries.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "McCarron area.",
                    "label": 0
                },
                {
                    "sent": "So we said that then get.",
                    "label": 0
                },
                {
                    "sent": "This is a statistical machine translation and it's built on statistical means that it learns from the data as you have seen in the previous presentation.",
                    "label": 0
                },
                {
                    "sent": "What are these?",
                    "label": 0
                },
                {
                    "sent": "Where do this EU data come from?",
                    "label": 0
                },
                {
                    "sent": "They come from the translation.",
                    "label": 0
                },
                {
                    "sent": "Department of all EU institutions.",
                    "label": 0
                },
                {
                    "sent": "Because we work together and digit is the Commission is managing all the data for all institutions in a shared manner.",
                    "label": 0
                },
                {
                    "sent": "So you see the figures there.",
                    "label": 0
                },
                {
                    "sent": "We have almost 407 hundred 4700 translators working in all institutions and those people produce everyday translation switch.",
                    "label": 0
                },
                {
                    "sent": "Go to Europe is it's our central translation memory at the end of 2014 it had.",
                    "label": 0
                },
                {
                    "sent": "725 million sentences growing at 2.6 million per month and they check today the figures.",
                    "label": 1
                },
                {
                    "sent": "In fact today it's 900 and 930 million segments today.",
                    "label": 0
                },
                {
                    "sent": "Of course, not all languages covers the same volumes.",
                    "label": 0
                },
                {
                    "sent": "The Slovenian has around 30 million 31 million segments.",
                    "label": 0
                },
                {
                    "sent": "But this is more or less the same as other languages, with the exception of English, French and German.",
                    "label": 0
                },
                {
                    "sent": "Now all these documents are about a few subjects and use a new language and that way we can call them kind of EU specific.",
                    "label": 0
                },
                {
                    "sent": "An engine's OK. Hey.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No, you can have if you work in a public administration in value, you can have free access to MPC by just getting an individual access username and password and you can see there the link.",
                    "label": 0
                },
                {
                    "sent": "Do where you can register.",
                    "label": 0
                },
                {
                    "sent": "If you do not already have one and then send us an email asking us to activate the service.",
                    "label": 0
                },
                {
                    "sent": "You have to do your registration with your work email, not with personal emails.",
                    "label": 1
                },
                {
                    "sent": "And I mean, once we receive the request at this function mailbox digity.",
                    "label": 0
                },
                {
                    "sent": "Be there.",
                    "label": 0
                },
                {
                    "sent": "I mean we will activate your access and inform you by email and you can start using it.",
                    "label": 1
                },
                {
                    "sent": "I meant.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are online services connected to India DC and this include the internal market Information System which is an intranet for more than 7000 public administrations in the EU Member state solve it and Lex, which is the common gateway to national law, operated by the publication's office as well as circa BC, which is there an intranet that people in the room may know about since it's used by different working groups and which are of the Council different.",
                    "label": 1
                },
                {
                    "sent": "Which are called interest groups practically.",
                    "label": 0
                },
                {
                    "sent": "So there you can use already empty at the scene.",
                    "label": 0
                },
                {
                    "sent": "But each one of.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "These services may hide another group of domains.",
                    "label": 0
                },
                {
                    "sent": "For example, I am I is 1 platform but but you can use it for 16 different policy areas which are called modules and there's still another eight in the pipeline.",
                    "label": 1
                },
                {
                    "sent": "So maybe if you work in one of these areas you can already use empty at DC directly, but also through an online service like like I am I.",
                    "label": 1
                },
                {
                    "sent": "And this these services include professional recognition of professional qualifications.",
                    "label": 0
                },
                {
                    "sent": "Posting of workers, business registers, etc.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now what next?",
                    "label": 0
                },
                {
                    "sent": "We go from empty at the seat of their safe platform.",
                    "label": 0
                },
                {
                    "sent": "And to do this.",
                    "label": 0
                },
                {
                    "sent": "We're going to build on the existing empty at this service, but we're not going to be limited to it.",
                    "label": 1
                },
                {
                    "sent": "That is to offer machine translation services.",
                    "label": 0
                },
                {
                    "sent": "We may acquire other solutions, new technologies, etc, and that that serve better.",
                    "label": 0
                },
                {
                    "sent": "Certain groups of languages or certain domains.",
                    "label": 1
                },
                {
                    "sent": "And we're going to put emphasis on secure quality and customizable empty for the pan European online services.",
                    "label": 0
                },
                {
                    "sent": "The digital service infrastructures that are funded by cell phone which you have been informed in earlier in an earlier speed.",
                    "label": 1
                },
                {
                    "sent": "But we would not be limited to them, in fact.",
                    "label": 0
                },
                {
                    "sent": "Customers will include any also public administrations at they you level and in the different Member States as well as public services.",
                    "label": 0
                },
                {
                    "sent": "Public online services that I mean, I have an interest for cross border cooperation.",
                    "label": 0
                },
                {
                    "sent": "But at this stage everything is limited to public services.",
                    "label": 0
                },
                {
                    "sent": "And also Safady would not be just machine translation, it will be an multilingualism enabler.",
                    "label": 0
                },
                {
                    "sent": "So benefiting from different language technologies to offer better automation of.",
                    "label": 0
                },
                {
                    "sent": "Of a language on the web.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "When we talk about customization of online services, we practically talk about mean that we were going to offer specific output for different domains, to which correspond the digital service infrastructure subset.",
                    "label": 0
                },
                {
                    "sent": "So the 1st six infrastructure that for which we will be working at arabana, the European Digital Library, ODP the pan European Open Data portal.",
                    "label": 0
                },
                {
                    "sent": "Would Sir is the EU platform for sharing Member State open data essentially and EU open data, but the main target Member States open data.",
                    "label": 0
                },
                {
                    "sent": "The electronics extend system of Social Security information there online dispute resolution platform where the idea is that there is out of court resolution of contractual disputes between consumers and traders.",
                    "label": 1
                },
                {
                    "sent": "The injustice portal, the one stop shop for European law and judicial cooperation and Safer Internet activity that is meant to support.",
                    "label": 0
                },
                {
                    "sent": "This that drafted the use of the Internet by children and young people.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned before, Safady will bring faster and more secure translation.",
                    "label": 1
                },
                {
                    "sent": "So if you start using empty ATC and you consider it's not fast enough.",
                    "label": 0
                },
                {
                    "sent": "I mean wait for self aid, it will become faster.",
                    "label": 0
                },
                {
                    "sent": "In any case, we're trying to improve continuously but safe 84 separate each one of the of the objectives to make it fast.",
                    "label": 0
                },
                {
                    "sent": "Then we will have more pan European public online services offering machine translation, but all this would be adapted to the needs of their users.",
                    "label": 1
                },
                {
                    "sent": "While right now we just, you just get the the standard.",
                    "label": 0
                },
                {
                    "sent": "I would say service.",
                    "label": 1
                },
                {
                    "sent": "And.",
                    "label": 1
                },
                {
                    "sent": "We will improve quality translation in general and have translation for specific domains specific needs.",
                    "label": 0
                },
                {
                    "sent": "Of course, starting with the domains relevant for the Safe Digital service infrastructures and starting with the 1st six that I mentioned before.",
                    "label": 1
                },
                {
                    "sent": "And this is where more and better data are needed for all languages and for as many domains as possible.",
                    "label": 0
                },
                {
                    "sent": "And This is why we have this activity.",
                    "label": 0
                },
                {
                    "sent": "the European Language resource coordination that organizes the meeting you're attending today.",
                    "label": 0
                },
                {
                    "sent": "A.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Objectives we have now the EU engines.",
                    "label": 0
                },
                {
                    "sent": "They are built on EU translations.",
                    "label": 1
                },
                {
                    "sent": "They cover all 24 language.",
                    "label": 0
                },
                {
                    "sent": "The date that we have your amiss cover sold 24 languages but we have different volumes so we need more data for the languages for which we do not have enough.",
                    "label": 0
                },
                {
                    "sent": "And also you Ramesh and MDC recover EU policies.",
                    "label": 0
                },
                {
                    "sent": "Of course they your policy is across domains, but the language is official.",
                    "label": 0
                },
                {
                    "sent": "The terminology is the terminology that's used in EU cooperation.",
                    "label": 0
                },
                {
                    "sent": "So everyday language is not used.",
                    "label": 0
                },
                {
                    "sent": "I give the example usually of I love you.",
                    "label": 0
                },
                {
                    "sent": "If you send it to our MTS system it will not give anything.",
                    "label": 0
                },
                {
                    "sent": "OK this does not mean it's stupid.",
                    "label": 0
                },
                {
                    "sent": "It means that it has grown up that the child has grown up in the protected official invalid environment.",
                    "label": 0
                },
                {
                    "sent": "And then empty seat covers many domains, but we cannot at this stage.",
                    "label": 0
                },
                {
                    "sent": "We're not focusing on any one of them, and to do this we need more in domain data.",
                    "label": 1
                },
                {
                    "sent": "And that's again.",
                    "label": 0
                },
                {
                    "sent": "The the language is short coordination action.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "A 27.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would say that for those of you who come from public administrations, you can try already and see what empty at the scene can offer you by sending by registering and sending us a request to connect to the system.",
                    "label": 0
                },
                {
                    "sent": "And you can start looking into finding data that can be relevant for your specific domain specific that is of interest for you and the language resource Coordination action is there to help you.",
                    "label": 0
                },
                {
                    "sent": "Deliver this data so that we can have a better service for everybody.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}