{
    "id": "bxwn5g5twr5ceokjtlzu2wulgqttj7ow",
    "title": "Unveiling Clusters of Events for Alert and Incident Management in Large-Scale Enterprise IT",
    "info": {
        "author": [
            "Derek Lin, Pivotal Software, Inc."
        ],
        "published": "Oct. 7, 2014",
        "recorded": "August 2014",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Knowledge Extraction"
        ]
    },
    "url": "http://videolectures.net/kdd2014_lin_large_scale_enterprise/",
    "segmentation": [
        [
            "Good afternoon, my name is Derek Lane.",
            "I'm from payroll."
        ],
        [
            "This paper is called embedding clusters of events for alerts and incidents management in large scale enterprise it.",
            "This work is joint worked with my colleagues at Pivotal Rashmi, Vivek Jing, Raghu and our clients on Joseph from Visa I."
        ],
        [
            "I feel like I want to give a little context behind this work, right?",
            "So I first introduced approvals so Peter is a 2 year old spinoff company from EMC.",
            "We provide platforms as a service to clients to store things you don't using Greenplum database and Hadoop infrastructure, and to help clients analyze things using data sense and also to help the clients builder application in order to allow fast, fast value cycle generations.",
            "So in this way, about two years ago, our clients Visa wanted to engage with pivotal to perform the problem that is described in this paper."
        ],
        [
            "So the primary problem is it's the following.",
            "A large enterprise networks such as visa is very complex with many different technology components and each one of them have different degree of interdependency among them.",
            "Now, to ensure the smooth operation of the network infrastructure, one of the roles of the visas reliability engineering team is to monitor all these logs coming off the devices and applications on the network and quickly respond to issues so to ensure 24/7 uptime.",
            "The problem is that the alerts are very high in volume, so the support team is typically awash in C of alerts and incidents, and because their team is very much I am glass operations, so they need a lot of support personnel to monitor all these alerts.",
            "Now, so this sort of problem naturally begs for the use of data science or machine learning to look at and to mine through the historical logs and see if we can generate species intelligence right to mine information from the data to improve operational efficiency for their reliability engineering team.",
            "And that is the core motivation for this work."
        ],
        [
            "Let me give you some some quick intro on what typical IT infrastructure and data sources look like.",
            "There are many different business services within visa, such as one for David Processing, one for fraud detection, each one of them is shared by its own or shared IT infrastructure.",
            "Technology components such as network components storage.",
            "Um?",
            "And well, component storage middleware and so on and so forth.",
            "Each one of them you know?",
            "I think they know they were installed by product vendors and they automatically generate alerts, which is typically centrally located, so all these alerts today they were collecting them with a product called IBM Netcool.",
            "That's where they store their data.",
            "This alerts are very much semi structured data, semi structured text as they are typical.",
            "Aaron only messages produced by machines.",
            "Every alerts is then examined by some first level support personnel to decide if they should be escalated further.",
            "Once the alert is escalated.",
            "Once the alert is escalated, they become incidents.",
            "Now at this time instead content free text where people were typing the nature of the others for the.",
            "For the next phase of escalation, sometime the incidents can also come from scratch.",
            "They don't have to come from alerts.",
            "People can call in and call the support folks saying that this system is done with such and such, right?",
            "So in this case the incidents are are created from scratch with pure free text.",
            "Once the alerts and once the incidents are resolved, they are stored in the you know, another place for storing the incident resolutions.",
            "So that's how we know."
        ],
        [
            "This data sources look like right?",
            "So our goal here then, is to leverage the alerts and incident data to improve the operational efficiency of the support desk.",
            "So in the past, each one of these alerts and incidences look at individually, and once they are resolved is pretty much forgotten and simply stored, and possibly only get reused only when somebody wants to a query on them later.",
            "To leverage the historical signal, the key is to cluster them.",
            "Then if we can close them.",
            "If we can cluster them instead of looking at the millions of unorganized alerts and incidents, we can then have a summarized Birds Eye view on the groups or category of data.",
            "With this kind of information we can know which clusters of alerts were incidents have the largest volume OK?",
            "Or take the most time to resolve.",
            "And later, you know this.",
            "This work, this work and also extend to additional use cases, such as when a future incidents falling into a known cluster before then, we can automatically be assigned.",
            "We can automatically recommend you know a resolution that was seen by the past and that was associated with the previous large cluster or instant cluster and similarly video prediction can also be.",
            "Can also be possible if we know the frequency sequential pattern of a cluster leading up to the failure."
        ],
        [
            "So the goal sounds very nice.",
            "The main challenges are two parts.",
            "1st part is as I mentioned earlier, data volume is very large, so we were looking at something like 10 million 10,000,000 alerts generated in the past six months of time.",
            "And then the a large data are semi structured and incident data free, structured or unstructured, possibly requiring two different kind of analytic techniques to address them.",
            "Right now.",
            "Worst of all there is no table data.",
            "So that's the biggest challenge.",
            "So as you can see in the subsequent discussion here.",
            "And a lot of the result is based on qualitative judgments in terms of now in terms of the challenges that we are facing with the analytics side of things, alerts and incidents sometimes have a very short text, no more than a few words at a time.",
            "Then, the clustering techniques that we are using also need to scale because they are because the size of the incidents is very large and finally we need to have a way of.",
            "Interpret the clusters so that we can allow no possibility of a qualitative evaluation."
        ],
        [
            "Alright, so the approach that we took go through the following order is iterative cycles.",
            "There is no, there's no pre classified labels for clustering, so we take unsupervised learning approach.",
            "Every alert is then treated as a bag of words.",
            "We have the data we go through this iteration, so we we first normalize the tokens within the alerts and incidents, remove all the high frequency stuff, high frequency or useless stop words.",
            "Then we construct distance metric.",
            "Before applying clustering, then results are visualized and make and then we make adjustments for next iteration if necessary."
        ],
        [
            "Alright, so let me talk about how we go about clustering the semi structured text alerts.",
            "The.",
            "So I'm not going to go into too much details here.",
            "All the details are spelled out in the paper, but quickly write for semi structured on alert text clustering.",
            "We first define the distance metric using simple jakarr index to measure distance between any given to alerts.",
            "And it took any alerts that have.",
            "You know they have a normalized token before we applying.",
            "Once we once we define the distance matrix given MIN finity matrix.",
            "We then we can then create the graph.",
            "We can establish an edge between any two nodes only if the distance is less than certain threshold.",
            "Once we have that graph, we can then apply connected components to break.",
            "The space in tools you know some crude partitions within each independent partition within apply graph partitioning to do the final partition clustering, so that's the basis of the work for the semi structured text alerts.",
            "As for some structure, text alerts clustering, we have also applied various other clustering techniques such as hierarchical clustering using minimax linkage.",
            "We also apply the latent space approach including LDA.",
            "But among among others, they don't work as well as the current approach found in this paper."
        ],
        [
            "So this is 1 visualization of the output cluster.",
            "In order to help the clients.",
            "You know, again, some business intelligence.",
            "All of this data in our data set for this particular application.",
            "All the alerts have one of the four tags.",
            "Either they are data based alerts were Unix always alerts or ntos alerts.",
            "For example, we process each bucket separately.",
            "So on the ground on the slide.",
            "Here you see like 4 different buckets for each bucket is being clustered into the into the small partitions.",
            "The size of the size of the bubble indicates the volume of the cluster.",
            "The intensity of the bubble indicates the number of incidents that was generated from this cluster.",
            "By showing this sort of data, the support personnels immediately understand you know which types of alerts that causing most of their headaches."
        ],
        [
            "Here's another way of showing a similar business intelligence.",
            "Here I'm showing for every others I want to show the for every incident.",
            "I'm sorry for every alert that generates the instance we we compute the average mean time to repair so that now the operational folks can see which class of alerts that traditionally have they spend most of their time with."
        ],
        [
            "Now.",
            "For operational folks to understand the nature of the errors contained in the cluster of containing the cluster, typical visualization for word clustering.",
            "An expression the word clouds.",
            "Doesn't work.",
            "The main drawback there is that there's a lack of spatial information right of the tokens in alerts.",
            "So instead we pick out the most likely word position preserved.",
            "We pick out the most likely word position, preserved token sequence to represent each cluster.",
            "In other words, we preserve the spatial positioning of the tokens in the alerts so that common words in the most common positions preserved, for example.",
            "On this slide, there are three clusters of the alerts.",
            "Each alerts is visualized by the most prominent word preserved token sequence OK.",
            "So instead of looking at the flat structures of the text in the alerts, now we can just pick out the most significant token that preserved in their positions.",
            "For the and present them to their support personnel.",
            "This this kind of representation feels like some kind of pseudo error message, much more familiar and intuitive than war clouds to operational folks."
        ],
        [
            "Alright, so I just covered clustering and visualization we did for semi structured text alerts.",
            "Now I'm just going to quickly go over the unstructured text incident data.",
            "So like before, we did define the distance metric and the rationale for that distance matrix is explained in the paper.",
            "This we have about 67,000 incidents, so it's very difficult to partition them in one go, right?",
            "So instead of so we gotta do some kind of data reduction technique there.",
            "We treat each incidents in the latent space within that in space we perform non negative negative.",
            "I mean we perform the non negative matrix factorization to find the latent representation of the of the incidents.",
            "Then we use a KD tree to do a course space partitioning.",
            "Within each partition, then we apply hierarchical clustering, such as a complete linkage criteria.",
            "Then we do a final post processing technique to merge the cluster back and then."
        ],
        [
            "Result is the following slide.",
            "Here I'm showing you the top 25.",
            "It might be hard to read, but 25 clusters accounting for 20% of all the 67 incidents incidents.",
            "OK."
        ],
        [
            "So finally I want to.",
            "Quickly share with you some of the lessons and takeaways here.",
            "The main takeaway here is that you know alerts and incident today is they are not leveraged to create values in typical large enterprise at infrastructure work such as this, introduce operational folks a new way to see what they are dealing with databases so that they can sort of steps out of the tree and see the forest right by.",
            "By seeing the structure of the alerts and incidents like this, we allow them to be able to profile classes of alerts, measuring volume and mean time to repair per class of alerts.",
            "This work also served as the foundation for Future Resolution recommendation, use case or failure prediction.",
            "Our use case.",
            "There are a few just three more lessons that we learned here.",
            "The volume of data is very large.",
            "It is impossible to run this on a single machine.",
            "This work has been done on the Greenplum database with massively parallel processing architecture even, but Even so, some algorithm innovation in this work is created to deal with the volume right.",
            "Since there is no labeled data, you need to quickly.",
            "If you need a quick qualitative feedback from the domain expert, you can only do so if you have a way of visualizing the cluster.",
            "And in this work we have enough.",
            "Finally, in this work we have not leverage any temporal information, so that that's kind of data can be used in the future for further refinement.",
            "Thank you, that's my talk."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good afternoon, my name is Derek Lane.",
                    "label": 0
                },
                {
                    "sent": "I'm from payroll.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This paper is called embedding clusters of events for alerts and incidents management in large scale enterprise it.",
                    "label": 0
                },
                {
                    "sent": "This work is joint worked with my colleagues at Pivotal Rashmi, Vivek Jing, Raghu and our clients on Joseph from Visa I.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I feel like I want to give a little context behind this work, right?",
                    "label": 0
                },
                {
                    "sent": "So I first introduced approvals so Peter is a 2 year old spinoff company from EMC.",
                    "label": 0
                },
                {
                    "sent": "We provide platforms as a service to clients to store things you don't using Greenplum database and Hadoop infrastructure, and to help clients analyze things using data sense and also to help the clients builder application in order to allow fast, fast value cycle generations.",
                    "label": 0
                },
                {
                    "sent": "So in this way, about two years ago, our clients Visa wanted to engage with pivotal to perform the problem that is described in this paper.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the primary problem is it's the following.",
                    "label": 0
                },
                {
                    "sent": "A large enterprise networks such as visa is very complex with many different technology components and each one of them have different degree of interdependency among them.",
                    "label": 1
                },
                {
                    "sent": "Now, to ensure the smooth operation of the network infrastructure, one of the roles of the visas reliability engineering team is to monitor all these logs coming off the devices and applications on the network and quickly respond to issues so to ensure 24/7 uptime.",
                    "label": 0
                },
                {
                    "sent": "The problem is that the alerts are very high in volume, so the support team is typically awash in C of alerts and incidents, and because their team is very much I am glass operations, so they need a lot of support personnel to monitor all these alerts.",
                    "label": 0
                },
                {
                    "sent": "Now, so this sort of problem naturally begs for the use of data science or machine learning to look at and to mine through the historical logs and see if we can generate species intelligence right to mine information from the data to improve operational efficiency for their reliability engineering team.",
                    "label": 1
                },
                {
                    "sent": "And that is the core motivation for this work.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let me give you some some quick intro on what typical IT infrastructure and data sources look like.",
                    "label": 1
                },
                {
                    "sent": "There are many different business services within visa, such as one for David Processing, one for fraud detection, each one of them is shared by its own or shared IT infrastructure.",
                    "label": 0
                },
                {
                    "sent": "Technology components such as network components storage.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And well, component storage middleware and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "Each one of them you know?",
                    "label": 0
                },
                {
                    "sent": "I think they know they were installed by product vendors and they automatically generate alerts, which is typically centrally located, so all these alerts today they were collecting them with a product called IBM Netcool.",
                    "label": 0
                },
                {
                    "sent": "That's where they store their data.",
                    "label": 0
                },
                {
                    "sent": "This alerts are very much semi structured data, semi structured text as they are typical.",
                    "label": 0
                },
                {
                    "sent": "Aaron only messages produced by machines.",
                    "label": 0
                },
                {
                    "sent": "Every alerts is then examined by some first level support personnel to decide if they should be escalated further.",
                    "label": 0
                },
                {
                    "sent": "Once the alert is escalated.",
                    "label": 0
                },
                {
                    "sent": "Once the alert is escalated, they become incidents.",
                    "label": 0
                },
                {
                    "sent": "Now at this time instead content free text where people were typing the nature of the others for the.",
                    "label": 0
                },
                {
                    "sent": "For the next phase of escalation, sometime the incidents can also come from scratch.",
                    "label": 0
                },
                {
                    "sent": "They don't have to come from alerts.",
                    "label": 0
                },
                {
                    "sent": "People can call in and call the support folks saying that this system is done with such and such, right?",
                    "label": 0
                },
                {
                    "sent": "So in this case the incidents are are created from scratch with pure free text.",
                    "label": 0
                },
                {
                    "sent": "Once the alerts and once the incidents are resolved, they are stored in the you know, another place for storing the incident resolutions.",
                    "label": 0
                },
                {
                    "sent": "So that's how we know.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This data sources look like right?",
                    "label": 0
                },
                {
                    "sent": "So our goal here then, is to leverage the alerts and incident data to improve the operational efficiency of the support desk.",
                    "label": 1
                },
                {
                    "sent": "So in the past, each one of these alerts and incidences look at individually, and once they are resolved is pretty much forgotten and simply stored, and possibly only get reused only when somebody wants to a query on them later.",
                    "label": 0
                },
                {
                    "sent": "To leverage the historical signal, the key is to cluster them.",
                    "label": 0
                },
                {
                    "sent": "Then if we can close them.",
                    "label": 0
                },
                {
                    "sent": "If we can cluster them instead of looking at the millions of unorganized alerts and incidents, we can then have a summarized Birds Eye view on the groups or category of data.",
                    "label": 0
                },
                {
                    "sent": "With this kind of information we can know which clusters of alerts were incidents have the largest volume OK?",
                    "label": 0
                },
                {
                    "sent": "Or take the most time to resolve.",
                    "label": 0
                },
                {
                    "sent": "And later, you know this.",
                    "label": 0
                },
                {
                    "sent": "This work, this work and also extend to additional use cases, such as when a future incidents falling into a known cluster before then, we can automatically be assigned.",
                    "label": 0
                },
                {
                    "sent": "We can automatically recommend you know a resolution that was seen by the past and that was associated with the previous large cluster or instant cluster and similarly video prediction can also be.",
                    "label": 0
                },
                {
                    "sent": "Can also be possible if we know the frequency sequential pattern of a cluster leading up to the failure.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the goal sounds very nice.",
                    "label": 0
                },
                {
                    "sent": "The main challenges are two parts.",
                    "label": 0
                },
                {
                    "sent": "1st part is as I mentioned earlier, data volume is very large, so we were looking at something like 10 million 10,000,000 alerts generated in the past six months of time.",
                    "label": 0
                },
                {
                    "sent": "And then the a large data are semi structured and incident data free, structured or unstructured, possibly requiring two different kind of analytic techniques to address them.",
                    "label": 1
                },
                {
                    "sent": "Right now.",
                    "label": 0
                },
                {
                    "sent": "Worst of all there is no table data.",
                    "label": 0
                },
                {
                    "sent": "So that's the biggest challenge.",
                    "label": 0
                },
                {
                    "sent": "So as you can see in the subsequent discussion here.",
                    "label": 0
                },
                {
                    "sent": "And a lot of the result is based on qualitative judgments in terms of now in terms of the challenges that we are facing with the analytics side of things, alerts and incidents sometimes have a very short text, no more than a few words at a time.",
                    "label": 1
                },
                {
                    "sent": "Then, the clustering techniques that we are using also need to scale because they are because the size of the incidents is very large and finally we need to have a way of.",
                    "label": 0
                },
                {
                    "sent": "Interpret the clusters so that we can allow no possibility of a qualitative evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, so the approach that we took go through the following order is iterative cycles.",
                    "label": 0
                },
                {
                    "sent": "There is no, there's no pre classified labels for clustering, so we take unsupervised learning approach.",
                    "label": 1
                },
                {
                    "sent": "Every alert is then treated as a bag of words.",
                    "label": 0
                },
                {
                    "sent": "We have the data we go through this iteration, so we we first normalize the tokens within the alerts and incidents, remove all the high frequency stuff, high frequency or useless stop words.",
                    "label": 0
                },
                {
                    "sent": "Then we construct distance metric.",
                    "label": 1
                },
                {
                    "sent": "Before applying clustering, then results are visualized and make and then we make adjustments for next iteration if necessary.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, so let me talk about how we go about clustering the semi structured text alerts.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "So I'm not going to go into too much details here.",
                    "label": 0
                },
                {
                    "sent": "All the details are spelled out in the paper, but quickly write for semi structured on alert text clustering.",
                    "label": 0
                },
                {
                    "sent": "We first define the distance metric using simple jakarr index to measure distance between any given to alerts.",
                    "label": 0
                },
                {
                    "sent": "And it took any alerts that have.",
                    "label": 0
                },
                {
                    "sent": "You know they have a normalized token before we applying.",
                    "label": 0
                },
                {
                    "sent": "Once we once we define the distance matrix given MIN finity matrix.",
                    "label": 0
                },
                {
                    "sent": "We then we can then create the graph.",
                    "label": 0
                },
                {
                    "sent": "We can establish an edge between any two nodes only if the distance is less than certain threshold.",
                    "label": 1
                },
                {
                    "sent": "Once we have that graph, we can then apply connected components to break.",
                    "label": 0
                },
                {
                    "sent": "The space in tools you know some crude partitions within each independent partition within apply graph partitioning to do the final partition clustering, so that's the basis of the work for the semi structured text alerts.",
                    "label": 0
                },
                {
                    "sent": "As for some structure, text alerts clustering, we have also applied various other clustering techniques such as hierarchical clustering using minimax linkage.",
                    "label": 0
                },
                {
                    "sent": "We also apply the latent space approach including LDA.",
                    "label": 0
                },
                {
                    "sent": "But among among others, they don't work as well as the current approach found in this paper.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is 1 visualization of the output cluster.",
                    "label": 0
                },
                {
                    "sent": "In order to help the clients.",
                    "label": 0
                },
                {
                    "sent": "You know, again, some business intelligence.",
                    "label": 0
                },
                {
                    "sent": "All of this data in our data set for this particular application.",
                    "label": 0
                },
                {
                    "sent": "All the alerts have one of the four tags.",
                    "label": 0
                },
                {
                    "sent": "Either they are data based alerts were Unix always alerts or ntos alerts.",
                    "label": 0
                },
                {
                    "sent": "For example, we process each bucket separately.",
                    "label": 0
                },
                {
                    "sent": "So on the ground on the slide.",
                    "label": 0
                },
                {
                    "sent": "Here you see like 4 different buckets for each bucket is being clustered into the into the small partitions.",
                    "label": 0
                },
                {
                    "sent": "The size of the size of the bubble indicates the volume of the cluster.",
                    "label": 0
                },
                {
                    "sent": "The intensity of the bubble indicates the number of incidents that was generated from this cluster.",
                    "label": 0
                },
                {
                    "sent": "By showing this sort of data, the support personnels immediately understand you know which types of alerts that causing most of their headaches.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's another way of showing a similar business intelligence.",
                    "label": 0
                },
                {
                    "sent": "Here I'm showing for every others I want to show the for every incident.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry for every alert that generates the instance we we compute the average mean time to repair so that now the operational folks can see which class of alerts that traditionally have they spend most of their time with.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "For operational folks to understand the nature of the errors contained in the cluster of containing the cluster, typical visualization for word clustering.",
                    "label": 0
                },
                {
                    "sent": "An expression the word clouds.",
                    "label": 1
                },
                {
                    "sent": "Doesn't work.",
                    "label": 0
                },
                {
                    "sent": "The main drawback there is that there's a lack of spatial information right of the tokens in alerts.",
                    "label": 0
                },
                {
                    "sent": "So instead we pick out the most likely word position preserved.",
                    "label": 0
                },
                {
                    "sent": "We pick out the most likely word position, preserved token sequence to represent each cluster.",
                    "label": 0
                },
                {
                    "sent": "In other words, we preserve the spatial positioning of the tokens in the alerts so that common words in the most common positions preserved, for example.",
                    "label": 0
                },
                {
                    "sent": "On this slide, there are three clusters of the alerts.",
                    "label": 0
                },
                {
                    "sent": "Each alerts is visualized by the most prominent word preserved token sequence OK.",
                    "label": 0
                },
                {
                    "sent": "So instead of looking at the flat structures of the text in the alerts, now we can just pick out the most significant token that preserved in their positions.",
                    "label": 0
                },
                {
                    "sent": "For the and present them to their support personnel.",
                    "label": 0
                },
                {
                    "sent": "This this kind of representation feels like some kind of pseudo error message, much more familiar and intuitive than war clouds to operational folks.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, so I just covered clustering and visualization we did for semi structured text alerts.",
                    "label": 0
                },
                {
                    "sent": "Now I'm just going to quickly go over the unstructured text incident data.",
                    "label": 0
                },
                {
                    "sent": "So like before, we did define the distance metric and the rationale for that distance matrix is explained in the paper.",
                    "label": 0
                },
                {
                    "sent": "This we have about 67,000 incidents, so it's very difficult to partition them in one go, right?",
                    "label": 0
                },
                {
                    "sent": "So instead of so we gotta do some kind of data reduction technique there.",
                    "label": 0
                },
                {
                    "sent": "We treat each incidents in the latent space within that in space we perform non negative negative.",
                    "label": 0
                },
                {
                    "sent": "I mean we perform the non negative matrix factorization to find the latent representation of the of the incidents.",
                    "label": 1
                },
                {
                    "sent": "Then we use a KD tree to do a course space partitioning.",
                    "label": 0
                },
                {
                    "sent": "Within each partition, then we apply hierarchical clustering, such as a complete linkage criteria.",
                    "label": 0
                },
                {
                    "sent": "Then we do a final post processing technique to merge the cluster back and then.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Result is the following slide.",
                    "label": 0
                },
                {
                    "sent": "Here I'm showing you the top 25.",
                    "label": 0
                },
                {
                    "sent": "It might be hard to read, but 25 clusters accounting for 20% of all the 67 incidents incidents.",
                    "label": 1
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So finally I want to.",
                    "label": 0
                },
                {
                    "sent": "Quickly share with you some of the lessons and takeaways here.",
                    "label": 0
                },
                {
                    "sent": "The main takeaway here is that you know alerts and incident today is they are not leveraged to create values in typical large enterprise at infrastructure work such as this, introduce operational folks a new way to see what they are dealing with databases so that they can sort of steps out of the tree and see the forest right by.",
                    "label": 0
                },
                {
                    "sent": "By seeing the structure of the alerts and incidents like this, we allow them to be able to profile classes of alerts, measuring volume and mean time to repair per class of alerts.",
                    "label": 1
                },
                {
                    "sent": "This work also served as the foundation for Future Resolution recommendation, use case or failure prediction.",
                    "label": 1
                },
                {
                    "sent": "Our use case.",
                    "label": 0
                },
                {
                    "sent": "There are a few just three more lessons that we learned here.",
                    "label": 0
                },
                {
                    "sent": "The volume of data is very large.",
                    "label": 0
                },
                {
                    "sent": "It is impossible to run this on a single machine.",
                    "label": 1
                },
                {
                    "sent": "This work has been done on the Greenplum database with massively parallel processing architecture even, but Even so, some algorithm innovation in this work is created to deal with the volume right.",
                    "label": 0
                },
                {
                    "sent": "Since there is no labeled data, you need to quickly.",
                    "label": 0
                },
                {
                    "sent": "If you need a quick qualitative feedback from the domain expert, you can only do so if you have a way of visualizing the cluster.",
                    "label": 0
                },
                {
                    "sent": "And in this work we have enough.",
                    "label": 0
                },
                {
                    "sent": "Finally, in this work we have not leverage any temporal information, so that that's kind of data can be used in the future for further refinement.",
                    "label": 0
                },
                {
                    "sent": "Thank you, that's my talk.",
                    "label": 0
                }
            ]
        }
    }
}