{
    "id": "by723oc5mu2uafomch3gqzmrp74jod25",
    "title": "A Kernel Revision Operator for Terminologies - Algorithms and Evaluation",
    "info": {
        "author": [
            "Guilin Qi, University of Karlsruhe"
        ],
        "published": "Nov. 24, 2008",
        "recorded": "October 2008",
        "category": [
            "Top->Computer Science->Machine Learning->Kernel Methods"
        ]
    },
    "url": "http://videolectures.net/iswc08_qi_krot/",
    "segmentation": [
        [
            "OK, thanks for coming.",
            "So my name is green tea and this is a joint work with Peter Hustle and system found their order under 2G, Japan and Johanna.",
            "So in this paper we are talking about kernel division operator for terminologies and we provide algorithms for."
        ],
        [
            "Building the specific division operators and provide evaluation results.",
            "So in this talk I will first give the motivations of this work, then give some preliminaries on debugging terminologies to which are important to understand this work.",
            "OK then afterwards I will give the definition for our kernel kernel division operator for terminologies and algorithms for specific operators.",
            "And afterwards I will give some evaluation results and conclude and provide."
        ],
        [
            "Some future work, not motivation."
        ],
        [
            "So what do we mean?",
            "Division operator for terminologies here.",
            "So it's mapping flown to description logic T boxes TT&TO to a set of key boxes, or a single tee box.",
            "Which can infer every actions in this tee box.",
            "T0 lot means the.",
            "Use this.",
            "OK, so this T is we can see that we consider it as a regional tee box and that we use the second tee box TO2 devices.",
            "So that's we want to accept every axioms in this second tee box pizza low.",
            "So here we have two examples scenarios.",
            "Of course there are some others, but here in our paper we consider these two one.",
            "The first one is the ontology learning scenario.",
            "In this case you start with an empty box, nothing there.",
            "Then you generate a set of terminally terminological axioms, TTL of long text, and then.",
            "Into the to the tee box.",
            "T and we do it in a it allative way, therefore we can leave the result should be still a tee box which has no logical contradiction.",
            "And then there's the second.",
            "The second scenario is ontology mapping.",
            "And in this case, in this scenario we want to integrate to genius sources, source ontologies while mappings, and then the source ontologies are fixed here in our case and we consider their more reliable than the mappings, then we use them to hear the PTO is the is the Union of the.",
            "Source of knowledge is and OK, sorry I made a mistake here, so here it should be.",
            "It should be T and the Union should PT TT 0 sorry.",
            "So the result should be a merged ontology without."
        ],
        [
            "Logical contradiction.",
            "So what's the problem?",
            "We want to deal with logical contradictions and, for example, in the ontology learning scenario.",
            "Contradictions which will occur when expressive ontologies are learned and for the ontology mapping scenario where you may get alone in loneliness.",
            "Mappings which are generated by some ontology mapping tool.",
            "And what what, what our solution is.",
            "So we propose a divisional player which is inspired by the kernel division operator in propositional logic, and it is based on the notion of minimal incoherence preserving subte boxes.",
            "Lips.",
            "And.",
            "We show that our divisional play to satisfy some very important logic properties and under we instantiate this general division player by two algorithms which were implemented, this other, the."
        ],
        [
            "When contributions of this work.",
            "And so we want to."
        ],
        [
            "Tell it about the debugging terminology, which is a little bit of formal.",
            "And what do we mean?",
            "Moves is minimal on sub box of the tee box such large.",
            "Concept is is unsatisfiable in it so you can if you if you hear in the morning session you will hear the talk by Matthew about justification.",
            "So basically the moves is justification for the unsatisfied for an unsatisfiable concept.",
            "So here is the example.",
            "So in this example we have the tee box which contains 4 axioms.",
            "So instead in this tee box, the concept manager is unsatisfiable.",
            "Why this unsatisfied?",
            "Because there is a move for for it, and so we have manager is employee and employee is a job position and then job position and the employee.",
            "They are actually disjoint.",
            "Therefore this manager must be interpreted as an empty set by by order models of this.",
            "Tee box and we also want to introduce the notion of incoherence.",
            "Well, Tee box is incoherent if and only if there is.",
            "There is unsatisfiable concept in it.",
            "Understand nips for the for a tee box is actually minimal.",
            "Sub box of this T which is incoherent so we satisfies these two conditions.",
            "Go back to this example.",
            "So in this example we have exactly one tee box which is slightly smaller than the moves there.",
            "So it's not specific to related to a unsatisfiable concept."
        ],
        [
            "And So what is our division operate?"
        ],
        [
            "As I have said, we want to deal with the problem for division, so there are not just one 1T box here, so we need to consider two and therefore.",
            "The idea of our division operator is we use the moves, but we need to generalize it to T22T boxes and we want to remove some actions in this.",
            "This moves nips.",
            "And now what is the what is the generalization?",
            "So the mix of TEE box with not one T0 vertical is considered as more reliable.",
            "It is a subset of this tee box which is first.",
            "Incoherent with this T0 and 2nd it's prob subset is coherent, so it's it's.",
            "This is the minimum subset.",
            "And so we still use the example we have used before.",
            "In this example we separate this tee box in the two and so here we can find just one tee box mix of of this of this T with respect to the TO."
        ],
        [
            "OK, then we have defined this generalized dismiss.",
            "Now the question is how do we remove?",
            "How do you remove the axioms following flood Maps to get to resolve this incoherence?",
            "So the solution is that we use the incision function.",
            "So if the definition is a little bit of formal, but you can see the kind of yeah, it's green or not green.",
            "It's not like some blue light blue color, so we can solve the idea is you select some actions from flow each flow each moves and that means that for each move in.",
            "So the action you selected must belong to some moves MIPS and each MIPS must has some.",
            "Action be selected.",
            "And naively insist function is a lot.",
            "You just select everything from Florida Florida Maps to delete.",
            "But of course it is clear this is not a good solution because you actually remove too much so.",
            "A good principle is that you want to have some minimum changes.",
            "What I mean minimal changes kind of you select some minimum minimum numbers of attempts to need to delete or minimum set of axioms."
        ],
        [
            "So we with this generalized generalized Maps and also the.",
            "Incision function so we can divide our division operator.",
            "The idea is very simple, you just first in the first stable you select, select some actions using this incision function, then you remove them.",
            "Afterwards you are you at the teaser actions in TO2 to this device.",
            "Books.",
            "And so to result of the division is always a coherent tee box.",
            "Here we also prove some alot logic properties of this divisional plate.",
            "Basically they are inherited from the kernel division operator Improbable."
        ],
        [
            "Additional logic, but still we.",
            "Briefly explain two of them.",
            "The first ones is large, the.",
            "New material must must be accepted.",
            "And under the under the fifth of them says that if you if you have something in the original tee box and then you remove it, then you must have some reason in this action must be involved in the in the conflict."
        ],
        [
            "So we.",
            "Also proposed to algorithms too, because as you can see."
        ],
        [
            "Here with the the the Division of Labor is the definition of the division operator is quite general.",
            "We do not specify how we define the essential function so different different in social functions can actually result in different specific kernel kernel division operators and this basically this intention function can be one of the most popular techniques.",
            "Is you just use.",
            "Later Skating said she algorithm to to just get one cut or one hitting set for this.",
            "For the MIPS and manually remove this hidden set to get to resolve the incoherence.",
            "However, the problem is Della, potentially, exponentials numbers of this hidden sets which are computed by the hidden set algorithm.",
            "Therefore, we we do some heuristics, we deduce this space search space by using.",
            "Two notions, once the scoring function or the other one, is the confidence values.",
            "How?"
        ],
        [
            "So we do it.",
            "So we basically we do not have enough to have time to explain all of the actions so I can just give some basic ideas of what algorithms do.",
            "So the first algorithm is based on the scoring function and the hidden search algorithms.",
            "So WATS calling function?",
            "Basically it's the scoring function for each actions in the in the tee box you.",
            "You can get a score for this action, which is the number of MIPS it belongs to.",
            "Then you then you use this scores to decide which actions you should remove to resolve this incoherence.",
            "And then the second one is based on the confidence value to each attached to the axioms in the tee box.",
            "And then we also also we used to use this confidence values to decide which actions should be removed.",
            "The first one, the second axioms.",
            "They actually Colonel division operators.",
            "But The thing is, we in these two algorithms we need to compute all the Maps which.",
            "Which is maybe too time consuming and not very scalable as we will see in the in the experiments.",
            "Therefore we propose another one which is based on computing moves and the baseline confidence values that this one.",
            "Is not exactly the kernel division applied, but our experiment will show that it's actually very good, good, better, approximate.",
            "This kernel division operator."
        ],
        [
            "So how much time do I have?",
            "OK so I have time."
        ],
        [
            "So in our experiments we actually use.",
            "We considered two to two kinds of ontologies, but in cause the time limit we can just show you one.",
            "One of them is the ontology mapping scenario.",
            "And in this, in this scenario we consider source ontologies from the actual Monkey University.",
            "They have a 6 fifth of five of them, and here we have shown how how many accents are in this ontologies, and so we also generate mappings using it.",
            "Much you don't.",
            "You don't need to know what it is so.",
            "So we have the confidence to learn the CMT mapped with 14 mapping axioms and equal and CMT are mapped with 46 Martin axioms and CIS, and CKD are mapped and we have 22 mapping axioms."
        ],
        [
            "So we consider three majors in our evaluation.",
            "The first major is the division time, which is used to measure the efficiency of the algorithms.",
            "Consists of the time we used to check satisfiability and that I'm used to fight Maps or moves to the time to debug and resolve this incoherence and then take the second measure is the number of actions which are actually removed.",
            "And then the third one is the, the the meaningfulness what do we mean meaningful least we have 3.",
            "Sleeve actually late.",
            "The first one is the collected and then error rates and also the unknown it.",
            "So we ask for users to decide which removal is correct or.",
            "All on there unsure actually, so the collect the collection is of the removal is the.",
            "The collect needs collecting, removal and divide the total removals and we can also.",
            "Similarly we can also divide the iterates and unknown date.",
            "So the 1st."
        ],
        [
            "Result is.",
            "Is in this table and as you can see.",
            "In this way, I just you can focus focus on here and for this all of so we have considered a three pairs of mappings, mapped ontologies and here we have three algorithms can compare with for each, for each pair of.",
            "Ontologies so you can see there.",
            "So the time spent is still not not.",
            "SEPTA Bhil so therefore the first conclusion is that we all algorithm can actually handle real life ontologies.",
            "And as you can see, the float float data.",
            "The fact that the third algorithm algorithm based on moves is much more scalable than the others."
        ],
        [
            "Now why this why it is so?",
            "So you can sit in this.",
            "In this column.",
            "So.",
            "These are the actually the moves which are which are handled by the by the algorithms it there, they are not the moves which are contained in the in the in the ontology.",
            "From this, from this calling you can you can see the numbers.",
            "The numbers of unsatisfiable concepts, which are handled by the algorithm based on moves is much less than the other two becausw in the 1st and the 2nd algorithm we actually.",
            "The.",
            "Handle all of all of the unsatisfiable concept and then compute all the moves.",
            "Then use the result to generate MIPS so this is.",
            "Very time consuming."
        ],
        [
            "Now the.",
            "In this in this.",
            "Column you can see the numbers of.",
            "Accents which are removed.",
            "So.",
            "For the first, for the first pair of ontologies and and and also the third one.",
            "Algorithm the algorithm based on the score scoring function is the moves removes this axioms, then the other two.",
            "So basically we can.",
            "We also another ontology, not that is not shown here.",
            "Basically we can you can conclude that the algorithm which is based on score scoring function based complies with the requirement of minimum change.",
            "But this is not the.",
            "This conclusion is does does not hold in general.",
            "You cannot say OK this is always code because according to the second pair of ontologies, the.",
            "The first, the algorithm based on scoring function, actually removes more.",
            "Therefore, the algorithm based on moves.",
            "Uh.",
            "In in some case, in some cases removes much more than than the algorithm based based on scores calling function, but in most of our experiments, in most of cases does not in remove too much still so.",
            "Basically, according to this result we we can conclude that the algorithm which is based based on the moves is much scalable than the other two.",
            "OK for these two?",
            "And but still it does not remove too much still.",
            "OK, then now you will ask, does this removal make sense?",
            "So we.",
            "Also need to."
        ],
        [
            "Organize the meaningfulness of this removals for this one you can.",
            "You can see that the collectiveness rate is considerably higher than the error rate.",
            "If you compare this these two column.",
            "So this is very clear."
        ],
        [
            "And for this one you can.",
            "You can compare the collections of illness between between this this algorithm.",
            "These two becausw.",
            "Why do I?",
            "Why do we compare this?",
            "Because this this one is based on score scoring function.",
            "At these two they are based on confidence values.",
            "Therefore from this comparison you can see that the algorithms based on confidence values they are actually.",
            "More meaningful Delhi, Mughal Delhi move are more meaningful than the algorithm which is based on scoring function.",
            "From this you can see the confidence what values are really playing some lower in the removal."
        ],
        [
            "And then the final one is bought unknown these days.",
            "There's no Valley.",
            "Earth kind of rule.",
            "You can learn from this.",
            "TBF, 'cause the this unknown rate is really dependent on the on the ontologies.",
            "The nature of the ontologies."
        ],
        [
            "OK, then conclude."
        ],
        [
            "What problem do we address?",
            "We want to devise terminologies by dealing with logical contradiction and our approach is a general divisional play to use which is based on the incision function and we propose operators algorithms to instantiate our division operator.",
            "And also we propose another algorithm which is based on computing moves.",
            "As a good alternative and all the evaluation result shows the algorithm can actually handle real life ontologies, they are the algorithms based on constant confidence values can lead to a considerable more meaningful result and the algorithm which is based on computing moves shows good scalability and still have good meaningful results removal and.",
            "Applications of this division can have the following so we can have untold learning and matching.",
            "These are two scenario we have used and another one is the you can use this to web syndication and ontology evolution."
        ],
        [
            "For the future work, we first want to explore more efficient algorithms for computing moves.",
            "So our idea is we want to 1st extract modules from Florida original Ontology which contains all the moves.",
            "Then we apply the.",
            "Hidden said she had reason to.",
            "Talk talk.",
            "Compute all the solid first extract modules, then find moves.",
            "And we also want to have some cycling because in our work we if there is inconsistently just remove the whole axioms, which is not very violent.",
            "So another work is to propose 5 grand approaches.",
            "Then we also want to combine all tool with Sister Augmentation Wiki to deal with collaborative ontology Evolution.",
            "This is the one of the ongoing work we're done in the Neon project.",
            "OK thanks.",
            "Thank you very much.",
            "Questions, comments.",
            "South start, I've just a wild idea.",
            "If I could combine this with the attribute exploration of Barnett Gunter which is a knowledge acquisition method for closure operators, maybe if I could turn it into a kernel operator and then apply to your scenario then you could ask the user.",
            "Should I remove this extra or should I give it in so that might be an interesting approach to to continue all.",
            "Yeah so actually the work we are ongoing is the.",
            "Final one we show here is want to combine the work we have done with the Cislo argumentation week is so that we can present some users can discuss and so we can use our tool.",
            "We can, we can find those actions, delete it and the user can discuss if they want really want to remove it and then put it back in the day.",
            "Discuss OK so.",
            "OK, so there are some people in in culture or who may we know about this maybe?",
            "Encounter any cases of these phenomenon we call external masking in your in your experiments, 'cause it might then have some effect of the result.",
            "Did you encounter any?",
            "Can you remind me to ask?",
            "I it is the case where these Maps are such that they hide some other potential myths so so they're not.",
            "Yeah, OK. Scribing the source of this entitlement.",
            "And so you might be miss you might be really repairing or revising.",
            "Did you encounter any of these cases?",
            "No, you did in.",
            "I mean not just in this experiment.",
            "OK, so in the expensive experiment we have done for also for our other work, so we never have this case.",
            "Which will try out on this case.",
            "If you have any ontologies which have this case, then we're happy to know, thanks.",
            "OK.",
            "Anyone else?",
            "If not, then thank you again, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, thanks for coming.",
                    "label": 0
                },
                {
                    "sent": "So my name is green tea and this is a joint work with Peter Hustle and system found their order under 2G, Japan and Johanna.",
                    "label": 0
                },
                {
                    "sent": "So in this paper we are talking about kernel division operator for terminologies and we provide algorithms for.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Building the specific division operators and provide evaluation results.",
                    "label": 1
                },
                {
                    "sent": "So in this talk I will first give the motivations of this work, then give some preliminaries on debugging terminologies to which are important to understand this work.",
                    "label": 1
                },
                {
                    "sent": "OK then afterwards I will give the definition for our kernel kernel division operator for terminologies and algorithms for specific operators.",
                    "label": 1
                },
                {
                    "sent": "And afterwards I will give some evaluation results and conclude and provide.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some future work, not motivation.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what do we mean?",
                    "label": 0
                },
                {
                    "sent": "Division operator for terminologies here.",
                    "label": 1
                },
                {
                    "sent": "So it's mapping flown to description logic T boxes TT&TO to a set of key boxes, or a single tee box.",
                    "label": 1
                },
                {
                    "sent": "Which can infer every actions in this tee box.",
                    "label": 0
                },
                {
                    "sent": "T0 lot means the.",
                    "label": 0
                },
                {
                    "sent": "Use this.",
                    "label": 0
                },
                {
                    "sent": "OK, so this T is we can see that we consider it as a regional tee box and that we use the second tee box TO2 devices.",
                    "label": 0
                },
                {
                    "sent": "So that's we want to accept every axioms in this second tee box pizza low.",
                    "label": 0
                },
                {
                    "sent": "So here we have two examples scenarios.",
                    "label": 0
                },
                {
                    "sent": "Of course there are some others, but here in our paper we consider these two one.",
                    "label": 0
                },
                {
                    "sent": "The first one is the ontology learning scenario.",
                    "label": 0
                },
                {
                    "sent": "In this case you start with an empty box, nothing there.",
                    "label": 1
                },
                {
                    "sent": "Then you generate a set of terminally terminological axioms, TTL of long text, and then.",
                    "label": 0
                },
                {
                    "sent": "Into the to the tee box.",
                    "label": 0
                },
                {
                    "sent": "T and we do it in a it allative way, therefore we can leave the result should be still a tee box which has no logical contradiction.",
                    "label": 0
                },
                {
                    "sent": "And then there's the second.",
                    "label": 0
                },
                {
                    "sent": "The second scenario is ontology mapping.",
                    "label": 1
                },
                {
                    "sent": "And in this case, in this scenario we want to integrate to genius sources, source ontologies while mappings, and then the source ontologies are fixed here in our case and we consider their more reliable than the mappings, then we use them to hear the PTO is the is the Union of the.",
                    "label": 0
                },
                {
                    "sent": "Source of knowledge is and OK, sorry I made a mistake here, so here it should be.",
                    "label": 1
                },
                {
                    "sent": "It should be T and the Union should PT TT 0 sorry.",
                    "label": 0
                },
                {
                    "sent": "So the result should be a merged ontology without.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Logical contradiction.",
                    "label": 0
                },
                {
                    "sent": "So what's the problem?",
                    "label": 0
                },
                {
                    "sent": "We want to deal with logical contradictions and, for example, in the ontology learning scenario.",
                    "label": 1
                },
                {
                    "sent": "Contradictions which will occur when expressive ontologies are learned and for the ontology mapping scenario where you may get alone in loneliness.",
                    "label": 1
                },
                {
                    "sent": "Mappings which are generated by some ontology mapping tool.",
                    "label": 0
                },
                {
                    "sent": "And what what, what our solution is.",
                    "label": 0
                },
                {
                    "sent": "So we propose a divisional player which is inspired by the kernel division operator in propositional logic, and it is based on the notion of minimal incoherence preserving subte boxes.",
                    "label": 1
                },
                {
                    "sent": "Lips.",
                    "label": 1
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "We show that our divisional play to satisfy some very important logic properties and under we instantiate this general division player by two algorithms which were implemented, this other, the.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When contributions of this work.",
                    "label": 0
                },
                {
                    "sent": "And so we want to.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Tell it about the debugging terminology, which is a little bit of formal.",
                    "label": 0
                },
                {
                    "sent": "And what do we mean?",
                    "label": 0
                },
                {
                    "sent": "Moves is minimal on sub box of the tee box such large.",
                    "label": 0
                },
                {
                    "sent": "Concept is is unsatisfiable in it so you can if you if you hear in the morning session you will hear the talk by Matthew about justification.",
                    "label": 1
                },
                {
                    "sent": "So basically the moves is justification for the unsatisfied for an unsatisfiable concept.",
                    "label": 0
                },
                {
                    "sent": "So here is the example.",
                    "label": 0
                },
                {
                    "sent": "So in this example we have the tee box which contains 4 axioms.",
                    "label": 0
                },
                {
                    "sent": "So instead in this tee box, the concept manager is unsatisfiable.",
                    "label": 1
                },
                {
                    "sent": "Why this unsatisfied?",
                    "label": 0
                },
                {
                    "sent": "Because there is a move for for it, and so we have manager is employee and employee is a job position and then job position and the employee.",
                    "label": 0
                },
                {
                    "sent": "They are actually disjoint.",
                    "label": 0
                },
                {
                    "sent": "Therefore this manager must be interpreted as an empty set by by order models of this.",
                    "label": 1
                },
                {
                    "sent": "Tee box and we also want to introduce the notion of incoherence.",
                    "label": 0
                },
                {
                    "sent": "Well, Tee box is incoherent if and only if there is.",
                    "label": 0
                },
                {
                    "sent": "There is unsatisfiable concept in it.",
                    "label": 1
                },
                {
                    "sent": "Understand nips for the for a tee box is actually minimal.",
                    "label": 0
                },
                {
                    "sent": "Sub box of this T which is incoherent so we satisfies these two conditions.",
                    "label": 1
                },
                {
                    "sent": "Go back to this example.",
                    "label": 0
                },
                {
                    "sent": "So in this example we have exactly one tee box which is slightly smaller than the moves there.",
                    "label": 0
                },
                {
                    "sent": "So it's not specific to related to a unsatisfiable concept.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And So what is our division operate?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As I have said, we want to deal with the problem for division, so there are not just one 1T box here, so we need to consider two and therefore.",
                    "label": 0
                },
                {
                    "sent": "The idea of our division operator is we use the moves, but we need to generalize it to T22T boxes and we want to remove some actions in this.",
                    "label": 0
                },
                {
                    "sent": "This moves nips.",
                    "label": 0
                },
                {
                    "sent": "And now what is the what is the generalization?",
                    "label": 0
                },
                {
                    "sent": "So the mix of TEE box with not one T0 vertical is considered as more reliable.",
                    "label": 0
                },
                {
                    "sent": "It is a subset of this tee box which is first.",
                    "label": 0
                },
                {
                    "sent": "Incoherent with this T0 and 2nd it's prob subset is coherent, so it's it's.",
                    "label": 0
                },
                {
                    "sent": "This is the minimum subset.",
                    "label": 0
                },
                {
                    "sent": "And so we still use the example we have used before.",
                    "label": 0
                },
                {
                    "sent": "In this example we separate this tee box in the two and so here we can find just one tee box mix of of this of this T with respect to the TO.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, then we have defined this generalized dismiss.",
                    "label": 0
                },
                {
                    "sent": "Now the question is how do we remove?",
                    "label": 0
                },
                {
                    "sent": "How do you remove the axioms following flood Maps to get to resolve this incoherence?",
                    "label": 0
                },
                {
                    "sent": "So the solution is that we use the incision function.",
                    "label": 1
                },
                {
                    "sent": "So if the definition is a little bit of formal, but you can see the kind of yeah, it's green or not green.",
                    "label": 0
                },
                {
                    "sent": "It's not like some blue light blue color, so we can solve the idea is you select some actions from flow each flow each moves and that means that for each move in.",
                    "label": 0
                },
                {
                    "sent": "So the action you selected must belong to some moves MIPS and each MIPS must has some.",
                    "label": 1
                },
                {
                    "sent": "Action be selected.",
                    "label": 0
                },
                {
                    "sent": "And naively insist function is a lot.",
                    "label": 0
                },
                {
                    "sent": "You just select everything from Florida Florida Maps to delete.",
                    "label": 0
                },
                {
                    "sent": "But of course it is clear this is not a good solution because you actually remove too much so.",
                    "label": 0
                },
                {
                    "sent": "A good principle is that you want to have some minimum changes.",
                    "label": 1
                },
                {
                    "sent": "What I mean minimal changes kind of you select some minimum minimum numbers of attempts to need to delete or minimum set of axioms.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we with this generalized generalized Maps and also the.",
                    "label": 0
                },
                {
                    "sent": "Incision function so we can divide our division operator.",
                    "label": 0
                },
                {
                    "sent": "The idea is very simple, you just first in the first stable you select, select some actions using this incision function, then you remove them.",
                    "label": 0
                },
                {
                    "sent": "Afterwards you are you at the teaser actions in TO2 to this device.",
                    "label": 0
                },
                {
                    "sent": "Books.",
                    "label": 0
                },
                {
                    "sent": "And so to result of the division is always a coherent tee box.",
                    "label": 1
                },
                {
                    "sent": "Here we also prove some alot logic properties of this divisional plate.",
                    "label": 0
                },
                {
                    "sent": "Basically they are inherited from the kernel division operator Improbable.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Additional logic, but still we.",
                    "label": 0
                },
                {
                    "sent": "Briefly explain two of them.",
                    "label": 0
                },
                {
                    "sent": "The first ones is large, the.",
                    "label": 0
                },
                {
                    "sent": "New material must must be accepted.",
                    "label": 0
                },
                {
                    "sent": "And under the under the fifth of them says that if you if you have something in the original tee box and then you remove it, then you must have some reason in this action must be involved in the in the conflict.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we.",
                    "label": 0
                },
                {
                    "sent": "Also proposed to algorithms too, because as you can see.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here with the the the Division of Labor is the definition of the division operator is quite general.",
                    "label": 0
                },
                {
                    "sent": "We do not specify how we define the essential function so different different in social functions can actually result in different specific kernel kernel division operators and this basically this intention function can be one of the most popular techniques.",
                    "label": 1
                },
                {
                    "sent": "Is you just use.",
                    "label": 0
                },
                {
                    "sent": "Later Skating said she algorithm to to just get one cut or one hitting set for this.",
                    "label": 0
                },
                {
                    "sent": "For the MIPS and manually remove this hidden set to get to resolve the incoherence.",
                    "label": 1
                },
                {
                    "sent": "However, the problem is Della, potentially, exponentials numbers of this hidden sets which are computed by the hidden set algorithm.",
                    "label": 1
                },
                {
                    "sent": "Therefore, we we do some heuristics, we deduce this space search space by using.",
                    "label": 0
                },
                {
                    "sent": "Two notions, once the scoring function or the other one, is the confidence values.",
                    "label": 0
                },
                {
                    "sent": "How?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we do it.",
                    "label": 0
                },
                {
                    "sent": "So we basically we do not have enough to have time to explain all of the actions so I can just give some basic ideas of what algorithms do.",
                    "label": 0
                },
                {
                    "sent": "So the first algorithm is based on the scoring function and the hidden search algorithms.",
                    "label": 1
                },
                {
                    "sent": "So WATS calling function?",
                    "label": 0
                },
                {
                    "sent": "Basically it's the scoring function for each actions in the in the tee box you.",
                    "label": 0
                },
                {
                    "sent": "You can get a score for this action, which is the number of MIPS it belongs to.",
                    "label": 1
                },
                {
                    "sent": "Then you then you use this scores to decide which actions you should remove to resolve this incoherence.",
                    "label": 0
                },
                {
                    "sent": "And then the second one is based on the confidence value to each attached to the axioms in the tee box.",
                    "label": 0
                },
                {
                    "sent": "And then we also also we used to use this confidence values to decide which actions should be removed.",
                    "label": 0
                },
                {
                    "sent": "The first one, the second axioms.",
                    "label": 0
                },
                {
                    "sent": "They actually Colonel division operators.",
                    "label": 0
                },
                {
                    "sent": "But The thing is, we in these two algorithms we need to compute all the Maps which.",
                    "label": 0
                },
                {
                    "sent": "Which is maybe too time consuming and not very scalable as we will see in the in the experiments.",
                    "label": 0
                },
                {
                    "sent": "Therefore we propose another one which is based on computing moves and the baseline confidence values that this one.",
                    "label": 0
                },
                {
                    "sent": "Is not exactly the kernel division applied, but our experiment will show that it's actually very good, good, better, approximate.",
                    "label": 0
                },
                {
                    "sent": "This kernel division operator.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So how much time do I have?",
                    "label": 0
                },
                {
                    "sent": "OK so I have time.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in our experiments we actually use.",
                    "label": 0
                },
                {
                    "sent": "We considered two to two kinds of ontologies, but in cause the time limit we can just show you one.",
                    "label": 0
                },
                {
                    "sent": "One of them is the ontology mapping scenario.",
                    "label": 1
                },
                {
                    "sent": "And in this, in this scenario we consider source ontologies from the actual Monkey University.",
                    "label": 0
                },
                {
                    "sent": "They have a 6 fifth of five of them, and here we have shown how how many accents are in this ontologies, and so we also generate mappings using it.",
                    "label": 0
                },
                {
                    "sent": "Much you don't.",
                    "label": 0
                },
                {
                    "sent": "You don't need to know what it is so.",
                    "label": 0
                },
                {
                    "sent": "So we have the confidence to learn the CMT mapped with 14 mapping axioms and equal and CMT are mapped with 46 Martin axioms and CIS, and CKD are mapped and we have 22 mapping axioms.",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we consider three majors in our evaluation.",
                    "label": 0
                },
                {
                    "sent": "The first major is the division time, which is used to measure the efficiency of the algorithms.",
                    "label": 0
                },
                {
                    "sent": "Consists of the time we used to check satisfiability and that I'm used to fight Maps or moves to the time to debug and resolve this incoherence and then take the second measure is the number of actions which are actually removed.",
                    "label": 1
                },
                {
                    "sent": "And then the third one is the, the the meaningfulness what do we mean meaningful least we have 3.",
                    "label": 0
                },
                {
                    "sent": "Sleeve actually late.",
                    "label": 0
                },
                {
                    "sent": "The first one is the collected and then error rates and also the unknown it.",
                    "label": 1
                },
                {
                    "sent": "So we ask for users to decide which removal is correct or.",
                    "label": 0
                },
                {
                    "sent": "All on there unsure actually, so the collect the collection is of the removal is the.",
                    "label": 0
                },
                {
                    "sent": "The collect needs collecting, removal and divide the total removals and we can also.",
                    "label": 1
                },
                {
                    "sent": "Similarly we can also divide the iterates and unknown date.",
                    "label": 0
                },
                {
                    "sent": "So the 1st.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Result is.",
                    "label": 0
                },
                {
                    "sent": "Is in this table and as you can see.",
                    "label": 0
                },
                {
                    "sent": "In this way, I just you can focus focus on here and for this all of so we have considered a three pairs of mappings, mapped ontologies and here we have three algorithms can compare with for each, for each pair of.",
                    "label": 1
                },
                {
                    "sent": "Ontologies so you can see there.",
                    "label": 0
                },
                {
                    "sent": "So the time spent is still not not.",
                    "label": 0
                },
                {
                    "sent": "SEPTA Bhil so therefore the first conclusion is that we all algorithm can actually handle real life ontologies.",
                    "label": 1
                },
                {
                    "sent": "And as you can see, the float float data.",
                    "label": 1
                },
                {
                    "sent": "The fact that the third algorithm algorithm based on moves is much more scalable than the others.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now why this why it is so?",
                    "label": 0
                },
                {
                    "sent": "So you can sit in this.",
                    "label": 0
                },
                {
                    "sent": "In this column.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "These are the actually the moves which are which are handled by the by the algorithms it there, they are not the moves which are contained in the in the in the ontology.",
                    "label": 0
                },
                {
                    "sent": "From this, from this calling you can you can see the numbers.",
                    "label": 0
                },
                {
                    "sent": "The numbers of unsatisfiable concepts, which are handled by the algorithm based on moves is much less than the other two becausw in the 1st and the 2nd algorithm we actually.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Handle all of all of the unsatisfiable concept and then compute all the moves.",
                    "label": 0
                },
                {
                    "sent": "Then use the result to generate MIPS so this is.",
                    "label": 0
                },
                {
                    "sent": "Very time consuming.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now the.",
                    "label": 0
                },
                {
                    "sent": "In this in this.",
                    "label": 0
                },
                {
                    "sent": "Column you can see the numbers of.",
                    "label": 0
                },
                {
                    "sent": "Accents which are removed.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "For the first, for the first pair of ontologies and and and also the third one.",
                    "label": 0
                },
                {
                    "sent": "Algorithm the algorithm based on the score scoring function is the moves removes this axioms, then the other two.",
                    "label": 0
                },
                {
                    "sent": "So basically we can.",
                    "label": 0
                },
                {
                    "sent": "We also another ontology, not that is not shown here.",
                    "label": 0
                },
                {
                    "sent": "Basically we can you can conclude that the algorithm which is based on score scoring function based complies with the requirement of minimum change.",
                    "label": 0
                },
                {
                    "sent": "But this is not the.",
                    "label": 0
                },
                {
                    "sent": "This conclusion is does does not hold in general.",
                    "label": 0
                },
                {
                    "sent": "You cannot say OK this is always code because according to the second pair of ontologies, the.",
                    "label": 0
                },
                {
                    "sent": "The first, the algorithm based on scoring function, actually removes more.",
                    "label": 0
                },
                {
                    "sent": "Therefore, the algorithm based on moves.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "In in some case, in some cases removes much more than than the algorithm based based on scores calling function, but in most of our experiments, in most of cases does not in remove too much still so.",
                    "label": 0
                },
                {
                    "sent": "Basically, according to this result we we can conclude that the algorithm which is based based on the moves is much scalable than the other two.",
                    "label": 0
                },
                {
                    "sent": "OK for these two?",
                    "label": 0
                },
                {
                    "sent": "And but still it does not remove too much still.",
                    "label": 0
                },
                {
                    "sent": "OK, then now you will ask, does this removal make sense?",
                    "label": 0
                },
                {
                    "sent": "So we.",
                    "label": 0
                },
                {
                    "sent": "Also need to.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Organize the meaningfulness of this removals for this one you can.",
                    "label": 0
                },
                {
                    "sent": "You can see that the collectiveness rate is considerably higher than the error rate.",
                    "label": 1
                },
                {
                    "sent": "If you compare this these two column.",
                    "label": 0
                },
                {
                    "sent": "So this is very clear.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And for this one you can.",
                    "label": 0
                },
                {
                    "sent": "You can compare the collections of illness between between this this algorithm.",
                    "label": 0
                },
                {
                    "sent": "These two becausw.",
                    "label": 0
                },
                {
                    "sent": "Why do I?",
                    "label": 0
                },
                {
                    "sent": "Why do we compare this?",
                    "label": 0
                },
                {
                    "sent": "Because this this one is based on score scoring function.",
                    "label": 0
                },
                {
                    "sent": "At these two they are based on confidence values.",
                    "label": 0
                },
                {
                    "sent": "Therefore from this comparison you can see that the algorithms based on confidence values they are actually.",
                    "label": 0
                },
                {
                    "sent": "More meaningful Delhi, Mughal Delhi move are more meaningful than the algorithm which is based on scoring function.",
                    "label": 0
                },
                {
                    "sent": "From this you can see the confidence what values are really playing some lower in the removal.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then the final one is bought unknown these days.",
                    "label": 0
                },
                {
                    "sent": "There's no Valley.",
                    "label": 0
                },
                {
                    "sent": "Earth kind of rule.",
                    "label": 0
                },
                {
                    "sent": "You can learn from this.",
                    "label": 0
                },
                {
                    "sent": "TBF, 'cause the this unknown rate is really dependent on the on the ontologies.",
                    "label": 0
                },
                {
                    "sent": "The nature of the ontologies.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, then conclude.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What problem do we address?",
                    "label": 0
                },
                {
                    "sent": "We want to devise terminologies by dealing with logical contradiction and our approach is a general divisional play to use which is based on the incision function and we propose operators algorithms to instantiate our division operator.",
                    "label": 1
                },
                {
                    "sent": "And also we propose another algorithm which is based on computing moves.",
                    "label": 0
                },
                {
                    "sent": "As a good alternative and all the evaluation result shows the algorithm can actually handle real life ontologies, they are the algorithms based on constant confidence values can lead to a considerable more meaningful result and the algorithm which is based on computing moves shows good scalability and still have good meaningful results removal and.",
                    "label": 1
                },
                {
                    "sent": "Applications of this division can have the following so we can have untold learning and matching.",
                    "label": 0
                },
                {
                    "sent": "These are two scenario we have used and another one is the you can use this to web syndication and ontology evolution.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For the future work, we first want to explore more efficient algorithms for computing moves.",
                    "label": 1
                },
                {
                    "sent": "So our idea is we want to 1st extract modules from Florida original Ontology which contains all the moves.",
                    "label": 0
                },
                {
                    "sent": "Then we apply the.",
                    "label": 0
                },
                {
                    "sent": "Hidden said she had reason to.",
                    "label": 0
                },
                {
                    "sent": "Talk talk.",
                    "label": 0
                },
                {
                    "sent": "Compute all the solid first extract modules, then find moves.",
                    "label": 0
                },
                {
                    "sent": "And we also want to have some cycling because in our work we if there is inconsistently just remove the whole axioms, which is not very violent.",
                    "label": 0
                },
                {
                    "sent": "So another work is to propose 5 grand approaches.",
                    "label": 0
                },
                {
                    "sent": "Then we also want to combine all tool with Sister Augmentation Wiki to deal with collaborative ontology Evolution.",
                    "label": 1
                },
                {
                    "sent": "This is the one of the ongoing work we're done in the Neon project.",
                    "label": 0
                },
                {
                    "sent": "OK thanks.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Questions, comments.",
                    "label": 0
                },
                {
                    "sent": "South start, I've just a wild idea.",
                    "label": 0
                },
                {
                    "sent": "If I could combine this with the attribute exploration of Barnett Gunter which is a knowledge acquisition method for closure operators, maybe if I could turn it into a kernel operator and then apply to your scenario then you could ask the user.",
                    "label": 0
                },
                {
                    "sent": "Should I remove this extra or should I give it in so that might be an interesting approach to to continue all.",
                    "label": 0
                },
                {
                    "sent": "Yeah so actually the work we are ongoing is the.",
                    "label": 0
                },
                {
                    "sent": "Final one we show here is want to combine the work we have done with the Cislo argumentation week is so that we can present some users can discuss and so we can use our tool.",
                    "label": 0
                },
                {
                    "sent": "We can, we can find those actions, delete it and the user can discuss if they want really want to remove it and then put it back in the day.",
                    "label": 0
                },
                {
                    "sent": "Discuss OK so.",
                    "label": 0
                },
                {
                    "sent": "OK, so there are some people in in culture or who may we know about this maybe?",
                    "label": 0
                },
                {
                    "sent": "Encounter any cases of these phenomenon we call external masking in your in your experiments, 'cause it might then have some effect of the result.",
                    "label": 0
                },
                {
                    "sent": "Did you encounter any?",
                    "label": 0
                },
                {
                    "sent": "Can you remind me to ask?",
                    "label": 0
                },
                {
                    "sent": "I it is the case where these Maps are such that they hide some other potential myths so so they're not.",
                    "label": 0
                },
                {
                    "sent": "Yeah, OK. Scribing the source of this entitlement.",
                    "label": 0
                },
                {
                    "sent": "And so you might be miss you might be really repairing or revising.",
                    "label": 0
                },
                {
                    "sent": "Did you encounter any of these cases?",
                    "label": 0
                },
                {
                    "sent": "No, you did in.",
                    "label": 0
                },
                {
                    "sent": "I mean not just in this experiment.",
                    "label": 0
                },
                {
                    "sent": "OK, so in the expensive experiment we have done for also for our other work, so we never have this case.",
                    "label": 0
                },
                {
                    "sent": "Which will try out on this case.",
                    "label": 0
                },
                {
                    "sent": "If you have any ontologies which have this case, then we're happy to know, thanks.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Anyone else?",
                    "label": 0
                },
                {
                    "sent": "If not, then thank you again, thank you.",
                    "label": 0
                }
            ]
        }
    }
}