{
    "id": "bzj6s6fnqnjwdf7ndhxr5z33hpnhpkeq",
    "title": "HeLiS: An Ontology For Supporting Healthy Lifestyles",
    "info": {
        "author": [
            "Mauro Dragoni, Bruno Kessler Foundation"
        ],
        "published": "Nov. 22, 2018",
        "recorded": "October 2018",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2018_dragoni_helis_ontology_lifestyles/",
    "segmentation": [
        [
            "So good morning, my name is Jamal Gonyon dimer searches scientist at Funderburk Kessler Research Center located in Trento, Italy and this morning I present the work that I jointly done with my colleagues in FBC concerning the creation of Harris that is an ontology for supporting healthy lifestyles and this person."
        ],
        [
            "Addition is the first act of our health saga that we present this year at the SWC, because this afternoon we will present our newspaper, integrating Alice into our real wood platform, and this evening during the post and demo session you can visit us for visiting our demo of our platform.",
            "So what?"
        ],
        [
            "Is at least briefly, Alyssa is a resource that includes the two kind of information concerning health, health care domain information about food than physical activities domain and what we called sort of monitoring knowledge that consists of concepts that can be used for supporting monitoring activities concerning the behaviors of users using applications in which Alice is integrated.",
            "So why we?"
        ],
        [
            "Get up there and other resources and other issues about food domain, for example because we when we submit the literature, there are already many available resources about this topic that has been presented and published.",
            "However, when we look for those resources at the time when we start to develop this our platform, we discovered that many of them were not available and then many of them were not usable.",
            "It means that if we decided to integrate those resources into aerial work platform.",
            "They do not have enough granular representation of nutritional information of foods and also about physical activities and this way it will not be possible to integrate this resource into a real world intelligent platform.",
            "So due to this lack of knowledge into the domain we decided to develop a new resource by Inter."
        ],
        [
            "Acting also with domain experts from the 20.",
            "No local healthcare Department, so we already worked with them past project and also in this case we apply the methodology Ontology engineering guidance because we were already comfortable with this methodology in past experiences.",
            "So we decided to propose it for this new task and basically what we what we did was a modeling exercise split in two main phases.",
            "In the first one we collected from unstructured sources all and additional information about foods and also information about the physical activity, daily life, daily life activities and also information about the effort that is necessary for completing such activities.",
            "Then by working with with the expert, we model the other three branches by integrating the concepts that were specifically thought for supporting the monitoring of people behavior.",
            "In particular, monitoring the monitoring entity branch that includes all the concept that can be used for representing the guidelines that users should follow.",
            "The user events that basically contains those concepts that are used for representing the data model of the data that are produced by users and stored in our knowledge.",
            "And then at the temporal entity branch that was used for defining those entities that are used for telling to the original which are the data that has to be used for inferring purposes."
        ],
        [
            "Concerning the food and nutrients branch, we started by analyzing the information containing the archive of Italian Minister of Agriculture and the epidemiological Department.",
            "These documents were very useful for location of the issues because they contain for more than 1000 food, the very granular representation of the nutritional information of those food.",
            "So from here we created a set of armor less 1000 food that we called basic food.",
            "For which ambition information were represented at a very granular level.",
            "However, these these individuals were not enough.",
            "If we wanted to adopt this resource into a real world environment.",
            "Because if a user has to provide what the heat in doing lunch, basically those food are two simple.",
            "For for making an application usable.",
            "So we had to create also the recipes of of.",
            "From my bowl archives.",
            "So we started from that Waconia class that is a public resource.",
            "For that, I and I iterate domain that contains around 500 recipes with the mapping with the with the mapping between the ingredients of each recipe and also the basic food that we already collected from other resources.",
            "And then we also collected the list of recipes from other private databases.",
            "For example the cheer food one that is.",
            "A company that provide that supply canteen so with with launches for example, and here we performed a very time consuming manual activity for mapping their recipes with our basic food.",
            "Basically the result of this exercise was that.",
            "And the basic food where contains all information from the time Mr.",
            "Cultural epidemiological Department.",
            "Then when we integrated the recipe in recipes in our in our ontology, we instantiate individuals for their recipe food concept in order to create a link between the ingredients of each recipe and the amount of a basic food that is included in its recipe."
        ],
        [
            "After dispatch, we switched to the activity domain and here we started from the Compendium of Physical Activities Document.",
            "This document provided by the Arizona State University that contains around 900.",
            "Physical activity not only sport activities but also daily life.",
            "If you want to check it to check it, you will also be.",
            "I mean you can laugh about which kind of activities they modeled in.",
            "This in this list.",
            "These activities are splitting 20 main categories that we refined a bit, and the interesting stuff here is that they also provided them values that is called meta metabolic equivalent task that represent which is the level of effort that on average a user has to put the for completing that specific activity for a specific amount of time.",
            "So this information was used for creating the basic.",
            "Level of this of this branch that is then reached when the when Entergy is used in into application as I show later at this stage will also link the Alice with the link operator Cloud.",
            "So by considering the content of the ontology we decided to link it with the Arabic 'cause we're used to.",
            "Some of the concept for from that source in particular the list of the new trends and also by the popularity that.",
            "Barack has within the overall Lincoln operator Cloud.",
            "This was the most visible resources for providing a direct connection between Alice and the."
        ],
        [
            "Cloud then the second phase was a strong collaboration with domain experts for modeling, which were the concept that were used for supporting the monitor activity.",
            "That is the main contributor scientific contribution of this source here, for example concerning the monitoring entity branch we are put here only the main concept.",
            "We input the monitoring whole concept that is used for representing the guidelines that expert modest for supporting users in following the healthy lifestyle.",
            "The host can be also aggregating profiles or in goals based on the purpose of developing applications that would like to support behavior change path.",
            "So in this case the goal concept allows to define to model which is the goal setting path they used that users should should follow and then one of the most important concept that is the violation one violation individuals of type violations.",
            "Uh, I mean presented contains the data that are inferred at reasoning time and they allowed to provide information for generating the explanation about the detection of potential unhealthy behavior."
        ],
        [
            "Then the second branch was a temporal entity, and here basically we model concept help that help.",
            "There is an F4 selecting which are the data that has to be considered for monitoring user performance.",
            "And here we may have two main kind of of concept.",
            "Temporality that refer to specific events, for example, a meal at dinner, or concepts that are related to time spans.",
            "So, for example, if I want to.",
            "We have to consider the the consumption of food of a specific time span.",
            "It can define the related entity, not only the week, but obviously you can define whatever you want."
        ],
        [
            "And finally, was the user the user event branch that is used for representing the actions performed by users?",
            "And here we have two main concepts that are used for describing data model that is used for storing user data.",
            "The consume food and performed activity consumed.",
            "Food is used for representing the amount of food that a user consumed during a specific time event and they performed activity stores the activity sessions of activity performed by a specific user.",
            "At this stage of when I performed activities stored within the ontology within the Knowledge Repository.",
            "This this task triggers the generation the instantiation of effort calories equivalent, because when previously I mentioned that within the activity brand, so we reported also the F the map value, that is the effort that the user has to perform before completing a specific task, but this value has to be corrected based on the health status of the of the user and also of his physical characteristics.",
            "So here, based on the user profile, this meta correction is automatically.",
            "Generated and stored into the ontology."
        ],
        [
            "So here briefly an example, an example of what happened when when user Inventor Storm with entology.",
            "Basically for consuming food and performed activity.",
            "We created a link between the user presentation and with the basic domain knowledge that we have into the ontology and obvious."
        ],
        [
            "The storage of new data triggers the execution of Arizona data.",
            "In case of detection of potential and Lt behavior, it generates individuals of type violation that contains all information that can be used by other components for providing feedbacks to users."
        ],
        [
            "Some basic statistics about the ontology.",
            "The almost 300 classes and more than 30,000 individuals and counting.",
            "Because we are the activity of storing new recipes into the into the intelligence.",
            "Still ongoing, it is available online also with the related documentation."
        ],
        [
            "As I mentioned, the introduction ontology is not an artifact per say, but it is integrated into a knowledge layer of oral, artificial, intelligent platform that we are developed within FBC here.",
            "I don't have time for going into the into detail, but basically data data collected forms for mobile applications and sensors are stored within the knowledge layer and reasoning activity.",
            "If they detect potential unhealthy behavior generates violation packages that are used by.",
            "A natural language component that is in charge of generating a feedback and recommendation that are sent to user."
        ],
        [
            "Do entology informative path so the domain knowledge part of intelligence available through web services and the documentation for using them is available on the website and we also set up Rabbit MQ server for supporting or.",
            "Sorry Motor is an activity by other application in order to grant the scalability of using our our service.",
            "And obviously you can also build your own application by downloading the ontology by itself."
        ],
        [
            "Geology has been created within the context of the Trentino Healthcare 4.0 framework.",
            "That is a long term framework for improving the awareness of healthy behaviors to the citizens, and it is also used and it's going to be extended within other project, both local European and commercial projects.",
            "So this ecosystem of activities and ontology will grant.",
            "Long term maintenance of the overall resource."
        ],
        [
            "Question in the future work we are in the process of integrating the USDA database becausw.",
            "We discovered that there are more basic food that we could that can be integrated into into the into the ontology and we start.",
            "We started to integrate knowledge about commercial products because during the evaluation of the ontology with the experts we discovered that I mean from the tee box perspective the coverage was judged as complete by the expert, but.",
            "Within the a box, the amount of knowledge that is asked to be be integrated is very big in or if you want to develop a complete application, then with the experts we are awesome modeling their relationships between chronic diseases, food and activity and with psychologists we are integrating the mindfulness domain within this ontology in order to support the inference of potential."
        ],
        [
            "Shala dietary disorder by by the user.",
            "So if you want to discuss more details about the ontology and to see how we have integrated into our platform, you can see you can come to our our demo this this evening."
        ],
        [
            "So that's all for now.",
            "Thank you, thank you, thank you, thank you.",
            "Yeah, we have the first question.",
            "Great talk just before lunch.",
            "So perfect timing.",
            "So you mentioned you're taking some unstructured data such as recipes and creating some machine understandable format.",
            "So how are you doing that?",
            "Is that through a manual annotation process or do you have some automation and curation process?",
            "So depending on the resources for example here for.",
            "Where was OK here these two sources were machine readable with related documentation that allowed to transform those data into the model that we implemented into the ontology.",
            "So this task was quite easy to perform.",
            "Instead the definition of.",
            "The mapping between the ingredients of the recipes.",
            "And those.",
            "And individuals that the information started from these databases was performed.",
            "Manual manually curated OK."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So good morning, my name is Jamal Gonyon dimer searches scientist at Funderburk Kessler Research Center located in Trento, Italy and this morning I present the work that I jointly done with my colleagues in FBC concerning the creation of Harris that is an ontology for supporting healthy lifestyles and this person.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Addition is the first act of our health saga that we present this year at the SWC, because this afternoon we will present our newspaper, integrating Alice into our real wood platform, and this evening during the post and demo session you can visit us for visiting our demo of our platform.",
                    "label": 0
                },
                {
                    "sent": "So what?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is at least briefly, Alyssa is a resource that includes the two kind of information concerning health, health care domain information about food than physical activities domain and what we called sort of monitoring knowledge that consists of concepts that can be used for supporting monitoring activities concerning the behaviors of users using applications in which Alice is integrated.",
                    "label": 0
                },
                {
                    "sent": "So why we?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Get up there and other resources and other issues about food domain, for example because we when we submit the literature, there are already many available resources about this topic that has been presented and published.",
                    "label": 0
                },
                {
                    "sent": "However, when we look for those resources at the time when we start to develop this our platform, we discovered that many of them were not available and then many of them were not usable.",
                    "label": 0
                },
                {
                    "sent": "It means that if we decided to integrate those resources into aerial work platform.",
                    "label": 0
                },
                {
                    "sent": "They do not have enough granular representation of nutritional information of foods and also about physical activities and this way it will not be possible to integrate this resource into a real world intelligent platform.",
                    "label": 1
                },
                {
                    "sent": "So due to this lack of knowledge into the domain we decided to develop a new resource by Inter.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Acting also with domain experts from the 20.",
                    "label": 0
                },
                {
                    "sent": "No local healthcare Department, so we already worked with them past project and also in this case we apply the methodology Ontology engineering guidance because we were already comfortable with this methodology in past experiences.",
                    "label": 0
                },
                {
                    "sent": "So we decided to propose it for this new task and basically what we what we did was a modeling exercise split in two main phases.",
                    "label": 1
                },
                {
                    "sent": "In the first one we collected from unstructured sources all and additional information about foods and also information about the physical activity, daily life, daily life activities and also information about the effort that is necessary for completing such activities.",
                    "label": 0
                },
                {
                    "sent": "Then by working with with the expert, we model the other three branches by integrating the concepts that were specifically thought for supporting the monitoring of people behavior.",
                    "label": 0
                },
                {
                    "sent": "In particular, monitoring the monitoring entity branch that includes all the concept that can be used for representing the guidelines that users should follow.",
                    "label": 1
                },
                {
                    "sent": "The user events that basically contains those concepts that are used for representing the data model of the data that are produced by users and stored in our knowledge.",
                    "label": 0
                },
                {
                    "sent": "And then at the temporal entity branch that was used for defining those entities that are used for telling to the original which are the data that has to be used for inferring purposes.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Concerning the food and nutrients branch, we started by analyzing the information containing the archive of Italian Minister of Agriculture and the epidemiological Department.",
                    "label": 1
                },
                {
                    "sent": "These documents were very useful for location of the issues because they contain for more than 1000 food, the very granular representation of the nutritional information of those food.",
                    "label": 0
                },
                {
                    "sent": "So from here we created a set of armor less 1000 food that we called basic food.",
                    "label": 0
                },
                {
                    "sent": "For which ambition information were represented at a very granular level.",
                    "label": 0
                },
                {
                    "sent": "However, these these individuals were not enough.",
                    "label": 0
                },
                {
                    "sent": "If we wanted to adopt this resource into a real world environment.",
                    "label": 0
                },
                {
                    "sent": "Because if a user has to provide what the heat in doing lunch, basically those food are two simple.",
                    "label": 0
                },
                {
                    "sent": "For for making an application usable.",
                    "label": 0
                },
                {
                    "sent": "So we had to create also the recipes of of.",
                    "label": 0
                },
                {
                    "sent": "From my bowl archives.",
                    "label": 0
                },
                {
                    "sent": "So we started from that Waconia class that is a public resource.",
                    "label": 0
                },
                {
                    "sent": "For that, I and I iterate domain that contains around 500 recipes with the mapping with the with the mapping between the ingredients of each recipe and also the basic food that we already collected from other resources.",
                    "label": 0
                },
                {
                    "sent": "And then we also collected the list of recipes from other private databases.",
                    "label": 0
                },
                {
                    "sent": "For example the cheer food one that is.",
                    "label": 0
                },
                {
                    "sent": "A company that provide that supply canteen so with with launches for example, and here we performed a very time consuming manual activity for mapping their recipes with our basic food.",
                    "label": 0
                },
                {
                    "sent": "Basically the result of this exercise was that.",
                    "label": 0
                },
                {
                    "sent": "And the basic food where contains all information from the time Mr.",
                    "label": 0
                },
                {
                    "sent": "Cultural epidemiological Department.",
                    "label": 0
                },
                {
                    "sent": "Then when we integrated the recipe in recipes in our in our ontology, we instantiate individuals for their recipe food concept in order to create a link between the ingredients of each recipe and the amount of a basic food that is included in its recipe.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "After dispatch, we switched to the activity domain and here we started from the Compendium of Physical Activities Document.",
                    "label": 1
                },
                {
                    "sent": "This document provided by the Arizona State University that contains around 900.",
                    "label": 0
                },
                {
                    "sent": "Physical activity not only sport activities but also daily life.",
                    "label": 0
                },
                {
                    "sent": "If you want to check it to check it, you will also be.",
                    "label": 0
                },
                {
                    "sent": "I mean you can laugh about which kind of activities they modeled in.",
                    "label": 0
                },
                {
                    "sent": "This in this list.",
                    "label": 0
                },
                {
                    "sent": "These activities are splitting 20 main categories that we refined a bit, and the interesting stuff here is that they also provided them values that is called meta metabolic equivalent task that represent which is the level of effort that on average a user has to put the for completing that specific activity for a specific amount of time.",
                    "label": 0
                },
                {
                    "sent": "So this information was used for creating the basic.",
                    "label": 0
                },
                {
                    "sent": "Level of this of this branch that is then reached when the when Entergy is used in into application as I show later at this stage will also link the Alice with the link operator Cloud.",
                    "label": 0
                },
                {
                    "sent": "So by considering the content of the ontology we decided to link it with the Arabic 'cause we're used to.",
                    "label": 0
                },
                {
                    "sent": "Some of the concept for from that source in particular the list of the new trends and also by the popularity that.",
                    "label": 0
                },
                {
                    "sent": "Barack has within the overall Lincoln operator Cloud.",
                    "label": 0
                },
                {
                    "sent": "This was the most visible resources for providing a direct connection between Alice and the.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Cloud then the second phase was a strong collaboration with domain experts for modeling, which were the concept that were used for supporting the monitor activity.",
                    "label": 1
                },
                {
                    "sent": "That is the main contributor scientific contribution of this source here, for example concerning the monitoring entity branch we are put here only the main concept.",
                    "label": 0
                },
                {
                    "sent": "We input the monitoring whole concept that is used for representing the guidelines that expert modest for supporting users in following the healthy lifestyle.",
                    "label": 0
                },
                {
                    "sent": "The host can be also aggregating profiles or in goals based on the purpose of developing applications that would like to support behavior change path.",
                    "label": 0
                },
                {
                    "sent": "So in this case the goal concept allows to define to model which is the goal setting path they used that users should should follow and then one of the most important concept that is the violation one violation individuals of type violations.",
                    "label": 0
                },
                {
                    "sent": "Uh, I mean presented contains the data that are inferred at reasoning time and they allowed to provide information for generating the explanation about the detection of potential unhealthy behavior.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then the second branch was a temporal entity, and here basically we model concept help that help.",
                    "label": 0
                },
                {
                    "sent": "There is an F4 selecting which are the data that has to be considered for monitoring user performance.",
                    "label": 0
                },
                {
                    "sent": "And here we may have two main kind of of concept.",
                    "label": 0
                },
                {
                    "sent": "Temporality that refer to specific events, for example, a meal at dinner, or concepts that are related to time spans.",
                    "label": 0
                },
                {
                    "sent": "So, for example, if I want to.",
                    "label": 0
                },
                {
                    "sent": "We have to consider the the consumption of food of a specific time span.",
                    "label": 0
                },
                {
                    "sent": "It can define the related entity, not only the week, but obviously you can define whatever you want.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And finally, was the user the user event branch that is used for representing the actions performed by users?",
                    "label": 1
                },
                {
                    "sent": "And here we have two main concepts that are used for describing data model that is used for storing user data.",
                    "label": 1
                },
                {
                    "sent": "The consume food and performed activity consumed.",
                    "label": 0
                },
                {
                    "sent": "Food is used for representing the amount of food that a user consumed during a specific time event and they performed activity stores the activity sessions of activity performed by a specific user.",
                    "label": 0
                },
                {
                    "sent": "At this stage of when I performed activities stored within the ontology within the Knowledge Repository.",
                    "label": 0
                },
                {
                    "sent": "This this task triggers the generation the instantiation of effort calories equivalent, because when previously I mentioned that within the activity brand, so we reported also the F the map value, that is the effort that the user has to perform before completing a specific task, but this value has to be corrected based on the health status of the of the user and also of his physical characteristics.",
                    "label": 0
                },
                {
                    "sent": "So here, based on the user profile, this meta correction is automatically.",
                    "label": 0
                },
                {
                    "sent": "Generated and stored into the ontology.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here briefly an example, an example of what happened when when user Inventor Storm with entology.",
                    "label": 0
                },
                {
                    "sent": "Basically for consuming food and performed activity.",
                    "label": 0
                },
                {
                    "sent": "We created a link between the user presentation and with the basic domain knowledge that we have into the ontology and obvious.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The storage of new data triggers the execution of Arizona data.",
                    "label": 0
                },
                {
                    "sent": "In case of detection of potential and Lt behavior, it generates individuals of type violation that contains all information that can be used by other components for providing feedbacks to users.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some basic statistics about the ontology.",
                    "label": 0
                },
                {
                    "sent": "The almost 300 classes and more than 30,000 individuals and counting.",
                    "label": 0
                },
                {
                    "sent": "Because we are the activity of storing new recipes into the into the intelligence.",
                    "label": 0
                },
                {
                    "sent": "Still ongoing, it is available online also with the related documentation.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As I mentioned, the introduction ontology is not an artifact per say, but it is integrated into a knowledge layer of oral, artificial, intelligent platform that we are developed within FBC here.",
                    "label": 0
                },
                {
                    "sent": "I don't have time for going into the into detail, but basically data data collected forms for mobile applications and sensors are stored within the knowledge layer and reasoning activity.",
                    "label": 0
                },
                {
                    "sent": "If they detect potential unhealthy behavior generates violation packages that are used by.",
                    "label": 0
                },
                {
                    "sent": "A natural language component that is in charge of generating a feedback and recommendation that are sent to user.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Do entology informative path so the domain knowledge part of intelligence available through web services and the documentation for using them is available on the website and we also set up Rabbit MQ server for supporting or.",
                    "label": 1
                },
                {
                    "sent": "Sorry Motor is an activity by other application in order to grant the scalability of using our our service.",
                    "label": 1
                },
                {
                    "sent": "And obviously you can also build your own application by downloading the ontology by itself.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Geology has been created within the context of the Trentino Healthcare 4.0 framework.",
                    "label": 1
                },
                {
                    "sent": "That is a long term framework for improving the awareness of healthy behaviors to the citizens, and it is also used and it's going to be extended within other project, both local European and commercial projects.",
                    "label": 0
                },
                {
                    "sent": "So this ecosystem of activities and ontology will grant.",
                    "label": 0
                },
                {
                    "sent": "Long term maintenance of the overall resource.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Question in the future work we are in the process of integrating the USDA database becausw.",
                    "label": 1
                },
                {
                    "sent": "We discovered that there are more basic food that we could that can be integrated into into the into the ontology and we start.",
                    "label": 0
                },
                {
                    "sent": "We started to integrate knowledge about commercial products because during the evaluation of the ontology with the experts we discovered that I mean from the tee box perspective the coverage was judged as complete by the expert, but.",
                    "label": 0
                },
                {
                    "sent": "Within the a box, the amount of knowledge that is asked to be be integrated is very big in or if you want to develop a complete application, then with the experts we are awesome modeling their relationships between chronic diseases, food and activity and with psychologists we are integrating the mindfulness domain within this ontology in order to support the inference of potential.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Shala dietary disorder by by the user.",
                    "label": 0
                },
                {
                    "sent": "So if you want to discuss more details about the ontology and to see how we have integrated into our platform, you can see you can come to our our demo this this evening.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's all for now.",
                    "label": 0
                },
                {
                    "sent": "Thank you, thank you, thank you, thank you.",
                    "label": 0
                },
                {
                    "sent": "Yeah, we have the first question.",
                    "label": 0
                },
                {
                    "sent": "Great talk just before lunch.",
                    "label": 0
                },
                {
                    "sent": "So perfect timing.",
                    "label": 0
                },
                {
                    "sent": "So you mentioned you're taking some unstructured data such as recipes and creating some machine understandable format.",
                    "label": 0
                },
                {
                    "sent": "So how are you doing that?",
                    "label": 0
                },
                {
                    "sent": "Is that through a manual annotation process or do you have some automation and curation process?",
                    "label": 0
                },
                {
                    "sent": "So depending on the resources for example here for.",
                    "label": 0
                },
                {
                    "sent": "Where was OK here these two sources were machine readable with related documentation that allowed to transform those data into the model that we implemented into the ontology.",
                    "label": 0
                },
                {
                    "sent": "So this task was quite easy to perform.",
                    "label": 0
                },
                {
                    "sent": "Instead the definition of.",
                    "label": 0
                },
                {
                    "sent": "The mapping between the ingredients of the recipes.",
                    "label": 0
                },
                {
                    "sent": "And those.",
                    "label": 0
                },
                {
                    "sent": "And individuals that the information started from these databases was performed.",
                    "label": 0
                },
                {
                    "sent": "Manual manually curated OK.",
                    "label": 0
                }
            ]
        }
    }
}