{
    "id": "c3znvipknxclsshncks5wfkst3svj4i7",
    "title": "Feedback mechanisms and systems medicine: Modeling cholesterol homeostasis for drug discovery",
    "info": {
        "author": [
            "Jure Ačimovič, Centre for Functional Genomics and Bio-Chips (CFGBC), Institute of Biochemistry, Faculty of Medicine, University of Ljubljana"
        ],
        "published": "July 21, 2014",
        "recorded": "May 2014",
        "category": [
            "Top->Medicine"
        ]
    },
    "url": "http://videolectures.net/mdo2014_acimovic_drug_discovery/",
    "segmentation": [
        [
            "So we will.",
            "We will be doing modeling cholesterol homeostasis for drug discovery."
        ],
        [
            "So what we will what we did with this with this with this model.",
            "So this is object oriented modeling, so translation from machinery to biomedicine.",
            "And this was done in Dimeola.",
            "This is a program that you have to buy.",
            "So it was first done this, so this is an object oriented modeling and simulation program based on Modelica language and is best known in the engineering industries, but less in systems biology applications.",
            "An advantage of Orient of object oriented modeling is the re usability of general equations.",
            "An model object classes with a user friendly graphical interface.",
            "One can define user specific model objects and libraries handle large dynamic multi domain models and generate simulation rapidly."
        ],
        [
            "So in the case applied also in your practical example, a system biology library of object was generated based on ordinary differential differential equations.",
            "Which correspond to biological pathway entities, and so in this it's better to see it when we see it.",
            "We have different objects that we can combine and then see how they interact.",
            "So demola, like I said, it's not freely available does.",
            "We will use Openmodelica, which is quite good for this kind of work."
        ],
        [
            "So what we will model, we will model cholesterol synthesis pathway.",
            "So if we look on the on the graphics I know how are you familiar with metabolomics with metabolites or especially with cholesterol biosynthesis.",
            "So we have 8 settle consomme.",
            "And then we have this.",
            "So this is the first stage.",
            "The is open read stage and this is very well characterized.",
            "But then when we come to the 1st.",
            "Cyclic.",
            "Cyclic sterile, so this is lanosterol here to cholesterol.",
            "This pathway is not so well understood, it is now.",
            "It is the same now for age.",
            "For centuries I think not for centuries for some decades.",
            "But it's not.",
            "It's not working as it should, so we have to do something about this."
        ],
        [
            "And why we will model this?"
        ],
        [
            "To find some potential targets for cholesterol lowering drugs."
        ],
        [
            "So everybody is familiar with statins.",
            "Yeah OK, so the statins are the only prescribed drugs that lower cholesterol and they act on hydroxymethyl neutering codes, coenzyme reductase.",
            "So at the start of the pathway and we have a lot of different potential targets that we could affect."
        ],
        [
            "And here we have another picture.",
            "So.",
            "So if I go back."
        ],
        [
            "This is more mathematical, or let's say more chemical.",
            "But if you go."
        ],
        [
            "Here we can see what is happening in the cell and how everything interacts.",
            "So we have the same same is here.",
            "So statins work on Hedrox AMJ CR.",
            "So statins were found as secondary metabolites or funky.",
            "And they are potent inhibitors of cholesterol being seen biosynthesis.",
            "So don't eat too much models."
        ],
        [
            "So in this season sees Bio Library specifications of the model specifications that are used in this model.",
            "They are valid only for steady state.",
            "So if I give an example.",
            "This is maybe a rather stupid example, but let's say if you're healthy, you have one steady state.",
            "And then you cut yourself.",
            "And there's bleeding leaking building OK.",
            "So if you would if you wouldn't stop that, what would happen?",
            "You would probably die.",
            "But we have a mechanism, so you get how it's called BECAUSW scan.",
            "You get a scab.",
            "Dress Cap is created and then you don't leak anymore and you could say that you're in another steady state because everything is the same but you have a scar so you are a little bit different.",
            "Just to have a really simple example, OK?",
            "So this model, what this model does is do going from one steady state dynamically to another steady state.",
            "And for this.",
            "No kinetic, no kinetic parameters almost are needed, is just the flux distribution is needed.",
            "This is this was published in the.",
            "In the article that that you should probably that you could read that you have it on the web page.",
            "So we can model changes from one state to state to another, let's say knockout versus wild types."
        ],
        [
            "UPS so this is a expert based simplified mathematical model of cholesterol.",
            "By synthesis it looks like that in dymola or now that we will do in the openmodelica.",
            "So we have green.",
            "We have metabolites.",
            "You see them here, they're not all on this because these are simplified model red.",
            "We have enzymes, yellow blocks.",
            "We have me Renee Orange.",
            "Blocks are enzyme production, blue, blocks are biochemical reactions, and Brown blocks are gene expression control through.",
            "One's transcription factor that regulates this whole cholesterol synthesis pathway."
        ],
        [
            "So if you look at the mathematical background, there's some of some always some equations.",
            "And so we have substance, container model for metabolites inside some murney and some reaction model to describe the reactions and define fluxes, ends, information and degradation and degradation."
        ],
        [
            "So the basic concept of the model.",
            "Again, we have differential equations.",
            "And if you look at the this picture.",
            "We see we have S is substrate.",
            "Then we have yeast enzyme and PS product.",
            "So we have the flux going from this site to the product.",
            "So flex one to flag Zero and all the kinetic parameters from the enzymes enzyme forms enzyme complex with substrate and then releases the product.",
            "OK."
        ],
        [
            "And now we go to hands-on tutorial.",
            "OK.",
            "So first thing we need to do is to go to file at least for Windows users.",
            "for Mac users it's a little different, OK. 5.",
            "Loadlibrary Ann you have to find the CSV or that you had to download OK.",
            "So just select folder.",
            "And then CS Bill should appear and then if you click on the plus.",
            "You get all the building blocks that I was talking about.",
            "OK.",
            "So it's the same colors, so in marinades, yellow metabolite of substance, this is the same, and so on.",
            "OK, so now we can construct a new model so file.",
            "Numerical class no.",
            "You qualities.",
            "Just want to look at.",
            "My name yeah, we have to write the name, so let's say a base.",
            "What basic?",
            "Model.",
            "And 1st is good, first is good to go and select view gridlines.",
            "Because when we construct a model, it's good to have it nicely oriented oriented, because if it's a lot of building blocks then you lose everything.",
            "You don't know where you are anymore.",
            "OK, so if you remember.",
            "File.",
            "New Modelica class and that's it, just give it a name, basic model or something OK, and then we have view and gridlines.",
            "Yeah.",
            "OK.",
            "So he would like to construct this simple this simple model.",
            "So, but we have to be really careful we have.",
            "So first we need a source.",
            "So a flux.",
            "OK, so this is the blue triangle, not source two or source three, but source just source.",
            "And we just position it somewhere.",
            "And then we need a metabolite.",
            "So it's simple to build a network.",
            "Just take a building block, but you need.",
            "You need to know which building block block to take.",
            "OK, and then we need to connect it so.",
            "Here and here.",
            "Yeah.",
            "OK. And it's good that we write if we click on the metabolite.",
            "I don't know if you clicked with the right button on the metabolite attributes.",
            "So we can write right instead of metabolite one, we have substrate.",
            "So it's OK. And then we need one more metabolite that will be somewhere here.",
            "That would be the product apps.",
            "And then we need a S reaction, the blue one not again, not number two or three, just a as a reaction in the middle.",
            "And then we need the ME formation nonlinear, so this one.",
            "There are two informations blocks.",
            "Yes.",
            "There is a problem.",
            "Yeah, if it's something wrong, just just ask a question.",
            "It's not a problem.",
            "And this information we have to also oriented in the right direction, so that's simple.",
            "Rotate clockwise.",
            "Nope.",
            "Rotate anticlockwise one more time.",
            "Input output.",
            "So we need input and output.",
            "And then we have the information leaner.",
            "We have the enzyme.",
            "That will it rotate again.",
            "And the M RNA.",
            "And we need also.",
            "In elimination, so the outflux.",
            "An elimination.",
            "Now you see why I did the grid line to have everything in the same line, we need to connect all of these properties that I showed before the model.",
            "You have to connect all the enzymes with the substrate how it's going to react, which with each other.",
            "What the end time is the red.",
            "The end time is the red.",
            "So the yellow is the me Renee.",
            "The red is enzyme and the green are metabolites, so the product and the substrate.",
            "These are the connecting points to control the flux, how its cows controlling from the marinatto the enzyme here and how this is the complex of enzyme and substrate.",
            "I have everything connected.",
            "How about you?",
            "Not yet.",
            "So explain again what is connected.",
            "Except so out so so we have.",
            "The input has to be connected over the end time.",
            "And then end time is connected to the end time.",
            "Metabolite story metabolite and then the metabolite.",
            "So this is the substrate.",
            "It's connected to the to the.",
            "Complex of enzyme and and and substrate.",
            "And.",
            "How the end?",
            "So this is how the flags go, how the enzyme is converting substrate to product.",
            "But then this is controlled via enzyme.",
            "We are in some activity.",
            "An enzyme is controlled.",
            "How usually by Ameren expression we have a large or large gap in between, but let's say it's like that, so more me, Renee.",
            "Usually you have more anti man more activity.",
            "So.",
            "Everybody did it yet yeah, so then we can try it.",
            "You can.",
            "Check the model.",
            "And then you can hear on simulation simulate.",
            "And then you get another window for plotting.",
            "So.",
            "So I don't know how to make the geometry of his life proper to make the lines up or down, since like you, so I will.",
            "I will delete this.",
            "And and do it one more time, so from this.",
            "You get a plus if you are at the add a note.",
            "OK then you click.",
            "And then you drag.",
            "You see what does it do?",
            "Just go to.",
            "This one.",
            "And click on it.",
            "And now it's connected.",
            "And if I would like to go from this side again, click OK.",
            "It doesn't.",
            "It doesn't do it nicely, you see.",
            "So then I go down.",
            "Click again.",
            "Just be.",
            "Seems to be important because it didn't work for me and my your case looks like a mess.",
            "Yeah, but you can imagine that this is a simple model.",
            "If you have a mass, no problem, but you have a bigger model.",
            "It's a big problem, OK?",
            "And now everybody should go to simulation.",
            "If you have it and simulate.",
            "And you can close this window afterwards.",
            "So on this right side you see all that you have put into the model.",
            "So information enzyme as reaction.",
            "So this is the complex.",
            "Amy Renee.",
            "Elimination product and source OK. And then if you go to plus four the end time.",
            "We have Q, so this is the quantity and the concentration.",
            "And we have to put here.",
            "We have to take it.",
            "If we take it then we will see it on the window.",
            "We will see the concentration of the of the enzyme, so it's one.",
            "And then we have the M RNA.",
            "We also take it.",
            "Product and the substrate.",
            "So on the upper thing you would see different colors or enzyme.",
            "For me at least, I have it read me Renee.",
            "It's blue product.",
            "It's green and substrate is light blue.",
            "Yeah.",
            "OK, so this is now a steady state.",
            "Everything is set to one, so everything should be one.",
            "And now we can play a little bit with the model.",
            "But it's probably much easier than to play here inside because you have a lot of different fluxes and everything we can go back to modeling.",
            "And the first thing is for the simulation simulation set up start time at zero and Stop Time is one we have to change this to 1000.",
            "Here, here.",
            "Cancel so here we are on plotting you see here.",
            "And modeling.",
            "So simulation.",
            "Simulation setup.",
            "It was probably one.",
            "Everybody had it so you have to put here in 1000.",
            "Everybody can see it.",
            "It's large enough to know.",
            "OK, and then we can do it cancel.",
            "We have 1000 now and now we can change.",
            "We can play a little bit so if we change me Renee.",
            "We can just.",
            "Click on the M RNA.",
            "So we have the quantity at the starting point at the time zero, it's one.",
            "Change it to change, change it to 10.",
            "And then.",
            "Simulate.",
            "You should get this.",
            "Yeah.",
            "It is too fast or.",
            "Everybody got it.",
            "So now you can see that the product because the the end product stays the same at the value one.",
            "Yeah.",
            "So we have changed the amerinet so it was it is 10.",
            "Yeah, and it's all the time and it's all the time that N becausw.",
            "It's the starting of 1 branch.",
            "And what happened to the enzyme?",
            "It increased.",
            "By 10 that's normal.",
            "After a while, if it's more Amy Renee, you get more enzyme activity.",
            "Actually with the enzyme.",
            "Also, activity increases and what happened to the substrate it went down.",
            "Because the.",
            "We have more enzyme activity.",
            "More substrate is used, so once again this is the dynamical thing.",
            "What happens from one steady state with everything is the same to another steady state with something when something changed.",
            "OK. OK, we can go back and play what play with something else so we can put the Emera neilly emerin level back.",
            "So.",
            "Back to one.",
            "And we can change the end sign.",
            "So 10.",
            "And again.",
            "Simulate.",
            "So here we see the end time was at the starting point was 10, but then it went down.",
            "Why?",
            "Because it was used, but the Ameren level is at once, so at one steady state it came the end time to also to the Level 1.",
            "Yeah.",
            "And again, the product is fixed at one.",
            "Because everything thanks to the tenants to the product, but the subset wait up.",
            "Change.",
            "At the beginning.",
            "Yep.",
            "So you click on the symbol.",
            "Now we have changed the enzyme.",
            "And in the end, the amount of enzyme here in this simple model is the activity of enzyme.",
            "If it's more enzyme, the bigger activity.",
            "But enzyme has a back door, so it's far from me.",
            "Renee and a marinate still at level one, so.",
            "Because that's a red line, yes.",
            "Over the entire company, this yes, and this is and this is so this time is.",
            "These are arbitrary time units because if we have kinetic parameters then we will have a real time.",
            "But now it's just arbitrary units.",
            "OK.",
            "So we can go back again, put it back attributes.",
            "The one.",
            "And then we can change the product.",
            "Yeah, we changed back to the starting point everything.",
            "And now we can change the product.",
            "Also the temp.",
            "An simulate.",
            "So the product doesn't because there is no, we don't have a feedback loop.",
            "So it doesn't change nothing, just the product stays attend.",
            "But now more interesting, we go back again.",
            "We put the product again back to one.",
            "So at time one as I'm zero, it's one and now we can play with the enzyme so.",
            "This is a simple model yet now.",
            "But if you have.",
            "Because you make these reactions irreversible somehow, exactly yes.",
            "Yes, that's where it's going in that direction.",
            "And now if you look at the parameters for the end time, so we have the starting concentration, we have K1K one is the elimination constant and K2 is the constant that changes K1.",
            "Well, I didn't do the model like that.",
            "This was what Alex did, but this is what does it mean and switch time means the time when when the when this K2 influences the K1.",
            "So let's say if you starting point is 0 and we have a 1001 thousand units and if you change it after 1010 units then something will change because the K1 will change because of K2.",
            "How to play?",
            "What happens with the enzyme?",
            "This is like you if you put a drug.",
            "Let's say you can change.",
            "You actually change the K1 activity.",
            "So the basic is 0.01 and we can change the K2 to.",
            "0.02 So the so with this, so this is the elimination constant.",
            "So the elimination is.",
            "Twice the faster yeah.",
            "OK and then simulate.",
            "So is it something you expected?",
            "What happened?",
            "So again, the the product.",
            "Is fixed.",
            "The end time went down because the degradation was faster and it went and it went down.",
            "How much if you look if we zoom in here we will say it's 0.5.",
            "Twice.",
            "And if you want to go back if we zoom in it's fit in view.",
            "And the substrate had to go twice up.",
            "Yeah, it makes sense.",
            "OK. And then we can try it with go back to modeling.",
            "Will enzyme.",
            "So before it was 0.01, now we can put 0.005.",
            "So now the degradation is twice the slower as in the beginning.",
            "Let's simulate.",
            "And now we get the different picture.",
            "So the enzyme went up twice and the substrate went twice down.",
            "Yeah.",
            "But everything else stayed the same, cause the goal of this simple model is to make the substrate and state at one.",
            "And now we can try.",
            "We can try.",
            "K1 let me see.",
            "Here.",
            "Back to the inside.",
            "So before it was 0.01.",
            "So if you put 0.1, what would you?",
            "What would be?",
            "What do you expect?",
            "It was 0.01 and now it's 10 times more.",
            "We get 10 times more.",
            "In both directions.",
            "But and tell us where K1 where you would write K1 in this team.",
            "Could you talk about the elimination, yeah.",
            "I don't know which one it is.",
            "It's here in illumination of the complex.",
            "This.",
            "So that's basically the reaction from C2 E. Yeah.",
            "And now we can try to really really lower the elimination.",
            "So we're still at the end time we put it 0.00.",
            "1.",
            "And simulate.",
            "So everybody got this.",
            "Yep.",
            "Do you see something wrong with this?",
            "No.",
            "So what what did I say that this this?",
            "Model does goes from 1.",
            "Steady state to another steady state.",
            "Take a little off.",
            "Yeah, the time is too short.",
            "So we can go back to the model and simulation step.",
            "We have to put not 1000 but 10,000.",
            "It takes more time to come to the steady state, but eventually we come to a steady state.",
            "Yeah.",
            "OK, you had you.",
            "I said that you have to look at the scheme of cholesterol biosynthesis.",
            "Everybody looked at that.",
            "Yeah, it looks a little bit complex.",
            "I could say that try to to make a model, but it will take a lot of time.",
            "So.",
            "We can open.",
            "A new model that I gave that I gave to you.",
            "So open.",
            "Model.",
            "And you have to find this.",
            "Cholesterol that.",
            "I put it on a USB stick, yeah?",
            "Open.",
            "And you have to go back if you are in this window you have to go to modeling.",
            "Still the same one, so you have to go here on the left.",
            "You have the cholesterol.",
            "OK you have to click on it.",
            "This looks a little bit different, doesn't it?",
            "Really will more complex now you see why everything has to be really nicely oriented, otherwise you would not know.",
            "And you can see if you if you click on an enzyme.",
            "I'm at my tablet.",
            "Yes, sorry.",
            "Attributes so you have a special.",
            "Metabolite.",
            "So now this is a full cholesterol synthesis pathway.",
            "And I was talking before about statins.",
            "Yeah.",
            "So statins block which enzyme?",
            "Yeah yeah, can you find it?",
            "Where should it be?",
            "End times are red.",
            "And it should be somewhere at the beginning.",
            "Actually, it's getting the first one.",
            "Yeah, you found it.",
            "This one is the first one is.",
            "And if you click on it.",
            "So we have again we have the starting at zero.",
            "It's one K1 is 0.0, one K2.",
            "It's nothing.",
            "Switch time is nothing, yeah?",
            "OK, if you simulate this you will get a release.",
            "Silly thing so simulate.",
            "And delete this results from the basic model.",
            "And again here we have to you see a lot of different.",
            "All the air marinades formation and times everything is in so we have to look for cholesterol.",
            "Music.",
            "Cholesterol and again take the quantity.",
            "Company steamer.",
            "Haha.",
            "Just a moment in time.",
            "OK, just to check it.",
            "Nothing.",
            "Hahaha.",
            "But I'm scared that I'm scared.",
            "Yeah, it's actually nothing.",
            "Yeah, the times one time scale 10,000.",
            "We always can adjust it, yes, so modeling simulation simulation setup, we can have it then.",
            "But this is everything is 1, but it's just switching because of the model.",
            "So actually this is one you have to have a large scale to see it.",
            "So now the best thing would be so.",
            "How to model that drug?",
            "Targets the.",
            "Rather place.",
            "We have to.",
            "We have to put a big value to the K2 constant so the degradation is.",
            "Faster.",
            "Is the same as you would put the drug, yeah.",
            "So.",
            "We go back to the model.",
            "Simulation setup 10,000 will be OK.",
            "So we have K1.",
            "We will put K2A value here.",
            "Let's say 2.",
            "So this means that degradation will be will be quicker like we would put a drug.",
            "Into our system, yeah.",
            "But now we put the switch time to 1000.",
            "So what does the what does it mean?",
            "Does this mean that for 1000 units of time, everything will be?",
            "At one and 0.01 and then.",
            "K1 will.",
            "The elimination will become much bigger because of K2 from the time of 1000.",
            "OK. And simulate.",
            "Yeah, so we see switch time is at 1000.",
            "And cholesterol went down.",
            "Like statins work.",
            "Yeah.",
            "And we can look at all of the other.",
            "All of the other.",
            "Sterile is what is happening, so we have to find, let's say, lanosterol.",
            "Anne.",
            "Woo Hoo Hoo.",
            "Troll, huh?",
            "No.",
            "Piazza hydroxy dehydro lower lower than is defined.",
            "It's not like that is it now.",
            "It's not that they bottom out here.",
            "It also went down.",
            "And this is this is actually what we came to.",
            "This model that we had experimental data and we were learning on this experimental data.",
            "And also how how the pathway is constructed and we got the same results as in vivo.",
            "Yeah.",
            "OK, now we can play a little bit different.",
            "That did different stuff."
        ],
        [
            "So.",
            "I know if everybody and anybody is familiar with Smith Lemli Opitz syndrome.",
            "Just one so this is SLOS.",
            "So again, we so this is the same pathway as we have it constructed in the in the openmodelica.",
            "But just it's much easier from this to see, isn't it?",
            "So that what happens in the SLAS patient is that they have a inborn error of cholesterol synthesis because of seven day hydro cholesterol reductase deficiency.",
            "So this is an important error, so this enzyme is not functional.",
            "So what would you expect?",
            "If this enzyme doesn't work.",
            "Nope.",
            "Seven day Hydra cholesterol.",
            "Yeah, now we can try this.",
            "In our model.",
            "OK.",
            "So we first we have to also let's leave lanosterol, but we have to find the hydro cholesterol.",
            "They hide out.",
            "You found it.",
            "Now we have to go back to modeling.",
            "And change the parameters for the statins.",
            "So this was zero.",
            "This was zero.",
            "Yeah.",
            "An it's easier now.",
            "It's easier if you have such a big model.",
            "It's much easier to go to plotting.",
            "And find the DH 7 enzyme so.",
            "Mama.",
            "American man.",
            "Here.",
            "Found it.",
            "OK, so we do the same.",
            "OK too, it's already said that's why you delete it.",
            "Actually, it was already said that it should be one was before.",
            "0.",
            "Well.",
            "So it was two.",
            "1000 and here we can go up.",
            "Canary simulate and actually what we get is 7 dehydrocholesterol is.",
            "Much higher and cholesterol.",
            "Is much lower.",
            "Yeah.",
            "And now the construction already of this model was really tough.",
            "But now if you would like to see what if you would target one end time or another inside, what would happen with cholesterol biosynthesis, what would what would happen to cholesterol?",
            "Yeah.",
            "I'm just trying to show you how this model is usable and it's not, so this is the model of cholesterol biosynthesis, but the building blocks are the same for any kind of network.",
            "But unfortunately it's not the clean yet and everything but everybody can use it OK."
        ],
        [
            "So this model predicts novel branches from the cholesterol synthesis pathway, so we had a hypothesis that cholesterol synthesis intermediates are in the studied animal systems, so these were mice.",
            "Cream knockout scream.",
            "It's one transcription factor that affects the coolest organic jeans.",
            "And.",
            "So in the model you can put in all the numbers, but it's not user friendly because then you have to go into the model, look at each.",
            "Ameren a, let's say that you have measured a marinades of different of different of different genes and also measure the metabolite levels.",
            "You put everything in, and it doesn't come together with this kind of pathway, that is, that is in the keg.",
            "So something is missing and there are a lot of publications.",
            "Let's say 4.",
            "Sleep 11A1 so this is an enzyme that is used that is, the function is to.",
            "To make violates bile acids, but it was shown in some studies that it can directly convert 70 Hydra cholesterol.",
            "So this is 1 branch.",
            "That is actually already described somewhere in the literature, but with all the measured marinades and and metabolites we couldn't, we couldn't construct with this model.",
            "We couldn't say that this is functioning, so we came up with four different elimination pathways, which we still need to confirm experimentally.",
            "This was the output.",
            "So you can see, at least for the cholesterol synthesis pathway, that we that we constructed.",
            "So for Staten, it's functioning for some different wild types and knockouts.",
            "But for this it doesn't function.",
            "So there are some branches that are maybe turned on when something is wrong.",
            "That are usually not working because we can.",
            "We can see here we have a flux.",
            "Yeah phloxine and flux out and I usually explain this as a pipeline.",
            "Yeah.",
            "So the flux has to go somewhere around and comes to the cholesterol.",
            "So if you turn 1 pipe off.",
            "It has to go somewhere else around.",
            "If it doesn't know what will happen with the pipes.",
            "So if an Organism doesn't die that nothing doesn't happen, there has to be some branching points that are turned on when something is wrong.",
            "Yeah.",
            "OK."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we will.",
                    "label": 0
                },
                {
                    "sent": "We will be doing modeling cholesterol homeostasis for drug discovery.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what we will what we did with this with this with this model.",
                    "label": 0
                },
                {
                    "sent": "So this is object oriented modeling, so translation from machinery to biomedicine.",
                    "label": 1
                },
                {
                    "sent": "And this was done in Dimeola.",
                    "label": 0
                },
                {
                    "sent": "This is a program that you have to buy.",
                    "label": 0
                },
                {
                    "sent": "So it was first done this, so this is an object oriented modeling and simulation program based on Modelica language and is best known in the engineering industries, but less in systems biology applications.",
                    "label": 1
                },
                {
                    "sent": "An advantage of Orient of object oriented modeling is the re usability of general equations.",
                    "label": 1
                },
                {
                    "sent": "An model object classes with a user friendly graphical interface.",
                    "label": 1
                },
                {
                    "sent": "One can define user specific model objects and libraries handle large dynamic multi domain models and generate simulation rapidly.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in the case applied also in your practical example, a system biology library of object was generated based on ordinary differential differential equations.",
                    "label": 1
                },
                {
                    "sent": "Which correspond to biological pathway entities, and so in this it's better to see it when we see it.",
                    "label": 0
                },
                {
                    "sent": "We have different objects that we can combine and then see how they interact.",
                    "label": 1
                },
                {
                    "sent": "So demola, like I said, it's not freely available does.",
                    "label": 0
                },
                {
                    "sent": "We will use Openmodelica, which is quite good for this kind of work.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what we will model, we will model cholesterol synthesis pathway.",
                    "label": 0
                },
                {
                    "sent": "So if we look on the on the graphics I know how are you familiar with metabolomics with metabolites or especially with cholesterol biosynthesis.",
                    "label": 0
                },
                {
                    "sent": "So we have 8 settle consomme.",
                    "label": 0
                },
                {
                    "sent": "And then we have this.",
                    "label": 0
                },
                {
                    "sent": "So this is the first stage.",
                    "label": 0
                },
                {
                    "sent": "The is open read stage and this is very well characterized.",
                    "label": 0
                },
                {
                    "sent": "But then when we come to the 1st.",
                    "label": 0
                },
                {
                    "sent": "Cyclic.",
                    "label": 0
                },
                {
                    "sent": "Cyclic sterile, so this is lanosterol here to cholesterol.",
                    "label": 0
                },
                {
                    "sent": "This pathway is not so well understood, it is now.",
                    "label": 0
                },
                {
                    "sent": "It is the same now for age.",
                    "label": 0
                },
                {
                    "sent": "For centuries I think not for centuries for some decades.",
                    "label": 0
                },
                {
                    "sent": "But it's not.",
                    "label": 0
                },
                {
                    "sent": "It's not working as it should, so we have to do something about this.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And why we will model this?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To find some potential targets for cholesterol lowering drugs.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So everybody is familiar with statins.",
                    "label": 0
                },
                {
                    "sent": "Yeah OK, so the statins are the only prescribed drugs that lower cholesterol and they act on hydroxymethyl neutering codes, coenzyme reductase.",
                    "label": 0
                },
                {
                    "sent": "So at the start of the pathway and we have a lot of different potential targets that we could affect.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here we have another picture.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So if I go back.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is more mathematical, or let's say more chemical.",
                    "label": 0
                },
                {
                    "sent": "But if you go.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here we can see what is happening in the cell and how everything interacts.",
                    "label": 0
                },
                {
                    "sent": "So we have the same same is here.",
                    "label": 0
                },
                {
                    "sent": "So statins work on Hedrox AMJ CR.",
                    "label": 0
                },
                {
                    "sent": "So statins were found as secondary metabolites or funky.",
                    "label": 0
                },
                {
                    "sent": "And they are potent inhibitors of cholesterol being seen biosynthesis.",
                    "label": 1
                },
                {
                    "sent": "So don't eat too much models.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in this season sees Bio Library specifications of the model specifications that are used in this model.",
                    "label": 0
                },
                {
                    "sent": "They are valid only for steady state.",
                    "label": 1
                },
                {
                    "sent": "So if I give an example.",
                    "label": 0
                },
                {
                    "sent": "This is maybe a rather stupid example, but let's say if you're healthy, you have one steady state.",
                    "label": 1
                },
                {
                    "sent": "And then you cut yourself.",
                    "label": 0
                },
                {
                    "sent": "And there's bleeding leaking building OK.",
                    "label": 0
                },
                {
                    "sent": "So if you would if you wouldn't stop that, what would happen?",
                    "label": 0
                },
                {
                    "sent": "You would probably die.",
                    "label": 0
                },
                {
                    "sent": "But we have a mechanism, so you get how it's called BECAUSW scan.",
                    "label": 0
                },
                {
                    "sent": "You get a scab.",
                    "label": 1
                },
                {
                    "sent": "Dress Cap is created and then you don't leak anymore and you could say that you're in another steady state because everything is the same but you have a scar so you are a little bit different.",
                    "label": 0
                },
                {
                    "sent": "Just to have a really simple example, OK?",
                    "label": 0
                },
                {
                    "sent": "So this model, what this model does is do going from one steady state dynamically to another steady state.",
                    "label": 0
                },
                {
                    "sent": "And for this.",
                    "label": 0
                },
                {
                    "sent": "No kinetic, no kinetic parameters almost are needed, is just the flux distribution is needed.",
                    "label": 0
                },
                {
                    "sent": "This is this was published in the.",
                    "label": 0
                },
                {
                    "sent": "In the article that that you should probably that you could read that you have it on the web page.",
                    "label": 0
                },
                {
                    "sent": "So we can model changes from one state to state to another, let's say knockout versus wild types.",
                    "label": 1
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "UPS so this is a expert based simplified mathematical model of cholesterol.",
                    "label": 1
                },
                {
                    "sent": "By synthesis it looks like that in dymola or now that we will do in the openmodelica.",
                    "label": 0
                },
                {
                    "sent": "So we have green.",
                    "label": 0
                },
                {
                    "sent": "We have metabolites.",
                    "label": 0
                },
                {
                    "sent": "You see them here, they're not all on this because these are simplified model red.",
                    "label": 1
                },
                {
                    "sent": "We have enzymes, yellow blocks.",
                    "label": 0
                },
                {
                    "sent": "We have me Renee Orange.",
                    "label": 0
                },
                {
                    "sent": "Blocks are enzyme production, blue, blocks are biochemical reactions, and Brown blocks are gene expression control through.",
                    "label": 1
                },
                {
                    "sent": "One's transcription factor that regulates this whole cholesterol synthesis pathway.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if you look at the mathematical background, there's some of some always some equations.",
                    "label": 0
                },
                {
                    "sent": "And so we have substance, container model for metabolites inside some murney and some reaction model to describe the reactions and define fluxes, ends, information and degradation and degradation.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the basic concept of the model.",
                    "label": 0
                },
                {
                    "sent": "Again, we have differential equations.",
                    "label": 0
                },
                {
                    "sent": "And if you look at the this picture.",
                    "label": 0
                },
                {
                    "sent": "We see we have S is substrate.",
                    "label": 0
                },
                {
                    "sent": "Then we have yeast enzyme and PS product.",
                    "label": 0
                },
                {
                    "sent": "So we have the flux going from this site to the product.",
                    "label": 0
                },
                {
                    "sent": "So flex one to flag Zero and all the kinetic parameters from the enzymes enzyme forms enzyme complex with substrate and then releases the product.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And now we go to hands-on tutorial.",
                    "label": 1
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So first thing we need to do is to go to file at least for Windows users.",
                    "label": 0
                },
                {
                    "sent": "for Mac users it's a little different, OK. 5.",
                    "label": 0
                },
                {
                    "sent": "Loadlibrary Ann you have to find the CSV or that you had to download OK.",
                    "label": 0
                },
                {
                    "sent": "So just select folder.",
                    "label": 0
                },
                {
                    "sent": "And then CS Bill should appear and then if you click on the plus.",
                    "label": 0
                },
                {
                    "sent": "You get all the building blocks that I was talking about.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So it's the same colors, so in marinades, yellow metabolite of substance, this is the same, and so on.",
                    "label": 0
                },
                {
                    "sent": "OK, so now we can construct a new model so file.",
                    "label": 0
                },
                {
                    "sent": "Numerical class no.",
                    "label": 0
                },
                {
                    "sent": "You qualities.",
                    "label": 0
                },
                {
                    "sent": "Just want to look at.",
                    "label": 0
                },
                {
                    "sent": "My name yeah, we have to write the name, so let's say a base.",
                    "label": 0
                },
                {
                    "sent": "What basic?",
                    "label": 0
                },
                {
                    "sent": "Model.",
                    "label": 0
                },
                {
                    "sent": "And 1st is good, first is good to go and select view gridlines.",
                    "label": 0
                },
                {
                    "sent": "Because when we construct a model, it's good to have it nicely oriented oriented, because if it's a lot of building blocks then you lose everything.",
                    "label": 0
                },
                {
                    "sent": "You don't know where you are anymore.",
                    "label": 0
                },
                {
                    "sent": "OK, so if you remember.",
                    "label": 0
                },
                {
                    "sent": "File.",
                    "label": 0
                },
                {
                    "sent": "New Modelica class and that's it, just give it a name, basic model or something OK, and then we have view and gridlines.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So he would like to construct this simple this simple model.",
                    "label": 0
                },
                {
                    "sent": "So, but we have to be really careful we have.",
                    "label": 0
                },
                {
                    "sent": "So first we need a source.",
                    "label": 0
                },
                {
                    "sent": "So a flux.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is the blue triangle, not source two or source three, but source just source.",
                    "label": 0
                },
                {
                    "sent": "And we just position it somewhere.",
                    "label": 0
                },
                {
                    "sent": "And then we need a metabolite.",
                    "label": 0
                },
                {
                    "sent": "So it's simple to build a network.",
                    "label": 0
                },
                {
                    "sent": "Just take a building block, but you need.",
                    "label": 0
                },
                {
                    "sent": "You need to know which building block block to take.",
                    "label": 0
                },
                {
                    "sent": "OK, and then we need to connect it so.",
                    "label": 0
                },
                {
                    "sent": "Here and here.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "OK. And it's good that we write if we click on the metabolite.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you clicked with the right button on the metabolite attributes.",
                    "label": 0
                },
                {
                    "sent": "So we can write right instead of metabolite one, we have substrate.",
                    "label": 0
                },
                {
                    "sent": "So it's OK. And then we need one more metabolite that will be somewhere here.",
                    "label": 0
                },
                {
                    "sent": "That would be the product apps.",
                    "label": 0
                },
                {
                    "sent": "And then we need a S reaction, the blue one not again, not number two or three, just a as a reaction in the middle.",
                    "label": 0
                },
                {
                    "sent": "And then we need the ME formation nonlinear, so this one.",
                    "label": 0
                },
                {
                    "sent": "There are two informations blocks.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "There is a problem.",
                    "label": 0
                },
                {
                    "sent": "Yeah, if it's something wrong, just just ask a question.",
                    "label": 0
                },
                {
                    "sent": "It's not a problem.",
                    "label": 0
                },
                {
                    "sent": "And this information we have to also oriented in the right direction, so that's simple.",
                    "label": 0
                },
                {
                    "sent": "Rotate clockwise.",
                    "label": 0
                },
                {
                    "sent": "Nope.",
                    "label": 0
                },
                {
                    "sent": "Rotate anticlockwise one more time.",
                    "label": 0
                },
                {
                    "sent": "Input output.",
                    "label": 0
                },
                {
                    "sent": "So we need input and output.",
                    "label": 0
                },
                {
                    "sent": "And then we have the information leaner.",
                    "label": 0
                },
                {
                    "sent": "We have the enzyme.",
                    "label": 0
                },
                {
                    "sent": "That will it rotate again.",
                    "label": 0
                },
                {
                    "sent": "And the M RNA.",
                    "label": 0
                },
                {
                    "sent": "And we need also.",
                    "label": 0
                },
                {
                    "sent": "In elimination, so the outflux.",
                    "label": 0
                },
                {
                    "sent": "An elimination.",
                    "label": 0
                },
                {
                    "sent": "Now you see why I did the grid line to have everything in the same line, we need to connect all of these properties that I showed before the model.",
                    "label": 0
                },
                {
                    "sent": "You have to connect all the enzymes with the substrate how it's going to react, which with each other.",
                    "label": 0
                },
                {
                    "sent": "What the end time is the red.",
                    "label": 0
                },
                {
                    "sent": "The end time is the red.",
                    "label": 0
                },
                {
                    "sent": "So the yellow is the me Renee.",
                    "label": 0
                },
                {
                    "sent": "The red is enzyme and the green are metabolites, so the product and the substrate.",
                    "label": 0
                },
                {
                    "sent": "These are the connecting points to control the flux, how its cows controlling from the marinatto the enzyme here and how this is the complex of enzyme and substrate.",
                    "label": 0
                },
                {
                    "sent": "I have everything connected.",
                    "label": 0
                },
                {
                    "sent": "How about you?",
                    "label": 0
                },
                {
                    "sent": "Not yet.",
                    "label": 0
                },
                {
                    "sent": "So explain again what is connected.",
                    "label": 0
                },
                {
                    "sent": "Except so out so so we have.",
                    "label": 0
                },
                {
                    "sent": "The input has to be connected over the end time.",
                    "label": 0
                },
                {
                    "sent": "And then end time is connected to the end time.",
                    "label": 0
                },
                {
                    "sent": "Metabolite story metabolite and then the metabolite.",
                    "label": 0
                },
                {
                    "sent": "So this is the substrate.",
                    "label": 0
                },
                {
                    "sent": "It's connected to the to the.",
                    "label": 0
                },
                {
                    "sent": "Complex of enzyme and and and substrate.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "How the end?",
                    "label": 0
                },
                {
                    "sent": "So this is how the flags go, how the enzyme is converting substrate to product.",
                    "label": 0
                },
                {
                    "sent": "But then this is controlled via enzyme.",
                    "label": 0
                },
                {
                    "sent": "We are in some activity.",
                    "label": 0
                },
                {
                    "sent": "An enzyme is controlled.",
                    "label": 0
                },
                {
                    "sent": "How usually by Ameren expression we have a large or large gap in between, but let's say it's like that, so more me, Renee.",
                    "label": 0
                },
                {
                    "sent": "Usually you have more anti man more activity.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Everybody did it yet yeah, so then we can try it.",
                    "label": 0
                },
                {
                    "sent": "You can.",
                    "label": 0
                },
                {
                    "sent": "Check the model.",
                    "label": 0
                },
                {
                    "sent": "And then you can hear on simulation simulate.",
                    "label": 0
                },
                {
                    "sent": "And then you get another window for plotting.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So I don't know how to make the geometry of his life proper to make the lines up or down, since like you, so I will.",
                    "label": 0
                },
                {
                    "sent": "I will delete this.",
                    "label": 0
                },
                {
                    "sent": "And and do it one more time, so from this.",
                    "label": 0
                },
                {
                    "sent": "You get a plus if you are at the add a note.",
                    "label": 0
                },
                {
                    "sent": "OK then you click.",
                    "label": 0
                },
                {
                    "sent": "And then you drag.",
                    "label": 0
                },
                {
                    "sent": "You see what does it do?",
                    "label": 0
                },
                {
                    "sent": "Just go to.",
                    "label": 0
                },
                {
                    "sent": "This one.",
                    "label": 0
                },
                {
                    "sent": "And click on it.",
                    "label": 0
                },
                {
                    "sent": "And now it's connected.",
                    "label": 0
                },
                {
                    "sent": "And if I would like to go from this side again, click OK.",
                    "label": 0
                },
                {
                    "sent": "It doesn't.",
                    "label": 0
                },
                {
                    "sent": "It doesn't do it nicely, you see.",
                    "label": 0
                },
                {
                    "sent": "So then I go down.",
                    "label": 0
                },
                {
                    "sent": "Click again.",
                    "label": 0
                },
                {
                    "sent": "Just be.",
                    "label": 0
                },
                {
                    "sent": "Seems to be important because it didn't work for me and my your case looks like a mess.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but you can imagine that this is a simple model.",
                    "label": 0
                },
                {
                    "sent": "If you have a mass, no problem, but you have a bigger model.",
                    "label": 0
                },
                {
                    "sent": "It's a big problem, OK?",
                    "label": 0
                },
                {
                    "sent": "And now everybody should go to simulation.",
                    "label": 0
                },
                {
                    "sent": "If you have it and simulate.",
                    "label": 0
                },
                {
                    "sent": "And you can close this window afterwards.",
                    "label": 0
                },
                {
                    "sent": "So on this right side you see all that you have put into the model.",
                    "label": 0
                },
                {
                    "sent": "So information enzyme as reaction.",
                    "label": 0
                },
                {
                    "sent": "So this is the complex.",
                    "label": 0
                },
                {
                    "sent": "Amy Renee.",
                    "label": 0
                },
                {
                    "sent": "Elimination product and source OK. And then if you go to plus four the end time.",
                    "label": 0
                },
                {
                    "sent": "We have Q, so this is the quantity and the concentration.",
                    "label": 0
                },
                {
                    "sent": "And we have to put here.",
                    "label": 0
                },
                {
                    "sent": "We have to take it.",
                    "label": 0
                },
                {
                    "sent": "If we take it then we will see it on the window.",
                    "label": 0
                },
                {
                    "sent": "We will see the concentration of the of the enzyme, so it's one.",
                    "label": 0
                },
                {
                    "sent": "And then we have the M RNA.",
                    "label": 0
                },
                {
                    "sent": "We also take it.",
                    "label": 0
                },
                {
                    "sent": "Product and the substrate.",
                    "label": 0
                },
                {
                    "sent": "So on the upper thing you would see different colors or enzyme.",
                    "label": 0
                },
                {
                    "sent": "For me at least, I have it read me Renee.",
                    "label": 0
                },
                {
                    "sent": "It's blue product.",
                    "label": 0
                },
                {
                    "sent": "It's green and substrate is light blue.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is now a steady state.",
                    "label": 0
                },
                {
                    "sent": "Everything is set to one, so everything should be one.",
                    "label": 0
                },
                {
                    "sent": "And now we can play a little bit with the model.",
                    "label": 0
                },
                {
                    "sent": "But it's probably much easier than to play here inside because you have a lot of different fluxes and everything we can go back to modeling.",
                    "label": 0
                },
                {
                    "sent": "And the first thing is for the simulation simulation set up start time at zero and Stop Time is one we have to change this to 1000.",
                    "label": 0
                },
                {
                    "sent": "Here, here.",
                    "label": 0
                },
                {
                    "sent": "Cancel so here we are on plotting you see here.",
                    "label": 0
                },
                {
                    "sent": "And modeling.",
                    "label": 0
                },
                {
                    "sent": "So simulation.",
                    "label": 0
                },
                {
                    "sent": "Simulation setup.",
                    "label": 0
                },
                {
                    "sent": "It was probably one.",
                    "label": 0
                },
                {
                    "sent": "Everybody had it so you have to put here in 1000.",
                    "label": 0
                },
                {
                    "sent": "Everybody can see it.",
                    "label": 0
                },
                {
                    "sent": "It's large enough to know.",
                    "label": 0
                },
                {
                    "sent": "OK, and then we can do it cancel.",
                    "label": 0
                },
                {
                    "sent": "We have 1000 now and now we can change.",
                    "label": 0
                },
                {
                    "sent": "We can play a little bit so if we change me Renee.",
                    "label": 0
                },
                {
                    "sent": "We can just.",
                    "label": 0
                },
                {
                    "sent": "Click on the M RNA.",
                    "label": 0
                },
                {
                    "sent": "So we have the quantity at the starting point at the time zero, it's one.",
                    "label": 0
                },
                {
                    "sent": "Change it to change, change it to 10.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "Simulate.",
                    "label": 0
                },
                {
                    "sent": "You should get this.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "It is too fast or.",
                    "label": 0
                },
                {
                    "sent": "Everybody got it.",
                    "label": 0
                },
                {
                    "sent": "So now you can see that the product because the the end product stays the same at the value one.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "So we have changed the amerinet so it was it is 10.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and it's all the time and it's all the time that N becausw.",
                    "label": 0
                },
                {
                    "sent": "It's the starting of 1 branch.",
                    "label": 0
                },
                {
                    "sent": "And what happened to the enzyme?",
                    "label": 0
                },
                {
                    "sent": "It increased.",
                    "label": 0
                },
                {
                    "sent": "By 10 that's normal.",
                    "label": 0
                },
                {
                    "sent": "After a while, if it's more Amy Renee, you get more enzyme activity.",
                    "label": 0
                },
                {
                    "sent": "Actually with the enzyme.",
                    "label": 0
                },
                {
                    "sent": "Also, activity increases and what happened to the substrate it went down.",
                    "label": 0
                },
                {
                    "sent": "Because the.",
                    "label": 0
                },
                {
                    "sent": "We have more enzyme activity.",
                    "label": 0
                },
                {
                    "sent": "More substrate is used, so once again this is the dynamical thing.",
                    "label": 0
                },
                {
                    "sent": "What happens from one steady state with everything is the same to another steady state with something when something changed.",
                    "label": 0
                },
                {
                    "sent": "OK. OK, we can go back and play what play with something else so we can put the Emera neilly emerin level back.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Back to one.",
                    "label": 0
                },
                {
                    "sent": "And we can change the end sign.",
                    "label": 0
                },
                {
                    "sent": "So 10.",
                    "label": 0
                },
                {
                    "sent": "And again.",
                    "label": 0
                },
                {
                    "sent": "Simulate.",
                    "label": 0
                },
                {
                    "sent": "So here we see the end time was at the starting point was 10, but then it went down.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because it was used, but the Ameren level is at once, so at one steady state it came the end time to also to the Level 1.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "And again, the product is fixed at one.",
                    "label": 0
                },
                {
                    "sent": "Because everything thanks to the tenants to the product, but the subset wait up.",
                    "label": 0
                },
                {
                    "sent": "Change.",
                    "label": 0
                },
                {
                    "sent": "At the beginning.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "So you click on the symbol.",
                    "label": 1
                },
                {
                    "sent": "Now we have changed the enzyme.",
                    "label": 0
                },
                {
                    "sent": "And in the end, the amount of enzyme here in this simple model is the activity of enzyme.",
                    "label": 0
                },
                {
                    "sent": "If it's more enzyme, the bigger activity.",
                    "label": 0
                },
                {
                    "sent": "But enzyme has a back door, so it's far from me.",
                    "label": 0
                },
                {
                    "sent": "Renee and a marinate still at level one, so.",
                    "label": 0
                },
                {
                    "sent": "Because that's a red line, yes.",
                    "label": 0
                },
                {
                    "sent": "Over the entire company, this yes, and this is and this is so this time is.",
                    "label": 0
                },
                {
                    "sent": "These are arbitrary time units because if we have kinetic parameters then we will have a real time.",
                    "label": 0
                },
                {
                    "sent": "But now it's just arbitrary units.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So we can go back again, put it back attributes.",
                    "label": 0
                },
                {
                    "sent": "The one.",
                    "label": 0
                },
                {
                    "sent": "And then we can change the product.",
                    "label": 0
                },
                {
                    "sent": "Yeah, we changed back to the starting point everything.",
                    "label": 0
                },
                {
                    "sent": "And now we can change the product.",
                    "label": 0
                },
                {
                    "sent": "Also the temp.",
                    "label": 0
                },
                {
                    "sent": "An simulate.",
                    "label": 0
                },
                {
                    "sent": "So the product doesn't because there is no, we don't have a feedback loop.",
                    "label": 0
                },
                {
                    "sent": "So it doesn't change nothing, just the product stays attend.",
                    "label": 0
                },
                {
                    "sent": "But now more interesting, we go back again.",
                    "label": 0
                },
                {
                    "sent": "We put the product again back to one.",
                    "label": 0
                },
                {
                    "sent": "So at time one as I'm zero, it's one and now we can play with the enzyme so.",
                    "label": 0
                },
                {
                    "sent": "This is a simple model yet now.",
                    "label": 0
                },
                {
                    "sent": "But if you have.",
                    "label": 0
                },
                {
                    "sent": "Because you make these reactions irreversible somehow, exactly yes.",
                    "label": 0
                },
                {
                    "sent": "Yes, that's where it's going in that direction.",
                    "label": 0
                },
                {
                    "sent": "And now if you look at the parameters for the end time, so we have the starting concentration, we have K1K one is the elimination constant and K2 is the constant that changes K1.",
                    "label": 0
                },
                {
                    "sent": "Well, I didn't do the model like that.",
                    "label": 0
                },
                {
                    "sent": "This was what Alex did, but this is what does it mean and switch time means the time when when the when this K2 influences the K1.",
                    "label": 0
                },
                {
                    "sent": "So let's say if you starting point is 0 and we have a 1001 thousand units and if you change it after 1010 units then something will change because the K1 will change because of K2.",
                    "label": 0
                },
                {
                    "sent": "How to play?",
                    "label": 0
                },
                {
                    "sent": "What happens with the enzyme?",
                    "label": 0
                },
                {
                    "sent": "This is like you if you put a drug.",
                    "label": 0
                },
                {
                    "sent": "Let's say you can change.",
                    "label": 0
                },
                {
                    "sent": "You actually change the K1 activity.",
                    "label": 0
                },
                {
                    "sent": "So the basic is 0.01 and we can change the K2 to.",
                    "label": 0
                },
                {
                    "sent": "0.02 So the so with this, so this is the elimination constant.",
                    "label": 0
                },
                {
                    "sent": "So the elimination is.",
                    "label": 0
                },
                {
                    "sent": "Twice the faster yeah.",
                    "label": 0
                },
                {
                    "sent": "OK and then simulate.",
                    "label": 0
                },
                {
                    "sent": "So is it something you expected?",
                    "label": 0
                },
                {
                    "sent": "What happened?",
                    "label": 0
                },
                {
                    "sent": "So again, the the product.",
                    "label": 0
                },
                {
                    "sent": "Is fixed.",
                    "label": 0
                },
                {
                    "sent": "The end time went down because the degradation was faster and it went and it went down.",
                    "label": 0
                },
                {
                    "sent": "How much if you look if we zoom in here we will say it's 0.5.",
                    "label": 0
                },
                {
                    "sent": "Twice.",
                    "label": 0
                },
                {
                    "sent": "And if you want to go back if we zoom in it's fit in view.",
                    "label": 0
                },
                {
                    "sent": "And the substrate had to go twice up.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it makes sense.",
                    "label": 0
                },
                {
                    "sent": "OK. And then we can try it with go back to modeling.",
                    "label": 0
                },
                {
                    "sent": "Will enzyme.",
                    "label": 0
                },
                {
                    "sent": "So before it was 0.01, now we can put 0.005.",
                    "label": 0
                },
                {
                    "sent": "So now the degradation is twice the slower as in the beginning.",
                    "label": 0
                },
                {
                    "sent": "Let's simulate.",
                    "label": 0
                },
                {
                    "sent": "And now we get the different picture.",
                    "label": 0
                },
                {
                    "sent": "So the enzyme went up twice and the substrate went twice down.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "But everything else stayed the same, cause the goal of this simple model is to make the substrate and state at one.",
                    "label": 0
                },
                {
                    "sent": "And now we can try.",
                    "label": 0
                },
                {
                    "sent": "We can try.",
                    "label": 0
                },
                {
                    "sent": "K1 let me see.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "Back to the inside.",
                    "label": 0
                },
                {
                    "sent": "So before it was 0.01.",
                    "label": 0
                },
                {
                    "sent": "So if you put 0.1, what would you?",
                    "label": 0
                },
                {
                    "sent": "What would be?",
                    "label": 0
                },
                {
                    "sent": "What do you expect?",
                    "label": 0
                },
                {
                    "sent": "It was 0.01 and now it's 10 times more.",
                    "label": 0
                },
                {
                    "sent": "We get 10 times more.",
                    "label": 0
                },
                {
                    "sent": "In both directions.",
                    "label": 0
                },
                {
                    "sent": "But and tell us where K1 where you would write K1 in this team.",
                    "label": 0
                },
                {
                    "sent": "Could you talk about the elimination, yeah.",
                    "label": 0
                },
                {
                    "sent": "I don't know which one it is.",
                    "label": 0
                },
                {
                    "sent": "It's here in illumination of the complex.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "So that's basically the reaction from C2 E. Yeah.",
                    "label": 0
                },
                {
                    "sent": "And now we can try to really really lower the elimination.",
                    "label": 0
                },
                {
                    "sent": "So we're still at the end time we put it 0.00.",
                    "label": 0
                },
                {
                    "sent": "1.",
                    "label": 0
                },
                {
                    "sent": "And simulate.",
                    "label": 0
                },
                {
                    "sent": "So everybody got this.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "Do you see something wrong with this?",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "So what what did I say that this this?",
                    "label": 0
                },
                {
                    "sent": "Model does goes from 1.",
                    "label": 0
                },
                {
                    "sent": "Steady state to another steady state.",
                    "label": 0
                },
                {
                    "sent": "Take a little off.",
                    "label": 0
                },
                {
                    "sent": "Yeah, the time is too short.",
                    "label": 0
                },
                {
                    "sent": "So we can go back to the model and simulation step.",
                    "label": 0
                },
                {
                    "sent": "We have to put not 1000 but 10,000.",
                    "label": 0
                },
                {
                    "sent": "It takes more time to come to the steady state, but eventually we come to a steady state.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "OK, you had you.",
                    "label": 0
                },
                {
                    "sent": "I said that you have to look at the scheme of cholesterol biosynthesis.",
                    "label": 0
                },
                {
                    "sent": "Everybody looked at that.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it looks a little bit complex.",
                    "label": 0
                },
                {
                    "sent": "I could say that try to to make a model, but it will take a lot of time.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We can open.",
                    "label": 0
                },
                {
                    "sent": "A new model that I gave that I gave to you.",
                    "label": 0
                },
                {
                    "sent": "So open.",
                    "label": 0
                },
                {
                    "sent": "Model.",
                    "label": 0
                },
                {
                    "sent": "And you have to find this.",
                    "label": 0
                },
                {
                    "sent": "Cholesterol that.",
                    "label": 0
                },
                {
                    "sent": "I put it on a USB stick, yeah?",
                    "label": 0
                },
                {
                    "sent": "Open.",
                    "label": 0
                },
                {
                    "sent": "And you have to go back if you are in this window you have to go to modeling.",
                    "label": 0
                },
                {
                    "sent": "Still the same one, so you have to go here on the left.",
                    "label": 0
                },
                {
                    "sent": "You have the cholesterol.",
                    "label": 0
                },
                {
                    "sent": "OK you have to click on it.",
                    "label": 0
                },
                {
                    "sent": "This looks a little bit different, doesn't it?",
                    "label": 0
                },
                {
                    "sent": "Really will more complex now you see why everything has to be really nicely oriented, otherwise you would not know.",
                    "label": 0
                },
                {
                    "sent": "And you can see if you if you click on an enzyme.",
                    "label": 0
                },
                {
                    "sent": "I'm at my tablet.",
                    "label": 0
                },
                {
                    "sent": "Yes, sorry.",
                    "label": 0
                },
                {
                    "sent": "Attributes so you have a special.",
                    "label": 0
                },
                {
                    "sent": "Metabolite.",
                    "label": 0
                },
                {
                    "sent": "So now this is a full cholesterol synthesis pathway.",
                    "label": 0
                },
                {
                    "sent": "And I was talking before about statins.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "So statins block which enzyme?",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah, can you find it?",
                    "label": 0
                },
                {
                    "sent": "Where should it be?",
                    "label": 0
                },
                {
                    "sent": "End times are red.",
                    "label": 0
                },
                {
                    "sent": "And it should be somewhere at the beginning.",
                    "label": 0
                },
                {
                    "sent": "Actually, it's getting the first one.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you found it.",
                    "label": 0
                },
                {
                    "sent": "This one is the first one is.",
                    "label": 0
                },
                {
                    "sent": "And if you click on it.",
                    "label": 0
                },
                {
                    "sent": "So we have again we have the starting at zero.",
                    "label": 0
                },
                {
                    "sent": "It's one K1 is 0.0, one K2.",
                    "label": 0
                },
                {
                    "sent": "It's nothing.",
                    "label": 0
                },
                {
                    "sent": "Switch time is nothing, yeah?",
                    "label": 0
                },
                {
                    "sent": "OK, if you simulate this you will get a release.",
                    "label": 0
                },
                {
                    "sent": "Silly thing so simulate.",
                    "label": 0
                },
                {
                    "sent": "And delete this results from the basic model.",
                    "label": 0
                },
                {
                    "sent": "And again here we have to you see a lot of different.",
                    "label": 0
                },
                {
                    "sent": "All the air marinades formation and times everything is in so we have to look for cholesterol.",
                    "label": 0
                },
                {
                    "sent": "Music.",
                    "label": 0
                },
                {
                    "sent": "Cholesterol and again take the quantity.",
                    "label": 0
                },
                {
                    "sent": "Company steamer.",
                    "label": 0
                },
                {
                    "sent": "Haha.",
                    "label": 0
                },
                {
                    "sent": "Just a moment in time.",
                    "label": 0
                },
                {
                    "sent": "OK, just to check it.",
                    "label": 0
                },
                {
                    "sent": "Nothing.",
                    "label": 0
                },
                {
                    "sent": "Hahaha.",
                    "label": 0
                },
                {
                    "sent": "But I'm scared that I'm scared.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's actually nothing.",
                    "label": 0
                },
                {
                    "sent": "Yeah, the times one time scale 10,000.",
                    "label": 0
                },
                {
                    "sent": "We always can adjust it, yes, so modeling simulation simulation setup, we can have it then.",
                    "label": 0
                },
                {
                    "sent": "But this is everything is 1, but it's just switching because of the model.",
                    "label": 0
                },
                {
                    "sent": "So actually this is one you have to have a large scale to see it.",
                    "label": 0
                },
                {
                    "sent": "So now the best thing would be so.",
                    "label": 0
                },
                {
                    "sent": "How to model that drug?",
                    "label": 0
                },
                {
                    "sent": "Targets the.",
                    "label": 0
                },
                {
                    "sent": "Rather place.",
                    "label": 0
                },
                {
                    "sent": "We have to.",
                    "label": 0
                },
                {
                    "sent": "We have to put a big value to the K2 constant so the degradation is.",
                    "label": 0
                },
                {
                    "sent": "Faster.",
                    "label": 0
                },
                {
                    "sent": "Is the same as you would put the drug, yeah.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We go back to the model.",
                    "label": 0
                },
                {
                    "sent": "Simulation setup 10,000 will be OK.",
                    "label": 0
                },
                {
                    "sent": "So we have K1.",
                    "label": 0
                },
                {
                    "sent": "We will put K2A value here.",
                    "label": 0
                },
                {
                    "sent": "Let's say 2.",
                    "label": 0
                },
                {
                    "sent": "So this means that degradation will be will be quicker like we would put a drug.",
                    "label": 0
                },
                {
                    "sent": "Into our system, yeah.",
                    "label": 0
                },
                {
                    "sent": "But now we put the switch time to 1000.",
                    "label": 0
                },
                {
                    "sent": "So what does the what does it mean?",
                    "label": 0
                },
                {
                    "sent": "Does this mean that for 1000 units of time, everything will be?",
                    "label": 0
                },
                {
                    "sent": "At one and 0.01 and then.",
                    "label": 0
                },
                {
                    "sent": "K1 will.",
                    "label": 0
                },
                {
                    "sent": "The elimination will become much bigger because of K2 from the time of 1000.",
                    "label": 0
                },
                {
                    "sent": "OK. And simulate.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so we see switch time is at 1000.",
                    "label": 0
                },
                {
                    "sent": "And cholesterol went down.",
                    "label": 0
                },
                {
                    "sent": "Like statins work.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "And we can look at all of the other.",
                    "label": 0
                },
                {
                    "sent": "All of the other.",
                    "label": 0
                },
                {
                    "sent": "Sterile is what is happening, so we have to find, let's say, lanosterol.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Woo Hoo Hoo.",
                    "label": 0
                },
                {
                    "sent": "Troll, huh?",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Piazza hydroxy dehydro lower lower than is defined.",
                    "label": 0
                },
                {
                    "sent": "It's not like that is it now.",
                    "label": 0
                },
                {
                    "sent": "It's not that they bottom out here.",
                    "label": 0
                },
                {
                    "sent": "It also went down.",
                    "label": 0
                },
                {
                    "sent": "And this is this is actually what we came to.",
                    "label": 0
                },
                {
                    "sent": "This model that we had experimental data and we were learning on this experimental data.",
                    "label": 0
                },
                {
                    "sent": "And also how how the pathway is constructed and we got the same results as in vivo.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "OK, now we can play a little bit different.",
                    "label": 0
                },
                {
                    "sent": "That did different stuff.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I know if everybody and anybody is familiar with Smith Lemli Opitz syndrome.",
                    "label": 0
                },
                {
                    "sent": "Just one so this is SLOS.",
                    "label": 0
                },
                {
                    "sent": "So again, we so this is the same pathway as we have it constructed in the in the openmodelica.",
                    "label": 0
                },
                {
                    "sent": "But just it's much easier from this to see, isn't it?",
                    "label": 0
                },
                {
                    "sent": "So that what happens in the SLAS patient is that they have a inborn error of cholesterol synthesis because of seven day hydro cholesterol reductase deficiency.",
                    "label": 1
                },
                {
                    "sent": "So this is an important error, so this enzyme is not functional.",
                    "label": 0
                },
                {
                    "sent": "So what would you expect?",
                    "label": 0
                },
                {
                    "sent": "If this enzyme doesn't work.",
                    "label": 0
                },
                {
                    "sent": "Nope.",
                    "label": 0
                },
                {
                    "sent": "Seven day Hydra cholesterol.",
                    "label": 0
                },
                {
                    "sent": "Yeah, now we can try this.",
                    "label": 0
                },
                {
                    "sent": "In our model.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So we first we have to also let's leave lanosterol, but we have to find the hydro cholesterol.",
                    "label": 0
                },
                {
                    "sent": "They hide out.",
                    "label": 0
                },
                {
                    "sent": "You found it.",
                    "label": 0
                },
                {
                    "sent": "Now we have to go back to modeling.",
                    "label": 0
                },
                {
                    "sent": "And change the parameters for the statins.",
                    "label": 0
                },
                {
                    "sent": "So this was zero.",
                    "label": 0
                },
                {
                    "sent": "This was zero.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "An it's easier now.",
                    "label": 0
                },
                {
                    "sent": "It's easier if you have such a big model.",
                    "label": 0
                },
                {
                    "sent": "It's much easier to go to plotting.",
                    "label": 0
                },
                {
                    "sent": "And find the DH 7 enzyme so.",
                    "label": 0
                },
                {
                    "sent": "Mama.",
                    "label": 0
                },
                {
                    "sent": "American man.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "Found it.",
                    "label": 0
                },
                {
                    "sent": "OK, so we do the same.",
                    "label": 0
                },
                {
                    "sent": "OK too, it's already said that's why you delete it.",
                    "label": 0
                },
                {
                    "sent": "Actually, it was already said that it should be one was before.",
                    "label": 0
                },
                {
                    "sent": "0.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "So it was two.",
                    "label": 0
                },
                {
                    "sent": "1000 and here we can go up.",
                    "label": 0
                },
                {
                    "sent": "Canary simulate and actually what we get is 7 dehydrocholesterol is.",
                    "label": 0
                },
                {
                    "sent": "Much higher and cholesterol.",
                    "label": 0
                },
                {
                    "sent": "Is much lower.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "And now the construction already of this model was really tough.",
                    "label": 0
                },
                {
                    "sent": "But now if you would like to see what if you would target one end time or another inside, what would happen with cholesterol biosynthesis, what would what would happen to cholesterol?",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "I'm just trying to show you how this model is usable and it's not, so this is the model of cholesterol biosynthesis, but the building blocks are the same for any kind of network.",
                    "label": 0
                },
                {
                    "sent": "But unfortunately it's not the clean yet and everything but everybody can use it OK.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this model predicts novel branches from the cholesterol synthesis pathway, so we had a hypothesis that cholesterol synthesis intermediates are in the studied animal systems, so these were mice.",
                    "label": 1
                },
                {
                    "sent": "Cream knockout scream.",
                    "label": 0
                },
                {
                    "sent": "It's one transcription factor that affects the coolest organic jeans.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "So in the model you can put in all the numbers, but it's not user friendly because then you have to go into the model, look at each.",
                    "label": 0
                },
                {
                    "sent": "Ameren a, let's say that you have measured a marinades of different of different of different genes and also measure the metabolite levels.",
                    "label": 0
                },
                {
                    "sent": "You put everything in, and it doesn't come together with this kind of pathway, that is, that is in the keg.",
                    "label": 0
                },
                {
                    "sent": "So something is missing and there are a lot of publications.",
                    "label": 0
                },
                {
                    "sent": "Let's say 4.",
                    "label": 0
                },
                {
                    "sent": "Sleep 11A1 so this is an enzyme that is used that is, the function is to.",
                    "label": 0
                },
                {
                    "sent": "To make violates bile acids, but it was shown in some studies that it can directly convert 70 Hydra cholesterol.",
                    "label": 0
                },
                {
                    "sent": "So this is 1 branch.",
                    "label": 0
                },
                {
                    "sent": "That is actually already described somewhere in the literature, but with all the measured marinades and and metabolites we couldn't, we couldn't construct with this model.",
                    "label": 0
                },
                {
                    "sent": "We couldn't say that this is functioning, so we came up with four different elimination pathways, which we still need to confirm experimentally.",
                    "label": 0
                },
                {
                    "sent": "This was the output.",
                    "label": 0
                },
                {
                    "sent": "So you can see, at least for the cholesterol synthesis pathway, that we that we constructed.",
                    "label": 0
                },
                {
                    "sent": "So for Staten, it's functioning for some different wild types and knockouts.",
                    "label": 0
                },
                {
                    "sent": "But for this it doesn't function.",
                    "label": 0
                },
                {
                    "sent": "So there are some branches that are maybe turned on when something is wrong.",
                    "label": 0
                },
                {
                    "sent": "That are usually not working because we can.",
                    "label": 0
                },
                {
                    "sent": "We can see here we have a flux.",
                    "label": 0
                },
                {
                    "sent": "Yeah phloxine and flux out and I usually explain this as a pipeline.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "So the flux has to go somewhere around and comes to the cholesterol.",
                    "label": 0
                },
                {
                    "sent": "So if you turn 1 pipe off.",
                    "label": 0
                },
                {
                    "sent": "It has to go somewhere else around.",
                    "label": 0
                },
                {
                    "sent": "If it doesn't know what will happen with the pipes.",
                    "label": 0
                },
                {
                    "sent": "So if an Organism doesn't die that nothing doesn't happen, there has to be some branching points that are turned on when something is wrong.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        }
    }
}