{
    "id": "c46db5ukourvhnyjnmlwr3ax6cadalvx",
    "title": "Evaluating Semantic Web Services Tools",
    "info": {
        "author": [
            "Liliana Cabral, Knowledge Media Institute (KMI), Open University (OU)"
        ],
        "published": "June 20, 2011",
        "recorded": "May 2011",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2011_cabral_evaluatingtools/",
    "segmentation": [
        [
            "Hi, I'm.",
            "Liliana Cabral from the University in UK.",
            "I'm going to talk about the evaluation of semantic web services tools."
        ],
        [
            "Um?",
            "Following more or less the same agenda, how?",
            "I'll talk about the background with someone web Services evaluation center that we have implemented the test data, the results, the workflow, you know a little bit about it tools and."
        ],
        [
            "Conclusions.",
            "Um?",
            "So for implementing the, our approach is used for semantic Web serves evaluation.",
            "We they approach on the semantic Web standardization effort from the Oasis Samantha execution environment, TECO, committing, and I'm going to show their proposal next.",
            "As well, approaches is based on the analysis that we did for the existing Semantic Web service initiatives, which includes the Semantic Web Service Challenge, the pre contest, and the Web Service Challenge Contest.",
            "They have different.",
            "Methodology's, but they have.",
            "This model has the same goals.",
            "The S 3 contest is the one that relates closer to our.",
            "Current scenario which is discovery or matchmaking of semantic web service tools?",
            "And we have also used existing test suites, in particular the STC and this also TC each for different.",
            "Language for describing services, and we also are proposing a new one for 2011 which is based on the visible light."
        ],
        [
            "High standard.",
            "Sushi so in.",
            "At the Oasis in the standardization effort.",
            "Semantic execution environment.",
            "Architecture is proposed.",
            "And they define.",
            "The use of semantic web service according to different types of activities, so the architecture is is based on a set of components as we see here.",
            "So depending on the type of activity that you were doing and that includes discovery or ranking, selection, composition, data and process mediation.",
            "An execution and these are based on the.",
            "Reasoning and storage services.",
            "Provided.",
            "So we we we focus our scenario valuation scenario only discovery activity."
        ],
        [
            "And I'll talk about more about that.",
            "So, genetically speaking, for our previous campaign in, let's see which is available in the in the link above.",
            "We basically have participating tools that are evaluated against the test data that is available.",
            "This can be OS to see all this sort of PC and that they are.",
            "Evaluated on retrieval performance basically, which includes a set of metrics.",
            "For information retrieval and and execution time, things like this and results are.",
            "Published in the in the repositories.",
            "According to this, this evaluation."
        ],
        [
            "So basically the discovery scenario.",
            "Is based on the semantic Web steps discover activity, which consists of finding web services according to the semantic descriptions.",
            "The semantic descriptions are according to different languages.",
            "As we saw, it can be all or just.",
            "Oh, he's more like for things like this.",
            "The tools for Semantic Web service discovery or matchmaking, evaluated on retrieval performance.",
            "What we mean by this is that given a goal and a set of steps descriptions, the two.",
            "We returned the match degree between this goal and the list.",
            "Each sets in the list of ourselves given.",
            "And the platform will provide the measurements for rating the matching correctness between these based on the available metrics.",
            "For example, precision, recall an variance of that."
        ],
        [
            "Um?",
            "So for that it seems we have developed a number of services which initially Java API's.",
            "We have a decent websites to plugging API.",
            "This is the plugin that is to be implemented by the two providers.",
            "And they and it works as a whopper for running the tool during the workflow evaluation and providing the results for the tools.",
            "We've also implemented a valuation measurement API.",
            "So it is a interface that.",
            "It has access to the methods for running the metrics.",
            "And then we can use the steps on top of the the implementation of the interface for providing the results of the measurements.",
            "These are called interpretations.",
            "We also have a specific APIs.",
            "Repository management and these are basically interface that implementing for access to the test data repository and results reported 4 four specifically with Discovery.",
            "So we can add and retrieve these datasets and results and can also pass and serialize this to RDF from end to RDF."
        ],
        [
            "So in more details, the plugging API has three methods than a method is the Discover methods, which is the one that calls the matchmaking algorithm implemented by a specific tool and returns the results in a specific.",
            "Format, which is basically the goal and the list of sets match for that goal.",
            "Before that, the two there is a method in experiential lies.",
            "The two and then a method to load the services that are part of the current data set."
        ],
        [
            "So this plugin is is is part of the the two bridge that we talked before or this year's platform so.",
            "So we have the methods that I talked before.",
            "They need the mode sets and they discover.",
            "Methods and these.",
            "These are extended with specific methods for for the this platform, such as the method for checking if the two bridge can be executed, and method for getting the type of specific tool which for us is the semantic web service.",
            "Added to this is there are methods for handling exceptions and then the execution of.",
            "Over the two bridge."
        ],
        [
            "For their Discovery Measurement API, then we have the interface and then interfaces.",
            "Methods that get intermediate values for the.",
            "When was the magical applied such as the number, the number over retrieve, it sets descriptions, or the number of relevant steps, descriptions, and.",
            "And then that's it, such as the average precision precision at a certain cutoff point, every quarter Cup of points.",
            "So it's it's.",
            "A series of metrics that can be."
        ],
        [
            "The light.",
            "So the interface is generic.",
            "And can be implemented using.",
            "An in metrics for the first campaign we use the Galaga Search API.",
            "The gullible is open source.",
            "Java API for.",
            "Text retrieval in in the information retrieval area, we just use the component that implemented the metrics and these are the list of metrics that are already implemented according to our interface so.",
            "There you get average precision, normalizes, contact cumulative gain, normalized.",
            "The cut off point did rank precision, binary preference and reciprocal rank.",
            "And precision and recall at a certain cutoff point.",
            "So there are.",
            "I would add things."
        ],
        [
            "Implemented for that.",
            "I respect to the test data.",
            "For the campaign last year we used the OS TC.",
            "Version four this collection is available in Semantic Web Central.",
            "These these tests suite is over more than 1000.",
            "Self descriptions described using the hours.",
            "1.1 version and it covers 9 domains including education, medical care, food, food, travel, communication, economy, weapons, geography and simulation.",
            "So it's a different range of domains.",
            "It has a 42 test queries.",
            "Associate with binary as well as graded relevance sets, so this evaluation is also based in reference sets.",
            "We measure the results of the two against this reference sets.",
            "Um?",
            "From these services, 167 eighteen queries contain preconditions and effects.",
            "As part of this subscription, so this adds description, usually describes inputs and outputs.",
            "And preconditions and effects are more complex description, so just a few steps will provide this."
        ],
        [
            "For registering these OS TC 4 version in ACS, we created a metadata that is associated with it and it's already available in this link.",
            "Once the test data is registered, then you can access the metadata that as we can see this in this snapshot.",
            "Has a link to locate each item.",
            "Each service description and it go description in the test suite and these are used to.",
            "During the evaluation workflow."
        ],
        [
            "So more or less for the results we have the developed ontology that basically represents the APIs that I talked about before.",
            "It represents.",
            "Discover result, which is the list of steps match and it and it represents the results of the measurements which includes the precision, recall average precision in all of this.",
            "So it's basically a semantic representation of those API's."
        ],
        [
            "So in more details that there are result which is the result returned by the tool.",
            "Is is is represented by two main classes and what we have here is that the.",
            "Each result has correspond to the test suite.",
            "And sweet items that generated that result.",
            "And then we add things like the two version that is used by the time, the execution time and each discovery test that corresponds to the goal and services that were found for the 22 was executed."
        ],
        [
            "Tomorrow let's the same point reputations.",
            "Every interpretation has a correspondence to the test suite that has generated it and to the result.",
            "Produced by a certain tool.",
            "And contains all the results for for each of those metrics that I talked before."
        ],
        [
            "So going into more details in in the evaluation workflow generically, as in the previous for the previous tools we have.",
            "A test suite.",
            "And we have the meta data for this test suite where we can locate the sweet items such as the goal that a specific tool takes for doing the matchmaking, and then once it's executed we returned.",
            "This helps match.",
            "These are represented as results.",
            "And their results are used for generated interpretation, which are the applications of the net."
        ],
        [
            "Checks that we have.",
            "Implementing that genetic overview, we have a people workflow and that's part of the automated automated evaluation.",
            "So here we see.",
            "Many of the steps that are being called and the.",
            "They are used to access the test suites and in their repositories and the results in the repositories.",
            "But basically what we're doing is for.",
            "Every two available, we retrieve the test suite for that specific evaluation.",
            "We invoke the two with this test data, we registered the wrong results in the repository.",
            "We apply the metrics for each result and then register the final interpretations, bound them together and registered in in the repository."
        ],
        [
            "So in our previous campaign.",
            "We have implemented this coverage scenario.",
            "It was experimental in the sense that.",
            "We basically use tools that are available already in the S3.",
            "Initiative for evaluation and we test the implementation that we have done with the Java API's.",
            "So we the organizing planter.",
            "For body and soul, for the OS MX that was the one that was available.",
            "On the web.",
            "We use the OS TC 4.",
            "With the 1008 three service descriptions and we use different parts of these datasets.",
            "The results are read, published in the deliverable.",
            "The 14 point."
        ],
        [
            "3.",
            "So this the tools that the different variants of the tools they have different matchmaking algorithms, so they were wrapped as different tools.",
            "Each of them have different parameters and they do the matchmaking in a different way.",
            "So for end for the OSM zero we have the semantic ordering.",
            "With a different types of matchmaking and includes exact plugging subsumes and subsample my match type of matchmaking, and then the other two had synthetic ordering with a certain threshold, and then for a different type of threshold.",
            "So we just tune these tools in different ways and compared.",
            "In measured them."
        ],
        [
            "Together so.",
            "The results of the interpretations were based in the goals that were available, so we had different goals.",
            "Which are these types of requests?",
            "Available in, they were available locally in a server."
        ],
        [
            "And I ended.",
            "Then the results were published and compared in table format.",
            "As we see every.",
            "This is just an example.",
            "Every request for every request.",
            "Then you have the low time, the data set size and then all the metrics that I told before including the number of.",
            "Relevant and retrieved some month descriptions.",
            "An average precision and things like this for every 2."
        ],
        [
            "So finally the conclusions.",
            "No fault for our current evaluation, we.",
            "Implementing the plugin API's will.",
            "Provide something very similar to the to the SMEs.",
            "Matchmaker plugging.",
            "Button yes, 3DS plugging is specific for discover, so that's why it's compatible.",
            "We can issue extend.",
            "The plugins that we have and the workflow for different types of activities.",
            "Also different types of metrics can be provided an extended from from what we have now.",
            "For the next campaign, we are providing the unused data set with a new language with more light.",
            "Um?",
            "And the important thing for us is that this this intermediate results that are available in the in the results repository are important so that participants can come back and reuse those.",
            "And it's also important they repeat ability over the experiment and participants again can can rerun the evaluation for this thing, test data for the same version of the tool and get instead the behavior.",
            "Of different tools again and again."
        ],
        [
            "Sam yes, so I will ask you to to join the new evaluation campaign that is now available in their website.",
            "In questions.",
            "So I think.",
            "I'm finished."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hi, I'm.",
                    "label": 0
                },
                {
                    "sent": "Liliana Cabral from the University in UK.",
                    "label": 1
                },
                {
                    "sent": "I'm going to talk about the evaluation of semantic web services tools.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Following more or less the same agenda, how?",
                    "label": 0
                },
                {
                    "sent": "I'll talk about the background with someone web Services evaluation center that we have implemented the test data, the results, the workflow, you know a little bit about it tools and.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Conclusions.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So for implementing the, our approach is used for semantic Web serves evaluation.",
                    "label": 1
                },
                {
                    "sent": "We they approach on the semantic Web standardization effort from the Oasis Samantha execution environment, TECO, committing, and I'm going to show their proposal next.",
                    "label": 1
                },
                {
                    "sent": "As well, approaches is based on the analysis that we did for the existing Semantic Web service initiatives, which includes the Semantic Web Service Challenge, the pre contest, and the Web Service Challenge Contest.",
                    "label": 0
                },
                {
                    "sent": "They have different.",
                    "label": 0
                },
                {
                    "sent": "Methodology's, but they have.",
                    "label": 0
                },
                {
                    "sent": "This model has the same goals.",
                    "label": 0
                },
                {
                    "sent": "The S 3 contest is the one that relates closer to our.",
                    "label": 0
                },
                {
                    "sent": "Current scenario which is discovery or matchmaking of semantic web service tools?",
                    "label": 1
                },
                {
                    "sent": "And we have also used existing test suites, in particular the STC and this also TC each for different.",
                    "label": 0
                },
                {
                    "sent": "Language for describing services, and we also are proposing a new one for 2011 which is based on the visible light.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "High standard.",
                    "label": 0
                },
                {
                    "sent": "Sushi so in.",
                    "label": 0
                },
                {
                    "sent": "At the Oasis in the standardization effort.",
                    "label": 0
                },
                {
                    "sent": "Semantic execution environment.",
                    "label": 0
                },
                {
                    "sent": "Architecture is proposed.",
                    "label": 0
                },
                {
                    "sent": "And they define.",
                    "label": 0
                },
                {
                    "sent": "The use of semantic web service according to different types of activities, so the architecture is is based on a set of components as we see here.",
                    "label": 0
                },
                {
                    "sent": "So depending on the type of activity that you were doing and that includes discovery or ranking, selection, composition, data and process mediation.",
                    "label": 0
                },
                {
                    "sent": "An execution and these are based on the.",
                    "label": 0
                },
                {
                    "sent": "Reasoning and storage services.",
                    "label": 0
                },
                {
                    "sent": "Provided.",
                    "label": 0
                },
                {
                    "sent": "So we we we focus our scenario valuation scenario only discovery activity.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I'll talk about more about that.",
                    "label": 0
                },
                {
                    "sent": "So, genetically speaking, for our previous campaign in, let's see which is available in the in the link above.",
                    "label": 0
                },
                {
                    "sent": "We basically have participating tools that are evaluated against the test data that is available.",
                    "label": 1
                },
                {
                    "sent": "This can be OS to see all this sort of PC and that they are.",
                    "label": 0
                },
                {
                    "sent": "Evaluated on retrieval performance basically, which includes a set of metrics.",
                    "label": 1
                },
                {
                    "sent": "For information retrieval and and execution time, things like this and results are.",
                    "label": 0
                },
                {
                    "sent": "Published in the in the repositories.",
                    "label": 0
                },
                {
                    "sent": "According to this, this evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So basically the discovery scenario.",
                    "label": 1
                },
                {
                    "sent": "Is based on the semantic Web steps discover activity, which consists of finding web services according to the semantic descriptions.",
                    "label": 1
                },
                {
                    "sent": "The semantic descriptions are according to different languages.",
                    "label": 0
                },
                {
                    "sent": "As we saw, it can be all or just.",
                    "label": 0
                },
                {
                    "sent": "Oh, he's more like for things like this.",
                    "label": 1
                },
                {
                    "sent": "The tools for Semantic Web service discovery or matchmaking, evaluated on retrieval performance.",
                    "label": 1
                },
                {
                    "sent": "What we mean by this is that given a goal and a set of steps descriptions, the two.",
                    "label": 0
                },
                {
                    "sent": "We returned the match degree between this goal and the list.",
                    "label": 0
                },
                {
                    "sent": "Each sets in the list of ourselves given.",
                    "label": 1
                },
                {
                    "sent": "And the platform will provide the measurements for rating the matching correctness between these based on the available metrics.",
                    "label": 0
                },
                {
                    "sent": "For example, precision, recall an variance of that.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So for that it seems we have developed a number of services which initially Java API's.",
                    "label": 0
                },
                {
                    "sent": "We have a decent websites to plugging API.",
                    "label": 0
                },
                {
                    "sent": "This is the plugin that is to be implemented by the two providers.",
                    "label": 1
                },
                {
                    "sent": "And they and it works as a whopper for running the tool during the workflow evaluation and providing the results for the tools.",
                    "label": 0
                },
                {
                    "sent": "We've also implemented a valuation measurement API.",
                    "label": 0
                },
                {
                    "sent": "So it is a interface that.",
                    "label": 0
                },
                {
                    "sent": "It has access to the methods for running the metrics.",
                    "label": 0
                },
                {
                    "sent": "And then we can use the steps on top of the the implementation of the interface for providing the results of the measurements.",
                    "label": 0
                },
                {
                    "sent": "These are called interpretations.",
                    "label": 0
                },
                {
                    "sent": "We also have a specific APIs.",
                    "label": 1
                },
                {
                    "sent": "Repository management and these are basically interface that implementing for access to the test data repository and results reported 4 four specifically with Discovery.",
                    "label": 1
                },
                {
                    "sent": "So we can add and retrieve these datasets and results and can also pass and serialize this to RDF from end to RDF.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in more details, the plugging API has three methods than a method is the Discover methods, which is the one that calls the matchmaking algorithm implemented by a specific tool and returns the results in a specific.",
                    "label": 0
                },
                {
                    "sent": "Format, which is basically the goal and the list of sets match for that goal.",
                    "label": 0
                },
                {
                    "sent": "Before that, the two there is a method in experiential lies.",
                    "label": 0
                },
                {
                    "sent": "The two and then a method to load the services that are part of the current data set.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this plugin is is is part of the the two bridge that we talked before or this year's platform so.",
                    "label": 0
                },
                {
                    "sent": "So we have the methods that I talked before.",
                    "label": 0
                },
                {
                    "sent": "They need the mode sets and they discover.",
                    "label": 0
                },
                {
                    "sent": "Methods and these.",
                    "label": 0
                },
                {
                    "sent": "These are extended with specific methods for for the this platform, such as the method for checking if the two bridge can be executed, and method for getting the type of specific tool which for us is the semantic web service.",
                    "label": 0
                },
                {
                    "sent": "Added to this is there are methods for handling exceptions and then the execution of.",
                    "label": 0
                },
                {
                    "sent": "Over the two bridge.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For their Discovery Measurement API, then we have the interface and then interfaces.",
                    "label": 0
                },
                {
                    "sent": "Methods that get intermediate values for the.",
                    "label": 0
                },
                {
                    "sent": "When was the magical applied such as the number, the number over retrieve, it sets descriptions, or the number of relevant steps, descriptions, and.",
                    "label": 0
                },
                {
                    "sent": "And then that's it, such as the average precision precision at a certain cutoff point, every quarter Cup of points.",
                    "label": 0
                },
                {
                    "sent": "So it's it's.",
                    "label": 0
                },
                {
                    "sent": "A series of metrics that can be.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The light.",
                    "label": 0
                },
                {
                    "sent": "So the interface is generic.",
                    "label": 0
                },
                {
                    "sent": "And can be implemented using.",
                    "label": 0
                },
                {
                    "sent": "An in metrics for the first campaign we use the Galaga Search API.",
                    "label": 0
                },
                {
                    "sent": "The gullible is open source.",
                    "label": 0
                },
                {
                    "sent": "Java API for.",
                    "label": 0
                },
                {
                    "sent": "Text retrieval in in the information retrieval area, we just use the component that implemented the metrics and these are the list of metrics that are already implemented according to our interface so.",
                    "label": 0
                },
                {
                    "sent": "There you get average precision, normalizes, contact cumulative gain, normalized.",
                    "label": 0
                },
                {
                    "sent": "The cut off point did rank precision, binary preference and reciprocal rank.",
                    "label": 0
                },
                {
                    "sent": "And precision and recall at a certain cutoff point.",
                    "label": 0
                },
                {
                    "sent": "So there are.",
                    "label": 0
                },
                {
                    "sent": "I would add things.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Implemented for that.",
                    "label": 0
                },
                {
                    "sent": "I respect to the test data.",
                    "label": 0
                },
                {
                    "sent": "For the campaign last year we used the OS TC.",
                    "label": 1
                },
                {
                    "sent": "Version four this collection is available in Semantic Web Central.",
                    "label": 0
                },
                {
                    "sent": "These these tests suite is over more than 1000.",
                    "label": 0
                },
                {
                    "sent": "Self descriptions described using the hours.",
                    "label": 0
                },
                {
                    "sent": "1.1 version and it covers 9 domains including education, medical care, food, food, travel, communication, economy, weapons, geography and simulation.",
                    "label": 1
                },
                {
                    "sent": "So it's a different range of domains.",
                    "label": 0
                },
                {
                    "sent": "It has a 42 test queries.",
                    "label": 1
                },
                {
                    "sent": "Associate with binary as well as graded relevance sets, so this evaluation is also based in reference sets.",
                    "label": 0
                },
                {
                    "sent": "We measure the results of the two against this reference sets.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "From these services, 167 eighteen queries contain preconditions and effects.",
                    "label": 0
                },
                {
                    "sent": "As part of this subscription, so this adds description, usually describes inputs and outputs.",
                    "label": 0
                },
                {
                    "sent": "And preconditions and effects are more complex description, so just a few steps will provide this.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For registering these OS TC 4 version in ACS, we created a metadata that is associated with it and it's already available in this link.",
                    "label": 0
                },
                {
                    "sent": "Once the test data is registered, then you can access the metadata that as we can see this in this snapshot.",
                    "label": 0
                },
                {
                    "sent": "Has a link to locate each item.",
                    "label": 0
                },
                {
                    "sent": "Each service description and it go description in the test suite and these are used to.",
                    "label": 0
                },
                {
                    "sent": "During the evaluation workflow.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So more or less for the results we have the developed ontology that basically represents the APIs that I talked about before.",
                    "label": 0
                },
                {
                    "sent": "It represents.",
                    "label": 0
                },
                {
                    "sent": "Discover result, which is the list of steps match and it and it represents the results of the measurements which includes the precision, recall average precision in all of this.",
                    "label": 0
                },
                {
                    "sent": "So it's basically a semantic representation of those API's.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in more details that there are result which is the result returned by the tool.",
                    "label": 0
                },
                {
                    "sent": "Is is is represented by two main classes and what we have here is that the.",
                    "label": 0
                },
                {
                    "sent": "Each result has correspond to the test suite.",
                    "label": 0
                },
                {
                    "sent": "And sweet items that generated that result.",
                    "label": 0
                },
                {
                    "sent": "And then we add things like the two version that is used by the time, the execution time and each discovery test that corresponds to the goal and services that were found for the 22 was executed.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tomorrow let's the same point reputations.",
                    "label": 0
                },
                {
                    "sent": "Every interpretation has a correspondence to the test suite that has generated it and to the result.",
                    "label": 0
                },
                {
                    "sent": "Produced by a certain tool.",
                    "label": 0
                },
                {
                    "sent": "And contains all the results for for each of those metrics that I talked before.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So going into more details in in the evaluation workflow generically, as in the previous for the previous tools we have.",
                    "label": 1
                },
                {
                    "sent": "A test suite.",
                    "label": 0
                },
                {
                    "sent": "And we have the meta data for this test suite where we can locate the sweet items such as the goal that a specific tool takes for doing the matchmaking, and then once it's executed we returned.",
                    "label": 0
                },
                {
                    "sent": "This helps match.",
                    "label": 0
                },
                {
                    "sent": "These are represented as results.",
                    "label": 0
                },
                {
                    "sent": "And their results are used for generated interpretation, which are the applications of the net.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Checks that we have.",
                    "label": 0
                },
                {
                    "sent": "Implementing that genetic overview, we have a people workflow and that's part of the automated automated evaluation.",
                    "label": 0
                },
                {
                    "sent": "So here we see.",
                    "label": 0
                },
                {
                    "sent": "Many of the steps that are being called and the.",
                    "label": 0
                },
                {
                    "sent": "They are used to access the test suites and in their repositories and the results in the repositories.",
                    "label": 0
                },
                {
                    "sent": "But basically what we're doing is for.",
                    "label": 0
                },
                {
                    "sent": "Every two available, we retrieve the test suite for that specific evaluation.",
                    "label": 0
                },
                {
                    "sent": "We invoke the two with this test data, we registered the wrong results in the repository.",
                    "label": 0
                },
                {
                    "sent": "We apply the metrics for each result and then register the final interpretations, bound them together and registered in in the repository.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in our previous campaign.",
                    "label": 0
                },
                {
                    "sent": "We have implemented this coverage scenario.",
                    "label": 0
                },
                {
                    "sent": "It was experimental in the sense that.",
                    "label": 0
                },
                {
                    "sent": "We basically use tools that are available already in the S3.",
                    "label": 0
                },
                {
                    "sent": "Initiative for evaluation and we test the implementation that we have done with the Java API's.",
                    "label": 0
                },
                {
                    "sent": "So we the organizing planter.",
                    "label": 0
                },
                {
                    "sent": "For body and soul, for the OS MX that was the one that was available.",
                    "label": 0
                },
                {
                    "sent": "On the web.",
                    "label": 0
                },
                {
                    "sent": "We use the OS TC 4.",
                    "label": 0
                },
                {
                    "sent": "With the 1008 three service descriptions and we use different parts of these datasets.",
                    "label": 0
                },
                {
                    "sent": "The results are read, published in the deliverable.",
                    "label": 0
                },
                {
                    "sent": "The 14 point.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "3.",
                    "label": 0
                },
                {
                    "sent": "So this the tools that the different variants of the tools they have different matchmaking algorithms, so they were wrapped as different tools.",
                    "label": 0
                },
                {
                    "sent": "Each of them have different parameters and they do the matchmaking in a different way.",
                    "label": 0
                },
                {
                    "sent": "So for end for the OSM zero we have the semantic ordering.",
                    "label": 1
                },
                {
                    "sent": "With a different types of matchmaking and includes exact plugging subsumes and subsample my match type of matchmaking, and then the other two had synthetic ordering with a certain threshold, and then for a different type of threshold.",
                    "label": 0
                },
                {
                    "sent": "So we just tune these tools in different ways and compared.",
                    "label": 0
                },
                {
                    "sent": "In measured them.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Together so.",
                    "label": 0
                },
                {
                    "sent": "The results of the interpretations were based in the goals that were available, so we had different goals.",
                    "label": 0
                },
                {
                    "sent": "Which are these types of requests?",
                    "label": 0
                },
                {
                    "sent": "Available in, they were available locally in a server.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I ended.",
                    "label": 0
                },
                {
                    "sent": "Then the results were published and compared in table format.",
                    "label": 0
                },
                {
                    "sent": "As we see every.",
                    "label": 0
                },
                {
                    "sent": "This is just an example.",
                    "label": 0
                },
                {
                    "sent": "Every request for every request.",
                    "label": 0
                },
                {
                    "sent": "Then you have the low time, the data set size and then all the metrics that I told before including the number of.",
                    "label": 0
                },
                {
                    "sent": "Relevant and retrieved some month descriptions.",
                    "label": 0
                },
                {
                    "sent": "An average precision and things like this for every 2.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So finally the conclusions.",
                    "label": 0
                },
                {
                    "sent": "No fault for our current evaluation, we.",
                    "label": 0
                },
                {
                    "sent": "Implementing the plugin API's will.",
                    "label": 0
                },
                {
                    "sent": "Provide something very similar to the to the SMEs.",
                    "label": 1
                },
                {
                    "sent": "Matchmaker plugging.",
                    "label": 0
                },
                {
                    "sent": "Button yes, 3DS plugging is specific for discover, so that's why it's compatible.",
                    "label": 0
                },
                {
                    "sent": "We can issue extend.",
                    "label": 0
                },
                {
                    "sent": "The plugins that we have and the workflow for different types of activities.",
                    "label": 1
                },
                {
                    "sent": "Also different types of metrics can be provided an extended from from what we have now.",
                    "label": 0
                },
                {
                    "sent": "For the next campaign, we are providing the unused data set with a new language with more light.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 1
                },
                {
                    "sent": "And the important thing for us is that this this intermediate results that are available in the in the results repository are important so that participants can come back and reuse those.",
                    "label": 0
                },
                {
                    "sent": "And it's also important they repeat ability over the experiment and participants again can can rerun the evaluation for this thing, test data for the same version of the tool and get instead the behavior.",
                    "label": 0
                },
                {
                    "sent": "Of different tools again and again.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sam yes, so I will ask you to to join the new evaluation campaign that is now available in their website.",
                    "label": 1
                },
                {
                    "sent": "In questions.",
                    "label": 0
                },
                {
                    "sent": "So I think.",
                    "label": 0
                },
                {
                    "sent": "I'm finished.",
                    "label": 0
                }
            ]
        }
    }
}