{
    "id": "c4rm4pv3el6nvik2nq7zd7cuzrkqb46a",
    "title": "Tuning the surface properties of hybrid organicinorganic nanoparticles",
    "info": {
        "author": [
            "Paolo Pengo, University of Trieste"
        ],
        "published": "June 3, 2020",
        "recorded": "February 2020",
        "category": [
            "Top->Technology->Nanotechnology",
            "Top->Technology->Nanotechnology->Applications"
        ]
    },
    "url": "http://videolectures.net/bilateralWorkshop2020_pengo_tuning_surface/",
    "segmentation": [
        [
            "Everyone.",
            "The surf."
        ],
        [
            "Properties of nanoparticles are the main responsible for their interaction with other systems comprising the biological systems or other molecular entities.",
            "If we think at hybrid organic inorganic nanoparticles systems made by an inorganic core surrounded by an organic shell, we can actually design this organic shell in order to Indo the nanoparticles with specific solubility properties or specific recognition properties towards more molecules.",
            "But we can also.",
            "Induce some sort of surface anisotropy which can be used if you want to tune the addition properties of these systems towards missile structure or nanostructures.",
            "Surface and is author is also important if we want to use these systems as building blocks for self assembly.",
            "And of course, the surface anisotropy can be induced by specifically processing certain spots on this nanoparticle surface, like in this case here, but there are other methods, and if this is a top down methods in our group, we are more interested in exploiting self assembling or small legals, and in particular, or fluorinated an hydrogenated elegance and for which we can exploit also their reciprocal for Mississippi.",
            "Indeed, fluorocarbons and hydrocarbons are known to.",
            "Be admissible in the bulk."
        ],
        [
            "They are also known to self sort on Judy assemblies, like for instance the language, the language logic films and they self sort into very well defined domains.",
            "But is this property going to be translated into the nanoscale?",
            "This is a question that we ask ourselves a few years ago and we tried to take."
        ],
        [
            "Problem by conceiving this relatively simple nanoparticle system that was made by grafting on the surface of Golden particles are blends of fluorinated and hydrogenated regions and we wanted to look for the presence of fluorinated domains in the monolayer of this system.",
            "And we could do that by exploiting electron spin resonance spectroscopy applied to nitroxide radical probes.",
            "Becausw Nitroxide radical probes have specific spectroscopic signatures that are really sensitive to the polarity of the environment and so they can really tell the presence or the absence of a very.",
            "Hydrophobic region in the monolayer, such as the one due to the formation of chlorinated domains and in this work we could find that these Petra Scopic properties of the probe told us.",
            "That the probe was experiencing the fluorinated environment, even though the amount of chlorinated lesions in the monolayer was as low as 20%.",
            "And this could only be explained by assuming that actually the fluorinated lesions were clustering together forming small patches.",
            "In this respect, molecular simulations were extremely useful because they allowed us to.",
            "Highlight that fluorinated legions were actually forming separated domains in all of the composition range that we explored and the overall morphology of the monolayer was strictly dependent on the size of the nanoparticles.",
            "So different monorail morphologies can be obtained by using blends of chlorinated the nitrogen ligands.",
            "But can we predict what morphology we're going to get on a rational basis?",
            "Well, work from our group.",
            "And other groups."
        ],
        [
            "Then to give a positive answer to this question, provided that it is possible to have some sort of modulate the structure of the ligands forming the monolayer.",
            "And let me first as an example, assume that two ligands are flora nated, hydrogenate one have the same length.",
            "Upon absorption on the gold surface, they would tend to subsort, forming separated domains, but in this process there's an unfavorable enthalpic contribution which is actually related to the existence of a boundary between the hydrogenated and flora nated domains.",
            "If there's no specific Entropic contribution related to the mobility of the legions at this interface, the existence of this interface is just a net entopic cost, so it has to be reduced, and the only way to reduce this entopic cost is to reduce the extent the size of the surface which represents the boundary between the regions, and this is possible if the legal arrange themselves in.",
            "Relatively, in a relatively small number of domains.",
            "If the domains are relatively large in size and if they are almost round in shape.",
            "This would lead to an extreme to the formation of nanoparticles in which 1/2 of the surface is covered by Florent legions, and the other half of the surface is covered by hydrogen at once.",
            "To give what this code journals particle, if of course the ratio between the flora Nated League and sand originated against is close to 1 to one.",
            "On the other hand, if we consider legal that have different lengths besides the formation of interfaces, we have also some conformational freedom related to the mobility of the long regions that represent the positive contribution to the thermodynamics of the assembly.",
            "So there will be a balance between the presence of an unfavorable interface and the Entropic gain related to the mobility at this interface, and this tends to favor the formation of narrow domains.",
            "Which are relatively long, can spend the whole surface of the nanoparticles.",
            "So actually different morphologies are predictable in terms of relatively simple concepts.",
            "An molecular dynamics simulations actually support these ideas, but these morphologies are actually.",
            "Experimentally addressable, we could prove this by nuclear magnetic resonance spectroscopy of the flow in nucleus."
        ],
        [
            "Because the chemical shift of certain spots of the legals are extremely sensitive to the environment and so they we can map.",
            "What is the?",
            "Evolution of the morphology increasing or decreasing the amount of loading it into the monolayer and the way the chemical shift changes is extremely correlated, is very well correlated to the morphology itself because each morphology can be.",
            "Started in terms of an allometric function that actually give an information on how the domains grow in size once they.",
            "An amount of rent is increased in the model layer.",
            "Different particles with different morphologies are also very well suited to study there."
        ],
        [
            "Direction interaction of these systems with biological systems and we perform an analysis of nanoparticles displaying different morphologies.",
            "Janos lichen stripe, like with immobilized liposomes in a typical surface plasma resonance set up and we could detect that actually the Janus particles in which we have a single interface.",
            "Between domains have a very large, relatively large dissociation constant for the synthetic membrane, while the Skype like particles tend to have a smaller dissociation constant.",
            "That is, they interact more strongly.",
            "This is also translated into interaction with cells, since the stripe light particles tend to be internalized more readily and also the thermodynamic analysis that was performed in silico on the audition process revealed that even though for the general system and stripe like system there is no much difference in terms of contact.",
            "In the particle and the membrane, the overall thermodynamics favors strap like particles because each contact is more favorable, so these are just snapshots, but they can allow us to throw some general conclusions."
        ],
        [
            "Barrett actually different malaria morphologies can be predicted because they are somehow encoded in the structure of the legals.",
            "And this can be addressed by spectroscopic techniques and different morphologies give rise to different interaction properties for the particles.",
            "Of course, what methodology would be best suited for certain application?",
            "It is hard to tell but we are interested to exploit these systems in order to build up a repertoire repertoire of knowledge that would allow us to be extremely precise in designing these materials.",
            "I have to thank all the people standing with people that they are involved in this project and of course thank you for listening."
        ],
        [
            "In the last slide, you showed that there is a difference dissociation constant between the janison described, but these two particles are also different in size.",
            "Is this is the size affecting the as a rowlins effect or not the size the size is different.",
            "And the different size give rise to the different morphologies because the monolayer in the two cases has roughly the same composition, the ratio between the two regions is more or less the same, but the change in morphology is triggered by the different size, so.",
            "The size and influence becausw.",
            "Establish is monolayers with different pathologies in terms of Contacts between the layer monolayer and the model systems.",
            "There is no much difference, so they pretty much interact in the same way, but each interaction individual interaction is more favorable.",
            "In the case of this type like promises."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Everyone.",
                    "label": 0
                },
                {
                    "sent": "The surf.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Properties of nanoparticles are the main responsible for their interaction with other systems comprising the biological systems or other molecular entities.",
                    "label": 0
                },
                {
                    "sent": "If we think at hybrid organic inorganic nanoparticles systems made by an inorganic core surrounded by an organic shell, we can actually design this organic shell in order to Indo the nanoparticles with specific solubility properties or specific recognition properties towards more molecules.",
                    "label": 0
                },
                {
                    "sent": "But we can also.",
                    "label": 0
                },
                {
                    "sent": "Induce some sort of surface anisotropy which can be used if you want to tune the addition properties of these systems towards missile structure or nanostructures.",
                    "label": 1
                },
                {
                    "sent": "Surface and is author is also important if we want to use these systems as building blocks for self assembly.",
                    "label": 0
                },
                {
                    "sent": "And of course, the surface anisotropy can be induced by specifically processing certain spots on this nanoparticle surface, like in this case here, but there are other methods, and if this is a top down methods in our group, we are more interested in exploiting self assembling or small legals, and in particular, or fluorinated an hydrogenated elegance and for which we can exploit also their reciprocal for Mississippi.",
                    "label": 0
                },
                {
                    "sent": "Indeed, fluorocarbons and hydrocarbons are known to.",
                    "label": 0
                },
                {
                    "sent": "Be admissible in the bulk.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They are also known to self sort on Judy assemblies, like for instance the language, the language logic films and they self sort into very well defined domains.",
                    "label": 0
                },
                {
                    "sent": "But is this property going to be translated into the nanoscale?",
                    "label": 0
                },
                {
                    "sent": "This is a question that we ask ourselves a few years ago and we tried to take.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Problem by conceiving this relatively simple nanoparticle system that was made by grafting on the surface of Golden particles are blends of fluorinated and hydrogenated regions and we wanted to look for the presence of fluorinated domains in the monolayer of this system.",
                    "label": 1
                },
                {
                    "sent": "And we could do that by exploiting electron spin resonance spectroscopy applied to nitroxide radical probes.",
                    "label": 0
                },
                {
                    "sent": "Becausw Nitroxide radical probes have specific spectroscopic signatures that are really sensitive to the polarity of the environment and so they can really tell the presence or the absence of a very.",
                    "label": 0
                },
                {
                    "sent": "Hydrophobic region in the monolayer, such as the one due to the formation of chlorinated domains and in this work we could find that these Petra Scopic properties of the probe told us.",
                    "label": 0
                },
                {
                    "sent": "That the probe was experiencing the fluorinated environment, even though the amount of chlorinated lesions in the monolayer was as low as 20%.",
                    "label": 0
                },
                {
                    "sent": "And this could only be explained by assuming that actually the fluorinated lesions were clustering together forming small patches.",
                    "label": 0
                },
                {
                    "sent": "In this respect, molecular simulations were extremely useful because they allowed us to.",
                    "label": 0
                },
                {
                    "sent": "Highlight that fluorinated legions were actually forming separated domains in all of the composition range that we explored and the overall morphology of the monolayer was strictly dependent on the size of the nanoparticles.",
                    "label": 0
                },
                {
                    "sent": "So different monorail morphologies can be obtained by using blends of chlorinated the nitrogen ligands.",
                    "label": 0
                },
                {
                    "sent": "But can we predict what morphology we're going to get on a rational basis?",
                    "label": 0
                },
                {
                    "sent": "Well, work from our group.",
                    "label": 0
                },
                {
                    "sent": "And other groups.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then to give a positive answer to this question, provided that it is possible to have some sort of modulate the structure of the ligands forming the monolayer.",
                    "label": 0
                },
                {
                    "sent": "And let me first as an example, assume that two ligands are flora nated, hydrogenate one have the same length.",
                    "label": 0
                },
                {
                    "sent": "Upon absorption on the gold surface, they would tend to subsort, forming separated domains, but in this process there's an unfavorable enthalpic contribution which is actually related to the existence of a boundary between the hydrogenated and flora nated domains.",
                    "label": 0
                },
                {
                    "sent": "If there's no specific Entropic contribution related to the mobility of the legions at this interface, the existence of this interface is just a net entopic cost, so it has to be reduced, and the only way to reduce this entopic cost is to reduce the extent the size of the surface which represents the boundary between the regions, and this is possible if the legal arrange themselves in.",
                    "label": 0
                },
                {
                    "sent": "Relatively, in a relatively small number of domains.",
                    "label": 0
                },
                {
                    "sent": "If the domains are relatively large in size and if they are almost round in shape.",
                    "label": 0
                },
                {
                    "sent": "This would lead to an extreme to the formation of nanoparticles in which 1/2 of the surface is covered by Florent legions, and the other half of the surface is covered by hydrogen at once.",
                    "label": 0
                },
                {
                    "sent": "To give what this code journals particle, if of course the ratio between the flora Nated League and sand originated against is close to 1 to one.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, if we consider legal that have different lengths besides the formation of interfaces, we have also some conformational freedom related to the mobility of the long regions that represent the positive contribution to the thermodynamics of the assembly.",
                    "label": 0
                },
                {
                    "sent": "So there will be a balance between the presence of an unfavorable interface and the Entropic gain related to the mobility at this interface, and this tends to favor the formation of narrow domains.",
                    "label": 0
                },
                {
                    "sent": "Which are relatively long, can spend the whole surface of the nanoparticles.",
                    "label": 0
                },
                {
                    "sent": "So actually different morphologies are predictable in terms of relatively simple concepts.",
                    "label": 0
                },
                {
                    "sent": "An molecular dynamics simulations actually support these ideas, but these morphologies are actually.",
                    "label": 0
                },
                {
                    "sent": "Experimentally addressable, we could prove this by nuclear magnetic resonance spectroscopy of the flow in nucleus.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Because the chemical shift of certain spots of the legals are extremely sensitive to the environment and so they we can map.",
                    "label": 0
                },
                {
                    "sent": "What is the?",
                    "label": 0
                },
                {
                    "sent": "Evolution of the morphology increasing or decreasing the amount of loading it into the monolayer and the way the chemical shift changes is extremely correlated, is very well correlated to the morphology itself because each morphology can be.",
                    "label": 0
                },
                {
                    "sent": "Started in terms of an allometric function that actually give an information on how the domains grow in size once they.",
                    "label": 0
                },
                {
                    "sent": "An amount of rent is increased in the model layer.",
                    "label": 0
                },
                {
                    "sent": "Different particles with different morphologies are also very well suited to study there.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Direction interaction of these systems with biological systems and we perform an analysis of nanoparticles displaying different morphologies.",
                    "label": 0
                },
                {
                    "sent": "Janos lichen stripe, like with immobilized liposomes in a typical surface plasma resonance set up and we could detect that actually the Janus particles in which we have a single interface.",
                    "label": 0
                },
                {
                    "sent": "Between domains have a very large, relatively large dissociation constant for the synthetic membrane, while the Skype like particles tend to have a smaller dissociation constant.",
                    "label": 0
                },
                {
                    "sent": "That is, they interact more strongly.",
                    "label": 0
                },
                {
                    "sent": "This is also translated into interaction with cells, since the stripe light particles tend to be internalized more readily and also the thermodynamic analysis that was performed in silico on the audition process revealed that even though for the general system and stripe like system there is no much difference in terms of contact.",
                    "label": 0
                },
                {
                    "sent": "In the particle and the membrane, the overall thermodynamics favors strap like particles because each contact is more favorable, so these are just snapshots, but they can allow us to throw some general conclusions.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Barrett actually different malaria morphologies can be predicted because they are somehow encoded in the structure of the legals.",
                    "label": 1
                },
                {
                    "sent": "And this can be addressed by spectroscopic techniques and different morphologies give rise to different interaction properties for the particles.",
                    "label": 1
                },
                {
                    "sent": "Of course, what methodology would be best suited for certain application?",
                    "label": 0
                },
                {
                    "sent": "It is hard to tell but we are interested to exploit these systems in order to build up a repertoire repertoire of knowledge that would allow us to be extremely precise in designing these materials.",
                    "label": 0
                },
                {
                    "sent": "I have to thank all the people standing with people that they are involved in this project and of course thank you for listening.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the last slide, you showed that there is a difference dissociation constant between the janison described, but these two particles are also different in size.",
                    "label": 0
                },
                {
                    "sent": "Is this is the size affecting the as a rowlins effect or not the size the size is different.",
                    "label": 0
                },
                {
                    "sent": "And the different size give rise to the different morphologies because the monolayer in the two cases has roughly the same composition, the ratio between the two regions is more or less the same, but the change in morphology is triggered by the different size, so.",
                    "label": 0
                },
                {
                    "sent": "The size and influence becausw.",
                    "label": 0
                },
                {
                    "sent": "Establish is monolayers with different pathologies in terms of Contacts between the layer monolayer and the model systems.",
                    "label": 0
                },
                {
                    "sent": "There is no much difference, so they pretty much interact in the same way, but each interaction individual interaction is more favorable.",
                    "label": 0
                },
                {
                    "sent": "In the case of this type like promises.",
                    "label": 0
                }
            ]
        }
    }
}