{
    "id": "caxnyxon4ha7g3mdivprcmazygofvpoq",
    "title": "Entanglement: Einstein's gift to quantum mechanics",
    "info": {
        "author": [
            "F. Duncan M. Haldane, Department of Physics, Princeton University"
        ],
        "published": "March 30, 2018",
        "recorded": "March 2018",
        "category": [
            "Top->Physics"
        ]
    },
    "url": "http://videolectures.net/dnevi_haldane_quantum_mechanics/",
    "segmentation": [
        [
            "Ladies and gentlemen, friends, colleagues.",
            "It's great pleasure for me today to announce the speaker.",
            "It's Duncan Haldane.",
            "Otherwise, Frederick dunckel.",
            "Michael Haldane.",
            "Now I'd like to say a few words of introduction.",
            "He was born in London's and is a British citizen, currently still European.",
            "He's unique, US resident.",
            "But what perhaps so many of us is important that his father was a British Doctor Who met his future wife in Klagenfurt at the end of the war vets.",
            "Until Amit, thank you very good.",
            "Who was a medical student at the time and they essentially his mother Lyudmila Ranco.",
            "This has been her future has been to London where Duncan was born.",
            "He, by his own account he considers himself half Scott, half Slovene correct, which is especially.",
            "Can be proud of that.",
            "He was educated in London and Cambridge was awarded a Bachelor of Arts degree at Cambridge in 1978 and in 1978 he was awarded a PhD which he with Philip Anderson himself.",
            "Nobel Prize winner just a few years before that had a few weeks before that right?",
            "So you got and avoid in spite of that or OK. Hildene is started his career in France in Grenoble Institute lounge Man and became a assistant professor at University of Southern California in Los Angeles, where he remained until 87.",
            "In July 86, he joined the physics Department at the University of California, San Diego, where he remained for, I guess, for six years, and in 1990 he became was appointed Professor of Physics at the Department physics at Princeton University, where he still remains today.",
            "Professor Haldane is known for a wide variety of fundamental contributions to condensed matter physics, including theory of law.",
            "Ginger, Liquid's theory of 1 dimensional spin chains, theory, fractional quantum Hall effect, exclusion statistics, entitlement Spectra and since 2001 has been developing geometric description of the functional whole effect, which we've heard something about yesterday.",
            "Haldane was elected a Fellow of Royal SoC and a Fellow of American Academy of Arts and Sciences.",
            "Fellow of the American Physical Society, FL.",
            "Of the Institute of Physics.",
            "Fellow of the American Association for the Advancement of Science.",
            "He was also awarded the Oliver Buckley Prize by the American Physical Society, up the Alfred Sloan Foundation Research Fellowship, Lawrence Chair, and a direct medal in 2016.",
            "He shared the Nobel Prize in Physics with David Powlison, Michael.",
            "Kosterlitz for theoretical discoveries of topological phase transitions, antop ological phases of matter.",
            "Today's talk is entitled entanglement.",
            "Missed Einstein's get to quantum mechanics, and I think it's about time that I stop.",
            "OK, thank you very much.",
            "OK, Dover done.",
            "It's great pleasure to be here to settle.",
            "Steven Institute.",
            "This is a talk is aimed at you don't need to know physics or quantum mechanics for it, so I'm going to tell you a little bit about.",
            "The history of entanglements, which is a very was introduced by Einstein as a property of quantum mechanics that was so strange it couldn't possibly be true, but turned out to be quite central to the recent discoveries of these new kinds of topological states of matter, basically.",
            "Interestingly, topologically entangled states of matter so OK."
        ],
        [
            "So let me move on.",
            "So as I say in public, this is a public lecture.",
            "So it seems hopefully one learns at least one thing in a public lecture.",
            "So of course quantum mechanics is always a difficult subject.",
            "In some sense it's more difficult than relativity with business about clocks.",
            "Quantum mechanics has got issues about measurement and and it's in some sense difficult for both the public and the scientists to understand.",
            "We don't really, but we work with quantum mechanics, and it's the theory is the correct description as far as we know of the world around us.",
            "So usually in a public talk about quantum mechanics, the subject that's brought up is the Heisenberg uncertainty principle about the two.",
            "You cannot simultaneously venture the position and velocity of a particle, or more generally by measuring something you affect it.",
            "And this is this is flown over into all kinds of areas like economists talk about, you could try to measure something economically you or affect it.",
            "But I'm not going to talk about.",
            "The usual."
        ],
        [
            "I'm going to bring up first 2 basic other key ingredients of the of the quantum theory which relate which become related.",
            "Which is the Poly exclusion principle for electrons and this entanglement property which was first pointed out by Einstein, Podolsky, and Rosen in 1935 as an attempt to really show that quantum mechanics couldn't possibly be true OK?",
            "And of course Einstein is.",
            "It is well known."
        ],
        [
            "For all kinds of important things, Einstein seems to have, every it looks like he likes his big achievements in years ending in five, 'cause he seems to have a 10 year cycle of things starting.",
            "And of course Einstein is known for all kinds of things, mainly for relativity and his geometric theory of gravity, which of course the last Nobel Prize was finally for the direct observation of the of the gravity waves that were predicted.",
            "But of course, it's probably not so familiar.",
            "Einstein actually got his Nobel Prize.",
            "Nothing for nothing to do with relativity.",
            "You got it for his early contributions to quantum mechanics and his understanding of the energy gap in the photoelectric effect.",
            "When you shine light on metals, it ejects electrons, provided the light has the photon of light, has a sufficient energy to kick the electron out.",
            "And of course, that's how garage door.",
            "The device to prevent your automatic garage door off and chopping your head off is based on if you walk in front of a block.",
            "The light beam that gives the photoelectric effect, it stops and reverses the door.",
            "So Einstein very famously when in his gravity theory.",
            "He introduced this cosmological constant.",
            "He wanted to have the universe be static because somehow the equations predicted the universe.",
            "It would either be expanding or contracting and that looked like there was a beginning of time or maybe a creation which sounded a bit religious.",
            "So prejudice at the time was to make the thing look static so the universe would be always the same at all times.",
            "So we introduced the cosmological constant, but about a two year, two or three years later, Hubble discovered that the universe was expanding and Einstein very famously.",
            "Said that, this was his biggest mistake, but of course Einstein's mistakes have always been incredibly useful, and the biggest mistake is probably of course only about 10 or 15 years ago.",
            "We discovered that the universe was actually accelerating.",
            "There was a kind of anti gravity force which is probably the vacuum energy contribution to the energy stress energy tensor, but so of course there's still a kind of puzzled about why the cosmological constant should be so small and things, but basically people.",
            "Mainly believe that the so called dark energy that was discovered is really the Einstein constant, so his mistake is definitely not such a mistake.",
            "And in quantum mechanics, again from 1905 he added here of course the famous Three Things Photoelectric effect, special relativity and a Brownian Motion 1915, the Gravity 1925, another contribution to quantum mechanics, the Bose Einstein condensation, which of course is also led to Nobel Prizes in.",
            "Studying cold Atom gases which exhibit this, I guess 10 years late, but ten years later, in 1935 had become disenchanted with quantum mechanics, and what one might call his second biggest mistake was pointing out.",
            "He pointed out the property of entanglement, which I'll describe which he thought was so strange.",
            "He called it spooky action.",
            "At the distance it said it was so strange whenever, when it was eventually measured or attempted to be measured, it would surely show that quantum mechanics was wrong.",
            "Well, of course we now know that when they eventually did get measured experimentally, well after Einstein had died, quantum mechanics passed the test with 100% marks.",
            "But this but of course before I sign it hadn't really been realized how important this entanglement property was, and in recent years entanglement is actually moved from a very philosophical thing to a central part of quantum mechanics, and now it's believed people talk about entanglement as a fuel which may drive.",
            "Future quantum information processes.",
            "So I can say that I could call this his second biggest mistake, but it's been incredibly useful that he did this, even if it, even if his motivation turned out to be incorrect."
        ],
        [
            "OK, and as I say, this is the story he called this.",
            "Book after fee on vehicles in German, which is probably translates a spooky action at a distance.",
            "Schroedinger didn't come up with the word.",
            "I think the German is fish ranking.",
            "I'm not sure what it is in Slovenian.",
            "Every language francisan free cash and also every language seems to have found those different words for entanglement.",
            "But anyway, this is the word we use and shredding it was went into it a bit further.",
            "So as I say, he thought this pointing this out would show that quantum mechanics was wrong and."
        ],
        [
            "That's not what happens.",
            "So as I say, quantum mechanics has always been a very mysterious property for the public more than relativity.",
            "And as I say, for working physicist, I don't worry about whether quantum mechanics is correct or not, or what measurement means.",
            "That kind of used quantum mechanics, and but as I said, we know it's the.",
            "Confirmed to be the true description of the world and the more simpler classical mechanics description for earlier times that we intuitively feel and use in our daily life is should be viewed as a very good approximation to quantum mechanics on scales much larger than atoms.",
            "So as I say, originally Einstein's objections seem very philosophical.",
            "I mean part of the issue of the entanglement, and Einstein Podolsky Rosen Paradox is, you know, some experimentalists has to take a decision about.",
            "Which polarization of a lighter which provide which direction it was spin he should try to measure.",
            "And then you start coming up with issues was the experimentalist.",
            "Was this an action of free will, or was in fact the the direction he was going to choose to do?",
            "Is measurement preordained in history so all kinds of questions that philosophers like to debate?",
            "If quantum mechanics compatible with free will, well, this is not a kind of question that you know.",
            "Working scientist finds very useful.",
            "It can be debated at great thing, but.",
            "But as I said today, entanglement is not no longer philosophical issue, but it's experimentally confirmed and it's on its way to having technological importance.",
            "So we've moved from philosophy to an empty talk in some way to using things."
        ],
        [
            "So an important property of quantum mechanics as I said, is the power principle, which says that two particles of the type that we call fermions.",
            "There are two kinds of particles.",
            "Basically most of matter is made of fermions.",
            "Basically although gluing two fermions together makes a bozon, but the elementary particles like fermions, electrons can't be in the same state, which roughly means, roughly speaking is can't be in the same place at the same time.",
            "In a similar state.",
            "OK, so I think in a public lecture when always likes to give the people who have someone should everyone should come away knowing something you.",
            "So this is a question.",
            "How does question often is?",
            "Where does quantum mechanics affect us in our daily life?",
            "And one big answer which comes from the power principle is we don't fall through the floor.",
            "After all gravity is pulling us downwards towards the center of the earth and the atoms which we are all made of, which.",
            "Built up into the molecules over 99.9% empty space.",
            "So why don't we just fall through the center of the floor and the answer is of course Newton gave a simple answer.",
            "He said there was a normal force, which is a kind of practical observation, but the quantum mechanics is responsible for the 4th that prove."
        ],
        [
            "It's often falling through the floor, so I say in the kind of everyday language of the Newton invented the explanation be as follows.",
            "Here is Einstein or standing on the floor.",
            "He's actually got 2 feet on the floor, so there's actually, he's gotta gravity weight pulling in from his center of mass, which is, I guess he had a large meal or something would be there and and it pulls him down towards the floor with MG. And there are two forces, one for each of the soles of his feet.",
            "Exerted on the on the shoe by the floor, which point upwards, and these are the so called normal force and in high school everyone learns a little bit of mechanics so they know that every fourth has a reaction equal and opposite to it etc.",
            "And then if you were doing high school physics you would have to write down the balance of force equation that N 1 + N two which ought to be vectors I suppose.",
            "Or pointing upwards minus MG downwards is 0.",
            "So that's Newton's explanation.",
            "Of why we don't fall through the floor and then that was of course an empirical flat fact.",
            "He he notice that you didn't fall through the floor and and said, well, it has to be this normal force, right?",
            "Because you didn't explain what the normal force was."
        ],
        [
            "And in fact, the Noble forces basically the result of the Pauli exclusion principle, and for the quantum mechanical viewpoint you have a load of atoms.",
            "The centers of atoms and nuclei, or maybe the ionic cause of the atoms are bound together.",
            "They hold together by kind of molecular glue or whatever in the soles of your shoes, and there's a certain other set bound together to make up the structure of the wood.",
            "But there are some electrons.",
            "The outer electrons are bound to these things.",
            "Go round and these sets of electrons in the shoe can't be in the same place as the electrons from the floor.",
            "By quantum mechanical Pauli exclusion principle.",
            "Prevents them from entering the space occupied by the electrons of the floor, and that means that at the line of contact between the two materials there is this force to exclude them, because so in that sense quantum mechanics is present in our everyday life and responsible for everything around us.",
            "But we don't really until this century last century.",
            "We didn't really think of it as quantum.",
            "We didn't realize what was going on.",
            "In fact, no one understood what atoms were until.",
            "Quantum mechanics, you couldn't understand why on Earth often Atom was or how it works or whatever until quantum mechanics was created."
        ],
        [
            "So, as I say, the funding one of the fundamental ingredients of matter.",
            "That that makes us all up or makes a fight.",
            "Of course with normal matter is now we know is only some tiny fraction of the percent of the energy in the universe, so there's all kinds of other matter which we don't understand.",
            "Dark matter etc.",
            "But normal matter.",
            "Fundamental ingredient that holds normal matter together is the is the chemical bond which of course in fact does involve 2 electrons which are basically in the same place 2 electrons halfway between a pair of atoms acts as a kind of glue that glues them together.",
            "So actually this is apparently contradiction to Paoli statement, but of course actually probably at the same time as discovering his principle.",
            "It also solves the problem.",
            "We realized there had to be 2 to an additional degree of freedom, and additional thing you needed to describe about the electron, which was not just where it was, but also it's probably called it spin.",
            "So the quantum state of an electron doesn't just involve the position and the speed, but also an internal degree of freedom, which we call it spin.",
            "In analogy to a little spinning top.",
            "So electron is of course a charged particle with a charged particle with little magnetic moment due to an angular momentum and intrinsic angular momentum that we call spin.",
            "And of course from this viewpoint the periodic table was explained because you build up the things by.",
            "Putting 2 electrons in each state, one in up spin and running down spin and of course now we've gone from this old.",
            "There was a previous before power Lee in around 1912 there was this old bore picture of an Atom which was like a little little planetary system with the sun at the nucleus at the middle and little elliptical orbits of atoms.",
            "And this is still perhaps the general public picture of an Atom, because this cartoon picture for 1912 is around every.",
            "Of course this is what a.",
            "Atom atoms, now you can really see them, and if you put the electron states into a very large orbit, which in this picture would be like Pluto or something like that so called rittberg orbit, you can actually now image the electron in Atom.",
            "So this is actually a real image of a hydrogen Atom with electron around it excited into a into a circled red bug state with a with a number of about 100's orbitals up from the ground state.",
            "But then it's big enough for you to actually image and see these things so.",
            "This is a better picture of a quantum mechanical Atom, because the electron forms are kind of fuzzy cloud rather than these little orbits around the system."
        ],
        [
            "So anyway, the chemical bond.",
            "Here's the spin of the electron.",
            "The chemical bond is made of two electrons with exactly opposite spin, so they can occupy the same space in space.",
            "Roughly speaking, they can occupy this.",
            "The position at the center between these two ions and and the electric force, then glue them together.",
            "But the big issue here is whatever the direction of electron one has, if spin is a little direction.",
            "Given by the right hand rule, it's actually spinning in one their way.",
            "Or you point the spin along your thumb, right?",
            "The other electron has to be pointing in the opposite direction, 'cause otherwise it couldn't be in the same place.",
            "And if you make a slightly better."
        ],
        [
            "Picture of that the electrons actually.",
            "There's no particular direction to the spin of 1 electron, it's just the two electrons always have opposite directions, spins, and of course in quantum mechanics, quantum state is actually presented by a complex number, and the electrons have this fermion principle.",
            "The principle that prevents 2 electrons being in the same state in the same place means that if I swap the two electrons around the quantum mechanical state changes sign.",
            "It's actually a complex number, but flips its sign, so it's up down, minus down up.",
            "And if these were both up, then up minus up upward, cancel and be 0, which is apparently principle right?",
            "But of course it doesn't have to be up, up, up, down, plus down up.",
            "It could be 45 degrees, so it could be this kind of slanted thing.",
            "Or it could be sideways.",
            "The basic thing is that the state is odd, it changes sign if you swap the two electrons.",
            "So the quantum mechanical say this is actually the poster child for entanglement.",
            "The electrons are fundamentally entangled because it's not that.",
            "Particle one is up and particles two is down.",
            "They have this state that whichever direction one is in the other is in the opposite one and so there has to be 2 components to this."
        ],
        [
            "Thing.",
            "So of course the the length of the chemical bond is about a tenth of an anime 2 and 1 billion nanometers is a meter, and this I've given this talk in the United States, so I do after translate water meter is.",
            "On this length scale, the on the length scale of the of the of the topic of the macular bond.",
            "The two electrons are in this completely entangled state and what Einstein worried about was supposed to at least a thought experiment 'cause he loves to do thought experiments was to what would happen if I took this chemical bond and stretched and stretched it and stretched it without without disturbing it and let it go.",
            "Let the distance be, you know, not just a nanometer.",
            "But a meter or light year, right?",
            "And kilometers light years right?",
            "And so he thought the consequences of the fact that whatever this electron.",
            "Spin was doing this.",
            "One would be the opposite was somehow would violate the principles of causality in relativity.",
            "So he worried about this abstract thought experiment possibility that the chemical bond would be."
        ],
        [
            "Stretched now of course, when the electrons are close together, the entangled state of the two electrons in the bond is it's got.",
            "It's got a large binding energy, which is the energy that causes causes matter to be stable and wants to clump together into form interesting arrangements such as us for example, and.",
            "This is because as a quantum mechanics, one of the principles in fact, that one of the things that Einstein discovered in the photoelectric effect of 1905 was that there's an energy gap.",
            "There can be only a set of certain allowed energies in quantum mechanics, and the chemical bond.",
            "This is protected by an energy gap that lowers the energy of the pair of electrons in this entangled state to be lower than relative to.",
            "Other possible states they can be in, and that's of course, why ultraviolet sunlight is bad for your skin because it's enough energy to break some of the bonds in your skin, and you know have bits and pieces floating around that can give you skin cancer and stuff.",
            "But if you just just regular heat for the for the infrared lamp is not going to break the chemical bonds.",
            "So that's why it's bad for you to go to these tanning saloon's and get too much ultraviolet.",
            "Break too many of your chemical bonds, but this a protection.",
            "Now if I pull this bond to be apart, so it's so it's very largely separated, this becomes a.",
            "This is a very unusual situation because it becomes extremely fragile.",
            "You the more you stretch it, the more you lose this energy gap that that protects it, and so the of tremendously stretched chemical bonds where the spins are.",
            "In this I put a dotted line rather than up down minus down upside down.",
            "That means they are entangled in this singlet state.",
            "This is a this thing is very fragile against what we called the coherence at another.",
            "It could be disturbed by another electron environment here, and instead of being entangled with this, it will become lose its entanglement with the distant electron and these will become entangled with its local environment.",
            "And this is actually.",
            "The basic problem that people are trying to defeat with to make quantum information, reality transformation, processing in reality, because if you store information in entanglement, you have to worry about it's the coherence is degradation by interaction with the environment.",
            "So I'd say Einstein would produce."
        ],
        [
            "Ken Roczen they thought of the origin of what?",
            "Now we now call this an EPR path after them of widely separated particles.",
            "In this entangled state they thought it could be made by decaying and initially initial kind of confined state.",
            "Somehow switching off the the binding process that makes that makes a chemical bond.",
            "But you can think of it if I put a pair of these particles in the box there kind of which are entangled, they're kind of locally there and switch the walls of the box.",
            "Which is actually the kind of experiment people do with cold atoms.",
            "Now they hold the atoms in a magnetic trap, making this box and then actually this is a kind of experiment that they do.",
            "They switch the box off and everything flies apart and then they measure what happens.",
            "Well, in this EPR experiment you switch the box off.",
            "You can see there's a principle of conservation of momentum that the motion of the electrons has to balance if there if the.",
            "If one electron is moving one way, the other through the other way, and they're continually bouncing off the walls of the box, but once you open the thing up, they're going to fly apart.",
            "And whichever direction electron one flows in the other one will always be going in the opposite direction.",
            "Because of this conservation of momentum, the some momentum that direction, and that one has to add up.",
            "So I stumble ski Rosen, you somewhere do something in these electrons?",
            "Fire part, so as long as they don't.",
            "And getting tangled with anything along the way they will.",
            "They will maintain their.",
            "They will maintain this down minus down up structure and so in principle.",
            "They could go to large distances.",
            "Now electrons have much."
        ],
        [
            "Big tendency to interact and in fact.",
            "So she Interestingly unsigned.",
            "EPR this was announced in the paper.",
            "This attack on quantum mechanics was front page news in 1935 I guess.",
            "You know Hitler hadn't invaded anything that day or whatever, so there was there was some like it must have been.",
            "No news on 90 on that day for it to make the headlines of the newspaper, but in fact, apparently Podolski.",
            "Einstein was extremely angry, apparently about it.",
            "I was told Podolski went and went to the papers with this, and Einstein thought this was more of a physicist.",
            "Shouldn't be washing their dirty linen in public, right?",
            "So keep this in the physics community.",
            "But Podolski went and.",
            "Broadcasted it and it became because of Einstein's fame.",
            "It became famous, so his worry was suppose I make a measurement of the direction of the particle.",
            "Any part he, according to quantum mechanics until the measurement was made the particles spin could be pointing in any direction and the statement was whether you did the measurement and whatever the experimentalist, select some direction to measure the spin along.",
            "And the point was that experiment is decided to measure it this way.",
            "It would immediately cause the result of a measurement on the other spin to the in the other direction.",
            "And this was a seemed to be to Einstein to be a violation of the principle of causality that says, you know things can't communicate instantaneously.",
            "Somehow the electron was communicating the fact according to quantum mechanics, the election was somehow communicating the fact it had been measured to the other electron, which could be a very long way away.",
            "And the point was the choice of the measurement axis was up to the experimentalist.",
            "You could choose it that way or that way, or up and down, and Einstein felt that couldn't possibly."
        ],
        [
            "Be true, he felt that the electron had had the direction of the spin of the electron had to be chosen already.",
            "When when the box was open to writing, he couldn't.",
            "He couldn't accept that it didn't get chosen until the measurement was made.",
            "So we thought there was some hidden hidden variable somewhere that he called it.",
            "Local reality, he said that he said that quantum mechanics violates local reality.",
            "Whatever that means.",
            "So as I say, if both so both observers do the measurement, they'll get the opposite result and they have to make a choice of the measurement."
        ],
        [
            "Anne.",
            "OK, suppose they only agree to make the choice of which access to measure after well after the particles are split.",
            "This is where the whole issue of the freewheel came into it, right an?",
            "Basically, Einstein made this famous statement, which presumably was in German that God does not play dice.",
            "I said this can't possibly be correct and that this issue was the result of the, so he felt his point was the result of the experiment had to have been determined.",
            "At the moment the electrons flew apart and it couldn't, possibly."
        ],
        [
            "Be sensibly determined after that.",
            "Well, as I say, he incorrectly thought that if this test was eventually done and again he thought it would be a long time in the future.",
            "It would definitely show that the particle spin was already determined when they split, and that quantum mechanics was some approximation to a true microscopic description of the universe, which was which made local realism.",
            "But as I say, other people thought about this, and David Bohm people started reformulating a more precise form of the EPR experiment, and probably the John Bell probably made the in the.",
            "In the 60s late 60s, John Bell, probably he crystallized.",
            "He made a very, very precise kind of test of a measurement that couldn't possibly be compatible with classic with local realism, although.",
            "That the the whole issue of free will is still in there as the only possible tiny little place to squeeze for the anti quantum mechanical people to squeeze out of of Bell theorems.",
            "And in fact in 1982 the French physicist Allan SP.",
            "Did finally did these experiments and experiments showed full violation of local reality.",
            "According to Belfair Bell theorems and quantum mechanics essentially got this 100% correct mark after that.",
            "Now."
        ],
        [
            "Electrons are kind of tricky to work with because they're charged and they kind of like to interact with the environment.",
            "But we know that photons can travel.",
            "You know, photons which were created.",
            "A few 100,000 years after The Big Bang and they have continued towards us unaffected since then.",
            "So we can look back and see.",
            "Look back till recombination to see the universe so so photons can travel a huge distance without with avoiding entanglement with the environment.",
            "And the test was actually done done with the."
        ],
        [
            "With the photons.",
            "So here we are.",
            "So in fact instead of spins up and down it was two polarizations of light and light either.",
            "Either looking vertical or horizontal polarization, which is what your sunglasses are doing to to get rid of glare or or something slightly more like spin is the photon can put in circularly polarized states, which are one way or the other way, and in fact.",
            "Since this I wrote this slides, I say the people have now shown EPR pairs separated.",
            "They started off with Lake Geneva.",
            "Now it's across oceans.",
            "the Chinese have done it through satellites in orbit.",
            "The next thing is going to be at the LaGrange points between the Earth and the moon, or put some senders in there.",
            "So we actually can see this these EPR photons and of course people.",
            "Some of the early applications of quantum information ideas is to say to show how you can.",
            "How you can send your your codes for your cryptography codes could be sent in a way that you can you could you could in principle tell whether they'd be intercepted.",
            "You go from Alice to Bob and there's even the middle who's trying to read it, and if even even manages to read the code, then you then you can tell that she read it 'cause the quantum mechanical state is ruined, etc."
        ],
        [
            "So, as I say that the era of discovering what kind of cool things can be done with quantum mechanics is what started now, right?",
            "So so.",
            "Then you were starting to find out for all this stuff is that we can trying to gain a direct control of quantum states in the past experiments were usually equivalent to bashing something with a hammer and seeing what pieces flew away.",
            "Now we're trying to kind of manipulate quantum states more like by gradually nudging.",
            "I mean some directions to avoid kind of doing what we call a measurement, but just gradually change them and store information in it.",
            "And what we actually finding is that quantum mechanics can.",
            "Can do allows many many strange things that we didn't really imagine possible to happen, and in fact one of the new ingredients in what people are talking about.",
            "A second quantum Revolution, the first one being 1928 to 32.",
            "We're kind of starting to kind of we've starting to actually bring in a lot of these ideas which were really stimulated by EPR and entanglement in quantum information theory and try and get a deeper control of quantum States and it's quite plausible that this is going to.",
            "Lead to two interesting new technologies.",
            "As we gain an understanding in the next century."
        ],
        [
            "So this is a classical information as opposed to quantum information is stored in a in a bit right, which is a number of.",
            "It is really a switch which could be on or off one or zero, and so there's my switch switch could be determining a large number of spins in a in a magnetic material.",
            "The spins of the electrons like to line up positive at least some of the electrons want to line up with all their spins in the same direction, so a little piece of iron.",
            "Will have magnetized in a certain direction and will have a lot of other conduction.",
            "Electron spins were pointing one way.",
            "An If I flip the direction of this magnetic domain, they'll be pointing the other way.",
            "So this is a classical switch which could be thought of as huge large amount of electrons with spin in One Direction and the other state is a large amount of electrons with this bin in the other direction.",
            "But quantum information is stored in the state of a single spin qubit, which you then have to.",
            "Read by a measurement which requires you to make a choice of measurement axis and the basic point is that.",
            "In the corner of the spin actually can be pointing in any direction, right?",
            "And so the information that be stored in the cube.",
            "It is not just up or down because the axis on which you decide to measure is your choice in some way.",
            "The spin is spin.",
            "Could actually point in any direction and they call this a Bloch sphere and at least from this picture.",
            "The information is stored in a complex number, which represents an amplitude, but there clearly is.",
            "There's more information you can store by the direction in which the spin is pointing in, and just then upward down, and that's the secret of where the extra quantum information can be stored."
        ],
        [
            "OK, So what is this got to do with topological quantum matter which is the work I did another state and as I say, to the best of our knowledge, the basic laws of quantum mechanics were established during the first quantum revolution, maybe the first one was actually the second one, because there was this early early quantum mechanics around 1912 or so due to bore which came up with this little planetary picture of the Atom.",
            "But both theory is a cartoon.",
            "The Connor mechanics that was found between 1928 and 1932 basically cleaned up a full proper, full and correct account of atomic physics, nuclear physics.",
            "So all these kind of developments later or just applied quantum mechanics.",
            "The basic rules were found then and the basic point is just because we know the laws of quantum mechanics doesn't mean that we know everything that's allowed to happen.",
            "In fact, the same thing comes with.",
            "Electromagnetism Maxwell discovered finished the Maxwell equations around 1870 or so and.",
            "Once you've written down Maxwells equations, you basically written down all of Electro or everything about electromagnetism is in there, right, but of course to you know how we smartphones and and X Rays and all kinds of things work.",
            "Is a lot more than just writing down the Maxwells equations, and in fact when Maxwell presenters equations, there's a famous conversation he had with Gladstone before Gladstone became Prime Minister in England when he was another lesser minister, he said.",
            "Professor Maxwell, what uses all this?",
            "Mr Maxwell replied Mr I can't tell you right now, but I can tell you for sure that one day you will be taxing it.",
            "So of course we know that you know electromagnetism really created a fantastic new technology and but it took quite a long time to understand.",
            "For example, in electromagnetism photonic crystals and things were only kind of even conceived of in the 1990s and manipulating the flow of light with very interesting things.",
            "So there's still developments going on in electromagnetism that we."
        ],
        [
            "So quantum mechanics.",
            "So as I say around 1980.",
            "Condensed matter physicists and condensed matter systems fancy used to be called solid state physics, but when the transistor was invented, all the kind of transistor radios had solid state written.",
            "It was very proud that they had solid state components, so everyone thought you were working on transistor radios.",
            "If you were solid state physicist, so they incorporated liquid's in it and change the name to condense matter, which means atoms are clumping together under the forces that bind bind together by various forces.",
            "Quantum mechanical forces or whatever as opposed to gases where they're all moving around separately, right?",
            "So as I say, people thought they had a basic understanding of condensed matter physics by 1980, and this is all the stuff I learned when I was a student, but independently around that time to kind of weird properties, unexpected properties were found, and these turn out to be.",
            "Properties of new kinds of states of condensed matter, which quantum mechanics, quantum mechanical entanglement plays a much larger key role in a way that it doesn't in in in the more normal states of matter, and you can view this as two tips.",
            "So initially one with some work on magnetism that I discovered around 1980 and almost about the same time work classified Klitzing experimentally discovered the quantum Hall effect.",
            "Which, if I have time, I'll get to and the these were initially had no obvious connection of any kind between the two, but they both turned out to be early examples of this new kind of topological matter that really hadn't been guessed at before they were found, so this was a theoretical discovery, and this was an experimental discovery.",
            "Both of them were unexpected.",
            "I now you could view this as a metaphor of the iceberg, because since then, many more kinds of.",
            "Topological quantum matters were found particularly in the last decade, and all kinds of interesting, much more interesting parts of it have come to light, which could be useful for the quantum."
        ],
        [
            "Information, think so, topological matter.",
            "What does that mean?",
            "Topological matter differs from an ordering matter becausw the entanglement properties.",
            "That has actually can be described by like whole numbers.",
            "Integers like minus 1253.",
            "From this viewpoint, ordinary matter would be described by a boring number, and I've actually been rebuked for this because the mathematician said the number 0 is not a boring matter and number at all.",
            "It took a long time to discover.",
            "But basically yeah, the number zero was not known until I guess the Arab.",
            "Certainly the but anyway, simple numbers like one or zero weather ordering matter, more exotic numbers.",
            "Describe the topological matter and the basic point.",
            "Is that whole numbers can't just change continuously.",
            "The whole number has to jump from one to two.",
            "Is a jump.",
            "You can't go continuously from one to two and stay a whole number.",
            "You can go from 1 to 1.3 one .35, but that's but if you're forced to be a whole number, you gotta change.",
            "So if the matter is described by has some property which you could label by a whole number, then there has to be something interesting at the boundary.",
            "Between.",
            "The topological matter and the normal matter, and it turned out to be one of the very characteristic things of topological matter, was that it had something interesting going on on the boundary between it and normal matter."
        ],
        [
            "So regular matter we'd understood by 1980, we understood crystals.",
            "In crystals the atoms inside of crystal form some regular little pattern in what's called the unit cell, and then these things are stacked together to form a nice regular array, and people study this.",
            "This has something called broken symmetry.",
            "Clearly I can't just move sideways by number, and I can only move sideways by the discrete jump, and this thing is also broken rotational symmetry.",
            "If I rotate, it's different.",
            "So a lot of all the work.",
            "Prior to this, and focused on the properties, we call broken symmetry, which was the basic understanding of interesting parts of matter, crystals and things and superconductors and this thing.",
            "Nothing special is particularly associated with the edge, while the quantum Hall effect or the spin chains they have a feature that something interesting is going on at the boundary.",
            "And in fact, in the quantum Hall effect is very interesting.",
            "This there's information or states can travel only in One Direction around the boundary, which is quite surprising.",
            "Accounting like a one way street.",
            "But in the bulk we have something we call a topologically ordered liquid, and by looking at it, it's got no broken symmetries.",
            "There's no symmetry difference that between the inside and the outside, but there's this topological difference which requires something funny to happen at the boundary.",
            "And as I say, unusual expectations are kind of.",
            "So they inevitably present in almost 11 to present it at the boundary between this top."
        ],
        [
            "Logical matter an regular matters.",
            "So what's the importance of that?",
            "As I say, the whole number can't can't change continuously, and that means that topological matter has a much greater stability than.",
            "The property is a very stable in the sense because if I remember how you make a chip for a computer, this Silicon wafer has to be created an extremely clean room.",
            "You've probably seen pictures of people in this space suits basically one little speck of dust from your hair.",
            "A little bit of dandruff or something will fall on the chip.",
            "It's completely gone.",
            "You have to throw it away so you have to take incredible precautions to make everything clean because a little bit of dirt will ruin ruin.",
            "This nice, beautiful Silicon wafer and make the computer chip.",
            "Not work, but if the property depends on a whole number, you actually have to do a significant amount of damage to change it, so a little bit of damage cannot change the topological property, so you've got in principle.",
            "At least there is a there is a.",
            "Threshold you have to make it damage it sufficiently badly to change it."
        ],
        [
            "The classical example of topology which the people at the and the Bell Press announcement were trying to explain all this stuff to the public was is the theory of the number of holes in mathematics.",
            "Topology is a classification started off as a classification of close surface is by number of holes and this leads to this issue of Donuts and bagels and things and basically a shape with a sphere or ball has no holes.",
            "It can easily be distorted.",
            "You can change a European soccer ball.",
            "You can squeeze it and make it look like a rugby ball or an American football or whatever by squashing it, but it doesn't change the number of holes to make a hole in it.",
            "You gotta do a really significant amount of damage to punch a hole through the wall and change it to a donut shape, and basically holds a couple logical objects because no one you can't say.",
            "I've got .36 of a whole.",
            "You've either got one hole or no holes, or three holes, right?"
        ],
        [
            "And.",
            "So geometric properties such as curvature of the surface is a local properties, but the amazing thing that cognitive grouse discovered was that integrals over local properties can actually characterize the global topology.",
            "By studying carefully the surface, you can actually count the number of holes, and actually Gauss discovered many amazing mathematical properties, but this one I think he believed was the strangest and most important thing that he found.",
            "He has a Latin name for it.",
            "Theorema egregia know or something?",
            "And this is the so called Gauss Bonnet theorem, which for high school students is.",
            "Kind of trivial, you will learn in high school at the surface area of a sphere is 4 Pi, R-squared and Gaussians.",
            "Gaussian curvature is a product of the radio array of curvature, which for the sphere are equal in both directions.",
            "So it's just one over R-squared.",
            "So Gaussian theorem just tells you that four Pi R ^2 * 1 / R squared is 4 Pi.",
            "Now the amazing thing that Gauss discovered was while this detail of this integral changes completely as I start to distort the.",
            "The sphere into a football or a banana or whatever.",
            "It's a this number doesn't change so long as I don't make a hole in the system, you still get four Pi, so this is an easy homework for a high school student, but if I gave you the spheres of banana shape it would be a very challenging piece of mathematical calculus to verify that.",
            "And of course a sneaky teacher could have give this as a homework problem.",
            "We had very easy grading with the homework to do 'cause he knows the answer with only four π or whatever it was depending on the thing.",
            "So it's a trivial."
        ],
        [
            "Statement for sphere but non trivial for another manifold and this is the famous business about the coffee cups.",
            "So the ball is topologically equivalent to a mug with no handles.",
            "The bagel has got equivalent to the coffee Cup with one handle.",
            "This thing is called a loving Cup.",
            "It's got two handles, I guess two people could share it or something, and this was apparently in the invented something called a Swedish pretzel, which really is a Santa Lucia bun, but in actuality the.",
            "The holes in the middle get filled up when they bake it, so it doesn't actually look like that.",
            "This is so called German pretzel where the number works out eight Pi and they actually do find some objects like this.",
            "I didn't actually know what the name of this is, but someone suggested this should be called a California loving Cup."
        ],
        [
            "Anyway, so as I say, before 1980, topological quantum banner was unknown, and then we found this this stuff and as I say it took a long time to understand that, but we finally achieving."
        ],
        [
            "Thanks so I'm not sure how much time I have, so maybe want to skip over a few things, but as I say the quantum and it turned out that quantum entanglement was a key thing and that apology was related to an entanglement.",
            "So if things are trivially entangled you can cut them in half and there's no, there's no, there's no connection between this side on that side, entanglement if they're entangled, if they're not entangle, it means.",
            "If I measure something in this side of the of the system.",
            "It won't affect anything that happens on the other side.",
            "OK, but for the topological matter which has this kind of edge state to it, if I try to cut the thing in half, I pull it.",
            "It's initially initially bit difficult to pull it.",
            "I say you have to do a significant amount of damage before you actually change the topology, so it's starting to resist a bit, but suddenly you pull it apart and then the things are separated and but now in the entanglement got replaced.",
            "In some sense, the entanglement between the two had to terminate on something, and that's what causes these.",
            "Edge states to be there, so it's a bit like you try to break a bar magnet into two.",
            "You want to separate the North Pole and the South Pole, but by the time you separated it, you still got a New South Pole in a new film North Pole on each and each of the magnets.",
            "So the entanglement which used to go all the way through from one side to the other is broken, but it gets.",
            "It has to terminate on something and that creates these.",
            "These these new unexpected edge states, right?"
        ],
        [
            "So the topological states of insulated matter can in principle be assembled by bringing the matter together, just bringing atoms together, and if it forms a topological state, something has to happen on the way as you bring the atoms together to form this material.",
            "And that's where this thing happens, and in fact."
        ],
        [
            "Once something is known, you actually can go back and find it was.",
            "It should have been discovered earlier, right?",
            "A lot of these, a lot of things that get discovered.",
            "There may be some some funny little detail here and no one realize the importance of the general principles behind.",
            "And in fact you can go back to, uh, calculations in 1939 by Shaklee you actually went on to invent the transistor at Bell Labs, but you bring this kind of toy model of atoms together and they manage to do some kind of calculation, and you bring the atoms together and calculate their energy levels and things.",
            "When they widely separated or just discrete energy levels of an Atom, this is a toy model Atom in one dimension.",
            "But as you bring 'em together, you see something happens and the these bands form which join up and the split apart, but you leave the head.",
            "They leave interesting states which turned out to be the edge states behind, and so this actually is essentially today's topological insulator that got discovered in 2006.",
            "This is actually crystalline topological.",
            "A symmetry protected topological insulator, but so the interesting principle is that.",
            "Yeah, you find this stuff."
        ],
        [
            "And let's skip some of this."
        ],
        [
            "OK, so one of the interesting things you see in The thing is that if you fill the electron levels up.",
            "You have to fill him up to a point in between, which is called Fermi level or the chemical potential.",
            "So if there's one electron per Atom, the chemical potential would be here.",
            "If you go through here would have to be trapped in this tiny little gap between these two states, so most likely it will be down here.",
            "One electron is lost from the system, or another electron is added to the system up here and then.",
            "Where did that other electron go?",
            "It actually went into the system, but half of it went down to one end and half went to the other end.",
            "So one of the typical weird things you see in topological matter is.",
            "The electron which we think of as individual particle can actually get split into fractional pieces, and in fact I was being told interesting experiments going on here that could possibly be fractional charges in some interesting compounds, but but so."
        ],
        [
            "So for example, in a spin chain or whatever, you can have one electron, maybe citing you break things up and pull electron out, and then this object can split into two.",
            "So one of the typical things you see in the topological states is fractionalization."
        ],
        [
            "OK, so let's say in heavier atoms electrons.",
            "So what I found, let me just give one of the things I found.",
            "I'll quickly go through a few things.",
            "The electron magnetic atoms, the spins in the electrons.",
            "Well they don't form a entangled state.",
            "With the spins you put them in parallel to each other and they line up and they form a.",
            "The elementary spin is the spin of the electron and you can formally called 1/2.",
            "It's a half integer angular momentum and you add them up together and the spin.",
            "Is 2 S of these things added together to make a spin S and the basic thing is the spins that go into the Atom.",
            "There has to be a whole number of them and the big difference when I discovered it mattered where there was a whole number was even or odd, and that's what people hadn't discovered.",
            "Decided before and it turned out to be because of this."
        ],
        [
            "Logical entanglement property.",
            "So in 1981 I discovered the spin one chain could have another, uh, another problem.",
            "The previous expected state of the system is something called an antiferromagnet.",
            "Whether whether the spins the magnetic moment, the direction of spin is equal and opposite on neighboring atoms so they kind of look like that.",
            "So this was the kind of expected state.",
            "This is entering state with long range order.",
            "It's got a broken symmetry that if I translate by 1 unit it's not the same.",
            "So this is an example of a characteristic broken symmetry state of the old style, but there's actually no entanglement.",
            "I could assemble this by bringing atoms in for Infinity and just lining him up in this way, right?",
            "So there's no particular entanglement across this boundary here, so if I cut it I can just separate it and nothing happened.",
            "So if I did a measurement of this Atom spin, it wouldn't affect the spin of the Atom down here, and it turned out that what I discovered is that if the if the spin is half integer spin.",
            "Integer rather.",
            "You've got a much more interesting state where and if I got it on the next slide, I probably don't.",
            "You can think of the.",
            "The thing is, the spin splits and each of these atoms has like two hands and you form a chain of people who link their hands together and then at one end of the chain there's one free hand that can wait around here and the other end of the chain there's one person with a second freehand, so I've managed to usually would say that people that the two arms of people that join to people there kind of connected.",
            "You gotta rule that flows.",
            "You didn't have an accident or something everywhere the two arms always come in pairs, right?",
            "But by this trick of of entangling the people by forming a line where they hold hands, you can actually have a free hand that can wave around it without without a local partner to go with it, 'cause the local partner was fixed by grabbing the neighbors hand, and this is actually the.",
            "The first of all this is this entanglement spreads across the system, and then you've got these free half integer spins at the end of the chain, which was something pretty unexpected and you can see if I actually break the system if I pull the two hands apart, I end up with.",
            "Two hands on the end of the spin."
        ],
        [
            "So this is actually because it sounds very simple, but this was.",
            "This was a challenge because it actually fundamentally involves a state with entanglement spread across the system, which wasn't a feature of the earlier thing.",
            "No one had thought that you had to worry about entanglements, and because I didn't know it was entanglement, but so this was actually.",
            "Extremely trivial looking observation, but it was incredibly controversial because it actually challenged view of magnetism that had been accepted for a long time and no one believed that there should be anything should be different between integer spin and half integer spin.",
            "It turns out this is a special property of and often dispenses behave differently.",
            "This kind of state could this kind of fate requires 2, right?",
            "If the spins of only one hand around you couldn't form a chain where you everyone join hands, you have to have two hands to form a chain of people to to link together, and this was sort."
        ],
        [
            "Significant enough that they they put the picture of that thing on my.",
            "Everyone gets a kind of a little kind of diploma on one side, some stuff about in Norway, in Swedish about whatever it was, and then artists impression that what the theme was.",
            "Doors opening to an unknown world was a theme of this prize and.",
            "The OR each of us got a different thing opened up behind the door related to what their work was.",
            "So let me just."
        ],
        [
            "Chiefly talk about the other effect, the quantum Hall effect, and again, this is a thing where you.",
            "Have a current flowing through something and the whole effect is if you measure the voltage drop across the play for the current flowing.",
            "You can tell if the electrons are what's moving.",
            "This is the way you know that electrons are the usual thing that move in a metal, although one of the advantages of quantum mechanics was to show the invented discovery of the whole, which is important for semiconductors, and this also takes a little bit of thinking to get your brain around this, because what in a P type semiconductor what's moving is.",
            "Not an electron.",
            "It's the absence of an electron a whole.",
            "Again, that's a very deep concept.",
            "That's obvious, but took some understanding from the Pauli principle that you could have such thing.",
            "So the amazing thing was they did a measurement of the whole resistance among Klitzing discovered in under certain conditions is singing in high magnetic field.",
            "This number turned out to be.",
            "Mental constants the relation with the ohms law.",
            "This is well written backwards I = v / R really.",
            "Conductivity was some fundamental constants involving Planck's constant and the electron charge, and in the first case a whole number and now a fraction, and these are so this was accurately quantized.",
            "In fact, this is going to be the foundation of the new system of units, which is going to be announced later this year.",
            "Some International Congress we're going to be amp used to be defined by force between current carrying wires, and now we're going to define it through this.",
            "So this turned out to be.",
            "This was actually quantized.",
            "Initially people looked for relativistic corrections.",
            "Is there some?",
            "Is this depends on the electrons not moving fast and it turns out to be a completely topological thing and the only reason that can violate this is the size of the sample have to be big enough that you can't have quantum mechanical tunneling between the two, but that falls off exponentially so.",
            "The corrections to this only do so, provided the distance between the sides of the sample is large enough on an atomic scale or whatever, then this is perfect, right?",
            "It's topological and it turned out it wasn't.",
            "Of course I understood it was topological, but in retrospect anything that involves whole numbers has to be topological and the amazing."
        ],
        [
            "Thing was, this is a sample in which at least the fractional version of this effect was discovered.",
            "So clearly someone doesn't look very kind of skilled with a soldering iron here, right?",
            "But basically a sample like this could show this perfect effect because of this remarkable robustness of topology that you so long as it doesn't have to be perfect, it just has to be good enough, right?",
            "This kind of thing can actually show things up and a little bit about explaining what."
        ],
        [
            "Yes, I could probably skip, but basically the quantum mechanics says electrons flow in high school chemistry.",
            "You learn you, you've got this sort of orbitals in an Atom and the power principle so."
        ],
        [
            "If you kind of populate them and you're allowed to put up and down in each orbital, which was how the periodic table gets explained, the quantum Hall effect in some sense can be viewed as a."
        ],
        [
            "It kind of Atom.",
            "The basic thing is you've got a magnetic field, and if anyone's done from a little bit of physics, you kind of know that electrons in a magnetic field go round in little circular orbits.",
            "And the important thing else, the center of the orbit.",
            "There's only a kind of certain number of independent ways to put the orbiting, but if I take if I look at this thing, the energy is like a like a planet in the quantum mechanical view of the Atom, the old one the planetary orbits will counsel here.",
            "There's only a certain set of radius of orbit.",
            "The energy is quantized, and there's an orbit of 1 size and orbit of another size, and that leads to."
        ],
        [
            "Thinking like an atomic levels instead of just being SPD with a few.",
            "There's actually a huge number of levels.",
            "One, the number of levels in each of number of states in each of these levels is proportional to the size of the system.",
            "Depends on how big a box these electrons are moving around in, and the quantum Hall effect had the initial, and when you count the number of things, if you actually fill one of these orbital levels, compl."
        ],
        [
            "Really like in an Atom, you actually of course find an energy gap to the next, and it looks like you've explained the quantum Hall effect.",
            "If the exactly N orbitals occupied completely, you'll get the right relation between the electron density and magnetic field.",
            "To explain the quantum Hall effect.",
            "But this is not can't be the possible explanation, because as I change the magnetic field, the number of levels changes, so there will only be exactly precisely one magnetic field, which this could happen.",
            "While the one kissing discovered effect because he was like he was wise enough to good design his experiment not to switch on the magnetic switch on the current with the field in place, we have never got to exactly the same current have always got a slightly different ones.",
            "He switched on the field with a constant current in place in a digital voltmeter and the digital voltmeter ended up reading the same number to some.",
            "First they thought the digital voltmeter had to be a bad one because it kept coming to the same number of significant figures it was like.",
            "And it turned out, of course it wasn't, and the numbers were significant, so the topology is what means that the magnetic field didn't have to be fine tuned in in fact."
        ],
        [
            "It was only later that this was learned, really understood to be topological.",
            "If I put the system in a box, then inside the box the electrons go around the little circles, but some of the circles near the edge of box they're going to hit the walls of the box and bounce back.",
            "And instead of the circle instead of going around in a clockwise orbit, you'll find the ones that the boundary kind of go round in an anticlockwise hopping motion, skipping motion, and the energy is changed because the ones in the box have a nicely quantized energy, but it's only going half there, kind of.",
            "And as you gets messed up, so if you go in the box, the energy levels aren't just straight like this, that they get to the end counting from the center of the box, they start to bend upwards and the highest level.",
            "Let's fill this called the Fermi level.",
            "And basically you can see that there's going to be a gap in the middle of the box wherever the firm if you can change the Fermi level, it's going to influence the boundary, but not this into the box.",
            "So again, this says the first indication that this actually was a topological effect and its associated with this very characteristic.",
            "Feature bound."
        ],
        [
            "Reason for my one of the Co people.",
            "One of the two Co laureates he he basically he did two things.",
            "One of the things related to this that he came up with a beautiful calculation that obviously I can't go into.",
            "But again toy models.",
            "It turns out the realistic system.",
            "You've got some more kind.",
            "You got some dirt in the system and it's all messy.",
            "It's not a perfectly clean box, but theorists like to work with things they can actually solve and he looked.",
            "He studied the problem of a nicely periodic.",
            "Potential in the box, which is completely unrealistic but is in principle similar and he found he found out of."
        ],
        [
            "It's a formula.",
            "He found a formula for the whole thing, which turns out to be mathematically.",
            "Related essentially, a generalization of the Gauss bonnet formula I shared so the Gauss bonnet got formula.",
            "Got generalized by mathematicians in a much more abstract way where the curvature became not the physical curvature of a donut, but the more abstract curvature.",
            "This will call the Berry curvature, but mathematically it's some curvature and some surface and you know the Donuts are kind of the real issue is not real Donuts only shaped like that?",
            "But mathematically this is totally equivalent to what the.",
            "Explanation of all this stuff using Donuts and coffee cups and this formula."
        ],
        [
            "That they found, and then it took a."
        ],
        [
            "Say it was in retrospect, so this explained it, and in fact the other thing I."
        ],
        [
            "Describe the other day was.",
            "The final piece of the thing that really unleashed a topological revolution many years later was that you could do this without a magnetic field, and I described that yes."
        ],
        [
            "Today so."
        ],
        [
            "Amazing things so so this system has stuff that goes around, goes around the edges without in one way, just like these skipping orbits."
        ],
        [
            "And it turns out you can do the same thing with light in photonic crystals and put, put, make these topological States and have put a boundary in the way and stuff still goes 11 way around the edges."
        ],
        [
            "Topological insulator."
        ],
        [
            "All kinds of stuff."
        ],
        [
            "Here.",
            "Fractional Hall effect is where we have our great hopes for storing quantum information.",
            "I'll show you one."
        ],
        [
            "Picture."
        ],
        [
            "Quantum Hall Flamingo."
        ],
        [
            "Put this picture here."
        ],
        [
            "So in fact this is a image of what people are hoping to store quantum information in.",
            "This is something where we've.",
            "This is a quantum Hall effect fractional, but in fact now people are trying to do this with other wires.",
            "This probably heard of Myron's was a big kind of big thing a few years ago was claimed in claim discovery of Marana Edge edge states.",
            "These are these are like edge states or.",
            "Viruses, so I make some defect in these States and it turns out that.",
            "You can store it looks like I've just got four things here.",
            "They actually four places where a quarter of an electron is start again, this funny fractionalization and quantum mechanically.",
            "There's a hidden degree of freedom in this four quasi particle system of non abelian quantum Hall state that there is hidden in there.",
            "You can entangle these things in two different ways, which and I've chosen this got some kind of this is on the surface of a sphere, so it's got some.",
            "Tetrahedral symmetry, so I've chosen two particular symmetry combinations, so when you look at it, you look at it on the without detail.",
            "You see, there's kind of four blobs there, which will contain 1/4 of an electron, but the two if you entangle them in one way you can.",
            "There's a very tiny little wiggly pattern that's different for the two ways of in tangling it, and I can take a quantum mechanics.",
            "I can take a linear combination of those States and then the pattern changes, but so.",
            "As you pull the things apart, this little wiggles get exponentially small, and when they are far apart from each other, they imperceptible.",
            "So the big problem of destruction of the information is if a cosmic Ray or something passes through or piece of then it could.",
            "It could, in principle behave differently depending on the wiggle pattern, and that would measure it in some way.",
            "But so once these things are spread out, the information which is vaguely hidden in this little wiggle pattern is become spread out all over the system and damaging it.",
            "One place can't affect it, and so this is an example of the thing that where the hiding of information in the pattern of entanglement inside the system.",
            "This is a dream for the topological quantum computer.",
            "And then I say there's all kinds of amazing things that keep getting discovered in this area.",
            "You know people have gone or they started off my works.",
            "Kind of little piece of it, but somehow it opened up a floodgate of people looking at this stuff and and all kinds of great things get be found by.",
            "Lots of people, so they're all going to be my bet for the next Nobel Prize in this area would be if this stuff could.",
            "If one can actually show demonstrate this hiding of quantum information and maybe manipulating it would be, that would be incredibly exciting.",
            "Experimental development and lot of people are trying to do this right now, and."
        ],
        [
            "So anyway, there's a lot of things going on.",
            "I haven't got it.",
            "Can't go into everything, but I would say you know the whole cattle."
        ],
        [
            "Things I would just say there's a lot more in this and there's a great future.",
            "And who knows what will the future is of course difficult to predict as the baseball star forget his name in America.",
            "Supposed to set it.",
            "It's hard to.",
            "What you predict to all the future is hard.",
            "It's hard to make a prediction, but we can predict about the past but not the future, but.",
            "As I say, this stuff is opened up and it's certainly becoming intellectually very exciting area and lots of young people have got excited about topology and and number of seminars where you see the coffee Cup and the Donuts turning into each other.",
            "I mean I said please please at least show the loving Cup.",
            "Well, thank you.",
            "Thank you for wonderful presentation.",
            "We have a few quick we have time for a few questions so please.",
            "Don't be shy, there's a question there.",
            "What is theoretically possible to use groups of quantum entangled particles?",
            "Which properties we could control?",
            "To teleport objects.",
            "Well.",
            "I'm not sure objects, I guess.",
            "It's the teleportation is really the teleportation of information, I think.",
            "So the information is contained in the quantum state and there's a theorem that says you can't copy a quantum state.",
            "You can't make a copy of a quantum state because in some sense too.",
            "If you want to want to make make a quantum state exactly equal to another quantum state.",
            "Of course, you could always measure it and then find out what it was and then make a copy of it.",
            "The idea is to copy it without measuring it, so you have a quantum state you don't know what it is you want to make, another one, which is exactly the same it tells us.",
            "Basic theorem that says you can't do that.",
            "You can't copy a state without measuring it, and then of course.",
            "But the teleportation ideas you can take a state that you don't know what it is and you which is probably a set of atoms or spins at this point are in that state.",
            "The information is encoded in that state, but if you're trying to measure it, you reveal it and you can't process it anymore.",
            "So the quantum the teleportation issue is to take those state of those atoms and move it to another set of atoms far away.",
            "Of course, this information will no longer be here 'cause you couldn't copy it, so you've removed the information for those and put it over there and transmitted it.",
            "And that's what all this talk about quantum teleportation protocols are is for your teleporting, not the matter, but the state.",
            "Now, of course, you could argue that that I'm just a state of matter in a certain thing, and if it was, you know, Star Trek.",
            "Much finer.",
            "You tell that when you step into the box on this side, you are being destroyed here and and they and the other person who owned the box said, don't worry, you're going to be reconstituted over there, but of course this is a question of trust, right?",
            "But but if, of course, if you say we're just a state, then.",
            "The matter itself is not getting transported.",
            "What's getting transported is the state of the matter is basically making, as I say, the making to remove the information here, destroy the stage, right?",
            "This is like but you move the state without actually knowing what it was without measuring it.",
            "And then you can, because in all this quantum protocols for quantum computation you manipulate the state and you do very things with it.",
            "You've got to get the answer out at the end of the day the answer is got by doing a measurement, right?",
            "But of course you can only do that after all the manipulations have been done, so you have to move the state around, and in this example, let's see if I got it again.",
            "I probably not.",
            "I'm not sure how to get out of this without I shouldn't have stopped it.",
            "I've I can't control this on my computer anymore because it's all I've got the wrong screen, but the if these things were the four blobs you can move them around the computations actually supposedly done by by called braiding.",
            "You got these these?",
            "Four things and I move one around the other in a certain path and it changes the quantum state.",
            "These little wiggly information patterns get changed by dragging one through the other and the computation protocols involve stiring this thing up and provided they never get close to each other.",
            "You're protected, the information is protected now.",
            "There's still at the end of the day, there's still an issue of getting it out, right?",
            "So you actually have to bring something close together, so there's still a dangerous period when you try to extract the information.",
            "And of course, but so as a theoretical possibility conceptually, this is, this protection is very appealing as avoiding this whole issue of entangled with environment because the information is not.",
            "It's stored locally.",
            "It's a bit like your memories in the header kind of thing.",
            "We know a bit more where they're stored, but you can get, you know you can get shot in the head and and parts of you missing, but you can reconstruct.",
            "It doesn't have.",
            "It's not clear where the memory.",
            "You can't just ZAP a particular neuron and say the memory is gone, 'cause it's stored is stored in this kind of non locally right and simply information can be stored in this nonlocal paddle of entanglement.",
            "And conceptually that's a way to avoid this whole issue of contamination by the environment now.",
            "There's lots of 1st Quantum computer, maybe a small one and maybe they build it with ion traps and things.",
            "But also there's lots of different Google or backing.",
            "One thing Microsoft put a billion dollars into braiding.",
            "China wants to put 10 billion dollars because they want to have the world for me.",
            "Lots of.",
            "I mean, there's lots of lots of different approaches, which is good 'cause they're all competing with.",
            "Competition is really pushing people and.",
            "And the claim is that if you get you just the claim is you.",
            "If you could make a 50 qubit computer, you could beat today's Q, but if I don't have true or not, but that you know, starting off, we're trying to make a three qubit computer, but to push it to 50 we've got this big problem making things bigger.",
            "And this is 1 one approach, but it may not be the one that wins, or maybe none of them win, right?",
            "OK, some more questions please.",
            "Somehow, this revival of entanglement is that.",
            "True that in fact, normal ground state of the matter are not entangled.",
            "That's why it's only rediscovered now.",
            "Or yeah, normally the this is the kind of kind of long range topological entanglement Sensi, as I say in this spin chain, you chop it.",
            "The entanglement if it's going all the way through it.",
            "If you break it, it's gotta stop.",
            "So in some sense, that's why the boundaries.",
            "So the normally of course there's always entanglement.",
            "A short short amount, but there's no kind of profound entanglement like there is in these materials, so.",
            "If you have two pieces of matter, of course, if you make a measurement of 1 pic close to another bit, they affect each other, but the measurement doesn't affect things at long distance, so so the normal things that the toy model of just a completely independent atoms assembled into a into a line.",
            "Of course they do interact a little bit, but they don't have this kind of dramatic.",
            "Difference topological difference.",
            "So everything is a little bit entangled across any boundary.",
            "There's some entanglement in quantum mechanics, degrees of freedom or not.",
            "They're all connected, but.",
            "The the topological stuff is is quantic qualitatively different, which is why it's topological right?",
            "Hello.",
            "Hi asking care.",
            "Are there some possibilities to get two entangled states also in living matter?",
            "In biological in biological matter, is it possible well that some far out ideas that my colleague Matthew Fisher has been pushing?",
            "But yeah, I mean, there's often a strange ideas about you know.",
            "In fact, Nobel Prize winners often go off to say I want to.",
            "Well, I can't do anything more than what I've done.",
            "So let's think about the brain right?",
            "Cooper did that.",
            "I guess.",
            "There's the.",
            "Love.",
            "Hawkings Colette Hawkings mentor.",
            "What Penrose right.",
            "Yeah Penrose, of course, went off to the brain and had some complicated thing with what did the brain to work by quantum gravity or something, and well, it was interesting observation by my Matthew Fisher is a pretty well known condensed matter theorist.",
            "He's been interested it was interested in the issue of why lithium works for you know.",
            "For manic depression or bipolar disorder, and it turned out that the claim is that it depends on which isotope of lithium that is and and so had some ideas that maybe there was.",
            "Where could you find biological thing at first sight is there's no kind of quantum coherence, but fairly the nuclear spins can be can form some kind of cage of molecules.",
            "Water molecules around the lithium ion or something where the.",
            "The lifetime of the quantum state of some of these nuclear spins.",
            "This could be is remarkably large, right?",
            "And so there was.",
            "I mean, they look.",
            "I mean, these are kind of like far out type of speculations, you know?",
            "Of course, consciousness and the way the brain works is kind of still one of the big things which is going to be worked on tremendously in this next century.",
            "And who knows what the robots will have?",
            "Consciousness or not, but, but yeah, so I mean so.",
            "But all this stuff is kind of like very far out speculation the BBC picked up Matthew Fisher stuff and the guy in the BBC put a big long article about.",
            "You know, quantum physicists, and.",
            "Brayden Penrose and things, but, well, you know, we can see if it's this stuff gets stuff gets reduced, or I mean it's difficult at first sight to see where quantum quantum quantum mechanics and voice there for the molecular bonds, but coherence of quantum states could play any role.",
            "But but nuclear spins, for example, rather well disconnected from the electron spin, and there are not ones place.",
            "I think it's probably a good time to stop.",
            "Thank you very much.",
            "It's been a wonderful Holidays and thank you again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ladies and gentlemen, friends, colleagues.",
                    "label": 0
                },
                {
                    "sent": "It's great pleasure for me today to announce the speaker.",
                    "label": 0
                },
                {
                    "sent": "It's Duncan Haldane.",
                    "label": 0
                },
                {
                    "sent": "Otherwise, Frederick dunckel.",
                    "label": 0
                },
                {
                    "sent": "Michael Haldane.",
                    "label": 0
                },
                {
                    "sent": "Now I'd like to say a few words of introduction.",
                    "label": 0
                },
                {
                    "sent": "He was born in London's and is a British citizen, currently still European.",
                    "label": 0
                },
                {
                    "sent": "He's unique, US resident.",
                    "label": 0
                },
                {
                    "sent": "But what perhaps so many of us is important that his father was a British Doctor Who met his future wife in Klagenfurt at the end of the war vets.",
                    "label": 0
                },
                {
                    "sent": "Until Amit, thank you very good.",
                    "label": 0
                },
                {
                    "sent": "Who was a medical student at the time and they essentially his mother Lyudmila Ranco.",
                    "label": 0
                },
                {
                    "sent": "This has been her future has been to London where Duncan was born.",
                    "label": 0
                },
                {
                    "sent": "He, by his own account he considers himself half Scott, half Slovene correct, which is especially.",
                    "label": 0
                },
                {
                    "sent": "Can be proud of that.",
                    "label": 0
                },
                {
                    "sent": "He was educated in London and Cambridge was awarded a Bachelor of Arts degree at Cambridge in 1978 and in 1978 he was awarded a PhD which he with Philip Anderson himself.",
                    "label": 0
                },
                {
                    "sent": "Nobel Prize winner just a few years before that had a few weeks before that right?",
                    "label": 0
                },
                {
                    "sent": "So you got and avoid in spite of that or OK. Hildene is started his career in France in Grenoble Institute lounge Man and became a assistant professor at University of Southern California in Los Angeles, where he remained until 87.",
                    "label": 0
                },
                {
                    "sent": "In July 86, he joined the physics Department at the University of California, San Diego, where he remained for, I guess, for six years, and in 1990 he became was appointed Professor of Physics at the Department physics at Princeton University, where he still remains today.",
                    "label": 0
                },
                {
                    "sent": "Professor Haldane is known for a wide variety of fundamental contributions to condensed matter physics, including theory of law.",
                    "label": 0
                },
                {
                    "sent": "Ginger, Liquid's theory of 1 dimensional spin chains, theory, fractional quantum Hall effect, exclusion statistics, entitlement Spectra and since 2001 has been developing geometric description of the functional whole effect, which we've heard something about yesterday.",
                    "label": 0
                },
                {
                    "sent": "Haldane was elected a Fellow of Royal SoC and a Fellow of American Academy of Arts and Sciences.",
                    "label": 0
                },
                {
                    "sent": "Fellow of the American Physical Society, FL.",
                    "label": 0
                },
                {
                    "sent": "Of the Institute of Physics.",
                    "label": 0
                },
                {
                    "sent": "Fellow of the American Association for the Advancement of Science.",
                    "label": 0
                },
                {
                    "sent": "He was also awarded the Oliver Buckley Prize by the American Physical Society, up the Alfred Sloan Foundation Research Fellowship, Lawrence Chair, and a direct medal in 2016.",
                    "label": 0
                },
                {
                    "sent": "He shared the Nobel Prize in Physics with David Powlison, Michael.",
                    "label": 1
                },
                {
                    "sent": "Kosterlitz for theoretical discoveries of topological phase transitions, antop ological phases of matter.",
                    "label": 0
                },
                {
                    "sent": "Today's talk is entitled entanglement.",
                    "label": 0
                },
                {
                    "sent": "Missed Einstein's get to quantum mechanics, and I think it's about time that I stop.",
                    "label": 1
                },
                {
                    "sent": "OK, thank you very much.",
                    "label": 0
                },
                {
                    "sent": "OK, Dover done.",
                    "label": 0
                },
                {
                    "sent": "It's great pleasure to be here to settle.",
                    "label": 0
                },
                {
                    "sent": "Steven Institute.",
                    "label": 0
                },
                {
                    "sent": "This is a talk is aimed at you don't need to know physics or quantum mechanics for it, so I'm going to tell you a little bit about.",
                    "label": 0
                },
                {
                    "sent": "The history of entanglements, which is a very was introduced by Einstein as a property of quantum mechanics that was so strange it couldn't possibly be true, but turned out to be quite central to the recent discoveries of these new kinds of topological states of matter, basically.",
                    "label": 1
                },
                {
                    "sent": "Interestingly, topologically entangled states of matter so OK.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me move on.",
                    "label": 0
                },
                {
                    "sent": "So as I say in public, this is a public lecture.",
                    "label": 0
                },
                {
                    "sent": "So it seems hopefully one learns at least one thing in a public lecture.",
                    "label": 0
                },
                {
                    "sent": "So of course quantum mechanics is always a difficult subject.",
                    "label": 0
                },
                {
                    "sent": "In some sense it's more difficult than relativity with business about clocks.",
                    "label": 0
                },
                {
                    "sent": "Quantum mechanics has got issues about measurement and and it's in some sense difficult for both the public and the scientists to understand.",
                    "label": 0
                },
                {
                    "sent": "We don't really, but we work with quantum mechanics, and it's the theory is the correct description as far as we know of the world around us.",
                    "label": 0
                },
                {
                    "sent": "So usually in a public talk about quantum mechanics, the subject that's brought up is the Heisenberg uncertainty principle about the two.",
                    "label": 1
                },
                {
                    "sent": "You cannot simultaneously venture the position and velocity of a particle, or more generally by measuring something you affect it.",
                    "label": 0
                },
                {
                    "sent": "And this is this is flown over into all kinds of areas like economists talk about, you could try to measure something economically you or affect it.",
                    "label": 0
                },
                {
                    "sent": "But I'm not going to talk about.",
                    "label": 0
                },
                {
                    "sent": "The usual.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm going to bring up first 2 basic other key ingredients of the of the quantum theory which relate which become related.",
                    "label": 0
                },
                {
                    "sent": "Which is the Poly exclusion principle for electrons and this entanglement property which was first pointed out by Einstein, Podolsky, and Rosen in 1935 as an attempt to really show that quantum mechanics couldn't possibly be true OK?",
                    "label": 1
                },
                {
                    "sent": "And of course Einstein is.",
                    "label": 0
                },
                {
                    "sent": "It is well known.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For all kinds of important things, Einstein seems to have, every it looks like he likes his big achievements in years ending in five, 'cause he seems to have a 10 year cycle of things starting.",
                    "label": 0
                },
                {
                    "sent": "And of course Einstein is known for all kinds of things, mainly for relativity and his geometric theory of gravity, which of course the last Nobel Prize was finally for the direct observation of the of the gravity waves that were predicted.",
                    "label": 1
                },
                {
                    "sent": "But of course, it's probably not so familiar.",
                    "label": 1
                },
                {
                    "sent": "Einstein actually got his Nobel Prize.",
                    "label": 0
                },
                {
                    "sent": "Nothing for nothing to do with relativity.",
                    "label": 0
                },
                {
                    "sent": "You got it for his early contributions to quantum mechanics and his understanding of the energy gap in the photoelectric effect.",
                    "label": 1
                },
                {
                    "sent": "When you shine light on metals, it ejects electrons, provided the light has the photon of light, has a sufficient energy to kick the electron out.",
                    "label": 0
                },
                {
                    "sent": "And of course, that's how garage door.",
                    "label": 0
                },
                {
                    "sent": "The device to prevent your automatic garage door off and chopping your head off is based on if you walk in front of a block.",
                    "label": 0
                },
                {
                    "sent": "The light beam that gives the photoelectric effect, it stops and reverses the door.",
                    "label": 1
                },
                {
                    "sent": "So Einstein very famously when in his gravity theory.",
                    "label": 0
                },
                {
                    "sent": "He introduced this cosmological constant.",
                    "label": 0
                },
                {
                    "sent": "He wanted to have the universe be static because somehow the equations predicted the universe.",
                    "label": 0
                },
                {
                    "sent": "It would either be expanding or contracting and that looked like there was a beginning of time or maybe a creation which sounded a bit religious.",
                    "label": 0
                },
                {
                    "sent": "So prejudice at the time was to make the thing look static so the universe would be always the same at all times.",
                    "label": 0
                },
                {
                    "sent": "So we introduced the cosmological constant, but about a two year, two or three years later, Hubble discovered that the universe was expanding and Einstein very famously.",
                    "label": 0
                },
                {
                    "sent": "Said that, this was his biggest mistake, but of course Einstein's mistakes have always been incredibly useful, and the biggest mistake is probably of course only about 10 or 15 years ago.",
                    "label": 0
                },
                {
                    "sent": "We discovered that the universe was actually accelerating.",
                    "label": 0
                },
                {
                    "sent": "There was a kind of anti gravity force which is probably the vacuum energy contribution to the energy stress energy tensor, but so of course there's still a kind of puzzled about why the cosmological constant should be so small and things, but basically people.",
                    "label": 0
                },
                {
                    "sent": "Mainly believe that the so called dark energy that was discovered is really the Einstein constant, so his mistake is definitely not such a mistake.",
                    "label": 0
                },
                {
                    "sent": "And in quantum mechanics, again from 1905 he added here of course the famous Three Things Photoelectric effect, special relativity and a Brownian Motion 1915, the Gravity 1925, another contribution to quantum mechanics, the Bose Einstein condensation, which of course is also led to Nobel Prizes in.",
                    "label": 0
                },
                {
                    "sent": "Studying cold Atom gases which exhibit this, I guess 10 years late, but ten years later, in 1935 had become disenchanted with quantum mechanics, and what one might call his second biggest mistake was pointing out.",
                    "label": 0
                },
                {
                    "sent": "He pointed out the property of entanglement, which I'll describe which he thought was so strange.",
                    "label": 0
                },
                {
                    "sent": "He called it spooky action.",
                    "label": 0
                },
                {
                    "sent": "At the distance it said it was so strange whenever, when it was eventually measured or attempted to be measured, it would surely show that quantum mechanics was wrong.",
                    "label": 0
                },
                {
                    "sent": "Well, of course we now know that when they eventually did get measured experimentally, well after Einstein had died, quantum mechanics passed the test with 100% marks.",
                    "label": 0
                },
                {
                    "sent": "But this but of course before I sign it hadn't really been realized how important this entanglement property was, and in recent years entanglement is actually moved from a very philosophical thing to a central part of quantum mechanics, and now it's believed people talk about entanglement as a fuel which may drive.",
                    "label": 0
                },
                {
                    "sent": "Future quantum information processes.",
                    "label": 0
                },
                {
                    "sent": "So I can say that I could call this his second biggest mistake, but it's been incredibly useful that he did this, even if it, even if his motivation turned out to be incorrect.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, and as I say, this is the story he called this.",
                    "label": 0
                },
                {
                    "sent": "Book after fee on vehicles in German, which is probably translates a spooky action at a distance.",
                    "label": 1
                },
                {
                    "sent": "Schroedinger didn't come up with the word.",
                    "label": 0
                },
                {
                    "sent": "I think the German is fish ranking.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure what it is in Slovenian.",
                    "label": 0
                },
                {
                    "sent": "Every language francisan free cash and also every language seems to have found those different words for entanglement.",
                    "label": 0
                },
                {
                    "sent": "But anyway, this is the word we use and shredding it was went into it a bit further.",
                    "label": 0
                },
                {
                    "sent": "So as I say, he thought this pointing this out would show that quantum mechanics was wrong and.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's not what happens.",
                    "label": 0
                },
                {
                    "sent": "So as I say, quantum mechanics has always been a very mysterious property for the public more than relativity.",
                    "label": 1
                },
                {
                    "sent": "And as I say, for working physicist, I don't worry about whether quantum mechanics is correct or not, or what measurement means.",
                    "label": 0
                },
                {
                    "sent": "That kind of used quantum mechanics, and but as I said, we know it's the.",
                    "label": 0
                },
                {
                    "sent": "Confirmed to be the true description of the world and the more simpler classical mechanics description for earlier times that we intuitively feel and use in our daily life is should be viewed as a very good approximation to quantum mechanics on scales much larger than atoms.",
                    "label": 1
                },
                {
                    "sent": "So as I say, originally Einstein's objections seem very philosophical.",
                    "label": 0
                },
                {
                    "sent": "I mean part of the issue of the entanglement, and Einstein Podolsky Rosen Paradox is, you know, some experimentalists has to take a decision about.",
                    "label": 0
                },
                {
                    "sent": "Which polarization of a lighter which provide which direction it was spin he should try to measure.",
                    "label": 0
                },
                {
                    "sent": "And then you start coming up with issues was the experimentalist.",
                    "label": 0
                },
                {
                    "sent": "Was this an action of free will, or was in fact the the direction he was going to choose to do?",
                    "label": 0
                },
                {
                    "sent": "Is measurement preordained in history so all kinds of questions that philosophers like to debate?",
                    "label": 0
                },
                {
                    "sent": "If quantum mechanics compatible with free will, well, this is not a kind of question that you know.",
                    "label": 0
                },
                {
                    "sent": "Working scientist finds very useful.",
                    "label": 0
                },
                {
                    "sent": "It can be debated at great thing, but.",
                    "label": 0
                },
                {
                    "sent": "But as I said today, entanglement is not no longer philosophical issue, but it's experimentally confirmed and it's on its way to having technological importance.",
                    "label": 1
                },
                {
                    "sent": "So we've moved from philosophy to an empty talk in some way to using things.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So an important property of quantum mechanics as I said, is the power principle, which says that two particles of the type that we call fermions.",
                    "label": 1
                },
                {
                    "sent": "There are two kinds of particles.",
                    "label": 0
                },
                {
                    "sent": "Basically most of matter is made of fermions.",
                    "label": 0
                },
                {
                    "sent": "Basically although gluing two fermions together makes a bozon, but the elementary particles like fermions, electrons can't be in the same state, which roughly means, roughly speaking is can't be in the same place at the same time.",
                    "label": 0
                },
                {
                    "sent": "In a similar state.",
                    "label": 0
                },
                {
                    "sent": "OK, so I think in a public lecture when always likes to give the people who have someone should everyone should come away knowing something you.",
                    "label": 0
                },
                {
                    "sent": "So this is a question.",
                    "label": 0
                },
                {
                    "sent": "How does question often is?",
                    "label": 0
                },
                {
                    "sent": "Where does quantum mechanics affect us in our daily life?",
                    "label": 0
                },
                {
                    "sent": "And one big answer which comes from the power principle is we don't fall through the floor.",
                    "label": 0
                },
                {
                    "sent": "After all gravity is pulling us downwards towards the center of the earth and the atoms which we are all made of, which.",
                    "label": 1
                },
                {
                    "sent": "Built up into the molecules over 99.9% empty space.",
                    "label": 1
                },
                {
                    "sent": "So why don't we just fall through the center of the floor and the answer is of course Newton gave a simple answer.",
                    "label": 0
                },
                {
                    "sent": "He said there was a normal force, which is a kind of practical observation, but the quantum mechanics is responsible for the 4th that prove.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's often falling through the floor, so I say in the kind of everyday language of the Newton invented the explanation be as follows.",
                    "label": 0
                },
                {
                    "sent": "Here is Einstein or standing on the floor.",
                    "label": 0
                },
                {
                    "sent": "He's actually got 2 feet on the floor, so there's actually, he's gotta gravity weight pulling in from his center of mass, which is, I guess he had a large meal or something would be there and and it pulls him down towards the floor with MG. And there are two forces, one for each of the soles of his feet.",
                    "label": 1
                },
                {
                    "sent": "Exerted on the on the shoe by the floor, which point upwards, and these are the so called normal force and in high school everyone learns a little bit of mechanics so they know that every fourth has a reaction equal and opposite to it etc.",
                    "label": 0
                },
                {
                    "sent": "And then if you were doing high school physics you would have to write down the balance of force equation that N 1 + N two which ought to be vectors I suppose.",
                    "label": 0
                },
                {
                    "sent": "Or pointing upwards minus MG downwards is 0.",
                    "label": 0
                },
                {
                    "sent": "So that's Newton's explanation.",
                    "label": 1
                },
                {
                    "sent": "Of why we don't fall through the floor and then that was of course an empirical flat fact.",
                    "label": 1
                },
                {
                    "sent": "He he notice that you didn't fall through the floor and and said, well, it has to be this normal force, right?",
                    "label": 0
                },
                {
                    "sent": "Because you didn't explain what the normal force was.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And in fact, the Noble forces basically the result of the Pauli exclusion principle, and for the quantum mechanical viewpoint you have a load of atoms.",
                    "label": 0
                },
                {
                    "sent": "The centers of atoms and nuclei, or maybe the ionic cause of the atoms are bound together.",
                    "label": 0
                },
                {
                    "sent": "They hold together by kind of molecular glue or whatever in the soles of your shoes, and there's a certain other set bound together to make up the structure of the wood.",
                    "label": 0
                },
                {
                    "sent": "But there are some electrons.",
                    "label": 0
                },
                {
                    "sent": "The outer electrons are bound to these things.",
                    "label": 0
                },
                {
                    "sent": "Go round and these sets of electrons in the shoe can't be in the same place as the electrons from the floor.",
                    "label": 1
                },
                {
                    "sent": "By quantum mechanical Pauli exclusion principle.",
                    "label": 0
                },
                {
                    "sent": "Prevents them from entering the space occupied by the electrons of the floor, and that means that at the line of contact between the two materials there is this force to exclude them, because so in that sense quantum mechanics is present in our everyday life and responsible for everything around us.",
                    "label": 0
                },
                {
                    "sent": "But we don't really until this century last century.",
                    "label": 0
                },
                {
                    "sent": "We didn't really think of it as quantum.",
                    "label": 0
                },
                {
                    "sent": "We didn't realize what was going on.",
                    "label": 0
                },
                {
                    "sent": "In fact, no one understood what atoms were until.",
                    "label": 0
                },
                {
                    "sent": "Quantum mechanics, you couldn't understand why on Earth often Atom was or how it works or whatever until quantum mechanics was created.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So, as I say, the funding one of the fundamental ingredients of matter.",
                    "label": 1
                },
                {
                    "sent": "That that makes us all up or makes a fight.",
                    "label": 0
                },
                {
                    "sent": "Of course with normal matter is now we know is only some tiny fraction of the percent of the energy in the universe, so there's all kinds of other matter which we don't understand.",
                    "label": 0
                },
                {
                    "sent": "Dark matter etc.",
                    "label": 0
                },
                {
                    "sent": "But normal matter.",
                    "label": 1
                },
                {
                    "sent": "Fundamental ingredient that holds normal matter together is the is the chemical bond which of course in fact does involve 2 electrons which are basically in the same place 2 electrons halfway between a pair of atoms acts as a kind of glue that glues them together.",
                    "label": 0
                },
                {
                    "sent": "So actually this is apparently contradiction to Paoli statement, but of course actually probably at the same time as discovering his principle.",
                    "label": 0
                },
                {
                    "sent": "It also solves the problem.",
                    "label": 0
                },
                {
                    "sent": "We realized there had to be 2 to an additional degree of freedom, and additional thing you needed to describe about the electron, which was not just where it was, but also it's probably called it spin.",
                    "label": 0
                },
                {
                    "sent": "So the quantum state of an electron doesn't just involve the position and the speed, but also an internal degree of freedom, which we call it spin.",
                    "label": 1
                },
                {
                    "sent": "In analogy to a little spinning top.",
                    "label": 0
                },
                {
                    "sent": "So electron is of course a charged particle with a charged particle with little magnetic moment due to an angular momentum and intrinsic angular momentum that we call spin.",
                    "label": 0
                },
                {
                    "sent": "And of course from this viewpoint the periodic table was explained because you build up the things by.",
                    "label": 1
                },
                {
                    "sent": "Putting 2 electrons in each state, one in up spin and running down spin and of course now we've gone from this old.",
                    "label": 0
                },
                {
                    "sent": "There was a previous before power Lee in around 1912 there was this old bore picture of an Atom which was like a little little planetary system with the sun at the nucleus at the middle and little elliptical orbits of atoms.",
                    "label": 0
                },
                {
                    "sent": "And this is still perhaps the general public picture of an Atom, because this cartoon picture for 1912 is around every.",
                    "label": 0
                },
                {
                    "sent": "Of course this is what a.",
                    "label": 0
                },
                {
                    "sent": "Atom atoms, now you can really see them, and if you put the electron states into a very large orbit, which in this picture would be like Pluto or something like that so called rittberg orbit, you can actually now image the electron in Atom.",
                    "label": 0
                },
                {
                    "sent": "So this is actually a real image of a hydrogen Atom with electron around it excited into a into a circled red bug state with a with a number of about 100's orbitals up from the ground state.",
                    "label": 0
                },
                {
                    "sent": "But then it's big enough for you to actually image and see these things so.",
                    "label": 0
                },
                {
                    "sent": "This is a better picture of a quantum mechanical Atom, because the electron forms are kind of fuzzy cloud rather than these little orbits around the system.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So anyway, the chemical bond.",
                    "label": 0
                },
                {
                    "sent": "Here's the spin of the electron.",
                    "label": 0
                },
                {
                    "sent": "The chemical bond is made of two electrons with exactly opposite spin, so they can occupy the same space in space.",
                    "label": 1
                },
                {
                    "sent": "Roughly speaking, they can occupy this.",
                    "label": 0
                },
                {
                    "sent": "The position at the center between these two ions and and the electric force, then glue them together.",
                    "label": 0
                },
                {
                    "sent": "But the big issue here is whatever the direction of electron one has, if spin is a little direction.",
                    "label": 0
                },
                {
                    "sent": "Given by the right hand rule, it's actually spinning in one their way.",
                    "label": 0
                },
                {
                    "sent": "Or you point the spin along your thumb, right?",
                    "label": 0
                },
                {
                    "sent": "The other electron has to be pointing in the opposite direction, 'cause otherwise it couldn't be in the same place.",
                    "label": 0
                },
                {
                    "sent": "And if you make a slightly better.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Picture of that the electrons actually.",
                    "label": 0
                },
                {
                    "sent": "There's no particular direction to the spin of 1 electron, it's just the two electrons always have opposite directions, spins, and of course in quantum mechanics, quantum state is actually presented by a complex number, and the electrons have this fermion principle.",
                    "label": 1
                },
                {
                    "sent": "The principle that prevents 2 electrons being in the same state in the same place means that if I swap the two electrons around the quantum mechanical state changes sign.",
                    "label": 0
                },
                {
                    "sent": "It's actually a complex number, but flips its sign, so it's up down, minus down up.",
                    "label": 0
                },
                {
                    "sent": "And if these were both up, then up minus up upward, cancel and be 0, which is apparently principle right?",
                    "label": 0
                },
                {
                    "sent": "But of course it doesn't have to be up, up, up, down, plus down up.",
                    "label": 0
                },
                {
                    "sent": "It could be 45 degrees, so it could be this kind of slanted thing.",
                    "label": 0
                },
                {
                    "sent": "Or it could be sideways.",
                    "label": 0
                },
                {
                    "sent": "The basic thing is that the state is odd, it changes sign if you swap the two electrons.",
                    "label": 1
                },
                {
                    "sent": "So the quantum mechanical say this is actually the poster child for entanglement.",
                    "label": 0
                },
                {
                    "sent": "The electrons are fundamentally entangled because it's not that.",
                    "label": 0
                },
                {
                    "sent": "Particle one is up and particles two is down.",
                    "label": 0
                },
                {
                    "sent": "They have this state that whichever direction one is in the other is in the opposite one and so there has to be 2 components to this.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thing.",
                    "label": 0
                },
                {
                    "sent": "So of course the the length of the chemical bond is about a tenth of an anime 2 and 1 billion nanometers is a meter, and this I've given this talk in the United States, so I do after translate water meter is.",
                    "label": 1
                },
                {
                    "sent": "On this length scale, the on the length scale of the of the of the topic of the macular bond.",
                    "label": 1
                },
                {
                    "sent": "The two electrons are in this completely entangled state and what Einstein worried about was supposed to at least a thought experiment 'cause he loves to do thought experiments was to what would happen if I took this chemical bond and stretched and stretched it and stretched it without without disturbing it and let it go.",
                    "label": 1
                },
                {
                    "sent": "Let the distance be, you know, not just a nanometer.",
                    "label": 0
                },
                {
                    "sent": "But a meter or light year, right?",
                    "label": 0
                },
                {
                    "sent": "And kilometers light years right?",
                    "label": 0
                },
                {
                    "sent": "And so he thought the consequences of the fact that whatever this electron.",
                    "label": 1
                },
                {
                    "sent": "Spin was doing this.",
                    "label": 0
                },
                {
                    "sent": "One would be the opposite was somehow would violate the principles of causality in relativity.",
                    "label": 0
                },
                {
                    "sent": "So he worried about this abstract thought experiment possibility that the chemical bond would be.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Stretched now of course, when the electrons are close together, the entangled state of the two electrons in the bond is it's got.",
                    "label": 1
                },
                {
                    "sent": "It's got a large binding energy, which is the energy that causes causes matter to be stable and wants to clump together into form interesting arrangements such as us for example, and.",
                    "label": 0
                },
                {
                    "sent": "This is because as a quantum mechanics, one of the principles in fact, that one of the things that Einstein discovered in the photoelectric effect of 1905 was that there's an energy gap.",
                    "label": 0
                },
                {
                    "sent": "There can be only a set of certain allowed energies in quantum mechanics, and the chemical bond.",
                    "label": 0
                },
                {
                    "sent": "This is protected by an energy gap that lowers the energy of the pair of electrons in this entangled state to be lower than relative to.",
                    "label": 1
                },
                {
                    "sent": "Other possible states they can be in, and that's of course, why ultraviolet sunlight is bad for your skin because it's enough energy to break some of the bonds in your skin, and you know have bits and pieces floating around that can give you skin cancer and stuff.",
                    "label": 0
                },
                {
                    "sent": "But if you just just regular heat for the for the infrared lamp is not going to break the chemical bonds.",
                    "label": 0
                },
                {
                    "sent": "So that's why it's bad for you to go to these tanning saloon's and get too much ultraviolet.",
                    "label": 0
                },
                {
                    "sent": "Break too many of your chemical bonds, but this a protection.",
                    "label": 1
                },
                {
                    "sent": "Now if I pull this bond to be apart, so it's so it's very largely separated, this becomes a.",
                    "label": 0
                },
                {
                    "sent": "This is a very unusual situation because it becomes extremely fragile.",
                    "label": 0
                },
                {
                    "sent": "You the more you stretch it, the more you lose this energy gap that that protects it, and so the of tremendously stretched chemical bonds where the spins are.",
                    "label": 0
                },
                {
                    "sent": "In this I put a dotted line rather than up down minus down upside down.",
                    "label": 0
                },
                {
                    "sent": "That means they are entangled in this singlet state.",
                    "label": 0
                },
                {
                    "sent": "This is a this thing is very fragile against what we called the coherence at another.",
                    "label": 0
                },
                {
                    "sent": "It could be disturbed by another electron environment here, and instead of being entangled with this, it will become lose its entanglement with the distant electron and these will become entangled with its local environment.",
                    "label": 0
                },
                {
                    "sent": "And this is actually.",
                    "label": 0
                },
                {
                    "sent": "The basic problem that people are trying to defeat with to make quantum information, reality transformation, processing in reality, because if you store information in entanglement, you have to worry about it's the coherence is degradation by interaction with the environment.",
                    "label": 0
                },
                {
                    "sent": "So I'd say Einstein would produce.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ken Roczen they thought of the origin of what?",
                    "label": 1
                },
                {
                    "sent": "Now we now call this an EPR path after them of widely separated particles.",
                    "label": 1
                },
                {
                    "sent": "In this entangled state they thought it could be made by decaying and initially initial kind of confined state.",
                    "label": 0
                },
                {
                    "sent": "Somehow switching off the the binding process that makes that makes a chemical bond.",
                    "label": 0
                },
                {
                    "sent": "But you can think of it if I put a pair of these particles in the box there kind of which are entangled, they're kind of locally there and switch the walls of the box.",
                    "label": 0
                },
                {
                    "sent": "Which is actually the kind of experiment people do with cold atoms.",
                    "label": 0
                },
                {
                    "sent": "Now they hold the atoms in a magnetic trap, making this box and then actually this is a kind of experiment that they do.",
                    "label": 0
                },
                {
                    "sent": "They switch the box off and everything flies apart and then they measure what happens.",
                    "label": 0
                },
                {
                    "sent": "Well, in this EPR experiment you switch the box off.",
                    "label": 1
                },
                {
                    "sent": "You can see there's a principle of conservation of momentum that the motion of the electrons has to balance if there if the.",
                    "label": 0
                },
                {
                    "sent": "If one electron is moving one way, the other through the other way, and they're continually bouncing off the walls of the box, but once you open the thing up, they're going to fly apart.",
                    "label": 0
                },
                {
                    "sent": "And whichever direction electron one flows in the other one will always be going in the opposite direction.",
                    "label": 0
                },
                {
                    "sent": "Because of this conservation of momentum, the some momentum that direction, and that one has to add up.",
                    "label": 0
                },
                {
                    "sent": "So I stumble ski Rosen, you somewhere do something in these electrons?",
                    "label": 0
                },
                {
                    "sent": "Fire part, so as long as they don't.",
                    "label": 0
                },
                {
                    "sent": "And getting tangled with anything along the way they will.",
                    "label": 0
                },
                {
                    "sent": "They will maintain their.",
                    "label": 0
                },
                {
                    "sent": "They will maintain this down minus down up structure and so in principle.",
                    "label": 0
                },
                {
                    "sent": "They could go to large distances.",
                    "label": 0
                },
                {
                    "sent": "Now electrons have much.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Big tendency to interact and in fact.",
                    "label": 0
                },
                {
                    "sent": "So she Interestingly unsigned.",
                    "label": 0
                },
                {
                    "sent": "EPR this was announced in the paper.",
                    "label": 0
                },
                {
                    "sent": "This attack on quantum mechanics was front page news in 1935 I guess.",
                    "label": 0
                },
                {
                    "sent": "You know Hitler hadn't invaded anything that day or whatever, so there was there was some like it must have been.",
                    "label": 0
                },
                {
                    "sent": "No news on 90 on that day for it to make the headlines of the newspaper, but in fact, apparently Podolski.",
                    "label": 0
                },
                {
                    "sent": "Einstein was extremely angry, apparently about it.",
                    "label": 1
                },
                {
                    "sent": "I was told Podolski went and went to the papers with this, and Einstein thought this was more of a physicist.",
                    "label": 0
                },
                {
                    "sent": "Shouldn't be washing their dirty linen in public, right?",
                    "label": 0
                },
                {
                    "sent": "So keep this in the physics community.",
                    "label": 0
                },
                {
                    "sent": "But Podolski went and.",
                    "label": 0
                },
                {
                    "sent": "Broadcasted it and it became because of Einstein's fame.",
                    "label": 0
                },
                {
                    "sent": "It became famous, so his worry was suppose I make a measurement of the direction of the particle.",
                    "label": 1
                },
                {
                    "sent": "Any part he, according to quantum mechanics until the measurement was made the particles spin could be pointing in any direction and the statement was whether you did the measurement and whatever the experimentalist, select some direction to measure the spin along.",
                    "label": 1
                },
                {
                    "sent": "And the point was that experiment is decided to measure it this way.",
                    "label": 0
                },
                {
                    "sent": "It would immediately cause the result of a measurement on the other spin to the in the other direction.",
                    "label": 0
                },
                {
                    "sent": "And this was a seemed to be to Einstein to be a violation of the principle of causality that says, you know things can't communicate instantaneously.",
                    "label": 0
                },
                {
                    "sent": "Somehow the electron was communicating the fact according to quantum mechanics, the election was somehow communicating the fact it had been measured to the other electron, which could be a very long way away.",
                    "label": 0
                },
                {
                    "sent": "And the point was the choice of the measurement axis was up to the experimentalist.",
                    "label": 0
                },
                {
                    "sent": "You could choose it that way or that way, or up and down, and Einstein felt that couldn't possibly.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Be true, he felt that the electron had had the direction of the spin of the electron had to be chosen already.",
                    "label": 1
                },
                {
                    "sent": "When when the box was open to writing, he couldn't.",
                    "label": 0
                },
                {
                    "sent": "He couldn't accept that it didn't get chosen until the measurement was made.",
                    "label": 0
                },
                {
                    "sent": "So we thought there was some hidden hidden variable somewhere that he called it.",
                    "label": 0
                },
                {
                    "sent": "Local reality, he said that he said that quantum mechanics violates local reality.",
                    "label": 0
                },
                {
                    "sent": "Whatever that means.",
                    "label": 1
                },
                {
                    "sent": "So as I say, if both so both observers do the measurement, they'll get the opposite result and they have to make a choice of the measurement.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "OK, suppose they only agree to make the choice of which access to measure after well after the particles are split.",
                    "label": 1
                },
                {
                    "sent": "This is where the whole issue of the freewheel came into it, right an?",
                    "label": 1
                },
                {
                    "sent": "Basically, Einstein made this famous statement, which presumably was in German that God does not play dice.",
                    "label": 0
                },
                {
                    "sent": "I said this can't possibly be correct and that this issue was the result of the, so he felt his point was the result of the experiment had to have been determined.",
                    "label": 1
                },
                {
                    "sent": "At the moment the electrons flew apart and it couldn't, possibly.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Be sensibly determined after that.",
                    "label": 0
                },
                {
                    "sent": "Well, as I say, he incorrectly thought that if this test was eventually done and again he thought it would be a long time in the future.",
                    "label": 0
                },
                {
                    "sent": "It would definitely show that the particle spin was already determined when they split, and that quantum mechanics was some approximation to a true microscopic description of the universe, which was which made local realism.",
                    "label": 1
                },
                {
                    "sent": "But as I say, other people thought about this, and David Bohm people started reformulating a more precise form of the EPR experiment, and probably the John Bell probably made the in the.",
                    "label": 0
                },
                {
                    "sent": "In the 60s late 60s, John Bell, probably he crystallized.",
                    "label": 0
                },
                {
                    "sent": "He made a very, very precise kind of test of a measurement that couldn't possibly be compatible with classic with local realism, although.",
                    "label": 0
                },
                {
                    "sent": "That the the whole issue of free will is still in there as the only possible tiny little place to squeeze for the anti quantum mechanical people to squeeze out of of Bell theorems.",
                    "label": 1
                },
                {
                    "sent": "And in fact in 1982 the French physicist Allan SP.",
                    "label": 0
                },
                {
                    "sent": "Did finally did these experiments and experiments showed full violation of local reality.",
                    "label": 0
                },
                {
                    "sent": "According to Belfair Bell theorems and quantum mechanics essentially got this 100% correct mark after that.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Electrons are kind of tricky to work with because they're charged and they kind of like to interact with the environment.",
                    "label": 0
                },
                {
                    "sent": "But we know that photons can travel.",
                    "label": 0
                },
                {
                    "sent": "You know, photons which were created.",
                    "label": 0
                },
                {
                    "sent": "A few 100,000 years after The Big Bang and they have continued towards us unaffected since then.",
                    "label": 0
                },
                {
                    "sent": "So we can look back and see.",
                    "label": 0
                },
                {
                    "sent": "Look back till recombination to see the universe so so photons can travel a huge distance without with avoiding entanglement with the environment.",
                    "label": 0
                },
                {
                    "sent": "And the test was actually done done with the.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "With the photons.",
                    "label": 0
                },
                {
                    "sent": "So here we are.",
                    "label": 0
                },
                {
                    "sent": "So in fact instead of spins up and down it was two polarizations of light and light either.",
                    "label": 0
                },
                {
                    "sent": "Either looking vertical or horizontal polarization, which is what your sunglasses are doing to to get rid of glare or or something slightly more like spin is the photon can put in circularly polarized states, which are one way or the other way, and in fact.",
                    "label": 0
                },
                {
                    "sent": "Since this I wrote this slides, I say the people have now shown EPR pairs separated.",
                    "label": 0
                },
                {
                    "sent": "They started off with Lake Geneva.",
                    "label": 0
                },
                {
                    "sent": "Now it's across oceans.",
                    "label": 0
                },
                {
                    "sent": "the Chinese have done it through satellites in orbit.",
                    "label": 0
                },
                {
                    "sent": "The next thing is going to be at the LaGrange points between the Earth and the moon, or put some senders in there.",
                    "label": 0
                },
                {
                    "sent": "So we actually can see this these EPR photons and of course people.",
                    "label": 0
                },
                {
                    "sent": "Some of the early applications of quantum information ideas is to say to show how you can.",
                    "label": 1
                },
                {
                    "sent": "How you can send your your codes for your cryptography codes could be sent in a way that you can you could you could in principle tell whether they'd be intercepted.",
                    "label": 0
                },
                {
                    "sent": "You go from Alice to Bob and there's even the middle who's trying to read it, and if even even manages to read the code, then you then you can tell that she read it 'cause the quantum mechanical state is ruined, etc.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So, as I say that the era of discovering what kind of cool things can be done with quantum mechanics is what started now, right?",
                    "label": 0
                },
                {
                    "sent": "So so.",
                    "label": 0
                },
                {
                    "sent": "Then you were starting to find out for all this stuff is that we can trying to gain a direct control of quantum states in the past experiments were usually equivalent to bashing something with a hammer and seeing what pieces flew away.",
                    "label": 0
                },
                {
                    "sent": "Now we're trying to kind of manipulate quantum states more like by gradually nudging.",
                    "label": 0
                },
                {
                    "sent": "I mean some directions to avoid kind of doing what we call a measurement, but just gradually change them and store information in it.",
                    "label": 0
                },
                {
                    "sent": "And what we actually finding is that quantum mechanics can.",
                    "label": 0
                },
                {
                    "sent": "Can do allows many many strange things that we didn't really imagine possible to happen, and in fact one of the new ingredients in what people are talking about.",
                    "label": 0
                },
                {
                    "sent": "A second quantum Revolution, the first one being 1928 to 32.",
                    "label": 0
                },
                {
                    "sent": "We're kind of starting to kind of we've starting to actually bring in a lot of these ideas which were really stimulated by EPR and entanglement in quantum information theory and try and get a deeper control of quantum States and it's quite plausible that this is going to.",
                    "label": 0
                },
                {
                    "sent": "Lead to two interesting new technologies.",
                    "label": 0
                },
                {
                    "sent": "As we gain an understanding in the next century.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is a classical information as opposed to quantum information is stored in a in a bit right, which is a number of.",
                    "label": 1
                },
                {
                    "sent": "It is really a switch which could be on or off one or zero, and so there's my switch switch could be determining a large number of spins in a in a magnetic material.",
                    "label": 0
                },
                {
                    "sent": "The spins of the electrons like to line up positive at least some of the electrons want to line up with all their spins in the same direction, so a little piece of iron.",
                    "label": 0
                },
                {
                    "sent": "Will have magnetized in a certain direction and will have a lot of other conduction.",
                    "label": 0
                },
                {
                    "sent": "Electron spins were pointing one way.",
                    "label": 0
                },
                {
                    "sent": "An If I flip the direction of this magnetic domain, they'll be pointing the other way.",
                    "label": 0
                },
                {
                    "sent": "So this is a classical switch which could be thought of as huge large amount of electrons with spin in One Direction and the other state is a large amount of electrons with this bin in the other direction.",
                    "label": 0
                },
                {
                    "sent": "But quantum information is stored in the state of a single spin qubit, which you then have to.",
                    "label": 1
                },
                {
                    "sent": "Read by a measurement which requires you to make a choice of measurement axis and the basic point is that.",
                    "label": 0
                },
                {
                    "sent": "In the corner of the spin actually can be pointing in any direction, right?",
                    "label": 0
                },
                {
                    "sent": "And so the information that be stored in the cube.",
                    "label": 1
                },
                {
                    "sent": "It is not just up or down because the axis on which you decide to measure is your choice in some way.",
                    "label": 0
                },
                {
                    "sent": "The spin is spin.",
                    "label": 0
                },
                {
                    "sent": "Could actually point in any direction and they call this a Bloch sphere and at least from this picture.",
                    "label": 0
                },
                {
                    "sent": "The information is stored in a complex number, which represents an amplitude, but there clearly is.",
                    "label": 0
                },
                {
                    "sent": "There's more information you can store by the direction in which the spin is pointing in, and just then upward down, and that's the secret of where the extra quantum information can be stored.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, So what is this got to do with topological quantum matter which is the work I did another state and as I say, to the best of our knowledge, the basic laws of quantum mechanics were established during the first quantum revolution, maybe the first one was actually the second one, because there was this early early quantum mechanics around 1912 or so due to bore which came up with this little planetary picture of the Atom.",
                    "label": 1
                },
                {
                    "sent": "But both theory is a cartoon.",
                    "label": 0
                },
                {
                    "sent": "The Connor mechanics that was found between 1928 and 1932 basically cleaned up a full proper, full and correct account of atomic physics, nuclear physics.",
                    "label": 0
                },
                {
                    "sent": "So all these kind of developments later or just applied quantum mechanics.",
                    "label": 0
                },
                {
                    "sent": "The basic rules were found then and the basic point is just because we know the laws of quantum mechanics doesn't mean that we know everything that's allowed to happen.",
                    "label": 1
                },
                {
                    "sent": "In fact, the same thing comes with.",
                    "label": 0
                },
                {
                    "sent": "Electromagnetism Maxwell discovered finished the Maxwell equations around 1870 or so and.",
                    "label": 0
                },
                {
                    "sent": "Once you've written down Maxwells equations, you basically written down all of Electro or everything about electromagnetism is in there, right, but of course to you know how we smartphones and and X Rays and all kinds of things work.",
                    "label": 0
                },
                {
                    "sent": "Is a lot more than just writing down the Maxwells equations, and in fact when Maxwell presenters equations, there's a famous conversation he had with Gladstone before Gladstone became Prime Minister in England when he was another lesser minister, he said.",
                    "label": 0
                },
                {
                    "sent": "Professor Maxwell, what uses all this?",
                    "label": 0
                },
                {
                    "sent": "Mr Maxwell replied Mr I can't tell you right now, but I can tell you for sure that one day you will be taxing it.",
                    "label": 1
                },
                {
                    "sent": "So of course we know that you know electromagnetism really created a fantastic new technology and but it took quite a long time to understand.",
                    "label": 0
                },
                {
                    "sent": "For example, in electromagnetism photonic crystals and things were only kind of even conceived of in the 1990s and manipulating the flow of light with very interesting things.",
                    "label": 0
                },
                {
                    "sent": "So there's still developments going on in electromagnetism that we.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So quantum mechanics.",
                    "label": 0
                },
                {
                    "sent": "So as I say around 1980.",
                    "label": 0
                },
                {
                    "sent": "Condensed matter physicists and condensed matter systems fancy used to be called solid state physics, but when the transistor was invented, all the kind of transistor radios had solid state written.",
                    "label": 0
                },
                {
                    "sent": "It was very proud that they had solid state components, so everyone thought you were working on transistor radios.",
                    "label": 0
                },
                {
                    "sent": "If you were solid state physicist, so they incorporated liquid's in it and change the name to condense matter, which means atoms are clumping together under the forces that bind bind together by various forces.",
                    "label": 0
                },
                {
                    "sent": "Quantum mechanical forces or whatever as opposed to gases where they're all moving around separately, right?",
                    "label": 0
                },
                {
                    "sent": "So as I say, people thought they had a basic understanding of condensed matter physics by 1980, and this is all the stuff I learned when I was a student, but independently around that time to kind of weird properties, unexpected properties were found, and these turn out to be.",
                    "label": 1
                },
                {
                    "sent": "Properties of new kinds of states of condensed matter, which quantum mechanics, quantum mechanical entanglement plays a much larger key role in a way that it doesn't in in in the more normal states of matter, and you can view this as two tips.",
                    "label": 0
                },
                {
                    "sent": "So initially one with some work on magnetism that I discovered around 1980 and almost about the same time work classified Klitzing experimentally discovered the quantum Hall effect.",
                    "label": 0
                },
                {
                    "sent": "Which, if I have time, I'll get to and the these were initially had no obvious connection of any kind between the two, but they both turned out to be early examples of this new kind of topological matter that really hadn't been guessed at before they were found, so this was a theoretical discovery, and this was an experimental discovery.",
                    "label": 0
                },
                {
                    "sent": "Both of them were unexpected.",
                    "label": 0
                },
                {
                    "sent": "I now you could view this as a metaphor of the iceberg, because since then, many more kinds of.",
                    "label": 0
                },
                {
                    "sent": "Topological quantum matters were found particularly in the last decade, and all kinds of interesting, much more interesting parts of it have come to light, which could be useful for the quantum.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Information, think so, topological matter.",
                    "label": 0
                },
                {
                    "sent": "What does that mean?",
                    "label": 0
                },
                {
                    "sent": "Topological matter differs from an ordering matter becausw the entanglement properties.",
                    "label": 1
                },
                {
                    "sent": "That has actually can be described by like whole numbers.",
                    "label": 1
                },
                {
                    "sent": "Integers like minus 1253.",
                    "label": 0
                },
                {
                    "sent": "From this viewpoint, ordinary matter would be described by a boring number, and I've actually been rebuked for this because the mathematician said the number 0 is not a boring matter and number at all.",
                    "label": 0
                },
                {
                    "sent": "It took a long time to discover.",
                    "label": 0
                },
                {
                    "sent": "But basically yeah, the number zero was not known until I guess the Arab.",
                    "label": 0
                },
                {
                    "sent": "Certainly the but anyway, simple numbers like one or zero weather ordering matter, more exotic numbers.",
                    "label": 0
                },
                {
                    "sent": "Describe the topological matter and the basic point.",
                    "label": 0
                },
                {
                    "sent": "Is that whole numbers can't just change continuously.",
                    "label": 0
                },
                {
                    "sent": "The whole number has to jump from one to two.",
                    "label": 0
                },
                {
                    "sent": "Is a jump.",
                    "label": 0
                },
                {
                    "sent": "You can't go continuously from one to two and stay a whole number.",
                    "label": 0
                },
                {
                    "sent": "You can go from 1 to 1.3 one .35, but that's but if you're forced to be a whole number, you gotta change.",
                    "label": 0
                },
                {
                    "sent": "So if the matter is described by has some property which you could label by a whole number, then there has to be something interesting at the boundary.",
                    "label": 1
                },
                {
                    "sent": "Between.",
                    "label": 0
                },
                {
                    "sent": "The topological matter and the normal matter, and it turned out to be one of the very characteristic things of topological matter, was that it had something interesting going on on the boundary between it and normal matter.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So regular matter we'd understood by 1980, we understood crystals.",
                    "label": 1
                },
                {
                    "sent": "In crystals the atoms inside of crystal form some regular little pattern in what's called the unit cell, and then these things are stacked together to form a nice regular array, and people study this.",
                    "label": 0
                },
                {
                    "sent": "This has something called broken symmetry.",
                    "label": 1
                },
                {
                    "sent": "Clearly I can't just move sideways by number, and I can only move sideways by the discrete jump, and this thing is also broken rotational symmetry.",
                    "label": 0
                },
                {
                    "sent": "If I rotate, it's different.",
                    "label": 0
                },
                {
                    "sent": "So a lot of all the work.",
                    "label": 0
                },
                {
                    "sent": "Prior to this, and focused on the properties, we call broken symmetry, which was the basic understanding of interesting parts of matter, crystals and things and superconductors and this thing.",
                    "label": 1
                },
                {
                    "sent": "Nothing special is particularly associated with the edge, while the quantum Hall effect or the spin chains they have a feature that something interesting is going on at the boundary.",
                    "label": 0
                },
                {
                    "sent": "And in fact, in the quantum Hall effect is very interesting.",
                    "label": 0
                },
                {
                    "sent": "This there's information or states can travel only in One Direction around the boundary, which is quite surprising.",
                    "label": 0
                },
                {
                    "sent": "Accounting like a one way street.",
                    "label": 0
                },
                {
                    "sent": "But in the bulk we have something we call a topologically ordered liquid, and by looking at it, it's got no broken symmetries.",
                    "label": 1
                },
                {
                    "sent": "There's no symmetry difference that between the inside and the outside, but there's this topological difference which requires something funny to happen at the boundary.",
                    "label": 0
                },
                {
                    "sent": "And as I say, unusual expectations are kind of.",
                    "label": 0
                },
                {
                    "sent": "So they inevitably present in almost 11 to present it at the boundary between this top.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Logical matter an regular matters.",
                    "label": 0
                },
                {
                    "sent": "So what's the importance of that?",
                    "label": 0
                },
                {
                    "sent": "As I say, the whole number can't can't change continuously, and that means that topological matter has a much greater stability than.",
                    "label": 1
                },
                {
                    "sent": "The property is a very stable in the sense because if I remember how you make a chip for a computer, this Silicon wafer has to be created an extremely clean room.",
                    "label": 0
                },
                {
                    "sent": "You've probably seen pictures of people in this space suits basically one little speck of dust from your hair.",
                    "label": 0
                },
                {
                    "sent": "A little bit of dandruff or something will fall on the chip.",
                    "label": 0
                },
                {
                    "sent": "It's completely gone.",
                    "label": 0
                },
                {
                    "sent": "You have to throw it away so you have to take incredible precautions to make everything clean because a little bit of dirt will ruin ruin.",
                    "label": 1
                },
                {
                    "sent": "This nice, beautiful Silicon wafer and make the computer chip.",
                    "label": 0
                },
                {
                    "sent": "Not work, but if the property depends on a whole number, you actually have to do a significant amount of damage to change it, so a little bit of damage cannot change the topological property, so you've got in principle.",
                    "label": 0
                },
                {
                    "sent": "At least there is a there is a.",
                    "label": 0
                },
                {
                    "sent": "Threshold you have to make it damage it sufficiently badly to change it.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The classical example of topology which the people at the and the Bell Press announcement were trying to explain all this stuff to the public was is the theory of the number of holes in mathematics.",
                    "label": 0
                },
                {
                    "sent": "Topology is a classification started off as a classification of close surface is by number of holes and this leads to this issue of Donuts and bagels and things and basically a shape with a sphere or ball has no holes.",
                    "label": 1
                },
                {
                    "sent": "It can easily be distorted.",
                    "label": 0
                },
                {
                    "sent": "You can change a European soccer ball.",
                    "label": 0
                },
                {
                    "sent": "You can squeeze it and make it look like a rugby ball or an American football or whatever by squashing it, but it doesn't change the number of holes to make a hole in it.",
                    "label": 0
                },
                {
                    "sent": "You gotta do a really significant amount of damage to punch a hole through the wall and change it to a donut shape, and basically holds a couple logical objects because no one you can't say.",
                    "label": 0
                },
                {
                    "sent": "I've got .36 of a whole.",
                    "label": 0
                },
                {
                    "sent": "You've either got one hole or no holes, or three holes, right?",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "So geometric properties such as curvature of the surface is a local properties, but the amazing thing that cognitive grouse discovered was that integrals over local properties can actually characterize the global topology.",
                    "label": 1
                },
                {
                    "sent": "By studying carefully the surface, you can actually count the number of holes, and actually Gauss discovered many amazing mathematical properties, but this one I think he believed was the strangest and most important thing that he found.",
                    "label": 0
                },
                {
                    "sent": "He has a Latin name for it.",
                    "label": 0
                },
                {
                    "sent": "Theorema egregia know or something?",
                    "label": 0
                },
                {
                    "sent": "And this is the so called Gauss Bonnet theorem, which for high school students is.",
                    "label": 0
                },
                {
                    "sent": "Kind of trivial, you will learn in high school at the surface area of a sphere is 4 Pi, R-squared and Gaussians.",
                    "label": 1
                },
                {
                    "sent": "Gaussian curvature is a product of the radio array of curvature, which for the sphere are equal in both directions.",
                    "label": 0
                },
                {
                    "sent": "So it's just one over R-squared.",
                    "label": 0
                },
                {
                    "sent": "So Gaussian theorem just tells you that four Pi R ^2 * 1 / R squared is 4 Pi.",
                    "label": 0
                },
                {
                    "sent": "Now the amazing thing that Gauss discovered was while this detail of this integral changes completely as I start to distort the.",
                    "label": 0
                },
                {
                    "sent": "The sphere into a football or a banana or whatever.",
                    "label": 0
                },
                {
                    "sent": "It's a this number doesn't change so long as I don't make a hole in the system, you still get four Pi, so this is an easy homework for a high school student, but if I gave you the spheres of banana shape it would be a very challenging piece of mathematical calculus to verify that.",
                    "label": 0
                },
                {
                    "sent": "And of course a sneaky teacher could have give this as a homework problem.",
                    "label": 0
                },
                {
                    "sent": "We had very easy grading with the homework to do 'cause he knows the answer with only four π or whatever it was depending on the thing.",
                    "label": 0
                },
                {
                    "sent": "So it's a trivial.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Statement for sphere but non trivial for another manifold and this is the famous business about the coffee cups.",
                    "label": 0
                },
                {
                    "sent": "So the ball is topologically equivalent to a mug with no handles.",
                    "label": 0
                },
                {
                    "sent": "The bagel has got equivalent to the coffee Cup with one handle.",
                    "label": 0
                },
                {
                    "sent": "This thing is called a loving Cup.",
                    "label": 0
                },
                {
                    "sent": "It's got two handles, I guess two people could share it or something, and this was apparently in the invented something called a Swedish pretzel, which really is a Santa Lucia bun, but in actuality the.",
                    "label": 0
                },
                {
                    "sent": "The holes in the middle get filled up when they bake it, so it doesn't actually look like that.",
                    "label": 0
                },
                {
                    "sent": "This is so called German pretzel where the number works out eight Pi and they actually do find some objects like this.",
                    "label": 0
                },
                {
                    "sent": "I didn't actually know what the name of this is, but someone suggested this should be called a California loving Cup.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anyway, so as I say, before 1980, topological quantum banner was unknown, and then we found this this stuff and as I say it took a long time to understand that, but we finally achieving.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thanks so I'm not sure how much time I have, so maybe want to skip over a few things, but as I say the quantum and it turned out that quantum entanglement was a key thing and that apology was related to an entanglement.",
                    "label": 0
                },
                {
                    "sent": "So if things are trivially entangled you can cut them in half and there's no, there's no, there's no connection between this side on that side, entanglement if they're entangled, if they're not entangle, it means.",
                    "label": 0
                },
                {
                    "sent": "If I measure something in this side of the of the system.",
                    "label": 0
                },
                {
                    "sent": "It won't affect anything that happens on the other side.",
                    "label": 0
                },
                {
                    "sent": "OK, but for the topological matter which has this kind of edge state to it, if I try to cut the thing in half, I pull it.",
                    "label": 0
                },
                {
                    "sent": "It's initially initially bit difficult to pull it.",
                    "label": 0
                },
                {
                    "sent": "I say you have to do a significant amount of damage before you actually change the topology, so it's starting to resist a bit, but suddenly you pull it apart and then the things are separated and but now in the entanglement got replaced.",
                    "label": 0
                },
                {
                    "sent": "In some sense, the entanglement between the two had to terminate on something, and that's what causes these.",
                    "label": 0
                },
                {
                    "sent": "Edge states to be there, so it's a bit like you try to break a bar magnet into two.",
                    "label": 0
                },
                {
                    "sent": "You want to separate the North Pole and the South Pole, but by the time you separated it, you still got a New South Pole in a new film North Pole on each and each of the magnets.",
                    "label": 0
                },
                {
                    "sent": "So the entanglement which used to go all the way through from one side to the other is broken, but it gets.",
                    "label": 0
                },
                {
                    "sent": "It has to terminate on something and that creates these.",
                    "label": 1
                },
                {
                    "sent": "These these new unexpected edge states, right?",
                    "label": 1
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the topological states of insulated matter can in principle be assembled by bringing the matter together, just bringing atoms together, and if it forms a topological state, something has to happen on the way as you bring the atoms together to form this material.",
                    "label": 0
                },
                {
                    "sent": "And that's where this thing happens, and in fact.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Once something is known, you actually can go back and find it was.",
                    "label": 0
                },
                {
                    "sent": "It should have been discovered earlier, right?",
                    "label": 0
                },
                {
                    "sent": "A lot of these, a lot of things that get discovered.",
                    "label": 0
                },
                {
                    "sent": "There may be some some funny little detail here and no one realize the importance of the general principles behind.",
                    "label": 0
                },
                {
                    "sent": "And in fact you can go back to, uh, calculations in 1939 by Shaklee you actually went on to invent the transistor at Bell Labs, but you bring this kind of toy model of atoms together and they manage to do some kind of calculation, and you bring the atoms together and calculate their energy levels and things.",
                    "label": 0
                },
                {
                    "sent": "When they widely separated or just discrete energy levels of an Atom, this is a toy model Atom in one dimension.",
                    "label": 0
                },
                {
                    "sent": "But as you bring 'em together, you see something happens and the these bands form which join up and the split apart, but you leave the head.",
                    "label": 0
                },
                {
                    "sent": "They leave interesting states which turned out to be the edge states behind, and so this actually is essentially today's topological insulator that got discovered in 2006.",
                    "label": 0
                },
                {
                    "sent": "This is actually crystalline topological.",
                    "label": 0
                },
                {
                    "sent": "A symmetry protected topological insulator, but so the interesting principle is that.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you find this stuff.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And let's skip some of this.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so one of the interesting things you see in The thing is that if you fill the electron levels up.",
                    "label": 0
                },
                {
                    "sent": "You have to fill him up to a point in between, which is called Fermi level or the chemical potential.",
                    "label": 0
                },
                {
                    "sent": "So if there's one electron per Atom, the chemical potential would be here.",
                    "label": 0
                },
                {
                    "sent": "If you go through here would have to be trapped in this tiny little gap between these two states, so most likely it will be down here.",
                    "label": 0
                },
                {
                    "sent": "One electron is lost from the system, or another electron is added to the system up here and then.",
                    "label": 0
                },
                {
                    "sent": "Where did that other electron go?",
                    "label": 0
                },
                {
                    "sent": "It actually went into the system, but half of it went down to one end and half went to the other end.",
                    "label": 0
                },
                {
                    "sent": "So one of the typical weird things you see in topological matter is.",
                    "label": 0
                },
                {
                    "sent": "The electron which we think of as individual particle can actually get split into fractional pieces, and in fact I was being told interesting experiments going on here that could possibly be fractional charges in some interesting compounds, but but so.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for example, in a spin chain or whatever, you can have one electron, maybe citing you break things up and pull electron out, and then this object can split into two.",
                    "label": 0
                },
                {
                    "sent": "So one of the typical things you see in the topological states is fractionalization.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so let's say in heavier atoms electrons.",
                    "label": 1
                },
                {
                    "sent": "So what I found, let me just give one of the things I found.",
                    "label": 0
                },
                {
                    "sent": "I'll quickly go through a few things.",
                    "label": 0
                },
                {
                    "sent": "The electron magnetic atoms, the spins in the electrons.",
                    "label": 0
                },
                {
                    "sent": "Well they don't form a entangled state.",
                    "label": 0
                },
                {
                    "sent": "With the spins you put them in parallel to each other and they line up and they form a.",
                    "label": 0
                },
                {
                    "sent": "The elementary spin is the spin of the electron and you can formally called 1/2.",
                    "label": 0
                },
                {
                    "sent": "It's a half integer angular momentum and you add them up together and the spin.",
                    "label": 1
                },
                {
                    "sent": "Is 2 S of these things added together to make a spin S and the basic thing is the spins that go into the Atom.",
                    "label": 1
                },
                {
                    "sent": "There has to be a whole number of them and the big difference when I discovered it mattered where there was a whole number was even or odd, and that's what people hadn't discovered.",
                    "label": 0
                },
                {
                    "sent": "Decided before and it turned out to be because of this.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Logical entanglement property.",
                    "label": 0
                },
                {
                    "sent": "So in 1981 I discovered the spin one chain could have another, uh, another problem.",
                    "label": 1
                },
                {
                    "sent": "The previous expected state of the system is something called an antiferromagnet.",
                    "label": 0
                },
                {
                    "sent": "Whether whether the spins the magnetic moment, the direction of spin is equal and opposite on neighboring atoms so they kind of look like that.",
                    "label": 0
                },
                {
                    "sent": "So this was the kind of expected state.",
                    "label": 0
                },
                {
                    "sent": "This is entering state with long range order.",
                    "label": 0
                },
                {
                    "sent": "It's got a broken symmetry that if I translate by 1 unit it's not the same.",
                    "label": 0
                },
                {
                    "sent": "So this is an example of a characteristic broken symmetry state of the old style, but there's actually no entanglement.",
                    "label": 0
                },
                {
                    "sent": "I could assemble this by bringing atoms in for Infinity and just lining him up in this way, right?",
                    "label": 0
                },
                {
                    "sent": "So there's no particular entanglement across this boundary here, so if I cut it I can just separate it and nothing happened.",
                    "label": 0
                },
                {
                    "sent": "So if I did a measurement of this Atom spin, it wouldn't affect the spin of the Atom down here, and it turned out that what I discovered is that if the if the spin is half integer spin.",
                    "label": 0
                },
                {
                    "sent": "Integer rather.",
                    "label": 0
                },
                {
                    "sent": "You've got a much more interesting state where and if I got it on the next slide, I probably don't.",
                    "label": 0
                },
                {
                    "sent": "You can think of the.",
                    "label": 0
                },
                {
                    "sent": "The thing is, the spin splits and each of these atoms has like two hands and you form a chain of people who link their hands together and then at one end of the chain there's one free hand that can wait around here and the other end of the chain there's one person with a second freehand, so I've managed to usually would say that people that the two arms of people that join to people there kind of connected.",
                    "label": 0
                },
                {
                    "sent": "You gotta rule that flows.",
                    "label": 0
                },
                {
                    "sent": "You didn't have an accident or something everywhere the two arms always come in pairs, right?",
                    "label": 0
                },
                {
                    "sent": "But by this trick of of entangling the people by forming a line where they hold hands, you can actually have a free hand that can wave around it without without a local partner to go with it, 'cause the local partner was fixed by grabbing the neighbors hand, and this is actually the.",
                    "label": 0
                },
                {
                    "sent": "The first of all this is this entanglement spreads across the system, and then you've got these free half integer spins at the end of the chain, which was something pretty unexpected and you can see if I actually break the system if I pull the two hands apart, I end up with.",
                    "label": 0
                },
                {
                    "sent": "Two hands on the end of the spin.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is actually because it sounds very simple, but this was.",
                    "label": 1
                },
                {
                    "sent": "This was a challenge because it actually fundamentally involves a state with entanglement spread across the system, which wasn't a feature of the earlier thing.",
                    "label": 0
                },
                {
                    "sent": "No one had thought that you had to worry about entanglements, and because I didn't know it was entanglement, but so this was actually.",
                    "label": 1
                },
                {
                    "sent": "Extremely trivial looking observation, but it was incredibly controversial because it actually challenged view of magnetism that had been accepted for a long time and no one believed that there should be anything should be different between integer spin and half integer spin.",
                    "label": 1
                },
                {
                    "sent": "It turns out this is a special property of and often dispenses behave differently.",
                    "label": 0
                },
                {
                    "sent": "This kind of state could this kind of fate requires 2, right?",
                    "label": 0
                },
                {
                    "sent": "If the spins of only one hand around you couldn't form a chain where you everyone join hands, you have to have two hands to form a chain of people to to link together, and this was sort.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Significant enough that they they put the picture of that thing on my.",
                    "label": 0
                },
                {
                    "sent": "Everyone gets a kind of a little kind of diploma on one side, some stuff about in Norway, in Swedish about whatever it was, and then artists impression that what the theme was.",
                    "label": 0
                },
                {
                    "sent": "Doors opening to an unknown world was a theme of this prize and.",
                    "label": 0
                },
                {
                    "sent": "The OR each of us got a different thing opened up behind the door related to what their work was.",
                    "label": 0
                },
                {
                    "sent": "So let me just.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Chiefly talk about the other effect, the quantum Hall effect, and again, this is a thing where you.",
                    "label": 1
                },
                {
                    "sent": "Have a current flowing through something and the whole effect is if you measure the voltage drop across the play for the current flowing.",
                    "label": 0
                },
                {
                    "sent": "You can tell if the electrons are what's moving.",
                    "label": 0
                },
                {
                    "sent": "This is the way you know that electrons are the usual thing that move in a metal, although one of the advantages of quantum mechanics was to show the invented discovery of the whole, which is important for semiconductors, and this also takes a little bit of thinking to get your brain around this, because what in a P type semiconductor what's moving is.",
                    "label": 0
                },
                {
                    "sent": "Not an electron.",
                    "label": 0
                },
                {
                    "sent": "It's the absence of an electron a whole.",
                    "label": 0
                },
                {
                    "sent": "Again, that's a very deep concept.",
                    "label": 0
                },
                {
                    "sent": "That's obvious, but took some understanding from the Pauli principle that you could have such thing.",
                    "label": 0
                },
                {
                    "sent": "So the amazing thing was they did a measurement of the whole resistance among Klitzing discovered in under certain conditions is singing in high magnetic field.",
                    "label": 0
                },
                {
                    "sent": "This number turned out to be.",
                    "label": 0
                },
                {
                    "sent": "Mental constants the relation with the ohms law.",
                    "label": 0
                },
                {
                    "sent": "This is well written backwards I = v / R really.",
                    "label": 0
                },
                {
                    "sent": "Conductivity was some fundamental constants involving Planck's constant and the electron charge, and in the first case a whole number and now a fraction, and these are so this was accurately quantized.",
                    "label": 0
                },
                {
                    "sent": "In fact, this is going to be the foundation of the new system of units, which is going to be announced later this year.",
                    "label": 0
                },
                {
                    "sent": "Some International Congress we're going to be amp used to be defined by force between current carrying wires, and now we're going to define it through this.",
                    "label": 0
                },
                {
                    "sent": "So this turned out to be.",
                    "label": 0
                },
                {
                    "sent": "This was actually quantized.",
                    "label": 0
                },
                {
                    "sent": "Initially people looked for relativistic corrections.",
                    "label": 1
                },
                {
                    "sent": "Is there some?",
                    "label": 0
                },
                {
                    "sent": "Is this depends on the electrons not moving fast and it turns out to be a completely topological thing and the only reason that can violate this is the size of the sample have to be big enough that you can't have quantum mechanical tunneling between the two, but that falls off exponentially so.",
                    "label": 0
                },
                {
                    "sent": "The corrections to this only do so, provided the distance between the sides of the sample is large enough on an atomic scale or whatever, then this is perfect, right?",
                    "label": 1
                },
                {
                    "sent": "It's topological and it turned out it wasn't.",
                    "label": 0
                },
                {
                    "sent": "Of course I understood it was topological, but in retrospect anything that involves whole numbers has to be topological and the amazing.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thing was, this is a sample in which at least the fractional version of this effect was discovered.",
                    "label": 1
                },
                {
                    "sent": "So clearly someone doesn't look very kind of skilled with a soldering iron here, right?",
                    "label": 0
                },
                {
                    "sent": "But basically a sample like this could show this perfect effect because of this remarkable robustness of topology that you so long as it doesn't have to be perfect, it just has to be good enough, right?",
                    "label": 0
                },
                {
                    "sent": "This kind of thing can actually show things up and a little bit about explaining what.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yes, I could probably skip, but basically the quantum mechanics says electrons flow in high school chemistry.",
                    "label": 0
                },
                {
                    "sent": "You learn you, you've got this sort of orbitals in an Atom and the power principle so.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you kind of populate them and you're allowed to put up and down in each orbital, which was how the periodic table gets explained, the quantum Hall effect in some sense can be viewed as a.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It kind of Atom.",
                    "label": 0
                },
                {
                    "sent": "The basic thing is you've got a magnetic field, and if anyone's done from a little bit of physics, you kind of know that electrons in a magnetic field go round in little circular orbits.",
                    "label": 1
                },
                {
                    "sent": "And the important thing else, the center of the orbit.",
                    "label": 1
                },
                {
                    "sent": "There's only a kind of certain number of independent ways to put the orbiting, but if I take if I look at this thing, the energy is like a like a planet in the quantum mechanical view of the Atom, the old one the planetary orbits will counsel here.",
                    "label": 0
                },
                {
                    "sent": "There's only a certain set of radius of orbit.",
                    "label": 0
                },
                {
                    "sent": "The energy is quantized, and there's an orbit of 1 size and orbit of another size, and that leads to.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thinking like an atomic levels instead of just being SPD with a few.",
                    "label": 0
                },
                {
                    "sent": "There's actually a huge number of levels.",
                    "label": 0
                },
                {
                    "sent": "One, the number of levels in each of number of states in each of these levels is proportional to the size of the system.",
                    "label": 1
                },
                {
                    "sent": "Depends on how big a box these electrons are moving around in, and the quantum Hall effect had the initial, and when you count the number of things, if you actually fill one of these orbital levels, compl.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Really like in an Atom, you actually of course find an energy gap to the next, and it looks like you've explained the quantum Hall effect.",
                    "label": 0
                },
                {
                    "sent": "If the exactly N orbitals occupied completely, you'll get the right relation between the electron density and magnetic field.",
                    "label": 0
                },
                {
                    "sent": "To explain the quantum Hall effect.",
                    "label": 1
                },
                {
                    "sent": "But this is not can't be the possible explanation, because as I change the magnetic field, the number of levels changes, so there will only be exactly precisely one magnetic field, which this could happen.",
                    "label": 1
                },
                {
                    "sent": "While the one kissing discovered effect because he was like he was wise enough to good design his experiment not to switch on the magnetic switch on the current with the field in place, we have never got to exactly the same current have always got a slightly different ones.",
                    "label": 0
                },
                {
                    "sent": "He switched on the field with a constant current in place in a digital voltmeter and the digital voltmeter ended up reading the same number to some.",
                    "label": 0
                },
                {
                    "sent": "First they thought the digital voltmeter had to be a bad one because it kept coming to the same number of significant figures it was like.",
                    "label": 0
                },
                {
                    "sent": "And it turned out, of course it wasn't, and the numbers were significant, so the topology is what means that the magnetic field didn't have to be fine tuned in in fact.",
                    "label": 1
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It was only later that this was learned, really understood to be topological.",
                    "label": 0
                },
                {
                    "sent": "If I put the system in a box, then inside the box the electrons go around the little circles, but some of the circles near the edge of box they're going to hit the walls of the box and bounce back.",
                    "label": 0
                },
                {
                    "sent": "And instead of the circle instead of going around in a clockwise orbit, you'll find the ones that the boundary kind of go round in an anticlockwise hopping motion, skipping motion, and the energy is changed because the ones in the box have a nicely quantized energy, but it's only going half there, kind of.",
                    "label": 0
                },
                {
                    "sent": "And as you gets messed up, so if you go in the box, the energy levels aren't just straight like this, that they get to the end counting from the center of the box, they start to bend upwards and the highest level.",
                    "label": 0
                },
                {
                    "sent": "Let's fill this called the Fermi level.",
                    "label": 1
                },
                {
                    "sent": "And basically you can see that there's going to be a gap in the middle of the box wherever the firm if you can change the Fermi level, it's going to influence the boundary, but not this into the box.",
                    "label": 0
                },
                {
                    "sent": "So again, this says the first indication that this actually was a topological effect and its associated with this very characteristic.",
                    "label": 0
                },
                {
                    "sent": "Feature bound.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Reason for my one of the Co people.",
                    "label": 1
                },
                {
                    "sent": "One of the two Co laureates he he basically he did two things.",
                    "label": 0
                },
                {
                    "sent": "One of the things related to this that he came up with a beautiful calculation that obviously I can't go into.",
                    "label": 1
                },
                {
                    "sent": "But again toy models.",
                    "label": 0
                },
                {
                    "sent": "It turns out the realistic system.",
                    "label": 0
                },
                {
                    "sent": "You've got some more kind.",
                    "label": 0
                },
                {
                    "sent": "You got some dirt in the system and it's all messy.",
                    "label": 1
                },
                {
                    "sent": "It's not a perfectly clean box, but theorists like to work with things they can actually solve and he looked.",
                    "label": 0
                },
                {
                    "sent": "He studied the problem of a nicely periodic.",
                    "label": 0
                },
                {
                    "sent": "Potential in the box, which is completely unrealistic but is in principle similar and he found he found out of.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's a formula.",
                    "label": 0
                },
                {
                    "sent": "He found a formula for the whole thing, which turns out to be mathematically.",
                    "label": 1
                },
                {
                    "sent": "Related essentially, a generalization of the Gauss bonnet formula I shared so the Gauss bonnet got formula.",
                    "label": 1
                },
                {
                    "sent": "Got generalized by mathematicians in a much more abstract way where the curvature became not the physical curvature of a donut, but the more abstract curvature.",
                    "label": 1
                },
                {
                    "sent": "This will call the Berry curvature, but mathematically it's some curvature and some surface and you know the Donuts are kind of the real issue is not real Donuts only shaped like that?",
                    "label": 0
                },
                {
                    "sent": "But mathematically this is totally equivalent to what the.",
                    "label": 0
                },
                {
                    "sent": "Explanation of all this stuff using Donuts and coffee cups and this formula.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That they found, and then it took a.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Say it was in retrospect, so this explained it, and in fact the other thing I.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Describe the other day was.",
                    "label": 0
                },
                {
                    "sent": "The final piece of the thing that really unleashed a topological revolution many years later was that you could do this without a magnetic field, and I described that yes.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Today so.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Amazing things so so this system has stuff that goes around, goes around the edges without in one way, just like these skipping orbits.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it turns out you can do the same thing with light in photonic crystals and put, put, make these topological States and have put a boundary in the way and stuff still goes 11 way around the edges.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Topological insulator.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All kinds of stuff.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "Fractional Hall effect is where we have our great hopes for storing quantum information.",
                    "label": 0
                },
                {
                    "sent": "I'll show you one.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Picture.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Quantum Hall Flamingo.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Put this picture here.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in fact this is a image of what people are hoping to store quantum information in.",
                    "label": 0
                },
                {
                    "sent": "This is something where we've.",
                    "label": 0
                },
                {
                    "sent": "This is a quantum Hall effect fractional, but in fact now people are trying to do this with other wires.",
                    "label": 0
                },
                {
                    "sent": "This probably heard of Myron's was a big kind of big thing a few years ago was claimed in claim discovery of Marana Edge edge states.",
                    "label": 0
                },
                {
                    "sent": "These are these are like edge states or.",
                    "label": 0
                },
                {
                    "sent": "Viruses, so I make some defect in these States and it turns out that.",
                    "label": 0
                },
                {
                    "sent": "You can store it looks like I've just got four things here.",
                    "label": 0
                },
                {
                    "sent": "They actually four places where a quarter of an electron is start again, this funny fractionalization and quantum mechanically.",
                    "label": 0
                },
                {
                    "sent": "There's a hidden degree of freedom in this four quasi particle system of non abelian quantum Hall state that there is hidden in there.",
                    "label": 0
                },
                {
                    "sent": "You can entangle these things in two different ways, which and I've chosen this got some kind of this is on the surface of a sphere, so it's got some.",
                    "label": 0
                },
                {
                    "sent": "Tetrahedral symmetry, so I've chosen two particular symmetry combinations, so when you look at it, you look at it on the without detail.",
                    "label": 0
                },
                {
                    "sent": "You see, there's kind of four blobs there, which will contain 1/4 of an electron, but the two if you entangle them in one way you can.",
                    "label": 0
                },
                {
                    "sent": "There's a very tiny little wiggly pattern that's different for the two ways of in tangling it, and I can take a quantum mechanics.",
                    "label": 0
                },
                {
                    "sent": "I can take a linear combination of those States and then the pattern changes, but so.",
                    "label": 0
                },
                {
                    "sent": "As you pull the things apart, this little wiggles get exponentially small, and when they are far apart from each other, they imperceptible.",
                    "label": 0
                },
                {
                    "sent": "So the big problem of destruction of the information is if a cosmic Ray or something passes through or piece of then it could.",
                    "label": 0
                },
                {
                    "sent": "It could, in principle behave differently depending on the wiggle pattern, and that would measure it in some way.",
                    "label": 0
                },
                {
                    "sent": "But so once these things are spread out, the information which is vaguely hidden in this little wiggle pattern is become spread out all over the system and damaging it.",
                    "label": 0
                },
                {
                    "sent": "One place can't affect it, and so this is an example of the thing that where the hiding of information in the pattern of entanglement inside the system.",
                    "label": 0
                },
                {
                    "sent": "This is a dream for the topological quantum computer.",
                    "label": 0
                },
                {
                    "sent": "And then I say there's all kinds of amazing things that keep getting discovered in this area.",
                    "label": 0
                },
                {
                    "sent": "You know people have gone or they started off my works.",
                    "label": 0
                },
                {
                    "sent": "Kind of little piece of it, but somehow it opened up a floodgate of people looking at this stuff and and all kinds of great things get be found by.",
                    "label": 0
                },
                {
                    "sent": "Lots of people, so they're all going to be my bet for the next Nobel Prize in this area would be if this stuff could.",
                    "label": 0
                },
                {
                    "sent": "If one can actually show demonstrate this hiding of quantum information and maybe manipulating it would be, that would be incredibly exciting.",
                    "label": 0
                },
                {
                    "sent": "Experimental development and lot of people are trying to do this right now, and.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So anyway, there's a lot of things going on.",
                    "label": 0
                },
                {
                    "sent": "I haven't got it.",
                    "label": 0
                },
                {
                    "sent": "Can't go into everything, but I would say you know the whole cattle.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Things I would just say there's a lot more in this and there's a great future.",
                    "label": 1
                },
                {
                    "sent": "And who knows what will the future is of course difficult to predict as the baseball star forget his name in America.",
                    "label": 0
                },
                {
                    "sent": "Supposed to set it.",
                    "label": 0
                },
                {
                    "sent": "It's hard to.",
                    "label": 0
                },
                {
                    "sent": "What you predict to all the future is hard.",
                    "label": 0
                },
                {
                    "sent": "It's hard to make a prediction, but we can predict about the past but not the future, but.",
                    "label": 0
                },
                {
                    "sent": "As I say, this stuff is opened up and it's certainly becoming intellectually very exciting area and lots of young people have got excited about topology and and number of seminars where you see the coffee Cup and the Donuts turning into each other.",
                    "label": 0
                },
                {
                    "sent": "I mean I said please please at least show the loving Cup.",
                    "label": 0
                },
                {
                    "sent": "Well, thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you for wonderful presentation.",
                    "label": 0
                },
                {
                    "sent": "We have a few quick we have time for a few questions so please.",
                    "label": 0
                },
                {
                    "sent": "Don't be shy, there's a question there.",
                    "label": 0
                },
                {
                    "sent": "What is theoretically possible to use groups of quantum entangled particles?",
                    "label": 0
                },
                {
                    "sent": "Which properties we could control?",
                    "label": 0
                },
                {
                    "sent": "To teleport objects.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure objects, I guess.",
                    "label": 0
                },
                {
                    "sent": "It's the teleportation is really the teleportation of information, I think.",
                    "label": 0
                },
                {
                    "sent": "So the information is contained in the quantum state and there's a theorem that says you can't copy a quantum state.",
                    "label": 0
                },
                {
                    "sent": "You can't make a copy of a quantum state because in some sense too.",
                    "label": 0
                },
                {
                    "sent": "If you want to want to make make a quantum state exactly equal to another quantum state.",
                    "label": 0
                },
                {
                    "sent": "Of course, you could always measure it and then find out what it was and then make a copy of it.",
                    "label": 0
                },
                {
                    "sent": "The idea is to copy it without measuring it, so you have a quantum state you don't know what it is you want to make, another one, which is exactly the same it tells us.",
                    "label": 0
                },
                {
                    "sent": "Basic theorem that says you can't do that.",
                    "label": 0
                },
                {
                    "sent": "You can't copy a state without measuring it, and then of course.",
                    "label": 0
                },
                {
                    "sent": "But the teleportation ideas you can take a state that you don't know what it is and you which is probably a set of atoms or spins at this point are in that state.",
                    "label": 0
                },
                {
                    "sent": "The information is encoded in that state, but if you're trying to measure it, you reveal it and you can't process it anymore.",
                    "label": 0
                },
                {
                    "sent": "So the quantum the teleportation issue is to take those state of those atoms and move it to another set of atoms far away.",
                    "label": 0
                },
                {
                    "sent": "Of course, this information will no longer be here 'cause you couldn't copy it, so you've removed the information for those and put it over there and transmitted it.",
                    "label": 0
                },
                {
                    "sent": "And that's what all this talk about quantum teleportation protocols are is for your teleporting, not the matter, but the state.",
                    "label": 0
                },
                {
                    "sent": "Now, of course, you could argue that that I'm just a state of matter in a certain thing, and if it was, you know, Star Trek.",
                    "label": 0
                },
                {
                    "sent": "Much finer.",
                    "label": 0
                },
                {
                    "sent": "You tell that when you step into the box on this side, you are being destroyed here and and they and the other person who owned the box said, don't worry, you're going to be reconstituted over there, but of course this is a question of trust, right?",
                    "label": 0
                },
                {
                    "sent": "But but if, of course, if you say we're just a state, then.",
                    "label": 0
                },
                {
                    "sent": "The matter itself is not getting transported.",
                    "label": 0
                },
                {
                    "sent": "What's getting transported is the state of the matter is basically making, as I say, the making to remove the information here, destroy the stage, right?",
                    "label": 0
                },
                {
                    "sent": "This is like but you move the state without actually knowing what it was without measuring it.",
                    "label": 0
                },
                {
                    "sent": "And then you can, because in all this quantum protocols for quantum computation you manipulate the state and you do very things with it.",
                    "label": 0
                },
                {
                    "sent": "You've got to get the answer out at the end of the day the answer is got by doing a measurement, right?",
                    "label": 0
                },
                {
                    "sent": "But of course you can only do that after all the manipulations have been done, so you have to move the state around, and in this example, let's see if I got it again.",
                    "label": 0
                },
                {
                    "sent": "I probably not.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure how to get out of this without I shouldn't have stopped it.",
                    "label": 0
                },
                {
                    "sent": "I've I can't control this on my computer anymore because it's all I've got the wrong screen, but the if these things were the four blobs you can move them around the computations actually supposedly done by by called braiding.",
                    "label": 0
                },
                {
                    "sent": "You got these these?",
                    "label": 0
                },
                {
                    "sent": "Four things and I move one around the other in a certain path and it changes the quantum state.",
                    "label": 0
                },
                {
                    "sent": "These little wiggly information patterns get changed by dragging one through the other and the computation protocols involve stiring this thing up and provided they never get close to each other.",
                    "label": 0
                },
                {
                    "sent": "You're protected, the information is protected now.",
                    "label": 0
                },
                {
                    "sent": "There's still at the end of the day, there's still an issue of getting it out, right?",
                    "label": 0
                },
                {
                    "sent": "So you actually have to bring something close together, so there's still a dangerous period when you try to extract the information.",
                    "label": 0
                },
                {
                    "sent": "And of course, but so as a theoretical possibility conceptually, this is, this protection is very appealing as avoiding this whole issue of entangled with environment because the information is not.",
                    "label": 0
                },
                {
                    "sent": "It's stored locally.",
                    "label": 0
                },
                {
                    "sent": "It's a bit like your memories in the header kind of thing.",
                    "label": 0
                },
                {
                    "sent": "We know a bit more where they're stored, but you can get, you know you can get shot in the head and and parts of you missing, but you can reconstruct.",
                    "label": 0
                },
                {
                    "sent": "It doesn't have.",
                    "label": 0
                },
                {
                    "sent": "It's not clear where the memory.",
                    "label": 0
                },
                {
                    "sent": "You can't just ZAP a particular neuron and say the memory is gone, 'cause it's stored is stored in this kind of non locally right and simply information can be stored in this nonlocal paddle of entanglement.",
                    "label": 0
                },
                {
                    "sent": "And conceptually that's a way to avoid this whole issue of contamination by the environment now.",
                    "label": 0
                },
                {
                    "sent": "There's lots of 1st Quantum computer, maybe a small one and maybe they build it with ion traps and things.",
                    "label": 0
                },
                {
                    "sent": "But also there's lots of different Google or backing.",
                    "label": 0
                },
                {
                    "sent": "One thing Microsoft put a billion dollars into braiding.",
                    "label": 0
                },
                {
                    "sent": "China wants to put 10 billion dollars because they want to have the world for me.",
                    "label": 0
                },
                {
                    "sent": "Lots of.",
                    "label": 0
                },
                {
                    "sent": "I mean, there's lots of lots of different approaches, which is good 'cause they're all competing with.",
                    "label": 0
                },
                {
                    "sent": "Competition is really pushing people and.",
                    "label": 0
                },
                {
                    "sent": "And the claim is that if you get you just the claim is you.",
                    "label": 0
                },
                {
                    "sent": "If you could make a 50 qubit computer, you could beat today's Q, but if I don't have true or not, but that you know, starting off, we're trying to make a three qubit computer, but to push it to 50 we've got this big problem making things bigger.",
                    "label": 0
                },
                {
                    "sent": "And this is 1 one approach, but it may not be the one that wins, or maybe none of them win, right?",
                    "label": 0
                },
                {
                    "sent": "OK, some more questions please.",
                    "label": 0
                },
                {
                    "sent": "Somehow, this revival of entanglement is that.",
                    "label": 0
                },
                {
                    "sent": "True that in fact, normal ground state of the matter are not entangled.",
                    "label": 0
                },
                {
                    "sent": "That's why it's only rediscovered now.",
                    "label": 0
                },
                {
                    "sent": "Or yeah, normally the this is the kind of kind of long range topological entanglement Sensi, as I say in this spin chain, you chop it.",
                    "label": 0
                },
                {
                    "sent": "The entanglement if it's going all the way through it.",
                    "label": 0
                },
                {
                    "sent": "If you break it, it's gotta stop.",
                    "label": 0
                },
                {
                    "sent": "So in some sense, that's why the boundaries.",
                    "label": 0
                },
                {
                    "sent": "So the normally of course there's always entanglement.",
                    "label": 0
                },
                {
                    "sent": "A short short amount, but there's no kind of profound entanglement like there is in these materials, so.",
                    "label": 0
                },
                {
                    "sent": "If you have two pieces of matter, of course, if you make a measurement of 1 pic close to another bit, they affect each other, but the measurement doesn't affect things at long distance, so so the normal things that the toy model of just a completely independent atoms assembled into a into a line.",
                    "label": 0
                },
                {
                    "sent": "Of course they do interact a little bit, but they don't have this kind of dramatic.",
                    "label": 0
                },
                {
                    "sent": "Difference topological difference.",
                    "label": 0
                },
                {
                    "sent": "So everything is a little bit entangled across any boundary.",
                    "label": 0
                },
                {
                    "sent": "There's some entanglement in quantum mechanics, degrees of freedom or not.",
                    "label": 0
                },
                {
                    "sent": "They're all connected, but.",
                    "label": 0
                },
                {
                    "sent": "The the topological stuff is is quantic qualitatively different, which is why it's topological right?",
                    "label": 0
                },
                {
                    "sent": "Hello.",
                    "label": 0
                },
                {
                    "sent": "Hi asking care.",
                    "label": 0
                },
                {
                    "sent": "Are there some possibilities to get two entangled states also in living matter?",
                    "label": 0
                },
                {
                    "sent": "In biological in biological matter, is it possible well that some far out ideas that my colleague Matthew Fisher has been pushing?",
                    "label": 0
                },
                {
                    "sent": "But yeah, I mean, there's often a strange ideas about you know.",
                    "label": 0
                },
                {
                    "sent": "In fact, Nobel Prize winners often go off to say I want to.",
                    "label": 0
                },
                {
                    "sent": "Well, I can't do anything more than what I've done.",
                    "label": 0
                },
                {
                    "sent": "So let's think about the brain right?",
                    "label": 0
                },
                {
                    "sent": "Cooper did that.",
                    "label": 0
                },
                {
                    "sent": "I guess.",
                    "label": 0
                },
                {
                    "sent": "There's the.",
                    "label": 0
                },
                {
                    "sent": "Love.",
                    "label": 0
                },
                {
                    "sent": "Hawkings Colette Hawkings mentor.",
                    "label": 0
                },
                {
                    "sent": "What Penrose right.",
                    "label": 0
                },
                {
                    "sent": "Yeah Penrose, of course, went off to the brain and had some complicated thing with what did the brain to work by quantum gravity or something, and well, it was interesting observation by my Matthew Fisher is a pretty well known condensed matter theorist.",
                    "label": 0
                },
                {
                    "sent": "He's been interested it was interested in the issue of why lithium works for you know.",
                    "label": 0
                },
                {
                    "sent": "For manic depression or bipolar disorder, and it turned out that the claim is that it depends on which isotope of lithium that is and and so had some ideas that maybe there was.",
                    "label": 0
                },
                {
                    "sent": "Where could you find biological thing at first sight is there's no kind of quantum coherence, but fairly the nuclear spins can be can form some kind of cage of molecules.",
                    "label": 0
                },
                {
                    "sent": "Water molecules around the lithium ion or something where the.",
                    "label": 0
                },
                {
                    "sent": "The lifetime of the quantum state of some of these nuclear spins.",
                    "label": 0
                },
                {
                    "sent": "This could be is remarkably large, right?",
                    "label": 0
                },
                {
                    "sent": "And so there was.",
                    "label": 0
                },
                {
                    "sent": "I mean, they look.",
                    "label": 0
                },
                {
                    "sent": "I mean, these are kind of like far out type of speculations, you know?",
                    "label": 0
                },
                {
                    "sent": "Of course, consciousness and the way the brain works is kind of still one of the big things which is going to be worked on tremendously in this next century.",
                    "label": 0
                },
                {
                    "sent": "And who knows what the robots will have?",
                    "label": 0
                },
                {
                    "sent": "Consciousness or not, but, but yeah, so I mean so.",
                    "label": 0
                },
                {
                    "sent": "But all this stuff is kind of like very far out speculation the BBC picked up Matthew Fisher stuff and the guy in the BBC put a big long article about.",
                    "label": 0
                },
                {
                    "sent": "You know, quantum physicists, and.",
                    "label": 0
                },
                {
                    "sent": "Brayden Penrose and things, but, well, you know, we can see if it's this stuff gets stuff gets reduced, or I mean it's difficult at first sight to see where quantum quantum quantum mechanics and voice there for the molecular bonds, but coherence of quantum states could play any role.",
                    "label": 0
                },
                {
                    "sent": "But but nuclear spins, for example, rather well disconnected from the electron spin, and there are not ones place.",
                    "label": 0
                },
                {
                    "sent": "I think it's probably a good time to stop.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "It's been a wonderful Holidays and thank you again.",
                    "label": 0
                }
            ]
        }
    }
}