{
    "id": "ch2iz24yg3xvxur6qg2y4lwwbkvjd3tr",
    "title": "Domain wall conduction in bismuth ferrite",
    "info": {
        "author": [
            "Goran Dražić, Odsek za elektronsko keramiko, Institut \"Jožef Stefan\"",
            "Tadej Rojac, Odsek za elektronsko keramiko, Institut \"Jožef Stefan\""
        ],
        "published": "Jan. 16, 2017",
        "recorded": "January 2017",
        "category": [
            "Top->Science->Materials Science"
        ]
    },
    "url": "http://videolectures.net/kolokviji_rojac_drazic_wall_conduction/",
    "segmentation": [
        [
            "Today's stock will be given by professors today, right Sangrand Rogic, who survives, got his BS in chemical engineering and his PhD in chemical engineering from the University of Ljubljana.",
            "He has been employed at the Your Steven Institute since 2000 and in 2009 he was April doctoral associate at the Swiss Federal Institute of Technology in Lausanne.",
            "Since 2013 he is assistant professor at the gorgeous Definidor Gradual Integration, International Postgraduate School.",
            "The main research topics of his work car mechanic.",
            "Chemical reaction mechanisms.",
            "Application of mechanochemical processing and synthesis of complex ceramic oxides and processing structure properties.",
            "Relations in lead based and let free ceramics and thick films.",
            "The author of 74 papers for review papers for chapters and in monographs in one patient.",
            "Professor Goran Dragic got his BS MSN, PhD in chemistry from the University of Ljubljana.",
            "He was employed at the Your Steven Institute since 2000 since 1980.",
            "First, as appears student then in various other statuses, eventually as a senior scientist since 2006.",
            "He is assistant professor in the field of Nano Science and microscopy.",
            "Your Steven International postgraduate school.",
            "In 2012, he moved to the National Institute of Chemistry as ahead of the Electron Microscopy Group at in the Department for Materials Chemistry.",
            "The main research topics of Professor Drudge Work, our development and characterization of materials with special properties, development and implementation of electron microscopy, and Micron olitical techniques for study of modern nanomaterials.",
            "Then investigation of nucleation and crystallization of catalytic nanoparticles and so on.",
            "His Co.",
            "Author of around 200 papers and around 80 proceedings papers, 10 book chapters and one patent.",
            "An for his work he was awarded the Toy Certificate of Recognition and Year.",
            "2000 today's stock is dedicated to their recent work, which was done exclusively in Ljubljana and was recently published in the Nature Materials.",
            "So let's.",
            "Here's the talk and the first part of the talk will be given by police reports and then pursued.",
            "Raj will take over.",
            "OK, thanks a lot for the nice introduction.",
            "First of all, thanks to all of you for coming.",
            "We were not expecting so many, so I'm very glad that you're here.",
            "Well hopefully will not get asleep.",
            "Will try to do our best with Gordon to make things interesting.",
            "This is basically a work that was done in the last maybe 2 three years with more than that I'll show some results even older than this.",
            "It has to do with this domino conduction business.",
            "Right, this is the work that was done in collaboration with between our Institute and Chemical Institute, National Institute of Chemistry, Hiragana.",
            "She's walking diversity and Swiss Federal Institute of Technology design.",
            "So I was told by pretty much before this lecture that I have to bring it.",
            "Have to give some sort of general introduction to the field.",
            "So the idea is to start with some basic definitions so you can see what the fair electric materials, how they're used, what is electricity, and so on.",
            "I apologize to probably most of you which know very well what.",
            "What this topic is and then I will try to scale up until this specific problem of Domino Wall introduction.",
            "Before I will try to show you why.",
            "What is Domino Wall and why it's important in our field so."
        ],
        [
            "Let's start first with the materials, so the materials that we work with are called ferroelectrics.",
            "These are basically a subgroup of dielectric materials.",
            "More precisely, pyroelectric materials.",
            "They have this sort of particularity that they exhibit similarity in the structure.",
            "So the best way to represent this by through a Periscope structure.",
            "This is also one of the most important structures from application pool interview, so some temperature we have this CU Parul Skype, for example inviting tighten it and then when you call it below to see.",
            "Political develops 1 axis will allocate the direction.",
            "This is what we call spontaneous train and along the same direction.",
            "These ions in the structure such that basically their displays.",
            "So the data center do not coincide and this makes the material product.",
            "It's called spontaneous polarization, which is collinear with spontaneous train.",
            "Now Farrell actress has this additional ability that you can switch this spontaneous polarization reversibly.",
            "Appliance sufficiently high electric field so you can, for example by feel like this you will switch the polarization app.",
            "You switch off the filter.",
            "Polarization will still up and you can do the same way, for example by by switching down.",
            "This is the origin of the very well known hysteresis for electric.",
            "Hysteresis loop basically tells you that you have some polarization that can be switched permanently under applied electric field.",
            "This is very often what we measure to prove also Felicity material.",
            "Beyond other things.",
            "This material is also another property which is called by electricity, and in particular ferroelectrics are very good by the electrics.",
            "Do some specific structure that they contain.",
            "I will show this later.",
            "It's late basically with Roman walls is one of their origins of hype.",
            "Is electricity puzzle activity is just linear phenomenon.",
            "Basically Electro mechanical Effect, meaning that when you press your material you will generate some surface charges or electrical current or voltage depending how you design your circuit and vice versa.",
            "When you buy electric field you have a change of shape in your material.",
            "So This is why these materials are vastly used in sensor actuators and ultrasound transducers.",
            "There many such application with this material use.",
            "Sensors, for example by electrical using sensors accelerometers so they can.",
            "They can detect dynamic forces.",
            "This is how, for example some airbags work.",
            "So basically have a pie selected that it takes the force when the car crashes and this gives a very fast signal electrical signal that activates their back is 1 example.",
            "Of course our backs also work in other ways, not just by the electric one.",
            "Then you have for example this nice example.",
            "Perhaps you thought sometimes why this screening smartphones flip around you have.",
            "Basically applies electric material inside which is called an angle or angular accelerometer.",
            "When you do like this, you change the angular velocity.",
            "Basically this force will be filled by the pies electric and it will give us some signal that will flip the screen around for 90 degrees and then you have for example the converse effect, which can be used when you want to have some strange.",
            "This is an example of inject printing by electric.",
            "Once we have a pie, Selectric material typically deposit on the substrate you applied field change shape.",
            "This will deform the diafragma man it will jet basically or.",
            "In Kona paper, so you have this by electrics everywhere.",
            "Basically at home in your car, at an office, and so on, so that vastly using these applications there's another property, this ferroelectrics, which is very important.",
            "This is the main topic of this talk today, in that they form domains and domain walls.",
            "Imagine here this dragon structure, which develops from the CU one, so the polarization is spontaneous.",
            "Polarization can basically can be oriented, can happen in different directions.",
            "In this specific case.",
            "For tetragonal structure you have six possibilities.",
            "You know, up, down, left, right in plane and out of plane and in first approximation we assume that this six directions are equivalent.",
            "So when you cool down, all six are possible and it will be formed.",
            "That's why, for electrics from domains, domains are basically region inside your grains in a ceramic when the spontaneous polarization homogeneous looks in One Direction and then in the same grain you will have just adjacent another domain looking in some other direction within these six permitted directions in the dragon phase, and the boundary between.",
            "This polarization states are called called domain walls or domain boundaries, and this is the main topic of the talk today.",
            "I'll talk about this Domino's here.",
            "That's an example of 180 degrees domains or domain wall because it separates into two domains with antiparallel orientation of spontaneous polarization.",
            "There are other versions you can have also 90 degrees.",
            "For example if you are.",
            "If you have, for example, possession in one domain that develops up in the other left.",
            "For example, you have a 90 degree.",
            "So why?"
        ],
        [
            "This is why we make big deal with this domain.",
            "Walls is simply because they strongly affect the properties of paraelectric.",
            "Actually many application uses for electrics because you can design material through domain wall to domain walls basically.",
            "So the clue here is that this domain words are not static at all under external field.",
            "So if you have an electrical stress field they will move.",
            "They will oscillate, displays band their theories that explain this.",
            "Schematic just to show you how this work.",
            "Imagine you have 108 here degree domain.",
            "While you basically apply field like up this, this domains with polarization looking down will not be happy if you make if you apply filled up so they would like to switch up, meaning that the domain wall will move to the right.",
            "The domains do not move the domain wall moves.",
            "Basically what happens is this volume fraction of domains looking up will increase at the expense of those looking down, which means that the domain model must move in some way.",
            "Single happen if I apply it fell down it will move in the other direction.",
            "Now imagine that animal oscillating electric field you know up down certain frequency is nominal constellate make some samosa motions and this is very fast.",
            "For example we know that this dominant motion can happen can follow electric field self up to GHz frequencies, serialization PC data related to the visible downward motion.",
            "So it's pretty fast.",
            "You have here a variant of 180 degree domain.",
            "Well this is important.",
            "We usually differentiate between hundred 18180.",
            "The difference here is that with this 180 motion you will also flip the spontaneous train, meaning then when applied field, when the domain will move, you have also basically a change of shape, your grain, your material.",
            "That's why this this motion even under very weak fields well below the macroscopic coercive field for this switching can have a very crucial influence on the piezoelectric properties over electrics.",
            "In some materials.",
            "This contribution here it's up to 70% of the total price electric response.",
            "It's not small, it's even more than half.",
            "Of the electric coefficients in a response from her electrics comes from this mechanism here, so we use this.",
            "People use this concept to design materials and to have large buys electric efficient.",
            "However, this is not for free as usually it goes to an expense of having your price electric response, which is very dependent upon the external value variables.",
            "For example, the function of it becomes basically strongly.",
            "Strongly affected by the electric field amplitudes and frequency and you have this large hysteresis.",
            "The best way to represent this and to explain to you why this is important, is design of Domino Wall.",
            "Displacement is by using the concept of hardening and softening capacity.",
            "This logically most important way of how how to basically control by electric properties in fair electrics.",
            "Unfortunately it works well for PC but not so well for many other materials.",
            "Basically what we do is without our PC this let's circle.",
            "Tonight is the most used ferroelectric materials in piezoelectric applications.",
            "So you dope with Donald Open, for example, newbie Mona Iron, Titanium, titanium, strontium side.",
            "It's a downward opened.",
            "You will create by very small amount.",
            "You will create such defects that will in case this domain wall motion.",
            "So get large pies electric coefficient but you get high studies in the response and strong dependency of despise electric coefficients.",
            "A function of field, basically frequency and temperature in some application this instabilities are not so important.",
            "When ice example is this fuel injection system that you have in the car is basically we have a multilayer actuator of positive soft Pvt which wich applying filled with the forms and jet your fuel in the combustion engine.",
            "Basically here we just need high stroke.",
            "We don't care much about this instabilities and this is where you can use office for example.",
            "Then you have other applications in which buys electric.",
            "Ferroelectrics are used.",
            "A nice example of this.",
            "Atomic Force microscopy tube scanner is basically a tube made of ice electric.",
            "Spoiler radially and by applying field you can move move it bandit extended like this very precisely.",
            "The precision of this is sub nanometer.",
            "Solve around hundreds Tampico meters.",
            "You can imagine that for pies electric should be much more stable in its response for such applications should be linear pretty independent upon external variables because you need precision actuation for that feels hard pizzetti we basically dope it will accept or create some defects, mainly oxygen vacancies and this oxygen vacancies.",
            "Axes spinning sites for the domain wall.",
            "So we somehow this doping block.",
            "What minimize you can ever block completely, but you can minimize this sort of domino wall displacements so that you have a lower price electric coefficient.",
            "But you can use it for precision activation so you can see now that basically.",
            "Basically I think you should see now why these numbers are important.",
            "It represents one of the ways of how to control pies, electric properties in fair electrics, and by doing this control here you can have same nominally same material specity used in mass production devices such as cars or very very specialized product like.",
            "Scanner this is the reason why this domain walls are over study.",
            "It's quite extended constantly in the large last, even 4050 years.",
            "It has to do with applicative science."
        ],
        [
            "Basically so.",
            "For the same reason, you can also understand why this this paper published by saddling coworkers in 2009 came a bit of a surprise to the community in a sense that they discovered.",
            "I will not say well, you can say discovered these things were discussed in 70s, but basically they were first to show experimentally prove that the domain wall itself can have different properties.",
            "It can have its own property.",
            "If you think this is not much unexpected because you know domain wall, internal structure of domino like Tronic in atomic.",
            "Should be different than the domain, so it is expected that the domain we will have different properties the domains, but they show this for the first time they actually showed.",
            "The Domino's has a higher electrical conductivity then the domains itself so they can carry much large current and the domain which are attached to this domino wall.",
            "So this is the paper the materials business right?",
            "Which I'll talk mostly from now on.",
            "It was prepared in affirmative film.",
            "These are appealed films.",
            "110 identity protection ones.",
            "What they did.",
            "Basically the first switch the film.",
            "You can do it in this 110 intention to have all three types of domain walls in BF oh, which are 71 hundred 980.",
            "These are the angles you know, spontaneous polarization, which I showed previously for the dragon structure.",
            "This orbital is different and basically by doing that they actually use conductive AFM to detect the local currents.",
            "It's imagine just classical FM microscope, but you apply a certain DC bias there, so voltage and plus 5 volts you travel it around your sample and you measure the current in each individual point during scanning.",
            "This is the current image current Maps from surface of such in film and you can see that here where Domino's lie there is in case current signal.",
            "This white part is basically a large current signal, much larger than in the domain itself.",
            "They prove this also deciphering techniques are problematic when you work with domain walls because you can get current by switching them if you switch them you should get some displacement current.",
            "We should be transitioned so they tested this by, you know monitoring the current for over 3 four minutes and the current at the domain was usually higher.",
            "And the domain, and very stable.",
            "So it's true electrical conductivity that is higher at the domino wall with respect to the domain later.",
            "This paper was quite a breakthrough in a sense that later you know, in starting from 2009 until practically today they discovered this domain.",
            "Will conductivity is not only confined to this material to this fair, electric specifically, but they prove it in many other materials.",
            "PCT, which is the most important.",
            "Basically lithium niobate and some improper for electric.",
            "So they show that this is quite a general property of ferroelectric.",
            "And at that time we had no idea how this, for example, how this domain welcomed activity can affect your.",
            "For example, is electric response, so this is."
        ],
        [
            "This is why we started to work on that topic.",
            "It was related with the project that we had from bismuth ferrite.",
            "I think it was 2011 twelve.",
            "The idea was to 1st see if we have this electrical conductivity in polycrystalline ceramic samples.",
            "The conductivity by saddle was discovered in film, so we want to see if you have also your ceramics that is conductive at the domain walls and then try to see if this affects properties.",
            "That was the most important part, otherwise it's not.",
            "There's no sense to work with that, so we use a methodology just like the same similar delicious just like Indian films, PFM was used to identify to image the domains and domain walls have domain walls.",
            "Here, let's face image an using conductive AFM just like, say, the link workers we basically found.",
            "Also in this hour polycrystalline samples that we have this case conductivity, the Domino's is white stripes basically tells you that you have a large current larger than in the main itself.",
            "Then we're using some other techniques.",
            "CBS D. We also found that all three types of domain walls, so the 71 hundred, 980 or conductive Poly crystalline bismuth ferrite.",
            "We also found this local domain will conductivity, which is a bit expected.",
            "I would say affected by electric properties.",
            "I will not go too much in detail into this.",
            "It's pretty complex topic, but basically you can imagine that this conductivity couples with the domain well dynamics.",
            "So the conductivity that is there a domino wall basically will.",
            "Will influence how the Domino's will move under stress and electric field at sub switching conditions, meaning that the domain will start to move once you allow conductivity in the material.",
            "So you need to move those charges that are responsible for the conductivity to move the domino wall and basically microscopic view from microscopic properties of a whole ceramic.",
            "1 millimeter size sample.",
            "What happens is that you get strong instability in the pies.",
            "Electric response at conditions that maximizes conductivity.",
            "So if you work with low frequencies Highfields.",
            "In high temperature conductivity is maximized.",
            "You will give this enhancement of by electric response.",
            "For example, you can measure by electric coefficient 120 such conditions which is 3 times higher than their own temperature value, and all this is coming.",
            "All this is extrinsic, it's related to this conductivity domino wall.",
            "So it's important.",
            "Basically this influence is quite big and it's important to understand where this domain work.",
            "Conductivity comes from.",
            "This was the idea so try to understand this."
        ],
        [
            "Now, if you look in the literature about the studies on the origins of this domain, will conductivity you will easily see that it's a very complex issue, so there are many different mechanisms that have been proposed for this domain.",
            "Well, conductivity, interesting.",
            "The studies were mainly theoretical, so there are no much experimental studies.",
            "Some indirect that suggest some role of defects in this conductivity, but it was never identified which ones and how they work and what is the mechanism and so on.",
            "Now several different materials have been studied theoretically because they found this conductivity in many other fair electrics.",
            "For example, for business right there is one mechanism which I think should be valid.",
            "They showed theoretically that because of some structural changes at the domino wall, basically have a reduction of the band gap at the domino wall.",
            "They should increase the conductivity there.",
            "But you know these same principles are not valid, for example for the city.",
            "So there's there's either there is another mechanism that there should be something else more general that causes conductivity in all these sort of electrics.",
            "There is one common point in all these models.",
            "In that they basically predict.",
            "That's because of specific polarization and strange state at the domino wall.",
            "When this polarization flips around from one state to the other, there should be a tendency of defects to segregate the domino wall.",
            "Basically to decrease this depolarizing fields and this train string, red and so on and just imagine they tend to go there.",
            "And once they are there, basically they can give you conductivity.",
            "Their mobile classic effects conductivity.",
            "So we wanted to test this model to see if this is this is the case in business."
        ],
        [
            "Right, so here we went pretty with the direct method.",
            "So we wanted basically to see these defects.",
            "That's why we used scanning transmission electron microscopy with ECS corrected microscope.",
            "The Chemical Institute.",
            "Now I'm not going here into details because Gordon basically will present details of how this methodology was developed and all the difficulties that we got identifying these defects domain walls.",
            "This is just so just basically explain you the story here.",
            "So this is an image.",
            "Darkfield images is known, said and well known samples at concerts image.",
            "This is basically sensitive to heavy atoms in basement.",
            "Verizon business in Iran.",
            "So the big spots are abysmal.",
            "The small spots are iron.",
            "If you look at this region you can see that the siren is displaced from the center of the basement sub lattice.",
            "That's related with the polarization, which looks like this.",
            "And then in the other region just beyond the domain, while you have another orientation.",
            "And since these angles form for different in 180 and this domino wall runs parallel to the 10100 plane.",
            "We identify the specific domain Wallace 109 in a similar way we were able to to also identify other domain walls 71180.",
            "We have plenty of regions to work and try to detect this defects that are presumably responsible for conductivity from theory."
        ],
        [
            "So to identify the defects, we used two completely independent methods that's I think very nice because they effects just pop up by working with two completely different methods, and they're very consistent as I will show later.",
            "So we work with this electronic defects through want identify this electronic effects through oxidation state of iron.",
            "So for that we'll view deals, yes analysis and we want also to probe the ionic defect.",
            "Basically vacancies that will mainly talk about business practices because we have no evidence of violence.",
            "I can see here.",
            "Fortunately we're blind for oxygen vacancies, and I hope God will again give some ideas of how we can make these methods better to see also oxygen vacancies.",
            "But in that case, results are consistent even if we don't.",
            "Basically, if you cannot detect oxygen vacancies, so we'll see what we did is to basically collect some real Spectra in the domain and inside the domino wall in very small regions 9 roughly 9 * 1 unit cell.",
            "We collect the spectral, determine the difference in the energy of OK, and I run L3 edge this is.",
            "Chemical shift methods and it's proportional to the oxidation state of iron and then by working with our material and using this calibration curve which was made by using some standards with known oxidation states.",
            "That's why Bush Shannon Grasper, we were able to identify that we have mainly in Iron 3 plus states in the domain while the domino wall is basically have basically item 4 plus which dominates.",
            "So we have strong strong segregation of item 4 plus states at the domain.",
            "Well, that's actually an electron hole.",
            "It is localized Iron 3 plus sites.",
            "Then we work with quantification of dark field images.",
            "Basically what you do Gordon will explain this into details.",
            "You need some procedure and usually intensities of this individual basement columns are now by doing this procedure this intensity should be basically if I.",
            "But I would be oversimplified but should be proportional to the number of atoms of bismuth atoms in that specific column.",
            "So if you have a missing basement vacancy, this intensity should decrease and we consistently see this reduction very large, reduction 1520% in intensity just in the middle of the domino wall.",
            "This is a basement basement column intensity map and this basically suggested we have segregation business vacancies there inside the Domino region.",
            "So with two methods independent we identify this sort of defects.",
            "Item 4 plus.",
            "These vacancies and this now explains basically the conductivity at the Domino wall.",
            "So if you assume that business back in there not very mobile at room temperature, the conductivity should be P type basically related to electron hole hopping between item four and three plus state the two other important thing here is this defect pretty consistent with what we know from the Fed chemistry model for business right this?"
        ],
        [
            "Shown here so business right?",
            "Specific cause it contain a cation that siren, which can be both oxidized introduce.",
            "You can have either died and two and four plus state, and that's why that's why it can be either P or N type conductor depending how you process it.",
            "This is this was mainly done by the Sheffield Group and Bite or grand in already.",
            "They are experts in effect chemistry of parasites.",
            "So this is classical plot of conductivity as a function of partial pressure of oxygen.",
            "You can see this increase in conductivity or the two extremes of PO2.",
            "Marking the P&N type, it seems so these these experimental data were fitted with a model that assumes three effect reactions.",
            "One is the volatilization of bismuth oxide, basically creation of bismuth and oxygen vacancies and then, depending on how you which Pier two, we work basically you will either fill this oxygen vacancies oxidizing that restates iron to four plus states, or if you work at low partial pressure of oxygen you will create more oxygen vacancies which will then compensated by electrons.",
            "Creating item 2 plus states this model also tells you that if you work in air, like in our samples, when we identify these effects you should of course in a browser approximation you should end up with four plus defects compensated by basement vacancies.",
            "And this is exactly the defects that we are locali detect with two completely independent methods at the domain walls.",
            "It may look now disappointing, but this also tells you that the domain will.",
            "Conductivity is basically same as bulk and activities speed type, electrical coping as it was explained for bulk conductivity.",
            "Now probably it is higher just because just because we have concentration of electron holes there at the domain walls, concentration is higher because you have more charge carries that can carry this electrical current.",
            "Basically this model also tells another interesting point is that you can decrease the conductivity by annealing.",
            "Here sample in a lower partial pressure of oxygen.",
            "This was shown in some other studies.",
            "You can basically decrease it by entering this ionic regime by kneeling in nitrogen and you can regain it back by going in oxygen.",
            "That's bit I behavior.",
            "So this is shown and it was proven experimentally for.",
            "By the conductivity biafo.",
            "So to confirm our P type conductivity at the domino wall, we did practically same thing just now."
        ],
        [
            "So that's the difference is we were looking at the local conductivity not at the bulk conductivity.",
            "Also our samples in bulk conductivity were consistent with the P type behavior.",
            "So here is here at the results.",
            "We work with, work with their conductive AFM.",
            "So this is a renewal sample.",
            "We were able to see this conductive features Adobe Walls as I showed before.",
            "Then we're need sample in nitrogen.",
            "This conductivity practically disappeared only 3% of domain walls were conducted.",
            "We made some statistical analysis.",
            "You know you work with ceramics.",
            "In it, some statistics and then bye.",
            "In this same sample, that was an empty nitrogen and oxygen.",
            "You regain the conductivity and this is consistent with the Pitti behavior and with the bulk conductivity of PFO, and of course with the defects that we that we found that the domain was basically what's happening by going nitrogen.",
            "You reduce item 4 + 30 plus states.",
            "You probably get oxygen vacancies, there are less mobile.",
            "Of course then electron holes in that should decrease basically the conductivity.",
            "There are some features which we don't still understand in detail, but basically overall that are consistent with basically.",
            "I would what are your thoughts and I would hold."
        ],
        [
            "OK, so here is the conclusion we show this in case electrical conductivity that happens also in polycrystalline business right samples?",
            "It's important because it affects by selected properties, even if this conductivity is not suspected to percolate the whole sample.",
            "And we found this defect and together with this annealing studies they are consistent with the type behavior, just like the battle conductivity, an overall results basically tells you that we should control the type and consideration of this defect not only for bulk conductivities.",
            "It's usually done, but also for this local connectivity.",
            "And perhaps this explain.",
            "Some inconsistencies with literature strongly processing related.",
            "Also this local conductivity.",
            "OK, I will finish here and ask Gordon."
        ],
        [
            "Now let's go to the Mikroskopie side to this story.",
            "Definitely all the results were obtained in CS corrected scanning transmission electron microscope.",
            "Its atomic resolution on the resolution, even the subatomic range.",
            "So below 0.88 on some enables many different techniques will not go into detail, it was.",
            "It starts to work really properly.",
            "2014 it was installed one year before and from the National Institute Chemistry Center of Excellence, Low Carbon Technologies and last year or the end of 2015 years, Astaphan Institute joined the club with 20% of the.",
            "Worth of this machine."
        ],
        [
            "Let me just remind you how this microscope works.",
            "So extremely small.",
            "Sub angstrom.",
            "Focused electron beam.",
            "Scan over the properly oriented crystal.",
            "And during this.",
            "Pass through the sample.",
            "They are different.",
            "Process is, but what are we trying to do to get here?",
            "Is the to get the signal?",
            "On some different types of detector, we called it annual darkfield detector and few or some of the electrons.",
            "We are performing spectroscopy which is called electron energy loss spectroscopy where we get the information about the valence state, type of atoms and so on depending on the angle where we are getting our signal, we may get position of light elements.",
            "We may get some strain.",
            "Also called the contrast imaging, where that Z means the atomic number and the intensity of such image is proportional to of course thickness and the Z / 1.7 or something around there.",
            "In the so called annual brightfield where we are getting just the position of light elements.",
            "This ratio is, so I mean this.",
            "Density regarding the ZT value 0.3, which is practically it's very difficult to obtain any."
        ],
        [
            "Useful information, so this is the.",
            "Wait, how we get images and then we get nice images.",
            "Nice images where we can see directly the defects, structured position of atoms, individual atoms and so on, but."
        ],
        [
            "The important thing here is to get some quantitative information from our image from our results.",
            "And here is nice again after hours of centering contuning the microscope, nice image of bismuth ferrite again bismuth irens.",
            "But what we can do from here is we can measure the distances from those atomic columns.",
            "We can measure the balance state of, for instance.",
            "I run in this case.",
            "And from the intensity of individual columns we may get some chemical information.",
            "OK, let's start."
        ],
        [
            "There are lots of different software, so called citation, where mostly in.",
            "Some Mathematica or or similar languages they're merging practically every year, and you and you.",
            "But the problem with such software is that you never know what they what they really try to do.",
            "So what we decide is to use image which is open Code Java based.",
            "Software where there are a lot of already lot of small programs written and we use this one and Q stem from Christoph Core for the calculation or simulation of the."
        ],
        [
            "Ages.",
            "1st.",
            "This image has a resolution around 4 to 8 pico meters per pixel.",
            "Depends on the magnification.",
            "Depends on the size of the image and it's in 32 bits.",
            "So four byte image, lot of information we can get from the from this image.",
            "This is the model bismuth ferrite.",
            "So we have easements.",
            "We see the irony and deliberately the oxygens are very small.",
            "Why because they do not contribute to the intensity and contribute very very small in small amounts.",
            "Making the line profile across this one, we may get the distance we may get the intensity.",
            "But this intensity is somehow summation of detector background image background and this AC component or how should I say that means with brightness?",
            "We're moving this up and down and with contrast we're just enlarging this part of the so we can do on this image whatever we want and we want to quantify it.",
            "We have to work really really very carefully and help to know what to do."
        ],
        [
            "Work OK. First the position how we approach to the position.",
            "The problem with the images that is relatively noisy, so the best or the first local Maxima approach where you just find where is the maximum of your is not good because it might like here.",
            "The maximum pixel was somewhere around here and we know that's not the center of our column.",
            "The next thing would be the center of gravity.",
            "Center of Mass is much better than this one, but the best way best results that we got both 2D Gaussian approximation.",
            "So we approximate this column image that is 2 Gaussian and we find where is the peak or where is the maximum with this Gaussian.",
            "Of course we tested, we tested the system and we found."
        ],
        [
            "In Vismod Sublattices, so there should be those distances should be very very precise and fixed, and we test all three methods and we found really that the Gaussian approximation was the best fit in all the cases, so we decide to use this approach."
        ],
        [
            "Watch do the Gaussian.",
            "Now we have the center of columns.",
            "What we can do?",
            "We can easily calculate whatever we want.",
            "Distances for columns displacement what we did in here in bismuth ferrite.",
            "We measure the displacement from the some ideal center to its original or real real position.",
            "We can measure also determine alatis is just vertical divided with horizontal and.",
            "Angle and so on."
        ],
        [
            "Again, we test it.",
            "We tested the method with the.",
            "Cubic structure titanate, where the titanium shifts should be 0, so these are strong theorems, and these are titanium's.",
            "We measured.",
            "The shifts should be zero.",
            "What we found is that there is somewhere between zero and 10 P committers, so the accuracy of our method of method.",
            "How to determine this one?",
            "It's around 10 P committers.",
            "OK."
        ],
        [
            "Using this approach to the bismuth ferrite, we found that the shifts are in the range of 13 up to 80.",
            "Be committed, so we are far away from the from the experimental error.",
            "What we found that plotting beside Katial shifts we can determine the type of the domain wall.",
            "Angle this domain is charged non charged and so on.",
            "So this was the this."
        ],
        [
            "The first part practically all centers, so all users of such microscope are using similar similar approaches.",
            "What we had to do is just to confirm that on our microscope everything is OK, so it's quite stable so that we can trust our our results.",
            "Good point about the stem microscope is that using slightly different angle so called low angle and or dark field.",
            "We can directly image the strain around the domain wall.",
            "Previously I showed you the post processing, so we cannot directly determine on the image.",
            "We cannot directly determine the position of the domain wall using.",
            "This trains on those trains are due to the crystallographic shear you see.",
            "This is the domain wall, some around here, and those atoms are shared moot, shifted for half, and have an angstrom or something.",
            "Something like that.",
            "OK, so now we can determine online or real time.",
            "The presence of the main wall and make things next things was."
        ],
        [
            "To go into details using.",
            "Electron energy loss spectroscopy.",
            "To find out what is the concentration, what would be the valence state of the iron and so on so?",
            "If we just quickly compared.",
            "Spectrum from domain wall and above or below domain wall and again.",
            "The collection time here was around half a minute or sometimes even more, and the system was really quite stable, but we can compensate manually so we can follow the there.",
            "Any small movements of the sample?",
            "We tried to calculate the ratio of those two lines here, which is normally used to determine the valence state of the."
        ],
        [
            "Aaron.",
            "But what happened here is that we did not got, did not get any any useful results.",
            "It was completely without any logic was.",
            "So this so called white line ratio was not useful.",
            "Why?",
            "Because it works 402 and 3 + 4.",
            "Four plus does not work.",
            "This is the problem with spin spins in 3D five.",
            "Orbital.",
            "This is the paper published in 2012, so that Varia Myrum, varying ferrites which is not completely, is the Hue metric, was out of this range.",
            "They find they found out that the starting edge of oxygen.",
            "An starting edge of Byron is moving also regarding so we have here 2 + 3 + 4 plus and we can see that the edge honor or onset of the oxygen.",
            "This is this one move substantially to the lower energy site.",
            "And we're happy that this is our luck, because in that case we were really able to determine in the matrix of Iron 3 plus we were able to determine the Iron 4 plus just one atomic layer.",
            "If this was not the case, then overlapping of the peaks would happen and we could not.",
            "We would not be able to distinguish between 3 plus and four plus so.",
            "4 Plus metrics to determine the three.",
            "Plus I run.",
            "It's impossible vice versa.",
            "It's I'm saying that we were lucky to do so that distance.",
            "What we measure was the distance between starting or edge on the.",
            "Onset of the oxygen to the Byron L 3 and we can see that the higher valence states close to 4.",
            "This distance is much much."
        ],
        [
            "I also this was the method how we determine the valence state.",
            "Luckily we also using the so precise microscope so that we could get the atomic image we found in sample.",
            "This is extremely difficult to prepare barium ferrite, which is indeed mixed valence.",
            "So it's I run three plus or 4 plus exactly 1 structure.",
            "We found areas with cubic structure where is possible just if all.",
            "Byron is in four plus, so we use this one as."
        ],
        [
            "Iron Force plus under your under standards, which are more conventional and really we got the nice practical linear function of the oxidation state and this difference in energy and on domain mall yesterday said we found the presence of iron are in 4 plus."
        ],
        [
            "OK, what we did this is not chronologically this we did after one reviewer trying to persuade us that our measurements are not good.",
            "If we perform perform the eels.",
            "Analysis also on Bismuth, which has very very high energy.",
            "About 2600 electron volts in the spectrum.",
            "We did definitely observe some decrease in the signal at the domain wall.",
            "So there is definitely also with eels.",
            "We can determine that there is a law."
        ],
        [
            "Over concentration of bismuth, but with yields we cannot determine exact chemical composition, and we can either not determine the exact position of this lowering.",
            "Maybe it's coming from 1, two or three three layers of atoms.",
            "So how we approach?",
            "We try to use the column intensity as a way how to determine the chemical composition so from the.",
            "Image of the high angle annular darkfield.",
            "Again, using image A, we did some kind of mask and using this mask and we can.",
            "We can easily define this mask so the size and shape and so on and using this mask we integrate all the pixel inside inside such a column we used.",
            "We somehow decided to use plus minus one Sigma again as a 2D2 D Gaussian shape.",
            "Of the of the column whynott bigger becausw.",
            "Here.",
            "In this position there oxygens and may interfere our measurement."
        ],
        [
            "OK, now we have the.",
            "Intensity, but the problem is how to quantify those intensities and there is one approach.",
            "Labonge tamer from 2008.",
            "They use the signal of detector itself.",
            "They found out from the background of this image this if you remember, I showed you this profile already, so we have to we have to find this detector background and this image background is due to the thickness of the sample.",
            "And what we did using this simple equation so that normalized intensity is somehow signal.",
            "So all the pixels here are subjected with background and divide it with average signal detector of course again, with the background subtracted.",
            "What we get?",
            "What is this normalized signal?",
            "This normalized signal is there is just the ratio or the part of the total scattering in our sample.",
            "But what we introduce is still one additional normalization.",
            "We normalized all the intensity on the Bismuth columns with so called maximum intensity.",
            "Why?",
            "Because this maximum intensity should be pure bismuth columns.",
            "And measured intensity is the column which has some.",
            "Basement vacancies inside.",
            "And using this approach."
        ],
        [
            "We really found that exactly a domain wall.",
            "There is some lowering of bismuth, which confirms also the results from the from the Eels, but this 20% of reduction.",
            "What does it mean in the sense?"
        ],
        [
            "Of the chemical composition of this column.",
            "We perform the simulation with 9 by 9 by 9 units cell and the thickness is up to 8080 nanometers with different different.",
            "Composition or different amount of bismuth vacancies in this basement columns.",
            "The use of course the TDs so that thermal diffuse scattering and one of such run such.",
            "Calculation or simulation takes about 3 days 2 to one week."
        ],
        [
            "And at the end we found if we plot the bismuth concentration bismuth vacancy, concentration basement intensity ratio for different thickness.",
            "We find our found out that 20% of the reduction it must be around 30% of vacancies.",
            "Consent."
        ],
        [
            "And this is quite good with our model.",
            "One bismuth vacancy somehow corresponds to three Iran 4 plus and in ideal case.",
            "If I have the.",
            "On domain wall in just one one atomic layer complete or iron on 4 plus we need 30% of bismuth vacancies so.",
            "We are not claiming that this is the exact values, but we are in the same logical order of magnitude.",
            "OK, definitely this is the last one before last slide, of course we have a lot of discussion with referees.",
            "And reviewers at the first.",
            "They did not believe us anything.",
            "And then on the second child they did some they say OK, this is OK, but definitely the last one was this one.",
            "The problem was that this method should work for perfect crystal and you too large train.",
            "Should contribute to the local image contrast.",
            "Of course we did thorough search in the literature.",
            "There were some papers starting from 80s and so on, but in all cases the strain influenced positively to the signal, so we should get more signal there, not less.",
            "And the final somehow."
        ],
        [
            "Proof that then we are really sure that what we are measuring is the bismuth vacancies is the case that they showed us before, so the sample of bismuth ferrite fired in nitrogen.",
            "Do not show this.",
            "This material is very low electrical conductivity.",
            "The domain walls are not conductive, so we.",
            "Somehow expect that there is no bismuth vacancies and no Iron 4 plus, which we definitely confirm with those previously described methods.",
            "But still in this.",
            "In that case, the sheer crystallographic shear is present.",
            "So we have strained.",
            "But we do not have a signal.",
            "So and this finally finally somehow persuaded last reviewer."
        ],
        [
            "Instead of conclusion which were already given by today, maybe future work what we're planning to do, so we try to apply this method to other system.",
            "There are many, many system, many defects.",
            "Many planner defects where this methodology could be applied and of course the main thing that is today.",
            "The challenge is how to quantify the oxygen vacancies.",
            "The problem is we can see oxygens look.",
            "This is the one case of parasite in 110 zone axis and this in between out positions of oxygen.",
            "But those positions can be can be obtained with annual bright fields.",
            "And the intensity is related to 0 or 0.3.",
            "So small changes in the composition.",
            "No way to be to be measured so.",
            "We have some other ideas how to how to approach to this system, but maybe on next time.",
            "Don't thank you very much.",
            "Thank you for a very nice talk, so bismuth varieties Romo Hedral isn't so so if you grow it in one one One Direction if it actually, you might remove some of these domains.",
            "Does it affect macroscopically in terms of improved electrical conductivity?",
            "I'm not sure what you mean exactly, so if you have if you grow up it actually 11 films.",
            "Yes, you can basically amounted makes you can get the model domain status, which you will not don't have domain walls, so it's question.",
            "But yeah, I mean does it work?",
            "I mean in terms of conductivity, so the macroscopical conductivity is decreased for.",
            "For one 11 oriented protection layers I don't know.",
            "Basically if these defects are there.",
            "Let's say that you have them, we don't know, but that's the point.",
            "Then you can switch it totally and effect should be still there.",
            "So I assume that there will be still connectivity.",
            "If you did this, that's what you mean.",
            "We can discuss maybe.",
            "I have one.",
            "Activity from.",
            "Within the measurement in fields we work with ceramics.",
            "I think because of the sample it was roughly 0.2 zero point, 3 millimeters, so we get something like.",
            "It's because the actor be below now electrode above and basically they are affecting works is an upper electrode.",
            "We have electric below and the other is the tip.",
            "Yes, yes, the thickness is such that we get because we work with this coarse grain samples.",
            "So I think we should catch something like 3040 grains in thickness.",
            "Did you see any movement of the men was during TM microscopy because of radiation of.",
            "It comes with a point.",
            "No, not indeed.",
            "But why, why so, so?",
            "We definitely use very gentle conditions.",
            "Because we are afraid.",
            "So this is just what we showed you just a part of the complete experiments that were done so among other experiments we did the stability of the bismuth ferrite, so we used 2 minutes, 5 minutes, 10 minutes, 20 minutes of beam and then check the intensity distribution so that.",
            "You're really afraid not to publish something which will be torn apart with some stupid artifacts, artifacts or something like that.",
            "And among that, the stability of the domain wall.",
            "It's really.",
            "Relatively high.",
            "We tried to move it later on just to to see if the Iron 4 plus or bismuth vacancies will follow those.",
            "But no inside the microscope in C2 we did not observe this one.",
            "Thickness dependent.",
            "No, the problem is that we could not really construct the diagram thickness and the.",
            "You know we were somehow using the optimal thickness for the determining eels.",
            "That mean means we were in the range of 30 to 60 nanometers.",
            "But within this range we did not see any dependence of the of the thickness.",
            "But the thing we can what we did as you saw, is the simulation showed.",
            "Somehow the thickness depends so different thickness is have slightly different.",
            "Diagram and let go.",
            "You explained the presence of Iron 4 plus because of the bismuth vacancies.",
            "What is the reason for formation of bismuth?",
            "References here at the domain wall.",
            "I think there are two ways.",
            "One is lots of bismuth oxide.",
            "You know this is the volatile component before we lose it.",
            "Create base with an oxygen vacancies.",
            "The second is reaction.",
            "Chemical reaction is not completed.",
            "All the scalar setting small amounts of secondary phases so you can create some stuff is subsequently because of that while they're at the domino wall.",
            "This is actually related to this driving force that it's created because of some specific states at the domino wall you have.",
            "Basically what it was shown by theory is that you have this nail component.",
            "Of polarization of the dominant meaning that, for example, 180 will not switch from one side to the other just by changing the magnitude polarization, but it will flip around rotate.",
            "This will create some polarization which is particular to the domino wall, and that means electric fields, depolarizing fields and so on.",
            "And the taxes are driving force for defect effects will start to move immediately when you go below the TC because below to see domain walls will form and this is the point where the defects will start segregated domain well.",
            "This is how aging is explained in for electrics.",
            "The point in before is that Curry Point is very large, very high.",
            "It's 830, so just below the career day 20, you have plenty of thermal energy even for bismuth vacancies to move to the domain walls, so I'm not expecting, for example, let vacancies in PC at the domain walls because you know Kitty temperature is 350.",
            "I'm not expecting diffusion of light vacancies but below 350.",
            "With this specialty, I think of beautiful it might be.",
            "More questions.",
            "I have a very naive question, so which part of this work would have been possible without the new device at the National Institute of Chemistry?",
            "The new microscope?",
            "Amy."
        ],
        [
            "This is this one.",
            "Question all the time.",
            "What was the contribution?",
            "Allegion idea machine.",
            "The answer to this is this.",
            "So I think all of those parameters here should be one.",
            "Definitely.",
            "Instrumental.",
            "Element.",
            "Just be the last part.",
            "If there's no more questions, then let's thank the speakers again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Today's stock will be given by professors today, right Sangrand Rogic, who survives, got his BS in chemical engineering and his PhD in chemical engineering from the University of Ljubljana.",
                    "label": 0
                },
                {
                    "sent": "He has been employed at the Your Steven Institute since 2000 and in 2009 he was April doctoral associate at the Swiss Federal Institute of Technology in Lausanne.",
                    "label": 0
                },
                {
                    "sent": "Since 2013 he is assistant professor at the gorgeous Definidor Gradual Integration, International Postgraduate School.",
                    "label": 0
                },
                {
                    "sent": "The main research topics of his work car mechanic.",
                    "label": 0
                },
                {
                    "sent": "Chemical reaction mechanisms.",
                    "label": 0
                },
                {
                    "sent": "Application of mechanochemical processing and synthesis of complex ceramic oxides and processing structure properties.",
                    "label": 0
                },
                {
                    "sent": "Relations in lead based and let free ceramics and thick films.",
                    "label": 0
                },
                {
                    "sent": "The author of 74 papers for review papers for chapters and in monographs in one patient.",
                    "label": 0
                },
                {
                    "sent": "Professor Goran Dragic got his BS MSN, PhD in chemistry from the University of Ljubljana.",
                    "label": 0
                },
                {
                    "sent": "He was employed at the Your Steven Institute since 2000 since 1980.",
                    "label": 0
                },
                {
                    "sent": "First, as appears student then in various other statuses, eventually as a senior scientist since 2006.",
                    "label": 0
                },
                {
                    "sent": "He is assistant professor in the field of Nano Science and microscopy.",
                    "label": 0
                },
                {
                    "sent": "Your Steven International postgraduate school.",
                    "label": 0
                },
                {
                    "sent": "In 2012, he moved to the National Institute of Chemistry as ahead of the Electron Microscopy Group at in the Department for Materials Chemistry.",
                    "label": 0
                },
                {
                    "sent": "The main research topics of Professor Drudge Work, our development and characterization of materials with special properties, development and implementation of electron microscopy, and Micron olitical techniques for study of modern nanomaterials.",
                    "label": 0
                },
                {
                    "sent": "Then investigation of nucleation and crystallization of catalytic nanoparticles and so on.",
                    "label": 0
                },
                {
                    "sent": "His Co.",
                    "label": 0
                },
                {
                    "sent": "Author of around 200 papers and around 80 proceedings papers, 10 book chapters and one patent.",
                    "label": 0
                },
                {
                    "sent": "An for his work he was awarded the Toy Certificate of Recognition and Year.",
                    "label": 0
                },
                {
                    "sent": "2000 today's stock is dedicated to their recent work, which was done exclusively in Ljubljana and was recently published in the Nature Materials.",
                    "label": 0
                },
                {
                    "sent": "So let's.",
                    "label": 0
                },
                {
                    "sent": "Here's the talk and the first part of the talk will be given by police reports and then pursued.",
                    "label": 0
                },
                {
                    "sent": "Raj will take over.",
                    "label": 0
                },
                {
                    "sent": "OK, thanks a lot for the nice introduction.",
                    "label": 0
                },
                {
                    "sent": "First of all, thanks to all of you for coming.",
                    "label": 0
                },
                {
                    "sent": "We were not expecting so many, so I'm very glad that you're here.",
                    "label": 0
                },
                {
                    "sent": "Well hopefully will not get asleep.",
                    "label": 0
                },
                {
                    "sent": "Will try to do our best with Gordon to make things interesting.",
                    "label": 0
                },
                {
                    "sent": "This is basically a work that was done in the last maybe 2 three years with more than that I'll show some results even older than this.",
                    "label": 0
                },
                {
                    "sent": "It has to do with this domino conduction business.",
                    "label": 0
                },
                {
                    "sent": "Right, this is the work that was done in collaboration with between our Institute and Chemical Institute, National Institute of Chemistry, Hiragana.",
                    "label": 1
                },
                {
                    "sent": "She's walking diversity and Swiss Federal Institute of Technology design.",
                    "label": 0
                },
                {
                    "sent": "So I was told by pretty much before this lecture that I have to bring it.",
                    "label": 0
                },
                {
                    "sent": "Have to give some sort of general introduction to the field.",
                    "label": 0
                },
                {
                    "sent": "So the idea is to start with some basic definitions so you can see what the fair electric materials, how they're used, what is electricity, and so on.",
                    "label": 0
                },
                {
                    "sent": "I apologize to probably most of you which know very well what.",
                    "label": 0
                },
                {
                    "sent": "What this topic is and then I will try to scale up until this specific problem of Domino Wall introduction.",
                    "label": 0
                },
                {
                    "sent": "Before I will try to show you why.",
                    "label": 0
                },
                {
                    "sent": "What is Domino Wall and why it's important in our field so.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's start first with the materials, so the materials that we work with are called ferroelectrics.",
                    "label": 0
                },
                {
                    "sent": "These are basically a subgroup of dielectric materials.",
                    "label": 0
                },
                {
                    "sent": "More precisely, pyroelectric materials.",
                    "label": 0
                },
                {
                    "sent": "They have this sort of particularity that they exhibit similarity in the structure.",
                    "label": 0
                },
                {
                    "sent": "So the best way to represent this by through a Periscope structure.",
                    "label": 0
                },
                {
                    "sent": "This is also one of the most important structures from application pool interview, so some temperature we have this CU Parul Skype, for example inviting tighten it and then when you call it below to see.",
                    "label": 0
                },
                {
                    "sent": "Political develops 1 axis will allocate the direction.",
                    "label": 0
                },
                {
                    "sent": "This is what we call spontaneous train and along the same direction.",
                    "label": 0
                },
                {
                    "sent": "These ions in the structure such that basically their displays.",
                    "label": 0
                },
                {
                    "sent": "So the data center do not coincide and this makes the material product.",
                    "label": 0
                },
                {
                    "sent": "It's called spontaneous polarization, which is collinear with spontaneous train.",
                    "label": 0
                },
                {
                    "sent": "Now Farrell actress has this additional ability that you can switch this spontaneous polarization reversibly.",
                    "label": 0
                },
                {
                    "sent": "Appliance sufficiently high electric field so you can, for example by feel like this you will switch the polarization app.",
                    "label": 0
                },
                {
                    "sent": "You switch off the filter.",
                    "label": 0
                },
                {
                    "sent": "Polarization will still up and you can do the same way, for example by by switching down.",
                    "label": 0
                },
                {
                    "sent": "This is the origin of the very well known hysteresis for electric.",
                    "label": 0
                },
                {
                    "sent": "Hysteresis loop basically tells you that you have some polarization that can be switched permanently under applied electric field.",
                    "label": 1
                },
                {
                    "sent": "This is very often what we measure to prove also Felicity material.",
                    "label": 0
                },
                {
                    "sent": "Beyond other things.",
                    "label": 0
                },
                {
                    "sent": "This material is also another property which is called by electricity, and in particular ferroelectrics are very good by the electrics.",
                    "label": 0
                },
                {
                    "sent": "Do some specific structure that they contain.",
                    "label": 0
                },
                {
                    "sent": "I will show this later.",
                    "label": 0
                },
                {
                    "sent": "It's late basically with Roman walls is one of their origins of hype.",
                    "label": 0
                },
                {
                    "sent": "Is electricity puzzle activity is just linear phenomenon.",
                    "label": 0
                },
                {
                    "sent": "Basically Electro mechanical Effect, meaning that when you press your material you will generate some surface charges or electrical current or voltage depending how you design your circuit and vice versa.",
                    "label": 0
                },
                {
                    "sent": "When you buy electric field you have a change of shape in your material.",
                    "label": 0
                },
                {
                    "sent": "So This is why these materials are vastly used in sensor actuators and ultrasound transducers.",
                    "label": 0
                },
                {
                    "sent": "There many such application with this material use.",
                    "label": 0
                },
                {
                    "sent": "Sensors, for example by electrical using sensors accelerometers so they can.",
                    "label": 0
                },
                {
                    "sent": "They can detect dynamic forces.",
                    "label": 0
                },
                {
                    "sent": "This is how, for example some airbags work.",
                    "label": 0
                },
                {
                    "sent": "So basically have a pie selected that it takes the force when the car crashes and this gives a very fast signal electrical signal that activates their back is 1 example.",
                    "label": 0
                },
                {
                    "sent": "Of course our backs also work in other ways, not just by the electric one.",
                    "label": 0
                },
                {
                    "sent": "Then you have for example this nice example.",
                    "label": 0
                },
                {
                    "sent": "Perhaps you thought sometimes why this screening smartphones flip around you have.",
                    "label": 0
                },
                {
                    "sent": "Basically applies electric material inside which is called an angle or angular accelerometer.",
                    "label": 0
                },
                {
                    "sent": "When you do like this, you change the angular velocity.",
                    "label": 0
                },
                {
                    "sent": "Basically this force will be filled by the pies electric and it will give us some signal that will flip the screen around for 90 degrees and then you have for example the converse effect, which can be used when you want to have some strange.",
                    "label": 0
                },
                {
                    "sent": "This is an example of inject printing by electric.",
                    "label": 0
                },
                {
                    "sent": "Once we have a pie, Selectric material typically deposit on the substrate you applied field change shape.",
                    "label": 0
                },
                {
                    "sent": "This will deform the diafragma man it will jet basically or.",
                    "label": 0
                },
                {
                    "sent": "In Kona paper, so you have this by electrics everywhere.",
                    "label": 0
                },
                {
                    "sent": "Basically at home in your car, at an office, and so on, so that vastly using these applications there's another property, this ferroelectrics, which is very important.",
                    "label": 0
                },
                {
                    "sent": "This is the main topic of this talk today, in that they form domains and domain walls.",
                    "label": 1
                },
                {
                    "sent": "Imagine here this dragon structure, which develops from the CU one, so the polarization is spontaneous.",
                    "label": 0
                },
                {
                    "sent": "Polarization can basically can be oriented, can happen in different directions.",
                    "label": 0
                },
                {
                    "sent": "In this specific case.",
                    "label": 0
                },
                {
                    "sent": "For tetragonal structure you have six possibilities.",
                    "label": 0
                },
                {
                    "sent": "You know, up, down, left, right in plane and out of plane and in first approximation we assume that this six directions are equivalent.",
                    "label": 0
                },
                {
                    "sent": "So when you cool down, all six are possible and it will be formed.",
                    "label": 0
                },
                {
                    "sent": "That's why, for electrics from domains, domains are basically region inside your grains in a ceramic when the spontaneous polarization homogeneous looks in One Direction and then in the same grain you will have just adjacent another domain looking in some other direction within these six permitted directions in the dragon phase, and the boundary between.",
                    "label": 0
                },
                {
                    "sent": "This polarization states are called called domain walls or domain boundaries, and this is the main topic of the talk today.",
                    "label": 0
                },
                {
                    "sent": "I'll talk about this Domino's here.",
                    "label": 1
                },
                {
                    "sent": "That's an example of 180 degrees domains or domain wall because it separates into two domains with antiparallel orientation of spontaneous polarization.",
                    "label": 0
                },
                {
                    "sent": "There are other versions you can have also 90 degrees.",
                    "label": 0
                },
                {
                    "sent": "For example if you are.",
                    "label": 0
                },
                {
                    "sent": "If you have, for example, possession in one domain that develops up in the other left.",
                    "label": 0
                },
                {
                    "sent": "For example, you have a 90 degree.",
                    "label": 0
                },
                {
                    "sent": "So why?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is why we make big deal with this domain.",
                    "label": 0
                },
                {
                    "sent": "Walls is simply because they strongly affect the properties of paraelectric.",
                    "label": 0
                },
                {
                    "sent": "Actually many application uses for electrics because you can design material through domain wall to domain walls basically.",
                    "label": 1
                },
                {
                    "sent": "So the clue here is that this domain words are not static at all under external field.",
                    "label": 0
                },
                {
                    "sent": "So if you have an electrical stress field they will move.",
                    "label": 0
                },
                {
                    "sent": "They will oscillate, displays band their theories that explain this.",
                    "label": 0
                },
                {
                    "sent": "Schematic just to show you how this work.",
                    "label": 0
                },
                {
                    "sent": "Imagine you have 108 here degree domain.",
                    "label": 0
                },
                {
                    "sent": "While you basically apply field like up this, this domains with polarization looking down will not be happy if you make if you apply filled up so they would like to switch up, meaning that the domain wall will move to the right.",
                    "label": 0
                },
                {
                    "sent": "The domains do not move the domain wall moves.",
                    "label": 0
                },
                {
                    "sent": "Basically what happens is this volume fraction of domains looking up will increase at the expense of those looking down, which means that the domain model must move in some way.",
                    "label": 0
                },
                {
                    "sent": "Single happen if I apply it fell down it will move in the other direction.",
                    "label": 0
                },
                {
                    "sent": "Now imagine that animal oscillating electric field you know up down certain frequency is nominal constellate make some samosa motions and this is very fast.",
                    "label": 0
                },
                {
                    "sent": "For example we know that this dominant motion can happen can follow electric field self up to GHz frequencies, serialization PC data related to the visible downward motion.",
                    "label": 0
                },
                {
                    "sent": "So it's pretty fast.",
                    "label": 0
                },
                {
                    "sent": "You have here a variant of 180 degree domain.",
                    "label": 0
                },
                {
                    "sent": "Well this is important.",
                    "label": 0
                },
                {
                    "sent": "We usually differentiate between hundred 18180.",
                    "label": 0
                },
                {
                    "sent": "The difference here is that with this 180 motion you will also flip the spontaneous train, meaning then when applied field, when the domain will move, you have also basically a change of shape, your grain, your material.",
                    "label": 0
                },
                {
                    "sent": "That's why this this motion even under very weak fields well below the macroscopic coercive field for this switching can have a very crucial influence on the piezoelectric properties over electrics.",
                    "label": 0
                },
                {
                    "sent": "In some materials.",
                    "label": 0
                },
                {
                    "sent": "This contribution here it's up to 70% of the total price electric response.",
                    "label": 1
                },
                {
                    "sent": "It's not small, it's even more than half.",
                    "label": 0
                },
                {
                    "sent": "Of the electric coefficients in a response from her electrics comes from this mechanism here, so we use this.",
                    "label": 0
                },
                {
                    "sent": "People use this concept to design materials and to have large buys electric efficient.",
                    "label": 0
                },
                {
                    "sent": "However, this is not for free as usually it goes to an expense of having your price electric response, which is very dependent upon the external value variables.",
                    "label": 0
                },
                {
                    "sent": "For example, the function of it becomes basically strongly.",
                    "label": 0
                },
                {
                    "sent": "Strongly affected by the electric field amplitudes and frequency and you have this large hysteresis.",
                    "label": 0
                },
                {
                    "sent": "The best way to represent this and to explain to you why this is important, is design of Domino Wall.",
                    "label": 0
                },
                {
                    "sent": "Displacement is by using the concept of hardening and softening capacity.",
                    "label": 0
                },
                {
                    "sent": "This logically most important way of how how to basically control by electric properties in fair electrics.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately it works well for PC but not so well for many other materials.",
                    "label": 0
                },
                {
                    "sent": "Basically what we do is without our PC this let's circle.",
                    "label": 0
                },
                {
                    "sent": "Tonight is the most used ferroelectric materials in piezoelectric applications.",
                    "label": 0
                },
                {
                    "sent": "So you dope with Donald Open, for example, newbie Mona Iron, Titanium, titanium, strontium side.",
                    "label": 0
                },
                {
                    "sent": "It's a downward opened.",
                    "label": 0
                },
                {
                    "sent": "You will create by very small amount.",
                    "label": 1
                },
                {
                    "sent": "You will create such defects that will in case this domain wall motion.",
                    "label": 0
                },
                {
                    "sent": "So get large pies electric coefficient but you get high studies in the response and strong dependency of despise electric coefficients.",
                    "label": 0
                },
                {
                    "sent": "A function of field, basically frequency and temperature in some application this instabilities are not so important.",
                    "label": 0
                },
                {
                    "sent": "When ice example is this fuel injection system that you have in the car is basically we have a multilayer actuator of positive soft Pvt which wich applying filled with the forms and jet your fuel in the combustion engine.",
                    "label": 0
                },
                {
                    "sent": "Basically here we just need high stroke.",
                    "label": 0
                },
                {
                    "sent": "We don't care much about this instabilities and this is where you can use office for example.",
                    "label": 0
                },
                {
                    "sent": "Then you have other applications in which buys electric.",
                    "label": 0
                },
                {
                    "sent": "Ferroelectrics are used.",
                    "label": 1
                },
                {
                    "sent": "A nice example of this.",
                    "label": 0
                },
                {
                    "sent": "Atomic Force microscopy tube scanner is basically a tube made of ice electric.",
                    "label": 0
                },
                {
                    "sent": "Spoiler radially and by applying field you can move move it bandit extended like this very precisely.",
                    "label": 0
                },
                {
                    "sent": "The precision of this is sub nanometer.",
                    "label": 0
                },
                {
                    "sent": "Solve around hundreds Tampico meters.",
                    "label": 1
                },
                {
                    "sent": "You can imagine that for pies electric should be much more stable in its response for such applications should be linear pretty independent upon external variables because you need precision actuation for that feels hard pizzetti we basically dope it will accept or create some defects, mainly oxygen vacancies and this oxygen vacancies.",
                    "label": 0
                },
                {
                    "sent": "Axes spinning sites for the domain wall.",
                    "label": 0
                },
                {
                    "sent": "So we somehow this doping block.",
                    "label": 0
                },
                {
                    "sent": "What minimize you can ever block completely, but you can minimize this sort of domino wall displacements so that you have a lower price electric coefficient.",
                    "label": 0
                },
                {
                    "sent": "But you can use it for precision activation so you can see now that basically.",
                    "label": 0
                },
                {
                    "sent": "Basically I think you should see now why these numbers are important.",
                    "label": 0
                },
                {
                    "sent": "It represents one of the ways of how to control pies, electric properties in fair electrics, and by doing this control here you can have same nominally same material specity used in mass production devices such as cars or very very specialized product like.",
                    "label": 0
                },
                {
                    "sent": "Scanner this is the reason why this domain walls are over study.",
                    "label": 0
                },
                {
                    "sent": "It's quite extended constantly in the large last, even 4050 years.",
                    "label": 0
                },
                {
                    "sent": "It has to do with applicative science.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Basically so.",
                    "label": 0
                },
                {
                    "sent": "For the same reason, you can also understand why this this paper published by saddling coworkers in 2009 came a bit of a surprise to the community in a sense that they discovered.",
                    "label": 0
                },
                {
                    "sent": "I will not say well, you can say discovered these things were discussed in 70s, but basically they were first to show experimentally prove that the domain wall itself can have different properties.",
                    "label": 0
                },
                {
                    "sent": "It can have its own property.",
                    "label": 0
                },
                {
                    "sent": "If you think this is not much unexpected because you know domain wall, internal structure of domino like Tronic in atomic.",
                    "label": 1
                },
                {
                    "sent": "Should be different than the domain, so it is expected that the domain we will have different properties the domains, but they show this for the first time they actually showed.",
                    "label": 0
                },
                {
                    "sent": "The Domino's has a higher electrical conductivity then the domains itself so they can carry much large current and the domain which are attached to this domino wall.",
                    "label": 0
                },
                {
                    "sent": "So this is the paper the materials business right?",
                    "label": 0
                },
                {
                    "sent": "Which I'll talk mostly from now on.",
                    "label": 0
                },
                {
                    "sent": "It was prepared in affirmative film.",
                    "label": 0
                },
                {
                    "sent": "These are appealed films.",
                    "label": 0
                },
                {
                    "sent": "110 identity protection ones.",
                    "label": 0
                },
                {
                    "sent": "What they did.",
                    "label": 0
                },
                {
                    "sent": "Basically the first switch the film.",
                    "label": 1
                },
                {
                    "sent": "You can do it in this 110 intention to have all three types of domain walls in BF oh, which are 71 hundred 980.",
                    "label": 0
                },
                {
                    "sent": "These are the angles you know, spontaneous polarization, which I showed previously for the dragon structure.",
                    "label": 0
                },
                {
                    "sent": "This orbital is different and basically by doing that they actually use conductive AFM to detect the local currents.",
                    "label": 0
                },
                {
                    "sent": "It's imagine just classical FM microscope, but you apply a certain DC bias there, so voltage and plus 5 volts you travel it around your sample and you measure the current in each individual point during scanning.",
                    "label": 0
                },
                {
                    "sent": "This is the current image current Maps from surface of such in film and you can see that here where Domino's lie there is in case current signal.",
                    "label": 1
                },
                {
                    "sent": "This white part is basically a large current signal, much larger than in the domain itself.",
                    "label": 0
                },
                {
                    "sent": "They prove this also deciphering techniques are problematic when you work with domain walls because you can get current by switching them if you switch them you should get some displacement current.",
                    "label": 0
                },
                {
                    "sent": "We should be transitioned so they tested this by, you know monitoring the current for over 3 four minutes and the current at the domain was usually higher.",
                    "label": 0
                },
                {
                    "sent": "And the domain, and very stable.",
                    "label": 0
                },
                {
                    "sent": "So it's true electrical conductivity that is higher at the domino wall with respect to the domain later.",
                    "label": 0
                },
                {
                    "sent": "This paper was quite a breakthrough in a sense that later you know, in starting from 2009 until practically today they discovered this domain.",
                    "label": 0
                },
                {
                    "sent": "Will conductivity is not only confined to this material to this fair, electric specifically, but they prove it in many other materials.",
                    "label": 0
                },
                {
                    "sent": "PCT, which is the most important.",
                    "label": 0
                },
                {
                    "sent": "Basically lithium niobate and some improper for electric.",
                    "label": 0
                },
                {
                    "sent": "So they show that this is quite a general property of ferroelectric.",
                    "label": 0
                },
                {
                    "sent": "And at that time we had no idea how this, for example, how this domain welcomed activity can affect your.",
                    "label": 0
                },
                {
                    "sent": "For example, is electric response, so this is.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is why we started to work on that topic.",
                    "label": 0
                },
                {
                    "sent": "It was related with the project that we had from bismuth ferrite.",
                    "label": 0
                },
                {
                    "sent": "I think it was 2011 twelve.",
                    "label": 0
                },
                {
                    "sent": "The idea was to 1st see if we have this electrical conductivity in polycrystalline ceramic samples.",
                    "label": 0
                },
                {
                    "sent": "The conductivity by saddle was discovered in film, so we want to see if you have also your ceramics that is conductive at the domain walls and then try to see if this affects properties.",
                    "label": 0
                },
                {
                    "sent": "That was the most important part, otherwise it's not.",
                    "label": 0
                },
                {
                    "sent": "There's no sense to work with that, so we use a methodology just like the same similar delicious just like Indian films, PFM was used to identify to image the domains and domain walls have domain walls.",
                    "label": 0
                },
                {
                    "sent": "Here, let's face image an using conductive AFM just like, say, the link workers we basically found.",
                    "label": 0
                },
                {
                    "sent": "Also in this hour polycrystalline samples that we have this case conductivity, the Domino's is white stripes basically tells you that you have a large current larger than in the main itself.",
                    "label": 0
                },
                {
                    "sent": "Then we're using some other techniques.",
                    "label": 0
                },
                {
                    "sent": "CBS D. We also found that all three types of domain walls, so the 71 hundred, 980 or conductive Poly crystalline bismuth ferrite.",
                    "label": 0
                },
                {
                    "sent": "We also found this local domain will conductivity, which is a bit expected.",
                    "label": 0
                },
                {
                    "sent": "I would say affected by electric properties.",
                    "label": 0
                },
                {
                    "sent": "I will not go too much in detail into this.",
                    "label": 0
                },
                {
                    "sent": "It's pretty complex topic, but basically you can imagine that this conductivity couples with the domain well dynamics.",
                    "label": 0
                },
                {
                    "sent": "So the conductivity that is there a domino wall basically will.",
                    "label": 0
                },
                {
                    "sent": "Will influence how the Domino's will move under stress and electric field at sub switching conditions, meaning that the domain will start to move once you allow conductivity in the material.",
                    "label": 0
                },
                {
                    "sent": "So you need to move those charges that are responsible for the conductivity to move the domino wall and basically microscopic view from microscopic properties of a whole ceramic.",
                    "label": 0
                },
                {
                    "sent": "1 millimeter size sample.",
                    "label": 0
                },
                {
                    "sent": "What happens is that you get strong instability in the pies.",
                    "label": 0
                },
                {
                    "sent": "Electric response at conditions that maximizes conductivity.",
                    "label": 0
                },
                {
                    "sent": "So if you work with low frequencies Highfields.",
                    "label": 0
                },
                {
                    "sent": "In high temperature conductivity is maximized.",
                    "label": 0
                },
                {
                    "sent": "You will give this enhancement of by electric response.",
                    "label": 0
                },
                {
                    "sent": "For example, you can measure by electric coefficient 120 such conditions which is 3 times higher than their own temperature value, and all this is coming.",
                    "label": 0
                },
                {
                    "sent": "All this is extrinsic, it's related to this conductivity domino wall.",
                    "label": 0
                },
                {
                    "sent": "So it's important.",
                    "label": 0
                },
                {
                    "sent": "Basically this influence is quite big and it's important to understand where this domain work.",
                    "label": 0
                },
                {
                    "sent": "Conductivity comes from.",
                    "label": 0
                },
                {
                    "sent": "This was the idea so try to understand this.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now, if you look in the literature about the studies on the origins of this domain, will conductivity you will easily see that it's a very complex issue, so there are many different mechanisms that have been proposed for this domain.",
                    "label": 0
                },
                {
                    "sent": "Well, conductivity, interesting.",
                    "label": 0
                },
                {
                    "sent": "The studies were mainly theoretical, so there are no much experimental studies.",
                    "label": 0
                },
                {
                    "sent": "Some indirect that suggest some role of defects in this conductivity, but it was never identified which ones and how they work and what is the mechanism and so on.",
                    "label": 0
                },
                {
                    "sent": "Now several different materials have been studied theoretically because they found this conductivity in many other fair electrics.",
                    "label": 0
                },
                {
                    "sent": "For example, for business right there is one mechanism which I think should be valid.",
                    "label": 0
                },
                {
                    "sent": "They showed theoretically that because of some structural changes at the domino wall, basically have a reduction of the band gap at the domino wall.",
                    "label": 1
                },
                {
                    "sent": "They should increase the conductivity there.",
                    "label": 1
                },
                {
                    "sent": "But you know these same principles are not valid, for example for the city.",
                    "label": 0
                },
                {
                    "sent": "So there's there's either there is another mechanism that there should be something else more general that causes conductivity in all these sort of electrics.",
                    "label": 0
                },
                {
                    "sent": "There is one common point in all these models.",
                    "label": 0
                },
                {
                    "sent": "In that they basically predict.",
                    "label": 0
                },
                {
                    "sent": "That's because of specific polarization and strange state at the domino wall.",
                    "label": 1
                },
                {
                    "sent": "When this polarization flips around from one state to the other, there should be a tendency of defects to segregate the domino wall.",
                    "label": 1
                },
                {
                    "sent": "Basically to decrease this depolarizing fields and this train string, red and so on and just imagine they tend to go there.",
                    "label": 0
                },
                {
                    "sent": "And once they are there, basically they can give you conductivity.",
                    "label": 0
                },
                {
                    "sent": "Their mobile classic effects conductivity.",
                    "label": 0
                },
                {
                    "sent": "So we wanted to test this model to see if this is this is the case in business.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right, so here we went pretty with the direct method.",
                    "label": 0
                },
                {
                    "sent": "So we wanted basically to see these defects.",
                    "label": 0
                },
                {
                    "sent": "That's why we used scanning transmission electron microscopy with ECS corrected microscope.",
                    "label": 0
                },
                {
                    "sent": "The Chemical Institute.",
                    "label": 0
                },
                {
                    "sent": "Now I'm not going here into details because Gordon basically will present details of how this methodology was developed and all the difficulties that we got identifying these defects domain walls.",
                    "label": 0
                },
                {
                    "sent": "This is just so just basically explain you the story here.",
                    "label": 0
                },
                {
                    "sent": "So this is an image.",
                    "label": 0
                },
                {
                    "sent": "Darkfield images is known, said and well known samples at concerts image.",
                    "label": 0
                },
                {
                    "sent": "This is basically sensitive to heavy atoms in basement.",
                    "label": 0
                },
                {
                    "sent": "Verizon business in Iran.",
                    "label": 0
                },
                {
                    "sent": "So the big spots are abysmal.",
                    "label": 0
                },
                {
                    "sent": "The small spots are iron.",
                    "label": 0
                },
                {
                    "sent": "If you look at this region you can see that the siren is displaced from the center of the basement sub lattice.",
                    "label": 0
                },
                {
                    "sent": "That's related with the polarization, which looks like this.",
                    "label": 0
                },
                {
                    "sent": "And then in the other region just beyond the domain, while you have another orientation.",
                    "label": 0
                },
                {
                    "sent": "And since these angles form for different in 180 and this domino wall runs parallel to the 10100 plane.",
                    "label": 0
                },
                {
                    "sent": "We identify the specific domain Wallace 109 in a similar way we were able to to also identify other domain walls 71180.",
                    "label": 0
                },
                {
                    "sent": "We have plenty of regions to work and try to detect this defects that are presumably responsible for conductivity from theory.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to identify the defects, we used two completely independent methods that's I think very nice because they effects just pop up by working with two completely different methods, and they're very consistent as I will show later.",
                    "label": 0
                },
                {
                    "sent": "So we work with this electronic defects through want identify this electronic effects through oxidation state of iron.",
                    "label": 0
                },
                {
                    "sent": "So for that we'll view deals, yes analysis and we want also to probe the ionic defect.",
                    "label": 0
                },
                {
                    "sent": "Basically vacancies that will mainly talk about business practices because we have no evidence of violence.",
                    "label": 0
                },
                {
                    "sent": "I can see here.",
                    "label": 0
                },
                {
                    "sent": "Fortunately we're blind for oxygen vacancies, and I hope God will again give some ideas of how we can make these methods better to see also oxygen vacancies.",
                    "label": 0
                },
                {
                    "sent": "But in that case, results are consistent even if we don't.",
                    "label": 0
                },
                {
                    "sent": "Basically, if you cannot detect oxygen vacancies, so we'll see what we did is to basically collect some real Spectra in the domain and inside the domino wall in very small regions 9 roughly 9 * 1 unit cell.",
                    "label": 0
                },
                {
                    "sent": "We collect the spectral, determine the difference in the energy of OK, and I run L3 edge this is.",
                    "label": 0
                },
                {
                    "sent": "Chemical shift methods and it's proportional to the oxidation state of iron and then by working with our material and using this calibration curve which was made by using some standards with known oxidation states.",
                    "label": 0
                },
                {
                    "sent": "That's why Bush Shannon Grasper, we were able to identify that we have mainly in Iron 3 plus states in the domain while the domino wall is basically have basically item 4 plus which dominates.",
                    "label": 0
                },
                {
                    "sent": "So we have strong strong segregation of item 4 plus states at the domain.",
                    "label": 0
                },
                {
                    "sent": "Well, that's actually an electron hole.",
                    "label": 0
                },
                {
                    "sent": "It is localized Iron 3 plus sites.",
                    "label": 0
                },
                {
                    "sent": "Then we work with quantification of dark field images.",
                    "label": 0
                },
                {
                    "sent": "Basically what you do Gordon will explain this into details.",
                    "label": 0
                },
                {
                    "sent": "You need some procedure and usually intensities of this individual basement columns are now by doing this procedure this intensity should be basically if I.",
                    "label": 0
                },
                {
                    "sent": "But I would be oversimplified but should be proportional to the number of atoms of bismuth atoms in that specific column.",
                    "label": 0
                },
                {
                    "sent": "So if you have a missing basement vacancy, this intensity should decrease and we consistently see this reduction very large, reduction 1520% in intensity just in the middle of the domino wall.",
                    "label": 0
                },
                {
                    "sent": "This is a basement basement column intensity map and this basically suggested we have segregation business vacancies there inside the Domino region.",
                    "label": 0
                },
                {
                    "sent": "So with two methods independent we identify this sort of defects.",
                    "label": 0
                },
                {
                    "sent": "Item 4 plus.",
                    "label": 0
                },
                {
                    "sent": "These vacancies and this now explains basically the conductivity at the Domino wall.",
                    "label": 0
                },
                {
                    "sent": "So if you assume that business back in there not very mobile at room temperature, the conductivity should be P type basically related to electron hole hopping between item four and three plus state the two other important thing here is this defect pretty consistent with what we know from the Fed chemistry model for business right this?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Shown here so business right?",
                    "label": 0
                },
                {
                    "sent": "Specific cause it contain a cation that siren, which can be both oxidized introduce.",
                    "label": 1
                },
                {
                    "sent": "You can have either died and two and four plus state, and that's why that's why it can be either P or N type conductor depending how you process it.",
                    "label": 0
                },
                {
                    "sent": "This is this was mainly done by the Sheffield Group and Bite or grand in already.",
                    "label": 1
                },
                {
                    "sent": "They are experts in effect chemistry of parasites.",
                    "label": 0
                },
                {
                    "sent": "So this is classical plot of conductivity as a function of partial pressure of oxygen.",
                    "label": 0
                },
                {
                    "sent": "You can see this increase in conductivity or the two extremes of PO2.",
                    "label": 0
                },
                {
                    "sent": "Marking the P&N type, it seems so these these experimental data were fitted with a model that assumes three effect reactions.",
                    "label": 0
                },
                {
                    "sent": "One is the volatilization of bismuth oxide, basically creation of bismuth and oxygen vacancies and then, depending on how you which Pier two, we work basically you will either fill this oxygen vacancies oxidizing that restates iron to four plus states, or if you work at low partial pressure of oxygen you will create more oxygen vacancies which will then compensated by electrons.",
                    "label": 0
                },
                {
                    "sent": "Creating item 2 plus states this model also tells you that if you work in air, like in our samples, when we identify these effects you should of course in a browser approximation you should end up with four plus defects compensated by basement vacancies.",
                    "label": 0
                },
                {
                    "sent": "And this is exactly the defects that we are locali detect with two completely independent methods at the domain walls.",
                    "label": 1
                },
                {
                    "sent": "It may look now disappointing, but this also tells you that the domain will.",
                    "label": 0
                },
                {
                    "sent": "Conductivity is basically same as bulk and activities speed type, electrical coping as it was explained for bulk conductivity.",
                    "label": 1
                },
                {
                    "sent": "Now probably it is higher just because just because we have concentration of electron holes there at the domain walls, concentration is higher because you have more charge carries that can carry this electrical current.",
                    "label": 1
                },
                {
                    "sent": "Basically this model also tells another interesting point is that you can decrease the conductivity by annealing.",
                    "label": 0
                },
                {
                    "sent": "Here sample in a lower partial pressure of oxygen.",
                    "label": 0
                },
                {
                    "sent": "This was shown in some other studies.",
                    "label": 0
                },
                {
                    "sent": "You can basically decrease it by entering this ionic regime by kneeling in nitrogen and you can regain it back by going in oxygen.",
                    "label": 0
                },
                {
                    "sent": "That's bit I behavior.",
                    "label": 0
                },
                {
                    "sent": "So this is shown and it was proven experimentally for.",
                    "label": 0
                },
                {
                    "sent": "By the conductivity biafo.",
                    "label": 0
                },
                {
                    "sent": "So to confirm our P type conductivity at the domino wall, we did practically same thing just now.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's the difference is we were looking at the local conductivity not at the bulk conductivity.",
                    "label": 0
                },
                {
                    "sent": "Also our samples in bulk conductivity were consistent with the P type behavior.",
                    "label": 0
                },
                {
                    "sent": "So here is here at the results.",
                    "label": 0
                },
                {
                    "sent": "We work with, work with their conductive AFM.",
                    "label": 0
                },
                {
                    "sent": "So this is a renewal sample.",
                    "label": 0
                },
                {
                    "sent": "We were able to see this conductive features Adobe Walls as I showed before.",
                    "label": 0
                },
                {
                    "sent": "Then we're need sample in nitrogen.",
                    "label": 0
                },
                {
                    "sent": "This conductivity practically disappeared only 3% of domain walls were conducted.",
                    "label": 0
                },
                {
                    "sent": "We made some statistical analysis.",
                    "label": 0
                },
                {
                    "sent": "You know you work with ceramics.",
                    "label": 0
                },
                {
                    "sent": "In it, some statistics and then bye.",
                    "label": 0
                },
                {
                    "sent": "In this same sample, that was an empty nitrogen and oxygen.",
                    "label": 0
                },
                {
                    "sent": "You regain the conductivity and this is consistent with the Pitti behavior and with the bulk conductivity of PFO, and of course with the defects that we that we found that the domain was basically what's happening by going nitrogen.",
                    "label": 0
                },
                {
                    "sent": "You reduce item 4 + 30 plus states.",
                    "label": 0
                },
                {
                    "sent": "You probably get oxygen vacancies, there are less mobile.",
                    "label": 0
                },
                {
                    "sent": "Of course then electron holes in that should decrease basically the conductivity.",
                    "label": 0
                },
                {
                    "sent": "There are some features which we don't still understand in detail, but basically overall that are consistent with basically.",
                    "label": 0
                },
                {
                    "sent": "I would what are your thoughts and I would hold.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so here is the conclusion we show this in case electrical conductivity that happens also in polycrystalline business right samples?",
                    "label": 1
                },
                {
                    "sent": "It's important because it affects by selected properties, even if this conductivity is not suspected to percolate the whole sample.",
                    "label": 1
                },
                {
                    "sent": "And we found this defect and together with this annealing studies they are consistent with the type behavior, just like the battle conductivity, an overall results basically tells you that we should control the type and consideration of this defect not only for bulk conductivities.",
                    "label": 1
                },
                {
                    "sent": "It's usually done, but also for this local connectivity.",
                    "label": 0
                },
                {
                    "sent": "And perhaps this explain.",
                    "label": 0
                },
                {
                    "sent": "Some inconsistencies with literature strongly processing related.",
                    "label": 0
                },
                {
                    "sent": "Also this local conductivity.",
                    "label": 0
                },
                {
                    "sent": "OK, I will finish here and ask Gordon.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now let's go to the Mikroskopie side to this story.",
                    "label": 0
                },
                {
                    "sent": "Definitely all the results were obtained in CS corrected scanning transmission electron microscope.",
                    "label": 1
                },
                {
                    "sent": "Its atomic resolution on the resolution, even the subatomic range.",
                    "label": 0
                },
                {
                    "sent": "So below 0.88 on some enables many different techniques will not go into detail, it was.",
                    "label": 0
                },
                {
                    "sent": "It starts to work really properly.",
                    "label": 0
                },
                {
                    "sent": "2014 it was installed one year before and from the National Institute Chemistry Center of Excellence, Low Carbon Technologies and last year or the end of 2015 years, Astaphan Institute joined the club with 20% of the.",
                    "label": 0
                },
                {
                    "sent": "Worth of this machine.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let me just remind you how this microscope works.",
                    "label": 0
                },
                {
                    "sent": "So extremely small.",
                    "label": 0
                },
                {
                    "sent": "Sub angstrom.",
                    "label": 0
                },
                {
                    "sent": "Focused electron beam.",
                    "label": 0
                },
                {
                    "sent": "Scan over the properly oriented crystal.",
                    "label": 0
                },
                {
                    "sent": "And during this.",
                    "label": 0
                },
                {
                    "sent": "Pass through the sample.",
                    "label": 0
                },
                {
                    "sent": "They are different.",
                    "label": 0
                },
                {
                    "sent": "Process is, but what are we trying to do to get here?",
                    "label": 0
                },
                {
                    "sent": "Is the to get the signal?",
                    "label": 0
                },
                {
                    "sent": "On some different types of detector, we called it annual darkfield detector and few or some of the electrons.",
                    "label": 0
                },
                {
                    "sent": "We are performing spectroscopy which is called electron energy loss spectroscopy where we get the information about the valence state, type of atoms and so on depending on the angle where we are getting our signal, we may get position of light elements.",
                    "label": 0
                },
                {
                    "sent": "We may get some strain.",
                    "label": 0
                },
                {
                    "sent": "Also called the contrast imaging, where that Z means the atomic number and the intensity of such image is proportional to of course thickness and the Z / 1.7 or something around there.",
                    "label": 0
                },
                {
                    "sent": "In the so called annual brightfield where we are getting just the position of light elements.",
                    "label": 0
                },
                {
                    "sent": "This ratio is, so I mean this.",
                    "label": 0
                },
                {
                    "sent": "Density regarding the ZT value 0.3, which is practically it's very difficult to obtain any.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Useful information, so this is the.",
                    "label": 0
                },
                {
                    "sent": "Wait, how we get images and then we get nice images.",
                    "label": 0
                },
                {
                    "sent": "Nice images where we can see directly the defects, structured position of atoms, individual atoms and so on, but.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The important thing here is to get some quantitative information from our image from our results.",
                    "label": 0
                },
                {
                    "sent": "And here is nice again after hours of centering contuning the microscope, nice image of bismuth ferrite again bismuth irens.",
                    "label": 0
                },
                {
                    "sent": "But what we can do from here is we can measure the distances from those atomic columns.",
                    "label": 0
                },
                {
                    "sent": "We can measure the balance state of, for instance.",
                    "label": 0
                },
                {
                    "sent": "I run in this case.",
                    "label": 0
                },
                {
                    "sent": "And from the intensity of individual columns we may get some chemical information.",
                    "label": 0
                },
                {
                    "sent": "OK, let's start.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There are lots of different software, so called citation, where mostly in.",
                    "label": 0
                },
                {
                    "sent": "Some Mathematica or or similar languages they're merging practically every year, and you and you.",
                    "label": 0
                },
                {
                    "sent": "But the problem with such software is that you never know what they what they really try to do.",
                    "label": 0
                },
                {
                    "sent": "So what we decide is to use image which is open Code Java based.",
                    "label": 0
                },
                {
                    "sent": "Software where there are a lot of already lot of small programs written and we use this one and Q stem from Christoph Core for the calculation or simulation of the.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ages.",
                    "label": 0
                },
                {
                    "sent": "1st.",
                    "label": 0
                },
                {
                    "sent": "This image has a resolution around 4 to 8 pico meters per pixel.",
                    "label": 0
                },
                {
                    "sent": "Depends on the magnification.",
                    "label": 0
                },
                {
                    "sent": "Depends on the size of the image and it's in 32 bits.",
                    "label": 0
                },
                {
                    "sent": "So four byte image, lot of information we can get from the from this image.",
                    "label": 0
                },
                {
                    "sent": "This is the model bismuth ferrite.",
                    "label": 0
                },
                {
                    "sent": "So we have easements.",
                    "label": 0
                },
                {
                    "sent": "We see the irony and deliberately the oxygens are very small.",
                    "label": 0
                },
                {
                    "sent": "Why because they do not contribute to the intensity and contribute very very small in small amounts.",
                    "label": 0
                },
                {
                    "sent": "Making the line profile across this one, we may get the distance we may get the intensity.",
                    "label": 0
                },
                {
                    "sent": "But this intensity is somehow summation of detector background image background and this AC component or how should I say that means with brightness?",
                    "label": 1
                },
                {
                    "sent": "We're moving this up and down and with contrast we're just enlarging this part of the so we can do on this image whatever we want and we want to quantify it.",
                    "label": 0
                },
                {
                    "sent": "We have to work really really very carefully and help to know what to do.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Work OK. First the position how we approach to the position.",
                    "label": 0
                },
                {
                    "sent": "The problem with the images that is relatively noisy, so the best or the first local Maxima approach where you just find where is the maximum of your is not good because it might like here.",
                    "label": 0
                },
                {
                    "sent": "The maximum pixel was somewhere around here and we know that's not the center of our column.",
                    "label": 0
                },
                {
                    "sent": "The next thing would be the center of gravity.",
                    "label": 1
                },
                {
                    "sent": "Center of Mass is much better than this one, but the best way best results that we got both 2D Gaussian approximation.",
                    "label": 0
                },
                {
                    "sent": "So we approximate this column image that is 2 Gaussian and we find where is the peak or where is the maximum with this Gaussian.",
                    "label": 0
                },
                {
                    "sent": "Of course we tested, we tested the system and we found.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In Vismod Sublattices, so there should be those distances should be very very precise and fixed, and we test all three methods and we found really that the Gaussian approximation was the best fit in all the cases, so we decide to use this approach.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Watch do the Gaussian.",
                    "label": 0
                },
                {
                    "sent": "Now we have the center of columns.",
                    "label": 0
                },
                {
                    "sent": "What we can do?",
                    "label": 0
                },
                {
                    "sent": "We can easily calculate whatever we want.",
                    "label": 0
                },
                {
                    "sent": "Distances for columns displacement what we did in here in bismuth ferrite.",
                    "label": 0
                },
                {
                    "sent": "We measure the displacement from the some ideal center to its original or real real position.",
                    "label": 0
                },
                {
                    "sent": "We can measure also determine alatis is just vertical divided with horizontal and.",
                    "label": 0
                },
                {
                    "sent": "Angle and so on.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Again, we test it.",
                    "label": 0
                },
                {
                    "sent": "We tested the method with the.",
                    "label": 0
                },
                {
                    "sent": "Cubic structure titanate, where the titanium shifts should be 0, so these are strong theorems, and these are titanium's.",
                    "label": 0
                },
                {
                    "sent": "We measured.",
                    "label": 0
                },
                {
                    "sent": "The shifts should be zero.",
                    "label": 0
                },
                {
                    "sent": "What we found is that there is somewhere between zero and 10 P committers, so the accuracy of our method of method.",
                    "label": 0
                },
                {
                    "sent": "How to determine this one?",
                    "label": 0
                },
                {
                    "sent": "It's around 10 P committers.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Using this approach to the bismuth ferrite, we found that the shifts are in the range of 13 up to 80.",
                    "label": 0
                },
                {
                    "sent": "Be committed, so we are far away from the from the experimental error.",
                    "label": 0
                },
                {
                    "sent": "What we found that plotting beside Katial shifts we can determine the type of the domain wall.",
                    "label": 1
                },
                {
                    "sent": "Angle this domain is charged non charged and so on.",
                    "label": 0
                },
                {
                    "sent": "So this was the this.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The first part practically all centers, so all users of such microscope are using similar similar approaches.",
                    "label": 0
                },
                {
                    "sent": "What we had to do is just to confirm that on our microscope everything is OK, so it's quite stable so that we can trust our our results.",
                    "label": 0
                },
                {
                    "sent": "Good point about the stem microscope is that using slightly different angle so called low angle and or dark field.",
                    "label": 0
                },
                {
                    "sent": "We can directly image the strain around the domain wall.",
                    "label": 0
                },
                {
                    "sent": "Previously I showed you the post processing, so we cannot directly determine on the image.",
                    "label": 0
                },
                {
                    "sent": "We cannot directly determine the position of the domain wall using.",
                    "label": 0
                },
                {
                    "sent": "This trains on those trains are due to the crystallographic shear you see.",
                    "label": 0
                },
                {
                    "sent": "This is the domain wall, some around here, and those atoms are shared moot, shifted for half, and have an angstrom or something.",
                    "label": 0
                },
                {
                    "sent": "Something like that.",
                    "label": 0
                },
                {
                    "sent": "OK, so now we can determine online or real time.",
                    "label": 0
                },
                {
                    "sent": "The presence of the main wall and make things next things was.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To go into details using.",
                    "label": 0
                },
                {
                    "sent": "Electron energy loss spectroscopy.",
                    "label": 0
                },
                {
                    "sent": "To find out what is the concentration, what would be the valence state of the iron and so on so?",
                    "label": 0
                },
                {
                    "sent": "If we just quickly compared.",
                    "label": 0
                },
                {
                    "sent": "Spectrum from domain wall and above or below domain wall and again.",
                    "label": 0
                },
                {
                    "sent": "The collection time here was around half a minute or sometimes even more, and the system was really quite stable, but we can compensate manually so we can follow the there.",
                    "label": 0
                },
                {
                    "sent": "Any small movements of the sample?",
                    "label": 0
                },
                {
                    "sent": "We tried to calculate the ratio of those two lines here, which is normally used to determine the valence state of the.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Aaron.",
                    "label": 0
                },
                {
                    "sent": "But what happened here is that we did not got, did not get any any useful results.",
                    "label": 0
                },
                {
                    "sent": "It was completely without any logic was.",
                    "label": 0
                },
                {
                    "sent": "So this so called white line ratio was not useful.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because it works 402 and 3 + 4.",
                    "label": 0
                },
                {
                    "sent": "Four plus does not work.",
                    "label": 0
                },
                {
                    "sent": "This is the problem with spin spins in 3D five.",
                    "label": 0
                },
                {
                    "sent": "Orbital.",
                    "label": 0
                },
                {
                    "sent": "This is the paper published in 2012, so that Varia Myrum, varying ferrites which is not completely, is the Hue metric, was out of this range.",
                    "label": 0
                },
                {
                    "sent": "They find they found out that the starting edge of oxygen.",
                    "label": 0
                },
                {
                    "sent": "An starting edge of Byron is moving also regarding so we have here 2 + 3 + 4 plus and we can see that the edge honor or onset of the oxygen.",
                    "label": 0
                },
                {
                    "sent": "This is this one move substantially to the lower energy site.",
                    "label": 0
                },
                {
                    "sent": "And we're happy that this is our luck, because in that case we were really able to determine in the matrix of Iron 3 plus we were able to determine the Iron 4 plus just one atomic layer.",
                    "label": 0
                },
                {
                    "sent": "If this was not the case, then overlapping of the peaks would happen and we could not.",
                    "label": 0
                },
                {
                    "sent": "We would not be able to distinguish between 3 plus and four plus so.",
                    "label": 0
                },
                {
                    "sent": "4 Plus metrics to determine the three.",
                    "label": 0
                },
                {
                    "sent": "Plus I run.",
                    "label": 0
                },
                {
                    "sent": "It's impossible vice versa.",
                    "label": 0
                },
                {
                    "sent": "It's I'm saying that we were lucky to do so that distance.",
                    "label": 0
                },
                {
                    "sent": "What we measure was the distance between starting or edge on the.",
                    "label": 0
                },
                {
                    "sent": "Onset of the oxygen to the Byron L 3 and we can see that the higher valence states close to 4.",
                    "label": 0
                },
                {
                    "sent": "This distance is much much.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I also this was the method how we determine the valence state.",
                    "label": 0
                },
                {
                    "sent": "Luckily we also using the so precise microscope so that we could get the atomic image we found in sample.",
                    "label": 0
                },
                {
                    "sent": "This is extremely difficult to prepare barium ferrite, which is indeed mixed valence.",
                    "label": 0
                },
                {
                    "sent": "So it's I run three plus or 4 plus exactly 1 structure.",
                    "label": 0
                },
                {
                    "sent": "We found areas with cubic structure where is possible just if all.",
                    "label": 0
                },
                {
                    "sent": "Byron is in four plus, so we use this one as.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Iron Force plus under your under standards, which are more conventional and really we got the nice practical linear function of the oxidation state and this difference in energy and on domain mall yesterday said we found the presence of iron are in 4 plus.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, what we did this is not chronologically this we did after one reviewer trying to persuade us that our measurements are not good.",
                    "label": 0
                },
                {
                    "sent": "If we perform perform the eels.",
                    "label": 0
                },
                {
                    "sent": "Analysis also on Bismuth, which has very very high energy.",
                    "label": 0
                },
                {
                    "sent": "About 2600 electron volts in the spectrum.",
                    "label": 1
                },
                {
                    "sent": "We did definitely observe some decrease in the signal at the domain wall.",
                    "label": 1
                },
                {
                    "sent": "So there is definitely also with eels.",
                    "label": 0
                },
                {
                    "sent": "We can determine that there is a law.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Over concentration of bismuth, but with yields we cannot determine exact chemical composition, and we can either not determine the exact position of this lowering.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's coming from 1, two or three three layers of atoms.",
                    "label": 0
                },
                {
                    "sent": "So how we approach?",
                    "label": 0
                },
                {
                    "sent": "We try to use the column intensity as a way how to determine the chemical composition so from the.",
                    "label": 1
                },
                {
                    "sent": "Image of the high angle annular darkfield.",
                    "label": 1
                },
                {
                    "sent": "Again, using image A, we did some kind of mask and using this mask and we can.",
                    "label": 0
                },
                {
                    "sent": "We can easily define this mask so the size and shape and so on and using this mask we integrate all the pixel inside inside such a column we used.",
                    "label": 0
                },
                {
                    "sent": "We somehow decided to use plus minus one Sigma again as a 2D2 D Gaussian shape.",
                    "label": 0
                },
                {
                    "sent": "Of the of the column whynott bigger becausw.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "In this position there oxygens and may interfere our measurement.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, now we have the.",
                    "label": 0
                },
                {
                    "sent": "Intensity, but the problem is how to quantify those intensities and there is one approach.",
                    "label": 0
                },
                {
                    "sent": "Labonge tamer from 2008.",
                    "label": 0
                },
                {
                    "sent": "They use the signal of detector itself.",
                    "label": 0
                },
                {
                    "sent": "They found out from the background of this image this if you remember, I showed you this profile already, so we have to we have to find this detector background and this image background is due to the thickness of the sample.",
                    "label": 0
                },
                {
                    "sent": "And what we did using this simple equation so that normalized intensity is somehow signal.",
                    "label": 0
                },
                {
                    "sent": "So all the pixels here are subjected with background and divide it with average signal detector of course again, with the background subtracted.",
                    "label": 0
                },
                {
                    "sent": "What we get?",
                    "label": 0
                },
                {
                    "sent": "What is this normalized signal?",
                    "label": 0
                },
                {
                    "sent": "This normalized signal is there is just the ratio or the part of the total scattering in our sample.",
                    "label": 0
                },
                {
                    "sent": "But what we introduce is still one additional normalization.",
                    "label": 0
                },
                {
                    "sent": "We normalized all the intensity on the Bismuth columns with so called maximum intensity.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because this maximum intensity should be pure bismuth columns.",
                    "label": 0
                },
                {
                    "sent": "And measured intensity is the column which has some.",
                    "label": 0
                },
                {
                    "sent": "Basement vacancies inside.",
                    "label": 0
                },
                {
                    "sent": "And using this approach.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We really found that exactly a domain wall.",
                    "label": 0
                },
                {
                    "sent": "There is some lowering of bismuth, which confirms also the results from the from the Eels, but this 20% of reduction.",
                    "label": 0
                },
                {
                    "sent": "What does it mean in the sense?",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of the chemical composition of this column.",
                    "label": 0
                },
                {
                    "sent": "We perform the simulation with 9 by 9 by 9 units cell and the thickness is up to 8080 nanometers with different different.",
                    "label": 0
                },
                {
                    "sent": "Composition or different amount of bismuth vacancies in this basement columns.",
                    "label": 0
                },
                {
                    "sent": "The use of course the TDs so that thermal diffuse scattering and one of such run such.",
                    "label": 0
                },
                {
                    "sent": "Calculation or simulation takes about 3 days 2 to one week.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And at the end we found if we plot the bismuth concentration bismuth vacancy, concentration basement intensity ratio for different thickness.",
                    "label": 1
                },
                {
                    "sent": "We find our found out that 20% of the reduction it must be around 30% of vacancies.",
                    "label": 0
                },
                {
                    "sent": "Consent.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is quite good with our model.",
                    "label": 0
                },
                {
                    "sent": "One bismuth vacancy somehow corresponds to three Iran 4 plus and in ideal case.",
                    "label": 0
                },
                {
                    "sent": "If I have the.",
                    "label": 0
                },
                {
                    "sent": "On domain wall in just one one atomic layer complete or iron on 4 plus we need 30% of bismuth vacancies so.",
                    "label": 0
                },
                {
                    "sent": "We are not claiming that this is the exact values, but we are in the same logical order of magnitude.",
                    "label": 0
                },
                {
                    "sent": "OK, definitely this is the last one before last slide, of course we have a lot of discussion with referees.",
                    "label": 0
                },
                {
                    "sent": "And reviewers at the first.",
                    "label": 0
                },
                {
                    "sent": "They did not believe us anything.",
                    "label": 0
                },
                {
                    "sent": "And then on the second child they did some they say OK, this is OK, but definitely the last one was this one.",
                    "label": 0
                },
                {
                    "sent": "The problem was that this method should work for perfect crystal and you too large train.",
                    "label": 1
                },
                {
                    "sent": "Should contribute to the local image contrast.",
                    "label": 1
                },
                {
                    "sent": "Of course we did thorough search in the literature.",
                    "label": 0
                },
                {
                    "sent": "There were some papers starting from 80s and so on, but in all cases the strain influenced positively to the signal, so we should get more signal there, not less.",
                    "label": 0
                },
                {
                    "sent": "And the final somehow.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Proof that then we are really sure that what we are measuring is the bismuth vacancies is the case that they showed us before, so the sample of bismuth ferrite fired in nitrogen.",
                    "label": 0
                },
                {
                    "sent": "Do not show this.",
                    "label": 0
                },
                {
                    "sent": "This material is very low electrical conductivity.",
                    "label": 0
                },
                {
                    "sent": "The domain walls are not conductive, so we.",
                    "label": 0
                },
                {
                    "sent": "Somehow expect that there is no bismuth vacancies and no Iron 4 plus, which we definitely confirm with those previously described methods.",
                    "label": 0
                },
                {
                    "sent": "But still in this.",
                    "label": 0
                },
                {
                    "sent": "In that case, the sheer crystallographic shear is present.",
                    "label": 0
                },
                {
                    "sent": "So we have strained.",
                    "label": 0
                },
                {
                    "sent": "But we do not have a signal.",
                    "label": 0
                },
                {
                    "sent": "So and this finally finally somehow persuaded last reviewer.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Instead of conclusion which were already given by today, maybe future work what we're planning to do, so we try to apply this method to other system.",
                    "label": 1
                },
                {
                    "sent": "There are many, many system, many defects.",
                    "label": 0
                },
                {
                    "sent": "Many planner defects where this methodology could be applied and of course the main thing that is today.",
                    "label": 0
                },
                {
                    "sent": "The challenge is how to quantify the oxygen vacancies.",
                    "label": 0
                },
                {
                    "sent": "The problem is we can see oxygens look.",
                    "label": 0
                },
                {
                    "sent": "This is the one case of parasite in 110 zone axis and this in between out positions of oxygen.",
                    "label": 0
                },
                {
                    "sent": "But those positions can be can be obtained with annual bright fields.",
                    "label": 0
                },
                {
                    "sent": "And the intensity is related to 0 or 0.3.",
                    "label": 0
                },
                {
                    "sent": "So small changes in the composition.",
                    "label": 0
                },
                {
                    "sent": "No way to be to be measured so.",
                    "label": 0
                },
                {
                    "sent": "We have some other ideas how to how to approach to this system, but maybe on next time.",
                    "label": 0
                },
                {
                    "sent": "Don't thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Thank you for a very nice talk, so bismuth varieties Romo Hedral isn't so so if you grow it in one one One Direction if it actually, you might remove some of these domains.",
                    "label": 0
                },
                {
                    "sent": "Does it affect macroscopically in terms of improved electrical conductivity?",
                    "label": 0
                },
                {
                    "sent": "I'm not sure what you mean exactly, so if you have if you grow up it actually 11 films.",
                    "label": 0
                },
                {
                    "sent": "Yes, you can basically amounted makes you can get the model domain status, which you will not don't have domain walls, so it's question.",
                    "label": 0
                },
                {
                    "sent": "But yeah, I mean does it work?",
                    "label": 0
                },
                {
                    "sent": "I mean in terms of conductivity, so the macroscopical conductivity is decreased for.",
                    "label": 0
                },
                {
                    "sent": "For one 11 oriented protection layers I don't know.",
                    "label": 0
                },
                {
                    "sent": "Basically if these defects are there.",
                    "label": 0
                },
                {
                    "sent": "Let's say that you have them, we don't know, but that's the point.",
                    "label": 0
                },
                {
                    "sent": "Then you can switch it totally and effect should be still there.",
                    "label": 0
                },
                {
                    "sent": "So I assume that there will be still connectivity.",
                    "label": 0
                },
                {
                    "sent": "If you did this, that's what you mean.",
                    "label": 0
                },
                {
                    "sent": "We can discuss maybe.",
                    "label": 0
                },
                {
                    "sent": "I have one.",
                    "label": 0
                },
                {
                    "sent": "Activity from.",
                    "label": 0
                },
                {
                    "sent": "Within the measurement in fields we work with ceramics.",
                    "label": 0
                },
                {
                    "sent": "I think because of the sample it was roughly 0.2 zero point, 3 millimeters, so we get something like.",
                    "label": 0
                },
                {
                    "sent": "It's because the actor be below now electrode above and basically they are affecting works is an upper electrode.",
                    "label": 0
                },
                {
                    "sent": "We have electric below and the other is the tip.",
                    "label": 0
                },
                {
                    "sent": "Yes, yes, the thickness is such that we get because we work with this coarse grain samples.",
                    "label": 0
                },
                {
                    "sent": "So I think we should catch something like 3040 grains in thickness.",
                    "label": 0
                },
                {
                    "sent": "Did you see any movement of the men was during TM microscopy because of radiation of.",
                    "label": 0
                },
                {
                    "sent": "It comes with a point.",
                    "label": 0
                },
                {
                    "sent": "No, not indeed.",
                    "label": 0
                },
                {
                    "sent": "But why, why so, so?",
                    "label": 0
                },
                {
                    "sent": "We definitely use very gentle conditions.",
                    "label": 0
                },
                {
                    "sent": "Because we are afraid.",
                    "label": 0
                },
                {
                    "sent": "So this is just what we showed you just a part of the complete experiments that were done so among other experiments we did the stability of the bismuth ferrite, so we used 2 minutes, 5 minutes, 10 minutes, 20 minutes of beam and then check the intensity distribution so that.",
                    "label": 0
                },
                {
                    "sent": "You're really afraid not to publish something which will be torn apart with some stupid artifacts, artifacts or something like that.",
                    "label": 0
                },
                {
                    "sent": "And among that, the stability of the domain wall.",
                    "label": 0
                },
                {
                    "sent": "It's really.",
                    "label": 0
                },
                {
                    "sent": "Relatively high.",
                    "label": 0
                },
                {
                    "sent": "We tried to move it later on just to to see if the Iron 4 plus or bismuth vacancies will follow those.",
                    "label": 0
                },
                {
                    "sent": "But no inside the microscope in C2 we did not observe this one.",
                    "label": 0
                },
                {
                    "sent": "Thickness dependent.",
                    "label": 0
                },
                {
                    "sent": "No, the problem is that we could not really construct the diagram thickness and the.",
                    "label": 1
                },
                {
                    "sent": "You know we were somehow using the optimal thickness for the determining eels.",
                    "label": 0
                },
                {
                    "sent": "That mean means we were in the range of 30 to 60 nanometers.",
                    "label": 0
                },
                {
                    "sent": "But within this range we did not see any dependence of the of the thickness.",
                    "label": 0
                },
                {
                    "sent": "But the thing we can what we did as you saw, is the simulation showed.",
                    "label": 0
                },
                {
                    "sent": "Somehow the thickness depends so different thickness is have slightly different.",
                    "label": 0
                },
                {
                    "sent": "Diagram and let go.",
                    "label": 0
                },
                {
                    "sent": "You explained the presence of Iron 4 plus because of the bismuth vacancies.",
                    "label": 0
                },
                {
                    "sent": "What is the reason for formation of bismuth?",
                    "label": 0
                },
                {
                    "sent": "References here at the domain wall.",
                    "label": 0
                },
                {
                    "sent": "I think there are two ways.",
                    "label": 0
                },
                {
                    "sent": "One is lots of bismuth oxide.",
                    "label": 0
                },
                {
                    "sent": "You know this is the volatile component before we lose it.",
                    "label": 1
                },
                {
                    "sent": "Create base with an oxygen vacancies.",
                    "label": 0
                },
                {
                    "sent": "The second is reaction.",
                    "label": 0
                },
                {
                    "sent": "Chemical reaction is not completed.",
                    "label": 0
                },
                {
                    "sent": "All the scalar setting small amounts of secondary phases so you can create some stuff is subsequently because of that while they're at the domino wall.",
                    "label": 0
                },
                {
                    "sent": "This is actually related to this driving force that it's created because of some specific states at the domino wall you have.",
                    "label": 0
                },
                {
                    "sent": "Basically what it was shown by theory is that you have this nail component.",
                    "label": 0
                },
                {
                    "sent": "Of polarization of the dominant meaning that, for example, 180 will not switch from one side to the other just by changing the magnitude polarization, but it will flip around rotate.",
                    "label": 0
                },
                {
                    "sent": "This will create some polarization which is particular to the domino wall, and that means electric fields, depolarizing fields and so on.",
                    "label": 0
                },
                {
                    "sent": "And the taxes are driving force for defect effects will start to move immediately when you go below the TC because below to see domain walls will form and this is the point where the defects will start segregated domain well.",
                    "label": 0
                },
                {
                    "sent": "This is how aging is explained in for electrics.",
                    "label": 0
                },
                {
                    "sent": "The point in before is that Curry Point is very large, very high.",
                    "label": 0
                },
                {
                    "sent": "It's 830, so just below the career day 20, you have plenty of thermal energy even for bismuth vacancies to move to the domain walls, so I'm not expecting, for example, let vacancies in PC at the domain walls because you know Kitty temperature is 350.",
                    "label": 0
                },
                {
                    "sent": "I'm not expecting diffusion of light vacancies but below 350.",
                    "label": 0
                },
                {
                    "sent": "With this specialty, I think of beautiful it might be.",
                    "label": 0
                },
                {
                    "sent": "More questions.",
                    "label": 0
                },
                {
                    "sent": "I have a very naive question, so which part of this work would have been possible without the new device at the National Institute of Chemistry?",
                    "label": 0
                },
                {
                    "sent": "The new microscope?",
                    "label": 0
                },
                {
                    "sent": "Amy.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is this one.",
                    "label": 0
                },
                {
                    "sent": "Question all the time.",
                    "label": 0
                },
                {
                    "sent": "What was the contribution?",
                    "label": 0
                },
                {
                    "sent": "Allegion idea machine.",
                    "label": 0
                },
                {
                    "sent": "The answer to this is this.",
                    "label": 0
                },
                {
                    "sent": "So I think all of those parameters here should be one.",
                    "label": 0
                },
                {
                    "sent": "Definitely.",
                    "label": 0
                },
                {
                    "sent": "Instrumental.",
                    "label": 0
                },
                {
                    "sent": "Element.",
                    "label": 0
                },
                {
                    "sent": "Just be the last part.",
                    "label": 0
                },
                {
                    "sent": "If there's no more questions, then let's thank the speakers again.",
                    "label": 0
                }
            ]
        }
    }
}