{
    "id": "ch5lndhzkdxnad26wddotw3sufmamoes",
    "title": "The Nassereith Minewater explosion (Tyrol, 1999)",
    "info": {
        "author": [
            "Leopold Weber, Center for Earth Sciences, University of Vienna"
        ],
        "published": "June 7, 2010",
        "recorded": "March 2010",
        "category": [
            "Top->Earth Sciences->Geology",
            "Top->Earth Sciences->Hydrology"
        ]
    },
    "url": "http://videolectures.net/outbursts_weber_nmwe/",
    "segmentation": [
        [
            "I would like to announce next lecture.",
            "This is not right.",
            "Mine water explosion in Gerald in 1999.",
            "Professor Low point vapor from Vienna is going to represent it.",
            "He is employed by the Federal Ministry of Economy, Family and Youth in Austria Vienna and his leader of the division and I'm very happy to have him here because I believe that the case he's going to explain can be.",
            "The best case study of the possible accident we could have here in India.",
            "Thank you very much for coming.",
            "Thank you very much for giving me safe opportunity to present you a very important case study.",
            "And I will be happy to share our experience with this particular matter with you."
        ],
        [
            "I would like to give you a brief overview of Partija logically framework for mining history.",
            "To mine water explosion itself.",
            "So technically, solutions and the less."
        ],
        [
            "Is fluent.",
            "Where is Nazi right?",
            "And I'll say it is in western part of Austria until or.",
            "Some 40 kilometers West of Sir Capital of Terror of Innsbruck."
        ],
        [
            "And as you can see here, this is one of very much small.",
            "Let's think mines in the North and limestone types."
        ],
        [
            "And just to give you a brief impression about the geology we have.",
            "Some conglomerate's which are nearly hard rocks."
        ],
        [
            "Sandy silte and gravel sediments of glacial overburden and this is the edit and edit is just on the surface of this conglomerate's only to give you an."
        ],
        [
            "And this also hard rocks.",
            "We also say deposit is located.",
            "Let's think Mineralizations in Triassic carbonates.",
            "This carbonates kostic."
        ],
        [
            "Some words."
        ],
        [
            "About a mining history.",
            "So first reportes of mining dated back into the 7th, 1700 years.",
            "And the first.",
            "Impression of an added the understory is dated back to 1763.",
            "Mining ceased 18181 and after that only the mining guides have been hold it, but have no further mining activities.",
            "In 1939, some mining rights changed, ownership changed and experience changed, and most of the documents become lost."
        ],
        [
            "Some words to say mind water explosions set pin not only one."
        ],
        [
            "Have been several.",
            "The first a report of the explosion was.",
            "In 1932 which was only an indication, said water is running out is seeping out small amounts no.",
            "A water outburst, but said general over the average outflow was nearly about two to three liters a second, nearly nothing.",
            "The first quartile, birth was 1948 with 500 liters a second.",
            "In July.",
            "July is more or less.",
            "Set time after melting of snow.",
            "And this was the first cenation which had to be done and a high risk because everything had to be done in front of the danger, because it was nearly not possible to get from other side of the mind into the mind.",
            "You had also about in front of you.",
            "The second outburst was 1955.",
            "The first one on 24th of July.",
            "And the second two days later.",
            "And it's more or less a general rule.",
            "It's not only one outburst.",
            "One outburst is mostly followed by a second one.",
            "This outburst has been cited and.",
            "An edit had been completely opened.",
            "Drainage system was installed with concrete tubes for a length of I think 130 meters."
        ],
        [
            "And this red line shows versus concrete tubes have been installed."
        ],
        [
            "This was our knowledge about in mind Maps, so was one edit.",
            "And unfortunately, she's mine.",
            "Maps haven't been complete."
        ],
        [
            "Certain other edit.",
            "Next to the unaided so we can distinguish between the old and the new and edit and.",
            "Sir.",
            "Edit which has been reconstructed for Holden, added ignoring said, says edit next to the old on a story on edit."
        ],
        [
            "This is so Volt outlet of this cold and a storm.",
            "You can see it's dry periodically with water outflow of not more than 5 liters a second."
        ],
        [
            "Ten, 1998, and 1999.",
            "We had some heavy precipitation.",
            "Starting with.",
            "Heavy rain forests in the autumn of 9998 and lots of snow in February and March 1999 and heavy precipitation in May."
        ],
        [
            "This should give you an impression about amount of.",
            "Precipitation in 1999.",
            "In the first six months to precipitation was double sense in previous years."
        ],
        [
            "On June 26.",
            "Remember July, June it's nearly the same.",
            "A couple of minutes of the midnight there was the mine water explosion of 1999.",
            "Extremely noisy witnesses said it's was like the starting of a huge aeroplane.",
            "And say whole front of the Anna edit have been cut off.",
            "It was a first outburst of more than 2000 cubic meters of water in a few minutes.",
            "And the complete kenyang down said it has been out washed with an additional mobilization of more than 10 to 20,000 cubic meters of tebriz.",
            "And a great surprise for us was it was not, say hold, edit.",
            "It was a new edit."
        ],
        [
            "Here you can see the water outlet.",
            "Which is next to the old edit, and this part is nearly not affected."
        ],
        [
            "Then this is said parallel mouth of Gnu Honor Stones, Anna Edit, which has been more or less center of outburst of devoter."
        ],
        [
            "Some weeks we observed an outflow not form 5 liters per second like observed before then of several hundreds of liters.",
            "And this is also the reason why it came to the outflow and to the outburst, because every hydrologically.",
            "Systems have not been interpreted correctly in the years before."
        ],
        [
            "To can see some of the results of this outflow.",
            "September is damaged, nearly wholesale value below."
        ],
        [
            "Over there.",
            "Debris flow down to the streets.",
            "Damaged tweets, so cut off over those breaches."
        ],
        [
            "Water has been blocked and this was the next dangerous situation."
        ],
        [
            "Just to give you the new picture of the geology, this is blown away.",
            "Part of an edit.",
            "And intercalation of rhythmic strata of filthy Sandy sediments.",
            "More or less tight for the portal and gravel and silt.",
            "The starter which are aquifers."
        ],
        [
            "What you can see here is also sufficient horse.",
            "Interparts aversive water has been was able to penetrate.",
            "Charles over tight silte provisons."
        ],
        [
            "So first immediate measures was to fence area because a lot of people wanted to see what happened there, and this was the 2nd danger.",
            "Said second blowout can happen to insure over the paper.",
            "And to counter or, say, outflow of the border from a safe place.",
            "Quality as well as quantity.",
            "And when I speak from quality it's more or less so.",
            "Partners of the water because if they bought that becomes muddy.",
            "It's an indication for a second outflow outburst.",
            "It's sufficient and parallel to that the further measures the detailed documentation of the Springs.",
            "And the first draft of a remediation project which had been carried out by the owner of the mining rights."
        ],
        [
            "This is only an example for the control station for the bottle which was radio controlled.",
            "In this case, nobody should be at front of the danger.",
            "For longer times you pick up because it was nearly not foreseen.",
            "Blsa second outburst."
        ],
        [
            "Happen?"
        ],
        [
            "So technically solution was not very easy and believe me not very cheap.",
            "So first thing was to short weight surface to bring some.",
            "Four holes in it and to construct an open air steel support for a starting point for any further operation.",
            "Watching carefully said water.",
            "Flow from the parallel.",
            "New Hannah edit."
        ],
        [
            "The second was.",
            "Step by step shop creating the.",
            "Hold on a edit.",
            "Once again, careful control of water outflow parallel to the on edit, just for safety reasons.",
            "If what is becoming.",
            "Outflew smaller or it becomes muddy.",
            "It had to be led to the evacuation of."
        ],
        [
            "Wirkus you can see also see great holes due to the outburst.",
            "And it was also necessary to construct devoting cubes to avoid the uncontrolled water flows into glacial sediments."
        ],
        [
            "Which was the lessons we learned."
        ],
        [
            "First of all, it was not.",
            "Also, how to logically pressure it was only 10 meters which is 1 power.",
            "It was a amount of water and the second word."
        ],
        [
            "Said food event was introduced by civic tension of water and uncontrolled water.",
            "Natural flow of the water.",
            "So increasing water intake whole mind system was much higher.",
            "Then of outflow we also drainage system of the old and I did.",
            "This has not been reported but it's now experience our experience right now, so it's impossible.",
            "It's it's of extreme important to make voter balances qualitative and quantitative fault appearances.",
            "As long as mine is operating.",
            "Uncle Bill, naturally bordering costs of ocean.",
            "Means the actual overburden and step destabilization of situational overburden.",
            "And this was some main risk and the main reason."
        ],
        [
            "Closing Bolt out.",
            "So overall, and this is typically for caustic environments, rapid water flow.",
            "Watch, say Florida, said bottom of this added you will find no one piece of cover but you can see some of the table which means rapid outflow and an immediate outflow.",
            "So this means several hundreds of liters of."
        ],
        [
            "Running water.",
            "But"
        ],
        [
            "This is the outlet of an edit which is quite under dimension."
        ],
        [
            "Shuffle, it's also important.",
            "To check all your mind Maps.",
            "Has in mind Maps complete?",
            "Awesome mine Maps.",
            "Actual."
        ],
        [
            "What do we, as an authority need for avoid any further offers?",
            "It's.",
            "It's sufficient geological and hydrogeological acknowledge.",
            "Which is essential for any closing measure.",
            "In need for voter balances.",
            "Qualitative and quantitative.",
            "A chance to compare.",
            "Inflow into the mind and outflow whether it's balanced or not so periodically changes.",
            "And in case of karstic phenomena, it's nearly impossible to shut down a mind completely.",
            "So the need for free and undisturbed water outflow."
        ],
        [
            "Any closing of in mind is expensive, but the improper closing of some mine is much more expensive.",
            "Thank you for your attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would like to announce next lecture.",
                    "label": 0
                },
                {
                    "sent": "This is not right.",
                    "label": 0
                },
                {
                    "sent": "Mine water explosion in Gerald in 1999.",
                    "label": 0
                },
                {
                    "sent": "Professor Low point vapor from Vienna is going to represent it.",
                    "label": 0
                },
                {
                    "sent": "He is employed by the Federal Ministry of Economy, Family and Youth in Austria Vienna and his leader of the division and I'm very happy to have him here because I believe that the case he's going to explain can be.",
                    "label": 0
                },
                {
                    "sent": "The best case study of the possible accident we could have here in India.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for coming.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for giving me safe opportunity to present you a very important case study.",
                    "label": 0
                },
                {
                    "sent": "And I will be happy to share our experience with this particular matter with you.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I would like to give you a brief overview of Partija logically framework for mining history.",
                    "label": 1
                },
                {
                    "sent": "To mine water explosion itself.",
                    "label": 0
                },
                {
                    "sent": "So technically, solutions and the less.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is fluent.",
                    "label": 0
                },
                {
                    "sent": "Where is Nazi right?",
                    "label": 0
                },
                {
                    "sent": "And I'll say it is in western part of Austria until or.",
                    "label": 0
                },
                {
                    "sent": "Some 40 kilometers West of Sir Capital of Terror of Innsbruck.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And as you can see here, this is one of very much small.",
                    "label": 0
                },
                {
                    "sent": "Let's think mines in the North and limestone types.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And just to give you a brief impression about the geology we have.",
                    "label": 0
                },
                {
                    "sent": "Some conglomerate's which are nearly hard rocks.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sandy silte and gravel sediments of glacial overburden and this is the edit and edit is just on the surface of this conglomerate's only to give you an.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this also hard rocks.",
                    "label": 0
                },
                {
                    "sent": "We also say deposit is located.",
                    "label": 0
                },
                {
                    "sent": "Let's think Mineralizations in Triassic carbonates.",
                    "label": 0
                },
                {
                    "sent": "This carbonates kostic.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some words.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "About a mining history.",
                    "label": 0
                },
                {
                    "sent": "So first reportes of mining dated back into the 7th, 1700 years.",
                    "label": 0
                },
                {
                    "sent": "And the first.",
                    "label": 0
                },
                {
                    "sent": "Impression of an added the understory is dated back to 1763.",
                    "label": 0
                },
                {
                    "sent": "Mining ceased 18181 and after that only the mining guides have been hold it, but have no further mining activities.",
                    "label": 1
                },
                {
                    "sent": "In 1939, some mining rights changed, ownership changed and experience changed, and most of the documents become lost.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some words to say mind water explosions set pin not only one.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Have been several.",
                    "label": 0
                },
                {
                    "sent": "The first a report of the explosion was.",
                    "label": 0
                },
                {
                    "sent": "In 1932 which was only an indication, said water is running out is seeping out small amounts no.",
                    "label": 0
                },
                {
                    "sent": "A water outburst, but said general over the average outflow was nearly about two to three liters a second, nearly nothing.",
                    "label": 0
                },
                {
                    "sent": "The first quartile, birth was 1948 with 500 liters a second.",
                    "label": 0
                },
                {
                    "sent": "In July.",
                    "label": 0
                },
                {
                    "sent": "July is more or less.",
                    "label": 0
                },
                {
                    "sent": "Set time after melting of snow.",
                    "label": 0
                },
                {
                    "sent": "And this was the first cenation which had to be done and a high risk because everything had to be done in front of the danger, because it was nearly not possible to get from other side of the mind into the mind.",
                    "label": 0
                },
                {
                    "sent": "You had also about in front of you.",
                    "label": 0
                },
                {
                    "sent": "The second outburst was 1955.",
                    "label": 0
                },
                {
                    "sent": "The first one on 24th of July.",
                    "label": 0
                },
                {
                    "sent": "And the second two days later.",
                    "label": 0
                },
                {
                    "sent": "And it's more or less a general rule.",
                    "label": 0
                },
                {
                    "sent": "It's not only one outburst.",
                    "label": 0
                },
                {
                    "sent": "One outburst is mostly followed by a second one.",
                    "label": 0
                },
                {
                    "sent": "This outburst has been cited and.",
                    "label": 0
                },
                {
                    "sent": "An edit had been completely opened.",
                    "label": 0
                },
                {
                    "sent": "Drainage system was installed with concrete tubes for a length of I think 130 meters.",
                    "label": 1
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this red line shows versus concrete tubes have been installed.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This was our knowledge about in mind Maps, so was one edit.",
                    "label": 0
                },
                {
                    "sent": "And unfortunately, she's mine.",
                    "label": 0
                },
                {
                    "sent": "Maps haven't been complete.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Certain other edit.",
                    "label": 0
                },
                {
                    "sent": "Next to the unaided so we can distinguish between the old and the new and edit and.",
                    "label": 0
                },
                {
                    "sent": "Sir.",
                    "label": 0
                },
                {
                    "sent": "Edit which has been reconstructed for Holden, added ignoring said, says edit next to the old on a story on edit.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is so Volt outlet of this cold and a storm.",
                    "label": 0
                },
                {
                    "sent": "You can see it's dry periodically with water outflow of not more than 5 liters a second.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ten, 1998, and 1999.",
                    "label": 0
                },
                {
                    "sent": "We had some heavy precipitation.",
                    "label": 0
                },
                {
                    "sent": "Starting with.",
                    "label": 0
                },
                {
                    "sent": "Heavy rain forests in the autumn of 9998 and lots of snow in February and March 1999 and heavy precipitation in May.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This should give you an impression about amount of.",
                    "label": 0
                },
                {
                    "sent": "Precipitation in 1999.",
                    "label": 0
                },
                {
                    "sent": "In the first six months to precipitation was double sense in previous years.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On June 26.",
                    "label": 0
                },
                {
                    "sent": "Remember July, June it's nearly the same.",
                    "label": 0
                },
                {
                    "sent": "A couple of minutes of the midnight there was the mine water explosion of 1999.",
                    "label": 1
                },
                {
                    "sent": "Extremely noisy witnesses said it's was like the starting of a huge aeroplane.",
                    "label": 1
                },
                {
                    "sent": "And say whole front of the Anna edit have been cut off.",
                    "label": 1
                },
                {
                    "sent": "It was a first outburst of more than 2000 cubic meters of water in a few minutes.",
                    "label": 0
                },
                {
                    "sent": "And the complete kenyang down said it has been out washed with an additional mobilization of more than 10 to 20,000 cubic meters of tebriz.",
                    "label": 0
                },
                {
                    "sent": "And a great surprise for us was it was not, say hold, edit.",
                    "label": 0
                },
                {
                    "sent": "It was a new edit.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here you can see the water outlet.",
                    "label": 0
                },
                {
                    "sent": "Which is next to the old edit, and this part is nearly not affected.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then this is said parallel mouth of Gnu Honor Stones, Anna Edit, which has been more or less center of outburst of devoter.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some weeks we observed an outflow not form 5 liters per second like observed before then of several hundreds of liters.",
                    "label": 1
                },
                {
                    "sent": "And this is also the reason why it came to the outflow and to the outburst, because every hydrologically.",
                    "label": 0
                },
                {
                    "sent": "Systems have not been interpreted correctly in the years before.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To can see some of the results of this outflow.",
                    "label": 0
                },
                {
                    "sent": "September is damaged, nearly wholesale value below.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Over there.",
                    "label": 0
                },
                {
                    "sent": "Debris flow down to the streets.",
                    "label": 1
                },
                {
                    "sent": "Damaged tweets, so cut off over those breaches.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Water has been blocked and this was the next dangerous situation.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just to give you the new picture of the geology, this is blown away.",
                    "label": 0
                },
                {
                    "sent": "Part of an edit.",
                    "label": 0
                },
                {
                    "sent": "And intercalation of rhythmic strata of filthy Sandy sediments.",
                    "label": 1
                },
                {
                    "sent": "More or less tight for the portal and gravel and silt.",
                    "label": 0
                },
                {
                    "sent": "The starter which are aquifers.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What you can see here is also sufficient horse.",
                    "label": 0
                },
                {
                    "sent": "Interparts aversive water has been was able to penetrate.",
                    "label": 0
                },
                {
                    "sent": "Charles over tight silte provisons.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first immediate measures was to fence area because a lot of people wanted to see what happened there, and this was the 2nd danger.",
                    "label": 0
                },
                {
                    "sent": "Said second blowout can happen to insure over the paper.",
                    "label": 0
                },
                {
                    "sent": "And to counter or, say, outflow of the border from a safe place.",
                    "label": 0
                },
                {
                    "sent": "Quality as well as quantity.",
                    "label": 0
                },
                {
                    "sent": "And when I speak from quality it's more or less so.",
                    "label": 0
                },
                {
                    "sent": "Partners of the water because if they bought that becomes muddy.",
                    "label": 0
                },
                {
                    "sent": "It's an indication for a second outflow outburst.",
                    "label": 0
                },
                {
                    "sent": "It's sufficient and parallel to that the further measures the detailed documentation of the Springs.",
                    "label": 1
                },
                {
                    "sent": "And the first draft of a remediation project which had been carried out by the owner of the mining rights.",
                    "label": 1
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is only an example for the control station for the bottle which was radio controlled.",
                    "label": 1
                },
                {
                    "sent": "In this case, nobody should be at front of the danger.",
                    "label": 0
                },
                {
                    "sent": "For longer times you pick up because it was nearly not foreseen.",
                    "label": 0
                },
                {
                    "sent": "Blsa second outburst.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Happen?",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So technically solution was not very easy and believe me not very cheap.",
                    "label": 0
                },
                {
                    "sent": "So first thing was to short weight surface to bring some.",
                    "label": 0
                },
                {
                    "sent": "Four holes in it and to construct an open air steel support for a starting point for any further operation.",
                    "label": 1
                },
                {
                    "sent": "Watching carefully said water.",
                    "label": 0
                },
                {
                    "sent": "Flow from the parallel.",
                    "label": 0
                },
                {
                    "sent": "New Hannah edit.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The second was.",
                    "label": 0
                },
                {
                    "sent": "Step by step shop creating the.",
                    "label": 1
                },
                {
                    "sent": "Hold on a edit.",
                    "label": 0
                },
                {
                    "sent": "Once again, careful control of water outflow parallel to the on edit, just for safety reasons.",
                    "label": 1
                },
                {
                    "sent": "If what is becoming.",
                    "label": 0
                },
                {
                    "sent": "Outflew smaller or it becomes muddy.",
                    "label": 0
                },
                {
                    "sent": "It had to be led to the evacuation of.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Wirkus you can see also see great holes due to the outburst.",
                    "label": 0
                },
                {
                    "sent": "And it was also necessary to construct devoting cubes to avoid the uncontrolled water flows into glacial sediments.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which was the lessons we learned.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "First of all, it was not.",
                    "label": 0
                },
                {
                    "sent": "Also, how to logically pressure it was only 10 meters which is 1 power.",
                    "label": 0
                },
                {
                    "sent": "It was a amount of water and the second word.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Said food event was introduced by civic tension of water and uncontrolled water.",
                    "label": 1
                },
                {
                    "sent": "Natural flow of the water.",
                    "label": 0
                },
                {
                    "sent": "So increasing water intake whole mind system was much higher.",
                    "label": 0
                },
                {
                    "sent": "Then of outflow we also drainage system of the old and I did.",
                    "label": 1
                },
                {
                    "sent": "This has not been reported but it's now experience our experience right now, so it's impossible.",
                    "label": 0
                },
                {
                    "sent": "It's it's of extreme important to make voter balances qualitative and quantitative fault appearances.",
                    "label": 0
                },
                {
                    "sent": "As long as mine is operating.",
                    "label": 0
                },
                {
                    "sent": "Uncle Bill, naturally bordering costs of ocean.",
                    "label": 0
                },
                {
                    "sent": "Means the actual overburden and step destabilization of situational overburden.",
                    "label": 0
                },
                {
                    "sent": "And this was some main risk and the main reason.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Closing Bolt out.",
                    "label": 0
                },
                {
                    "sent": "So overall, and this is typically for caustic environments, rapid water flow.",
                    "label": 0
                },
                {
                    "sent": "Watch, say Florida, said bottom of this added you will find no one piece of cover but you can see some of the table which means rapid outflow and an immediate outflow.",
                    "label": 0
                },
                {
                    "sent": "So this means several hundreds of liters of.",
                    "label": 1
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Running water.",
                    "label": 0
                },
                {
                    "sent": "But",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the outlet of an edit which is quite under dimension.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Shuffle, it's also important.",
                    "label": 0
                },
                {
                    "sent": "To check all your mind Maps.",
                    "label": 0
                },
                {
                    "sent": "Has in mind Maps complete?",
                    "label": 0
                },
                {
                    "sent": "Awesome mine Maps.",
                    "label": 0
                },
                {
                    "sent": "Actual.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What do we, as an authority need for avoid any further offers?",
                    "label": 0
                },
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "It's sufficient geological and hydrogeological acknowledge.",
                    "label": 1
                },
                {
                    "sent": "Which is essential for any closing measure.",
                    "label": 1
                },
                {
                    "sent": "In need for voter balances.",
                    "label": 0
                },
                {
                    "sent": "Qualitative and quantitative.",
                    "label": 0
                },
                {
                    "sent": "A chance to compare.",
                    "label": 1
                },
                {
                    "sent": "Inflow into the mind and outflow whether it's balanced or not so periodically changes.",
                    "label": 1
                },
                {
                    "sent": "And in case of karstic phenomena, it's nearly impossible to shut down a mind completely.",
                    "label": 0
                },
                {
                    "sent": "So the need for free and undisturbed water outflow.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Any closing of in mind is expensive, but the improper closing of some mine is much more expensive.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your attention.",
                    "label": 0
                }
            ]
        }
    }
}