{
    "id": "ciz4zfayaw7am2d5qc524oskwuufs6mc",
    "title": "Pemuisi: A constraint satisfaction-based generator of topical Indonesian poetry",
    "info": {
        "author": [
            "Ruli Manurung, Faculty of Computer Science, Universitas Indonesia"
        ],
        "published": "Aug. 8, 2014",
        "recorded": "June 2014",
        "category": [
            "Top->Philosophy",
            "Top->Social Sciences->Psychology",
            "Top->Computer Science->Artificial Intelligence",
            "Top->Computer Science->Machine Learning",
            "Top->Arts"
        ]
    },
    "url": "http://videolectures.net/iccc2014_manurung_indonesian_poetry/",
    "segmentation": [
        [
            "Thanks very much before I start.",
            "I just wanted to show just in response to assignments question earlier at the European ACL meeting a couple of months ago.",
            "There was this really cool demonstration by the system got sparser by Rodolfo Del Monte, which actually, without providing any sort of explicit annotations it can take poems and try to give a more expressive reading and.",
            "It takes some really deathly serious examples, so there are two poems by Sylvia Plath that he was demonstrating, and I think the results are.",
            "I guess, some people were still snickering here and there, but they were much better than the straight text to speech system.",
            "So if anyone is interested in sort of collaborating with this guy, I highly recommend.",
            "OK, so onto my talk.",
            "Thanks very much for the opportunity, so I'm truly Maniram from the University of Indonesia and I'm presenting work from my former student from Rochelle, who unfortunately could not be here today talking about, but we see constraint satisfaction based generator of topical Indonesian poetry."
        ],
        [
            "So just generally use the outline or talk a bit about poetry if you haven't already been portrayed enough this morning.",
            "And then talk about sort of like the language resources that were developed and then.",
            "The approach and some evaluation that we did, and in particular we did some human evaluation or should I say people evaluation.",
            "With the results from USC OK."
        ],
        [
            "So some background and."
        ],
        [
            "OK, trying to define poetry is maybe not as pointless as defining creativity, but it's also quite tricky and I tried doing this a few years ago where I tried to.",
            "Define poetry in terms of three, sort of like properties or constraints that must satisfy the first being grammaticality, so that text.",
            "Must comply with certain syntactic rules, and although we have poetic license in poems.",
            "When a port chooses to sort of like break from the norm, there actually has to be some rule that sort of governs that.",
            "So when, say, Robert Frost chooses a very strange construction with a prepositional phrase brought to the front in.",
            "Force that through the account.",
            "Remember it now.",
            "But oh OK, the force that through the green fuse drives the flower.",
            "It's a very famous opening line from one of his poems and very uncommon construction that we normally wouldn't use in everyday speech, but it's done for a reason.",
            "And there's a.",
            "There's a figure of speech that wrote this sort of like governs that.",
            "So the second is meaningfulness and that is a text must aim to convey a message that has meaning under certain interpretation and.",
            "This is really sort of like a not very, I guess clearly defined in what is what it really says, because I guess when you say like under a certain interpretation then but colorless green ideas sleep furiously is also meaningful, but I think the keyword there is a man, so I guess it's talking about intentionality and that we should be able to interrogate the system and sort of explain why it's sort of like saying something.",
            "So for example, like assignments, full face.",
            "Party generation system does that very clearly with the commentary and Lastly and somewhat circularly, a poetry has to have a measure of poetic Ness, and I guess this is what separates poems from normal text case.",
            "I guess if you look at natural language generation systems, they all satisfy some meaningfulness and grammaticality, but they don't necessarily satisfy any point thickness and poetic.",
            "This can be anything, well, not anything, but it can be many things, typically people.",
            "Sort of like.",
            "Define poetic Ness in terms of some phonetic phenomenal rhyme, alliteration, meter, and so on.",
            "But there's also the diction, the lexical choice of some sort of like.",
            "I think President phrase, which is sort of like a term that Tony is used before in for the Jigsaw Bard system that was used in the full face system.",
            "So this definition doesn't say anything about how the process.",
            "So how do we generate these poems, and specifically talking about poetry generators?",
            "There are many ways of doing this.",
            "Do we just sort of like completely just do random generation and hope that we now and then serendipitously get a nice output?",
            "Do we actually handcraft the resource limit this space by hand, crafting resources and procedures?",
            "Or do we equip the system with an ability to evaluate on its own?",
            "So like, imbue it with its own sort of like aesthetic sensibilities.",
            "And I guess there's a range of how different systems work."
        ],
        [
            "OK, so going from the definition of party to how this would be implemented in a poetry generation system for all three of these properties there are.",
            "There's a wide spectrum of what people have done before from the very simple to the incredibly sophisticated.",
            "So in terms of grammaticality.",
            "So on one side of the spectrum you have templates or which are effectively little pieces of context.",
            "In generation systems they have like these pre packaged sort of piece of text which you can stick together or put slot fillers in as opposed to deep syntactic generation which I think someone was asking earlier about actually having a grammar of a language.",
            "The grammar of a language to develop things and I think one of the benefits of having a deep syntactic generation component is.",
            "You really increase the paraphrasing power of your system so that as you're trying to satisfy other constraints then your syntax can sort of like bend over backwards to achieve that.",
            "In terms of meaningfulness, again, there's a spectrum.",
            "You have this sort of like bag of words approach, which I think is very prevalent in most generators, and it allows you to do sort of semantic associations, word associations we've seen, like maybe using log likelihood ratios or other approaches, and on the other side you have sort of like full blown logical representations which try to maintain predicate argument structure and head modifier relations within within.",
            "Attack so that we can be more faithful in our.",
            "In our semantics if we're trying to generate something from a given goal.",
            "So, for example, imagine if you're trying to generate an article which contains the words.",
            "Iraq, US an invasion, and if it doesn't get the predicate argument structure right, then you could sort of infer some very wrong conclusions from that.",
            "And finally, in terms of pointedness, there's a whole range of features that people have looked at.",
            "So from the phonetic aspects to sort of like choice of words and typically people look for, I guess, a uncommon or novel, or even our cake, and the resident choices.",
            "OK, so in terms of processes, there are many things that people have done before, so the system that I'm going."
        ],
        [
            "I'll be presenting now is sort of like a polar opposite of what I've done before with Mcgonagle, and is trying to do something that's actually very simple.",
            "So, OK, so movie season Indonesian word, which means poet.",
            "So the Indonesian word for poem is we see which probably comes from poisioned.",
            "But we see is that he who writes poems.",
            "So what we want to achieve with policy first of all, well, we wanted to do the Indonesian and I'd been trying many years to convince some student to work on this, but.",
            "It was just too hard because there was just very little linguistic resources that we could work with that things are slowly changing now.",
            "So first we need some basic linguistic resources.",
            "Lexicons, hopefully grammars and so on, but we also need more sort of specific resources which are essential for poetry.",
            "So pronunciation dictionaries.",
            "So for example, like the Jigsaw Bard, System resource is very valuable in sort of like.",
            "Providing some point structure so if we would have these sort of resources then it would be great.",
            "So one thing that I think mainly sort of like we took as inspiration from from the full face poetry generation paper was that I guess poetry does not exist in a vacuum, so human ports are inspired by external events and I really like this idea of sort of like the system to generate something based on.",
            "And use article.",
            "And Lastly we wanted to conduct human evaluation because it's I mean I think a lot of poetry generation system which is very useful and interesting.",
            "There's been very little work done, sort of human evaluation, and we're not claiming that what we did was sort of a comprehensive in anyway, but we wanted to see what happened."
        ],
        [
            "OK, so actually speed up a bit, so the system."
        ],
        [
            "So for we see requires several language resources and its templates.",
            "Slot fillers that slot fillers are divided into 2 keywords which come from news articles and are topical and sort of aquatic words which are extracted from a corpus of forms.",
            "And various sort of like resources and tools were used to build the building blocks for promises, poems, so news websites, a corpus of Indonesian poetry lexicons, part of part of speech tagger and Pronunciation dictionary, and the last three, which is sort of like, oh, actually yeah, the last three more like a prerequisite for this work to happen.",
            "And finally, last year we sort of have some of these components.",
            "We can now build this.",
            "OK."
        ],
        [
            "So the templates, like most of the previous sort of papers, are mined from a corpus of forms we have collected over 200 Indonesian poems.",
            "So here's an example of what would happen.",
            "So starting from the sentence we run it through the part of speech tagger and find out where the verbs or the pronouns where the nouns and so on, and so one example might be removed.",
            "Just pronouns and nouns and you get this.",
            "And here's a rough translation so.",
            "Something love something with full something OK.",
            "So this is probably an example of what we would argue is not probably a good template for poetry generation system because we feel it sort of like giving away the answer a bit too much because it is very specific in its content, so we're still sort of the main verb.",
            "There have been love, and so we wanted to find templates which sort of like a lot more generic in terms of semantic content."
        ],
        [
            "But ideally would want to find a phrase that also somehow has some sort of resonating quality, so so this is done manually, so from sort of like look through the extractor templates and well, here is just some 22 templates that we built and some rough translations on the right hand side.",
            "Yeah."
        ],
        [
            "So for the keywords, well, Guardian doesn't have an Indonesian addition, so here are three very popular Indonesian news websites, so we sort of given a particular news article, it will extract keywords through a sort of like stop words, function words and so on.",
            "And so there is a very useful resource for us.",
            "The I don't know how to pronounce this word shut corpus at Leipsic, so unlike the disco sort of like web service which only has English word associations, they've sort of like put up a huge collection of many, many languages.",
            "So there's Portuguese and Slovenian and Spanish and all sorts of other languages.",
            "So we use this to sort of like look for most.",
            "Strongly associated words with words on the news article, and we extract our keywords on that.",
            "So in addition to so called the poet I'm sorry news article keywords for which you extract roughly 70 to 80 keywords per news article."
        ],
        [
            "So OK, so this is kind of like a hack, but we but this is the easiest thing that we could do so using the same corpus of 200 poems we also extracted sort of like the most frequently appearing words in there, and so we didn't explicitly do a contrastive model like the foreground background that you call was doing, but there would be something interesting to try out, and we selected the top 50 sort of words after removing stop words, so again, well.",
            "Some of them are, I guess, vaguely poetic, so so shadow dream, disappear, float, bitter lonely.",
            "It seems like the corpus seems to be very.",
            "Angsty goth poems here.",
            "OK so any."
        ],
        [
            "Just a little technical slide of what the actual resources look like, so the templates the keywords in the poetic words.",
            "This is what they look like and so now we talk."
        ],
        [
            "Come to the generation aspect."
        ],
        [
            "So Simon actually came to visit us in universe Indonesia couple of years ago and really fun was in the audience.",
            "So he must have been really inspired by by Simon Stockon.",
            "So use the approach of the full face generation system.",
            "And essentially it's quite simple."
        ],
        [
            "So given a news article, it will extract all the keywords and then select all the templates and poetic words and in combination."
        ],
        [
            "Just try all possible and sort of like linguistically warranted combinations.",
            "So for example, since we have a lexicon with Pro, what are pronouns and we're announcing we match them up with a part of speech tags, so on his own, this would create a huge combinatorial explosion of possibilities."
        ],
        [
            "So we then do selection.",
            "And so how this is implemented is also inspired by you guys.",
            "Work at last year's conference, so you specify certain of constraints, the number of lines that rhyme, the number of words in the line, the number of syllables in a line, and so on.",
            "And we also sort of like experimented with this ratio of keywords coming from the news article versus keywords coming from the corpus of poem.",
            "So you can vary how on topic or how.",
            "Off topic you can you want to be."
        ],
        [
            "So in a very sort of quick and dirty Prolog implementation, here's an example of what sort of stanza would look like now.",
            "So in terms of constraint satisfaction, this is probably the worst way to do it.",
            "K and there are a lot more sensible ways of doing it by considering constraints much earlier on the process to prune the search space, but we just wanted to get something up and running for now, but yeah, so we're trying to refine the implementation such a lot more efficient."
        ],
        [
            "Now onto the experiments and evaluation.",
            "So the first thing we did."
        ],
        [
            "So kind of like a Turing test.",
            "Now I know that this is not the sort of end goal validation of computational creativity, but we're still interested to see what the results are.",
            "So here's a little bit about what we did.",
            "In this experiment, we didn't use any news articles to sort of exceed the keywords.",
            "We only used words from this sort of poetic pool of words, so we had four snippets from human poets, sort of some famous Indonesian poets for snippets where all the constraints that we have developed are applied and another sort of loose constraints model where the selection phase where you can impose rhymes and syllable counts and so on.",
            "We turn that off, so it was.",
            "Basically just satisfying that OK, nouns must go in now, fillers must go in noun slots, so that's all I was doing.",
            "And we were actually quite happy to get over 100.",
            "Wasn't exactly 180 respondents, and for this particular test they were only asked to guess for each snippet that they saw.",
            "Is this man or machine OK?"
        ],
        [
            "Right, so here are some examples.",
            "Or the Indonesian problems on the left and sort of loose translations on the right.",
            "OK, so read the top one so.",
            "But to kill Andium Jam 2.",
            "Bissell KTL calm mood kelangan lagoo, OK, and so this is not the full poem, so This is why surgical.",
            "Some battery is a very famous poet.",
            "So anyway, so we had four of each type and we asked people to rate the sort of against them."
        ],
        [
            "And here are the results and sort of like.",
            "I guess lines up with expectations, but again, sort of some pleasant sort of confirmations of what's happening so.",
            "35%.",
            "Actually, yes, that's sort of like the easiest poems generated.",
            "The loose constraint generation problems were created by humans, and it's a nice increasing trend towards the ones that were actually written by humans.",
            "And vice versa, the ones that were guests or like caught out to be machine generated from the loose constraint full consent and 26% thought that some human generated problems were cleared by machines.",
            "OK, so we thought that was interesting, and I mean it's sort of confirmation that what we're doing is actually sort of like being detected by humans, so we're not so the stuff that these poetry generation systems are doing is not just random and sort of like.",
            "Just goes undetected by human."
        ],
        [
            "And this confirmed in the second scenario where we did a bit more detailed analysis.",
            "So now in this experiment we told everyone OK, you're going to look at computer generated poems, so we chose three reference news articles.",
            "I'm going to show 1 next and with three configurations.",
            "So like before we had the one with all the constraints turned on and one with the loose constraints where actually we turned off the main poetic features constraints.",
            "But for the first one we also tried this playing with this parameter of.",
            "50% of the fillers have to be from the news article verse one, so 100% means it should be completely on topic with the news article.",
            "And the questionnaire is a range of questions and they're asked to answer on a four point Likert scale.",
            "So we actually showed the news article, and so I'm guessing."
        ],
        [
            "Some likes Manchester United so one of the articles that was chosen was about Alex sort of Sir Alex Ferguson retiring and so this is the Indonesian article.",
            "There's the URL for the news article.",
            "OK, sorry."
        ],
        [
            "So I don't have time to read this.",
            "Here is the example poem.",
            "I just like the point where OK, it is talking about with full red and struggle and with full blue in sadness.",
            "I guess it's picking up.",
            "I guess the article mentioned something about the Manchester United being Red Devils or something."
        ],
        [
            "OK, so I really don't have time to talk about this, but OK, so we had six sort of categories of questions.",
            "Where first of all, this poem exhibits a clear structure in terms of syllables and rhymes, the choice of word good.",
            "The grammar is the problem.",
            "Exhibits good grammatical structure.",
            "The poem reflects.",
            "Sorry there is some sort of unity between the form and the message, and then somehow it's on topic with the news article.",
            "And Lastly, that is expressive and OK, so there's not much that we can sort of like conclude from this, but.",
            "On all dimensions, the poem, which was generated with the loose with the least amount of constraints, did the worst.",
            "And yeah, OK, I had one more point, but I'll have to skip that."
        ],
        [
            "So can we see now?"
        ],
        [
            "There is a web application up at this URL so it will as a link to the original news article and the poem that it generates and has social networking hooks built in.",
            "You can like and tweet and share.",
            "And yes there is a Twitter bot, but it's still a bit shy.",
            "It's not really up and running just yet, but we've claimed handle and hopefully it will be being a bit."
        ],
        [
            "More soon."
        ],
        [
            "So yeah, so we've built a relatively knowledge poor system.",
            "I would argue it's a topical poetry generation, and the evaluation indicates that people can detect the effects of applying these constraints or not.",
            "Which, although not a huge finding, I think shows that was a step in the right."
        ],
        [
            "Action, so thank you very much.",
            "I guess the answer is probably no, but with the Turing test, did you ask the respondents whether their impression of the poem changed after they were told it was machine generated?",
            "And if the answer is no, just think that impression would change with your impression change you think.",
            "OK, the answer is no, because we actually didn't will mean and we didn't actually tell the answer.",
            "We also didn't get there for the Turing test.",
            "We didn't actually get their impression, we just asked him to annotate whether they thought it was manual machine.",
            "I. I don't know.",
            "I think that would probably be maybe a change.",
            "It was interesting.",
            "Yesterday, Michael suggested there might actually be a sort of positive bias towards artifacts that are generated.",
            "Knowingly generated by computer.",
            "I don't know.",
            "Maybe this is specific to the games community being very sort of accepting diverse but Twitch bus as well.",
            "I think 20 parts of well received in the moment, right, right, right?",
            "OK yeah.",
            "But I mean my.",
            "Guess instinct would be that people who sort of have a negative bias towards it, but I don't know.",
            "Yeah, maybe will be more specific.",
            "I mean he's talking about love and Red Devils and very human things.",
            "I wonder whether that would change people's impressions more, knowing that the software is never loved and probably never will.",
            "That we just have this hypothesis that that's actually turning star test like that are great for papers and and scientific progress, but actually emphasized the humanity gap that we have, right?",
            "And can actually damaging.",
            "Yeah no I agree.",
            "Hi, I like the idea which has been echoed a few times of learning patterns from poems.",
            "And then you talk about how you might tweak the poems in some way.",
            "Do you think that computers can generate or develop their own Twitter aesthetic for tweeting the poems directly so that they're not learning from famous poets, but they're developing a new way of communicating poetry through Twitter, which is a challenge because of the size limits.",
            "Um?",
            "OK, so I guess it depends on what you mean by sort of creating its own pattern.",
            "So in this system we sort of manually sort of selected, but as we saw from the previous presentations and stuff that I have another student working on is that we can sort of automatically self extract these poems these patterns.",
            "Yeah, it's challenging.",
            "Doing poetry in Twitter.",
            "This is host of John Rhe of Micro poetry sort of problems with only six words or how certain other constraints so.",
            "I mean, that's sort of those sort of constraints aren't very sort of complex 2 to stage, so I guess sort of like in a sense it might actually be easier to sort of specify so.",
            "But yeah, I don't know.",
            "I would say this is possible because just to briefly state that one of the things that makes Twitter accounts Followable is that the author has a definite aesthetic that people like.",
            "So maybe they're grumpy.",
            "Or maybe there Nicholas Stick or their sarcastic.",
            "And then the tweets all follow this.",
            "Distinct personality rights might be worth pursuing OK?",
            "OK, I think this session thanks a lot."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thanks very much before I start.",
                    "label": 0
                },
                {
                    "sent": "I just wanted to show just in response to assignments question earlier at the European ACL meeting a couple of months ago.",
                    "label": 0
                },
                {
                    "sent": "There was this really cool demonstration by the system got sparser by Rodolfo Del Monte, which actually, without providing any sort of explicit annotations it can take poems and try to give a more expressive reading and.",
                    "label": 0
                },
                {
                    "sent": "It takes some really deathly serious examples, so there are two poems by Sylvia Plath that he was demonstrating, and I think the results are.",
                    "label": 0
                },
                {
                    "sent": "I guess, some people were still snickering here and there, but they were much better than the straight text to speech system.",
                    "label": 0
                },
                {
                    "sent": "So if anyone is interested in sort of collaborating with this guy, I highly recommend.",
                    "label": 0
                },
                {
                    "sent": "OK, so onto my talk.",
                    "label": 0
                },
                {
                    "sent": "Thanks very much for the opportunity, so I'm truly Maniram from the University of Indonesia and I'm presenting work from my former student from Rochelle, who unfortunately could not be here today talking about, but we see constraint satisfaction based generator of topical Indonesian poetry.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So just generally use the outline or talk a bit about poetry if you haven't already been portrayed enough this morning.",
                    "label": 0
                },
                {
                    "sent": "And then talk about sort of like the language resources that were developed and then.",
                    "label": 1
                },
                {
                    "sent": "The approach and some evaluation that we did, and in particular we did some human evaluation or should I say people evaluation.",
                    "label": 0
                },
                {
                    "sent": "With the results from USC OK.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So some background and.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, trying to define poetry is maybe not as pointless as defining creativity, but it's also quite tricky and I tried doing this a few years ago where I tried to.",
                    "label": 0
                },
                {
                    "sent": "Define poetry in terms of three, sort of like properties or constraints that must satisfy the first being grammaticality, so that text.",
                    "label": 0
                },
                {
                    "sent": "Must comply with certain syntactic rules, and although we have poetic license in poems.",
                    "label": 1
                },
                {
                    "sent": "When a port chooses to sort of like break from the norm, there actually has to be some rule that sort of governs that.",
                    "label": 0
                },
                {
                    "sent": "So when, say, Robert Frost chooses a very strange construction with a prepositional phrase brought to the front in.",
                    "label": 0
                },
                {
                    "sent": "Force that through the account.",
                    "label": 0
                },
                {
                    "sent": "Remember it now.",
                    "label": 0
                },
                {
                    "sent": "But oh OK, the force that through the green fuse drives the flower.",
                    "label": 0
                },
                {
                    "sent": "It's a very famous opening line from one of his poems and very uncommon construction that we normally wouldn't use in everyday speech, but it's done for a reason.",
                    "label": 0
                },
                {
                    "sent": "And there's a.",
                    "label": 0
                },
                {
                    "sent": "There's a figure of speech that wrote this sort of like governs that.",
                    "label": 0
                },
                {
                    "sent": "So the second is meaningfulness and that is a text must aim to convey a message that has meaning under certain interpretation and.",
                    "label": 1
                },
                {
                    "sent": "This is really sort of like a not very, I guess clearly defined in what is what it really says, because I guess when you say like under a certain interpretation then but colorless green ideas sleep furiously is also meaningful, but I think the keyword there is a man, so I guess it's talking about intentionality and that we should be able to interrogate the system and sort of explain why it's sort of like saying something.",
                    "label": 0
                },
                {
                    "sent": "So for example, like assignments, full face.",
                    "label": 0
                },
                {
                    "sent": "Party generation system does that very clearly with the commentary and Lastly and somewhat circularly, a poetry has to have a measure of poetic Ness, and I guess this is what separates poems from normal text case.",
                    "label": 0
                },
                {
                    "sent": "I guess if you look at natural language generation systems, they all satisfy some meaningfulness and grammaticality, but they don't necessarily satisfy any point thickness and poetic.",
                    "label": 0
                },
                {
                    "sent": "This can be anything, well, not anything, but it can be many things, typically people.",
                    "label": 0
                },
                {
                    "sent": "Sort of like.",
                    "label": 0
                },
                {
                    "sent": "Define poetic Ness in terms of some phonetic phenomenal rhyme, alliteration, meter, and so on.",
                    "label": 0
                },
                {
                    "sent": "But there's also the diction, the lexical choice of some sort of like.",
                    "label": 0
                },
                {
                    "sent": "I think President phrase, which is sort of like a term that Tony is used before in for the Jigsaw Bard system that was used in the full face system.",
                    "label": 0
                },
                {
                    "sent": "So this definition doesn't say anything about how the process.",
                    "label": 0
                },
                {
                    "sent": "So how do we generate these poems, and specifically talking about poetry generators?",
                    "label": 0
                },
                {
                    "sent": "There are many ways of doing this.",
                    "label": 0
                },
                {
                    "sent": "Do we just sort of like completely just do random generation and hope that we now and then serendipitously get a nice output?",
                    "label": 0
                },
                {
                    "sent": "Do we actually handcraft the resource limit this space by hand, crafting resources and procedures?",
                    "label": 0
                },
                {
                    "sent": "Or do we equip the system with an ability to evaluate on its own?",
                    "label": 0
                },
                {
                    "sent": "So like, imbue it with its own sort of like aesthetic sensibilities.",
                    "label": 0
                },
                {
                    "sent": "And I guess there's a range of how different systems work.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so going from the definition of party to how this would be implemented in a poetry generation system for all three of these properties there are.",
                    "label": 0
                },
                {
                    "sent": "There's a wide spectrum of what people have done before from the very simple to the incredibly sophisticated.",
                    "label": 0
                },
                {
                    "sent": "So in terms of grammaticality.",
                    "label": 0
                },
                {
                    "sent": "So on one side of the spectrum you have templates or which are effectively little pieces of context.",
                    "label": 0
                },
                {
                    "sent": "In generation systems they have like these pre packaged sort of piece of text which you can stick together or put slot fillers in as opposed to deep syntactic generation which I think someone was asking earlier about actually having a grammar of a language.",
                    "label": 0
                },
                {
                    "sent": "The grammar of a language to develop things and I think one of the benefits of having a deep syntactic generation component is.",
                    "label": 1
                },
                {
                    "sent": "You really increase the paraphrasing power of your system so that as you're trying to satisfy other constraints then your syntax can sort of like bend over backwards to achieve that.",
                    "label": 0
                },
                {
                    "sent": "In terms of meaningfulness, again, there's a spectrum.",
                    "label": 0
                },
                {
                    "sent": "You have this sort of like bag of words approach, which I think is very prevalent in most generators, and it allows you to do sort of semantic associations, word associations we've seen, like maybe using log likelihood ratios or other approaches, and on the other side you have sort of like full blown logical representations which try to maintain predicate argument structure and head modifier relations within within.",
                    "label": 0
                },
                {
                    "sent": "Attack so that we can be more faithful in our.",
                    "label": 0
                },
                {
                    "sent": "In our semantics if we're trying to generate something from a given goal.",
                    "label": 0
                },
                {
                    "sent": "So, for example, imagine if you're trying to generate an article which contains the words.",
                    "label": 0
                },
                {
                    "sent": "Iraq, US an invasion, and if it doesn't get the predicate argument structure right, then you could sort of infer some very wrong conclusions from that.",
                    "label": 0
                },
                {
                    "sent": "And finally, in terms of pointedness, there's a whole range of features that people have looked at.",
                    "label": 0
                },
                {
                    "sent": "So from the phonetic aspects to sort of like choice of words and typically people look for, I guess, a uncommon or novel, or even our cake, and the resident choices.",
                    "label": 0
                },
                {
                    "sent": "OK, so in terms of processes, there are many things that people have done before, so the system that I'm going.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'll be presenting now is sort of like a polar opposite of what I've done before with Mcgonagle, and is trying to do something that's actually very simple.",
                    "label": 0
                },
                {
                    "sent": "So, OK, so movie season Indonesian word, which means poet.",
                    "label": 0
                },
                {
                    "sent": "So the Indonesian word for poem is we see which probably comes from poisioned.",
                    "label": 0
                },
                {
                    "sent": "But we see is that he who writes poems.",
                    "label": 0
                },
                {
                    "sent": "So what we want to achieve with policy first of all, well, we wanted to do the Indonesian and I'd been trying many years to convince some student to work on this, but.",
                    "label": 0
                },
                {
                    "sent": "It was just too hard because there was just very little linguistic resources that we could work with that things are slowly changing now.",
                    "label": 0
                },
                {
                    "sent": "So first we need some basic linguistic resources.",
                    "label": 1
                },
                {
                    "sent": "Lexicons, hopefully grammars and so on, but we also need more sort of specific resources which are essential for poetry.",
                    "label": 0
                },
                {
                    "sent": "So pronunciation dictionaries.",
                    "label": 0
                },
                {
                    "sent": "So for example, like the Jigsaw Bard, System resource is very valuable in sort of like.",
                    "label": 0
                },
                {
                    "sent": "Providing some point structure so if we would have these sort of resources then it would be great.",
                    "label": 0
                },
                {
                    "sent": "So one thing that I think mainly sort of like we took as inspiration from from the full face poetry generation paper was that I guess poetry does not exist in a vacuum, so human ports are inspired by external events and I really like this idea of sort of like the system to generate something based on.",
                    "label": 1
                },
                {
                    "sent": "And use article.",
                    "label": 0
                },
                {
                    "sent": "And Lastly we wanted to conduct human evaluation because it's I mean I think a lot of poetry generation system which is very useful and interesting.",
                    "label": 0
                },
                {
                    "sent": "There's been very little work done, sort of human evaluation, and we're not claiming that what we did was sort of a comprehensive in anyway, but we wanted to see what happened.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so actually speed up a bit, so the system.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for we see requires several language resources and its templates.",
                    "label": 1
                },
                {
                    "sent": "Slot fillers that slot fillers are divided into 2 keywords which come from news articles and are topical and sort of aquatic words which are extracted from a corpus of forms.",
                    "label": 0
                },
                {
                    "sent": "And various sort of like resources and tools were used to build the building blocks for promises, poems, so news websites, a corpus of Indonesian poetry lexicons, part of part of speech tagger and Pronunciation dictionary, and the last three, which is sort of like, oh, actually yeah, the last three more like a prerequisite for this work to happen.",
                    "label": 0
                },
                {
                    "sent": "And finally, last year we sort of have some of these components.",
                    "label": 0
                },
                {
                    "sent": "We can now build this.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the templates, like most of the previous sort of papers, are mined from a corpus of forms we have collected over 200 Indonesian poems.",
                    "label": 0
                },
                {
                    "sent": "So here's an example of what would happen.",
                    "label": 0
                },
                {
                    "sent": "So starting from the sentence we run it through the part of speech tagger and find out where the verbs or the pronouns where the nouns and so on, and so one example might be removed.",
                    "label": 0
                },
                {
                    "sent": "Just pronouns and nouns and you get this.",
                    "label": 0
                },
                {
                    "sent": "And here's a rough translation so.",
                    "label": 0
                },
                {
                    "sent": "Something love something with full something OK.",
                    "label": 0
                },
                {
                    "sent": "So this is probably an example of what we would argue is not probably a good template for poetry generation system because we feel it sort of like giving away the answer a bit too much because it is very specific in its content, so we're still sort of the main verb.",
                    "label": 0
                },
                {
                    "sent": "There have been love, and so we wanted to find templates which sort of like a lot more generic in terms of semantic content.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But ideally would want to find a phrase that also somehow has some sort of resonating quality, so so this is done manually, so from sort of like look through the extractor templates and well, here is just some 22 templates that we built and some rough translations on the right hand side.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for the keywords, well, Guardian doesn't have an Indonesian addition, so here are three very popular Indonesian news websites, so we sort of given a particular news article, it will extract keywords through a sort of like stop words, function words and so on.",
                    "label": 0
                },
                {
                    "sent": "And so there is a very useful resource for us.",
                    "label": 0
                },
                {
                    "sent": "The I don't know how to pronounce this word shut corpus at Leipsic, so unlike the disco sort of like web service which only has English word associations, they've sort of like put up a huge collection of many, many languages.",
                    "label": 0
                },
                {
                    "sent": "So there's Portuguese and Slovenian and Spanish and all sorts of other languages.",
                    "label": 0
                },
                {
                    "sent": "So we use this to sort of like look for most.",
                    "label": 0
                },
                {
                    "sent": "Strongly associated words with words on the news article, and we extract our keywords on that.",
                    "label": 0
                },
                {
                    "sent": "So in addition to so called the poet I'm sorry news article keywords for which you extract roughly 70 to 80 keywords per news article.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So OK, so this is kind of like a hack, but we but this is the easiest thing that we could do so using the same corpus of 200 poems we also extracted sort of like the most frequently appearing words in there, and so we didn't explicitly do a contrastive model like the foreground background that you call was doing, but there would be something interesting to try out, and we selected the top 50 sort of words after removing stop words, so again, well.",
                    "label": 0
                },
                {
                    "sent": "Some of them are, I guess, vaguely poetic, so so shadow dream, disappear, float, bitter lonely.",
                    "label": 0
                },
                {
                    "sent": "It seems like the corpus seems to be very.",
                    "label": 0
                },
                {
                    "sent": "Angsty goth poems here.",
                    "label": 0
                },
                {
                    "sent": "OK so any.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just a little technical slide of what the actual resources look like, so the templates the keywords in the poetic words.",
                    "label": 0
                },
                {
                    "sent": "This is what they look like and so now we talk.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Come to the generation aspect.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So Simon actually came to visit us in universe Indonesia couple of years ago and really fun was in the audience.",
                    "label": 0
                },
                {
                    "sent": "So he must have been really inspired by by Simon Stockon.",
                    "label": 0
                },
                {
                    "sent": "So use the approach of the full face generation system.",
                    "label": 1
                },
                {
                    "sent": "And essentially it's quite simple.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So given a news article, it will extract all the keywords and then select all the templates and poetic words and in combination.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just try all possible and sort of like linguistically warranted combinations.",
                    "label": 0
                },
                {
                    "sent": "So for example, since we have a lexicon with Pro, what are pronouns and we're announcing we match them up with a part of speech tags, so on his own, this would create a huge combinatorial explosion of possibilities.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we then do selection.",
                    "label": 0
                },
                {
                    "sent": "And so how this is implemented is also inspired by you guys.",
                    "label": 0
                },
                {
                    "sent": "Work at last year's conference, so you specify certain of constraints, the number of lines that rhyme, the number of words in the line, the number of syllables in a line, and so on.",
                    "label": 1
                },
                {
                    "sent": "And we also sort of like experimented with this ratio of keywords coming from the news article versus keywords coming from the corpus of poem.",
                    "label": 0
                },
                {
                    "sent": "So you can vary how on topic or how.",
                    "label": 0
                },
                {
                    "sent": "Off topic you can you want to be.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in a very sort of quick and dirty Prolog implementation, here's an example of what sort of stanza would look like now.",
                    "label": 0
                },
                {
                    "sent": "So in terms of constraint satisfaction, this is probably the worst way to do it.",
                    "label": 0
                },
                {
                    "sent": "K and there are a lot more sensible ways of doing it by considering constraints much earlier on the process to prune the search space, but we just wanted to get something up and running for now, but yeah, so we're trying to refine the implementation such a lot more efficient.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now onto the experiments and evaluation.",
                    "label": 0
                },
                {
                    "sent": "So the first thing we did.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So kind of like a Turing test.",
                    "label": 1
                },
                {
                    "sent": "Now I know that this is not the sort of end goal validation of computational creativity, but we're still interested to see what the results are.",
                    "label": 0
                },
                {
                    "sent": "So here's a little bit about what we did.",
                    "label": 0
                },
                {
                    "sent": "In this experiment, we didn't use any news articles to sort of exceed the keywords.",
                    "label": 0
                },
                {
                    "sent": "We only used words from this sort of poetic pool of words, so we had four snippets from human poets, sort of some famous Indonesian poets for snippets where all the constraints that we have developed are applied and another sort of loose constraints model where the selection phase where you can impose rhymes and syllable counts and so on.",
                    "label": 1
                },
                {
                    "sent": "We turn that off, so it was.",
                    "label": 0
                },
                {
                    "sent": "Basically just satisfying that OK, nouns must go in now, fillers must go in noun slots, so that's all I was doing.",
                    "label": 0
                },
                {
                    "sent": "And we were actually quite happy to get over 100.",
                    "label": 1
                },
                {
                    "sent": "Wasn't exactly 180 respondents, and for this particular test they were only asked to guess for each snippet that they saw.",
                    "label": 0
                },
                {
                    "sent": "Is this man or machine OK?",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right, so here are some examples.",
                    "label": 0
                },
                {
                    "sent": "Or the Indonesian problems on the left and sort of loose translations on the right.",
                    "label": 0
                },
                {
                    "sent": "OK, so read the top one so.",
                    "label": 0
                },
                {
                    "sent": "But to kill Andium Jam 2.",
                    "label": 0
                },
                {
                    "sent": "Bissell KTL calm mood kelangan lagoo, OK, and so this is not the full poem, so This is why surgical.",
                    "label": 0
                },
                {
                    "sent": "Some battery is a very famous poet.",
                    "label": 0
                },
                {
                    "sent": "So anyway, so we had four of each type and we asked people to rate the sort of against them.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And here are the results and sort of like.",
                    "label": 0
                },
                {
                    "sent": "I guess lines up with expectations, but again, sort of some pleasant sort of confirmations of what's happening so.",
                    "label": 0
                },
                {
                    "sent": "35%.",
                    "label": 0
                },
                {
                    "sent": "Actually, yes, that's sort of like the easiest poems generated.",
                    "label": 0
                },
                {
                    "sent": "The loose constraint generation problems were created by humans, and it's a nice increasing trend towards the ones that were actually written by humans.",
                    "label": 0
                },
                {
                    "sent": "And vice versa, the ones that were guests or like caught out to be machine generated from the loose constraint full consent and 26% thought that some human generated problems were cleared by machines.",
                    "label": 1
                },
                {
                    "sent": "OK, so we thought that was interesting, and I mean it's sort of confirmation that what we're doing is actually sort of like being detected by humans, so we're not so the stuff that these poetry generation systems are doing is not just random and sort of like.",
                    "label": 0
                },
                {
                    "sent": "Just goes undetected by human.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this confirmed in the second scenario where we did a bit more detailed analysis.",
                    "label": 1
                },
                {
                    "sent": "So now in this experiment we told everyone OK, you're going to look at computer generated poems, so we chose three reference news articles.",
                    "label": 1
                },
                {
                    "sent": "I'm going to show 1 next and with three configurations.",
                    "label": 0
                },
                {
                    "sent": "So like before we had the one with all the constraints turned on and one with the loose constraints where actually we turned off the main poetic features constraints.",
                    "label": 0
                },
                {
                    "sent": "But for the first one we also tried this playing with this parameter of.",
                    "label": 1
                },
                {
                    "sent": "50% of the fillers have to be from the news article verse one, so 100% means it should be completely on topic with the news article.",
                    "label": 0
                },
                {
                    "sent": "And the questionnaire is a range of questions and they're asked to answer on a four point Likert scale.",
                    "label": 0
                },
                {
                    "sent": "So we actually showed the news article, and so I'm guessing.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some likes Manchester United so one of the articles that was chosen was about Alex sort of Sir Alex Ferguson retiring and so this is the Indonesian article.",
                    "label": 0
                },
                {
                    "sent": "There's the URL for the news article.",
                    "label": 1
                },
                {
                    "sent": "OK, sorry.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I don't have time to read this.",
                    "label": 0
                },
                {
                    "sent": "Here is the example poem.",
                    "label": 1
                },
                {
                    "sent": "I just like the point where OK, it is talking about with full red and struggle and with full blue in sadness.",
                    "label": 1
                },
                {
                    "sent": "I guess it's picking up.",
                    "label": 0
                },
                {
                    "sent": "I guess the article mentioned something about the Manchester United being Red Devils or something.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so I really don't have time to talk about this, but OK, so we had six sort of categories of questions.",
                    "label": 0
                },
                {
                    "sent": "Where first of all, this poem exhibits a clear structure in terms of syllables and rhymes, the choice of word good.",
                    "label": 0
                },
                {
                    "sent": "The grammar is the problem.",
                    "label": 0
                },
                {
                    "sent": "Exhibits good grammatical structure.",
                    "label": 0
                },
                {
                    "sent": "The poem reflects.",
                    "label": 0
                },
                {
                    "sent": "Sorry there is some sort of unity between the form and the message, and then somehow it's on topic with the news article.",
                    "label": 0
                },
                {
                    "sent": "And Lastly, that is expressive and OK, so there's not much that we can sort of like conclude from this, but.",
                    "label": 0
                },
                {
                    "sent": "On all dimensions, the poem, which was generated with the loose with the least amount of constraints, did the worst.",
                    "label": 0
                },
                {
                    "sent": "And yeah, OK, I had one more point, but I'll have to skip that.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So can we see now?",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There is a web application up at this URL so it will as a link to the original news article and the poem that it generates and has social networking hooks built in.",
                    "label": 0
                },
                {
                    "sent": "You can like and tweet and share.",
                    "label": 0
                },
                {
                    "sent": "And yes there is a Twitter bot, but it's still a bit shy.",
                    "label": 0
                },
                {
                    "sent": "It's not really up and running just yet, but we've claimed handle and hopefully it will be being a bit.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More soon.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So yeah, so we've built a relatively knowledge poor system.",
                    "label": 0
                },
                {
                    "sent": "I would argue it's a topical poetry generation, and the evaluation indicates that people can detect the effects of applying these constraints or not.",
                    "label": 1
                },
                {
                    "sent": "Which, although not a huge finding, I think shows that was a step in the right.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Action, so thank you very much.",
                    "label": 1
                },
                {
                    "sent": "I guess the answer is probably no, but with the Turing test, did you ask the respondents whether their impression of the poem changed after they were told it was machine generated?",
                    "label": 0
                },
                {
                    "sent": "And if the answer is no, just think that impression would change with your impression change you think.",
                    "label": 0
                },
                {
                    "sent": "OK, the answer is no, because we actually didn't will mean and we didn't actually tell the answer.",
                    "label": 0
                },
                {
                    "sent": "We also didn't get there for the Turing test.",
                    "label": 0
                },
                {
                    "sent": "We didn't actually get their impression, we just asked him to annotate whether they thought it was manual machine.",
                    "label": 0
                },
                {
                    "sent": "I. I don't know.",
                    "label": 0
                },
                {
                    "sent": "I think that would probably be maybe a change.",
                    "label": 0
                },
                {
                    "sent": "It was interesting.",
                    "label": 0
                },
                {
                    "sent": "Yesterday, Michael suggested there might actually be a sort of positive bias towards artifacts that are generated.",
                    "label": 0
                },
                {
                    "sent": "Knowingly generated by computer.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "Maybe this is specific to the games community being very sort of accepting diverse but Twitch bus as well.",
                    "label": 0
                },
                {
                    "sent": "I think 20 parts of well received in the moment, right, right, right?",
                    "label": 0
                },
                {
                    "sent": "OK yeah.",
                    "label": 0
                },
                {
                    "sent": "But I mean my.",
                    "label": 0
                },
                {
                    "sent": "Guess instinct would be that people who sort of have a negative bias towards it, but I don't know.",
                    "label": 0
                },
                {
                    "sent": "Yeah, maybe will be more specific.",
                    "label": 0
                },
                {
                    "sent": "I mean he's talking about love and Red Devils and very human things.",
                    "label": 0
                },
                {
                    "sent": "I wonder whether that would change people's impressions more, knowing that the software is never loved and probably never will.",
                    "label": 0
                },
                {
                    "sent": "That we just have this hypothesis that that's actually turning star test like that are great for papers and and scientific progress, but actually emphasized the humanity gap that we have, right?",
                    "label": 0
                },
                {
                    "sent": "And can actually damaging.",
                    "label": 0
                },
                {
                    "sent": "Yeah no I agree.",
                    "label": 0
                },
                {
                    "sent": "Hi, I like the idea which has been echoed a few times of learning patterns from poems.",
                    "label": 0
                },
                {
                    "sent": "And then you talk about how you might tweak the poems in some way.",
                    "label": 0
                },
                {
                    "sent": "Do you think that computers can generate or develop their own Twitter aesthetic for tweeting the poems directly so that they're not learning from famous poets, but they're developing a new way of communicating poetry through Twitter, which is a challenge because of the size limits.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "OK, so I guess it depends on what you mean by sort of creating its own pattern.",
                    "label": 0
                },
                {
                    "sent": "So in this system we sort of manually sort of selected, but as we saw from the previous presentations and stuff that I have another student working on is that we can sort of automatically self extract these poems these patterns.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's challenging.",
                    "label": 0
                },
                {
                    "sent": "Doing poetry in Twitter.",
                    "label": 0
                },
                {
                    "sent": "This is host of John Rhe of Micro poetry sort of problems with only six words or how certain other constraints so.",
                    "label": 0
                },
                {
                    "sent": "I mean, that's sort of those sort of constraints aren't very sort of complex 2 to stage, so I guess sort of like in a sense it might actually be easier to sort of specify so.",
                    "label": 0
                },
                {
                    "sent": "But yeah, I don't know.",
                    "label": 0
                },
                {
                    "sent": "I would say this is possible because just to briefly state that one of the things that makes Twitter accounts Followable is that the author has a definite aesthetic that people like.",
                    "label": 0
                },
                {
                    "sent": "So maybe they're grumpy.",
                    "label": 0
                },
                {
                    "sent": "Or maybe there Nicholas Stick or their sarcastic.",
                    "label": 0
                },
                {
                    "sent": "And then the tweets all follow this.",
                    "label": 0
                },
                {
                    "sent": "Distinct personality rights might be worth pursuing OK?",
                    "label": 0
                },
                {
                    "sent": "OK, I think this session thanks a lot.",
                    "label": 0
                }
            ]
        }
    }
}