{
    "id": "concfzzkidgo5eoszubryjlwj4fel3na",
    "title": "The Internet of Education: what role for education research?",
    "info": {
        "author": [
            "Richard Noss, London Knowledge Lab"
        ],
        "published": "Dec. 10, 2013",
        "recorded": "November 2013",
        "category": [
            "Top->Computer Science->Internet, World Wide Web",
            "Top->Social Sciences->Education",
            "Top->Technology"
        ]
    },
    "url": "http://videolectures.net/internetofeducation2013_noss_education/",
    "segmentation": [
        [
            "Thank you everybody for inviting me.",
            "It's usually every speaker's nightmare to follow Ivan Rogers when she's just giving a talk, but on this occasion it's quite good because many of the things, probably all of the things I say will connect with what she's already given us."
        ],
        [
            "This is a statue of Ghandi which is just a few 100 meters from my office.",
            "And it commemorates his visit to England in 1946, just after the Second World War where he."
        ],
        [
            "Interviewed by the BBC and the BBC said to him, what do you think of Western civilization Mr Gandhi?",
            "And Ghandi said I think it would be a good idea.",
            "And."
        ],
        [
            "That's the question I really want to address.",
            "Is what do you think of technology in education?",
            "You can guess the punchline.",
            "Because although this is a character."
        ],
        [
            "Sure we have at the moment reached the stage where this has been."
        ],
        [
            "Replaced by this.",
            "And I really want to revisit the huge amount that we do know about how people learn, which is at least as important as understanding how to design technologies for learning.",
            "After all, if we design technologies for learning which.",
            "Do not take sufficient account of how people learn.",
            "They are doomed to failure."
        ],
        [
            "So I want to start.",
            "I hope you don't mind with a little history lesson and I want to center it around Seymour Papert who was a great who is a great thinker of our time in things about educational in things mathematical.",
            "He was a computer scientist when he was younger and he worked with Jean Piaget in Geneva.",
            "There aren't that many things that he hasn't done.",
            "And he has."
        ],
        [
            "Even us.",
            "50 years to think about what role technology might play in learning this is, I found a memo written in 1969.",
            "He says I want to print present a grander vision of an education system.",
            "In which technology is used not in the form of machines for processing children, but is something that child will learn to manipulate to extend, to apply to projects and get a greater and more articulate, more articulate mastery of the world.",
            "I'm sorry there's so much writing I looked to see what I could cut out from this quote, but every word is important, so I haven't cut anything out, and I apologize.",
            "Now it's important to understand that this is 50 years old.",
            "And you don't need me to tell you how much the world has changed in 50 years.",
            "You don't need me to tell you the speed of technological change that's happened since then, and yet, what this is about is about learning.",
            "It's about knowledge, at least as much as it's about technology.",
            "Some people where I work.",
            "Are fond of saying things like.",
            "It's not about technology, it's about learning.",
            "We have to understand education and learning.",
            "Technology will take care of itself, and I think that's wrong.",
            "I think there are very specific aspects of digital technology which could potentially change the face of what it means to learn and what it means to teach forever.",
            "But we're not taking sufficient account of them."
        ],
        [
            "Well, one of the great lessons that Poppet has given us is that if you want people to engage with learning, you have to give them tools to do that.",
            "And the best kind of tools you can give them are tools that allow them to express their ideas, even when those ideas are not fully formed an we have at our disposal.",
            "A terrific example of what it means to engage in a formal system that we have in our country in the United Kingdom not taken sufficient to counter.",
            "So most kids have an early introduction to what it means to engage in a formal system, which is when they learn to play games.",
            "And we have completely neglected the rich legacy of programming languages that have been designed.",
            "All surprisingly, actually based.",
            "Mostly anyway, on Lisp.",
            "But a whole succession of programming languages logo.",
            "Imagine netlogo, scratch.",
            "In which.",
            "The idea of building intellectual structures on the screen as a way to build an intellectual structure in your mind has become realized.",
            "I found out the other day that scratch, which was designed by Mitch Resnick at MIT and I don't intend this to become a talk about scratch.",
            "But if you don't know scratch, think about what it would be like to write a computer program using jigsaw pieces.",
            "So the syntactic difficulties of programming more or less go away.",
            "I just found out the other day that they now have 4 million uploads to the Scratch website.",
            "Many of those programs are not sophisticated, but they represent an individual, and I think the mode age of those individuals is about 13 years old.",
            "They represent people of that age writing computer programs, probably for the first time.",
            "And that kind of enthusiasm which is nearly nearly independent of what they get offered in schools and colleges.",
            "Is the kind of enthusiasm and engagement and interaction with a formal system that next happens to those kids in their mathematics classes, and we all know how successful mathematics classes tend to be."
        ],
        [
            "So Pop it's great vision was that we ought to try to build for learning the things that people are good at learning about.",
            "No child ever had to be put on a beach and had sand explained to her.",
            "Children instinctively know the kind of thing that sand is good for.",
            "It's true.",
            "Yeah, it's good idea to design tools like buckets and spades and castles and things.",
            "But I've never.",
            "I can't imagine that child would need to have it explained that if you pour the sand from here into here, then you can do a little experiment and so on.",
            "And Papa's vision was that if we want people to be good at learning, we had to take account of how they learn and the tools that they learn with.",
            "So how people learn is very simple.",
            "We all learn at a very young age that we do things outside of ourselves on tables and floors and with things in our hands, and so on.",
            "And in order to make sense of that, we build intellectual structures in our minds.",
            "And this is the quest that Papa has had for 50 years, and people who have followed him, including myself, have tried very hard to emulate.",
            "To try to design tools for learning which allow people to experiment to be playful with them, to do little explorations, to communicate with others.",
            "I didn't find a good enough picture with the kids collaborating with each other, but you've seen it on the beach enough.",
            "And in fact, the list of four things that now I'm going to get wrong that Yvonne talked about.",
            "I know playfulness was one of them, and collaboration with one of them, those elements of what Papa called constructionism the science of.",
            "Of.",
            "Teaching.",
            "That capitalizes on the way that human beings naturally think."
        ],
        [
            "So here are the elements I'm going to say a few things about each one first and you know this isn't so difficult to understand, but I everywhere I go, I find people who are surprised at the simplicity of this message.",
            "People learn best by making things and sharing them.",
            "So it makes a huge difference.",
            "You know the reason why Facebook is so incredibly successful.",
            "Is because you do stuff, but if you only did stuff it wouldn't be what it is.",
            "It's the act of sharing.",
            "Now you may say yeah, but who wants to know what you had for breakfast well?",
            "Don't blame me, blame Twitter for that.",
            "But but clearly, just writing down what you had for breakfast isn't exciting for many millions of people.",
            "And don't ask me why it is exciting to share the information about what you have for breakfast with other people.",
            "So making a public entity and sharing it is the first leg of."
        ],
        [
            "Constructionism is about.",
            "Again, this is not an incredibly surprising fact.",
            "It's incredibly surprising finding, but people learn best if they care about what they're learning.",
            "And most I think it's true that for most people, in most formal educational contexts, they don't know why they're learning what they're learning.",
            "And even worse, in a world where there is so much to learn, people are learning less and less about that world that they live in.",
            "I'll say more about that later."
        ],
        [
            "And Thirdly, and this is what I'm going to really concentrate on for the rest of this talk.",
            "Let's not only make new ways to learn, let's make new things for learning.",
            "Let's understand that the choice of subjects and topics that determine our formal curriculum come from an age before digital technology.",
            "The decisions that we made.",
            "That have determined what we have to learn and why we have to learn it.",
            "Are decisions that were made before we had computers.",
            "And the computer could change everything, not to let it change things is a waste of our energy and a waste of potential.",
            "And if you think about everything else in our world, that's changed.",
            "Everything architecture medicine, I mean the list is just infinitely long.",
            "Has been completely transformed by the presence of technology, not just doing things better that we always wanted to do, but doing completely new things.",
            "But there is 1 area in which which clearly stands out.",
            "As not being like that is not having been radically transformed by the presence of digital technology and that's teaching.",
            "And in my view, that's a complete."
        ],
        [
            "Tragedy.",
            "So people learn."
        ],
        [
            "By making things and sharing them.",
            "So this is a newspaper article.",
            "About Salman Khan.",
            "You know Khan Academy.",
            "So.",
            "If I want to be unkind to Khan Academy, which by the way has some great little videos of com doing some great things.",
            "If I wanted to be unkind, I'd say he's doing a fantastic job at doing the same old thing that we always wanted to do.",
            "But to more people more effectively in a way that can be distributed very easily.",
            "And the interviewer finds him.",
            "Very vocal on the question of constructionism, he says Isaac Newton would not have invented calculus had he not had textbooks on algebra.",
            "This is.",
            "By the way, this is not quite true.",
            "But this is what Khan says.",
            "So what he's doing is he's misunderstanding, and I think it's a very common misperception that people have.",
            "Is that when Papa says build things for yourself in order to try to build intellectual structures?",
            "That puppet is saying discover everything for yourself.",
            "You have to recreate history and he has not said that and he's never said that.",
            "And that's completely crazy thing to imagine.",
            "But it points to an example of where it's very easy to misunderstand what this debate is really about.",
            "It's not about.",
            "Being told versus discovering.",
            "It's about building things for yourself in your own mind, and we all know that it is possible.",
            "To sit in a lecture for 3/4 of an hour.",
            "And take something very important away from it.",
            "But we also know that if the only thing you do is sit in a lecture for 3/4 of an hour and never reconsider what you've been, what you've heard that you really don't take much away from it."
        ],
        [
            "Bill Gates, by the way.",
            "Is even more scathing on the question of constructionism.",
            "It's bullshit, he says he's a man of great understatement.",
            "If you can't do multiplication, then tell me what is your contribution to society going to be.",
            "I don't know.",
            "Actually, I can imagine that.",
            "It's possible to be a great violinist without doing multiplication, so I I'm not sure what this means, but again, you see it's a debate about facts versus building intellectual elements in your mind, and that's a false dichotomy."
        ],
        [
            "And it really points up something very important.",
            "I think about technology in the way technology is considered.",
            "It starts with an unfortunate accident that happened in the middle of the last century, which is the used by great computer scientists of the time of the word information to mean something very specific, different from the word information in everyday speech.",
            "So this is a technical meaning of the word information about sending messages down noisy lines and so on.",
            "The details don't matter, but it did not mean when they coined the phrase information technology it did not mean passing on information.",
            "But of course, the way that it's come down."
        ],
        [
            "Thus now.",
            "Is that it means?",
            "Peep"
        ],
        [
            "Talk about information technology and I guarantee to you if you go out into the street and do a little research project with a microphone and a tape recorder.",
            "99 point something percent of people you meet will say yes.",
            "Information technology in schools and colleges is about information.",
            "Facts.",
            "Now, before anybody attacks me for saying.",
            "I don't care about facts.",
            "I was a mathematician.",
            "I care a lot about facts, but I know that some of the most important things that I know about mathematics are not factual at all.",
            "They're about constructions that I finally managed to make that others before me had helped me to make.",
            "So I think we've got this balance wrong and and by the way, in England we have this horrible phrase ICT information and communication technology.",
            "But it really underlines it.",
            "You know, it really underlines that the I means facts.",
            "So let me get it clear.",
            "Yes, of course information digital technology is a fantastic medium for passing information between human beings.",
            "And between machines.",
            "But there's more to learning than just facts.",
            "There's something else, and that can only be constructed in the mind with appropriate tools."
        ],
        [
            "Well, people learn well if they care."
        ],
        [
            "About what they're learning, this is a picture I took of two kids in Thailand doing an impossibly complex task.",
            "If I told you that they were looking to see how climate change affects the water table on a Hill.",
            "You wouldn't believe it, but if I told you that it's climate change in their village.",
            "Connected to the water table above their village.",
            "On a path that they take to school every day using this is the little.",
            "One laptop per child computers.",
            "And one of the things I like about the picture is.",
            "Apart from the incredible sense of engagement, look at the little girls face.",
            "You probably can't see it very well, but just the fact that the boy is holding a computer in his hand.",
            "Well, I mean, you could probably has a pencil in his pocket.",
            "And a piece of paper in his other pocket, and a computer in his hand.",
            "It's just seamlessly working.",
            "On this project so people can do surprising things if it's contextualized in a subject in a context that they care about."
        ],
        [
            "Unfortunately, that is becoming more and more difficult because there's this amazingly tricky paradox.",
            "The world is becoming more and more digitized.",
            "And therefore potentially there's more and more to know and more appropriate ways of getting hold of that knowledge.",
            "But that knowledge is becoming less and less visible.",
            "It's harder and harder without the right tools."
        ],
        [
            "To see what it is that powers the world, systems are increasingly read only.",
            "There's no way into them.",
            "And this is really one of the major challenges for education to try to find ways to open up the systems that surround us that everybody cares about.",
            "Everybody loves the music on their iPhone.",
            "Everybody loves the way that technology can share photographs and video and all those things.",
            "And everybody takes for granted things like how Google does searches, but the mechanism by which this happens.",
            "Is opaque to the user an from an educational point of view, finding ways to open up those systems.",
            "Is a real challenge.",
            "And the final thing that I want to spend a little bit more time on is making news."
        ],
        [
            "Things for learning.",
            "I want you."
        ],
        [
            "2.",
            "Do a thought experiment.",
            "And do this simple multiplication in Roman numerals.",
            "Now you're not allowed.",
            "To translate the Roman numerals into Arabic numerals, and then do it and then pretend to me that you did a moment.",
            "You can't do it.",
            "You can't do it because.",
            "The technology of Roman number system was not designed for calculation.",
            "It was designed for labeling as saying, there are six battalions.",
            "Of soldiers not to do calculations of how many times, how many soldiers you have.",
            "If you have six battalions of 237 people or something.",
            "But just imagine.",
            "That we live at a time before Arabic numerals were created.",
            "Then what would the mathematics educators of the time say to each other?",
            "They'd say, you know, children get very confused about our number system.",
            "They can't even multiply Ivy by CX XV11.",
            "Yes, as the other math educated times are really full and this is this is the trouble with education.",
            "Things aren't what they used to be.",
            "And they probably do little experiments to show that IX is very easy to confuse with XI.",
            "And they probably have Pisa tests to see which Roman Em which part of the Roman Empire would do best at this cut these kind of calculations and then one day just imagine.",
            "Imagine that along comes somebody from what is now probably Saudi Arabia and says I have a better way to do this.",
            "And introduces the Arabic number system that we all use today suddenly.",
            "Millions of people who couldn't do this.",
            "Some would be able to do it.",
            "Why?",
            "Because the representational structure infrastructure with which this idea is expressed would be fundamentally different, and it would allow access to an idea which probably was only the possibility for a very few people to be possible for everyone.",
            "Now I think, forgive me.",
            "By the way, I want to thank everyone.",
            "Lenski and Seymour Papert for this example, which I heard at a conference a couple of years ago.",
            "It's a great example because I think the computer.",
            "At least.",
            "Potentially has in its power.",
            "The potential to really radically give us a new way of representing knowledge.",
            "And that means in a way we have to invent new representations.",
            "Isn't any good anymore to just strive to do better?",
            "What we always did?",
            "Why don't we use the technology in the way that the Arab math Educator tried to use it and say, look if you think about your system completely differently, you represent your numbers in a different way.",
            "Suddenly people can do things that they couldn't do before they can think about things that were unthinkable before."
        ],
        [
            "So that there's the challenge to build new representations for existing knowledge."
        ],
        [
            "In other words, education must not be read only."
        ],
        [
            "OK, here's what happens if you allow education to be read only.",
            "This is Goldman Sachs investment bank.",
            "And it happens a year after the banking crisis of when was it 2007?",
            "8.",
            "You probably hasn't got here yet, you're lucky.",
            "Anne, somebody was telling me last night that it doesn't doesn't really affect Slovenia where you're very fortunate.",
            "I don't believe it, by the way.",
            "I'm."
        ],
        [
            "So the Chief financial officer.",
            "Was interviewed in the Financial Times, London Financial Times.",
            "He said we were seeing things that were 25 standard deviation moves several days in a row.",
            "This is the Chief financial officer."
        ],
        [
            "Now I'm sure I don't have to tell you what 25 standard deviations means.",
            "It means that.",
            "Somewhere roughly where that building is on this graph.",
            "And.",
            "The probability of that occurring is an interesting number.",
            "Luckily I have a son who works for the Bank of England and he did this calculation for me 'cause you need quite a lot of decimal points.",
            "Would you like to guess roughly how long it would take for three events of this kind to take place three days in a row?"
        ],
        [
            "The answer is it 6 * 10 to the power of 120.",
            "Four times the life of the universe.",
            "Now you might think my friend here that the Chief Executive Chief Financial Officer of Goldman Sachs would say to himself with a figure like this.",
            "Maybe I have the wrong model.",
            "And maybe he did say that because I have no inside information, I never met this man and probably I'm being unfair to him.",
            "Maybe of course this was a journalistic error and not him at all.",
            "So apologies if you're there.",
            "Probably is recording this talk now.",
            "But it points in the direction that I want to go here, which is.",
            "Here's a model.",
            "And we've emphasized the output of models at the expense of really understanding that building models and are even just asking the question what is the model you're using for this piece of information?",
            "I think this is probably the most important thing we can give children in the 21st century.",
            "I don't care.",
            "If they can't build a computer program.",
            "That would calculate a number like this, but I do care.",
            "Very much that we educate our children to say.",
            "What are the important variables here?",
            "What are the important parameters here?",
            "How do they hook up with each other?",
            "Give me some idea of how you're doing this.",
            "I don't want to see any numbers.",
            "I don't want to see any details, but I do understand that the world works in models that computers have to have programs that programs are modeling reality in some way, well or badly.",
            "And in my country at least, we've done an incredibly bad job at doing that.",
            "And it's something we have to address."
        ],
        [
            "Oh, I'm not sure three days in a row is whether this number is 3 days in a row or just once.",
            "I'm sure you'll appreciate that there's not much difference, really."
        ],
        [
            "So I'm going to say something negative.",
            "About the things written in the on the website of this conference, forgive me because there's a lot to say that's positive and it's a wonderful initiative, but I'm going to just say something about the negative side, the new trends, Moocs, higher education policies.",
            "HCI machine learning.",
            "User analytics automatic assessment and visualization.",
            "Now let me get on record.",
            "These are powerful ways in which technology can help learning.",
            "I agree.",
            "But I want to say that unless they really take account of what we know about educational research, they will in fact come and go.",
            "I've lost track of the number of people who tell me rubbing their hands together with excitement at what their latest learning analytic technique will allow them to collect fantastic new every little iron movement, every little finger push.",
            "And then I say, and that's great.",
            "That's really fantastic.",
            "And what will you learn?",
            "Doing that and they say, well, that's not my problem.",
            "That's your problem, that's my problem.",
            "Now of course, knowing more about the interaction experience of people ought to help us to understand more about learning.",
            "But it won't do it automatically.",
            "And there's another thing I just want to say.",
            "Well, I'm dwelling on the negative and then I'll get back to being positive.",
            "See I don't know how many people here remember very few actually looking at you and how awfully young you are.",
            "But you remember that when there was a time when car indicators before we had flashing lights.",
            "Remember they used to have little art.",
            "Yeah, you remember?",
            "Gosh you, you're nearly Maeve.",
            "OK, and you know it's a natural thing to do.",
            "How did we use?",
            "Not we.",
            "I'm not that old.",
            "How did people used to indicate that they were turning around the corner?",
            "They put their arm out the window because there weren't any windows.",
            "And so you build a car.",
            "You have this great idea of a technology that can replace your hand.",
            "What do you do?",
            "You build an artificial arm.",
            "And I think that's where we are at the moment with MC Smook.",
            "So fantastically new.",
            "They're all different from each other.",
            "Some have more affordances than others.",
            "I understand completely that we're in the infancy of Moocs, but we don't have to recapitulate history.",
            "Some of the books that I see really are pretty standard things, except that they're supposed to be massive.",
            "And some of the books are not massive actually, they massive at the beginning and by the time you get to the end, they're actually looks little online.",
            "Whatever the other is, what does the open?",
            "So.",
            "I'm not arguing, please don't misunderstand me.",
            "I'm the last person to argue against using technology.",
            "I want to use technology in mindful ways that take account of what we know about how people learn, by the way.",
            "Did a few weeks after the iPad was invented or was presented by Steve Jobs."
        ],
        [
            "I had a look on the web to see what to see if I could find the first maths app for the iPad and here it is.",
            "You can workout what 86 + 49 is.",
            "And if you get it wrong, it says wrong.",
            "At the time we were all in.",
            "Now we take it for granted everybody has a tablet in the handbag or somewhere, but it is a beautiful technology.",
            "Quite a change, quite a potentially changing technology and learning how to add up to numbers and being told helpfully that you're wrong, really.",
            "I don't think sums up the potential of that technology."
        ],
        [
            "I'm going to just.",
            "I've got about 2020 minutes.",
            "I'm going to just very quickly share with you.",
            "Not the results of a very large program of research in the UK.",
            "That's just come to an end.",
            "I'm not going to share with you the results, but I'm just going to point you in the direction of what those projects were about in case you want to follow them up.",
            "Obviously the URL is at the top of the page, so I'm going to do in 5 minutes.",
            "What really could be several hours of a talk?"
        ],
        [
            "The first is that there was some very interesting research looking to see how the technology that people have in their pocket could be used for developing scientific inquiry.",
            "In 1985 I went to a conference of mathematics teachers where there was a debate and debate.",
            "The debate was will there ever be a time when a school could have 10 electronic calculators?",
            "And the general answer, by the way, was no.",
            "They're too expensive."
        ],
        [
            "There are things that we do now we take for granted in terms of collaboration.",
            "That really are have changed what it means to collaborate.",
            "I think Yvonne's talk was, I thought, the example of the Australian elderly people holding onto each other in order to make a circuit was a wonderful example of that.",
            "We don't only have to use the technology to collaborate, collaborate in the old way.",
            "There are new ways to collaborate and those new ways to collaborate will bring about changes in knowledge."
        ],
        [
            "We all know that the keyboard is probably coming to an end, at least in its Hamonic form, where everything is a keyboard interaction.",
            "It's not completely clear.",
            "I certainly don't know about you, but I didn't predict that using your finger on a screen everywhere.",
            "Would become so ubiquitous and work as well as it does.",
            "Once you a bit sceptical when you folks all your first touch screen your fingers too big, I will leave on your just your romantic.",
            "So there's a project, a wonderful project on that."
        ],
        [
            "Team that you might be interested to see and the semantic web is an interesting development.",
            "From my point of view, the most interesting thing about it is that it begins to blur.",
            "Potentially this dichotomy between information and construction.",
            "The informational role of technology and the constructive role of technology, and if some of the semantic web experts in the world could find a way to open the address that dichotomy, that would, I think, be."
        ],
        [
            "Very helpful.",
            "Two projects that I just want to spend a few seconds longer on.",
            "One is about."
        ],
        [
            "Teachers and I don't.",
            "I can't do a research project on how what percentage of papers about educational technology are aimed directly at students, but it must be in the 90s.",
            "I wouldn't be surprised if it's 95 or 96% of Journal articles about learning and teaching with technology.",
            "I aimed directly at students, and perhaps that's how it should be.",
            "But technology replacing teachers will not happen in our lifetime.",
            "I don't rule it out, but we won't.",
            "None of us will be here to see it.",
            "And addressing technology for teachers are saying to teachers you need powerful tools for teaching in the same way as architects need powerful tools for building and doctors need powerful tools to do medicine and so on.",
            "The list is endless.",
            "Is a very important aspect which I think has been under theorised in the literature.",
            "I don't see that many.",
            "Innovative technological tools being aimed at teachers, distinctly so that's one project you might be interested in looking at."
        ],
        [
            "And finally.",
            "We have a lot of people in our education system who for different reasons at different times, are underprivileged, excluded and so on.",
            "This happens to be a project."
        ],
        [
            "About autistic children.",
            "I was told by the director of this project the other day that something like in a class of 30 children, the probability is that two will be suffering from autism in some respect, so this is not an insignificant number of people.",
            "And what's nice about this project is that it's using a technology to catalyze communication between people.",
            "I'm suppressing all details.",
            "But by interacting with an intelligent agent on the screen, who can see where the child is looking where he or she is directing his gaze?",
            "That the computer will catalyze what it means to collaborate with other human beings, and there are some interesting outcomes, although nothing conclusive."
        ],
        [
            "I'm afraid.",
            "So I'm coming towards the end of my talk and I'm at this point.",
            "I'm not sure how far I'll get and I have some escape buttons on my slides to jump to various different places.",
            "So."
        ],
        [
            "Here is a message that I'd be happy if it's the only message you take with you.",
            "If we're thinking about.",
            "Making new kinds of things to learn.",
            "Making new things that are learnable.",
            "More learnable than they were before learnable means learnable for the individual and more learnable by people in general.",
            "Some ideas are effectively unlearnable by most people because of the way they represented.",
            "And mathematics is a great example of this, actually.",
            "That mathematics happens in the head.",
            "It really doesn't happen on paper.",
            "And we expect people to do mathematics with without anything to help them.",
            "It has to happen in the head.",
            "It doesn't happen anywhere else, so it's like learning to play the piano without a piano.",
            "Now it can be done.",
            "There are some people who are incredibly gifted.",
            "We all know about Mozart and so on.",
            "And these people are successful just like there are some people called mathematicians who are successful at mathematics.",
            "But I'm sure that the reason why most people find mathematics so difficult is because they're being asked to play the music of mathematics without a mathematical instrument.",
            "It's really as simple as that is like playing a game of virtual reality.",
            "No, it's I tell you what it's like.",
            "It's like playing 12 games of chess with blindfold on.",
            "We know it can be done.",
            "But to ask everybody to do it.",
            "Is."
        ],
        [
            "A lot, so here's an example that I want to use to indicate this.",
            "This is a flock of birds.",
            "This is quite a low resolution screen.",
            "I'm sorry, but I promise you on my screen you can see these blobs of birds.",
            "And.",
            "There cannot be anybody who's ever seen this happen.",
            "Who has not asked themselves?",
            "How does the flock know where to go?",
            "And.",
            "You're very privileged because I'm going to show you the answer to that question.",
            "So I hope everybody has a notebook ready.",
            "This is."
        ],
        [
            "Answer.",
            "This is the triple integral equation.",
            "Which conclusively shows and it is true.",
            "By the way there in there somewhere is in the equation that tells you what you want to know now.",
            "I want to use this flock of birds as an exemplar of something much more general.",
            "I don't care if people know about blocking birds.",
            "But I do care that people look at the real world that they live in and say that's amazing.",
            "What can I learn about how that works?",
            "And until we had digital technologies, it was impossible.",
            "Well, not impossible.",
            "There must be somebody who somebody wrote this paper, and I presume they understand what it means.",
            "But I have some background in mathematics and I cannot tell you what the hell any of it means.",
            "I'm.",
            "Well."
        ],
        [
            "The answer is simply to write a program which is now not going to work conveniently.",
            "So I rise a program.",
            "Now the program that makes this work is 2 lines long.",
            "There's a lot of graphical stuff that has to be done.",
            "But I'm playing with the number of birds in the population.",
            "Yeah, you can see I set it up.",
            "The birds start moving.",
            "I do lots of experimentation.",
            "I press go.",
            "They're starting to go in the same direction.",
            "They're starting to clump together.",
            "Do you see how the clumping together and before you know it?",
            "They're all going in the same direction.",
            "Now.",
            "It's important to me because I care about children learning to program that the program.",
            "This is not only just a simulation, it's a program simulation where the end user can do the programming.",
            "What is this software?",
            "How does it work?",
            "What's the program?",
            "I'm not telling you anything.",
            "Remember what I'm trying to do here to give you an exemplar of a much more general phenomenon.",
            "That the technology allows you to learn things, not everything.",
            "You still won't know the triple integral.",
            "But it learns it allows you to engage with phenomenon that are unengaged, able.",
            "Without it."
        ],
        [
            "So.",
            "Here are two challenges.",
            "The one is to build learning technologies."
        ],
        [
            "And the other is to build learning curricula.",
            "Ask yourself what is it that determines the tiny little slices of material that we teach people?",
            "How do we know this sequence of of learning always works and I'll give you my example, which is why the car is there.",
            "We always teach kids.",
            "Forgive me if my examples are often physics and maths, but it's best to talk about something you know a little bit about.",
            "Why do we teach kids about statics?",
            "OK, well there's a force going down.",
            "There's a force going up.",
            "The thing doesn't move, that's nice.",
            "Then we teach them about constant velocity.",
            "And then finally, if they're lucky and there's still at school and they're still doing maths and physics, we teach them about acceleration.",
            "Why do we choose that particular?",
            "Linear form and why do we expect in the Pisa tests we follow the same line.",
            "And the answer is, if you don't have technology.",
            "Acceleration is quite difficult.",
            "It's the second derivative and you have to understand about changing what velocity is and so on.",
            "And why is it that something going round and round on the end of a string shortly?",
            "That's going at a constant speed?",
            "Isn't that the same as constant, but there all sorts of difficult questions that have to be asked, but consider this.",
            "Nobody ever experienced well.",
            "I mean, I'm experienced seeing as a static object I'm experiencing the force pulling me down to the center of the Earth and the Earth and the floor pushing me back up, but nothing's happening.",
            "I can't touch it, I can't feel it.",
            "And the same with constant velocity.",
            "How do you know when you're traveling at a constant velocity?",
            "Because it feels exactly the same as standing still.",
            "That's the whole point of constant velocity.",
            "The one thing that you can touch and feel is what it feels like in a car going around the corner.",
            "So if you wanted to ask me what does my math curriculum look like, I would start with acceleration.",
            "I would build a model.",
            "I would ask the kids to build a video game where somebody throws something across the screen and try and make the movement of that object as true as possible to water.",
            "Real object would look like probably the kids would start by drawing a straight line, but we know that that's not what happens.",
            "Maybe they try a little piece of a circle which if you try it, it looks pretty good, but it's very clear that it's not right.",
            "Why don't we start?",
            "Why didn't the designers of math curricula start with acceleration, which we can feel and touch instead of starting with something that we can't feel in touch?",
            "Answer.",
            "Because unless you have digital technology, it's really out of your reach.",
            "But now with digital technology, we have this opportunity to switch round the things that we cherish and love and believe their natural phenomena.",
            "Or you can't learn velocity without learning statics.",
            "You can't learn acceleration without learning.",
            "Velocity might not be true.",
            "And if it might not be true in that one example, maybe there are a huge number of ways in which we can change the curriculum to make it more learnable."
        ],
        [
            "So I think I'm going to leave you with this slide there.",
            "I have about 30 more that I'm not going to get to.",
            "We are in our what we call in English the comfort zone.",
            "We teach people what we think is learnable, but we make the mistake of forgetting the tools that are at our disposal.",
            "I would like to ask us if we are interested in education to make an occasional voyage onto the unlearnable side of this mountain.",
            "To say what is it possible for people to understand with digital technologies that before they were stuck on this side of the mountain of the Valley, let's cross the Valley together and see what people can learn.",
            "I think will be surprised.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you everybody for inviting me.",
                    "label": 0
                },
                {
                    "sent": "It's usually every speaker's nightmare to follow Ivan Rogers when she's just giving a talk, but on this occasion it's quite good because many of the things, probably all of the things I say will connect with what she's already given us.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a statue of Ghandi which is just a few 100 meters from my office.",
                    "label": 0
                },
                {
                    "sent": "And it commemorates his visit to England in 1946, just after the Second World War where he.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Interviewed by the BBC and the BBC said to him, what do you think of Western civilization Mr Gandhi?",
                    "label": 0
                },
                {
                    "sent": "And Ghandi said I think it would be a good idea.",
                    "label": 1
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's the question I really want to address.",
                    "label": 0
                },
                {
                    "sent": "Is what do you think of technology in education?",
                    "label": 1
                },
                {
                    "sent": "You can guess the punchline.",
                    "label": 0
                },
                {
                    "sent": "Because although this is a character.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sure we have at the moment reached the stage where this has been.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Replaced by this.",
                    "label": 0
                },
                {
                    "sent": "And I really want to revisit the huge amount that we do know about how people learn, which is at least as important as understanding how to design technologies for learning.",
                    "label": 0
                },
                {
                    "sent": "After all, if we design technologies for learning which.",
                    "label": 0
                },
                {
                    "sent": "Do not take sufficient account of how people learn.",
                    "label": 0
                },
                {
                    "sent": "They are doomed to failure.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I want to start.",
                    "label": 0
                },
                {
                    "sent": "I hope you don't mind with a little history lesson and I want to center it around Seymour Papert who was a great who is a great thinker of our time in things about educational in things mathematical.",
                    "label": 0
                },
                {
                    "sent": "He was a computer scientist when he was younger and he worked with Jean Piaget in Geneva.",
                    "label": 0
                },
                {
                    "sent": "There aren't that many things that he hasn't done.",
                    "label": 0
                },
                {
                    "sent": "And he has.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Even us.",
                    "label": 0
                },
                {
                    "sent": "50 years to think about what role technology might play in learning this is, I found a memo written in 1969.",
                    "label": 0
                },
                {
                    "sent": "He says I want to print present a grander vision of an education system.",
                    "label": 0
                },
                {
                    "sent": "In which technology is used not in the form of machines for processing children, but is something that child will learn to manipulate to extend, to apply to projects and get a greater and more articulate, more articulate mastery of the world.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry there's so much writing I looked to see what I could cut out from this quote, but every word is important, so I haven't cut anything out, and I apologize.",
                    "label": 0
                },
                {
                    "sent": "Now it's important to understand that this is 50 years old.",
                    "label": 0
                },
                {
                    "sent": "And you don't need me to tell you how much the world has changed in 50 years.",
                    "label": 0
                },
                {
                    "sent": "You don't need me to tell you the speed of technological change that's happened since then, and yet, what this is about is about learning.",
                    "label": 0
                },
                {
                    "sent": "It's about knowledge, at least as much as it's about technology.",
                    "label": 0
                },
                {
                    "sent": "Some people where I work.",
                    "label": 0
                },
                {
                    "sent": "Are fond of saying things like.",
                    "label": 0
                },
                {
                    "sent": "It's not about technology, it's about learning.",
                    "label": 0
                },
                {
                    "sent": "We have to understand education and learning.",
                    "label": 0
                },
                {
                    "sent": "Technology will take care of itself, and I think that's wrong.",
                    "label": 0
                },
                {
                    "sent": "I think there are very specific aspects of digital technology which could potentially change the face of what it means to learn and what it means to teach forever.",
                    "label": 0
                },
                {
                    "sent": "But we're not taking sufficient account of them.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, one of the great lessons that Poppet has given us is that if you want people to engage with learning, you have to give them tools to do that.",
                    "label": 0
                },
                {
                    "sent": "And the best kind of tools you can give them are tools that allow them to express their ideas, even when those ideas are not fully formed an we have at our disposal.",
                    "label": 0
                },
                {
                    "sent": "A terrific example of what it means to engage in a formal system that we have in our country in the United Kingdom not taken sufficient to counter.",
                    "label": 0
                },
                {
                    "sent": "So most kids have an early introduction to what it means to engage in a formal system, which is when they learn to play games.",
                    "label": 0
                },
                {
                    "sent": "And we have completely neglected the rich legacy of programming languages that have been designed.",
                    "label": 0
                },
                {
                    "sent": "All surprisingly, actually based.",
                    "label": 0
                },
                {
                    "sent": "Mostly anyway, on Lisp.",
                    "label": 0
                },
                {
                    "sent": "But a whole succession of programming languages logo.",
                    "label": 0
                },
                {
                    "sent": "Imagine netlogo, scratch.",
                    "label": 0
                },
                {
                    "sent": "In which.",
                    "label": 0
                },
                {
                    "sent": "The idea of building intellectual structures on the screen as a way to build an intellectual structure in your mind has become realized.",
                    "label": 0
                },
                {
                    "sent": "I found out the other day that scratch, which was designed by Mitch Resnick at MIT and I don't intend this to become a talk about scratch.",
                    "label": 0
                },
                {
                    "sent": "But if you don't know scratch, think about what it would be like to write a computer program using jigsaw pieces.",
                    "label": 0
                },
                {
                    "sent": "So the syntactic difficulties of programming more or less go away.",
                    "label": 0
                },
                {
                    "sent": "I just found out the other day that they now have 4 million uploads to the Scratch website.",
                    "label": 0
                },
                {
                    "sent": "Many of those programs are not sophisticated, but they represent an individual, and I think the mode age of those individuals is about 13 years old.",
                    "label": 0
                },
                {
                    "sent": "They represent people of that age writing computer programs, probably for the first time.",
                    "label": 0
                },
                {
                    "sent": "And that kind of enthusiasm which is nearly nearly independent of what they get offered in schools and colleges.",
                    "label": 0
                },
                {
                    "sent": "Is the kind of enthusiasm and engagement and interaction with a formal system that next happens to those kids in their mathematics classes, and we all know how successful mathematics classes tend to be.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So Pop it's great vision was that we ought to try to build for learning the things that people are good at learning about.",
                    "label": 0
                },
                {
                    "sent": "No child ever had to be put on a beach and had sand explained to her.",
                    "label": 0
                },
                {
                    "sent": "Children instinctively know the kind of thing that sand is good for.",
                    "label": 0
                },
                {
                    "sent": "It's true.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's good idea to design tools like buckets and spades and castles and things.",
                    "label": 0
                },
                {
                    "sent": "But I've never.",
                    "label": 0
                },
                {
                    "sent": "I can't imagine that child would need to have it explained that if you pour the sand from here into here, then you can do a little experiment and so on.",
                    "label": 0
                },
                {
                    "sent": "And Papa's vision was that if we want people to be good at learning, we had to take account of how they learn and the tools that they learn with.",
                    "label": 0
                },
                {
                    "sent": "So how people learn is very simple.",
                    "label": 0
                },
                {
                    "sent": "We all learn at a very young age that we do things outside of ourselves on tables and floors and with things in our hands, and so on.",
                    "label": 0
                },
                {
                    "sent": "And in order to make sense of that, we build intellectual structures in our minds.",
                    "label": 0
                },
                {
                    "sent": "And this is the quest that Papa has had for 50 years, and people who have followed him, including myself, have tried very hard to emulate.",
                    "label": 0
                },
                {
                    "sent": "To try to design tools for learning which allow people to experiment to be playful with them, to do little explorations, to communicate with others.",
                    "label": 0
                },
                {
                    "sent": "I didn't find a good enough picture with the kids collaborating with each other, but you've seen it on the beach enough.",
                    "label": 0
                },
                {
                    "sent": "And in fact, the list of four things that now I'm going to get wrong that Yvonne talked about.",
                    "label": 0
                },
                {
                    "sent": "I know playfulness was one of them, and collaboration with one of them, those elements of what Papa called constructionism the science of.",
                    "label": 0
                },
                {
                    "sent": "Of.",
                    "label": 0
                },
                {
                    "sent": "Teaching.",
                    "label": 0
                },
                {
                    "sent": "That capitalizes on the way that human beings naturally think.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here are the elements I'm going to say a few things about each one first and you know this isn't so difficult to understand, but I everywhere I go, I find people who are surprised at the simplicity of this message.",
                    "label": 0
                },
                {
                    "sent": "People learn best by making things and sharing them.",
                    "label": 1
                },
                {
                    "sent": "So it makes a huge difference.",
                    "label": 0
                },
                {
                    "sent": "You know the reason why Facebook is so incredibly successful.",
                    "label": 0
                },
                {
                    "sent": "Is because you do stuff, but if you only did stuff it wouldn't be what it is.",
                    "label": 0
                },
                {
                    "sent": "It's the act of sharing.",
                    "label": 0
                },
                {
                    "sent": "Now you may say yeah, but who wants to know what you had for breakfast well?",
                    "label": 0
                },
                {
                    "sent": "Don't blame me, blame Twitter for that.",
                    "label": 0
                },
                {
                    "sent": "But but clearly, just writing down what you had for breakfast isn't exciting for many millions of people.",
                    "label": 0
                },
                {
                    "sent": "And don't ask me why it is exciting to share the information about what you have for breakfast with other people.",
                    "label": 0
                },
                {
                    "sent": "So making a public entity and sharing it is the first leg of.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Constructionism is about.",
                    "label": 0
                },
                {
                    "sent": "Again, this is not an incredibly surprising fact.",
                    "label": 0
                },
                {
                    "sent": "It's incredibly surprising finding, but people learn best if they care about what they're learning.",
                    "label": 1
                },
                {
                    "sent": "And most I think it's true that for most people, in most formal educational contexts, they don't know why they're learning what they're learning.",
                    "label": 0
                },
                {
                    "sent": "And even worse, in a world where there is so much to learn, people are learning less and less about that world that they live in.",
                    "label": 0
                },
                {
                    "sent": "I'll say more about that later.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And Thirdly, and this is what I'm going to really concentrate on for the rest of this talk.",
                    "label": 0
                },
                {
                    "sent": "Let's not only make new ways to learn, let's make new things for learning.",
                    "label": 1
                },
                {
                    "sent": "Let's understand that the choice of subjects and topics that determine our formal curriculum come from an age before digital technology.",
                    "label": 0
                },
                {
                    "sent": "The decisions that we made.",
                    "label": 0
                },
                {
                    "sent": "That have determined what we have to learn and why we have to learn it.",
                    "label": 0
                },
                {
                    "sent": "Are decisions that were made before we had computers.",
                    "label": 0
                },
                {
                    "sent": "And the computer could change everything, not to let it change things is a waste of our energy and a waste of potential.",
                    "label": 0
                },
                {
                    "sent": "And if you think about everything else in our world, that's changed.",
                    "label": 0
                },
                {
                    "sent": "Everything architecture medicine, I mean the list is just infinitely long.",
                    "label": 0
                },
                {
                    "sent": "Has been completely transformed by the presence of technology, not just doing things better that we always wanted to do, but doing completely new things.",
                    "label": 0
                },
                {
                    "sent": "But there is 1 area in which which clearly stands out.",
                    "label": 0
                },
                {
                    "sent": "As not being like that is not having been radically transformed by the presence of digital technology and that's teaching.",
                    "label": 0
                },
                {
                    "sent": "And in my view, that's a complete.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tragedy.",
                    "label": 0
                },
                {
                    "sent": "So people learn.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "By making things and sharing them.",
                    "label": 0
                },
                {
                    "sent": "So this is a newspaper article.",
                    "label": 0
                },
                {
                    "sent": "About Salman Khan.",
                    "label": 0
                },
                {
                    "sent": "You know Khan Academy.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "If I want to be unkind to Khan Academy, which by the way has some great little videos of com doing some great things.",
                    "label": 0
                },
                {
                    "sent": "If I wanted to be unkind, I'd say he's doing a fantastic job at doing the same old thing that we always wanted to do.",
                    "label": 0
                },
                {
                    "sent": "But to more people more effectively in a way that can be distributed very easily.",
                    "label": 0
                },
                {
                    "sent": "And the interviewer finds him.",
                    "label": 0
                },
                {
                    "sent": "Very vocal on the question of constructionism, he says Isaac Newton would not have invented calculus had he not had textbooks on algebra.",
                    "label": 1
                },
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "By the way, this is not quite true.",
                    "label": 0
                },
                {
                    "sent": "But this is what Khan says.",
                    "label": 0
                },
                {
                    "sent": "So what he's doing is he's misunderstanding, and I think it's a very common misperception that people have.",
                    "label": 0
                },
                {
                    "sent": "Is that when Papa says build things for yourself in order to try to build intellectual structures?",
                    "label": 0
                },
                {
                    "sent": "That puppet is saying discover everything for yourself.",
                    "label": 0
                },
                {
                    "sent": "You have to recreate history and he has not said that and he's never said that.",
                    "label": 0
                },
                {
                    "sent": "And that's completely crazy thing to imagine.",
                    "label": 0
                },
                {
                    "sent": "But it points to an example of where it's very easy to misunderstand what this debate is really about.",
                    "label": 0
                },
                {
                    "sent": "It's not about.",
                    "label": 0
                },
                {
                    "sent": "Being told versus discovering.",
                    "label": 0
                },
                {
                    "sent": "It's about building things for yourself in your own mind, and we all know that it is possible.",
                    "label": 0
                },
                {
                    "sent": "To sit in a lecture for 3/4 of an hour.",
                    "label": 0
                },
                {
                    "sent": "And take something very important away from it.",
                    "label": 0
                },
                {
                    "sent": "But we also know that if the only thing you do is sit in a lecture for 3/4 of an hour and never reconsider what you've been, what you've heard that you really don't take much away from it.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Bill Gates, by the way.",
                    "label": 0
                },
                {
                    "sent": "Is even more scathing on the question of constructionism.",
                    "label": 1
                },
                {
                    "sent": "It's bullshit, he says he's a man of great understatement.",
                    "label": 0
                },
                {
                    "sent": "If you can't do multiplication, then tell me what is your contribution to society going to be.",
                    "label": 1
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "Actually, I can imagine that.",
                    "label": 0
                },
                {
                    "sent": "It's possible to be a great violinist without doing multiplication, so I I'm not sure what this means, but again, you see it's a debate about facts versus building intellectual elements in your mind, and that's a false dichotomy.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it really points up something very important.",
                    "label": 0
                },
                {
                    "sent": "I think about technology in the way technology is considered.",
                    "label": 0
                },
                {
                    "sent": "It starts with an unfortunate accident that happened in the middle of the last century, which is the used by great computer scientists of the time of the word information to mean something very specific, different from the word information in everyday speech.",
                    "label": 0
                },
                {
                    "sent": "So this is a technical meaning of the word information about sending messages down noisy lines and so on.",
                    "label": 0
                },
                {
                    "sent": "The details don't matter, but it did not mean when they coined the phrase information technology it did not mean passing on information.",
                    "label": 0
                },
                {
                    "sent": "But of course, the way that it's come down.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thus now.",
                    "label": 0
                },
                {
                    "sent": "Is that it means?",
                    "label": 0
                },
                {
                    "sent": "Peep",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Talk about information technology and I guarantee to you if you go out into the street and do a little research project with a microphone and a tape recorder.",
                    "label": 0
                },
                {
                    "sent": "99 point something percent of people you meet will say yes.",
                    "label": 0
                },
                {
                    "sent": "Information technology in schools and colleges is about information.",
                    "label": 0
                },
                {
                    "sent": "Facts.",
                    "label": 0
                },
                {
                    "sent": "Now, before anybody attacks me for saying.",
                    "label": 0
                },
                {
                    "sent": "I don't care about facts.",
                    "label": 0
                },
                {
                    "sent": "I was a mathematician.",
                    "label": 0
                },
                {
                    "sent": "I care a lot about facts, but I know that some of the most important things that I know about mathematics are not factual at all.",
                    "label": 0
                },
                {
                    "sent": "They're about constructions that I finally managed to make that others before me had helped me to make.",
                    "label": 0
                },
                {
                    "sent": "So I think we've got this balance wrong and and by the way, in England we have this horrible phrase ICT information and communication technology.",
                    "label": 0
                },
                {
                    "sent": "But it really underlines it.",
                    "label": 0
                },
                {
                    "sent": "You know, it really underlines that the I means facts.",
                    "label": 0
                },
                {
                    "sent": "So let me get it clear.",
                    "label": 0
                },
                {
                    "sent": "Yes, of course information digital technology is a fantastic medium for passing information between human beings.",
                    "label": 0
                },
                {
                    "sent": "And between machines.",
                    "label": 0
                },
                {
                    "sent": "But there's more to learning than just facts.",
                    "label": 0
                },
                {
                    "sent": "There's something else, and that can only be constructed in the mind with appropriate tools.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, people learn well if they care.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About what they're learning, this is a picture I took of two kids in Thailand doing an impossibly complex task.",
                    "label": 0
                },
                {
                    "sent": "If I told you that they were looking to see how climate change affects the water table on a Hill.",
                    "label": 0
                },
                {
                    "sent": "You wouldn't believe it, but if I told you that it's climate change in their village.",
                    "label": 0
                },
                {
                    "sent": "Connected to the water table above their village.",
                    "label": 0
                },
                {
                    "sent": "On a path that they take to school every day using this is the little.",
                    "label": 0
                },
                {
                    "sent": "One laptop per child computers.",
                    "label": 0
                },
                {
                    "sent": "And one of the things I like about the picture is.",
                    "label": 0
                },
                {
                    "sent": "Apart from the incredible sense of engagement, look at the little girls face.",
                    "label": 0
                },
                {
                    "sent": "You probably can't see it very well, but just the fact that the boy is holding a computer in his hand.",
                    "label": 0
                },
                {
                    "sent": "Well, I mean, you could probably has a pencil in his pocket.",
                    "label": 0
                },
                {
                    "sent": "And a piece of paper in his other pocket, and a computer in his hand.",
                    "label": 0
                },
                {
                    "sent": "It's just seamlessly working.",
                    "label": 0
                },
                {
                    "sent": "On this project so people can do surprising things if it's contextualized in a subject in a context that they care about.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Unfortunately, that is becoming more and more difficult because there's this amazingly tricky paradox.",
                    "label": 0
                },
                {
                    "sent": "The world is becoming more and more digitized.",
                    "label": 1
                },
                {
                    "sent": "And therefore potentially there's more and more to know and more appropriate ways of getting hold of that knowledge.",
                    "label": 0
                },
                {
                    "sent": "But that knowledge is becoming less and less visible.",
                    "label": 1
                },
                {
                    "sent": "It's harder and harder without the right tools.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To see what it is that powers the world, systems are increasingly read only.",
                    "label": 0
                },
                {
                    "sent": "There's no way into them.",
                    "label": 0
                },
                {
                    "sent": "And this is really one of the major challenges for education to try to find ways to open up the systems that surround us that everybody cares about.",
                    "label": 0
                },
                {
                    "sent": "Everybody loves the music on their iPhone.",
                    "label": 0
                },
                {
                    "sent": "Everybody loves the way that technology can share photographs and video and all those things.",
                    "label": 0
                },
                {
                    "sent": "And everybody takes for granted things like how Google does searches, but the mechanism by which this happens.",
                    "label": 0
                },
                {
                    "sent": "Is opaque to the user an from an educational point of view, finding ways to open up those systems.",
                    "label": 0
                },
                {
                    "sent": "Is a real challenge.",
                    "label": 0
                },
                {
                    "sent": "And the final thing that I want to spend a little bit more time on is making news.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Things for learning.",
                    "label": 0
                },
                {
                    "sent": "I want you.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "Do a thought experiment.",
                    "label": 0
                },
                {
                    "sent": "And do this simple multiplication in Roman numerals.",
                    "label": 0
                },
                {
                    "sent": "Now you're not allowed.",
                    "label": 0
                },
                {
                    "sent": "To translate the Roman numerals into Arabic numerals, and then do it and then pretend to me that you did a moment.",
                    "label": 0
                },
                {
                    "sent": "You can't do it.",
                    "label": 0
                },
                {
                    "sent": "You can't do it because.",
                    "label": 0
                },
                {
                    "sent": "The technology of Roman number system was not designed for calculation.",
                    "label": 0
                },
                {
                    "sent": "It was designed for labeling as saying, there are six battalions.",
                    "label": 0
                },
                {
                    "sent": "Of soldiers not to do calculations of how many times, how many soldiers you have.",
                    "label": 0
                },
                {
                    "sent": "If you have six battalions of 237 people or something.",
                    "label": 0
                },
                {
                    "sent": "But just imagine.",
                    "label": 0
                },
                {
                    "sent": "That we live at a time before Arabic numerals were created.",
                    "label": 0
                },
                {
                    "sent": "Then what would the mathematics educators of the time say to each other?",
                    "label": 0
                },
                {
                    "sent": "They'd say, you know, children get very confused about our number system.",
                    "label": 0
                },
                {
                    "sent": "They can't even multiply Ivy by CX XV11.",
                    "label": 0
                },
                {
                    "sent": "Yes, as the other math educated times are really full and this is this is the trouble with education.",
                    "label": 0
                },
                {
                    "sent": "Things aren't what they used to be.",
                    "label": 0
                },
                {
                    "sent": "And they probably do little experiments to show that IX is very easy to confuse with XI.",
                    "label": 0
                },
                {
                    "sent": "And they probably have Pisa tests to see which Roman Em which part of the Roman Empire would do best at this cut these kind of calculations and then one day just imagine.",
                    "label": 0
                },
                {
                    "sent": "Imagine that along comes somebody from what is now probably Saudi Arabia and says I have a better way to do this.",
                    "label": 0
                },
                {
                    "sent": "And introduces the Arabic number system that we all use today suddenly.",
                    "label": 0
                },
                {
                    "sent": "Millions of people who couldn't do this.",
                    "label": 0
                },
                {
                    "sent": "Some would be able to do it.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because the representational structure infrastructure with which this idea is expressed would be fundamentally different, and it would allow access to an idea which probably was only the possibility for a very few people to be possible for everyone.",
                    "label": 0
                },
                {
                    "sent": "Now I think, forgive me.",
                    "label": 0
                },
                {
                    "sent": "By the way, I want to thank everyone.",
                    "label": 0
                },
                {
                    "sent": "Lenski and Seymour Papert for this example, which I heard at a conference a couple of years ago.",
                    "label": 0
                },
                {
                    "sent": "It's a great example because I think the computer.",
                    "label": 0
                },
                {
                    "sent": "At least.",
                    "label": 0
                },
                {
                    "sent": "Potentially has in its power.",
                    "label": 0
                },
                {
                    "sent": "The potential to really radically give us a new way of representing knowledge.",
                    "label": 0
                },
                {
                    "sent": "And that means in a way we have to invent new representations.",
                    "label": 0
                },
                {
                    "sent": "Isn't any good anymore to just strive to do better?",
                    "label": 0
                },
                {
                    "sent": "What we always did?",
                    "label": 0
                },
                {
                    "sent": "Why don't we use the technology in the way that the Arab math Educator tried to use it and say, look if you think about your system completely differently, you represent your numbers in a different way.",
                    "label": 0
                },
                {
                    "sent": "Suddenly people can do things that they couldn't do before they can think about things that were unthinkable before.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that there's the challenge to build new representations for existing knowledge.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In other words, education must not be read only.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, here's what happens if you allow education to be read only.",
                    "label": 0
                },
                {
                    "sent": "This is Goldman Sachs investment bank.",
                    "label": 0
                },
                {
                    "sent": "And it happens a year after the banking crisis of when was it 2007?",
                    "label": 0
                },
                {
                    "sent": "8.",
                    "label": 0
                },
                {
                    "sent": "You probably hasn't got here yet, you're lucky.",
                    "label": 0
                },
                {
                    "sent": "Anne, somebody was telling me last night that it doesn't doesn't really affect Slovenia where you're very fortunate.",
                    "label": 0
                },
                {
                    "sent": "I don't believe it, by the way.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the Chief financial officer.",
                    "label": 1
                },
                {
                    "sent": "Was interviewed in the Financial Times, London Financial Times.",
                    "label": 0
                },
                {
                    "sent": "He said we were seeing things that were 25 standard deviation moves several days in a row.",
                    "label": 1
                },
                {
                    "sent": "This is the Chief financial officer.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now I'm sure I don't have to tell you what 25 standard deviations means.",
                    "label": 0
                },
                {
                    "sent": "It means that.",
                    "label": 0
                },
                {
                    "sent": "Somewhere roughly where that building is on this graph.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The probability of that occurring is an interesting number.",
                    "label": 0
                },
                {
                    "sent": "Luckily I have a son who works for the Bank of England and he did this calculation for me 'cause you need quite a lot of decimal points.",
                    "label": 0
                },
                {
                    "sent": "Would you like to guess roughly how long it would take for three events of this kind to take place three days in a row?",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The answer is it 6 * 10 to the power of 120.",
                    "label": 0
                },
                {
                    "sent": "Four times the life of the universe.",
                    "label": 1
                },
                {
                    "sent": "Now you might think my friend here that the Chief Executive Chief Financial Officer of Goldman Sachs would say to himself with a figure like this.",
                    "label": 0
                },
                {
                    "sent": "Maybe I have the wrong model.",
                    "label": 0
                },
                {
                    "sent": "And maybe he did say that because I have no inside information, I never met this man and probably I'm being unfair to him.",
                    "label": 0
                },
                {
                    "sent": "Maybe of course this was a journalistic error and not him at all.",
                    "label": 0
                },
                {
                    "sent": "So apologies if you're there.",
                    "label": 0
                },
                {
                    "sent": "Probably is recording this talk now.",
                    "label": 0
                },
                {
                    "sent": "But it points in the direction that I want to go here, which is.",
                    "label": 0
                },
                {
                    "sent": "Here's a model.",
                    "label": 0
                },
                {
                    "sent": "And we've emphasized the output of models at the expense of really understanding that building models and are even just asking the question what is the model you're using for this piece of information?",
                    "label": 0
                },
                {
                    "sent": "I think this is probably the most important thing we can give children in the 21st century.",
                    "label": 0
                },
                {
                    "sent": "I don't care.",
                    "label": 0
                },
                {
                    "sent": "If they can't build a computer program.",
                    "label": 0
                },
                {
                    "sent": "That would calculate a number like this, but I do care.",
                    "label": 0
                },
                {
                    "sent": "Very much that we educate our children to say.",
                    "label": 0
                },
                {
                    "sent": "What are the important variables here?",
                    "label": 0
                },
                {
                    "sent": "What are the important parameters here?",
                    "label": 0
                },
                {
                    "sent": "How do they hook up with each other?",
                    "label": 0
                },
                {
                    "sent": "Give me some idea of how you're doing this.",
                    "label": 0
                },
                {
                    "sent": "I don't want to see any numbers.",
                    "label": 0
                },
                {
                    "sent": "I don't want to see any details, but I do understand that the world works in models that computers have to have programs that programs are modeling reality in some way, well or badly.",
                    "label": 0
                },
                {
                    "sent": "And in my country at least, we've done an incredibly bad job at doing that.",
                    "label": 0
                },
                {
                    "sent": "And it's something we have to address.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Oh, I'm not sure three days in a row is whether this number is 3 days in a row or just once.",
                    "label": 0
                },
                {
                    "sent": "I'm sure you'll appreciate that there's not much difference, really.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'm going to say something negative.",
                    "label": 0
                },
                {
                    "sent": "About the things written in the on the website of this conference, forgive me because there's a lot to say that's positive and it's a wonderful initiative, but I'm going to just say something about the negative side, the new trends, Moocs, higher education policies.",
                    "label": 0
                },
                {
                    "sent": "HCI machine learning.",
                    "label": 0
                },
                {
                    "sent": "User analytics automatic assessment and visualization.",
                    "label": 1
                },
                {
                    "sent": "Now let me get on record.",
                    "label": 0
                },
                {
                    "sent": "These are powerful ways in which technology can help learning.",
                    "label": 0
                },
                {
                    "sent": "I agree.",
                    "label": 0
                },
                {
                    "sent": "But I want to say that unless they really take account of what we know about educational research, they will in fact come and go.",
                    "label": 0
                },
                {
                    "sent": "I've lost track of the number of people who tell me rubbing their hands together with excitement at what their latest learning analytic technique will allow them to collect fantastic new every little iron movement, every little finger push.",
                    "label": 0
                },
                {
                    "sent": "And then I say, and that's great.",
                    "label": 0
                },
                {
                    "sent": "That's really fantastic.",
                    "label": 0
                },
                {
                    "sent": "And what will you learn?",
                    "label": 0
                },
                {
                    "sent": "Doing that and they say, well, that's not my problem.",
                    "label": 0
                },
                {
                    "sent": "That's your problem, that's my problem.",
                    "label": 0
                },
                {
                    "sent": "Now of course, knowing more about the interaction experience of people ought to help us to understand more about learning.",
                    "label": 0
                },
                {
                    "sent": "But it won't do it automatically.",
                    "label": 0
                },
                {
                    "sent": "And there's another thing I just want to say.",
                    "label": 0
                },
                {
                    "sent": "Well, I'm dwelling on the negative and then I'll get back to being positive.",
                    "label": 0
                },
                {
                    "sent": "See I don't know how many people here remember very few actually looking at you and how awfully young you are.",
                    "label": 0
                },
                {
                    "sent": "But you remember that when there was a time when car indicators before we had flashing lights.",
                    "label": 0
                },
                {
                    "sent": "Remember they used to have little art.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you remember?",
                    "label": 0
                },
                {
                    "sent": "Gosh you, you're nearly Maeve.",
                    "label": 0
                },
                {
                    "sent": "OK, and you know it's a natural thing to do.",
                    "label": 0
                },
                {
                    "sent": "How did we use?",
                    "label": 0
                },
                {
                    "sent": "Not we.",
                    "label": 0
                },
                {
                    "sent": "I'm not that old.",
                    "label": 0
                },
                {
                    "sent": "How did people used to indicate that they were turning around the corner?",
                    "label": 0
                },
                {
                    "sent": "They put their arm out the window because there weren't any windows.",
                    "label": 0
                },
                {
                    "sent": "And so you build a car.",
                    "label": 0
                },
                {
                    "sent": "You have this great idea of a technology that can replace your hand.",
                    "label": 0
                },
                {
                    "sent": "What do you do?",
                    "label": 0
                },
                {
                    "sent": "You build an artificial arm.",
                    "label": 0
                },
                {
                    "sent": "And I think that's where we are at the moment with MC Smook.",
                    "label": 0
                },
                {
                    "sent": "So fantastically new.",
                    "label": 0
                },
                {
                    "sent": "They're all different from each other.",
                    "label": 0
                },
                {
                    "sent": "Some have more affordances than others.",
                    "label": 0
                },
                {
                    "sent": "I understand completely that we're in the infancy of Moocs, but we don't have to recapitulate history.",
                    "label": 0
                },
                {
                    "sent": "Some of the books that I see really are pretty standard things, except that they're supposed to be massive.",
                    "label": 0
                },
                {
                    "sent": "And some of the books are not massive actually, they massive at the beginning and by the time you get to the end, they're actually looks little online.",
                    "label": 0
                },
                {
                    "sent": "Whatever the other is, what does the open?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I'm not arguing, please don't misunderstand me.",
                    "label": 0
                },
                {
                    "sent": "I'm the last person to argue against using technology.",
                    "label": 0
                },
                {
                    "sent": "I want to use technology in mindful ways that take account of what we know about how people learn, by the way.",
                    "label": 0
                },
                {
                    "sent": "Did a few weeks after the iPad was invented or was presented by Steve Jobs.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I had a look on the web to see what to see if I could find the first maths app for the iPad and here it is.",
                    "label": 0
                },
                {
                    "sent": "You can workout what 86 + 49 is.",
                    "label": 0
                },
                {
                    "sent": "And if you get it wrong, it says wrong.",
                    "label": 0
                },
                {
                    "sent": "At the time we were all in.",
                    "label": 0
                },
                {
                    "sent": "Now we take it for granted everybody has a tablet in the handbag or somewhere, but it is a beautiful technology.",
                    "label": 0
                },
                {
                    "sent": "Quite a change, quite a potentially changing technology and learning how to add up to numbers and being told helpfully that you're wrong, really.",
                    "label": 0
                },
                {
                    "sent": "I don't think sums up the potential of that technology.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm going to just.",
                    "label": 0
                },
                {
                    "sent": "I've got about 2020 minutes.",
                    "label": 0
                },
                {
                    "sent": "I'm going to just very quickly share with you.",
                    "label": 0
                },
                {
                    "sent": "Not the results of a very large program of research in the UK.",
                    "label": 0
                },
                {
                    "sent": "That's just come to an end.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to share with you the results, but I'm just going to point you in the direction of what those projects were about in case you want to follow them up.",
                    "label": 0
                },
                {
                    "sent": "Obviously the URL is at the top of the page, so I'm going to do in 5 minutes.",
                    "label": 0
                },
                {
                    "sent": "What really could be several hours of a talk?",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The first is that there was some very interesting research looking to see how the technology that people have in their pocket could be used for developing scientific inquiry.",
                    "label": 0
                },
                {
                    "sent": "In 1985 I went to a conference of mathematics teachers where there was a debate and debate.",
                    "label": 0
                },
                {
                    "sent": "The debate was will there ever be a time when a school could have 10 electronic calculators?",
                    "label": 0
                },
                {
                    "sent": "And the general answer, by the way, was no.",
                    "label": 0
                },
                {
                    "sent": "They're too expensive.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There are things that we do now we take for granted in terms of collaboration.",
                    "label": 0
                },
                {
                    "sent": "That really are have changed what it means to collaborate.",
                    "label": 0
                },
                {
                    "sent": "I think Yvonne's talk was, I thought, the example of the Australian elderly people holding onto each other in order to make a circuit was a wonderful example of that.",
                    "label": 0
                },
                {
                    "sent": "We don't only have to use the technology to collaborate, collaborate in the old way.",
                    "label": 0
                },
                {
                    "sent": "There are new ways to collaborate and those new ways to collaborate will bring about changes in knowledge.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We all know that the keyboard is probably coming to an end, at least in its Hamonic form, where everything is a keyboard interaction.",
                    "label": 0
                },
                {
                    "sent": "It's not completely clear.",
                    "label": 0
                },
                {
                    "sent": "I certainly don't know about you, but I didn't predict that using your finger on a screen everywhere.",
                    "label": 0
                },
                {
                    "sent": "Would become so ubiquitous and work as well as it does.",
                    "label": 0
                },
                {
                    "sent": "Once you a bit sceptical when you folks all your first touch screen your fingers too big, I will leave on your just your romantic.",
                    "label": 0
                },
                {
                    "sent": "So there's a project, a wonderful project on that.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Team that you might be interested to see and the semantic web is an interesting development.",
                    "label": 0
                },
                {
                    "sent": "From my point of view, the most interesting thing about it is that it begins to blur.",
                    "label": 0
                },
                {
                    "sent": "Potentially this dichotomy between information and construction.",
                    "label": 0
                },
                {
                    "sent": "The informational role of technology and the constructive role of technology, and if some of the semantic web experts in the world could find a way to open the address that dichotomy, that would, I think, be.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Very helpful.",
                    "label": 0
                },
                {
                    "sent": "Two projects that I just want to spend a few seconds longer on.",
                    "label": 0
                },
                {
                    "sent": "One is about.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Teachers and I don't.",
                    "label": 0
                },
                {
                    "sent": "I can't do a research project on how what percentage of papers about educational technology are aimed directly at students, but it must be in the 90s.",
                    "label": 0
                },
                {
                    "sent": "I wouldn't be surprised if it's 95 or 96% of Journal articles about learning and teaching with technology.",
                    "label": 0
                },
                {
                    "sent": "I aimed directly at students, and perhaps that's how it should be.",
                    "label": 0
                },
                {
                    "sent": "But technology replacing teachers will not happen in our lifetime.",
                    "label": 0
                },
                {
                    "sent": "I don't rule it out, but we won't.",
                    "label": 0
                },
                {
                    "sent": "None of us will be here to see it.",
                    "label": 0
                },
                {
                    "sent": "And addressing technology for teachers are saying to teachers you need powerful tools for teaching in the same way as architects need powerful tools for building and doctors need powerful tools to do medicine and so on.",
                    "label": 0
                },
                {
                    "sent": "The list is endless.",
                    "label": 0
                },
                {
                    "sent": "Is a very important aspect which I think has been under theorised in the literature.",
                    "label": 0
                },
                {
                    "sent": "I don't see that many.",
                    "label": 0
                },
                {
                    "sent": "Innovative technological tools being aimed at teachers, distinctly so that's one project you might be interested in looking at.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally.",
                    "label": 0
                },
                {
                    "sent": "We have a lot of people in our education system who for different reasons at different times, are underprivileged, excluded and so on.",
                    "label": 0
                },
                {
                    "sent": "This happens to be a project.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About autistic children.",
                    "label": 0
                },
                {
                    "sent": "I was told by the director of this project the other day that something like in a class of 30 children, the probability is that two will be suffering from autism in some respect, so this is not an insignificant number of people.",
                    "label": 0
                },
                {
                    "sent": "And what's nice about this project is that it's using a technology to catalyze communication between people.",
                    "label": 0
                },
                {
                    "sent": "I'm suppressing all details.",
                    "label": 0
                },
                {
                    "sent": "But by interacting with an intelligent agent on the screen, who can see where the child is looking where he or she is directing his gaze?",
                    "label": 0
                },
                {
                    "sent": "That the computer will catalyze what it means to collaborate with other human beings, and there are some interesting outcomes, although nothing conclusive.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm afraid.",
                    "label": 0
                },
                {
                    "sent": "So I'm coming towards the end of my talk and I'm at this point.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure how far I'll get and I have some escape buttons on my slides to jump to various different places.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here is a message that I'd be happy if it's the only message you take with you.",
                    "label": 0
                },
                {
                    "sent": "If we're thinking about.",
                    "label": 0
                },
                {
                    "sent": "Making new kinds of things to learn.",
                    "label": 0
                },
                {
                    "sent": "Making new things that are learnable.",
                    "label": 0
                },
                {
                    "sent": "More learnable than they were before learnable means learnable for the individual and more learnable by people in general.",
                    "label": 0
                },
                {
                    "sent": "Some ideas are effectively unlearnable by most people because of the way they represented.",
                    "label": 1
                },
                {
                    "sent": "And mathematics is a great example of this, actually.",
                    "label": 0
                },
                {
                    "sent": "That mathematics happens in the head.",
                    "label": 0
                },
                {
                    "sent": "It really doesn't happen on paper.",
                    "label": 0
                },
                {
                    "sent": "And we expect people to do mathematics with without anything to help them.",
                    "label": 0
                },
                {
                    "sent": "It has to happen in the head.",
                    "label": 0
                },
                {
                    "sent": "It doesn't happen anywhere else, so it's like learning to play the piano without a piano.",
                    "label": 0
                },
                {
                    "sent": "Now it can be done.",
                    "label": 0
                },
                {
                    "sent": "There are some people who are incredibly gifted.",
                    "label": 0
                },
                {
                    "sent": "We all know about Mozart and so on.",
                    "label": 0
                },
                {
                    "sent": "And these people are successful just like there are some people called mathematicians who are successful at mathematics.",
                    "label": 0
                },
                {
                    "sent": "But I'm sure that the reason why most people find mathematics so difficult is because they're being asked to play the music of mathematics without a mathematical instrument.",
                    "label": 0
                },
                {
                    "sent": "It's really as simple as that is like playing a game of virtual reality.",
                    "label": 0
                },
                {
                    "sent": "No, it's I tell you what it's like.",
                    "label": 0
                },
                {
                    "sent": "It's like playing 12 games of chess with blindfold on.",
                    "label": 0
                },
                {
                    "sent": "We know it can be done.",
                    "label": 0
                },
                {
                    "sent": "But to ask everybody to do it.",
                    "label": 0
                },
                {
                    "sent": "Is.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A lot, so here's an example that I want to use to indicate this.",
                    "label": 0
                },
                {
                    "sent": "This is a flock of birds.",
                    "label": 0
                },
                {
                    "sent": "This is quite a low resolution screen.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry, but I promise you on my screen you can see these blobs of birds.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "There cannot be anybody who's ever seen this happen.",
                    "label": 0
                },
                {
                    "sent": "Who has not asked themselves?",
                    "label": 0
                },
                {
                    "sent": "How does the flock know where to go?",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "You're very privileged because I'm going to show you the answer to that question.",
                    "label": 0
                },
                {
                    "sent": "So I hope everybody has a notebook ready.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Answer.",
                    "label": 0
                },
                {
                    "sent": "This is the triple integral equation.",
                    "label": 0
                },
                {
                    "sent": "Which conclusively shows and it is true.",
                    "label": 0
                },
                {
                    "sent": "By the way there in there somewhere is in the equation that tells you what you want to know now.",
                    "label": 0
                },
                {
                    "sent": "I want to use this flock of birds as an exemplar of something much more general.",
                    "label": 0
                },
                {
                    "sent": "I don't care if people know about blocking birds.",
                    "label": 0
                },
                {
                    "sent": "But I do care that people look at the real world that they live in and say that's amazing.",
                    "label": 0
                },
                {
                    "sent": "What can I learn about how that works?",
                    "label": 0
                },
                {
                    "sent": "And until we had digital technologies, it was impossible.",
                    "label": 0
                },
                {
                    "sent": "Well, not impossible.",
                    "label": 0
                },
                {
                    "sent": "There must be somebody who somebody wrote this paper, and I presume they understand what it means.",
                    "label": 0
                },
                {
                    "sent": "But I have some background in mathematics and I cannot tell you what the hell any of it means.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The answer is simply to write a program which is now not going to work conveniently.",
                    "label": 0
                },
                {
                    "sent": "So I rise a program.",
                    "label": 0
                },
                {
                    "sent": "Now the program that makes this work is 2 lines long.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of graphical stuff that has to be done.",
                    "label": 0
                },
                {
                    "sent": "But I'm playing with the number of birds in the population.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you can see I set it up.",
                    "label": 0
                },
                {
                    "sent": "The birds start moving.",
                    "label": 0
                },
                {
                    "sent": "I do lots of experimentation.",
                    "label": 0
                },
                {
                    "sent": "I press go.",
                    "label": 0
                },
                {
                    "sent": "They're starting to go in the same direction.",
                    "label": 0
                },
                {
                    "sent": "They're starting to clump together.",
                    "label": 0
                },
                {
                    "sent": "Do you see how the clumping together and before you know it?",
                    "label": 0
                },
                {
                    "sent": "They're all going in the same direction.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "It's important to me because I care about children learning to program that the program.",
                    "label": 0
                },
                {
                    "sent": "This is not only just a simulation, it's a program simulation where the end user can do the programming.",
                    "label": 0
                },
                {
                    "sent": "What is this software?",
                    "label": 0
                },
                {
                    "sent": "How does it work?",
                    "label": 0
                },
                {
                    "sent": "What's the program?",
                    "label": 0
                },
                {
                    "sent": "I'm not telling you anything.",
                    "label": 0
                },
                {
                    "sent": "Remember what I'm trying to do here to give you an exemplar of a much more general phenomenon.",
                    "label": 0
                },
                {
                    "sent": "That the technology allows you to learn things, not everything.",
                    "label": 0
                },
                {
                    "sent": "You still won't know the triple integral.",
                    "label": 0
                },
                {
                    "sent": "But it learns it allows you to engage with phenomenon that are unengaged, able.",
                    "label": 0
                },
                {
                    "sent": "Without it.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Here are two challenges.",
                    "label": 0
                },
                {
                    "sent": "The one is to build learning technologies.",
                    "label": 1
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the other is to build learning curricula.",
                    "label": 0
                },
                {
                    "sent": "Ask yourself what is it that determines the tiny little slices of material that we teach people?",
                    "label": 0
                },
                {
                    "sent": "How do we know this sequence of of learning always works and I'll give you my example, which is why the car is there.",
                    "label": 0
                },
                {
                    "sent": "We always teach kids.",
                    "label": 0
                },
                {
                    "sent": "Forgive me if my examples are often physics and maths, but it's best to talk about something you know a little bit about.",
                    "label": 0
                },
                {
                    "sent": "Why do we teach kids about statics?",
                    "label": 0
                },
                {
                    "sent": "OK, well there's a force going down.",
                    "label": 0
                },
                {
                    "sent": "There's a force going up.",
                    "label": 0
                },
                {
                    "sent": "The thing doesn't move, that's nice.",
                    "label": 0
                },
                {
                    "sent": "Then we teach them about constant velocity.",
                    "label": 0
                },
                {
                    "sent": "And then finally, if they're lucky and there's still at school and they're still doing maths and physics, we teach them about acceleration.",
                    "label": 0
                },
                {
                    "sent": "Why do we choose that particular?",
                    "label": 0
                },
                {
                    "sent": "Linear form and why do we expect in the Pisa tests we follow the same line.",
                    "label": 0
                },
                {
                    "sent": "And the answer is, if you don't have technology.",
                    "label": 0
                },
                {
                    "sent": "Acceleration is quite difficult.",
                    "label": 0
                },
                {
                    "sent": "It's the second derivative and you have to understand about changing what velocity is and so on.",
                    "label": 0
                },
                {
                    "sent": "And why is it that something going round and round on the end of a string shortly?",
                    "label": 0
                },
                {
                    "sent": "That's going at a constant speed?",
                    "label": 0
                },
                {
                    "sent": "Isn't that the same as constant, but there all sorts of difficult questions that have to be asked, but consider this.",
                    "label": 0
                },
                {
                    "sent": "Nobody ever experienced well.",
                    "label": 0
                },
                {
                    "sent": "I mean, I'm experienced seeing as a static object I'm experiencing the force pulling me down to the center of the Earth and the Earth and the floor pushing me back up, but nothing's happening.",
                    "label": 0
                },
                {
                    "sent": "I can't touch it, I can't feel it.",
                    "label": 0
                },
                {
                    "sent": "And the same with constant velocity.",
                    "label": 0
                },
                {
                    "sent": "How do you know when you're traveling at a constant velocity?",
                    "label": 0
                },
                {
                    "sent": "Because it feels exactly the same as standing still.",
                    "label": 0
                },
                {
                    "sent": "That's the whole point of constant velocity.",
                    "label": 0
                },
                {
                    "sent": "The one thing that you can touch and feel is what it feels like in a car going around the corner.",
                    "label": 0
                },
                {
                    "sent": "So if you wanted to ask me what does my math curriculum look like, I would start with acceleration.",
                    "label": 0
                },
                {
                    "sent": "I would build a model.",
                    "label": 0
                },
                {
                    "sent": "I would ask the kids to build a video game where somebody throws something across the screen and try and make the movement of that object as true as possible to water.",
                    "label": 0
                },
                {
                    "sent": "Real object would look like probably the kids would start by drawing a straight line, but we know that that's not what happens.",
                    "label": 0
                },
                {
                    "sent": "Maybe they try a little piece of a circle which if you try it, it looks pretty good, but it's very clear that it's not right.",
                    "label": 0
                },
                {
                    "sent": "Why don't we start?",
                    "label": 0
                },
                {
                    "sent": "Why didn't the designers of math curricula start with acceleration, which we can feel and touch instead of starting with something that we can't feel in touch?",
                    "label": 0
                },
                {
                    "sent": "Answer.",
                    "label": 0
                },
                {
                    "sent": "Because unless you have digital technology, it's really out of your reach.",
                    "label": 0
                },
                {
                    "sent": "But now with digital technology, we have this opportunity to switch round the things that we cherish and love and believe their natural phenomena.",
                    "label": 0
                },
                {
                    "sent": "Or you can't learn velocity without learning statics.",
                    "label": 0
                },
                {
                    "sent": "You can't learn acceleration without learning.",
                    "label": 0
                },
                {
                    "sent": "Velocity might not be true.",
                    "label": 0
                },
                {
                    "sent": "And if it might not be true in that one example, maybe there are a huge number of ways in which we can change the curriculum to make it more learnable.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I think I'm going to leave you with this slide there.",
                    "label": 0
                },
                {
                    "sent": "I have about 30 more that I'm not going to get to.",
                    "label": 0
                },
                {
                    "sent": "We are in our what we call in English the comfort zone.",
                    "label": 0
                },
                {
                    "sent": "We teach people what we think is learnable, but we make the mistake of forgetting the tools that are at our disposal.",
                    "label": 0
                },
                {
                    "sent": "I would like to ask us if we are interested in education to make an occasional voyage onto the unlearnable side of this mountain.",
                    "label": 0
                },
                {
                    "sent": "To say what is it possible for people to understand with digital technologies that before they were stuck on this side of the mountain of the Valley, let's cross the Valley together and see what people can learn.",
                    "label": 0
                },
                {
                    "sent": "I think will be surprised.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}