{
    "id": "cqhxvjufmbgluisejvatqbgi5bdhvem5",
    "title": "Assessing Progress in Building Autonomously Creative Systems",
    "info": {
        "author": [
            "Simon Colton, Goldsmiths College, University of London"
        ],
        "published": "Aug. 8, 2014",
        "recorded": "June 2014",
        "category": [
            "Top->Computer Science->Artificial Intelligence",
            "Top->Computer Science->Machine Learning",
            "Top->Arts",
            "Top->Philosophy",
            "Top->Social Sciences->Psychology"
        ]
    },
    "url": "http://videolectures.net/iccc2014_colton_creative_systems/",
    "segmentation": [
        [
            "OK, so I'm interested in progress in our field in computer creativity.",
            "This whole talk in the paper is completely."
        ],
        [
            "Influenced by this philosophical perspective, which we are now beginning to get quite mature.",
            "So we've written a number of papers about this.",
            "Very briefly, my particular interest in this field is to get creative software ubiquitously embedded in society.",
            "Creative fridges created for iPods, creative everything.",
            "So that's where I'm coming from.",
            "I'm less interested in understanding human creativity.",
            "I I see creativity in people or software as a secondary quality.",
            "There is no creativity, organ insiders and no creativity gene.",
            "There's no creativity algorithm or set of algorithms.",
            "This is a word that we project onto people.",
            "If we observe their behaviors and we believe their behaviors are creative and if they do that in a long term way, we might just use the shorthand.",
            "They are creative when we really mean they regularly undertake behaviors which we are prepared to call creative.",
            "I have an hour to thank for introducing me to the notion of essentially contested concepts.",
            "Have to think about it all.",
            "He mentioned this.",
            "Why don't we know what art is?",
            "Why don't we know what creativity is?",
            "I mean, are we really that stupid as a species, or have we tacitly agreed to disagree?",
            "Have we realized that there are certain things which it's better?",
            "It's more beneficial for our SoC to disagree on because they drive forward.",
            "Progress.",
            "Art is one of those.",
            "How many articles in newspapers this year will say yes?",
            "But is it art?",
            "We could say the same thing here, yes.",
            "But is it creativity?",
            "So I think it's a good thing.",
            "This is very healthy SoC.",
            "Scary as hell for our community because definitions of creativity are not going to come anytime soon.",
            "I worry about artifact based assessment like sharing style tests as actually emphasizing the humanity gap.",
            "Software isn't human.",
            "And it never will be, and therefore we can either carry on doing these tests, or we can embrace that different.",
            "But I think when you when you put all tracks out there from people and from software, actually people realize they wanted the human connection.",
            "This is a hypothesis which will test one state.",
            "Finally, Allison, I was like taking up a tight shoe when we stopped talking about the creative software and the value of artifacts abit like Ali throwing away definition in this morning.",
            "Not this morning that name, but rather looking at what progress means in our field.",
            "Progress of a project.",
            "And that's with respect to weak and strong objectives, so this is not particularly controversial anymore.",
            "We have weak."
        ],
        [
            "Objective when we have these creative projects, that's to produce artifacts of wonder which just so happens to have a computational help.",
            "Strong objective in our projects are to convince people that what our software is doing.",
            "Its behavior is worthy of being called creative, and I certainly engage in both aspects when I'm doing a major project.",
            "And of course, I think in the future these two types of objective will probably merge in time.",
            "I think it would be extremely difficult to produce artifacts of wonder.",
            "Without software, that is something you can project creatively onto and I think if we are going to produce them such wonderful objects, we won't be able to do it without software which is creative.",
            "So they will merge in time, but they aren't particularly merged at the moment.",
            "So progress in building software."
        ],
        [
            "Generates artifacts so very wordy talk I'm I'm sorry, I apologize about that, so we actually want more formalism in describing how criticisms are built, how they operate at runtime, and the value of artifacts they produce.",
            "I think as many people have mentioned that they will enable us to have a more scientific approach to assessing progress in the field an in particularly engineering of a system as it progresses through various stages, and we want to know we're making progress when we were writing code until the small hours of the morning.",
            "So I think artifact based assessment relies on this assumption that if software is producing better and better artifacts, it must be getting more and more creative.",
            "But I think that's a false assumption sometimes, not always an it said he doesn't capture all the notions of progress we have in the field.",
            "I think we cheat with that.",
            "I certainly do.",
            "If I've got an exhibition coming up, I'm going to create a lot more.",
            "I don't allow myself to alter the pictures that my software comes out with photo shop, but you know, if push came to shove, I might.",
            "So I've already said the thing about humanity.",
            "Everything is worrying and we know that hangover created responsibility.",
            "Software committing decreasing the value of the artifacts.",
            "Allison would call this U shaped creativity.",
            "I think we've been calling it latent heat effect so things are going to get worse before they get better.",
            "If you were handing over creative license to your software and that doesn't match up if you're just using artifact value to assess program.",
            "And we're actually working.",
            "I'm increasingly more fluid situation.",
            "I want myself.",
            "What you invent?",
            "Value judgments, not just slavishly attempt to producing which match mine or other people's judgment.",
            "So I think just basing things on artifacts.",
            "It has many limitations, and I'm more interested."
        ],
        [
            "Process.",
            "So I want to be clear about this slide in the next slide, because I'm it follows a narrative paper, but I've rephrased it an refocused it specifically to address some issues raised by Colin Colin Johnson in his paper color has paper delivered tomorrow saying it's it's time for complicated, grow up and become irresponsible.",
            "So I think so this slide in the next time I'm specifically referencing them up to calling this and you'll have a chance to respond tomorrow.",
            "I hope.",
            "So I think progress can be measured in terms of the seed.",
            "Creative alternative software has.",
            "And in general, how people perceive what the software does, its behavior with respect to issues of creativity, intelligence and autonomy.",
            "I think it's time for us to grow up and start talking about the creative responsibility that we bring to a project and not shying away from that.",
            "Saying, well, I did all that.",
            "The software did this.",
            "I did that, and as we had that over be clear about it so that we know how the software is contributing, and I think that's the only way to demystify an formalize the kind of creative acts that we and our software do in these kind of week.",
            "And strong projects, and I think that's the best way to measure progress, is to break that down and see whether software is doing more than it used to do, regardless of whether the artifacts are any good or not."
        ],
        [
            "So I'm laboring this point so far isn't another human jazz musician that you play along with.",
            "It is actively indecisively, programmed by Earth and others, so that naturally changes the perception that people have of autonomy.",
            "How many times a year do I hear?",
            "Yeah, yeah, but you're the creative 1 Oh no no no no yeah yeah yeah you're the artist and I know it's just a mini, you know.",
            "So people do have that perception because we program.",
            "This is not.",
            "We're not teaching this software by which children.",
            "We were telling exactly what to do, and that's notwithstanding the fact that we teach software to learn your way through machine learning.",
            "I think we still have to cater for that, so we have to do more to address what software actually does, not just celebrate the fact that the system came up with some brilliant creation or the system with creative.",
            "So Colin uses phrases such as diffuse responsibilities and murky situation.",
            "And in this case is I think it's the default position is to project the autonomy and the creativity onto the people in the system.",
            "And I want to try and move away from that so.",
            "The software gets a fair credit for what it's doing and we can see how big that credit gets overtime and assess progress.",
            "I think there is diffuse, but we managed to work out what's in air and predict its flow.",
            "I think if you look at how a bird flies, it uses every part of its body, but that's a murky situation when you start out, but we literally dissect birds and we workout how individual, possibly bodies work.",
            "What goes into the flying mechanism and we study it scientifically, and I'm suggesting doing the same for creativity.",
            "No feathery friends will have to die as a result of this kind of dissection, so people make decisions, do things, software, makes decisions, do things each influence the others.",
            "These are things that can be at least approximately measured, and I agree with Colin that things are murky right now because we haven't started formalizing things.",
            "And that's where this talk comes in and the previous talks in this session, in particular ones."
        ],
        [
            "With Dan's usage of the methodology, so sequence talk tomorrow for rebuttal of that or certainly alternative perspective where we talk about system level, creativity.",
            "So the approach I'm projecting today is a melange mixture of the two.",
            "Tripod and the face model and extra stuff thrown in.",
            "The energy is presented so we start with a simplifying assumption of a person or a team building a single piece of software which generates an artifact like a poem or painting over a video game in a particular domain, and occasionally you release a version to the world, or you've got a major milestone, like an exhibition or a game jam or approach reading, and that's a version of the software which you nailed down and we've got this graphical formulas in which helps capture.",
            "Well, what kind of creative acts go in when you're building software and what kind of creative acts happen when the software runs and it captures various timelines which we had to really nail down.",
            "These are comparisons and the timelines in the beat on the diagrams, and every compare system A with system.",
            "Be an have an intuition about where their system be is progress over system A or not, and we couple these comparisons with audience valuation where at a very kind of audience evaluation level.",
            "Now in the field.",
            "And we ask, the audience is not just to compare the artifacts and evaluate them, but also evaluate the behaviors exhibited by the software and by the programmers and that will give us an estimate of whether obvious or potential progress has been made when we're building these systems with respect to both strong and weak objective.",
            "So."
        ],
        [
            "If you're interested in a build up to the background and how researchers have historically says progress, read some of Anna's papers.",
            "All our paper where we cover this.",
            "Don't have time to do it.",
            "Today.",
            "We build on the face model that we introduced earlier.",
            "Anna's already covered that where we breakdown creative acts into four types of generative axe generating framing information like a commentary, ascetics, and concepts.",
            "An examples or exemplars or expressions of those concepts we tried that desperately hardly dress really hard with Angelina, and we failed.",
            "Mike and I had a. Exhilarating afternoon.",
            "Failing to apply this to what's going on with Angelina?",
            "So we needed to extend it for sure.",
            "We've also building on this an extended version of this creatively tripod, which would just mentioned as well, so I want to correct something which is in your paper.",
            "There's a misunderstanding of what I wanted with this here, and maybe that's carried over into Anna's test.",
            "I never put forward skill appreciation imagination as a sufficient set for software to be labeled as creative.",
            "I said in the paper I just double check this.",
            "These behaviors are necessary to avoid the label uncreative if your software is not getting this skill is very easy to say uncreative.",
            "It doesn't really appreciate what it's doing.",
            "It's very easy to say uncreative.",
            "Similarly, if you can't project anything like an imaginative behavior into it, it's easier to say that it's uncreative then, if so, so it's definitely not the the necessary set to avoid on creativity is not the same as a sufficient set for creative, and I don't want that.",
            "Miss apprehension to going further right, especially as we've worked hard to extend this list of words when I'm working with Dan Ventura last year.",
            "So we've studied intentionality, learning, accountability, innovation, subjectivity, and reflection.",
            "An if your software doesn't exhibit one or more of those again, it's easy to beat it without uncreatively stick.",
            "And that's what I'm really interested in getting our software to be very difficult to label uncreative.",
            "I don't care whether people ever call the software creative because that's.",
            "Essentially contested and so, but avoiding being created, we have a much more consensus about what it means for software to be uncreative than we do about being creative."
        ],
        [
            "So that's the background.",
            "Just need to extend on the phase two pulls an so generative axe generates certain types of more information in the world or artifacts we've had to include that I think.",
            "Again, Anna picked up on this.",
            "We've included administrative acts now in square brackets as well as a generative vaccine, pointy brackets, an administration includes selecting things and translating things.",
            "Not particularly creative an optically generative.",
            "We've gone from ground level where you generate a poem to process level, where you invent a way of generating poems.",
            "To match the level where you come up with a way of inventing new poetry generating techniques.",
            "It's these three levels.",
            "I don't think we'd go any further right now, and we've put in an Asterix to describe repetition, so constraints at runtime the person here, the bar above the sea there is, indicating that a person did this and wrote a constraint satisfaction problem clicked on Gowanda, e.g.",
            "Without the bar is essentially saying the software found an example of that concept, constraint satisfaction problem being the.",
            "Concept in machine learning system for more interesting years and years ago some one or more likely a community came up with the aesthetic of.",
            "What's the overriding aesthetic in machine learning?",
            "Predictive accuracy an and so that was a Bard notation because that person did that.",
            "Then when you run machine learning software over your data fit, it invents a concept we call them rule sets or we call them concepts in machine learning.",
            "It produces a bunch of examples which satisfy that concept and a bunch of examples which don't satisfy the concepts that the positive negative examples for your learned rule and it also gives you framing information.",
            "It tells you how good that predictive accuracy is so that you can look at it and say, well no .6.",
            "I'm not going to look at that, but if there's No 9 predictive accuracy.",
            "And then what?",
            "You will then probably do is translate it.",
            "You translate the concept coming out.",
            "This is a lower case C Anna lowercase E. Here to represent the output from a creative act rather than credit bank itself.",
            "The face model is not easy, particularly when it gets more complicated like this.",
            "And I'm not going to say that that's going to change anytime soon.",
            "It's going to get more complicated, possibly to capture more of the creative process.",
            "There are."
        ],
        [
            "For we want to start separating out what people do when they're writing software and what software just to give him feedback during that process and what the software does at runtime, what the person does at runtime, and there's for fairly obvious timelines, big system level at the parks, where you deliver a new software development periods where you do your working articular modular code and you get it finished.",
            "Then when that code is run, information is passed from one code module to another, to another to another.",
            "That's a timeline OK. And then there are those.",
            "Surprises are creative, generative or administrative acts.",
            "These timelines are."
        ],
        [
            "If you look at the paper, it's got a number of diagrams in there and the blue arrow there is a system level timeline.",
            "The Brown arrow going down or the red arrow going down.",
            "Sorry is the development.",
            "The green Arrow going cross is the processing from module to module and the Brown our across the tuples.",
            "There are the individual generative acts, so that's how we've captured timelines and in there of course are all alface tuples or administrative tools, so it can be really quite precise.",
            "Of course this is all abstracted.",
            "Everything in science is an abstract.",
            "In reality this is no different than.",
            "And it may not capture everything you wanted to capture, and if not come back to us and we will try and make it better."
        ],
        [
            "There's a party generation example, but I'm going to skip over that for the sake of getting through the rest of the talk and again, see the paper.",
            "We've got a bigger example coming up."
        ],
        [
            "Just need to tell you the methodology, the methodology I think is possibly the weakest aspect of this approach right now and it will be tightened up when we actually do apply it in anger when you're developing as a programmer, you can just think about the diagram, maybe even write down some of these diagrams and think about how your previous version looked into your new version looks and see whether it's appropriate to save progress happen.",
            "When you do a more serious evaluation, you can work with an audience and we definitely recommend that working out in advance if you can.",
            "Whether you have strong or weak objectives.",
            "If that's a meaningful in this domain in going from version one of your software to version 2.",
            "Tell audience members about how they both work, how they were developed, what they do at runtime, and if you want to use these diagrams.",
            "I think these diagrams aren't that difficult to interpret.",
            "Ask audience members pointed questions about their creativity.",
            "Tripod behaviors is version one showing more intentionality than version two.",
            "Is it more skillful than version 2 version one and also ask them if their perceived level or the level of interesting behaviors as increased or decreased.",
            "Similarly, exposure audience members to the artifacts produced by the system, and SMF perceived level of value of these artifacts is going up or down somehow average over these.",
            "Do your stats and get some measures of process and product change.",
            "And then use our guidelines on the next slide to adapt and adapt them to fit your purpose.",
            "If you're only interested in intentionality being increased, the perception of intentionality being increased, then of course just concentrate on that.",
            "The guidelines were picked up by the review as being a little bit weak, and we agree to some extent with that."
        ],
        [
            "There's a bit hand WAVY, but if the value of your product goes up and everyone thinks your software is doing more interesting behaviors, then that's obvious progression.",
            "OPI in a week and a strong sense as a first line of the topic, it gets a bit more murky halfway down, so imagine that your let's choose that one there.",
            "Imagine that your the value of your product goes down.",
            "These poems are really not well received with your new version of your software, then your previous version of the software.",
            "This is a latent heat problem.",
            "However, people say but yourself with being really creative is doing all these wonderful behaviors, so that should me would be possible regress in the week sense 'cause you got worse poems to send to your friends but possible progress in the strong sense in a sense that will probably more likely to project the word less likely to project on creativity under the software than we were before.",
            "Again, have the paper for the details then.",
            "We"
        ],
        [
            "This case did it and I don't have time to go in today unfortunately, but I would ask you to if you're interested in this model, have a look at it."
        ],
        [
            "We breakdown on the building of an evolutionary our software into various epochs.",
            "Various systems, I think nine of them, and we go through in an abstract way.",
            "How you start with a very simple evolutionary or piece of software which just merges together to mathematical functions generates an image and prints it.",
            "P stands for printer him all the way to something which is Uber autonomous.",
            "It invents new methods of crossing over the Geno types.",
            "It invents new aesthetic measures.",
            "It invents new way of framing its information.",
            "All at the process level.",
            "And yes, I wish I had time to go into more detail, but I would entreat you to have a look at the diagram."
        ],
        [
            "When we come, when you look at the paper and you end up with this situation with with Box #8."
        ],
        [
            "Where it's difficult to imagine the software being more autonomous can do different things, but it invents its own aesthetics.",
            "It invents its own crossover mechanism.",
            "It invents its own way of going from the Geno type to the phenotype or a rapper Anet frames all of this."
        ],
        [
            "And in the paper we tell you going from.",
            "System one to six.",
            "Why that should be seen as progress and similar from 67 and 5:00 and 7:00 to 8:00.",
            "You can track down how we believe that this these systems are progressing in terms of process."
        ],
        [
            "Please see the paper.",
            "We've applied it in lots of systems an and yeah, just wanted to respond to one reviewer criticism, which is that you can apply this to all sorts of software, not just creative software.",
            "I thought yes, you're right.",
            "And then I realized, well, that's not actually criticism.",
            "Yes, we can apply it to investors, but that doesn't mean to say that things which are applied to industrial factory software help us find things out about our creative software, so it's not actually.",
            "We didn't think there was actually criticism later on."
        ],
        [
            "Did you work last line?",
            "We are going to tie this up with Karen's model of creating systems framework, specially about when software does search in the search space is explore.",
            "We definitely want to do.",
            "We want to get more acute rather than just saying has a value of artifacts going to put down.",
            "We can appeal to a gram.",
            "Richard Criterium I'm also interested in cognitive expenditure.",
            "How long you spend trying to understand a poem or how well.",
            "How much does that change your well being up or down?",
            "We want to see whether certain hypothesis.",
            "To do with our Flex optical standpoint, add up and we also want you guys to come forward and say I can abstract how we built this software and how we run this software.",
            "Can you?"
        ],
        [
            "It was captured at Diagrammatically and that will definitely highlight limitations in the approach and then we will have a stronger, more precise model to assess progress with.",
            "Sorry for going over by a minute."
        ],
        [
            "Thank you.",
            "Regarding the issue that you mentioned about the tripod and the weather or not sufficient thing, I remember being a bit confused about that from the paper.",
            "I don't know if I did talk about that or not, but that wasn't the core issue and the thing that.",
            "I was more concerned with and I. I'm just curious you you you kind of capture at the very beginning of talk by saying that one of your aims is to convince people that water software is doing is worthy of being creative.",
            "OK, I think that was what you said on one of the first slides.",
            "Is that well, I really tried to.",
            "I really do mean it when I say avoid being called uncreative like choose those words very carefully.",
            "OK, it was being perceived as uncreative but it was to convince people that part.",
            "That yeah, that strikes me as I see that as being more the task of a lawyer than of a scientist and that actually that's that's not a good aim.",
            "And I think that what you were doing with imagination in that.",
            "The tripod paper was trying to do that.",
            "Trying to try like taking the concept of a valuation, identifying the kind of block of code in your system where.",
            "You're you're perceiving evaluation and then kind of trying to build a case that that's.",
            "Imagination.",
            "And I know I'm not comfortable with this secondary quality.",
            "All of these behaviors of secondary causes.",
            "I wouldn't say you can say that is imagination.",
            "I would say when you describe to people what the software is done there, and maybe you can point to some individual code for that, then a number of people would say it's I perceive what the software is done as being imaginative, just like you might say when a child does something, you would say whatever they've done there with imaginative.",
            "In our case we can see what the software is done, which might lower the impression of imaginative behavior, but.",
            "That's a problem we have to live with just getting by the truck, but I think that's actually my fault.",
            "Calling it a tripod, you're not the first person to interpret those three terms as as a sufficient condition for creativity to be supportive so that it doesn't really bother me if it's sufficient or not.",
            "By the way, if you spend half aside in your paper, using that misunderstanding of two to this, the approach to some extent, and you say that Dan used it to address his software, and so either which were patiently uncreative.",
            "So either we, you know we ditch the mechanism, or we have to disagree with this and call creative software, which is clearly not, and I just I worry that I never intended to address.",
            "Creativity is all about avoiding on creativity and I'm a tripod analogy with probably the wrong one because yeah, so I'm not sure how to say this question just right, but when you were giving your little example early on about OK, let's look at machine learning and then you put a little expression there.",
            "I actually didn't agree with that, and that's not the point.",
            "We can argue about that later.",
            "It's an important point.",
            "Yeah, the point is a meta version of that, and that is.",
            "Is it?",
            "Is it going to be possible to have people agree with any of these kind of things where you take a system and you write out an expression or a big diagram, and then I look at that same system and say no.",
            "I think this error goes here.",
            "And how do you?",
            "How do you deal with that?",
            "This seems tricky, it death and that's why we need more people to work on it.",
            "I all I can say is that we have applied it to things like Angelina and we came to a consensus.",
            "Angela isn't my software, so Mike was able.",
            "Well, mine was able to because we introduced all these timelines.",
            "Similarly, the other systems that we've.",
            "Looked at when I Allison I've been discussing this for years and we can come to consensus, but we know that that's not the only way of describing a system.",
            "Same way if you'd used any way of describing system, you'd have variations of it, but so the beauty of this is that you're not really interested in whether you're capturing the description of the software perfectly.",
            "As long as going from system A to system B, you're doing something like removing a bar, so the software now does something that previously you did.",
            "Or there's a new generative acting there, so it finally there's a static generator.",
            "Doesn't matter whether it's actually capturing perfectly what the software is, as long as you can tell that progress has been made in terms of the diagram changing, and as long as the person before will agree that there was a bar there and you've removed it.",
            "Yeah, that's the tricky part of yes.",
            "You have to convince people, went out of time, so let's thank Simon again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so I'm interested in progress in our field in computer creativity.",
                    "label": 0
                },
                {
                    "sent": "This whole talk in the paper is completely.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Influenced by this philosophical perspective, which we are now beginning to get quite mature.",
                    "label": 0
                },
                {
                    "sent": "So we've written a number of papers about this.",
                    "label": 0
                },
                {
                    "sent": "Very briefly, my particular interest in this field is to get creative software ubiquitously embedded in society.",
                    "label": 1
                },
                {
                    "sent": "Creative fridges created for iPods, creative everything.",
                    "label": 0
                },
                {
                    "sent": "So that's where I'm coming from.",
                    "label": 0
                },
                {
                    "sent": "I'm less interested in understanding human creativity.",
                    "label": 1
                },
                {
                    "sent": "I I see creativity in people or software as a secondary quality.",
                    "label": 0
                },
                {
                    "sent": "There is no creativity, organ insiders and no creativity gene.",
                    "label": 1
                },
                {
                    "sent": "There's no creativity algorithm or set of algorithms.",
                    "label": 0
                },
                {
                    "sent": "This is a word that we project onto people.",
                    "label": 0
                },
                {
                    "sent": "If we observe their behaviors and we believe their behaviors are creative and if they do that in a long term way, we might just use the shorthand.",
                    "label": 1
                },
                {
                    "sent": "They are creative when we really mean they regularly undertake behaviors which we are prepared to call creative.",
                    "label": 0
                },
                {
                    "sent": "I have an hour to thank for introducing me to the notion of essentially contested concepts.",
                    "label": 0
                },
                {
                    "sent": "Have to think about it all.",
                    "label": 0
                },
                {
                    "sent": "He mentioned this.",
                    "label": 0
                },
                {
                    "sent": "Why don't we know what art is?",
                    "label": 0
                },
                {
                    "sent": "Why don't we know what creativity is?",
                    "label": 0
                },
                {
                    "sent": "I mean, are we really that stupid as a species, or have we tacitly agreed to disagree?",
                    "label": 0
                },
                {
                    "sent": "Have we realized that there are certain things which it's better?",
                    "label": 0
                },
                {
                    "sent": "It's more beneficial for our SoC to disagree on because they drive forward.",
                    "label": 0
                },
                {
                    "sent": "Progress.",
                    "label": 1
                },
                {
                    "sent": "Art is one of those.",
                    "label": 0
                },
                {
                    "sent": "How many articles in newspapers this year will say yes?",
                    "label": 0
                },
                {
                    "sent": "But is it art?",
                    "label": 0
                },
                {
                    "sent": "We could say the same thing here, yes.",
                    "label": 1
                },
                {
                    "sent": "But is it creativity?",
                    "label": 0
                },
                {
                    "sent": "So I think it's a good thing.",
                    "label": 0
                },
                {
                    "sent": "This is very healthy SoC.",
                    "label": 0
                },
                {
                    "sent": "Scary as hell for our community because definitions of creativity are not going to come anytime soon.",
                    "label": 0
                },
                {
                    "sent": "I worry about artifact based assessment like sharing style tests as actually emphasizing the humanity gap.",
                    "label": 1
                },
                {
                    "sent": "Software isn't human.",
                    "label": 0
                },
                {
                    "sent": "And it never will be, and therefore we can either carry on doing these tests, or we can embrace that different.",
                    "label": 0
                },
                {
                    "sent": "But I think when you when you put all tracks out there from people and from software, actually people realize they wanted the human connection.",
                    "label": 0
                },
                {
                    "sent": "This is a hypothesis which will test one state.",
                    "label": 0
                },
                {
                    "sent": "Finally, Allison, I was like taking up a tight shoe when we stopped talking about the creative software and the value of artifacts abit like Ali throwing away definition in this morning.",
                    "label": 0
                },
                {
                    "sent": "Not this morning that name, but rather looking at what progress means in our field.",
                    "label": 0
                },
                {
                    "sent": "Progress of a project.",
                    "label": 0
                },
                {
                    "sent": "And that's with respect to weak and strong objectives, so this is not particularly controversial anymore.",
                    "label": 1
                },
                {
                    "sent": "We have weak.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Objective when we have these creative projects, that's to produce artifacts of wonder which just so happens to have a computational help.",
                    "label": 0
                },
                {
                    "sent": "Strong objective in our projects are to convince people that what our software is doing.",
                    "label": 1
                },
                {
                    "sent": "Its behavior is worthy of being called creative, and I certainly engage in both aspects when I'm doing a major project.",
                    "label": 1
                },
                {
                    "sent": "And of course, I think in the future these two types of objective will probably merge in time.",
                    "label": 0
                },
                {
                    "sent": "I think it would be extremely difficult to produce artifacts of wonder.",
                    "label": 0
                },
                {
                    "sent": "Without software, that is something you can project creatively onto and I think if we are going to produce them such wonderful objects, we won't be able to do it without software which is creative.",
                    "label": 0
                },
                {
                    "sent": "So they will merge in time, but they aren't particularly merged at the moment.",
                    "label": 0
                },
                {
                    "sent": "So progress in building software.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Generates artifacts so very wordy talk I'm I'm sorry, I apologize about that, so we actually want more formalism in describing how criticisms are built, how they operate at runtime, and the value of artifacts they produce.",
                    "label": 1
                },
                {
                    "sent": "I think as many people have mentioned that they will enable us to have a more scientific approach to assessing progress in the field an in particularly engineering of a system as it progresses through various stages, and we want to know we're making progress when we were writing code until the small hours of the morning.",
                    "label": 1
                },
                {
                    "sent": "So I think artifact based assessment relies on this assumption that if software is producing better and better artifacts, it must be getting more and more creative.",
                    "label": 0
                },
                {
                    "sent": "But I think that's a false assumption sometimes, not always an it said he doesn't capture all the notions of progress we have in the field.",
                    "label": 0
                },
                {
                    "sent": "I think we cheat with that.",
                    "label": 0
                },
                {
                    "sent": "I certainly do.",
                    "label": 1
                },
                {
                    "sent": "If I've got an exhibition coming up, I'm going to create a lot more.",
                    "label": 0
                },
                {
                    "sent": "I don't allow myself to alter the pictures that my software comes out with photo shop, but you know, if push came to shove, I might.",
                    "label": 0
                },
                {
                    "sent": "So I've already said the thing about humanity.",
                    "label": 0
                },
                {
                    "sent": "Everything is worrying and we know that hangover created responsibility.",
                    "label": 0
                },
                {
                    "sent": "Software committing decreasing the value of the artifacts.",
                    "label": 0
                },
                {
                    "sent": "Allison would call this U shaped creativity.",
                    "label": 1
                },
                {
                    "sent": "I think we've been calling it latent heat effect so things are going to get worse before they get better.",
                    "label": 0
                },
                {
                    "sent": "If you were handing over creative license to your software and that doesn't match up if you're just using artifact value to assess program.",
                    "label": 0
                },
                {
                    "sent": "And we're actually working.",
                    "label": 0
                },
                {
                    "sent": "I'm increasingly more fluid situation.",
                    "label": 0
                },
                {
                    "sent": "I want myself.",
                    "label": 0
                },
                {
                    "sent": "What you invent?",
                    "label": 0
                },
                {
                    "sent": "Value judgments, not just slavishly attempt to producing which match mine or other people's judgment.",
                    "label": 0
                },
                {
                    "sent": "So I think just basing things on artifacts.",
                    "label": 0
                },
                {
                    "sent": "It has many limitations, and I'm more interested.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Process.",
                    "label": 0
                },
                {
                    "sent": "So I want to be clear about this slide in the next slide, because I'm it follows a narrative paper, but I've rephrased it an refocused it specifically to address some issues raised by Colin Colin Johnson in his paper color has paper delivered tomorrow saying it's it's time for complicated, grow up and become irresponsible.",
                    "label": 0
                },
                {
                    "sent": "So I think so this slide in the next time I'm specifically referencing them up to calling this and you'll have a chance to respond tomorrow.",
                    "label": 0
                },
                {
                    "sent": "I hope.",
                    "label": 0
                },
                {
                    "sent": "So I think progress can be measured in terms of the seed.",
                    "label": 1
                },
                {
                    "sent": "Creative alternative software has.",
                    "label": 0
                },
                {
                    "sent": "And in general, how people perceive what the software does, its behavior with respect to issues of creativity, intelligence and autonomy.",
                    "label": 1
                },
                {
                    "sent": "I think it's time for us to grow up and start talking about the creative responsibility that we bring to a project and not shying away from that.",
                    "label": 0
                },
                {
                    "sent": "Saying, well, I did all that.",
                    "label": 0
                },
                {
                    "sent": "The software did this.",
                    "label": 0
                },
                {
                    "sent": "I did that, and as we had that over be clear about it so that we know how the software is contributing, and I think that's the only way to demystify an formalize the kind of creative acts that we and our software do in these kind of week.",
                    "label": 0
                },
                {
                    "sent": "And strong projects, and I think that's the best way to measure progress, is to break that down and see whether software is doing more than it used to do, regardless of whether the artifacts are any good or not.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'm laboring this point so far isn't another human jazz musician that you play along with.",
                    "label": 1
                },
                {
                    "sent": "It is actively indecisively, programmed by Earth and others, so that naturally changes the perception that people have of autonomy.",
                    "label": 1
                },
                {
                    "sent": "How many times a year do I hear?",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, but you're the creative 1 Oh no no no no yeah yeah yeah you're the artist and I know it's just a mini, you know.",
                    "label": 0
                },
                {
                    "sent": "So people do have that perception because we program.",
                    "label": 0
                },
                {
                    "sent": "This is not.",
                    "label": 0
                },
                {
                    "sent": "We're not teaching this software by which children.",
                    "label": 0
                },
                {
                    "sent": "We were telling exactly what to do, and that's notwithstanding the fact that we teach software to learn your way through machine learning.",
                    "label": 0
                },
                {
                    "sent": "I think we still have to cater for that, so we have to do more to address what software actually does, not just celebrate the fact that the system came up with some brilliant creation or the system with creative.",
                    "label": 1
                },
                {
                    "sent": "So Colin uses phrases such as diffuse responsibilities and murky situation.",
                    "label": 0
                },
                {
                    "sent": "And in this case is I think it's the default position is to project the autonomy and the creativity onto the people in the system.",
                    "label": 0
                },
                {
                    "sent": "And I want to try and move away from that so.",
                    "label": 0
                },
                {
                    "sent": "The software gets a fair credit for what it's doing and we can see how big that credit gets overtime and assess progress.",
                    "label": 0
                },
                {
                    "sent": "I think there is diffuse, but we managed to work out what's in air and predict its flow.",
                    "label": 0
                },
                {
                    "sent": "I think if you look at how a bird flies, it uses every part of its body, but that's a murky situation when you start out, but we literally dissect birds and we workout how individual, possibly bodies work.",
                    "label": 0
                },
                {
                    "sent": "What goes into the flying mechanism and we study it scientifically, and I'm suggesting doing the same for creativity.",
                    "label": 0
                },
                {
                    "sent": "No feathery friends will have to die as a result of this kind of dissection, so people make decisions, do things, software, makes decisions, do things each influence the others.",
                    "label": 1
                },
                {
                    "sent": "These are things that can be at least approximately measured, and I agree with Colin that things are murky right now because we haven't started formalizing things.",
                    "label": 0
                },
                {
                    "sent": "And that's where this talk comes in and the previous talks in this session, in particular ones.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "With Dan's usage of the methodology, so sequence talk tomorrow for rebuttal of that or certainly alternative perspective where we talk about system level, creativity.",
                    "label": 0
                },
                {
                    "sent": "So the approach I'm projecting today is a melange mixture of the two.",
                    "label": 0
                },
                {
                    "sent": "Tripod and the face model and extra stuff thrown in.",
                    "label": 0
                },
                {
                    "sent": "The energy is presented so we start with a simplifying assumption of a person or a team building a single piece of software which generates an artifact like a poem or painting over a video game in a particular domain, and occasionally you release a version to the world, or you've got a major milestone, like an exhibition or a game jam or approach reading, and that's a version of the software which you nailed down and we've got this graphical formulas in which helps capture.",
                    "label": 1
                },
                {
                    "sent": "Well, what kind of creative acts go in when you're building software and what kind of creative acts happen when the software runs and it captures various timelines which we had to really nail down.",
                    "label": 0
                },
                {
                    "sent": "These are comparisons and the timelines in the beat on the diagrams, and every compare system A with system.",
                    "label": 0
                },
                {
                    "sent": "Be an have an intuition about where their system be is progress over system A or not, and we couple these comparisons with audience valuation where at a very kind of audience evaluation level.",
                    "label": 0
                },
                {
                    "sent": "Now in the field.",
                    "label": 0
                },
                {
                    "sent": "And we ask, the audience is not just to compare the artifacts and evaluate them, but also evaluate the behaviors exhibited by the software and by the programmers and that will give us an estimate of whether obvious or potential progress has been made when we're building these systems with respect to both strong and weak objective.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If you're interested in a build up to the background and how researchers have historically says progress, read some of Anna's papers.",
                    "label": 1
                },
                {
                    "sent": "All our paper where we cover this.",
                    "label": 0
                },
                {
                    "sent": "Don't have time to do it.",
                    "label": 0
                },
                {
                    "sent": "Today.",
                    "label": 0
                },
                {
                    "sent": "We build on the face model that we introduced earlier.",
                    "label": 1
                },
                {
                    "sent": "Anna's already covered that where we breakdown creative acts into four types of generative axe generating framing information like a commentary, ascetics, and concepts.",
                    "label": 0
                },
                {
                    "sent": "An examples or exemplars or expressions of those concepts we tried that desperately hardly dress really hard with Angelina, and we failed.",
                    "label": 0
                },
                {
                    "sent": "Mike and I had a. Exhilarating afternoon.",
                    "label": 0
                },
                {
                    "sent": "Failing to apply this to what's going on with Angelina?",
                    "label": 0
                },
                {
                    "sent": "So we needed to extend it for sure.",
                    "label": 0
                },
                {
                    "sent": "We've also building on this an extended version of this creatively tripod, which would just mentioned as well, so I want to correct something which is in your paper.",
                    "label": 1
                },
                {
                    "sent": "There's a misunderstanding of what I wanted with this here, and maybe that's carried over into Anna's test.",
                    "label": 0
                },
                {
                    "sent": "I never put forward skill appreciation imagination as a sufficient set for software to be labeled as creative.",
                    "label": 0
                },
                {
                    "sent": "I said in the paper I just double check this.",
                    "label": 1
                },
                {
                    "sent": "These behaviors are necessary to avoid the label uncreative if your software is not getting this skill is very easy to say uncreative.",
                    "label": 0
                },
                {
                    "sent": "It doesn't really appreciate what it's doing.",
                    "label": 0
                },
                {
                    "sent": "It's very easy to say uncreative.",
                    "label": 0
                },
                {
                    "sent": "Similarly, if you can't project anything like an imaginative behavior into it, it's easier to say that it's uncreative then, if so, so it's definitely not the the necessary set to avoid on creativity is not the same as a sufficient set for creative, and I don't want that.",
                    "label": 0
                },
                {
                    "sent": "Miss apprehension to going further right, especially as we've worked hard to extend this list of words when I'm working with Dan Ventura last year.",
                    "label": 1
                },
                {
                    "sent": "So we've studied intentionality, learning, accountability, innovation, subjectivity, and reflection.",
                    "label": 0
                },
                {
                    "sent": "An if your software doesn't exhibit one or more of those again, it's easy to beat it without uncreatively stick.",
                    "label": 0
                },
                {
                    "sent": "And that's what I'm really interested in getting our software to be very difficult to label uncreative.",
                    "label": 0
                },
                {
                    "sent": "I don't care whether people ever call the software creative because that's.",
                    "label": 0
                },
                {
                    "sent": "Essentially contested and so, but avoiding being created, we have a much more consensus about what it means for software to be uncreative than we do about being creative.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that's the background.",
                    "label": 0
                },
                {
                    "sent": "Just need to extend on the phase two pulls an so generative axe generates certain types of more information in the world or artifacts we've had to include that I think.",
                    "label": 0
                },
                {
                    "sent": "Again, Anna picked up on this.",
                    "label": 0
                },
                {
                    "sent": "We've included administrative acts now in square brackets as well as a generative vaccine, pointy brackets, an administration includes selecting things and translating things.",
                    "label": 1
                },
                {
                    "sent": "Not particularly creative an optically generative.",
                    "label": 0
                },
                {
                    "sent": "We've gone from ground level where you generate a poem to process level, where you invent a way of generating poems.",
                    "label": 0
                },
                {
                    "sent": "To match the level where you come up with a way of inventing new poetry generating techniques.",
                    "label": 0
                },
                {
                    "sent": "It's these three levels.",
                    "label": 0
                },
                {
                    "sent": "I don't think we'd go any further right now, and we've put in an Asterix to describe repetition, so constraints at runtime the person here, the bar above the sea there is, indicating that a person did this and wrote a constraint satisfaction problem clicked on Gowanda, e.g.",
                    "label": 0
                },
                {
                    "sent": "Without the bar is essentially saying the software found an example of that concept, constraint satisfaction problem being the.",
                    "label": 0
                },
                {
                    "sent": "Concept in machine learning system for more interesting years and years ago some one or more likely a community came up with the aesthetic of.",
                    "label": 0
                },
                {
                    "sent": "What's the overriding aesthetic in machine learning?",
                    "label": 0
                },
                {
                    "sent": "Predictive accuracy an and so that was a Bard notation because that person did that.",
                    "label": 0
                },
                {
                    "sent": "Then when you run machine learning software over your data fit, it invents a concept we call them rule sets or we call them concepts in machine learning.",
                    "label": 0
                },
                {
                    "sent": "It produces a bunch of examples which satisfy that concept and a bunch of examples which don't satisfy the concepts that the positive negative examples for your learned rule and it also gives you framing information.",
                    "label": 0
                },
                {
                    "sent": "It tells you how good that predictive accuracy is so that you can look at it and say, well no .6.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to look at that, but if there's No 9 predictive accuracy.",
                    "label": 0
                },
                {
                    "sent": "And then what?",
                    "label": 0
                },
                {
                    "sent": "You will then probably do is translate it.",
                    "label": 0
                },
                {
                    "sent": "You translate the concept coming out.",
                    "label": 0
                },
                {
                    "sent": "This is a lower case C Anna lowercase E. Here to represent the output from a creative act rather than credit bank itself.",
                    "label": 1
                },
                {
                    "sent": "The face model is not easy, particularly when it gets more complicated like this.",
                    "label": 0
                },
                {
                    "sent": "And I'm not going to say that that's going to change anytime soon.",
                    "label": 0
                },
                {
                    "sent": "It's going to get more complicated, possibly to capture more of the creative process.",
                    "label": 0
                },
                {
                    "sent": "There are.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For we want to start separating out what people do when they're writing software and what software just to give him feedback during that process and what the software does at runtime, what the person does at runtime, and there's for fairly obvious timelines, big system level at the parks, where you deliver a new software development periods where you do your working articular modular code and you get it finished.",
                    "label": 1
                },
                {
                    "sent": "Then when that code is run, information is passed from one code module to another, to another to another.",
                    "label": 1
                },
                {
                    "sent": "That's a timeline OK. And then there are those.",
                    "label": 1
                },
                {
                    "sent": "Surprises are creative, generative or administrative acts.",
                    "label": 0
                },
                {
                    "sent": "These timelines are.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you look at the paper, it's got a number of diagrams in there and the blue arrow there is a system level timeline.",
                    "label": 0
                },
                {
                    "sent": "The Brown arrow going down or the red arrow going down.",
                    "label": 0
                },
                {
                    "sent": "Sorry is the development.",
                    "label": 0
                },
                {
                    "sent": "The green Arrow going cross is the processing from module to module and the Brown our across the tuples.",
                    "label": 0
                },
                {
                    "sent": "There are the individual generative acts, so that's how we've captured timelines and in there of course are all alface tuples or administrative tools, so it can be really quite precise.",
                    "label": 0
                },
                {
                    "sent": "Of course this is all abstracted.",
                    "label": 0
                },
                {
                    "sent": "Everything in science is an abstract.",
                    "label": 0
                },
                {
                    "sent": "In reality this is no different than.",
                    "label": 0
                },
                {
                    "sent": "And it may not capture everything you wanted to capture, and if not come back to us and we will try and make it better.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's a party generation example, but I'm going to skip over that for the sake of getting through the rest of the talk and again, see the paper.",
                    "label": 0
                },
                {
                    "sent": "We've got a bigger example coming up.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just need to tell you the methodology, the methodology I think is possibly the weakest aspect of this approach right now and it will be tightened up when we actually do apply it in anger when you're developing as a programmer, you can just think about the diagram, maybe even write down some of these diagrams and think about how your previous version looked into your new version looks and see whether it's appropriate to save progress happen.",
                    "label": 0
                },
                {
                    "sent": "When you do a more serious evaluation, you can work with an audience and we definitely recommend that working out in advance if you can.",
                    "label": 0
                },
                {
                    "sent": "Whether you have strong or weak objectives.",
                    "label": 1
                },
                {
                    "sent": "If that's a meaningful in this domain in going from version one of your software to version 2.",
                    "label": 0
                },
                {
                    "sent": "Tell audience members about how they both work, how they were developed, what they do at runtime, and if you want to use these diagrams.",
                    "label": 1
                },
                {
                    "sent": "I think these diagrams aren't that difficult to interpret.",
                    "label": 0
                },
                {
                    "sent": "Ask audience members pointed questions about their creativity.",
                    "label": 1
                },
                {
                    "sent": "Tripod behaviors is version one showing more intentionality than version two.",
                    "label": 1
                },
                {
                    "sent": "Is it more skillful than version 2 version one and also ask them if their perceived level or the level of interesting behaviors as increased or decreased.",
                    "label": 1
                },
                {
                    "sent": "Similarly, exposure audience members to the artifacts produced by the system, and SMF perceived level of value of these artifacts is going up or down somehow average over these.",
                    "label": 0
                },
                {
                    "sent": "Do your stats and get some measures of process and product change.",
                    "label": 0
                },
                {
                    "sent": "And then use our guidelines on the next slide to adapt and adapt them to fit your purpose.",
                    "label": 0
                },
                {
                    "sent": "If you're only interested in intentionality being increased, the perception of intentionality being increased, then of course just concentrate on that.",
                    "label": 0
                },
                {
                    "sent": "The guidelines were picked up by the review as being a little bit weak, and we agree to some extent with that.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's a bit hand WAVY, but if the value of your product goes up and everyone thinks your software is doing more interesting behaviors, then that's obvious progression.",
                    "label": 0
                },
                {
                    "sent": "OPI in a week and a strong sense as a first line of the topic, it gets a bit more murky halfway down, so imagine that your let's choose that one there.",
                    "label": 0
                },
                {
                    "sent": "Imagine that your the value of your product goes down.",
                    "label": 0
                },
                {
                    "sent": "These poems are really not well received with your new version of your software, then your previous version of the software.",
                    "label": 0
                },
                {
                    "sent": "This is a latent heat problem.",
                    "label": 0
                },
                {
                    "sent": "However, people say but yourself with being really creative is doing all these wonderful behaviors, so that should me would be possible regress in the week sense 'cause you got worse poems to send to your friends but possible progress in the strong sense in a sense that will probably more likely to project the word less likely to project on creativity under the software than we were before.",
                    "label": 0
                },
                {
                    "sent": "Again, have the paper for the details then.",
                    "label": 0
                },
                {
                    "sent": "We",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This case did it and I don't have time to go in today unfortunately, but I would ask you to if you're interested in this model, have a look at it.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We breakdown on the building of an evolutionary our software into various epochs.",
                    "label": 0
                },
                {
                    "sent": "Various systems, I think nine of them, and we go through in an abstract way.",
                    "label": 0
                },
                {
                    "sent": "How you start with a very simple evolutionary or piece of software which just merges together to mathematical functions generates an image and prints it.",
                    "label": 0
                },
                {
                    "sent": "P stands for printer him all the way to something which is Uber autonomous.",
                    "label": 0
                },
                {
                    "sent": "It invents new methods of crossing over the Geno types.",
                    "label": 0
                },
                {
                    "sent": "It invents new aesthetic measures.",
                    "label": 0
                },
                {
                    "sent": "It invents new way of framing its information.",
                    "label": 0
                },
                {
                    "sent": "All at the process level.",
                    "label": 0
                },
                {
                    "sent": "And yes, I wish I had time to go into more detail, but I would entreat you to have a look at the diagram.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When we come, when you look at the paper and you end up with this situation with with Box #8.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Where it's difficult to imagine the software being more autonomous can do different things, but it invents its own aesthetics.",
                    "label": 0
                },
                {
                    "sent": "It invents its own crossover mechanism.",
                    "label": 0
                },
                {
                    "sent": "It invents its own way of going from the Geno type to the phenotype or a rapper Anet frames all of this.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in the paper we tell you going from.",
                    "label": 0
                },
                {
                    "sent": "System one to six.",
                    "label": 0
                },
                {
                    "sent": "Why that should be seen as progress and similar from 67 and 5:00 and 7:00 to 8:00.",
                    "label": 0
                },
                {
                    "sent": "You can track down how we believe that this these systems are progressing in terms of process.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Please see the paper.",
                    "label": 0
                },
                {
                    "sent": "We've applied it in lots of systems an and yeah, just wanted to respond to one reviewer criticism, which is that you can apply this to all sorts of software, not just creative software.",
                    "label": 0
                },
                {
                    "sent": "I thought yes, you're right.",
                    "label": 0
                },
                {
                    "sent": "And then I realized, well, that's not actually criticism.",
                    "label": 0
                },
                {
                    "sent": "Yes, we can apply it to investors, but that doesn't mean to say that things which are applied to industrial factory software help us find things out about our creative software, so it's not actually.",
                    "label": 0
                },
                {
                    "sent": "We didn't think there was actually criticism later on.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Did you work last line?",
                    "label": 0
                },
                {
                    "sent": "We are going to tie this up with Karen's model of creating systems framework, specially about when software does search in the search space is explore.",
                    "label": 1
                },
                {
                    "sent": "We definitely want to do.",
                    "label": 1
                },
                {
                    "sent": "We want to get more acute rather than just saying has a value of artifacts going to put down.",
                    "label": 0
                },
                {
                    "sent": "We can appeal to a gram.",
                    "label": 1
                },
                {
                    "sent": "Richard Criterium I'm also interested in cognitive expenditure.",
                    "label": 0
                },
                {
                    "sent": "How long you spend trying to understand a poem or how well.",
                    "label": 0
                },
                {
                    "sent": "How much does that change your well being up or down?",
                    "label": 1
                },
                {
                    "sent": "We want to see whether certain hypothesis.",
                    "label": 0
                },
                {
                    "sent": "To do with our Flex optical standpoint, add up and we also want you guys to come forward and say I can abstract how we built this software and how we run this software.",
                    "label": 0
                },
                {
                    "sent": "Can you?",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It was captured at Diagrammatically and that will definitely highlight limitations in the approach and then we will have a stronger, more precise model to assess progress with.",
                    "label": 0
                },
                {
                    "sent": "Sorry for going over by a minute.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Regarding the issue that you mentioned about the tripod and the weather or not sufficient thing, I remember being a bit confused about that from the paper.",
                    "label": 0
                },
                {
                    "sent": "I don't know if I did talk about that or not, but that wasn't the core issue and the thing that.",
                    "label": 0
                },
                {
                    "sent": "I was more concerned with and I. I'm just curious you you you kind of capture at the very beginning of talk by saying that one of your aims is to convince people that water software is doing is worthy of being creative.",
                    "label": 0
                },
                {
                    "sent": "OK, I think that was what you said on one of the first slides.",
                    "label": 0
                },
                {
                    "sent": "Is that well, I really tried to.",
                    "label": 0
                },
                {
                    "sent": "I really do mean it when I say avoid being called uncreative like choose those words very carefully.",
                    "label": 0
                },
                {
                    "sent": "OK, it was being perceived as uncreative but it was to convince people that part.",
                    "label": 0
                },
                {
                    "sent": "That yeah, that strikes me as I see that as being more the task of a lawyer than of a scientist and that actually that's that's not a good aim.",
                    "label": 0
                },
                {
                    "sent": "And I think that what you were doing with imagination in that.",
                    "label": 0
                },
                {
                    "sent": "The tripod paper was trying to do that.",
                    "label": 0
                },
                {
                    "sent": "Trying to try like taking the concept of a valuation, identifying the kind of block of code in your system where.",
                    "label": 0
                },
                {
                    "sent": "You're you're perceiving evaluation and then kind of trying to build a case that that's.",
                    "label": 0
                },
                {
                    "sent": "Imagination.",
                    "label": 0
                },
                {
                    "sent": "And I know I'm not comfortable with this secondary quality.",
                    "label": 0
                },
                {
                    "sent": "All of these behaviors of secondary causes.",
                    "label": 0
                },
                {
                    "sent": "I wouldn't say you can say that is imagination.",
                    "label": 0
                },
                {
                    "sent": "I would say when you describe to people what the software is done there, and maybe you can point to some individual code for that, then a number of people would say it's I perceive what the software is done as being imaginative, just like you might say when a child does something, you would say whatever they've done there with imaginative.",
                    "label": 0
                },
                {
                    "sent": "In our case we can see what the software is done, which might lower the impression of imaginative behavior, but.",
                    "label": 0
                },
                {
                    "sent": "That's a problem we have to live with just getting by the truck, but I think that's actually my fault.",
                    "label": 0
                },
                {
                    "sent": "Calling it a tripod, you're not the first person to interpret those three terms as as a sufficient condition for creativity to be supportive so that it doesn't really bother me if it's sufficient or not.",
                    "label": 0
                },
                {
                    "sent": "By the way, if you spend half aside in your paper, using that misunderstanding of two to this, the approach to some extent, and you say that Dan used it to address his software, and so either which were patiently uncreative.",
                    "label": 0
                },
                {
                    "sent": "So either we, you know we ditch the mechanism, or we have to disagree with this and call creative software, which is clearly not, and I just I worry that I never intended to address.",
                    "label": 0
                },
                {
                    "sent": "Creativity is all about avoiding on creativity and I'm a tripod analogy with probably the wrong one because yeah, so I'm not sure how to say this question just right, but when you were giving your little example early on about OK, let's look at machine learning and then you put a little expression there.",
                    "label": 0
                },
                {
                    "sent": "I actually didn't agree with that, and that's not the point.",
                    "label": 0
                },
                {
                    "sent": "We can argue about that later.",
                    "label": 0
                },
                {
                    "sent": "It's an important point.",
                    "label": 0
                },
                {
                    "sent": "Yeah, the point is a meta version of that, and that is.",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "Is it going to be possible to have people agree with any of these kind of things where you take a system and you write out an expression or a big diagram, and then I look at that same system and say no.",
                    "label": 0
                },
                {
                    "sent": "I think this error goes here.",
                    "label": 0
                },
                {
                    "sent": "And how do you?",
                    "label": 0
                },
                {
                    "sent": "How do you deal with that?",
                    "label": 0
                },
                {
                    "sent": "This seems tricky, it death and that's why we need more people to work on it.",
                    "label": 0
                },
                {
                    "sent": "I all I can say is that we have applied it to things like Angelina and we came to a consensus.",
                    "label": 0
                },
                {
                    "sent": "Angela isn't my software, so Mike was able.",
                    "label": 0
                },
                {
                    "sent": "Well, mine was able to because we introduced all these timelines.",
                    "label": 0
                },
                {
                    "sent": "Similarly, the other systems that we've.",
                    "label": 0
                },
                {
                    "sent": "Looked at when I Allison I've been discussing this for years and we can come to consensus, but we know that that's not the only way of describing a system.",
                    "label": 0
                },
                {
                    "sent": "Same way if you'd used any way of describing system, you'd have variations of it, but so the beauty of this is that you're not really interested in whether you're capturing the description of the software perfectly.",
                    "label": 0
                },
                {
                    "sent": "As long as going from system A to system B, you're doing something like removing a bar, so the software now does something that previously you did.",
                    "label": 0
                },
                {
                    "sent": "Or there's a new generative acting there, so it finally there's a static generator.",
                    "label": 0
                },
                {
                    "sent": "Doesn't matter whether it's actually capturing perfectly what the software is, as long as you can tell that progress has been made in terms of the diagram changing, and as long as the person before will agree that there was a bar there and you've removed it.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's the tricky part of yes.",
                    "label": 0
                },
                {
                    "sent": "You have to convince people, went out of time, so let's thank Simon again.",
                    "label": 0
                }
            ]
        }
    }
}