{
    "id": "d4fdr5q4crk2xgsqig62z5j7xjcctter",
    "title": "Why the Quality of Academic Teaching is Becoming so important?",
    "info": {
        "author": [
            "Barica Marentič Požarnik, Faculty of Arts, University of Ljubljana"
        ],
        "published": "Dec. 19, 2017",
        "recorded": "September 2017",
        "category": [
            "Top->Social Sciences->Society",
            "Top->Social Sciences->Education",
            "Top->Technology"
        ]
    },
    "url": "http://videolectures.net/oercongress2017_marentic_academic_teaching/",
    "segmentation": [
        [
            "Ladies and gentlemen, I am very grateful to a professor at season two had invited me here because I had now two wonderful days to feel the atmosphere to get very many new ideas.",
            "And now I am going to try to share you my experiences and my questions on the topic of improving University teaching.",
            "Through teaching teachers, these are my experiences in my interest."
        ],
        [
            "Why is the quality of teacher getting so important?",
            "I won't speak much about it because it has been already said, but teaching today is more demanding, much more demanding than it was before.",
            "There are so many students, very many different students.",
            "We see this rapid development of science, technology, digital technology and especially new competences which were already mentioned.",
            "Systemic creative critical thinking.",
            "Responsibility for ethical sustainable development of society.",
            "We should not forget about the ethical dimension of University teaching and this of course doesn't come just by.",
            "Lectoring it has to be different."
        ],
        [
            "The saying of this American pedagogue that you certainly know.",
            "Was is old, but is also valid for today.",
            "If we teach today as we thought yesterday, we Rob our children of tomorrow and that's getting more and more.",
            "2."
        ],
        [
            "University teacher has very many different things to do.",
            "A special research teaching management.",
            "Also cooperation with different enterprises etc etc.",
            "It's a very busy and difficult role.",
            "Now I would like you to think a little bit about two roles.",
            "Once research one is teaching and think a little bit.",
            "What do you think when you compare?",
            "And I would just like that you raise your hands.",
            "Regarding importance, is research more equally or less important then?",
            "Teaching how many of you think that research is more important than teaching in University business?",
            "How many think they are equally important?",
            "How many you think that teaching is more important than?",
            "Miller then research, now second question, how do you build your academic career?",
            "Which is more important for your academic career?",
            "How many think research is more important for your career?",
            "More than teaching, yeah, more than teaching how much you publish, how much you research, haha.",
            "I would.",
            "Very important for early days, but when you're mature teacher then certainly it's equally important.",
            "But when you about to start is very much important or really or research otherwise you cannot enter in, so this should be questioned for early mature.",
            "Research because the knowledge is renewing, no.",
            "Yeah, of course research.",
            "Research is extremely important is the question will just for your career when you want to come a little one stop higher and higher?",
            "Are they equally important?",
            "Research and teaching?",
            "Very important first first.",
            "In our University also so where we want.",
            "Discussed is longer, but yes.",
            "Any teaching needs research on their process of teaching learning.",
            "Yeah, of course.",
            "In your field of knowledge?",
            "Yeah, of course.",
            "These to do research.",
            "Yeah, improve.",
            "He's process of teaching.",
            "Learning Yahoo.",
            "Make sure the learning objectives are being really there for.",
            "Weather research is important or role.",
            "I think there is a need to define what do we mean by research.",
            "Thank you.",
            "He was more the question on on these regulations what is written in the regulations.",
            "But then the last question for which field does University to receive more training methodology of research or how to teach so?",
            "Do you think he or she gets more training in research than teaching?",
            "Usually they receive more training in research.",
            "Yeah, because they are being given research methodology.",
            "They are not being given how to teach?",
            "Yeah yeah, that's second primary secondary teachers do get ink and that's it.",
            "Seems that it is quite a general problem.",
            "So you see a European Commission sometime ago wanted to make balance of these fields and.",
            "Stated that it is responsibility of institution to.",
            "To see that.",
            "Teachers are well trained in both fields, especially in teaching and diseases.",
            "Possibility of stuff, so both staff and institutions.",
            "And there are about 12 recommendations and one of the recommendation is that all staff teaching in higher education should buy 2020, have assertive."
        ],
        [
            "I'd better go digital training, so is it a wishful thinking?",
            "Is it realistic?",
            "It is on you to decide."
        ],
        [
            "And then there is very difficult to say.",
            "Strong statement daily lived.",
            "Reality is an embarrassing disappointment.",
            "Alot of teaching by 19th century standards.",
            "I am taking this from European report.",
            "I. I didn't say it myself.",
            "A commitment to best practices, sporadic at best.",
            "Frequently re liant.",
            "On the Enlightement commitment of a few individuals, some people are excellent teachers, even if they don't go to any courses.",
            "But some are many or not.",
            "So here we can see it like in football.",
            "Firstly Secondly differences, I just put it from literature.",
            "You mentioned German speaking countries but also Scandinavian counties.",
            "The United Kingdom has had.",
            "Australia has a good.",
            "Tradition Bender looks this is to my knowledge now second League.",
            "I see birth Baltic County, Spain, Portugal.",
            "And 3rd that they are not attentive to start the University start development.",
            "It's all very very little, so I would like I don't know from which countries do you come, but how many of you would you position your country in the first League that they have big attention to?",
            "University study veloppement.",
            "Second, some attention.",
            "Sired nearly no attention.",
            "And very many heads.",
            "If you have not decided what to say, but any case it is neglected field then we have Erivan conference that's and again another one.",
            "Focus on quality assurance and say a fundamental shift is needed to a more student centered teaching.",
            "We have heard this yesterday.",
            "Also hear this.",
            "Student centered teaching.",
            "What do you understand?",
            "What is student centered teaching?",
            "We just.",
            "Keep saying words and what is behind it, can anybody say?"
        ],
        [
            "What is actually student center it yeah.",
            "There are some underpinning theories of pedagogy that we should be aware on the basis of these theories.",
            "Then it is the student or learner centered.",
            "Yeah.",
            "Don't.",
            "Not just, not just lecturing our discipline, but seeing students are there with yesterday.",
            "Was this wonderful panel.",
            "I heard this student students saying wonderful things.",
            "Another idea, what is student centered teaching?",
            "1st is a theoretical underpinning.",
            "Then in the classroom.",
            "The teacher starts mid to student.",
            "Student says what he or she needs me.",
            "It's the curriculum is being based on the knees.",
            "Nikki starts from a dialogue.",
            "Defined object.",
            "Rather dictated by the professor.",
            "But further dialogue interactive.",
            "Dial.",
            "It is the student who is responsible for his or her learning responsible exactly.",
            "Assessment as learning.",
            "Yeah, three times of assistant learning is what it comes under the student center, and then it is not the assessment of learning but but for yeah.",
            "The thing is, there is no time.",
            "If you find him, I would yeah weekend because we are somehow limited, but that's how it is.",
            "You wanted to say something.",
            "Certainly, I believe that this statement very strong statement fundamental shift is needed to a more student.",
            "Centered teaching has also another face, and that's it that we are pushing our standards of knowledge and skills down because becausw push to the education is so huge we get more and more, and some of them they would like just to have certificates, not seriously knowledge and skills, yeah.",
            "That's not cool.",
            "Streaky statement which we learned in last 1015 years and I believe we should be really careful what we do.",
            "Ha ha ha ha.",
            "Here are some.",
            "Answers to this, but Massification brings many, many things that we have to take into account.",
            "Active role motivation motivation is a problem in our University studies.",
            "Prior learning not start there, but start where they are higher order skills independent learning.",
            "So it is here what we are here for open educational resources that students want and know how to study by themselves."
        ],
        [
            "Multiple papers and tation and multiple methods of course especially group metals and responsibility.",
            "Maybe is the keyword?"
        ],
        [
            "I won't stay.",
            "Speak much about this, but as a psychologist I'm a psychologists.",
            "I see more and more that what the teacher does depends on his conception, his belief about the role, what is the role of teacher, and the belief that I am here to transmit knowledge and then to ask what they have learned.",
            "Or also I am here to be called to be mental to help.",
            "Students said they do it on their own.",
            "So this is and this is very, very difficult thing to change.",
            "My belief.",
            "My conception, I've got lots of research on it, but no time to tell it.",
            "What is really the role of the teacher?",
            "And of course there must be official support here I will."
        ],
        [
            "Call quickly, but just to show you that in.",
            "Past decades we were connected to its many international initiatives, UNESCO deficits from the 80s, but it it was about improving University teaching and learning.",
            "Zen Temples Project netlet cetera.",
            "And we had many such courses.",
            "Now we have a certified.",
            "Of course, and many others yesterday were, I was surprised to see about this media.",
            "Education for University teachers.",
            "Then students have questionnaires to tell how the teacher teaches.",
            "My opinion is that this questionnaires are too long and they come after the examination and.",
            "It should be not at the end, but.",
            "As you say, dialogue it.",
            "It should be in between that the teacher listens.",
            "What students have to say about.",
            "Teaching."
        ],
        [
            "Now just tell you a little bit.",
            "How are our courses?",
            "What are the main ideas teachers you preach?",
            "If we say you have to have dialogue with the students, we have dialogue with our participants.",
            "We have group group work.",
            "We have this teaching.",
            "They have to teach for 10 minutes then group and then the group says.",
            "How was this teaching observers say?",
            "How was this teaching feedback?",
            "And then?",
            "But the teacher has video video to see.",
            "What kind of teaching so very different methods, action, reflection, students perspective and they can suggest what they want to know?",
            "So usually evaluations are really really good.",
            "This how does it link to?",
            "Ovr has been already said.",
            "Um, so I would just the last one.",
            "Say that it is not enough to start with machines with technology with this, but start also with what we know and think about memory, attention, motivation, creativity and so on.",
            "If we don't know this machine can just perpetuate.",
            "Account of.",
            "Account of.",
            "Traditional teaching."
        ],
        [
            "Open problems I hope, will discuss later.",
            "A Corporation policy, support and motivate."
        ],
        [
            "Some teachers are motivated young University staff, some are not.",
            "It's."
        ],
        [
            "I would finish with one group of our participants.",
            "One participant on the last meeting brought us, you see the.",
            "This needs some, some it means not alone, that was the main.",
            "The main message."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ladies and gentlemen, I am very grateful to a professor at season two had invited me here because I had now two wonderful days to feel the atmosphere to get very many new ideas.",
                    "label": 0
                },
                {
                    "sent": "And now I am going to try to share you my experiences and my questions on the topic of improving University teaching.",
                    "label": 1
                },
                {
                    "sent": "Through teaching teachers, these are my experiences in my interest.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Why is the quality of teacher getting so important?",
                    "label": 1
                },
                {
                    "sent": "I won't speak much about it because it has been already said, but teaching today is more demanding, much more demanding than it was before.",
                    "label": 0
                },
                {
                    "sent": "There are so many students, very many different students.",
                    "label": 0
                },
                {
                    "sent": "We see this rapid development of science, technology, digital technology and especially new competences which were already mentioned.",
                    "label": 0
                },
                {
                    "sent": "Systemic creative critical thinking.",
                    "label": 0
                },
                {
                    "sent": "Responsibility for ethical sustainable development of society.",
                    "label": 1
                },
                {
                    "sent": "We should not forget about the ethical dimension of University teaching and this of course doesn't come just by.",
                    "label": 0
                },
                {
                    "sent": "Lectoring it has to be different.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The saying of this American pedagogue that you certainly know.",
                    "label": 0
                },
                {
                    "sent": "Was is old, but is also valid for today.",
                    "label": 0
                },
                {
                    "sent": "If we teach today as we thought yesterday, we Rob our children of tomorrow and that's getting more and more.",
                    "label": 1
                },
                {
                    "sent": "2.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "University teacher has very many different things to do.",
                    "label": 0
                },
                {
                    "sent": "A special research teaching management.",
                    "label": 1
                },
                {
                    "sent": "Also cooperation with different enterprises etc etc.",
                    "label": 0
                },
                {
                    "sent": "It's a very busy and difficult role.",
                    "label": 0
                },
                {
                    "sent": "Now I would like you to think a little bit about two roles.",
                    "label": 0
                },
                {
                    "sent": "Once research one is teaching and think a little bit.",
                    "label": 0
                },
                {
                    "sent": "What do you think when you compare?",
                    "label": 1
                },
                {
                    "sent": "And I would just like that you raise your hands.",
                    "label": 0
                },
                {
                    "sent": "Regarding importance, is research more equally or less important then?",
                    "label": 0
                },
                {
                    "sent": "Teaching how many of you think that research is more important than teaching in University business?",
                    "label": 0
                },
                {
                    "sent": "How many think they are equally important?",
                    "label": 0
                },
                {
                    "sent": "How many you think that teaching is more important than?",
                    "label": 1
                },
                {
                    "sent": "Miller then research, now second question, how do you build your academic career?",
                    "label": 0
                },
                {
                    "sent": "Which is more important for your academic career?",
                    "label": 0
                },
                {
                    "sent": "How many think research is more important for your career?",
                    "label": 0
                },
                {
                    "sent": "More than teaching, yeah, more than teaching how much you publish, how much you research, haha.",
                    "label": 0
                },
                {
                    "sent": "I would.",
                    "label": 0
                },
                {
                    "sent": "Very important for early days, but when you're mature teacher then certainly it's equally important.",
                    "label": 0
                },
                {
                    "sent": "But when you about to start is very much important or really or research otherwise you cannot enter in, so this should be questioned for early mature.",
                    "label": 0
                },
                {
                    "sent": "Research because the knowledge is renewing, no.",
                    "label": 0
                },
                {
                    "sent": "Yeah, of course research.",
                    "label": 0
                },
                {
                    "sent": "Research is extremely important is the question will just for your career when you want to come a little one stop higher and higher?",
                    "label": 0
                },
                {
                    "sent": "Are they equally important?",
                    "label": 0
                },
                {
                    "sent": "Research and teaching?",
                    "label": 0
                },
                {
                    "sent": "Very important first first.",
                    "label": 0
                },
                {
                    "sent": "In our University also so where we want.",
                    "label": 0
                },
                {
                    "sent": "Discussed is longer, but yes.",
                    "label": 0
                },
                {
                    "sent": "Any teaching needs research on their process of teaching learning.",
                    "label": 0
                },
                {
                    "sent": "Yeah, of course.",
                    "label": 0
                },
                {
                    "sent": "In your field of knowledge?",
                    "label": 0
                },
                {
                    "sent": "Yeah, of course.",
                    "label": 0
                },
                {
                    "sent": "These to do research.",
                    "label": 0
                },
                {
                    "sent": "Yeah, improve.",
                    "label": 0
                },
                {
                    "sent": "He's process of teaching.",
                    "label": 0
                },
                {
                    "sent": "Learning Yahoo.",
                    "label": 0
                },
                {
                    "sent": "Make sure the learning objectives are being really there for.",
                    "label": 0
                },
                {
                    "sent": "Weather research is important or role.",
                    "label": 0
                },
                {
                    "sent": "I think there is a need to define what do we mean by research.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "He was more the question on on these regulations what is written in the regulations.",
                    "label": 0
                },
                {
                    "sent": "But then the last question for which field does University to receive more training methodology of research or how to teach so?",
                    "label": 1
                },
                {
                    "sent": "Do you think he or she gets more training in research than teaching?",
                    "label": 0
                },
                {
                    "sent": "Usually they receive more training in research.",
                    "label": 0
                },
                {
                    "sent": "Yeah, because they are being given research methodology.",
                    "label": 0
                },
                {
                    "sent": "They are not being given how to teach?",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah, that's second primary secondary teachers do get ink and that's it.",
                    "label": 0
                },
                {
                    "sent": "Seems that it is quite a general problem.",
                    "label": 0
                },
                {
                    "sent": "So you see a European Commission sometime ago wanted to make balance of these fields and.",
                    "label": 0
                },
                {
                    "sent": "Stated that it is responsibility of institution to.",
                    "label": 0
                },
                {
                    "sent": "To see that.",
                    "label": 0
                },
                {
                    "sent": "Teachers are well trained in both fields, especially in teaching and diseases.",
                    "label": 0
                },
                {
                    "sent": "Possibility of stuff, so both staff and institutions.",
                    "label": 0
                },
                {
                    "sent": "And there are about 12 recommendations and one of the recommendation is that all staff teaching in higher education should buy 2020, have assertive.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'd better go digital training, so is it a wishful thinking?",
                    "label": 0
                },
                {
                    "sent": "Is it realistic?",
                    "label": 0
                },
                {
                    "sent": "It is on you to decide.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then there is very difficult to say.",
                    "label": 0
                },
                {
                    "sent": "Strong statement daily lived.",
                    "label": 0
                },
                {
                    "sent": "Reality is an embarrassing disappointment.",
                    "label": 1
                },
                {
                    "sent": "Alot of teaching by 19th century standards.",
                    "label": 1
                },
                {
                    "sent": "I am taking this from European report.",
                    "label": 0
                },
                {
                    "sent": "I. I didn't say it myself.",
                    "label": 1
                },
                {
                    "sent": "A commitment to best practices, sporadic at best.",
                    "label": 1
                },
                {
                    "sent": "Frequently re liant.",
                    "label": 0
                },
                {
                    "sent": "On the Enlightement commitment of a few individuals, some people are excellent teachers, even if they don't go to any courses.",
                    "label": 0
                },
                {
                    "sent": "But some are many or not.",
                    "label": 0
                },
                {
                    "sent": "So here we can see it like in football.",
                    "label": 0
                },
                {
                    "sent": "Firstly Secondly differences, I just put it from literature.",
                    "label": 0
                },
                {
                    "sent": "You mentioned German speaking countries but also Scandinavian counties.",
                    "label": 0
                },
                {
                    "sent": "The United Kingdom has had.",
                    "label": 0
                },
                {
                    "sent": "Australia has a good.",
                    "label": 0
                },
                {
                    "sent": "Tradition Bender looks this is to my knowledge now second League.",
                    "label": 0
                },
                {
                    "sent": "I see birth Baltic County, Spain, Portugal.",
                    "label": 0
                },
                {
                    "sent": "And 3rd that they are not attentive to start the University start development.",
                    "label": 0
                },
                {
                    "sent": "It's all very very little, so I would like I don't know from which countries do you come, but how many of you would you position your country in the first League that they have big attention to?",
                    "label": 0
                },
                {
                    "sent": "University study veloppement.",
                    "label": 0
                },
                {
                    "sent": "Second, some attention.",
                    "label": 0
                },
                {
                    "sent": "Sired nearly no attention.",
                    "label": 0
                },
                {
                    "sent": "And very many heads.",
                    "label": 0
                },
                {
                    "sent": "If you have not decided what to say, but any case it is neglected field then we have Erivan conference that's and again another one.",
                    "label": 0
                },
                {
                    "sent": "Focus on quality assurance and say a fundamental shift is needed to a more student centered teaching.",
                    "label": 0
                },
                {
                    "sent": "We have heard this yesterday.",
                    "label": 0
                },
                {
                    "sent": "Also hear this.",
                    "label": 0
                },
                {
                    "sent": "Student centered teaching.",
                    "label": 0
                },
                {
                    "sent": "What do you understand?",
                    "label": 0
                },
                {
                    "sent": "What is student centered teaching?",
                    "label": 0
                },
                {
                    "sent": "We just.",
                    "label": 0
                },
                {
                    "sent": "Keep saying words and what is behind it, can anybody say?",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What is actually student center it yeah.",
                    "label": 0
                },
                {
                    "sent": "There are some underpinning theories of pedagogy that we should be aware on the basis of these theories.",
                    "label": 0
                },
                {
                    "sent": "Then it is the student or learner centered.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Don't.",
                    "label": 0
                },
                {
                    "sent": "Not just, not just lecturing our discipline, but seeing students are there with yesterday.",
                    "label": 0
                },
                {
                    "sent": "Was this wonderful panel.",
                    "label": 0
                },
                {
                    "sent": "I heard this student students saying wonderful things.",
                    "label": 0
                },
                {
                    "sent": "Another idea, what is student centered teaching?",
                    "label": 0
                },
                {
                    "sent": "1st is a theoretical underpinning.",
                    "label": 0
                },
                {
                    "sent": "Then in the classroom.",
                    "label": 0
                },
                {
                    "sent": "The teacher starts mid to student.",
                    "label": 0
                },
                {
                    "sent": "Student says what he or she needs me.",
                    "label": 0
                },
                {
                    "sent": "It's the curriculum is being based on the knees.",
                    "label": 0
                },
                {
                    "sent": "Nikki starts from a dialogue.",
                    "label": 0
                },
                {
                    "sent": "Defined object.",
                    "label": 0
                },
                {
                    "sent": "Rather dictated by the professor.",
                    "label": 0
                },
                {
                    "sent": "But further dialogue interactive.",
                    "label": 0
                },
                {
                    "sent": "Dial.",
                    "label": 0
                },
                {
                    "sent": "It is the student who is responsible for his or her learning responsible exactly.",
                    "label": 0
                },
                {
                    "sent": "Assessment as learning.",
                    "label": 0
                },
                {
                    "sent": "Yeah, three times of assistant learning is what it comes under the student center, and then it is not the assessment of learning but but for yeah.",
                    "label": 0
                },
                {
                    "sent": "The thing is, there is no time.",
                    "label": 0
                },
                {
                    "sent": "If you find him, I would yeah weekend because we are somehow limited, but that's how it is.",
                    "label": 0
                },
                {
                    "sent": "You wanted to say something.",
                    "label": 0
                },
                {
                    "sent": "Certainly, I believe that this statement very strong statement fundamental shift is needed to a more student.",
                    "label": 1
                },
                {
                    "sent": "Centered teaching has also another face, and that's it that we are pushing our standards of knowledge and skills down because becausw push to the education is so huge we get more and more, and some of them they would like just to have certificates, not seriously knowledge and skills, yeah.",
                    "label": 0
                },
                {
                    "sent": "That's not cool.",
                    "label": 0
                },
                {
                    "sent": "Streaky statement which we learned in last 1015 years and I believe we should be really careful what we do.",
                    "label": 0
                },
                {
                    "sent": "Ha ha ha ha.",
                    "label": 0
                },
                {
                    "sent": "Here are some.",
                    "label": 0
                },
                {
                    "sent": "Answers to this, but Massification brings many, many things that we have to take into account.",
                    "label": 0
                },
                {
                    "sent": "Active role motivation motivation is a problem in our University studies.",
                    "label": 0
                },
                {
                    "sent": "Prior learning not start there, but start where they are higher order skills independent learning.",
                    "label": 0
                },
                {
                    "sent": "So it is here what we are here for open educational resources that students want and know how to study by themselves.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Multiple papers and tation and multiple methods of course especially group metals and responsibility.",
                    "label": 0
                },
                {
                    "sent": "Maybe is the keyword?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I won't stay.",
                    "label": 0
                },
                {
                    "sent": "Speak much about this, but as a psychologist I'm a psychologists.",
                    "label": 0
                },
                {
                    "sent": "I see more and more that what the teacher does depends on his conception, his belief about the role, what is the role of teacher, and the belief that I am here to transmit knowledge and then to ask what they have learned.",
                    "label": 0
                },
                {
                    "sent": "Or also I am here to be called to be mental to help.",
                    "label": 0
                },
                {
                    "sent": "Students said they do it on their own.",
                    "label": 0
                },
                {
                    "sent": "So this is and this is very, very difficult thing to change.",
                    "label": 0
                },
                {
                    "sent": "My belief.",
                    "label": 0
                },
                {
                    "sent": "My conception, I've got lots of research on it, but no time to tell it.",
                    "label": 0
                },
                {
                    "sent": "What is really the role of the teacher?",
                    "label": 0
                },
                {
                    "sent": "And of course there must be official support here I will.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Call quickly, but just to show you that in.",
                    "label": 0
                },
                {
                    "sent": "Past decades we were connected to its many international initiatives, UNESCO deficits from the 80s, but it it was about improving University teaching and learning.",
                    "label": 0
                },
                {
                    "sent": "Zen Temples Project netlet cetera.",
                    "label": 0
                },
                {
                    "sent": "And we had many such courses.",
                    "label": 0
                },
                {
                    "sent": "Now we have a certified.",
                    "label": 0
                },
                {
                    "sent": "Of course, and many others yesterday were, I was surprised to see about this media.",
                    "label": 0
                },
                {
                    "sent": "Education for University teachers.",
                    "label": 0
                },
                {
                    "sent": "Then students have questionnaires to tell how the teacher teaches.",
                    "label": 0
                },
                {
                    "sent": "My opinion is that this questionnaires are too long and they come after the examination and.",
                    "label": 0
                },
                {
                    "sent": "It should be not at the end, but.",
                    "label": 0
                },
                {
                    "sent": "As you say, dialogue it.",
                    "label": 0
                },
                {
                    "sent": "It should be in between that the teacher listens.",
                    "label": 0
                },
                {
                    "sent": "What students have to say about.",
                    "label": 0
                },
                {
                    "sent": "Teaching.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now just tell you a little bit.",
                    "label": 0
                },
                {
                    "sent": "How are our courses?",
                    "label": 0
                },
                {
                    "sent": "What are the main ideas teachers you preach?",
                    "label": 1
                },
                {
                    "sent": "If we say you have to have dialogue with the students, we have dialogue with our participants.",
                    "label": 0
                },
                {
                    "sent": "We have group group work.",
                    "label": 0
                },
                {
                    "sent": "We have this teaching.",
                    "label": 0
                },
                {
                    "sent": "They have to teach for 10 minutes then group and then the group says.",
                    "label": 0
                },
                {
                    "sent": "How was this teaching observers say?",
                    "label": 0
                },
                {
                    "sent": "How was this teaching feedback?",
                    "label": 0
                },
                {
                    "sent": "And then?",
                    "label": 0
                },
                {
                    "sent": "But the teacher has video video to see.",
                    "label": 1
                },
                {
                    "sent": "What kind of teaching so very different methods, action, reflection, students perspective and they can suggest what they want to know?",
                    "label": 0
                },
                {
                    "sent": "So usually evaluations are really really good.",
                    "label": 0
                },
                {
                    "sent": "This how does it link to?",
                    "label": 0
                },
                {
                    "sent": "Ovr has been already said.",
                    "label": 0
                },
                {
                    "sent": "Um, so I would just the last one.",
                    "label": 0
                },
                {
                    "sent": "Say that it is not enough to start with machines with technology with this, but start also with what we know and think about memory, attention, motivation, creativity and so on.",
                    "label": 0
                },
                {
                    "sent": "If we don't know this machine can just perpetuate.",
                    "label": 0
                },
                {
                    "sent": "Account of.",
                    "label": 0
                },
                {
                    "sent": "Account of.",
                    "label": 0
                },
                {
                    "sent": "Traditional teaching.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Open problems I hope, will discuss later.",
                    "label": 0
                },
                {
                    "sent": "A Corporation policy, support and motivate.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some teachers are motivated young University staff, some are not.",
                    "label": 0
                },
                {
                    "sent": "It's.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would finish with one group of our participants.",
                    "label": 0
                },
                {
                    "sent": "One participant on the last meeting brought us, you see the.",
                    "label": 0
                },
                {
                    "sent": "This needs some, some it means not alone, that was the main.",
                    "label": 0
                },
                {
                    "sent": "The main message.",
                    "label": 0
                }
            ]
        }
    }
}