{
    "id": "d4qjclupvdoimmlpaeqmt7khn3e7txx3",
    "title": "Personal Tours at the British Museum",
    "info": {
        "author": [
            "Kim Schouten, Erasmus School of Economics, Erasmus University Rotterdam"
        ],
        "published": "Oct. 19, 2014",
        "recorded": "September 2014",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2014_schouten_personal_tours/",
    "segmentation": [
        [
            "Thank you for listening.",
            "It is my pleasure to show you the work we've done in building a demo for a personal tour guide through the British Museum.",
            "Team is consists of allgire seen so and myself.",
            "Oh wait, before we go, you see here at the Great Hall, you see how big it is.",
            "This is just one shot of the British Museum, which is huge.",
            "Simply huge.",
            "There are so many things you can see there.",
            "It's easy to get lost.",
            "So we were thinking how can we help the user which."
        ],
        [
            "Is the main question.",
            "So suppose you enter the museum and you see that whole you saw and you think alright, this is nice.",
            "But where do I start?",
            "I mean, that's not really clear.",
            "So the main question is where to go to an.",
            "There are some factors which you can take into consideration, for instance, how much time do I have?",
            "Which rooms are maybe overcrowded?",
            "There are some particular rooms which are always full of people you may want to avoid them, or maybe not.",
            "If you like crowds.",
            "Maybe there is a particular topic of interest which you like, like Egyptian stuff or maybe vases and Buddha statues which we encountered a lot.",
            "Logistics you may not want to start in the back of the museum.",
            "Having to walk for half an hour before actually stopping and starting the tour."
        ],
        [
            "So we model the visiting process for a user.",
            "Well, of course the user starts at some point in a museum.",
            "There are multiple entrances, so that's not.",
            "There's not just one starting point.",
            "And he may have some specific interests or not just browsing so the user starts at some point, observing some objects and things.",
            "Well, what am I actually looking at?",
            "So we want the user we want to give the user some information about the object he is currently seeing.",
            "And then of course what will be the next object?",
            "I mean, every time the user has to make a decision.",
            "Alright, I've seen this object.",
            "What is the next thing?",
            "I want to see so the whole tour is.",
            "Basically, one stream of decisions and we would like to help the user with that and well, after you select the next one, you go observing again, and that's an iterative process.",
            "So how can we help the visitor to navigate through the enormous collection?"
        ],
        [
            "So we have the idea of using that using a mobile app because most people have their mobile phone with them always, so you see the same three stages as in the model on the previous slide.",
            "So we have a starting point that is.",
            "That looks at the location where the user currently is and you can select maybe some starting objects.",
            "The famous ones which you may want to start with, or maybe not that you don't really have to start with a particular fixed point, but it can help the users who don't know anything about the museum to have some starting points.",
            "So then we have here to observing parts of the application.",
            "So you see a picture and some description an there is also the option of generating the audio for this description.",
            "If maybe you don't really read that well or you dislike screens whatever and there would be some form of like or dislike option here.",
            "So you can say well I like this object or I don't like this object and we want to take the likes and dislikes into consideration and generating the tour in what will be the next object to visit so that you don't see.",
            "10 Buddha's if you don't like Buddha's.",
            "So this is a well maybe the most important parts, the suggestion parts.",
            "So what will be the next object to visit?",
            "That is based on some features.",
            "For instance, we don't want people to walk all the way through the museum like you have an object in the East Wing.",
            "Then in The West Wing and you'll be doing a marathon and visiting like 5 objects.",
            "Not fun, so we constrain the objects to some location near to where the current the user currently is.",
            "Of course, we also filter out the ones he has already seen.",
            "You don't want to be sent to the same objects because you like that you don't want to see it over and over again, and.",
            "We used likes and dislikes as already told you, and of course a very important part is the similarity measure.",
            "So we compute the similarity measure between the objects the user has already seen and maybe liked or disliked compared to the objects which are in his vicinity so that we know which ones he may like to see.",
            "The similarity is computed based on some features of the product of the.",
            "Artifacts in the data set, for instance culture.",
            "What kind of object it is?",
            "Is the painting or figure or something else and some others.",
            "And we do a simple lexical match at the moment so we don't, so it's either.",
            "It's the same, or it's not the same.",
            "So if their culture is Egyptian, it should really be Egyptian.",
            "If not, then any other culture, even if it may be related somehow, is not the same.",
            "We do this because it's the fastest and most efficient way of ranking, because this has to be computed on the fly every time a user sees an object and you don't want to wait for your app while it is computing some very nice similarity measure."
        ],
        [
            "So this will be one of the screens in the demo which I will show at the end.",
            "So you see here the picture from the mid middle parts of the previous slides and some text here the like and dislike button and the audio button.",
            "So the demo at the end."
        ],
        [
            "So some challenges.",
            "We encountered an lessons learned, so we had some issues with the data because some things were missing in some cases or there was a lot of heterogeneity heterogeneity, so some labels, some slots were filled for some objects and others.",
            "They were not filled.",
            "So for instance, in room 30 three we had no titles for objects because they were all like vases and other stuff, so they all were all more or less the same.",
            "So without titles, what can you display right?",
            "Also there were rooms in the data set that were not on the floor plan, so we had room 298, but there are only 95 rooms in then we see him.",
            "So that was a bit of an issue.",
            "We solved that by just ignoring the rooms which are not in the floor plan that is just for the demo for now, but you would want to.",
            "Solve that and make it 1 coherent schema for four rooms.",
            "And we had a sparkle code running in Java and then entering that in the androids was not trivial because the Jenna stuff for Sparkle doesn't run under Android.",
            "So all our nice queries didn't run anymore.",
            "And so that was interesting.",
            "So one of the lessons learned is not to put all your data unnecessarily in an ontology.",
            "I mean ontologies are nice and we've learned that this week, but it's not the solution to everything.",
            "So we had the floor plan.",
            "For instance, in the CSV file or in an ontology.",
            "And it turned out that the CSV version actually works a little bit better than having another ontology to work with.",
            "And the this is an interesting one.",
            "Software development as a messy process, so it's not a lab situation here.",
            "We only have two days an.",
            "In the beginning of to refine your idea.",
            "So we were talking with the tutors and they had lots of interesting ideas and ways for us to think about the problem and then at some point, like right.",
            "That's everything is interesting, but what should I do right?",
            "So the data issues I already mentioned them at the platform issues as with a sparkle, so we don't know before hand where you will encounter bugs so we didn't know that Sparkle Library which we used wouldn't run on their androids.",
            "An endpoint reliability is that this.",
            "Very important if you would deploy the application is that if you rely on data from the data sets that you can gather that the endpoint should be running, which it wasn't at some point.",
            "That's kind of hard.",
            "So the lesson is be flexible.",
            "So we got a backup endpoint which had a little bit different data, but we had to work around it and in the end it actually worked out pretty nice."
        ],
        [
            "So last some ideas for future work so we could link with other data sources to give.",
            "Maybe give more interesting data to the user while browsing the museum we have a digital souvenir, so if you like some objects you can create a personal story for the user which you can sort of take home.",
            "Well, it's digital, so take homes.",
            "Relative, so we have the knowledge base to collect because if we know where every user is, we know what route he is taking through the museum, which can be very useful for museums as well as their likes and dislikes.",
            "And we can profile visitors as well, right?",
            "I'll leave the rest and show the demo.",
            "The demos only.",
            "Is here so you will start up the application.",
            "It will load.",
            "This is the list of recommendations that you see.",
            "You can scroll that you only get 3 because it will change anyway an it so that you can have a clear overview.",
            "This would be the middle page which you already saw and here we have the numbers for the user profile, which you wouldn't see normally, but for the demo you do.",
            "So you see here the various aspects of the object which we track.",
            "Of course, the list is scrollable.",
            "So we will hit the dislike button now so it will remain all zeros or the things and we check the list of recommendation after hitting the dislike button and we can see that in the end compared to the previous list, you get something else.",
            "So you hit this like something.",
            "You get a different object.",
            "Now the picture is the same though, but the object is different and you get different objects there.",
            "Why the pictures are the same?",
            "The pictures were not on the end points so we couldn't load them.",
            "So we just loaded some random pictures to fill.",
            "The UE alright that's it.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you for listening.",
                    "label": 0
                },
                {
                    "sent": "It is my pleasure to show you the work we've done in building a demo for a personal tour guide through the British Museum.",
                    "label": 0
                },
                {
                    "sent": "Team is consists of allgire seen so and myself.",
                    "label": 0
                },
                {
                    "sent": "Oh wait, before we go, you see here at the Great Hall, you see how big it is.",
                    "label": 0
                },
                {
                    "sent": "This is just one shot of the British Museum, which is huge.",
                    "label": 1
                },
                {
                    "sent": "Simply huge.",
                    "label": 0
                },
                {
                    "sent": "There are so many things you can see there.",
                    "label": 0
                },
                {
                    "sent": "It's easy to get lost.",
                    "label": 0
                },
                {
                    "sent": "So we were thinking how can we help the user which.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is the main question.",
                    "label": 0
                },
                {
                    "sent": "So suppose you enter the museum and you see that whole you saw and you think alright, this is nice.",
                    "label": 0
                },
                {
                    "sent": "But where do I start?",
                    "label": 0
                },
                {
                    "sent": "I mean, that's not really clear.",
                    "label": 0
                },
                {
                    "sent": "So the main question is where to go to an.",
                    "label": 1
                },
                {
                    "sent": "There are some factors which you can take into consideration, for instance, how much time do I have?",
                    "label": 1
                },
                {
                    "sent": "Which rooms are maybe overcrowded?",
                    "label": 0
                },
                {
                    "sent": "There are some particular rooms which are always full of people you may want to avoid them, or maybe not.",
                    "label": 0
                },
                {
                    "sent": "If you like crowds.",
                    "label": 0
                },
                {
                    "sent": "Maybe there is a particular topic of interest which you like, like Egyptian stuff or maybe vases and Buddha statues which we encountered a lot.",
                    "label": 0
                },
                {
                    "sent": "Logistics you may not want to start in the back of the museum.",
                    "label": 0
                },
                {
                    "sent": "Having to walk for half an hour before actually stopping and starting the tour.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we model the visiting process for a user.",
                    "label": 0
                },
                {
                    "sent": "Well, of course the user starts at some point in a museum.",
                    "label": 0
                },
                {
                    "sent": "There are multiple entrances, so that's not.",
                    "label": 0
                },
                {
                    "sent": "There's not just one starting point.",
                    "label": 0
                },
                {
                    "sent": "And he may have some specific interests or not just browsing so the user starts at some point, observing some objects and things.",
                    "label": 0
                },
                {
                    "sent": "Well, what am I actually looking at?",
                    "label": 0
                },
                {
                    "sent": "So we want the user we want to give the user some information about the object he is currently seeing.",
                    "label": 0
                },
                {
                    "sent": "And then of course what will be the next object?",
                    "label": 0
                },
                {
                    "sent": "I mean, every time the user has to make a decision.",
                    "label": 0
                },
                {
                    "sent": "Alright, I've seen this object.",
                    "label": 0
                },
                {
                    "sent": "What is the next thing?",
                    "label": 0
                },
                {
                    "sent": "I want to see so the whole tour is.",
                    "label": 1
                },
                {
                    "sent": "Basically, one stream of decisions and we would like to help the user with that and well, after you select the next one, you go observing again, and that's an iterative process.",
                    "label": 0
                },
                {
                    "sent": "So how can we help the visitor to navigate through the enormous collection?",
                    "label": 1
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we have the idea of using that using a mobile app because most people have their mobile phone with them always, so you see the same three stages as in the model on the previous slide.",
                    "label": 0
                },
                {
                    "sent": "So we have a starting point that is.",
                    "label": 1
                },
                {
                    "sent": "That looks at the location where the user currently is and you can select maybe some starting objects.",
                    "label": 0
                },
                {
                    "sent": "The famous ones which you may want to start with, or maybe not that you don't really have to start with a particular fixed point, but it can help the users who don't know anything about the museum to have some starting points.",
                    "label": 0
                },
                {
                    "sent": "So then we have here to observing parts of the application.",
                    "label": 0
                },
                {
                    "sent": "So you see a picture and some description an there is also the option of generating the audio for this description.",
                    "label": 0
                },
                {
                    "sent": "If maybe you don't really read that well or you dislike screens whatever and there would be some form of like or dislike option here.",
                    "label": 1
                },
                {
                    "sent": "So you can say well I like this object or I don't like this object and we want to take the likes and dislikes into consideration and generating the tour in what will be the next object to visit so that you don't see.",
                    "label": 1
                },
                {
                    "sent": "10 Buddha's if you don't like Buddha's.",
                    "label": 0
                },
                {
                    "sent": "So this is a well maybe the most important parts, the suggestion parts.",
                    "label": 0
                },
                {
                    "sent": "So what will be the next object to visit?",
                    "label": 0
                },
                {
                    "sent": "That is based on some features.",
                    "label": 0
                },
                {
                    "sent": "For instance, we don't want people to walk all the way through the museum like you have an object in the East Wing.",
                    "label": 1
                },
                {
                    "sent": "Then in The West Wing and you'll be doing a marathon and visiting like 5 objects.",
                    "label": 0
                },
                {
                    "sent": "Not fun, so we constrain the objects to some location near to where the current the user currently is.",
                    "label": 0
                },
                {
                    "sent": "Of course, we also filter out the ones he has already seen.",
                    "label": 1
                },
                {
                    "sent": "You don't want to be sent to the same objects because you like that you don't want to see it over and over again, and.",
                    "label": 0
                },
                {
                    "sent": "We used likes and dislikes as already told you, and of course a very important part is the similarity measure.",
                    "label": 0
                },
                {
                    "sent": "So we compute the similarity measure between the objects the user has already seen and maybe liked or disliked compared to the objects which are in his vicinity so that we know which ones he may like to see.",
                    "label": 1
                },
                {
                    "sent": "The similarity is computed based on some features of the product of the.",
                    "label": 0
                },
                {
                    "sent": "Artifacts in the data set, for instance culture.",
                    "label": 0
                },
                {
                    "sent": "What kind of object it is?",
                    "label": 0
                },
                {
                    "sent": "Is the painting or figure or something else and some others.",
                    "label": 0
                },
                {
                    "sent": "And we do a simple lexical match at the moment so we don't, so it's either.",
                    "label": 0
                },
                {
                    "sent": "It's the same, or it's not the same.",
                    "label": 0
                },
                {
                    "sent": "So if their culture is Egyptian, it should really be Egyptian.",
                    "label": 0
                },
                {
                    "sent": "If not, then any other culture, even if it may be related somehow, is not the same.",
                    "label": 0
                },
                {
                    "sent": "We do this because it's the fastest and most efficient way of ranking, because this has to be computed on the fly every time a user sees an object and you don't want to wait for your app while it is computing some very nice similarity measure.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this will be one of the screens in the demo which I will show at the end.",
                    "label": 0
                },
                {
                    "sent": "So you see here the picture from the mid middle parts of the previous slides and some text here the like and dislike button and the audio button.",
                    "label": 0
                },
                {
                    "sent": "So the demo at the end.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So some challenges.",
                    "label": 0
                },
                {
                    "sent": "We encountered an lessons learned, so we had some issues with the data because some things were missing in some cases or there was a lot of heterogeneity heterogeneity, so some labels, some slots were filled for some objects and others.",
                    "label": 0
                },
                {
                    "sent": "They were not filled.",
                    "label": 0
                },
                {
                    "sent": "So for instance, in room 30 three we had no titles for objects because they were all like vases and other stuff, so they all were all more or less the same.",
                    "label": 0
                },
                {
                    "sent": "So without titles, what can you display right?",
                    "label": 0
                },
                {
                    "sent": "Also there were rooms in the data set that were not on the floor plan, so we had room 298, but there are only 95 rooms in then we see him.",
                    "label": 0
                },
                {
                    "sent": "So that was a bit of an issue.",
                    "label": 0
                },
                {
                    "sent": "We solved that by just ignoring the rooms which are not in the floor plan that is just for the demo for now, but you would want to.",
                    "label": 1
                },
                {
                    "sent": "Solve that and make it 1 coherent schema for four rooms.",
                    "label": 0
                },
                {
                    "sent": "And we had a sparkle code running in Java and then entering that in the androids was not trivial because the Jenna stuff for Sparkle doesn't run under Android.",
                    "label": 0
                },
                {
                    "sent": "So all our nice queries didn't run anymore.",
                    "label": 1
                },
                {
                    "sent": "And so that was interesting.",
                    "label": 0
                },
                {
                    "sent": "So one of the lessons learned is not to put all your data unnecessarily in an ontology.",
                    "label": 1
                },
                {
                    "sent": "I mean ontologies are nice and we've learned that this week, but it's not the solution to everything.",
                    "label": 0
                },
                {
                    "sent": "So we had the floor plan.",
                    "label": 0
                },
                {
                    "sent": "For instance, in the CSV file or in an ontology.",
                    "label": 0
                },
                {
                    "sent": "And it turned out that the CSV version actually works a little bit better than having another ontology to work with.",
                    "label": 0
                },
                {
                    "sent": "And the this is an interesting one.",
                    "label": 1
                },
                {
                    "sent": "Software development as a messy process, so it's not a lab situation here.",
                    "label": 0
                },
                {
                    "sent": "We only have two days an.",
                    "label": 0
                },
                {
                    "sent": "In the beginning of to refine your idea.",
                    "label": 0
                },
                {
                    "sent": "So we were talking with the tutors and they had lots of interesting ideas and ways for us to think about the problem and then at some point, like right.",
                    "label": 1
                },
                {
                    "sent": "That's everything is interesting, but what should I do right?",
                    "label": 0
                },
                {
                    "sent": "So the data issues I already mentioned them at the platform issues as with a sparkle, so we don't know before hand where you will encounter bugs so we didn't know that Sparkle Library which we used wouldn't run on their androids.",
                    "label": 1
                },
                {
                    "sent": "An endpoint reliability is that this.",
                    "label": 0
                },
                {
                    "sent": "Very important if you would deploy the application is that if you rely on data from the data sets that you can gather that the endpoint should be running, which it wasn't at some point.",
                    "label": 0
                },
                {
                    "sent": "That's kind of hard.",
                    "label": 0
                },
                {
                    "sent": "So the lesson is be flexible.",
                    "label": 0
                },
                {
                    "sent": "So we got a backup endpoint which had a little bit different data, but we had to work around it and in the end it actually worked out pretty nice.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So last some ideas for future work so we could link with other data sources to give.",
                    "label": 0
                },
                {
                    "sent": "Maybe give more interesting data to the user while browsing the museum we have a digital souvenir, so if you like some objects you can create a personal story for the user which you can sort of take home.",
                    "label": 1
                },
                {
                    "sent": "Well, it's digital, so take homes.",
                    "label": 0
                },
                {
                    "sent": "Relative, so we have the knowledge base to collect because if we know where every user is, we know what route he is taking through the museum, which can be very useful for museums as well as their likes and dislikes.",
                    "label": 1
                },
                {
                    "sent": "And we can profile visitors as well, right?",
                    "label": 0
                },
                {
                    "sent": "I'll leave the rest and show the demo.",
                    "label": 0
                },
                {
                    "sent": "The demos only.",
                    "label": 0
                },
                {
                    "sent": "Is here so you will start up the application.",
                    "label": 0
                },
                {
                    "sent": "It will load.",
                    "label": 0
                },
                {
                    "sent": "This is the list of recommendations that you see.",
                    "label": 0
                },
                {
                    "sent": "You can scroll that you only get 3 because it will change anyway an it so that you can have a clear overview.",
                    "label": 0
                },
                {
                    "sent": "This would be the middle page which you already saw and here we have the numbers for the user profile, which you wouldn't see normally, but for the demo you do.",
                    "label": 0
                },
                {
                    "sent": "So you see here the various aspects of the object which we track.",
                    "label": 0
                },
                {
                    "sent": "Of course, the list is scrollable.",
                    "label": 0
                },
                {
                    "sent": "So we will hit the dislike button now so it will remain all zeros or the things and we check the list of recommendation after hitting the dislike button and we can see that in the end compared to the previous list, you get something else.",
                    "label": 0
                },
                {
                    "sent": "So you hit this like something.",
                    "label": 0
                },
                {
                    "sent": "You get a different object.",
                    "label": 0
                },
                {
                    "sent": "Now the picture is the same though, but the object is different and you get different objects there.",
                    "label": 0
                },
                {
                    "sent": "Why the pictures are the same?",
                    "label": 0
                },
                {
                    "sent": "The pictures were not on the end points so we couldn't load them.",
                    "label": 0
                },
                {
                    "sent": "So we just loaded some random pictures to fill.",
                    "label": 0
                },
                {
                    "sent": "The UE alright that's it.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}