{
    "id": "d7vvozcgecwysvrowjswspyplog6yon3",
    "title": "Statistical Computing on Manifolds for Computational Anatomy",
    "info": {
        "author": [
            "Xavier Pennec, INRIA Sophia Antipolis"
        ],
        "published": "Dec. 5, 2008",
        "recorded": "November 2008",
        "category": [
            "Top->Computer Science->Machine Learning->Manifold Learning"
        ]
    },
    "url": "http://videolectures.net/etvc08_pennec_scomf/",
    "segmentation": [
        [
            "So I would like first to thank the organizers for the invitation and the opportunity to present the work we've done within the Asclepius team on different ways to compute on statistics on remaining manifolds for computational Atom."
        ],
        [
            "So first I may begin with with anatomy and just to stress one thing, which is that the observation means change radically over the last 2020 year or so before since they are in the cells.",
            "Basically, most of the anatomical work was based on dissection.",
            "So ex vivo material which was described and for the last with the medical imaging we now have mean to observe.",
            "In Vivo an in situ so we can multiply the observation of the same patient of different patients of populations without destroying the tissues, and so this makes anatomy evolved.",
            "Into something where we're now instead of representative of trying to represent one specific individual which is representative of a population, we're now trying to represent the population as a whole, and we're trying to create Atlas which are not not anymore, just descriptive, but generative.",
            "An interactive in the sense that they can be used to simulate new anatomy's or be used at the support for simulating the function of organs.",
            "So this is.",
            "Points is an example of such in that class where you can put some biomechanical behavior on."
        ],
        [
            "Many other things.",
            "So within within that global picture, the goal of computational anatomy is to design mathematical methods to model and to analyze the anatomy.",
            "So it's basically, well.",
            "The idea is basically to try to find a statistical description of anatomical shapes.",
            "So the first thing is to find mean or something which is an average representative shape overpopulation.",
            "But this is also dealing with the development.",
            "And with the variability of shapes and the population can be homogeneous population.",
            "But it can also be.",
            "We also interested in through the evolution in aging in ages with full size or within different species.",
            "And the application are basically two folded.",
            "There is 1 application which is for the brain more related to neuroscience which is to try to describe how.",
            "How is the anatomy.",
            "And to understand how life is functioning.",
            "So it's basically the goal when you have a functional MRI where you want to relate the function with the anatomy, where is a function located in the brain?",
            "That's one of the questions which is of interest.",
            "And one of the goal within this application is to build prior that can be used in a second type of application which is more related to medicine and which is basically trying to use this prior to better deform some kind of generic Atlas into the specific anatomy's of one single individual.",
            "And this is something which is needed in order to help.",
            "Diagnosis and also therapy planning.",
            "Control and follow up."
        ],
        [
            "OK, so let's take one example.",
            "This.",
            "These are the surface is of four different brains.",
            "The goal is to find what is common and what is variable.",
            "What is the variability around the common features?",
            "So usually what is done is to try to rely on some kind of anatomical landmarks.",
            "So we're trying to extract some kind of features so it could be some specific points.",
            "Could be the some curves, so I will show you some examples where we using the circle curves, which are the trace of the of the search.",
            "See the surface of the brain.",
            "We could use the surface as themselves.",
            "We could use images and our example use the example of sunshine majoring in this talk.",
            "So this could be scrimmages or remaining valued images or transformations, and I will come to that point at the end.",
            "We're now trying to do some statistics on before morphisms and different types of transformations.",
            "So the idea is we are attracting this kind of features and then we're trying to find some kind of correspondence across the population and then we need to do some statistics to describe how what is the mean and how do that very.",
            "And so the first problem is that if you take a curve, if you take a tensor as we just saw before covariance matrix, this is not an object with just belongs to a vector space.",
            "This is generally an object which belongs to manifold.",
            "So we need to find a way to compute on money."
        ],
        [
            "And one of the example and I'm glad that Bob added, presented it in length before, so I don't have to go into detail.",
            "Is transferring majors in Tulsa images.",
            "You have.",
            "Basically current mattress is at each point.",
            "And we want to get from this diffusion measurements into tractography, but in between there is a lot of processing steps we need to have robust estimation.",
            "We need to have interpolation.",
            "We need to have filtering to get rid of the noise.",
            "The main problem is that if you're dealing with positive, define it much versus if you're doing some complex operations.",
            "Positive Ness is conserved.",
            "Is preserved, but if you're doing some PDS then you ending up with negative eigenvalues and this is not physical.",
            "So how to prevent the algorithm from stopping?",
            "So the idea is how to find an interesting way to compute on manifold values."
        ],
        [
            "Images.",
            "So the structure of my talk will be the.",
            "The following were first described.",
            "Examplify with cancer.",
            "How we can do some kind of statistiques or develops statistical framework to work on Riemannian manifolds?",
            "And then we'll go through diffusion tensor image processing and I will finish with computational anatomy example income."
        ],
        [
            "Back to the original problem.",
            "So one of the message of this work is that remain in geometry is one of the most powerful tool that we have to put some consistent structure to build a lot of algorithms and we have seen that.",
            "In different areas like shape spaces, numerical integration of dynamic systems, information geometry, an in statistics for image."
        ],
        [
            "Analysis.",
            "So first maybe I should come back to what is remaining manifold.",
            "If you just imagine this fear, you can see that you cannot just compare the tangent plane at this area at this point with the tangent plate at this point, this means that two tangent vectors are not compatible.",
            "So if we want to compute some length, the idea is to provide each tension space with a dot product so that you can compute the length of attention vector to a curve, and by integrating the length while the instantaneous speed along the curve, you can get the length of the speed.",
            "And if you look for the curve that minimize the length between any between two given points, then you're obtaining what we call the Java 6.",
            "And the job is X can be obtained with across form.",
            "For simple manifold this is what I will show for the affine invariant metrics for tensors, but for more general manifolds we have to rely on optimization.",
            "For instance, on different morphisms we can have left and right in left or right invariant metrics, but we have only optimization to compute the Jetix.",
            "So to work on many form the basic tool, which is the most important tool and this is this is not the only tool we need if we want to go deep, but this is, well, I will try to show you with that with the the storm, which is the exponential map, we can do already a lot of things.",
            "So the exponential map is the idea that you start from point X with a given tangent vector and you follow the job is sick.",
            "So this is a way to go from the tangent space to the manifold.",
            "And there is a reverse way that we call the log, which is basically unfolding the manifold onto detention space.",
            "And this is basically we can see that this is an equivalent of vectors, but the different this is converting a tangent vector to a point on the manifold.",
            "So this is basically if we start at X and we add the vector then we end up at point Y.",
            "But we cannot write it like in a Euclidean space because we cannot compare vectors that are different points.",
            "So we have to come back to the notion of by ponds, which is the antecedent of vectors.",
            "We have to remind which vector which is a base point of each vector.",
            "So using that notion, which is basically the, while the exponential map if we have a way to compute that, then we already know how to compute gradient Jodeci gradient descent, which is basically compute the gradient of your criterion, which is a tangent vector at the current point, and you follow the judges IK.",
            "For a little time along that tangent vector, this is just using the exponential.",
            "We can compute the distance, which is just the norm at the current point of the tangent vector that goes from XY.",
            "So we can already have a few algorithms."
        ],
        [
            "So here is an example of how it works on covariance matrix is.",
            "So the idea is.",
            "To put some kind of interesting metrics, the idea is to find a metric which is invariant and the largest group that we can think of is the GLN.",
            "While the Fine Transformation Group and if you think of random elements with mean value in occurrence metrics, the action of the French transformation is basically acting like that on the current metrics, and if we want to have a metric scalar product.",
            "At each point Sigma which is invariant by all the affine transformation, it should be invariant by the action, which is basically written like that, and in particular it should be invariant by the action of Sigma to the to the power minus 1/2, which is basically which relates to the the dot product that the identity.",
            "So it means that if we define a dot product at the identity, then we can propagate it using group action to any point on the manifold.",
            "But there is.",
            "Another condition that that product at the identity should be invariant by the other isotropic group, which means that if we apply a rotation then the point doesn't change and the dot product should be the same and we can.",
            "We can try to find all the rotationally invariant scalar product and we end up with this kind of formula where beta the condition is be on beta.",
            "Here is just to ensure that this is positive, define it.",
            "So we can we can.",
            "That way we have we have all the affine invariant Riemannian metric on the space of tensors and we can show that the geodesics can be expressed through the matrix exponential using this formula and the distance is given in across from using this formula, where this is the log of symmetric matrices."
        ],
        [
            "OK, so just just a few references, this metric or I should say this family of metric was some of these metrics were already proposed, so this is the Fisher Information metric which is well known in information geometry.",
            "But it's which was rediscovered for tensor processing over the last years.",
            "Actually, what is interesting is that very few works proposed metrics with beta different from zero and there is one work which is obtained by embedding the current metrics and the mean into homogeneous coordinates.",
            "And it's actually we can generalize this construction and obtain beta.",
            "Well, this is an embedding of the of the space of tensors into a higher dimensional space.",
            "Which has this metric, and so we can generalize this construction to any N plus any integral there, depending on the dimension of the space we can."
        ],
        [
            "OK, So what is the difference with the standard metric?",
            "So the first thing we can do is to try to follow the judges like that goes from distance or here to the Big 10.",
            "So there this is the interpolation along the Jordan sick for the Euclidean metric.",
            "So the interpolation on the coefficient.",
            "And this is here, the interpolation with the affine invariant Romanian metric and we can show that seems to be more smooth on the on the orientation.",
            "What is interesting is that the determinant, which is this curve there is interpolated in wow.",
            "Normal way there, whereas it goes through maximum.",
            "And if we interpret the determinant as some kind of probability, this is kind of strange the Euclidean."
        ],
        [
            "Right?",
            "OK, so now that we have a metric, how to do statistiques?",
            "So from a general point of view, the Romanian metric is giving us a volume from which with which we can define intrinsic probability density functions on Riemannian manifolds.",
            "So this means that we can define interesting quantities like on top is we can define the variance, which is the expected, expected, expected, squared distance.",
            "This is an integral with value to our, but we cannot define a mean value with an integral because we would be an integral with result.",
            "In the manifold and the manifold is not linear, so this is not possible.",
            "So there are different ways to compute the Meanwhile.",
            "To generalize the mean and the most.",
            "Use definition is the fresh air or cassia mean, which is basically trying to minimize the variance in the manifold which is geodesically complete.",
            "We can show that it it the fresh air culture mean is characterized as exponential by center.",
            "This means that if you take the main point and you develop everything in the tangent space, then the minimum mean value is new, which means that it corresponds to the usual it.",
            "Somehow the most linear.",
            "Representation of the manifold for this kind of distribution and what's interesting is that once we have sold for the mean, then we can go to the tangent space and define higher order moments like covariance matrices or higher order third order moments and things like that.",
            "So this is current mattress metrics in on the remaining manifold is some kind of object, while symmetric matrix which live in the tangent space and we can do some PCA.",
            "On some simple analysis we can also define some generalization of the Goshen.",
            "With which we can compute and some manner based distance, but I will not go into that."
        ],
        [
            "In this talk, so just a few examples, this is an example of seven images of canine hurt, which were registered together to compensate for the, well, the difference in the different anatomy's and the goal here was to try to investigate what is the variability of the fiber orientation.",
            "So the main the first eigenvalue of the current metrics of the cancer is the fiber orientation and the 2nd order.",
            "The the second egg and vector is related to the sheets in the heart structure and this is the result of the statistical analysis and basically so using their fine environmetrics and what we can show it that basically this is the variance is very low almost everywhere, which means that the the structure of the heart is very well conserved in in this case.",
            "So this means that we can use such a model that mean.",
            "Tensor as as a model to simulate."
        ],
        [
            "New anatomy.",
            "A second example of statistics on anatomical objects is given with the work of Jonathan Weather on.",
            "Spines and it's basically the idea is to study the deformation of scoliotic spines.",
            "So what we did is model the spinors and articulated object and so the degrees of freedom are the pose relative pose of successive vertebras.",
            "And if we're doing a statistical analysis computing the mean and the current metrics of the whole articulated model, which is a kind of vector of 17 rigid body transformations, we can extract the four first model variation.",
            "And we can see here the four first mode from a frontal view and the lateral view.",
            "And what is interesting is that before we were able to show that the four first mode are related with the clinical classification.",
            "So it's a case where using the right model tomorrow, which is which is geometric, which is intrinsically in Romanian manifold, is giving the right way to model the anatomy."
        ],
        [
            "OK, so let's go to the second part of the talk, which is now how to work with manifold valued images, and in particular with."
        ],
        [
            "With the example of console images, so we have seen the geodesic interpolation, so the interpolation between two values.",
            "Now what we need to work on images is bilinear or trilinear or sync interpolation.",
            "So how can we do that?",
            "Well, what we can do is rephrased the interpolation in terms of weighted means, and this is usually what is done.",
            "Actually a bilinear interpolation is the weight the mean of the full value of the different corners, weighted by the trailing arm or binary weights.",
            "So if we're doing that, the value of each at each point here is obtained by the minimization of dysfunctional.",
            "So one thing that I didn't said, and this is to answer partly to Bob's concern about the exact closed form is that we have a very efficient algorithm to compute the mean in any type of manifold, which is a Newton ghost Newton method, which is usually converging in five to 10 iteration to the numeric characters of the machine.",
            "So this is not something which is.",
            "I mean it's taking more time than the cross form, but not so much so we can compute weighted means at the cross of 10 times, let's say 10 iterations at each point, and this is the example.",
            "Interpolation between these four tensor.",
            "So this is the Euclidean interpolation between the coefficients and this is the using the fine environment."
        ],
        [
            "So now that we have weighted means, while we can try to use that tool to generalize all the types of algorithm, like for instance Gholson motion smoothing, which is nothing that awaited mean with Goshen weights.",
            "So this is the way we can do Goshen smoothing.",
            "This is this type of things and we can go on.",
            "So for harmonic regularization.",
            "So in that case there is something that happens is that since we're working on a manifold.",
            "The the the derivative of this criterion is the manifold application which takes into account the curvature of the manifold.",
            "But there is one very interesting things in the exponential map.",
            "Remember I said this exponential map is the basic tool.",
            "It is actually, well, the the curvature of the geodesics along the geodesics in that direction is new, so this is the thanks to this property.",
            "This numerical scheme, which is basically how to compute the Laplace and in the in the exponential map is intrinsically taking into account the curvature of the money, which means that we have a numerical scheme which is very simple to compute the derivative of that criterion.",
            "And we can try to make it evolve with a gradient descent and this can be generalized."
        ],
        [
            "And these are Tropic filtering, so here's an example.",
            "This is the raw image, so this is around the ventricles.",
            "So here you can see that there are a set of tensors which are following very well.",
            "Actually there is attract going around.",
            "So, but there is also some big errors at some points, so we want to regularize that.",
            "If we take a Goshen smoothing, then the error is well, there is some.",
            "Effect, which is not very what what we want.",
            "The big tensors are taking over the small ones if we're using the Goshen smoothing in the Romanian setting, then it's already better, and if we're taking the money so Tropic filtering, then we can conserve the boundaries between different types of regions, and in particular we can conserve some very fine details here in the image.",
            "So this is to show that we can generalize many different."
        ],
        [
            "Rhythms.",
            "On manifolds now the ideas we also need to estimate the tensors, we just I mean the estimation of the tense of themselves is also very important.",
            "So one of the interesting.",
            "Observation is that a deer engine.",
            "You have one baseline image and then diffusion images in different directions an as Bobby Moore issued before they are related with this signal in each image is related through this equation.",
            "So if you take the log of that then you have a linear system that you can solve that the noise in these images is not log ocean.",
            "Actually, the noise is Goshen noise, but in the complex image and we are usually using only the amplitude, which means that the noise is written and if we have a low signal to noise ratio, which is usually usually the case in clinical images, then we can show that there is a bias a systematic bags.",
            "So we should try to take into account this ties in the estimation and we should also try to take into account the neighboring features in order to better regularize the image.",
            "To one of the idea is to try to to have a criterion that take it into a conversation noise an A priori special prior for the regularization which is based on more points in cell Romanian."
        ],
        [
            "Patrick on tensors.",
            "So this is the.",
            "Ugly criterion that from minimizing.",
            "Actually, it's not very difficult when we do differentiate that it's a slight modification with respect to the standard least square technique, and this is the prior knowledge that we have on the special relationship, which basically means that.",
            "Within homogeneous region, when the gradient is not true to important, then we should have something constant.",
            "But if the gradient is very important, than it's probably the edge of a region and we don't want to regularize and this is the example of what we obtain.",
            "So this is this not estimation.",
            "All the missing tensors are tensors with negative eigenvalues.",
            "So if we're using just the this part, which is the likelihood of the observation, then we're having this.",
            "This estimation so it's independent at each point, and if we exploit the special relationship then we have this estimation which is much much smoother.",
            "And if we take some kind of measurements for the other therapy, which is what we what is called a fraction Alaniz atropy, then we can see that it's much better explain."
        ],
        [
            "And this is even more visible on the track geography that is extracted from the these images where we now have the fibers with goals well along the cold, and in particular.",
            "In that case we can see we can try to see what is happening in this part where there is a tumor, and in particular the question is, are the fibers broken by the tumor or just pushed?",
            "Which is which?",
            "Make a very big difference in the surgery that will be taken.",
            "Because if it's just push, then the surgeon can try to remove the tumor while keeping the spinal cord intact."
        ],
        [
            "So these are other type of results that can be obtained on normal."
        ],
        [
            "This is a very short announcement.",
            "We have a freeware when we are most of these techniques.",
            "Vay"
        ],
        [
            "Table.",
            "OK, so let's come back to the original problem, which is which was computational neuroanatomy."
        ],
        [
            "So what I want to present this method that we first developed well, actually for four years ago.",
            "In order to explain the viability of the brain, we choose to focus on so circle lines which are in that case manually delegated.",
            "This is the ground truth for us.",
            "This is given by neuroanatomist, although neuron atoms don't agree together.",
            "So for a different new anatomists, it's not the ground truth, but before us, as computer scientists it is.",
            "And we have these lines extracted and labeled in a few 100 subjects.",
            "So of course the idea is ultimately to lie on automatically extracted curves, an automatically labeled cell C. But this is still very difficult."
        ],
        [
            "Job so let's rely on the lines that are manually extracted.",
            "What we did is for each circle line, which is basically the green spaghetti plate.",
            "Here for the sylveon Fisher, we're trying to estimate the mean curve and at each point of the mean curve the covariance matrix, which explain the correspondence with all the curves that are observed in the database.",
            "And this is the representation that we get.",
            "Here it's the ellipsoid at one Sigma.",
            "That was on the viability along these lines and then we have the viability as occurrence Patricks, just along the lines and if you want to use that to compare to other methods then we need to accelerate through the whole brain.",
            "So in that case we can reuse the methods that we I described in the first part.",
            "Current mattress is are positive definite matrices, so we can use an extrapolation in that case.",
            "This is just to say that this criterion is driving the tons of field toward the observed observed values where we have along the cell C and we want to minimize the gradient everywhere else and this is.",
            "The kind of liability that we are observing while the color is actually the trace of the metrics, but we have the whole current metrics at any place."
        ],
        [
            "So of course we compare that with other methods, one since one method by Paul Thompson, which was based on the.",
            "Actually, on the surface registration on the on the cortical surface registration and what we can show what we can see is that there is a consensus consistently low viability in the frontal areas where basically the the brain evolved, the less over the evolution, and there is a very high variability in both cases in lateralized areas, so we can go deeper into, but there is many.",
            "Artifacts in them."
        ],
        [
            "Shipments, so one of the interesting thing is to try to change the method and have another way to measure the variability to try to compare and to see is it consistent.",
            "So what we did in the second study was to use.",
            "Modeling basically saying OK, we have a template of circle curves and this is a 3D four morphism that explain the displacement of the curve in each subject.",
            "So what we're looking for is a different morphism that drives lines on 2 lines.",
            "And what's interesting is that if we use the so-called TLDM framework largely for morphic metric mapping, then it's actually a left invariant or right invariant metric on the group of different morphism on ur group of different morphism.",
            "And we can reuse exactly the same.",
            "This is a Riemannian framework on the few morphism and the equivalent of the initial.",
            "Well, the vector speed the tangent vector to the judges is actually the initial vector speed with whom you shoot the different morphism.",
            "So we can do statistiques on different office in this framework as we did previously by doing statistics on the initial vector speed or initial momentum, and this is the result of the two hour PCA analysis actually on the same data.",
            "As before, and we are deforming the brain according to the two first mode of liability that we found in the different office."
        ],
        [
            "So actually what we're trying now is to is to try to generalize this kind of matching through all the types of features and the type of features we are really interested in is fiber tracts, which is basically a spaghetti plate.",
            "Locally we can trust into the orientation, but globally we are pretty sure that the curves are not the real wires of the brain.",
            "But locally they do well correspond, so we were trying to design methods to match this kind of features to make more appropriate statistics on the virus."
        ],
        [
            "City of the brain.",
            "And here's a very first example of what we can obtain if we try to register two sets up.",
            "Tracked, so this is this is ongoing work we hope to have better results for the statistical analysis in the next."
        ],
        [
            "In the coming months.",
            "OK, so I'm coming."
        ],
        [
            "My conclusion?",
            "I hope that I convince you that the Romanian framework is a powerful framework where we can define a consistent statistical framework and we have an efficient between quarts algorithmic toolbox based on the exponential map.",
            "To do some compute the mean to do convolution filtering gradient distance.",
            "So this is this is really I think.",
            "The basis for more complex algorithm that we can build on manifolds.",
            "It has some important application in medical image analysis.",
            "However, one.",
            "One question is remaining in that modeling if we, if we're trying to model groups.",
            "We have two sets of metrics which are interesting.",
            "These other left invariant, which is basically take a metric at the identity and compose on the left with an element of the group, and you have the right invariant metrics, and as soon as you go to none.",
            "Well, noncompact groups basically you don't have left and right invariant metric, which means that if you're computing the mean of a set of transformation or the mean of their inverse, they're not inverse of each other.",
            "This is one of the problem with there is no complete consistency between the mean or the statistical tool that we can define on the metric, and the group operations.",
            "So one of the questions we have shown that in some cases we.",
            "We can have left and right environments on groups and it seems that if we can use a lighter structure which is just based on connection, we could probably be able to define such.",
            "Interesting, not metrics, but a different framework."
        ],
        [
            "OK, not out.",
            "Another interesting.",
            "So we track of researches how to compute on infinite dimensional manifolds and actually that's the case for curves and surface is what we're doing currently and we're trying to explore currents to do that, which is a good way, but it's still open.",
            "How we could we could have that very efficient for using in some real applications.",
            "And the last very interesting question is how to choose the metric.",
            "The basis of the Romanian manifold is given a metric.",
            "We can do all that, but which metric should we choose?",
            "And actually the metric.",
            "For instance, they find Environmetrics, which seems to be very well suited for tensor imaging, is not well suited for other types of applications.",
            "And if there is a question of that on that, I have an example.",
            "So we should try to find different families.",
            "I think of metrics and investigate what other properties are they.",
            "Well suited for different problems, so that's one of the interesting questions."
        ],
        [
            "OK, I'm just to finish on computational anatomy.",
            "I think the next result will be obtained by building models on many different types of features that I extracted.",
            "Curved surface is tensors, tracks and put all that together in a single framework to be able to estimate to compare the statistiques where they are compatible, to validate to cross validate the different methods, and to try to obtain more information.",
            "Anne.",
            "Thanks to that we hope to be able to have more more personalized medicine in the sense that we will have a prior that that will allow us to better describe the individual anatomy of a given."
        ],
        [
            "Individual.",
            "And I would like to thank all the students and collaborators who worked with me and from whom you have seen some of the result in this talk.",
            "Thank you very much.",
            "Any questions?",
            "Thank you very interesting talk.",
            "I'm very much impressed and so one of them.",
            "My?",
            "Comment is the in the case of say, positive space of positive definite matrices.",
            "Usually we use the remainder metric which is drived from Gaussian distribution K and.",
            "But the doors, the quantum information people is another type of invariant, the Riemannian metric derived from productivity metrics, and so the invariant group to be accessed on positive definite matrix, easy.",
            "Also in our transformation.",
            "And there are many types of invariant Riemannian metric.",
            "So which type of who could have made it under damaged or using those three manual metric?",
            "I don't know the answer.",
            "Maybe you don't revert if you have some idea.",
            "It also concentrates Baba talk.",
            "Yeah, I completely agree there is.",
            "There is not one invariant for million metric even if we specify the group action there are there is a one parameter family in that case.",
            "And there are all the types of action that we could consider.",
            "For instance, to reorient answers in Intersubject registration.",
            "Most of the of the people consider that the fine should not change the eigenvalues, so we should have some kind of action which is different, which is the principle direction preservation of the principle direction action.",
            "So there are other types of actions we can define invariant metrics with respect to these groups.",
            "Case of PPD or less environmetrics.",
            "It has to be invariant by rotation.",
            "Basically the second type of invariants, which is scale invariants, which is interesting in our case, is it really?",
            "It's the effect is that it's giving it's putting the newer and infinite eigenvalues at the same distance there both at in an infinite distance.",
            "And this is what makes the computation works.",
            "Because basically we cannot reach a new Oregon value.",
            "It's as far as we can, as can be an infinite eigenvalue.",
            "So we could design all the types of environmetrics with respect to other groups, maybe not as invariants of that and one of the examples that we worked a lot with the log Euclidean.",
            "What we call the log Euclidean metric, which is only invariant by similarities, but which is giving a vector space structure to the space of tensors.",
            "And so we have.",
            "Explicit forms which which are much simpler than the other one because we are working the vector space in that case.",
            "So just environed by similarity, but it's way faster and actually for the results.",
            "It's very, very close to the affine invariant results, so I have no answer on what is the exact metric that we should use.",
            "Maybe that's a problem.",
            "How to choose the optimal metric.",
            "I think this is one of the interesting question for for the future.",
            "Yes, one more question.",
            "As you look at statistical variability across this anatomical structures, can you distinguish different sources of variability?",
            "For example, the spine of different people is variable.",
            "There's variability between different individuals, but maybe the spine of the same person varies overtime too.",
            "As the person ages.",
            "So they're going to be different kinds of variability in this data and can be factorized somehow using this.",
            "This techniques.",
            "This is one of the goal.",
            "I would say that the main problem is the availability of data, because actually.",
            "I would I would have loved to have a database with Pine in motion to be able to to test some kind of assumption.",
            "While some kind of algorithmic assumption is the motion within one individual representative of the variability within a population.",
            "But unfortunately we can't have that because it's X Rays, so it's the image in tissues.",
            "So you have two X Rays but not four, so that's one of the main problem.",
            "In medical imaging you have a limited amount of data on your.",
            "Always have to deal with the data that you can acquire, but obviously there we should be able to set up that and we're looking for that.",
            "We are trying to distinguish different types of disease.",
            "That's what we are aiming us in that domain, so hopefully there will be some results and there are already some results in some part of the brain for azimah.",
            "Also, if you specify sufficiently the assumptions then you can test and separates the populations.",
            "But if we met at the domain of, well, the statistical test on the population, which is OK, we know that there is a difference, but it's still not powerful enough to be able to quantify on a single individual to say for diagnosis, for instance.",
            "Search zavia quick comment and a question.",
            "By the way, nice truck and.",
            "In response to this unities question, what is the right metric?",
            "I think it depends on what you want to do really.",
            "Sometimes you want to preserve scalar measures like fractional anisotropy, in which case you can't use the remaining metric that you described because it doesn't preserve fractional.",
            "It doesn't preserve the FA mean.",
            "In other words, it doesn't preserve spectral properties of the of the SPD matrices.",
            "OK, but but again it depends on what you want to do.",
            "Sometimes you want to.",
            "Move out for clinical reasons.",
            "You may want to preserve the FA.",
            "That said, I just wanted to ask you what?",
            "What dynamic model did you use to predict the tensors in your extrapolation?",
            "Or did you have to use a dynamic model?",
            "You said you did an extrapolation of of the SPD matrices.",
            "Diffusion tensors, what I call extrapolation, is having values outside the wall.",
            "The values that we have actually the extrapolation that we used was for the brain.",
            "While you have the variability at each point and basically we're trying to to find the field that best match where there are some values and that minimize the gradients.",
            "So just it just based on minimizing the gradients of the of the tons of people, so it's not really a dynamical.",
            "Just a first order system.",
            "So thank you once more to the speaker."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I would like first to thank the organizers for the invitation and the opportunity to present the work we've done within the Asclepius team on different ways to compute on statistics on remaining manifolds for computational Atom.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So first I may begin with with anatomy and just to stress one thing, which is that the observation means change radically over the last 2020 year or so before since they are in the cells.",
                    "label": 0
                },
                {
                    "sent": "Basically, most of the anatomical work was based on dissection.",
                    "label": 0
                },
                {
                    "sent": "So ex vivo material which was described and for the last with the medical imaging we now have mean to observe.",
                    "label": 0
                },
                {
                    "sent": "In Vivo an in situ so we can multiply the observation of the same patient of different patients of populations without destroying the tissues, and so this makes anatomy evolved.",
                    "label": 0
                },
                {
                    "sent": "Into something where we're now instead of representative of trying to represent one specific individual which is representative of a population, we're now trying to represent the population as a whole, and we're trying to create Atlas which are not not anymore, just descriptive, but generative.",
                    "label": 0
                },
                {
                    "sent": "An interactive in the sense that they can be used to simulate new anatomy's or be used at the support for simulating the function of organs.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                },
                {
                    "sent": "Points is an example of such in that class where you can put some biomechanical behavior on.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Many other things.",
                    "label": 0
                },
                {
                    "sent": "So within within that global picture, the goal of computational anatomy is to design mathematical methods to model and to analyze the anatomy.",
                    "label": 1
                },
                {
                    "sent": "So it's basically, well.",
                    "label": 0
                },
                {
                    "sent": "The idea is basically to try to find a statistical description of anatomical shapes.",
                    "label": 0
                },
                {
                    "sent": "So the first thing is to find mean or something which is an average representative shape overpopulation.",
                    "label": 0
                },
                {
                    "sent": "But this is also dealing with the development.",
                    "label": 0
                },
                {
                    "sent": "And with the variability of shapes and the population can be homogeneous population.",
                    "label": 0
                },
                {
                    "sent": "But it can also be.",
                    "label": 0
                },
                {
                    "sent": "We also interested in through the evolution in aging in ages with full size or within different species.",
                    "label": 0
                },
                {
                    "sent": "And the application are basically two folded.",
                    "label": 0
                },
                {
                    "sent": "There is 1 application which is for the brain more related to neuroscience which is to try to describe how.",
                    "label": 0
                },
                {
                    "sent": "How is the anatomy.",
                    "label": 1
                },
                {
                    "sent": "And to understand how life is functioning.",
                    "label": 0
                },
                {
                    "sent": "So it's basically the goal when you have a functional MRI where you want to relate the function with the anatomy, where is a function located in the brain?",
                    "label": 0
                },
                {
                    "sent": "That's one of the questions which is of interest.",
                    "label": 0
                },
                {
                    "sent": "And one of the goal within this application is to build prior that can be used in a second type of application which is more related to medicine and which is basically trying to use this prior to better deform some kind of generic Atlas into the specific anatomy's of one single individual.",
                    "label": 0
                },
                {
                    "sent": "And this is something which is needed in order to help.",
                    "label": 0
                },
                {
                    "sent": "Diagnosis and also therapy planning.",
                    "label": 0
                },
                {
                    "sent": "Control and follow up.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so let's take one example.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "These are the surface is of four different brains.",
                    "label": 0
                },
                {
                    "sent": "The goal is to find what is common and what is variable.",
                    "label": 0
                },
                {
                    "sent": "What is the variability around the common features?",
                    "label": 0
                },
                {
                    "sent": "So usually what is done is to try to rely on some kind of anatomical landmarks.",
                    "label": 0
                },
                {
                    "sent": "So we're trying to extract some kind of features so it could be some specific points.",
                    "label": 0
                },
                {
                    "sent": "Could be the some curves, so I will show you some examples where we using the circle curves, which are the trace of the of the search.",
                    "label": 0
                },
                {
                    "sent": "See the surface of the brain.",
                    "label": 0
                },
                {
                    "sent": "We could use the surface as themselves.",
                    "label": 0
                },
                {
                    "sent": "We could use images and our example use the example of sunshine majoring in this talk.",
                    "label": 0
                },
                {
                    "sent": "So this could be scrimmages or remaining valued images or transformations, and I will come to that point at the end.",
                    "label": 0
                },
                {
                    "sent": "We're now trying to do some statistics on before morphisms and different types of transformations.",
                    "label": 0
                },
                {
                    "sent": "So the idea is we are attracting this kind of features and then we're trying to find some kind of correspondence across the population and then we need to do some statistics to describe how what is the mean and how do that very.",
                    "label": 0
                },
                {
                    "sent": "And so the first problem is that if you take a curve, if you take a tensor as we just saw before covariance matrix, this is not an object with just belongs to a vector space.",
                    "label": 0
                },
                {
                    "sent": "This is generally an object which belongs to manifold.",
                    "label": 0
                },
                {
                    "sent": "So we need to find a way to compute on money.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And one of the example and I'm glad that Bob added, presented it in length before, so I don't have to go into detail.",
                    "label": 0
                },
                {
                    "sent": "Is transferring majors in Tulsa images.",
                    "label": 0
                },
                {
                    "sent": "You have.",
                    "label": 0
                },
                {
                    "sent": "Basically current mattress is at each point.",
                    "label": 0
                },
                {
                    "sent": "And we want to get from this diffusion measurements into tractography, but in between there is a lot of processing steps we need to have robust estimation.",
                    "label": 1
                },
                {
                    "sent": "We need to have interpolation.",
                    "label": 0
                },
                {
                    "sent": "We need to have filtering to get rid of the noise.",
                    "label": 1
                },
                {
                    "sent": "The main problem is that if you're dealing with positive, define it much versus if you're doing some complex operations.",
                    "label": 1
                },
                {
                    "sent": "Positive Ness is conserved.",
                    "label": 0
                },
                {
                    "sent": "Is preserved, but if you're doing some PDS then you ending up with negative eigenvalues and this is not physical.",
                    "label": 0
                },
                {
                    "sent": "So how to prevent the algorithm from stopping?",
                    "label": 0
                },
                {
                    "sent": "So the idea is how to find an interesting way to compute on manifold values.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Images.",
                    "label": 0
                },
                {
                    "sent": "So the structure of my talk will be the.",
                    "label": 0
                },
                {
                    "sent": "The following were first described.",
                    "label": 0
                },
                {
                    "sent": "Examplify with cancer.",
                    "label": 0
                },
                {
                    "sent": "How we can do some kind of statistiques or develops statistical framework to work on Riemannian manifolds?",
                    "label": 0
                },
                {
                    "sent": "And then we'll go through diffusion tensor image processing and I will finish with computational anatomy example income.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Back to the original problem.",
                    "label": 0
                },
                {
                    "sent": "So one of the message of this work is that remain in geometry is one of the most powerful tool that we have to put some consistent structure to build a lot of algorithms and we have seen that.",
                    "label": 1
                },
                {
                    "sent": "In different areas like shape spaces, numerical integration of dynamic systems, information geometry, an in statistics for image.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Analysis.",
                    "label": 0
                },
                {
                    "sent": "So first maybe I should come back to what is remaining manifold.",
                    "label": 0
                },
                {
                    "sent": "If you just imagine this fear, you can see that you cannot just compare the tangent plane at this area at this point with the tangent plate at this point, this means that two tangent vectors are not compatible.",
                    "label": 0
                },
                {
                    "sent": "So if we want to compute some length, the idea is to provide each tension space with a dot product so that you can compute the length of attention vector to a curve, and by integrating the length while the instantaneous speed along the curve, you can get the length of the speed.",
                    "label": 1
                },
                {
                    "sent": "And if you look for the curve that minimize the length between any between two given points, then you're obtaining what we call the Java 6.",
                    "label": 0
                },
                {
                    "sent": "And the job is X can be obtained with across form.",
                    "label": 1
                },
                {
                    "sent": "For simple manifold this is what I will show for the affine invariant metrics for tensors, but for more general manifolds we have to rely on optimization.",
                    "label": 0
                },
                {
                    "sent": "For instance, on different morphisms we can have left and right in left or right invariant metrics, but we have only optimization to compute the Jetix.",
                    "label": 0
                },
                {
                    "sent": "So to work on many form the basic tool, which is the most important tool and this is this is not the only tool we need if we want to go deep, but this is, well, I will try to show you with that with the the storm, which is the exponential map, we can do already a lot of things.",
                    "label": 0
                },
                {
                    "sent": "So the exponential map is the idea that you start from point X with a given tangent vector and you follow the job is sick.",
                    "label": 0
                },
                {
                    "sent": "So this is a way to go from the tangent space to the manifold.",
                    "label": 0
                },
                {
                    "sent": "And there is a reverse way that we call the log, which is basically unfolding the manifold onto detention space.",
                    "label": 0
                },
                {
                    "sent": "And this is basically we can see that this is an equivalent of vectors, but the different this is converting a tangent vector to a point on the manifold.",
                    "label": 0
                },
                {
                    "sent": "So this is basically if we start at X and we add the vector then we end up at point Y.",
                    "label": 0
                },
                {
                    "sent": "But we cannot write it like in a Euclidean space because we cannot compare vectors that are different points.",
                    "label": 0
                },
                {
                    "sent": "So we have to come back to the notion of by ponds, which is the antecedent of vectors.",
                    "label": 0
                },
                {
                    "sent": "We have to remind which vector which is a base point of each vector.",
                    "label": 0
                },
                {
                    "sent": "So using that notion, which is basically the, while the exponential map if we have a way to compute that, then we already know how to compute gradient Jodeci gradient descent, which is basically compute the gradient of your criterion, which is a tangent vector at the current point, and you follow the judges IK.",
                    "label": 0
                },
                {
                    "sent": "For a little time along that tangent vector, this is just using the exponential.",
                    "label": 0
                },
                {
                    "sent": "We can compute the distance, which is just the norm at the current point of the tangent vector that goes from XY.",
                    "label": 0
                },
                {
                    "sent": "So we can already have a few algorithms.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here is an example of how it works on covariance matrix is.",
                    "label": 0
                },
                {
                    "sent": "So the idea is.",
                    "label": 0
                },
                {
                    "sent": "To put some kind of interesting metrics, the idea is to find a metric which is invariant and the largest group that we can think of is the GLN.",
                    "label": 0
                },
                {
                    "sent": "While the Fine Transformation Group and if you think of random elements with mean value in occurrence metrics, the action of the French transformation is basically acting like that on the current metrics, and if we want to have a metric scalar product.",
                    "label": 1
                },
                {
                    "sent": "At each point Sigma which is invariant by all the affine transformation, it should be invariant by the action, which is basically written like that, and in particular it should be invariant by the action of Sigma to the to the power minus 1/2, which is basically which relates to the the dot product that the identity.",
                    "label": 0
                },
                {
                    "sent": "So it means that if we define a dot product at the identity, then we can propagate it using group action to any point on the manifold.",
                    "label": 1
                },
                {
                    "sent": "But there is.",
                    "label": 0
                },
                {
                    "sent": "Another condition that that product at the identity should be invariant by the other isotropic group, which means that if we apply a rotation then the point doesn't change and the dot product should be the same and we can.",
                    "label": 1
                },
                {
                    "sent": "We can try to find all the rotationally invariant scalar product and we end up with this kind of formula where beta the condition is be on beta.",
                    "label": 0
                },
                {
                    "sent": "Here is just to ensure that this is positive, define it.",
                    "label": 0
                },
                {
                    "sent": "So we can we can.",
                    "label": 0
                },
                {
                    "sent": "That way we have we have all the affine invariant Riemannian metric on the space of tensors and we can show that the geodesics can be expressed through the matrix exponential using this formula and the distance is given in across from using this formula, where this is the log of symmetric matrices.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so just just a few references, this metric or I should say this family of metric was some of these metrics were already proposed, so this is the Fisher Information metric which is well known in information geometry.",
                    "label": 0
                },
                {
                    "sent": "But it's which was rediscovered for tensor processing over the last years.",
                    "label": 0
                },
                {
                    "sent": "Actually, what is interesting is that very few works proposed metrics with beta different from zero and there is one work which is obtained by embedding the current metrics and the mean into homogeneous coordinates.",
                    "label": 0
                },
                {
                    "sent": "And it's actually we can generalize this construction and obtain beta.",
                    "label": 0
                },
                {
                    "sent": "Well, this is an embedding of the of the space of tensors into a higher dimensional space.",
                    "label": 0
                },
                {
                    "sent": "Which has this metric, and so we can generalize this construction to any N plus any integral there, depending on the dimension of the space we can.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, So what is the difference with the standard metric?",
                    "label": 0
                },
                {
                    "sent": "So the first thing we can do is to try to follow the judges like that goes from distance or here to the Big 10.",
                    "label": 0
                },
                {
                    "sent": "So there this is the interpolation along the Jordan sick for the Euclidean metric.",
                    "label": 1
                },
                {
                    "sent": "So the interpolation on the coefficient.",
                    "label": 0
                },
                {
                    "sent": "And this is here, the interpolation with the affine invariant Romanian metric and we can show that seems to be more smooth on the on the orientation.",
                    "label": 0
                },
                {
                    "sent": "What is interesting is that the determinant, which is this curve there is interpolated in wow.",
                    "label": 0
                },
                {
                    "sent": "Normal way there, whereas it goes through maximum.",
                    "label": 0
                },
                {
                    "sent": "And if we interpret the determinant as some kind of probability, this is kind of strange the Euclidean.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "OK, so now that we have a metric, how to do statistiques?",
                    "label": 0
                },
                {
                    "sent": "So from a general point of view, the Romanian metric is giving us a volume from which with which we can define intrinsic probability density functions on Riemannian manifolds.",
                    "label": 0
                },
                {
                    "sent": "So this means that we can define interesting quantities like on top is we can define the variance, which is the expected, expected, expected, squared distance.",
                    "label": 0
                },
                {
                    "sent": "This is an integral with value to our, but we cannot define a mean value with an integral because we would be an integral with result.",
                    "label": 0
                },
                {
                    "sent": "In the manifold and the manifold is not linear, so this is not possible.",
                    "label": 1
                },
                {
                    "sent": "So there are different ways to compute the Meanwhile.",
                    "label": 1
                },
                {
                    "sent": "To generalize the mean and the most.",
                    "label": 0
                },
                {
                    "sent": "Use definition is the fresh air or cassia mean, which is basically trying to minimize the variance in the manifold which is geodesically complete.",
                    "label": 0
                },
                {
                    "sent": "We can show that it it the fresh air culture mean is characterized as exponential by center.",
                    "label": 0
                },
                {
                    "sent": "This means that if you take the main point and you develop everything in the tangent space, then the minimum mean value is new, which means that it corresponds to the usual it.",
                    "label": 0
                },
                {
                    "sent": "Somehow the most linear.",
                    "label": 0
                },
                {
                    "sent": "Representation of the manifold for this kind of distribution and what's interesting is that once we have sold for the mean, then we can go to the tangent space and define higher order moments like covariance matrices or higher order third order moments and things like that.",
                    "label": 1
                },
                {
                    "sent": "So this is current mattress metrics in on the remaining manifold is some kind of object, while symmetric matrix which live in the tangent space and we can do some PCA.",
                    "label": 0
                },
                {
                    "sent": "On some simple analysis we can also define some generalization of the Goshen.",
                    "label": 0
                },
                {
                    "sent": "With which we can compute and some manner based distance, but I will not go into that.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this talk, so just a few examples, this is an example of seven images of canine hurt, which were registered together to compensate for the, well, the difference in the different anatomy's and the goal here was to try to investigate what is the variability of the fiber orientation.",
                    "label": 0
                },
                {
                    "sent": "So the main the first eigenvalue of the current metrics of the cancer is the fiber orientation and the 2nd order.",
                    "label": 0
                },
                {
                    "sent": "The the second egg and vector is related to the sheets in the heart structure and this is the result of the statistical analysis and basically so using their fine environmetrics and what we can show it that basically this is the variance is very low almost everywhere, which means that the the structure of the heart is very well conserved in in this case.",
                    "label": 0
                },
                {
                    "sent": "So this means that we can use such a model that mean.",
                    "label": 0
                },
                {
                    "sent": "Tensor as as a model to simulate.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "New anatomy.",
                    "label": 0
                },
                {
                    "sent": "A second example of statistics on anatomical objects is given with the work of Jonathan Weather on.",
                    "label": 0
                },
                {
                    "sent": "Spines and it's basically the idea is to study the deformation of scoliotic spines.",
                    "label": 0
                },
                {
                    "sent": "So what we did is model the spinors and articulated object and so the degrees of freedom are the pose relative pose of successive vertebras.",
                    "label": 1
                },
                {
                    "sent": "And if we're doing a statistical analysis computing the mean and the current metrics of the whole articulated model, which is a kind of vector of 17 rigid body transformations, we can extract the four first model variation.",
                    "label": 0
                },
                {
                    "sent": "And we can see here the four first mode from a frontal view and the lateral view.",
                    "label": 0
                },
                {
                    "sent": "And what is interesting is that before we were able to show that the four first mode are related with the clinical classification.",
                    "label": 0
                },
                {
                    "sent": "So it's a case where using the right model tomorrow, which is which is geometric, which is intrinsically in Romanian manifold, is giving the right way to model the anatomy.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so let's go to the second part of the talk, which is now how to work with manifold valued images, and in particular with.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With the example of console images, so we have seen the geodesic interpolation, so the interpolation between two values.",
                    "label": 0
                },
                {
                    "sent": "Now what we need to work on images is bilinear or trilinear or sync interpolation.",
                    "label": 0
                },
                {
                    "sent": "So how can we do that?",
                    "label": 0
                },
                {
                    "sent": "Well, what we can do is rephrased the interpolation in terms of weighted means, and this is usually what is done.",
                    "label": 0
                },
                {
                    "sent": "Actually a bilinear interpolation is the weight the mean of the full value of the different corners, weighted by the trailing arm or binary weights.",
                    "label": 0
                },
                {
                    "sent": "So if we're doing that, the value of each at each point here is obtained by the minimization of dysfunctional.",
                    "label": 0
                },
                {
                    "sent": "So one thing that I didn't said, and this is to answer partly to Bob's concern about the exact closed form is that we have a very efficient algorithm to compute the mean in any type of manifold, which is a Newton ghost Newton method, which is usually converging in five to 10 iteration to the numeric characters of the machine.",
                    "label": 0
                },
                {
                    "sent": "So this is not something which is.",
                    "label": 0
                },
                {
                    "sent": "I mean it's taking more time than the cross form, but not so much so we can compute weighted means at the cross of 10 times, let's say 10 iterations at each point, and this is the example.",
                    "label": 0
                },
                {
                    "sent": "Interpolation between these four tensor.",
                    "label": 0
                },
                {
                    "sent": "So this is the Euclidean interpolation between the coefficients and this is the using the fine environment.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now that we have weighted means, while we can try to use that tool to generalize all the types of algorithm, like for instance Gholson motion smoothing, which is nothing that awaited mean with Goshen weights.",
                    "label": 0
                },
                {
                    "sent": "So this is the way we can do Goshen smoothing.",
                    "label": 0
                },
                {
                    "sent": "This is this type of things and we can go on.",
                    "label": 0
                },
                {
                    "sent": "So for harmonic regularization.",
                    "label": 0
                },
                {
                    "sent": "So in that case there is something that happens is that since we're working on a manifold.",
                    "label": 0
                },
                {
                    "sent": "The the the derivative of this criterion is the manifold application which takes into account the curvature of the manifold.",
                    "label": 0
                },
                {
                    "sent": "But there is one very interesting things in the exponential map.",
                    "label": 0
                },
                {
                    "sent": "Remember I said this exponential map is the basic tool.",
                    "label": 0
                },
                {
                    "sent": "It is actually, well, the the curvature of the geodesics along the geodesics in that direction is new, so this is the thanks to this property.",
                    "label": 0
                },
                {
                    "sent": "This numerical scheme, which is basically how to compute the Laplace and in the in the exponential map is intrinsically taking into account the curvature of the money, which means that we have a numerical scheme which is very simple to compute the derivative of that criterion.",
                    "label": 0
                },
                {
                    "sent": "And we can try to make it evolve with a gradient descent and this can be generalized.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And these are Tropic filtering, so here's an example.",
                    "label": 0
                },
                {
                    "sent": "This is the raw image, so this is around the ventricles.",
                    "label": 0
                },
                {
                    "sent": "So here you can see that there are a set of tensors which are following very well.",
                    "label": 0
                },
                {
                    "sent": "Actually there is attract going around.",
                    "label": 0
                },
                {
                    "sent": "So, but there is also some big errors at some points, so we want to regularize that.",
                    "label": 0
                },
                {
                    "sent": "If we take a Goshen smoothing, then the error is well, there is some.",
                    "label": 0
                },
                {
                    "sent": "Effect, which is not very what what we want.",
                    "label": 0
                },
                {
                    "sent": "The big tensors are taking over the small ones if we're using the Goshen smoothing in the Romanian setting, then it's already better, and if we're taking the money so Tropic filtering, then we can conserve the boundaries between different types of regions, and in particular we can conserve some very fine details here in the image.",
                    "label": 0
                },
                {
                    "sent": "So this is to show that we can generalize many different.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rhythms.",
                    "label": 0
                },
                {
                    "sent": "On manifolds now the ideas we also need to estimate the tensors, we just I mean the estimation of the tense of themselves is also very important.",
                    "label": 0
                },
                {
                    "sent": "So one of the interesting.",
                    "label": 0
                },
                {
                    "sent": "Observation is that a deer engine.",
                    "label": 0
                },
                {
                    "sent": "You have one baseline image and then diffusion images in different directions an as Bobby Moore issued before they are related with this signal in each image is related through this equation.",
                    "label": 0
                },
                {
                    "sent": "So if you take the log of that then you have a linear system that you can solve that the noise in these images is not log ocean.",
                    "label": 0
                },
                {
                    "sent": "Actually, the noise is Goshen noise, but in the complex image and we are usually using only the amplitude, which means that the noise is written and if we have a low signal to noise ratio, which is usually usually the case in clinical images, then we can show that there is a bias a systematic bags.",
                    "label": 0
                },
                {
                    "sent": "So we should try to take into account this ties in the estimation and we should also try to take into account the neighboring features in order to better regularize the image.",
                    "label": 0
                },
                {
                    "sent": "To one of the idea is to try to to have a criterion that take it into a conversation noise an A priori special prior for the regularization which is based on more points in cell Romanian.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Patrick on tensors.",
                    "label": 0
                },
                {
                    "sent": "So this is the.",
                    "label": 0
                },
                {
                    "sent": "Ugly criterion that from minimizing.",
                    "label": 0
                },
                {
                    "sent": "Actually, it's not very difficult when we do differentiate that it's a slight modification with respect to the standard least square technique, and this is the prior knowledge that we have on the special relationship, which basically means that.",
                    "label": 0
                },
                {
                    "sent": "Within homogeneous region, when the gradient is not true to important, then we should have something constant.",
                    "label": 0
                },
                {
                    "sent": "But if the gradient is very important, than it's probably the edge of a region and we don't want to regularize and this is the example of what we obtain.",
                    "label": 0
                },
                {
                    "sent": "So this is this not estimation.",
                    "label": 0
                },
                {
                    "sent": "All the missing tensors are tensors with negative eigenvalues.",
                    "label": 0
                },
                {
                    "sent": "So if we're using just the this part, which is the likelihood of the observation, then we're having this.",
                    "label": 0
                },
                {
                    "sent": "This estimation so it's independent at each point, and if we exploit the special relationship then we have this estimation which is much much smoother.",
                    "label": 0
                },
                {
                    "sent": "And if we take some kind of measurements for the other therapy, which is what we what is called a fraction Alaniz atropy, then we can see that it's much better explain.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is even more visible on the track geography that is extracted from the these images where we now have the fibers with goals well along the cold, and in particular.",
                    "label": 0
                },
                {
                    "sent": "In that case we can see we can try to see what is happening in this part where there is a tumor, and in particular the question is, are the fibers broken by the tumor or just pushed?",
                    "label": 0
                },
                {
                    "sent": "Which is which?",
                    "label": 0
                },
                {
                    "sent": "Make a very big difference in the surgery that will be taken.",
                    "label": 0
                },
                {
                    "sent": "Because if it's just push, then the surgeon can try to remove the tumor while keeping the spinal cord intact.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So these are other type of results that can be obtained on normal.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a very short announcement.",
                    "label": 0
                },
                {
                    "sent": "We have a freeware when we are most of these techniques.",
                    "label": 0
                },
                {
                    "sent": "Vay",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Table.",
                    "label": 0
                },
                {
                    "sent": "OK, so let's come back to the original problem, which is which was computational neuroanatomy.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what I want to present this method that we first developed well, actually for four years ago.",
                    "label": 0
                },
                {
                    "sent": "In order to explain the viability of the brain, we choose to focus on so circle lines which are in that case manually delegated.",
                    "label": 0
                },
                {
                    "sent": "This is the ground truth for us.",
                    "label": 0
                },
                {
                    "sent": "This is given by neuroanatomist, although neuron atoms don't agree together.",
                    "label": 0
                },
                {
                    "sent": "So for a different new anatomists, it's not the ground truth, but before us, as computer scientists it is.",
                    "label": 0
                },
                {
                    "sent": "And we have these lines extracted and labeled in a few 100 subjects.",
                    "label": 0
                },
                {
                    "sent": "So of course the idea is ultimately to lie on automatically extracted curves, an automatically labeled cell C. But this is still very difficult.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Job so let's rely on the lines that are manually extracted.",
                    "label": 0
                },
                {
                    "sent": "What we did is for each circle line, which is basically the green spaghetti plate.",
                    "label": 0
                },
                {
                    "sent": "Here for the sylveon Fisher, we're trying to estimate the mean curve and at each point of the mean curve the covariance matrix, which explain the correspondence with all the curves that are observed in the database.",
                    "label": 0
                },
                {
                    "sent": "And this is the representation that we get.",
                    "label": 0
                },
                {
                    "sent": "Here it's the ellipsoid at one Sigma.",
                    "label": 0
                },
                {
                    "sent": "That was on the viability along these lines and then we have the viability as occurrence Patricks, just along the lines and if you want to use that to compare to other methods then we need to accelerate through the whole brain.",
                    "label": 0
                },
                {
                    "sent": "So in that case we can reuse the methods that we I described in the first part.",
                    "label": 0
                },
                {
                    "sent": "Current mattress is are positive definite matrices, so we can use an extrapolation in that case.",
                    "label": 0
                },
                {
                    "sent": "This is just to say that this criterion is driving the tons of field toward the observed observed values where we have along the cell C and we want to minimize the gradient everywhere else and this is.",
                    "label": 0
                },
                {
                    "sent": "The kind of liability that we are observing while the color is actually the trace of the metrics, but we have the whole current metrics at any place.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So of course we compare that with other methods, one since one method by Paul Thompson, which was based on the.",
                    "label": 0
                },
                {
                    "sent": "Actually, on the surface registration on the on the cortical surface registration and what we can show what we can see is that there is a consensus consistently low viability in the frontal areas where basically the the brain evolved, the less over the evolution, and there is a very high variability in both cases in lateralized areas, so we can go deeper into, but there is many.",
                    "label": 0
                },
                {
                    "sent": "Artifacts in them.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Shipments, so one of the interesting thing is to try to change the method and have another way to measure the variability to try to compare and to see is it consistent.",
                    "label": 0
                },
                {
                    "sent": "So what we did in the second study was to use.",
                    "label": 0
                },
                {
                    "sent": "Modeling basically saying OK, we have a template of circle curves and this is a 3D four morphism that explain the displacement of the curve in each subject.",
                    "label": 0
                },
                {
                    "sent": "So what we're looking for is a different morphism that drives lines on 2 lines.",
                    "label": 0
                },
                {
                    "sent": "And what's interesting is that if we use the so-called TLDM framework largely for morphic metric mapping, then it's actually a left invariant or right invariant metric on the group of different morphism on ur group of different morphism.",
                    "label": 0
                },
                {
                    "sent": "And we can reuse exactly the same.",
                    "label": 0
                },
                {
                    "sent": "This is a Riemannian framework on the few morphism and the equivalent of the initial.",
                    "label": 0
                },
                {
                    "sent": "Well, the vector speed the tangent vector to the judges is actually the initial vector speed with whom you shoot the different morphism.",
                    "label": 0
                },
                {
                    "sent": "So we can do statistiques on different office in this framework as we did previously by doing statistics on the initial vector speed or initial momentum, and this is the result of the two hour PCA analysis actually on the same data.",
                    "label": 0
                },
                {
                    "sent": "As before, and we are deforming the brain according to the two first mode of liability that we found in the different office.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So actually what we're trying now is to is to try to generalize this kind of matching through all the types of features and the type of features we are really interested in is fiber tracts, which is basically a spaghetti plate.",
                    "label": 0
                },
                {
                    "sent": "Locally we can trust into the orientation, but globally we are pretty sure that the curves are not the real wires of the brain.",
                    "label": 0
                },
                {
                    "sent": "But locally they do well correspond, so we were trying to design methods to match this kind of features to make more appropriate statistics on the virus.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "City of the brain.",
                    "label": 0
                },
                {
                    "sent": "And here's a very first example of what we can obtain if we try to register two sets up.",
                    "label": 0
                },
                {
                    "sent": "Tracked, so this is this is ongoing work we hope to have better results for the statistical analysis in the next.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the coming months.",
                    "label": 0
                },
                {
                    "sent": "OK, so I'm coming.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My conclusion?",
                    "label": 0
                },
                {
                    "sent": "I hope that I convince you that the Romanian framework is a powerful framework where we can define a consistent statistical framework and we have an efficient between quarts algorithmic toolbox based on the exponential map.",
                    "label": 0
                },
                {
                    "sent": "To do some compute the mean to do convolution filtering gradient distance.",
                    "label": 0
                },
                {
                    "sent": "So this is this is really I think.",
                    "label": 0
                },
                {
                    "sent": "The basis for more complex algorithm that we can build on manifolds.",
                    "label": 0
                },
                {
                    "sent": "It has some important application in medical image analysis.",
                    "label": 0
                },
                {
                    "sent": "However, one.",
                    "label": 0
                },
                {
                    "sent": "One question is remaining in that modeling if we, if we're trying to model groups.",
                    "label": 0
                },
                {
                    "sent": "We have two sets of metrics which are interesting.",
                    "label": 0
                },
                {
                    "sent": "These other left invariant, which is basically take a metric at the identity and compose on the left with an element of the group, and you have the right invariant metrics, and as soon as you go to none.",
                    "label": 0
                },
                {
                    "sent": "Well, noncompact groups basically you don't have left and right invariant metric, which means that if you're computing the mean of a set of transformation or the mean of their inverse, they're not inverse of each other.",
                    "label": 0
                },
                {
                    "sent": "This is one of the problem with there is no complete consistency between the mean or the statistical tool that we can define on the metric, and the group operations.",
                    "label": 0
                },
                {
                    "sent": "So one of the questions we have shown that in some cases we.",
                    "label": 0
                },
                {
                    "sent": "We can have left and right environments on groups and it seems that if we can use a lighter structure which is just based on connection, we could probably be able to define such.",
                    "label": 0
                },
                {
                    "sent": "Interesting, not metrics, but a different framework.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, not out.",
                    "label": 0
                },
                {
                    "sent": "Another interesting.",
                    "label": 0
                },
                {
                    "sent": "So we track of researches how to compute on infinite dimensional manifolds and actually that's the case for curves and surface is what we're doing currently and we're trying to explore currents to do that, which is a good way, but it's still open.",
                    "label": 0
                },
                {
                    "sent": "How we could we could have that very efficient for using in some real applications.",
                    "label": 0
                },
                {
                    "sent": "And the last very interesting question is how to choose the metric.",
                    "label": 0
                },
                {
                    "sent": "The basis of the Romanian manifold is given a metric.",
                    "label": 0
                },
                {
                    "sent": "We can do all that, but which metric should we choose?",
                    "label": 0
                },
                {
                    "sent": "And actually the metric.",
                    "label": 0
                },
                {
                    "sent": "For instance, they find Environmetrics, which seems to be very well suited for tensor imaging, is not well suited for other types of applications.",
                    "label": 0
                },
                {
                    "sent": "And if there is a question of that on that, I have an example.",
                    "label": 0
                },
                {
                    "sent": "So we should try to find different families.",
                    "label": 0
                },
                {
                    "sent": "I think of metrics and investigate what other properties are they.",
                    "label": 0
                },
                {
                    "sent": "Well suited for different problems, so that's one of the interesting questions.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I'm just to finish on computational anatomy.",
                    "label": 0
                },
                {
                    "sent": "I think the next result will be obtained by building models on many different types of features that I extracted.",
                    "label": 0
                },
                {
                    "sent": "Curved surface is tensors, tracks and put all that together in a single framework to be able to estimate to compare the statistiques where they are compatible, to validate to cross validate the different methods, and to try to obtain more information.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Thanks to that we hope to be able to have more more personalized medicine in the sense that we will have a prior that that will allow us to better describe the individual anatomy of a given.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Individual.",
                    "label": 0
                },
                {
                    "sent": "And I would like to thank all the students and collaborators who worked with me and from whom you have seen some of the result in this talk.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Any questions?",
                    "label": 0
                },
                {
                    "sent": "Thank you very interesting talk.",
                    "label": 0
                },
                {
                    "sent": "I'm very much impressed and so one of them.",
                    "label": 0
                },
                {
                    "sent": "My?",
                    "label": 0
                },
                {
                    "sent": "Comment is the in the case of say, positive space of positive definite matrices.",
                    "label": 0
                },
                {
                    "sent": "Usually we use the remainder metric which is drived from Gaussian distribution K and.",
                    "label": 0
                },
                {
                    "sent": "But the doors, the quantum information people is another type of invariant, the Riemannian metric derived from productivity metrics, and so the invariant group to be accessed on positive definite matrix, easy.",
                    "label": 0
                },
                {
                    "sent": "Also in our transformation.",
                    "label": 0
                },
                {
                    "sent": "And there are many types of invariant Riemannian metric.",
                    "label": 0
                },
                {
                    "sent": "So which type of who could have made it under damaged or using those three manual metric?",
                    "label": 0
                },
                {
                    "sent": "I don't know the answer.",
                    "label": 0
                },
                {
                    "sent": "Maybe you don't revert if you have some idea.",
                    "label": 0
                },
                {
                    "sent": "It also concentrates Baba talk.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I completely agree there is.",
                    "label": 0
                },
                {
                    "sent": "There is not one invariant for million metric even if we specify the group action there are there is a one parameter family in that case.",
                    "label": 0
                },
                {
                    "sent": "And there are all the types of action that we could consider.",
                    "label": 0
                },
                {
                    "sent": "For instance, to reorient answers in Intersubject registration.",
                    "label": 0
                },
                {
                    "sent": "Most of the of the people consider that the fine should not change the eigenvalues, so we should have some kind of action which is different, which is the principle direction preservation of the principle direction action.",
                    "label": 0
                },
                {
                    "sent": "So there are other types of actions we can define invariant metrics with respect to these groups.",
                    "label": 0
                },
                {
                    "sent": "Case of PPD or less environmetrics.",
                    "label": 0
                },
                {
                    "sent": "It has to be invariant by rotation.",
                    "label": 0
                },
                {
                    "sent": "Basically the second type of invariants, which is scale invariants, which is interesting in our case, is it really?",
                    "label": 0
                },
                {
                    "sent": "It's the effect is that it's giving it's putting the newer and infinite eigenvalues at the same distance there both at in an infinite distance.",
                    "label": 0
                },
                {
                    "sent": "And this is what makes the computation works.",
                    "label": 0
                },
                {
                    "sent": "Because basically we cannot reach a new Oregon value.",
                    "label": 0
                },
                {
                    "sent": "It's as far as we can, as can be an infinite eigenvalue.",
                    "label": 0
                },
                {
                    "sent": "So we could design all the types of environmetrics with respect to other groups, maybe not as invariants of that and one of the examples that we worked a lot with the log Euclidean.",
                    "label": 0
                },
                {
                    "sent": "What we call the log Euclidean metric, which is only invariant by similarities, but which is giving a vector space structure to the space of tensors.",
                    "label": 0
                },
                {
                    "sent": "And so we have.",
                    "label": 0
                },
                {
                    "sent": "Explicit forms which which are much simpler than the other one because we are working the vector space in that case.",
                    "label": 0
                },
                {
                    "sent": "So just environed by similarity, but it's way faster and actually for the results.",
                    "label": 0
                },
                {
                    "sent": "It's very, very close to the affine invariant results, so I have no answer on what is the exact metric that we should use.",
                    "label": 0
                },
                {
                    "sent": "Maybe that's a problem.",
                    "label": 0
                },
                {
                    "sent": "How to choose the optimal metric.",
                    "label": 0
                },
                {
                    "sent": "I think this is one of the interesting question for for the future.",
                    "label": 0
                },
                {
                    "sent": "Yes, one more question.",
                    "label": 0
                },
                {
                    "sent": "As you look at statistical variability across this anatomical structures, can you distinguish different sources of variability?",
                    "label": 0
                },
                {
                    "sent": "For example, the spine of different people is variable.",
                    "label": 0
                },
                {
                    "sent": "There's variability between different individuals, but maybe the spine of the same person varies overtime too.",
                    "label": 0
                },
                {
                    "sent": "As the person ages.",
                    "label": 0
                },
                {
                    "sent": "So they're going to be different kinds of variability in this data and can be factorized somehow using this.",
                    "label": 0
                },
                {
                    "sent": "This techniques.",
                    "label": 0
                },
                {
                    "sent": "This is one of the goal.",
                    "label": 0
                },
                {
                    "sent": "I would say that the main problem is the availability of data, because actually.",
                    "label": 0
                },
                {
                    "sent": "I would I would have loved to have a database with Pine in motion to be able to to test some kind of assumption.",
                    "label": 0
                },
                {
                    "sent": "While some kind of algorithmic assumption is the motion within one individual representative of the variability within a population.",
                    "label": 0
                },
                {
                    "sent": "But unfortunately we can't have that because it's X Rays, so it's the image in tissues.",
                    "label": 0
                },
                {
                    "sent": "So you have two X Rays but not four, so that's one of the main problem.",
                    "label": 0
                },
                {
                    "sent": "In medical imaging you have a limited amount of data on your.",
                    "label": 0
                },
                {
                    "sent": "Always have to deal with the data that you can acquire, but obviously there we should be able to set up that and we're looking for that.",
                    "label": 0
                },
                {
                    "sent": "We are trying to distinguish different types of disease.",
                    "label": 0
                },
                {
                    "sent": "That's what we are aiming us in that domain, so hopefully there will be some results and there are already some results in some part of the brain for azimah.",
                    "label": 0
                },
                {
                    "sent": "Also, if you specify sufficiently the assumptions then you can test and separates the populations.",
                    "label": 0
                },
                {
                    "sent": "But if we met at the domain of, well, the statistical test on the population, which is OK, we know that there is a difference, but it's still not powerful enough to be able to quantify on a single individual to say for diagnosis, for instance.",
                    "label": 0
                },
                {
                    "sent": "Search zavia quick comment and a question.",
                    "label": 0
                },
                {
                    "sent": "By the way, nice truck and.",
                    "label": 0
                },
                {
                    "sent": "In response to this unities question, what is the right metric?",
                    "label": 0
                },
                {
                    "sent": "I think it depends on what you want to do really.",
                    "label": 0
                },
                {
                    "sent": "Sometimes you want to preserve scalar measures like fractional anisotropy, in which case you can't use the remaining metric that you described because it doesn't preserve fractional.",
                    "label": 0
                },
                {
                    "sent": "It doesn't preserve the FA mean.",
                    "label": 0
                },
                {
                    "sent": "In other words, it doesn't preserve spectral properties of the of the SPD matrices.",
                    "label": 0
                },
                {
                    "sent": "OK, but but again it depends on what you want to do.",
                    "label": 0
                },
                {
                    "sent": "Sometimes you want to.",
                    "label": 0
                },
                {
                    "sent": "Move out for clinical reasons.",
                    "label": 0
                },
                {
                    "sent": "You may want to preserve the FA.",
                    "label": 0
                },
                {
                    "sent": "That said, I just wanted to ask you what?",
                    "label": 0
                },
                {
                    "sent": "What dynamic model did you use to predict the tensors in your extrapolation?",
                    "label": 0
                },
                {
                    "sent": "Or did you have to use a dynamic model?",
                    "label": 0
                },
                {
                    "sent": "You said you did an extrapolation of of the SPD matrices.",
                    "label": 0
                },
                {
                    "sent": "Diffusion tensors, what I call extrapolation, is having values outside the wall.",
                    "label": 0
                },
                {
                    "sent": "The values that we have actually the extrapolation that we used was for the brain.",
                    "label": 0
                },
                {
                    "sent": "While you have the variability at each point and basically we're trying to to find the field that best match where there are some values and that minimize the gradients.",
                    "label": 0
                },
                {
                    "sent": "So just it just based on minimizing the gradients of the of the tons of people, so it's not really a dynamical.",
                    "label": 0
                },
                {
                    "sent": "Just a first order system.",
                    "label": 0
                },
                {
                    "sent": "So thank you once more to the speaker.",
                    "label": 0
                }
            ]
        }
    }
}