{
    "id": "deekuk46khbox2pq75v5wa2f2ggprtdq",
    "title": "Methodological aspects in integromics: integrating multiple omics data sets",
    "info": {
        "author": [
            "Kristel Van Steen, Department of Electrical Engineering and Computer Science, University of Liège"
        ],
        "published": "Feb. 17, 2015",
        "recorded": "September 2014",
        "category": [
            "Top->Computer Science->Machine Learning",
            "Top->Medicine"
        ]
    },
    "url": "http://videolectures.net/mlpmsummerschool2014_van_steen_integromics/",
    "segmentation": [
        [
            "I have to say that after the break is strong and so although he will be excited because it's like all this card in reference, I never really thought about it.",
            "Then how could I kind of integrate what you were talking about before the break with what I'm going to talk about right now.",
            "So we'll see how it works out but."
        ],
        [
            "Anyway, I tried to compare some slides together to give you some kind of an idea.",
            "What are the potential pitfalls or what we should really take into account when we start integrating different OMICS datasets.",
            "Or maybe more generally moment.",
            "We also acknowledged normalized data clinical.",
            "Anyone coming to the data integration?",
            "And I'm going to provide you a toy example to show these with some of these issues that we will be dealing with.",
            "And for example there will be updating from my backyard from others.",
            "Genomic Association interaction studies and obviously our first motivate while take them tight sample and it does vary greatly depending on the direction or time permitting.",
            "Well just briefly mention novel intercollegiate analysis.",
            "Frameworks and you know, trying to vindicate you too will extend.",
            "This can help us in general into growing cycle analysis."
        ],
        [
            "So this is a team, so everything that I'm going to talk about is really attributed to all of these people who."
        ],
        [
            "By that ideas and there are currently thinking about this.",
            "I should also mention that one of my creations isn't assistant.",
            "The GL and more in particular mathematical research unit for systems biology and chemical biology, because some of you might wonder why she talking about him to grow mix.",
            "We mourn over about publications on interaction studies, where as you may know, exposure makes a big difference.",
            "Now if you're exposed to a lot of data for a lot of ideas, if you have data available.",
            "Start thinking about how you can analyze these data and metrics.",
            "Development is the logical next."
        ],
        [
            "So integro mix."
        ],
        [
            "Well, if you Google for into grommets and if you are doing it right now, hope you will have the same results as I had.",
            "You first hit.",
            "Maybe you know commercial companies or software packages and this is quite amazing because usually you first are directed to another Wikipedia page, something like that.",
            "So it means that this term is not included in classical libraries or whatever.",
            "And if you look at this particular location and refers to an R package in the Bronx, and you read through the paper, then you see keyboards like joints analysis, value general, right?",
            "Challenging statistics is that we know it will be challenging, but then turns like regularised, dealing with sparse data, and a lot of missing data points were all data are available for all the individuals in the sample.",
            "Generalize because we're dealing with variables magical, different skills, different measurement types, and this is kind of already pointing out into a Sir."
        ],
        [
            "Direction, but actually the term integration often appears in definitions for data Fusion and some light conditions, or engineers of our new.",
            "They are perhaps more familiar with the term data Fusion, and although one is using definition of the other.",
            "Don't exactly the same, and I particularly like this paper of oxygen for some, who in 2010.",
            "Four computers that Fusion can be defined as some kind of a process of optimally mapping several objects into a single object, but integration goes much further.",
            "It is really about connecting systems, finding into relationships, you know, interface into a larger system.",
            "This is still fake, right?",
            "But if you read through that paper you will find also a framework you know to put it in a more mathematical context and."
        ],
        [
            "That's the next slide can further elucidate on Rd I will see as true challenges of integrated analysis.",
            "Truly integrated analysis and that is that whatever analysis you do well, we needed particulare an environment to be able to do this.",
            "And I'm not talking about architectural environments, which obviously part also implemented.",
            "But is it more likely to be successful in the intercom and innovative disciplinary, interdisciplinary, or transdisciplinary research environment?",
            "And just briefly, what do I mean by that?",
            "Move to disciplinary just means that an initial problem is divided in some subproblems, and there is very limited, really.",
            "Integration or combination are going off.",
            "And the interdisciplinary already goes one step further, so we tried to adopt discipline, specific perspectives, viewpoints, and you have a joint effort to solve this common problem.",
            "I think if you really need to go one step further, what is sometimes referred to as transdisciplinary approaches, because we really need is active synergy between the disciplines to create solutions to the problem that you would otherwise never completely solve, leaving alone that we will ever, probably will ever be able to solve the problem that we really want to solve.",
            "But interesting before the transdisciplinary approach and actually already also for an interdisciplinary efforts.",
            "We need to establish a common language and I experienced this in my daily life.",
            "You know you have so many different viewpoints.",
            "Data sources come from different communities.",
            "When you start integrating data and we need to try to discover the common language and I'm sure it will happen.",
            "This hour coming to ours as well, but if you do not understand something, please raise your hand if you want."
        ],
        [
            "Agent so do we have a multi ton motivation to integrate data movie?",
            "Nation because it is well established at the application of force, all predicted variables and mechanisms for diseases or sociative traits is very complex.",
            "It's characterized by complex networks of molecular phenotypes.",
            "This gives us the motivation.",
            "And what about your opportunity?",
            "Yes, we have an increasing number of technologies becoming available for data generation and our computer.",
            "Facilities also get get approved, so these two things are very important of course to before we can start addressing some specific questions and now, and that's not our next move would be a good motion arrangement, same data and trying to see how many friends."
        ],
        [
            "So to continue on that seat, for do we observe, while we observe that the Super regulator generation, all these technologies and increasing computer facilities involved is kind of counter weighted by this extremely slow pace of data, integrative methods development, it can't keep up with the data.",
            "That comes to our call to our guests.",
            "And the second thing is that most currently available integration analytic methods they involve like pairing tool on example.",
            "Think about EPL analysis now so it's linking genomic data through transmit open.",
            "And So what happens more and more often is that, for instance, you do have these three sources of material types available.",
            "And notably, Transcriptome is one data source.",
            "But we know that from differences in publications etc.",
            "So this is an extra complexity but will not be identical.",
            "Nations entertainer would like to link it with the phenotype of interest or removing this year as well as collections of phenotypes.",
            "You would like to link it to maybe gene expression and want issue that you have with you that special other fishing.",
            "And likewise we would like to link the expression data to your phenotype data again.",
            "What people do very naively said it's much more complex than that, but basically it's look for everything on the table.",
            "I tried to see you know, to to try to better comprehend if you compromise with you.",
            "I would really like to move to include a situation where we can integrate it in the analytic model or initiator sources, so where this is more an example of this movie, Mr interdisciplinary forgetting.",
            "I'm really trying to incorporate all these relationships into."
        ],
        [
            "Everyone is welcome.",
            "So.",
            "This model.",
            "So we know that a lot of limited number of initiatives on this truly integrated.",
            "Roach and what could be a reason for that, but maybe because there is or something prior laptop is out of the box thinking so you go outside your comfort zone to really reach out to another community and to make an effort to understand the work they are doing.",
            "You can't know everything.",
            "Overall feels that loan another field but at least try to read each other somewhere.",
            "How with and to extract information from the other community that might be relevant for Blue Star developin the models.",
            "So in that way it is also essential to really understand the underlying assumptions of the analytic methods that you are using an integrated data, because obviously we've already version.",
            "So garbage in garbage out with respect to data.",
            "But also if you apply a method and the normal assumption is not valid.",
            "While you can tell anything about it afterwards and it just doesn't make sense, and it can work actually in a negative way.",
            "Because things are getting published and there are negative results or it's not that successful.",
            "People might abandon application of massive, but maybe the method on its own, you know, intrinsically, my view.",
            "Very good method, but just it was not applied in most appropriately.",
            "This is another problem."
        ],
        [
            "Now some of these things about motivation and opportunities and a little bit more elaborate, reflecting to book chapter for Big Data Analytics invite Fanatics and Healthcare.",
            "So if you would like to learn more about it except it's not yet published, sending emails without consent."
        ],
        [
            "Do we have babies?",
            "Do we have the means to get out of this mess and to make some sense of all?"
        ],
        [
            "Well, Brian Analytics tool is not a standalone think.",
            "It is part of an entire pipeline in this case and integrated device.",
            "So it doesn't close different steps and actually steps on sort of fly through similar problems later.",
            "So first you have to understand the problem and a little issue about moral issues and then configuration.",
            "Probably with always integrative analysis is that whenever people have finances to generate data that's generated data.",
            "But the real question comes out for us.",
            "If you have a particular hypothesis or maybe a real question that you're interested in, then you start looking for an optimal design that comes in.",
            "Generated data that can give you the highest power to solve that question.",
            "In Integrax it's most of the time getting around, so we have a lot of data sources available and then it's unusable.",
            "Station solve the problem, fix the model, then it's like oh design issues.",
            "It's not that easy.",
            "It's a particular problem for the performance integration.",
            "So no, what do you want?",
            "Check how the data were collected so no more data.",
            "Now this not only refers to how it is collected and the.",
            "Underlying design, but also about data types.",
            "So is there a lot of noise in data?",
            "What is the format of the data?",
            "Do I need to transfer it to another format if I want to use a particular analytic tool?",
            "Are there issues with this transformation for the generate on its own?",
            "Additional errors?",
            "These type of things?",
            "Step three maccleanse between process, which is obviously depending on the platform.",
            "But at this point's value may know about different levels of informative ITI that these different data sources have and you might already have in mind using these different levels of information with potentially get out of each of these singular data sources as waste in the future analysis.",
            "Keep it in mind.",
            "And then we have the analytics tool itself.",
            "And last but definitely not least, further interpretation where visualization plays an important role.",
            "Now amid at all in 2009 published so something about the integrated analysis and with respect to Step 4, which is kind of also related to this step treatment explaining.",
            "That's why he says weather are kind of three stages where disintegration or an integrative analytic tool.",
            "Can be applied, it can be.",
            "It can happen very early on and that is usually involves like data Fusion, the Fusion methods so that your different legal sources, similar data types drive to increase power by merging them combining them some perhaps waited way an intermediate stage where after we are dissimilar data parks Gina Fire Prescott.",
            "Go in regional protocol however.",
            "At this stage usually info that we really have to change the interpretate, the representation of the data.",
            "So, for instance, if you have these different detour genius datatypes measured from the same set of individuals, you could think of looking at similarities between the individuals on the basis of genomic data on the basis of the triple negative amount ever.",
            "Then the scale of the dimension.",
            "Is the same as he goes by the number of individuals, and then you can take it off adding them in a way way for instance to create another similarity matrix.",
            "But this is an example of an analysis that fits into this interface.",
            "Another final warm welcome example of this is like a meta analysis that you definitely know about.",
            "This is not provide meaningful integrative analysis.",
            "Another option, say."
        ],
        [
            "Much more about it.",
            "So with respect to formulating this biological statistical problem.",
            "That isn't what you want, but I really would like to point out this reference.",
            "Can you enjoy some falls in 2006?",
            "And this is very, very nicely for our systems biology view of things.",
            "And this table which is included in their favorite TV shows that integration really allows you to get a particular systems information and you might be interested in."
        ],
        [
            "I want.",
            "With respect to the characterization of the data, it is unbelievably crucial together handled on the noise spectrum.",
            "So if we think about also using next generation sequencing data, there are still a lot to be done without, you know and deal with Patterson inconsistencies.",
            "So be aware of that might be aware of that.",
            "Try to get together to do those who generate today content and get some more information.",
            "Package the layers of information.",
            "Or are there hierarchies?",
            "Sources, yes, we heard about this.",
            "Government central government control biology, but then it's not.",
            "It's not completely accurate because we have the interference of the page.",
            "Netflix with on XO.",
            "Include some information about your environment.",
            "What about dynamics?",
            "So it's it's in my opinion, it plays the same crucial role as would be calling by sadistics and exploratory data analysis.",
            "It's very, very important for subsequent analysis and also for choosing the most appropriate analytical tool.",
            "And I also believe that waiting can be important waiting by the quality of the data, waiting by perhaps information loads that is in each data set that you have at my disposal."
        ],
        [
            "Data pre processing usually happens at initial stage and but both so right before you apply a statistical method, because you would like to check the model assumptions or goes into civil law, you would like to use and often that requires that you need to take some measures and sometimes it's not possible, in which case you have production out of ideological strategy."
        ],
        [
            "And then the interpretation notice I have skipped Step 4 because I'm going too much more about Step 4 paper.",
            "The interpretation this is really about understanding the problem in class that you started out with that first.",
            "And it usually involves in practice, coming through some kind of a function of explanation, and if we think about your examples from genomics.",
            "So if you would like to publish the results in a high rank Journal, we definitely need to support your results with experiments and experimental regulations.",
            "Functional analysis.",
            "Think of it with this, which involved in terms of an integration analysis using different forms.",
            "Later, how to set up such as parenting is really far from office.",
            "So this will be definitely different from what we know in genome wide Association analysis and there is huge challenge obviously and also visualizing the steps and results from such an integrated analysis software is in love to be done with respect to visual talent."
        ],
        [
            "No, it wasn't already refers to some extent developed before the coffee break, and I would like to point it out to you again because I think it is very important and largely.",
            "Well, not as much given the attention it really deserves so often in the interpretations will also try to closely to several biological databases, but you need to be very careful about it.",
            "What about the average?",
            "And what about the uncertainties of the entries that are those databases and reference that was made for the break will supply presentation smell.",
            "So there are some issues related with.",
            "Also, is it possible to allow to some extent for these uncertainties involved in the data source entries?",
            "Sometimes you know, especially if you're looking for interactions and synergies.",
            "Aggregated scores are being the GBM derived on the basis of several biological interaction databases, but without such a score really doesn't.",
            "It contains some public information as well.",
            "To what extent has been less one taken into account of some of these databases or complementary or actually used information that was in the other database?",
            "There are some very intriguing things today I do not have a solution to this, but I think I just wanted something now to do as a as a teaser."
        ],
        [
            "So in terms of step forward analytic tools, the integrated data analytics.",
            "Thanks for the heads up again for that, you know, like Association studies and how we really came to produce a large scale.",
            "Studies help you can adopt A code down or we can adopt above the proper plug.",
            "So either start with Canada geese pathways and then build up or start with the own.",
            "The large scale and I felt you down an integral mix because of the complexity.",
            "Most of the time it will be this direction."
        ],
        [
            "And what about analytics tools that are available that is not the idea.",
            "To give you an give here a comprehensive review of the analytic teams that exist.",
            "We tried to indicate to give an indication in the in the book chapter to some extent, but if I have to give you an idea about the type of matters, I would make this current division kernels kernel theory to bring nonlinearity into the game.",
            "Networks also because you are so easy for visualization purposes, and the example that I gave about integrating three different data sources collected from the same number of individuals and merging similarity matrices with extra with example.",
            "Add components based and performance will go from from genetic studies.",
            "Well, principal components are very heavy use, I mean not for statistical testing, but they are used to correct for populations qualification or through to account for some such structure in the data is important."
        ],
        [
            "Continue to integrate analysis.",
            "They also will qualifying offer here again I like this slide because it's again shows you.",
            "Depending on what you really would like to do, you choose the most appropriate to is in the classification.",
            "Probably registered in using the regression isn't a dress code.",
            "Discrimination from etc.",
            "And then you have all kinds of combinations and flavors."
        ],
        [
            "OK, so taking baby steps I've already.",
            "Um?",
            "Refer to G. Nevada sociation studies quite a bit.",
            "While this is something that you know that human geneticists know well these days, so in terms of integrated analysis, it is therefore not surprising that one starts with these type of analysis and try to use the other data sources to increase the power to pick up effects in your Gino Association study and you see it is also wait, I just picked three papers here.",
            "The wedding stress script on data.",
            "We use it as weights without the kind of prioritize regions in the individual far free analysis using information from real specific gene modulation you had and generalized Association study or protein interaction based even like analysis.",
            "So this is what we see more and more sparkling from something that we wrote, well, fast."
        ],
        [
            "And if we expand on this a little bit more, what would be the next increase in complexity or bourbon he started from the jewels?",
            "Well, it would be that we combine several G was from different centers from different for business studies and that is done through a meta analysis.",
            "Now computational burden is not happy because usually you do not deal with all these singular genomics studies, but maybe you already had the effect sizes and then we can move those into the model.",
            "It's a completely different story.",
            "If you would make the transition from Gina.",
            "My Association directions comes to Metagene lost and why would that be?",
            "What is the cost?",
            "Much, much more complex as well, but the underlying biological problem also becomes much more complex, so it also means that there are more ways to tackle this problem.",
            "More methods available to try to model this, which induces heterogeneity from one study to another, so to perform a meta analysis that's not so simple anymore, because method ASC this corrected game may have been used in in Belgium as statistical method.",
            "Being in France or whatever.",
            "Value that comes from one study is not the same anymore as a P value from the other side.",
            "So you need to have the original data or to come up with a very clever data.",
            "Your way to deal with this extra type of hydrogenated.",
            "And.",
            "So because we do have in the past study, you just interested in later next, now we're looking at interaction effects.",
            "So the.",
            "There are many more possible modes of inheritance.",
            "You know in every static scenario.",
            "Then in a in the main effect scenario.",
            "And this."
        ],
        [
            "Needs to this huge bundles of of methods.",
            "Possible methods to pick up these effects then because we are always aiming for this not low hanging fruit with my higher hanging fruit.",
            "And this causes some methodological challenges.",
            "So I'm taking this example because it gets more complex when we're trying to integrate different data sources.",
            "I mean, there is also much more potential information you could retrieve from those data, so the different viewpoints we need two different methods and it will be very, very hard to compare.",
            "Will be very, very important with some kind of meta analysis.",
            "So what we are all familiar with in June like.",
            "Association study scenario needs to be revised its shakeout.",
            "OK, so.",
            "So this motivates while going to boost interaction studies and problems or or issues that we were thinking about while developing a new method to pick up interactions and how it could also be relevant for an integrative analysis.",
            "And this is one of the methods that I didn't develop that I will come back to it."
        ],
        [
            "So and in this paper we try to summarize some of these practical aspects involved in genomic Association interaction analysis.",
            "And as I will show you in a bit, and I invite you all to think about some of these methodological aspects, they will be very personal.",
            "Discontented Robinson analysis as well, and I'm constantly searching for material on the left whether or not it hasn't taken into account.",
            "And the list of people that would like to write or projects.",
            "I would like to give to the students, unfortunately is just becoming bigger and bigger because there is still so much to be done."
        ],
        [
            "Computational efficiency is obviously a problem, just looking at the same data source genomic data, but just looking for more complicated structures.",
            "For instance, the interactions already cause a lot of imposes, a lot of issues with respect to computation, and I can give you."
        ],
        [
            "Example here business what we had before and definitely also this is what she had before, and that would be to get an upgrade for three years through together this number.",
            "But it also extrapolated.",
            "But people do in particular interaction fanalysis on 100,000 steps or quantitative trait sequentially different topics we do not do exactly, but it will take three years.",
            "Think about what it would apply if you're going to integrate other data you would like to have much, much more refined structures.",
            "The models will become more complex for now.",
            "So people in Group are working on ameliorating this and making it faster and faster and now for the same 100 thousands of individuals in a sequential approach at 70 hours parallel 20 minutes and still improve on that.",
            "But this is an issue and I can well.",
            "So a lot of clever people here in the in the room, but I definitely not able to.",
            "You know, to deal with all these ideas to come up with better algorithms, we need some very specialized."
        ],
        [
            "Then I come to another very important and it's.",
            "It's almost gets to a kind of philosophical stage at some point, but let's see.",
            "Do we operations on patients with subscriptions."
        ],
        [
            "So the link to the Gmail and the link to the GY and the link in the intercom, it's actually was triggered by a question that we got from the conditions solutions.",
            "We have data or Crohn's disease patients, and they wanted to know to what extent their disease specific genetic markers would be able to find subtypes of these patients.",
            "Because they detected the huge.",
            "It originated in technician, so even though the clinical history was quite compareable to totally respond within this, we only drug treatment center.",
            "So maybe you can find some evidence for this.",
            "Is a English genetics and came up with such a cross string who stated class modeling techniques.",
            "But then people were were asking whether how sure can you be that these clusters are disease specific?",
            "To what extent?",
            "Don't you see an influence from general population characteristics than before?",
            "So we checked it."
        ],
        [
            "And so that led to the to the other things are cautionary notes or populations replication, because they are indeed we saw that when you use ancestry, informative snips, and we corrected the clustering 40s ancestry, informative snips was no link, and work with the ethnic groups.",
            "We still have groups.",
            "Clusters were clearly different from before, so it matters.",
            "Where is it consequence of this?"
        ],
        [
            "First of all, if you start doing clustering, there is a fast amount of clustering techniques available.",
            "We know that they give different results because of the different underlying algorithms.",
            "So apart from the fact which closely wondering if we choose, we also sold at my new adjust or do not adjust for quite some differences and overlap between the clusters, which is indicated by a high number in this column.",
            "Is very poor, numbers are not high, not high at all.",
            "And obviously you use so that when you do an adjustment analysis so adjusted for his ancestry, informative snips, you could link the update clusters with a series of phenotypes, clinical phenotypes, but not anymore when you did not, when you did not adjust it analysis, or vice versa so.",
            "So it's all about finding a homogeneous group, and if you think about network analysis, integrated network analysis, optimal starts with maybe can cervical cancer type population.",
            "You build a network and then you investigated properties of the network meeting.",
            "We tried to find the house, not a very important regions in in the network and try to link it to.",
            "Valuable survival rates over that much.",
            "This network is based on the sample that you have.",
            "These gang situations which are quite or genius and to what extent are they maybe two intra genius or not?",
            "And how narrow should it be?",
            "A homogeneous group homogeneous cluster should probably not be driven by a statistical criterion.",
            "Here we have to make the cut off.",
            "But by something else, what is that something else, and what does it mean?",
            "An integral component in the integrated context it's already have company here in this contest where we only use.",
            "Sydney.",
            "It's unbelievably insane.",
            "I think it's, uh, it's a teaser.",
            "And so."
        ],
        [
            "Yeah, so also with respect to this.",
            "If you look at the Genome Wide Association, studies were right for this population structure.",
            "People often India through principal components, yeah.",
            "Should we do that as well?",
            "If you do transcriptome analysis, there is already evidence is that if you genetics is also able to differentiate between populations.",
            "So why would bring it into those analysis as well combining genetic markers into genetic data?",
            "And clearly this is not going to be in a linear way, right?",
            "It must be nonlinear relationships there.",
            "I mean, why wouldn't particular network be able to differenciate?",
            "Between us to be able to.",
            "Differences between populations.",
            "So there is some ongoing work where we tried to bring this moment guarantee and heading to the agency goes toward this can be, but I see very rarely an integrated study where this is kind of taken into account.",
            "Population."
        ],
        [
            "Take into account population substructure in general and what characterizes such population substructure really, not only the.",
            "But also.",
            "What is respectful mix up?"
        ],
        [
            "Well, there is this issue of course because.",
            "If you think of the example of interaction studies, we know that most of the time you're already underpowered, so in principle you could gain more power BI.",
            "Combining it with other similar studies.",
            "Now suppose that the other studies have used the same analytic tool.",
            "I don't want to bring that complexity of the game right now, but if it's a problem, right?",
            "Because if you need like, I don't know 100,000 individuals to have enough power to really see the signal that you would like to see.",
            "It's very hard to find an independent data set to Jennifer size 100,000.",
            "What's the flower you need?",
            "To make relevant conclusions when you're starting to integrate data."
        ],
        [
            "And maybe we should not just look at this type of blocks here, but we should use maybe.",
            "Some prior information.",
            "As well, and this is already, and I haven't seen it a lot into the literature, but I came across a clinical common asking in 2012 that create this PM float and kind of look at the museum, the posterior probability that any of the studies in your meta analysis had an effect.",
            "Yeah, I mean it's not going to solve the issue, but maybe we need some more than ever tools as well to perform a meta analysis wants you to have the data in the Integral Excel."
        ],
        [
            "And then.",
            "The thing is that the more data you start collecting, the harder it will be to validate model assumptions of a special parametric approach.",
            "So clearly there is group of other types of methods.",
            "Model free approaches and interesting.",
            "Although it is well known in Biostatistics, unknown parametric meta analysis methods, we're hardly used in in genomics or if you know of any trouble, please let me know.",
            "But there are hardly used and I think this might be very very interesting to include in the picture as well if we start analyzing our data and Model 3 way, well we should do that analysis as well.",
            "Assumptions.",
            "Still a lot to be done, so talking to.",
            "Pure statisticians and as I get up there, maybe we can do some of it and then talk to the implementations to speed up everything in to make efficient algorithms etc etc.",
            "There is another context.",
            "And I think it's very important because no more data collection, more likely it is that not everything is collected for folder for the same group of individuals.",
            "And I'm not talking about that.",
            "Maybe one individual may have genomatica Dino games are available and the other may have three data sources available, but I'm really talking about some particular genetic markers or features that are not being measured.",
            "So what are you going to do with it?",
            "One of the standard approaches in Genome wide Association studies is compute.",
            "Sorry for every 5 minutes Ave since there's no question about it, people are doing the little bit of coding back and that's it.",
            "Interaction studies that's using the same data but just adding this extra level of complexity, making your hypothesis your alternative hypothesis wider.",
            "So good anymore what?",
            "Why would that be a problem?",
            "So imputation in G Nevada sociation studies is based on what what type of information was?",
            "1 million struggling through huge.",
            "Yes I can.",
            "Map information yet, for instance you have nothing for may shun so, but actually it relies on lease structure on block structure.",
            "Interaction World so erection group.",
            "We know that if two steps are in Audi.",
            "So we are happy carbonated.",
            "Then it means use benefit stays the signal that made use an interruption signal depending on the message that you use, but it's not the one that you're interested in.",
            "This is what it's called in the interaction field that we done those interactions.",
            "But if you leave all of these possible pairs linked to the data, then yeah, it increases your body for testing very too much.",
            "So you need to prune back to some extent so you can include that you need to prove that and how far should you go.",
            "What's the balance between being able to use proxies in the neighborhood to pick up the signal?",
            "Or you're increasing your computational burden to happen?",
            "So how would it work in the integral?",
            "It's becoming more integration, different data sources.",
            "What is commonly done configured transcriptome analysis is just, you know, transcript.",
            "Just be rude or I don't know why it does not impute.",
            "Or maybe it's a different completely different imputation strategy.",
            "So will this have an effect on your integrative methods or not?",
            "It's something to be aware."
        ],
        [
            "Interprete."
        ],
        [
            "So how can we enhance interpretation, but usually say that try to integrate, you know, as much biological knowledge as you are able to in every possible step.",
            "But there is this warning I made in beginning of this presentation.",
            "If you start to link to the biological databases, to what extent is it reliable knowledge?",
            "You also do not want to throw away today with nothing.",
            "So it's.",
            "But for now we see in the July solution direction complex we see that it can be really beneficial, integrated to prioritize and to adopt different rules, different analytic boots.",
            "And it's not about saying that this method is better than no, but it's it's a different viewpoint and most likely one metric is able to highlight one particular type of architecture and another method, another type of architecture.",
            "So by combining all these viewpoints, you may increase your insight into the problem, and then you can perhaps be more specific point in your analysis.",
            "Is there going to be an issue?",
            "Integrate multiple only statements only going through so much more complex."
        ],
        [
            "Investigation and validation.",
            "Do you know the difference between replication and validation?",
            "Repeat just doing exactly the same.",
            "So replication would involve that you try to find a similar operation.",
            "With the same type touristics.",
            "Thanks a design inferia.",
            "Same study design will try the same analytic tool.",
            "And then you see when you come find, you find the earlier point.",
            "In practice, it doesn't work like that.",
            "He's trying to get us close to.",
            "I already mentioned safe characteristics.",
            "It's about characterizing configuration, so the issues that I mentioned with respect to patients in population characterization come in here as well.",
            "Are the features what are the criteria that I did you characterize a compilation?",
            "What is this song?"
        ],
        [
            "Validation.",
            "I know there are other definitions filter out the validation would be that you go for instance and then I'll write this tactic group and check.",
            "But what do you do with that talk too much?",
            "Because if you do not sign back to result it shouldn't worry.",
            "In the way, because it might be that there are really different mechanisms operating in the other ethnicity and the other ethnic group.",
            "And that's very likely to happen.",
            "Do more different data points you're going to use?",
            "Measurements coming from multiple magazines.",
            "Multiple data sources."
        ],
        [
            "I would like to make this quote you to the variation of you frequency and underline linkage disequilibrium segments between two datasets.",
            "It's highly unlikely that the same combination of taxes would be associated with the same statistical interaction model.",
            "Getting us back to the example of genomic Association interaction studies.",
            "So even replication in the field of generalization interaction studies using snip bells Jingle my sniffles.",
            "Thanks, Melissa.",
            "Should it be done with this next level?",
            "Usually editors ask you to replicate this place.",
            "It's probably going to be highly different and also a sniper.",
            "One study may have been included in another study.",
            "Not so it's not.",
            "It's comparing apples and oranges in a way.",
            "So."
        ],
        [
            "And this is an example of it.",
            "So this is an example of Alzheimer's disease, that PowerPoint full scope is been working off and she did an extensive review of four possible interaction signals based on Smith data that she could find with respect to Alzheimer's disease.",
            "Why some heterogeneity?",
            "Different signals.",
            "Different sample sizes.",
            "Study design.",
            "Sometimes if you both, you know well most of the time it involved a genome wide Association study and then with the signals that they got they tried to change present one signals, modifying the effect of the other symbols.",
            "Not exhaustively, but somewhere itself etc.",
            "So it's what you do with it.",
            "How you interpret and then also putting it in the context of 1 slide before.",
            "Is it?",
            "Is it really reasonable that we ask that this exact Smith care is getting the same signal across studies?",
            "Maybe not.",
            "We may need to."
        ],
        [
            "Extrapolation go to a higher level.",
            "First level that comes in mind as a genetic level, so they are.",
            "Well, sitting in jeans or preferring to cheese.",
            "Maybe they want to make happy couples or associated to visit my files, but even you know, making the extension to the genetic level is not obvious because you can link back not all science, but some said Schoology based on physical location.",
            "But maybe also based on results from equity analysis, right?",
            "So whether it affects analogies, expression, and should you gotta make it through that Sheen aren't too, e.g nearby when making these extra collections."
        ],
        [
            "So we automatically working business we we.",
            "Investigators come from and figure Smith panel at our disposal and based on this literature review, we just looked at all the jeans that were involved, so that could be linked to a Smith that occur within a significant snip, snip interaction.",
            "And we took all The Smiths that could be physically mapped to all of these jeans, and then they did exhaustive analysis.",
            "If you appropriately correct for the gene size, which is different.",
            "If you profoundly correct for the multiple testing which is now already severely reduced, nothing is there.",
            "No signal at all.",
            "Yeah.",
            "As the colors here just indicate.",
            "Marginal significance so the green one thing we want is that Gasol agreement means that it was marginal, significant, so not corrected for multiple testing, not even adjusted for the jeans size, which we should really not do.",
            "Both surface to indicate.",
            "Add stone.",
            "No.",
            "So what about replication?",
            "What about making sensibilities and members?",
            "This is something we are now seeing in the integrated analysis as well.",
            "If you have separate efforts over the world, integrating data sense more and more data is made publicly available.",
            "Aren't can now only or officially applied to get access to these data.",
            "Are you going to do afterwards without a combined effort?",
            "Will be something like this, but it's it's very different genus."
        ],
        [
            "No replication, therefore without consensus only days, another is no Holy Grail, but some methods have more desirable properties and others.",
            "And I quote from this paper here algorithms for detecting.",
            "In this case, study directions should be evaluated using simulated data for reasons of both scalability and interpretation.",
            "It's already very hard to set up and and.",
            "Kind of realistic simulation study in the context of interactions.",
            "When one of these data sources are involved, it's a real challenge.",
            "The creation of realistic structures inside today.",
            "That's problematic in the beautiful, complex nature architecture will be stays in humans, both of which are largely unknown, so not even taking into account transfer form effects.",
            "Movies simply don't rhythms, etc.",
            "So we need some wood platforms data.",
            "Ideally also will be able to compare methods and to really have a good crew or to be able to make judgments about what is every analytic able to discover.",
            "What is it targeting?",
            "Came the genome in the arms?",
            "What can it reveal?",
            "What can it highlight?",
            "Usually they are used in this all makes.",
            "So how can Alesis as sweeping over the Geno?",
            "They make some inherent assumptions about proper hypothesis that you can really reach with them, but these hypothesis are not relevant all over the place all over the genome.",
            "So for some parts it will work really well for other parts in front.",
            "Works well, but to really get a grip on you know what works best in which scenario.",
            "That is very kind.",
            "Every person I've collected visualizes interruptions.",
            "Please again, we develop severe, nothing.",
            "Sorry we have done it as well.",
            "Step up simulation, study check was infected so they'll be different static models, etc.",
            "But it varies from one study to another, so it makes it very, very hard to make real comparisons because the nature of the simulation study was redundant.",
            "So we're kind of lobbying groups in comics from from American.",
            "Actually, it's it's initiated by by the edge group spaces infection.",
            "Which method technology to trying to get some good realistic recommendation not to kind of promote or whatever you may think Indian direction analysis.",
            "You develop also applied on those data you know because then we have this kind of benchmark and weaker immune rating.",
            "Netflix take the best of several worlds and.",
            "Develop something new.",
            "You're not even thinking about that, and you'll make sense you created for this."
        ],
        [
            "So no replication without a consensus about methodology.",
            "The more complex the problem you would like to solve becomes, the more different ways you can detect this problem.",
            "And therefore it's much more difficult to not to combine.",
            "Results can be analogous.",
            "They may.",
            "Different Rainbow Disgusting is handled.",
            "In the way you know features were selected for the analysis.",
            "Anyway, it was taken into account to ignore the candy or let me generalize it to general comics correlations between features.",
            "Do I allow them or not?",
            "And what is my name?",
            "What is my cutter?",
            "In a very simple regression analysis, if you put in variables in a regression model and you're highly correlated with something which is called multicollinearity, it's it's a feature of the data.",
            "So collected data may not appear.",
            "That movie called linearity.",
            "May not be hard harmful, but it may be harmful when it because it means that when you would leave out one of these variables, the effect sizes may change significantly.",
            "Change setting.",
            "Importance of.",
            "Relationships not only in the context of people spaces, but I feel they will become much more important than their starting to integrate into components, and in that sense, and not only looking at the different layers and relationships with between these layers, like maybe quitting out analysis which most often involves 1 snap waiting to one friend script at certain.",
            "Do that multiple times but also take into account and this entire.",
            "Structured or D interactions.",
            "You know, the gene expression network information.",
            "Bring it, bring it all into one another.",
            "So within and between architectures, and improving that into the model.",
            "And last but not least, the missing data handling in here.",
            "There may be room for something which is sold in in class statistics.",
            "Of course in process, so coarsening refers to the situation where we do have a measurement, but on a much broader scale it's not as fine as you would have liked it to be.",
            "So if you think you have a very easy example in, if you do much and impeding knology or clinical settings.",
            "You may have.",
            "You know the exact measurements on correct high cholesterol.",
            "So on cholesterol levels or you may have.",
            "An assessment on high or low, high or low.",
            "This is on a much rougher scale, but because you have different skillsets, refers to the same overnight counts, but there are methods available to deal with this with these differences so that you can include all information into your.",
            "I do not see the girl course.",
            "Meaning if you're not in an animatronic for now, but I think there is improvement."
        ],
        [
            "No, no I think well.",
            "Be able to replicate.",
            "So is this going to be a bad thing about?",
            "Positive note.",
            "Starting from the jewels.",
            "Failure to replicate a genetic Association.",
            "Not that bad because it's made to apply that important people about genetic architecture.",
            "It's maybe because we were just only looking at a very narrow alternative, right?",
            "We ignore it.",
            "The interactions, perhaps in that particular study, and because of the fact that we ignore this more complex structure.",
            "This is why you could not replicate.",
            "So extrapolate this to the context of integrated analysis.",
            "More complex structures."
        ],
        [
            "So combining it's oh Gino."
        ],
        [
            "VR um?",
            "Shall I say something about it very briefly?",
            "So The thing is that this is a method that was primarily developed to detect interactions sitting in directions.",
            "Get ready for the pending require orders as well, but the idea is that in a natural way, if you use Gmail type information, individuals can be.",
            "Wired or categorized in one of these nights sells refering to the possible two locus genotype combinations that you have has to decide.",
            "So every low self refers to snip snip tool use.",
            "Here's why.",
            "School maximum three genotypes.",
            "So these are the three columns and three rows at each in the matrix and every individual for which you have collected data on.",
            "We'll sit in one of these nine cells if there is information investment.",
            "So the idea of such an algorithm is that you kind of prioritize or did not prioritize.",
            "You kind of you want to label these movie local cells with respect to that rate of interest.",
            "I mean, is this combination more likely to give rise to a disease individual as opposed to a cultural or more likely to give the right school higher survival rate as opposed to an old survival etc.",
            "And then there are some.",
            "Assessed using Association faces.",
            "Statistical Association tests.",
            "And then it is followed by a reduction method where all similar cells are being pulled.",
            "So these are similar and these are similar with respect to risk or survival rate for what everybody would like this and a final Association test is being used so it isn't method and Assoc modeling method to pick up interactions.",
            "And obviously you need to correct for this data snooping and significance.",
            "Significant assessments need to be done in.",
            "Indian the correct weight as well as a correction for multiple testing, but this is taken care of now where I would like to go in."
        ],
        [
            "So this is what I just explained.",
            "Every individual belongs to one of these cells and sometimes, especially if this is according populated cells or the small A and small beat, the view frequencies are very, very small.",
            "It might be that you do not have any individuals sitting in that cell in your sample.",
            "Now, why don't you make the X population and instead of looking at Snips, look at the we.",
            "A region of the gene I think over G. And to a gene you can make different data sources and you can add CNBC snaps you can add if genetic markers left, leaving alone how to do the mapping, which is not easy.",
            "But then suppose you can map it.",
            "Then you could say well, instead of this natural organization of individuals into these cells, I can now impose a clustering algorithm on to these features map through my 1G, and this will give me some clusters.",
            "These are the customers.",
            "So from 1 gene to another G this may change.",
            "Do you want maybe to make someone plus or minus two another five or you won't have empty cells here because it's enclosed by the clustering algorithm will always have people sitting across from it.",
            "And this is a good starting point, because actually you can then apply the advantage of apology, compare oneself versus the other, try to label with, etc.",
            "Although this is now in one dimension and not know where directions for people.",
            "Think of it as generalizing to identify gene gene interactions, avoiding the problem that you need to extrapolate based on snip snip sequence."
        ],
        [
            "Now this means that it involves.",
            "Selecting your features.",
            "How am I going to select?",
            "This is very, very important.",
            "And also the classroom powder.",
            "And the reason why I wanted to show this is not true that you give you all details about soda method, but just to show that this is a part of someone's work that whenever she used or as soon as she started using kernel PCA, so bring them all linearity aspect into the game.",
            "Then the results started to be really really promising only then.",
            "And this was an extra motivation for us that yes, we have to.",
            "Have to bring more complexity into into our modeling.",
            "And you may ask yourself, haven't toward if you compare with other performance.",
            "So this was applied to sequencing data.",
            "Next generation sequencing data, where you typically have common and rare variants.",
            "So here the common and aware variants were mapped to a gene and roared of Queens, available for Red Barons analysis.",
            "So this was compared to recognize siblings.",
            "But it can be used to mix integrated purposes tonight teacher.",
            "And I hope."
        ],
        [
            "Made it."
        ],
        [
            "We're done.",
            "Hello.",
            "In the title equals Integral Mix general integrative analysis.",
            "I've made it clear that looking back at the Gevalia sociation direction studies is really learned a lot.",
            "You know about how to move on to develop no more elaborate methods in the context of integrated planning, data analysis efforts, and there's a reason why I left the other flight plans.",
            "We need to think about patients.",
            "Characterization population characterizations apiece.",
            "Right now it needs to be integrated.",
            "Canals is legs ample here.",
            "Example is the genomic end of your initial development collection, but you can actually also use it as a."
        ],
        [
            "And actually, you can also link it to to the networks, not one of the other accrued divisions in the integro mix analysis, because there is something called statistical interaction networks.",
            "So where the definition of the edge already incorporates information about that rate because two genes are connected in such a network, whenever one is modifying the effects on that rate of interest.",
            "Whereas usually if you take.",
            "Classical network approach is maybe a network may be developed in the cancer population in healthy population and the network properties are being compared."
        ],
        [
            "So I would like to leave some room for questions as well, so we conclusion the Steelers of challenges in greeted me overcome.",
            "I haven't even talked about protocol with elements in the context of integrated analysis and not at all experts in that I give it to other people can be very very good quarter for standardizing data generation pre processing and fluency.",
            "Development of computationally efficient analytic tools to extract and knowledge from this similar data.",
            "Fights with different questions in mind and establishment of validation replication procedures where we need to rethink the definition of replication in the complex no longer interactions with certain.",
            "Also integro mix and also validation.",
            "How are we going to validate the results?",
            "So I hope I've showed you that for example, my Gmail is gonna be very instrumental.",
            "Prefer to think about how communication this week."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I have to say that after the break is strong and so although he will be excited because it's like all this card in reference, I never really thought about it.",
                    "label": 0
                },
                {
                    "sent": "Then how could I kind of integrate what you were talking about before the break with what I'm going to talk about right now.",
                    "label": 0
                },
                {
                    "sent": "So we'll see how it works out but.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anyway, I tried to compare some slides together to give you some kind of an idea.",
                    "label": 0
                },
                {
                    "sent": "What are the potential pitfalls or what we should really take into account when we start integrating different OMICS datasets.",
                    "label": 0
                },
                {
                    "sent": "Or maybe more generally moment.",
                    "label": 0
                },
                {
                    "sent": "We also acknowledged normalized data clinical.",
                    "label": 0
                },
                {
                    "sent": "Anyone coming to the data integration?",
                    "label": 0
                },
                {
                    "sent": "And I'm going to provide you a toy example to show these with some of these issues that we will be dealing with.",
                    "label": 1
                },
                {
                    "sent": "And for example there will be updating from my backyard from others.",
                    "label": 0
                },
                {
                    "sent": "Genomic Association interaction studies and obviously our first motivate while take them tight sample and it does vary greatly depending on the direction or time permitting.",
                    "label": 0
                },
                {
                    "sent": "Well just briefly mention novel intercollegiate analysis.",
                    "label": 0
                },
                {
                    "sent": "Frameworks and you know, trying to vindicate you too will extend.",
                    "label": 0
                },
                {
                    "sent": "This can help us in general into growing cycle analysis.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is a team, so everything that I'm going to talk about is really attributed to all of these people who.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "By that ideas and there are currently thinking about this.",
                    "label": 0
                },
                {
                    "sent": "I should also mention that one of my creations isn't assistant.",
                    "label": 0
                },
                {
                    "sent": "The GL and more in particular mathematical research unit for systems biology and chemical biology, because some of you might wonder why she talking about him to grow mix.",
                    "label": 1
                },
                {
                    "sent": "We mourn over about publications on interaction studies, where as you may know, exposure makes a big difference.",
                    "label": 0
                },
                {
                    "sent": "Now if you're exposed to a lot of data for a lot of ideas, if you have data available.",
                    "label": 0
                },
                {
                    "sent": "Start thinking about how you can analyze these data and metrics.",
                    "label": 0
                },
                {
                    "sent": "Development is the logical next.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So integro mix.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, if you Google for into grommets and if you are doing it right now, hope you will have the same results as I had.",
                    "label": 0
                },
                {
                    "sent": "You first hit.",
                    "label": 0
                },
                {
                    "sent": "Maybe you know commercial companies or software packages and this is quite amazing because usually you first are directed to another Wikipedia page, something like that.",
                    "label": 0
                },
                {
                    "sent": "So it means that this term is not included in classical libraries or whatever.",
                    "label": 0
                },
                {
                    "sent": "And if you look at this particular location and refers to an R package in the Bronx, and you read through the paper, then you see keyboards like joints analysis, value general, right?",
                    "label": 0
                },
                {
                    "sent": "Challenging statistics is that we know it will be challenging, but then turns like regularised, dealing with sparse data, and a lot of missing data points were all data are available for all the individuals in the sample.",
                    "label": 0
                },
                {
                    "sent": "Generalize because we're dealing with variables magical, different skills, different measurement types, and this is kind of already pointing out into a Sir.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Direction, but actually the term integration often appears in definitions for data Fusion and some light conditions, or engineers of our new.",
                    "label": 1
                },
                {
                    "sent": "They are perhaps more familiar with the term data Fusion, and although one is using definition of the other.",
                    "label": 0
                },
                {
                    "sent": "Don't exactly the same, and I particularly like this paper of oxygen for some, who in 2010.",
                    "label": 0
                },
                {
                    "sent": "Four computers that Fusion can be defined as some kind of a process of optimally mapping several objects into a single object, but integration goes much further.",
                    "label": 1
                },
                {
                    "sent": "It is really about connecting systems, finding into relationships, you know, interface into a larger system.",
                    "label": 0
                },
                {
                    "sent": "This is still fake, right?",
                    "label": 0
                },
                {
                    "sent": "But if you read through that paper you will find also a framework you know to put it in a more mathematical context and.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's the next slide can further elucidate on Rd I will see as true challenges of integrated analysis.",
                    "label": 0
                },
                {
                    "sent": "Truly integrated analysis and that is that whatever analysis you do well, we needed particulare an environment to be able to do this.",
                    "label": 0
                },
                {
                    "sent": "And I'm not talking about architectural environments, which obviously part also implemented.",
                    "label": 0
                },
                {
                    "sent": "But is it more likely to be successful in the intercom and innovative disciplinary, interdisciplinary, or transdisciplinary research environment?",
                    "label": 1
                },
                {
                    "sent": "And just briefly, what do I mean by that?",
                    "label": 0
                },
                {
                    "sent": "Move to disciplinary just means that an initial problem is divided in some subproblems, and there is very limited, really.",
                    "label": 0
                },
                {
                    "sent": "Integration or combination are going off.",
                    "label": 0
                },
                {
                    "sent": "And the interdisciplinary already goes one step further, so we tried to adopt discipline, specific perspectives, viewpoints, and you have a joint effort to solve this common problem.",
                    "label": 1
                },
                {
                    "sent": "I think if you really need to go one step further, what is sometimes referred to as transdisciplinary approaches, because we really need is active synergy between the disciplines to create solutions to the problem that you would otherwise never completely solve, leaving alone that we will ever, probably will ever be able to solve the problem that we really want to solve.",
                    "label": 1
                },
                {
                    "sent": "But interesting before the transdisciplinary approach and actually already also for an interdisciplinary efforts.",
                    "label": 0
                },
                {
                    "sent": "We need to establish a common language and I experienced this in my daily life.",
                    "label": 0
                },
                {
                    "sent": "You know you have so many different viewpoints.",
                    "label": 0
                },
                {
                    "sent": "Data sources come from different communities.",
                    "label": 0
                },
                {
                    "sent": "When you start integrating data and we need to try to discover the common language and I'm sure it will happen.",
                    "label": 0
                },
                {
                    "sent": "This hour coming to ours as well, but if you do not understand something, please raise your hand if you want.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Agent so do we have a multi ton motivation to integrate data movie?",
                    "label": 0
                },
                {
                    "sent": "Nation because it is well established at the application of force, all predicted variables and mechanisms for diseases or sociative traits is very complex.",
                    "label": 0
                },
                {
                    "sent": "It's characterized by complex networks of molecular phenotypes.",
                    "label": 0
                },
                {
                    "sent": "This gives us the motivation.",
                    "label": 0
                },
                {
                    "sent": "And what about your opportunity?",
                    "label": 0
                },
                {
                    "sent": "Yes, we have an increasing number of technologies becoming available for data generation and our computer.",
                    "label": 0
                },
                {
                    "sent": "Facilities also get get approved, so these two things are very important of course to before we can start addressing some specific questions and now, and that's not our next move would be a good motion arrangement, same data and trying to see how many friends.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to continue on that seat, for do we observe, while we observe that the Super regulator generation, all these technologies and increasing computer facilities involved is kind of counter weighted by this extremely slow pace of data, integrative methods development, it can't keep up with the data.",
                    "label": 0
                },
                {
                    "sent": "That comes to our call to our guests.",
                    "label": 0
                },
                {
                    "sent": "And the second thing is that most currently available integration analytic methods they involve like pairing tool on example.",
                    "label": 1
                },
                {
                    "sent": "Think about EPL analysis now so it's linking genomic data through transmit open.",
                    "label": 0
                },
                {
                    "sent": "And So what happens more and more often is that, for instance, you do have these three sources of material types available.",
                    "label": 0
                },
                {
                    "sent": "And notably, Transcriptome is one data source.",
                    "label": 0
                },
                {
                    "sent": "But we know that from differences in publications etc.",
                    "label": 0
                },
                {
                    "sent": "So this is an extra complexity but will not be identical.",
                    "label": 0
                },
                {
                    "sent": "Nations entertainer would like to link it with the phenotype of interest or removing this year as well as collections of phenotypes.",
                    "label": 1
                },
                {
                    "sent": "You would like to link it to maybe gene expression and want issue that you have with you that special other fishing.",
                    "label": 0
                },
                {
                    "sent": "And likewise we would like to link the expression data to your phenotype data again.",
                    "label": 0
                },
                {
                    "sent": "What people do very naively said it's much more complex than that, but basically it's look for everything on the table.",
                    "label": 0
                },
                {
                    "sent": "I tried to see you know, to to try to better comprehend if you compromise with you.",
                    "label": 0
                },
                {
                    "sent": "I would really like to move to include a situation where we can integrate it in the analytic model or initiator sources, so where this is more an example of this movie, Mr interdisciplinary forgetting.",
                    "label": 0
                },
                {
                    "sent": "I'm really trying to incorporate all these relationships into.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Everyone is welcome.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This model.",
                    "label": 0
                },
                {
                    "sent": "So we know that a lot of limited number of initiatives on this truly integrated.",
                    "label": 1
                },
                {
                    "sent": "Roach and what could be a reason for that, but maybe because there is or something prior laptop is out of the box thinking so you go outside your comfort zone to really reach out to another community and to make an effort to understand the work they are doing.",
                    "label": 0
                },
                {
                    "sent": "You can't know everything.",
                    "label": 0
                },
                {
                    "sent": "Overall feels that loan another field but at least try to read each other somewhere.",
                    "label": 0
                },
                {
                    "sent": "How with and to extract information from the other community that might be relevant for Blue Star developin the models.",
                    "label": 0
                },
                {
                    "sent": "So in that way it is also essential to really understand the underlying assumptions of the analytic methods that you are using an integrated data, because obviously we've already version.",
                    "label": 1
                },
                {
                    "sent": "So garbage in garbage out with respect to data.",
                    "label": 0
                },
                {
                    "sent": "But also if you apply a method and the normal assumption is not valid.",
                    "label": 0
                },
                {
                    "sent": "While you can tell anything about it afterwards and it just doesn't make sense, and it can work actually in a negative way.",
                    "label": 0
                },
                {
                    "sent": "Because things are getting published and there are negative results or it's not that successful.",
                    "label": 0
                },
                {
                    "sent": "People might abandon application of massive, but maybe the method on its own, you know, intrinsically, my view.",
                    "label": 0
                },
                {
                    "sent": "Very good method, but just it was not applied in most appropriately.",
                    "label": 0
                },
                {
                    "sent": "This is another problem.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now some of these things about motivation and opportunities and a little bit more elaborate, reflecting to book chapter for Big Data Analytics invite Fanatics and Healthcare.",
                    "label": 0
                },
                {
                    "sent": "So if you would like to learn more about it except it's not yet published, sending emails without consent.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do we have babies?",
                    "label": 0
                },
                {
                    "sent": "Do we have the means to get out of this mess and to make some sense of all?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, Brian Analytics tool is not a standalone think.",
                    "label": 0
                },
                {
                    "sent": "It is part of an entire pipeline in this case and integrated device.",
                    "label": 0
                },
                {
                    "sent": "So it doesn't close different steps and actually steps on sort of fly through similar problems later.",
                    "label": 0
                },
                {
                    "sent": "So first you have to understand the problem and a little issue about moral issues and then configuration.",
                    "label": 0
                },
                {
                    "sent": "Probably with always integrative analysis is that whenever people have finances to generate data that's generated data.",
                    "label": 0
                },
                {
                    "sent": "But the real question comes out for us.",
                    "label": 0
                },
                {
                    "sent": "If you have a particular hypothesis or maybe a real question that you're interested in, then you start looking for an optimal design that comes in.",
                    "label": 0
                },
                {
                    "sent": "Generated data that can give you the highest power to solve that question.",
                    "label": 0
                },
                {
                    "sent": "In Integrax it's most of the time getting around, so we have a lot of data sources available and then it's unusable.",
                    "label": 0
                },
                {
                    "sent": "Station solve the problem, fix the model, then it's like oh design issues.",
                    "label": 0
                },
                {
                    "sent": "It's not that easy.",
                    "label": 0
                },
                {
                    "sent": "It's a particular problem for the performance integration.",
                    "label": 0
                },
                {
                    "sent": "So no, what do you want?",
                    "label": 0
                },
                {
                    "sent": "Check how the data were collected so no more data.",
                    "label": 0
                },
                {
                    "sent": "Now this not only refers to how it is collected and the.",
                    "label": 0
                },
                {
                    "sent": "Underlying design, but also about data types.",
                    "label": 0
                },
                {
                    "sent": "So is there a lot of noise in data?",
                    "label": 0
                },
                {
                    "sent": "What is the format of the data?",
                    "label": 0
                },
                {
                    "sent": "Do I need to transfer it to another format if I want to use a particular analytic tool?",
                    "label": 0
                },
                {
                    "sent": "Are there issues with this transformation for the generate on its own?",
                    "label": 0
                },
                {
                    "sent": "Additional errors?",
                    "label": 0
                },
                {
                    "sent": "These type of things?",
                    "label": 0
                },
                {
                    "sent": "Step three maccleanse between process, which is obviously depending on the platform.",
                    "label": 0
                },
                {
                    "sent": "But at this point's value may know about different levels of informative ITI that these different data sources have and you might already have in mind using these different levels of information with potentially get out of each of these singular data sources as waste in the future analysis.",
                    "label": 0
                },
                {
                    "sent": "Keep it in mind.",
                    "label": 0
                },
                {
                    "sent": "And then we have the analytics tool itself.",
                    "label": 0
                },
                {
                    "sent": "And last but definitely not least, further interpretation where visualization plays an important role.",
                    "label": 0
                },
                {
                    "sent": "Now amid at all in 2009 published so something about the integrated analysis and with respect to Step 4, which is kind of also related to this step treatment explaining.",
                    "label": 0
                },
                {
                    "sent": "That's why he says weather are kind of three stages where disintegration or an integrative analytic tool.",
                    "label": 0
                },
                {
                    "sent": "Can be applied, it can be.",
                    "label": 0
                },
                {
                    "sent": "It can happen very early on and that is usually involves like data Fusion, the Fusion methods so that your different legal sources, similar data types drive to increase power by merging them combining them some perhaps waited way an intermediate stage where after we are dissimilar data parks Gina Fire Prescott.",
                    "label": 0
                },
                {
                    "sent": "Go in regional protocol however.",
                    "label": 0
                },
                {
                    "sent": "At this stage usually info that we really have to change the interpretate, the representation of the data.",
                    "label": 0
                },
                {
                    "sent": "So, for instance, if you have these different detour genius datatypes measured from the same set of individuals, you could think of looking at similarities between the individuals on the basis of genomic data on the basis of the triple negative amount ever.",
                    "label": 0
                },
                {
                    "sent": "Then the scale of the dimension.",
                    "label": 0
                },
                {
                    "sent": "Is the same as he goes by the number of individuals, and then you can take it off adding them in a way way for instance to create another similarity matrix.",
                    "label": 0
                },
                {
                    "sent": "But this is an example of an analysis that fits into this interface.",
                    "label": 0
                },
                {
                    "sent": "Another final warm welcome example of this is like a meta analysis that you definitely know about.",
                    "label": 0
                },
                {
                    "sent": "This is not provide meaningful integrative analysis.",
                    "label": 0
                },
                {
                    "sent": "Another option, say.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Much more about it.",
                    "label": 0
                },
                {
                    "sent": "So with respect to formulating this biological statistical problem.",
                    "label": 1
                },
                {
                    "sent": "That isn't what you want, but I really would like to point out this reference.",
                    "label": 0
                },
                {
                    "sent": "Can you enjoy some falls in 2006?",
                    "label": 0
                },
                {
                    "sent": "And this is very, very nicely for our systems biology view of things.",
                    "label": 0
                },
                {
                    "sent": "And this table which is included in their favorite TV shows that integration really allows you to get a particular systems information and you might be interested in.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I want.",
                    "label": 0
                },
                {
                    "sent": "With respect to the characterization of the data, it is unbelievably crucial together handled on the noise spectrum.",
                    "label": 1
                },
                {
                    "sent": "So if we think about also using next generation sequencing data, there are still a lot to be done without, you know and deal with Patterson inconsistencies.",
                    "label": 0
                },
                {
                    "sent": "So be aware of that might be aware of that.",
                    "label": 0
                },
                {
                    "sent": "Try to get together to do those who generate today content and get some more information.",
                    "label": 0
                },
                {
                    "sent": "Package the layers of information.",
                    "label": 1
                },
                {
                    "sent": "Or are there hierarchies?",
                    "label": 0
                },
                {
                    "sent": "Sources, yes, we heard about this.",
                    "label": 0
                },
                {
                    "sent": "Government central government control biology, but then it's not.",
                    "label": 0
                },
                {
                    "sent": "It's not completely accurate because we have the interference of the page.",
                    "label": 0
                },
                {
                    "sent": "Netflix with on XO.",
                    "label": 0
                },
                {
                    "sent": "Include some information about your environment.",
                    "label": 1
                },
                {
                    "sent": "What about dynamics?",
                    "label": 0
                },
                {
                    "sent": "So it's it's in my opinion, it plays the same crucial role as would be calling by sadistics and exploratory data analysis.",
                    "label": 0
                },
                {
                    "sent": "It's very, very important for subsequent analysis and also for choosing the most appropriate analytical tool.",
                    "label": 0
                },
                {
                    "sent": "And I also believe that waiting can be important waiting by the quality of the data, waiting by perhaps information loads that is in each data set that you have at my disposal.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Data pre processing usually happens at initial stage and but both so right before you apply a statistical method, because you would like to check the model assumptions or goes into civil law, you would like to use and often that requires that you need to take some measures and sometimes it's not possible, in which case you have production out of ideological strategy.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then the interpretation notice I have skipped Step 4 because I'm going too much more about Step 4 paper.",
                    "label": 0
                },
                {
                    "sent": "The interpretation this is really about understanding the problem in class that you started out with that first.",
                    "label": 1
                },
                {
                    "sent": "And it usually involves in practice, coming through some kind of a function of explanation, and if we think about your examples from genomics.",
                    "label": 0
                },
                {
                    "sent": "So if you would like to publish the results in a high rank Journal, we definitely need to support your results with experiments and experimental regulations.",
                    "label": 0
                },
                {
                    "sent": "Functional analysis.",
                    "label": 0
                },
                {
                    "sent": "Think of it with this, which involved in terms of an integration analysis using different forms.",
                    "label": 0
                },
                {
                    "sent": "Later, how to set up such as parenting is really far from office.",
                    "label": 0
                },
                {
                    "sent": "So this will be definitely different from what we know in genome wide Association analysis and there is huge challenge obviously and also visualizing the steps and results from such an integrated analysis software is in love to be done with respect to visual talent.",
                    "label": 1
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No, it wasn't already refers to some extent developed before the coffee break, and I would like to point it out to you again because I think it is very important and largely.",
                    "label": 0
                },
                {
                    "sent": "Well, not as much given the attention it really deserves so often in the interpretations will also try to closely to several biological databases, but you need to be very careful about it.",
                    "label": 0
                },
                {
                    "sent": "What about the average?",
                    "label": 0
                },
                {
                    "sent": "And what about the uncertainties of the entries that are those databases and reference that was made for the break will supply presentation smell.",
                    "label": 0
                },
                {
                    "sent": "So there are some issues related with.",
                    "label": 0
                },
                {
                    "sent": "Also, is it possible to allow to some extent for these uncertainties involved in the data source entries?",
                    "label": 1
                },
                {
                    "sent": "Sometimes you know, especially if you're looking for interactions and synergies.",
                    "label": 0
                },
                {
                    "sent": "Aggregated scores are being the GBM derived on the basis of several biological interaction databases, but without such a score really doesn't.",
                    "label": 0
                },
                {
                    "sent": "It contains some public information as well.",
                    "label": 0
                },
                {
                    "sent": "To what extent has been less one taken into account of some of these databases or complementary or actually used information that was in the other database?",
                    "label": 0
                },
                {
                    "sent": "There are some very intriguing things today I do not have a solution to this, but I think I just wanted something now to do as a as a teaser.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in terms of step forward analytic tools, the integrated data analytics.",
                    "label": 0
                },
                {
                    "sent": "Thanks for the heads up again for that, you know, like Association studies and how we really came to produce a large scale.",
                    "label": 0
                },
                {
                    "sent": "Studies help you can adopt A code down or we can adopt above the proper plug.",
                    "label": 0
                },
                {
                    "sent": "So either start with Canada geese pathways and then build up or start with the own.",
                    "label": 1
                },
                {
                    "sent": "The large scale and I felt you down an integral mix because of the complexity.",
                    "label": 0
                },
                {
                    "sent": "Most of the time it will be this direction.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what about analytics tools that are available that is not the idea.",
                    "label": 0
                },
                {
                    "sent": "To give you an give here a comprehensive review of the analytic teams that exist.",
                    "label": 0
                },
                {
                    "sent": "We tried to indicate to give an indication in the in the book chapter to some extent, but if I have to give you an idea about the type of matters, I would make this current division kernels kernel theory to bring nonlinearity into the game.",
                    "label": 0
                },
                {
                    "sent": "Networks also because you are so easy for visualization purposes, and the example that I gave about integrating three different data sources collected from the same number of individuals and merging similarity matrices with extra with example.",
                    "label": 0
                },
                {
                    "sent": "Add components based and performance will go from from genetic studies.",
                    "label": 0
                },
                {
                    "sent": "Well, principal components are very heavy use, I mean not for statistical testing, but they are used to correct for populations qualification or through to account for some such structure in the data is important.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Continue to integrate analysis.",
                    "label": 0
                },
                {
                    "sent": "They also will qualifying offer here again I like this slide because it's again shows you.",
                    "label": 0
                },
                {
                    "sent": "Depending on what you really would like to do, you choose the most appropriate to is in the classification.",
                    "label": 1
                },
                {
                    "sent": "Probably registered in using the regression isn't a dress code.",
                    "label": 0
                },
                {
                    "sent": "Discrimination from etc.",
                    "label": 0
                },
                {
                    "sent": "And then you have all kinds of combinations and flavors.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so taking baby steps I've already.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Refer to G. Nevada sociation studies quite a bit.",
                    "label": 0
                },
                {
                    "sent": "While this is something that you know that human geneticists know well these days, so in terms of integrated analysis, it is therefore not surprising that one starts with these type of analysis and try to use the other data sources to increase the power to pick up effects in your Gino Association study and you see it is also wait, I just picked three papers here.",
                    "label": 0
                },
                {
                    "sent": "The wedding stress script on data.",
                    "label": 0
                },
                {
                    "sent": "We use it as weights without the kind of prioritize regions in the individual far free analysis using information from real specific gene modulation you had and generalized Association study or protein interaction based even like analysis.",
                    "label": 0
                },
                {
                    "sent": "So this is what we see more and more sparkling from something that we wrote, well, fast.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And if we expand on this a little bit more, what would be the next increase in complexity or bourbon he started from the jewels?",
                    "label": 0
                },
                {
                    "sent": "Well, it would be that we combine several G was from different centers from different for business studies and that is done through a meta analysis.",
                    "label": 0
                },
                {
                    "sent": "Now computational burden is not happy because usually you do not deal with all these singular genomics studies, but maybe you already had the effect sizes and then we can move those into the model.",
                    "label": 0
                },
                {
                    "sent": "It's a completely different story.",
                    "label": 0
                },
                {
                    "sent": "If you would make the transition from Gina.",
                    "label": 0
                },
                {
                    "sent": "My Association directions comes to Metagene lost and why would that be?",
                    "label": 0
                },
                {
                    "sent": "What is the cost?",
                    "label": 0
                },
                {
                    "sent": "Much, much more complex as well, but the underlying biological problem also becomes much more complex, so it also means that there are more ways to tackle this problem.",
                    "label": 0
                },
                {
                    "sent": "More methods available to try to model this, which induces heterogeneity from one study to another, so to perform a meta analysis that's not so simple anymore, because method ASC this corrected game may have been used in in Belgium as statistical method.",
                    "label": 0
                },
                {
                    "sent": "Being in France or whatever.",
                    "label": 0
                },
                {
                    "sent": "Value that comes from one study is not the same anymore as a P value from the other side.",
                    "label": 0
                },
                {
                    "sent": "So you need to have the original data or to come up with a very clever data.",
                    "label": 0
                },
                {
                    "sent": "Your way to deal with this extra type of hydrogenated.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "So because we do have in the past study, you just interested in later next, now we're looking at interaction effects.",
                    "label": 0
                },
                {
                    "sent": "So the.",
                    "label": 0
                },
                {
                    "sent": "There are many more possible modes of inheritance.",
                    "label": 0
                },
                {
                    "sent": "You know in every static scenario.",
                    "label": 0
                },
                {
                    "sent": "Then in a in the main effect scenario.",
                    "label": 0
                },
                {
                    "sent": "And this.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Needs to this huge bundles of of methods.",
                    "label": 0
                },
                {
                    "sent": "Possible methods to pick up these effects then because we are always aiming for this not low hanging fruit with my higher hanging fruit.",
                    "label": 0
                },
                {
                    "sent": "And this causes some methodological challenges.",
                    "label": 0
                },
                {
                    "sent": "So I'm taking this example because it gets more complex when we're trying to integrate different data sources.",
                    "label": 0
                },
                {
                    "sent": "I mean, there is also much more potential information you could retrieve from those data, so the different viewpoints we need two different methods and it will be very, very hard to compare.",
                    "label": 0
                },
                {
                    "sent": "Will be very, very important with some kind of meta analysis.",
                    "label": 0
                },
                {
                    "sent": "So what we are all familiar with in June like.",
                    "label": 0
                },
                {
                    "sent": "Association study scenario needs to be revised its shakeout.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "So this motivates while going to boost interaction studies and problems or or issues that we were thinking about while developing a new method to pick up interactions and how it could also be relevant for an integrative analysis.",
                    "label": 0
                },
                {
                    "sent": "And this is one of the methods that I didn't develop that I will come back to it.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So and in this paper we try to summarize some of these practical aspects involved in genomic Association interaction analysis.",
                    "label": 0
                },
                {
                    "sent": "And as I will show you in a bit, and I invite you all to think about some of these methodological aspects, they will be very personal.",
                    "label": 0
                },
                {
                    "sent": "Discontented Robinson analysis as well, and I'm constantly searching for material on the left whether or not it hasn't taken into account.",
                    "label": 0
                },
                {
                    "sent": "And the list of people that would like to write or projects.",
                    "label": 0
                },
                {
                    "sent": "I would like to give to the students, unfortunately is just becoming bigger and bigger because there is still so much to be done.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Computational efficiency is obviously a problem, just looking at the same data source genomic data, but just looking for more complicated structures.",
                    "label": 0
                },
                {
                    "sent": "For instance, the interactions already cause a lot of imposes, a lot of issues with respect to computation, and I can give you.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Example here business what we had before and definitely also this is what she had before, and that would be to get an upgrade for three years through together this number.",
                    "label": 0
                },
                {
                    "sent": "But it also extrapolated.",
                    "label": 0
                },
                {
                    "sent": "But people do in particular interaction fanalysis on 100,000 steps or quantitative trait sequentially different topics we do not do exactly, but it will take three years.",
                    "label": 0
                },
                {
                    "sent": "Think about what it would apply if you're going to integrate other data you would like to have much, much more refined structures.",
                    "label": 0
                },
                {
                    "sent": "The models will become more complex for now.",
                    "label": 0
                },
                {
                    "sent": "So people in Group are working on ameliorating this and making it faster and faster and now for the same 100 thousands of individuals in a sequential approach at 70 hours parallel 20 minutes and still improve on that.",
                    "label": 0
                },
                {
                    "sent": "But this is an issue and I can well.",
                    "label": 0
                },
                {
                    "sent": "So a lot of clever people here in the in the room, but I definitely not able to.",
                    "label": 0
                },
                {
                    "sent": "You know, to deal with all these ideas to come up with better algorithms, we need some very specialized.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then I come to another very important and it's.",
                    "label": 0
                },
                {
                    "sent": "It's almost gets to a kind of philosophical stage at some point, but let's see.",
                    "label": 0
                },
                {
                    "sent": "Do we operations on patients with subscriptions.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the link to the Gmail and the link to the GY and the link in the intercom, it's actually was triggered by a question that we got from the conditions solutions.",
                    "label": 0
                },
                {
                    "sent": "We have data or Crohn's disease patients, and they wanted to know to what extent their disease specific genetic markers would be able to find subtypes of these patients.",
                    "label": 0
                },
                {
                    "sent": "Because they detected the huge.",
                    "label": 0
                },
                {
                    "sent": "It originated in technician, so even though the clinical history was quite compareable to totally respond within this, we only drug treatment center.",
                    "label": 0
                },
                {
                    "sent": "So maybe you can find some evidence for this.",
                    "label": 0
                },
                {
                    "sent": "Is a English genetics and came up with such a cross string who stated class modeling techniques.",
                    "label": 0
                },
                {
                    "sent": "But then people were were asking whether how sure can you be that these clusters are disease specific?",
                    "label": 0
                },
                {
                    "sent": "To what extent?",
                    "label": 0
                },
                {
                    "sent": "Don't you see an influence from general population characteristics than before?",
                    "label": 0
                },
                {
                    "sent": "So we checked it.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so that led to the to the other things are cautionary notes or populations replication, because they are indeed we saw that when you use ancestry, informative snips, and we corrected the clustering 40s ancestry, informative snips was no link, and work with the ethnic groups.",
                    "label": 0
                },
                {
                    "sent": "We still have groups.",
                    "label": 0
                },
                {
                    "sent": "Clusters were clearly different from before, so it matters.",
                    "label": 0
                },
                {
                    "sent": "Where is it consequence of this?",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "First of all, if you start doing clustering, there is a fast amount of clustering techniques available.",
                    "label": 0
                },
                {
                    "sent": "We know that they give different results because of the different underlying algorithms.",
                    "label": 0
                },
                {
                    "sent": "So apart from the fact which closely wondering if we choose, we also sold at my new adjust or do not adjust for quite some differences and overlap between the clusters, which is indicated by a high number in this column.",
                    "label": 0
                },
                {
                    "sent": "Is very poor, numbers are not high, not high at all.",
                    "label": 0
                },
                {
                    "sent": "And obviously you use so that when you do an adjustment analysis so adjusted for his ancestry, informative snips, you could link the update clusters with a series of phenotypes, clinical phenotypes, but not anymore when you did not, when you did not adjust it analysis, or vice versa so.",
                    "label": 0
                },
                {
                    "sent": "So it's all about finding a homogeneous group, and if you think about network analysis, integrated network analysis, optimal starts with maybe can cervical cancer type population.",
                    "label": 0
                },
                {
                    "sent": "You build a network and then you investigated properties of the network meeting.",
                    "label": 0
                },
                {
                    "sent": "We tried to find the house, not a very important regions in in the network and try to link it to.",
                    "label": 0
                },
                {
                    "sent": "Valuable survival rates over that much.",
                    "label": 0
                },
                {
                    "sent": "This network is based on the sample that you have.",
                    "label": 0
                },
                {
                    "sent": "These gang situations which are quite or genius and to what extent are they maybe two intra genius or not?",
                    "label": 0
                },
                {
                    "sent": "And how narrow should it be?",
                    "label": 0
                },
                {
                    "sent": "A homogeneous group homogeneous cluster should probably not be driven by a statistical criterion.",
                    "label": 0
                },
                {
                    "sent": "Here we have to make the cut off.",
                    "label": 0
                },
                {
                    "sent": "But by something else, what is that something else, and what does it mean?",
                    "label": 0
                },
                {
                    "sent": "An integral component in the integrated context it's already have company here in this contest where we only use.",
                    "label": 0
                },
                {
                    "sent": "Sydney.",
                    "label": 0
                },
                {
                    "sent": "It's unbelievably insane.",
                    "label": 0
                },
                {
                    "sent": "I think it's, uh, it's a teaser.",
                    "label": 0
                },
                {
                    "sent": "And so.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, so also with respect to this.",
                    "label": 0
                },
                {
                    "sent": "If you look at the Genome Wide Association, studies were right for this population structure.",
                    "label": 0
                },
                {
                    "sent": "People often India through principal components, yeah.",
                    "label": 0
                },
                {
                    "sent": "Should we do that as well?",
                    "label": 0
                },
                {
                    "sent": "If you do transcriptome analysis, there is already evidence is that if you genetics is also able to differentiate between populations.",
                    "label": 0
                },
                {
                    "sent": "So why would bring it into those analysis as well combining genetic markers into genetic data?",
                    "label": 0
                },
                {
                    "sent": "And clearly this is not going to be in a linear way, right?",
                    "label": 0
                },
                {
                    "sent": "It must be nonlinear relationships there.",
                    "label": 0
                },
                {
                    "sent": "I mean, why wouldn't particular network be able to differenciate?",
                    "label": 0
                },
                {
                    "sent": "Between us to be able to.",
                    "label": 0
                },
                {
                    "sent": "Differences between populations.",
                    "label": 0
                },
                {
                    "sent": "So there is some ongoing work where we tried to bring this moment guarantee and heading to the agency goes toward this can be, but I see very rarely an integrated study where this is kind of taken into account.",
                    "label": 0
                },
                {
                    "sent": "Population.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Take into account population substructure in general and what characterizes such population substructure really, not only the.",
                    "label": 0
                },
                {
                    "sent": "But also.",
                    "label": 0
                },
                {
                    "sent": "What is respectful mix up?",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, there is this issue of course because.",
                    "label": 0
                },
                {
                    "sent": "If you think of the example of interaction studies, we know that most of the time you're already underpowered, so in principle you could gain more power BI.",
                    "label": 0
                },
                {
                    "sent": "Combining it with other similar studies.",
                    "label": 0
                },
                {
                    "sent": "Now suppose that the other studies have used the same analytic tool.",
                    "label": 0
                },
                {
                    "sent": "I don't want to bring that complexity of the game right now, but if it's a problem, right?",
                    "label": 0
                },
                {
                    "sent": "Because if you need like, I don't know 100,000 individuals to have enough power to really see the signal that you would like to see.",
                    "label": 0
                },
                {
                    "sent": "It's very hard to find an independent data set to Jennifer size 100,000.",
                    "label": 0
                },
                {
                    "sent": "What's the flower you need?",
                    "label": 0
                },
                {
                    "sent": "To make relevant conclusions when you're starting to integrate data.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And maybe we should not just look at this type of blocks here, but we should use maybe.",
                    "label": 0
                },
                {
                    "sent": "Some prior information.",
                    "label": 0
                },
                {
                    "sent": "As well, and this is already, and I haven't seen it a lot into the literature, but I came across a clinical common asking in 2012 that create this PM float and kind of look at the museum, the posterior probability that any of the studies in your meta analysis had an effect.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I mean it's not going to solve the issue, but maybe we need some more than ever tools as well to perform a meta analysis wants you to have the data in the Integral Excel.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "The thing is that the more data you start collecting, the harder it will be to validate model assumptions of a special parametric approach.",
                    "label": 1
                },
                {
                    "sent": "So clearly there is group of other types of methods.",
                    "label": 0
                },
                {
                    "sent": "Model free approaches and interesting.",
                    "label": 0
                },
                {
                    "sent": "Although it is well known in Biostatistics, unknown parametric meta analysis methods, we're hardly used in in genomics or if you know of any trouble, please let me know.",
                    "label": 0
                },
                {
                    "sent": "But there are hardly used and I think this might be very very interesting to include in the picture as well if we start analyzing our data and Model 3 way, well we should do that analysis as well.",
                    "label": 0
                },
                {
                    "sent": "Assumptions.",
                    "label": 0
                },
                {
                    "sent": "Still a lot to be done, so talking to.",
                    "label": 0
                },
                {
                    "sent": "Pure statisticians and as I get up there, maybe we can do some of it and then talk to the implementations to speed up everything in to make efficient algorithms etc etc.",
                    "label": 0
                },
                {
                    "sent": "There is another context.",
                    "label": 0
                },
                {
                    "sent": "And I think it's very important because no more data collection, more likely it is that not everything is collected for folder for the same group of individuals.",
                    "label": 0
                },
                {
                    "sent": "And I'm not talking about that.",
                    "label": 0
                },
                {
                    "sent": "Maybe one individual may have genomatica Dino games are available and the other may have three data sources available, but I'm really talking about some particular genetic markers or features that are not being measured.",
                    "label": 1
                },
                {
                    "sent": "So what are you going to do with it?",
                    "label": 0
                },
                {
                    "sent": "One of the standard approaches in Genome wide Association studies is compute.",
                    "label": 1
                },
                {
                    "sent": "Sorry for every 5 minutes Ave since there's no question about it, people are doing the little bit of coding back and that's it.",
                    "label": 0
                },
                {
                    "sent": "Interaction studies that's using the same data but just adding this extra level of complexity, making your hypothesis your alternative hypothesis wider.",
                    "label": 0
                },
                {
                    "sent": "So good anymore what?",
                    "label": 0
                },
                {
                    "sent": "Why would that be a problem?",
                    "label": 0
                },
                {
                    "sent": "So imputation in G Nevada sociation studies is based on what what type of information was?",
                    "label": 0
                },
                {
                    "sent": "1 million struggling through huge.",
                    "label": 0
                },
                {
                    "sent": "Yes I can.",
                    "label": 0
                },
                {
                    "sent": "Map information yet, for instance you have nothing for may shun so, but actually it relies on lease structure on block structure.",
                    "label": 0
                },
                {
                    "sent": "Interaction World so erection group.",
                    "label": 0
                },
                {
                    "sent": "We know that if two steps are in Audi.",
                    "label": 0
                },
                {
                    "sent": "So we are happy carbonated.",
                    "label": 0
                },
                {
                    "sent": "Then it means use benefit stays the signal that made use an interruption signal depending on the message that you use, but it's not the one that you're interested in.",
                    "label": 0
                },
                {
                    "sent": "This is what it's called in the interaction field that we done those interactions.",
                    "label": 0
                },
                {
                    "sent": "But if you leave all of these possible pairs linked to the data, then yeah, it increases your body for testing very too much.",
                    "label": 0
                },
                {
                    "sent": "So you need to prune back to some extent so you can include that you need to prove that and how far should you go.",
                    "label": 0
                },
                {
                    "sent": "What's the balance between being able to use proxies in the neighborhood to pick up the signal?",
                    "label": 1
                },
                {
                    "sent": "Or you're increasing your computational burden to happen?",
                    "label": 1
                },
                {
                    "sent": "So how would it work in the integral?",
                    "label": 0
                },
                {
                    "sent": "It's becoming more integration, different data sources.",
                    "label": 0
                },
                {
                    "sent": "What is commonly done configured transcriptome analysis is just, you know, transcript.",
                    "label": 0
                },
                {
                    "sent": "Just be rude or I don't know why it does not impute.",
                    "label": 0
                },
                {
                    "sent": "Or maybe it's a different completely different imputation strategy.",
                    "label": 0
                },
                {
                    "sent": "So will this have an effect on your integrative methods or not?",
                    "label": 0
                },
                {
                    "sent": "It's something to be aware.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Interprete.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So how can we enhance interpretation, but usually say that try to integrate, you know, as much biological knowledge as you are able to in every possible step.",
                    "label": 0
                },
                {
                    "sent": "But there is this warning I made in beginning of this presentation.",
                    "label": 0
                },
                {
                    "sent": "If you start to link to the biological databases, to what extent is it reliable knowledge?",
                    "label": 0
                },
                {
                    "sent": "You also do not want to throw away today with nothing.",
                    "label": 0
                },
                {
                    "sent": "So it's.",
                    "label": 0
                },
                {
                    "sent": "But for now we see in the July solution direction complex we see that it can be really beneficial, integrated to prioritize and to adopt different rules, different analytic boots.",
                    "label": 0
                },
                {
                    "sent": "And it's not about saying that this method is better than no, but it's it's a different viewpoint and most likely one metric is able to highlight one particular type of architecture and another method, another type of architecture.",
                    "label": 0
                },
                {
                    "sent": "So by combining all these viewpoints, you may increase your insight into the problem, and then you can perhaps be more specific point in your analysis.",
                    "label": 0
                },
                {
                    "sent": "Is there going to be an issue?",
                    "label": 0
                },
                {
                    "sent": "Integrate multiple only statements only going through so much more complex.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Investigation and validation.",
                    "label": 0
                },
                {
                    "sent": "Do you know the difference between replication and validation?",
                    "label": 1
                },
                {
                    "sent": "Repeat just doing exactly the same.",
                    "label": 0
                },
                {
                    "sent": "So replication would involve that you try to find a similar operation.",
                    "label": 0
                },
                {
                    "sent": "With the same type touristics.",
                    "label": 0
                },
                {
                    "sent": "Thanks a design inferia.",
                    "label": 0
                },
                {
                    "sent": "Same study design will try the same analytic tool.",
                    "label": 0
                },
                {
                    "sent": "And then you see when you come find, you find the earlier point.",
                    "label": 0
                },
                {
                    "sent": "In practice, it doesn't work like that.",
                    "label": 0
                },
                {
                    "sent": "He's trying to get us close to.",
                    "label": 0
                },
                {
                    "sent": "I already mentioned safe characteristics.",
                    "label": 0
                },
                {
                    "sent": "It's about characterizing configuration, so the issues that I mentioned with respect to patients in population characterization come in here as well.",
                    "label": 0
                },
                {
                    "sent": "Are the features what are the criteria that I did you characterize a compilation?",
                    "label": 0
                },
                {
                    "sent": "What is this song?",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Validation.",
                    "label": 0
                },
                {
                    "sent": "I know there are other definitions filter out the validation would be that you go for instance and then I'll write this tactic group and check.",
                    "label": 0
                },
                {
                    "sent": "But what do you do with that talk too much?",
                    "label": 0
                },
                {
                    "sent": "Because if you do not sign back to result it shouldn't worry.",
                    "label": 0
                },
                {
                    "sent": "In the way, because it might be that there are really different mechanisms operating in the other ethnicity and the other ethnic group.",
                    "label": 0
                },
                {
                    "sent": "And that's very likely to happen.",
                    "label": 0
                },
                {
                    "sent": "Do more different data points you're going to use?",
                    "label": 0
                },
                {
                    "sent": "Measurements coming from multiple magazines.",
                    "label": 0
                },
                {
                    "sent": "Multiple data sources.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I would like to make this quote you to the variation of you frequency and underline linkage disequilibrium segments between two datasets.",
                    "label": 1
                },
                {
                    "sent": "It's highly unlikely that the same combination of taxes would be associated with the same statistical interaction model.",
                    "label": 1
                },
                {
                    "sent": "Getting us back to the example of genomic Association interaction studies.",
                    "label": 0
                },
                {
                    "sent": "So even replication in the field of generalization interaction studies using snip bells Jingle my sniffles.",
                    "label": 0
                },
                {
                    "sent": "Thanks, Melissa.",
                    "label": 0
                },
                {
                    "sent": "Should it be done with this next level?",
                    "label": 0
                },
                {
                    "sent": "Usually editors ask you to replicate this place.",
                    "label": 0
                },
                {
                    "sent": "It's probably going to be highly different and also a sniper.",
                    "label": 0
                },
                {
                    "sent": "One study may have been included in another study.",
                    "label": 0
                },
                {
                    "sent": "Not so it's not.",
                    "label": 0
                },
                {
                    "sent": "It's comparing apples and oranges in a way.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is an example of it.",
                    "label": 0
                },
                {
                    "sent": "So this is an example of Alzheimer's disease, that PowerPoint full scope is been working off and she did an extensive review of four possible interaction signals based on Smith data that she could find with respect to Alzheimer's disease.",
                    "label": 0
                },
                {
                    "sent": "Why some heterogeneity?",
                    "label": 0
                },
                {
                    "sent": "Different signals.",
                    "label": 0
                },
                {
                    "sent": "Different sample sizes.",
                    "label": 0
                },
                {
                    "sent": "Study design.",
                    "label": 0
                },
                {
                    "sent": "Sometimes if you both, you know well most of the time it involved a genome wide Association study and then with the signals that they got they tried to change present one signals, modifying the effect of the other symbols.",
                    "label": 0
                },
                {
                    "sent": "Not exhaustively, but somewhere itself etc.",
                    "label": 0
                },
                {
                    "sent": "So it's what you do with it.",
                    "label": 0
                },
                {
                    "sent": "How you interpret and then also putting it in the context of 1 slide before.",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "Is it really reasonable that we ask that this exact Smith care is getting the same signal across studies?",
                    "label": 0
                },
                {
                    "sent": "Maybe not.",
                    "label": 0
                },
                {
                    "sent": "We may need to.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Extrapolation go to a higher level.",
                    "label": 0
                },
                {
                    "sent": "First level that comes in mind as a genetic level, so they are.",
                    "label": 0
                },
                {
                    "sent": "Well, sitting in jeans or preferring to cheese.",
                    "label": 0
                },
                {
                    "sent": "Maybe they want to make happy couples or associated to visit my files, but even you know, making the extension to the genetic level is not obvious because you can link back not all science, but some said Schoology based on physical location.",
                    "label": 0
                },
                {
                    "sent": "But maybe also based on results from equity analysis, right?",
                    "label": 0
                },
                {
                    "sent": "So whether it affects analogies, expression, and should you gotta make it through that Sheen aren't too, e.g nearby when making these extra collections.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we automatically working business we we.",
                    "label": 0
                },
                {
                    "sent": "Investigators come from and figure Smith panel at our disposal and based on this literature review, we just looked at all the jeans that were involved, so that could be linked to a Smith that occur within a significant snip, snip interaction.",
                    "label": 0
                },
                {
                    "sent": "And we took all The Smiths that could be physically mapped to all of these jeans, and then they did exhaustive analysis.",
                    "label": 0
                },
                {
                    "sent": "If you appropriately correct for the gene size, which is different.",
                    "label": 0
                },
                {
                    "sent": "If you profoundly correct for the multiple testing which is now already severely reduced, nothing is there.",
                    "label": 0
                },
                {
                    "sent": "No signal at all.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "As the colors here just indicate.",
                    "label": 0
                },
                {
                    "sent": "Marginal significance so the green one thing we want is that Gasol agreement means that it was marginal, significant, so not corrected for multiple testing, not even adjusted for the jeans size, which we should really not do.",
                    "label": 0
                },
                {
                    "sent": "Both surface to indicate.",
                    "label": 0
                },
                {
                    "sent": "Add stone.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "So what about replication?",
                    "label": 0
                },
                {
                    "sent": "What about making sensibilities and members?",
                    "label": 0
                },
                {
                    "sent": "This is something we are now seeing in the integrated analysis as well.",
                    "label": 0
                },
                {
                    "sent": "If you have separate efforts over the world, integrating data sense more and more data is made publicly available.",
                    "label": 0
                },
                {
                    "sent": "Aren't can now only or officially applied to get access to these data.",
                    "label": 0
                },
                {
                    "sent": "Are you going to do afterwards without a combined effort?",
                    "label": 0
                },
                {
                    "sent": "Will be something like this, but it's it's very different genus.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No replication, therefore without consensus only days, another is no Holy Grail, but some methods have more desirable properties and others.",
                    "label": 1
                },
                {
                    "sent": "And I quote from this paper here algorithms for detecting.",
                    "label": 0
                },
                {
                    "sent": "In this case, study directions should be evaluated using simulated data for reasons of both scalability and interpretation.",
                    "label": 1
                },
                {
                    "sent": "It's already very hard to set up and and.",
                    "label": 0
                },
                {
                    "sent": "Kind of realistic simulation study in the context of interactions.",
                    "label": 0
                },
                {
                    "sent": "When one of these data sources are involved, it's a real challenge.",
                    "label": 0
                },
                {
                    "sent": "The creation of realistic structures inside today.",
                    "label": 0
                },
                {
                    "sent": "That's problematic in the beautiful, complex nature architecture will be stays in humans, both of which are largely unknown, so not even taking into account transfer form effects.",
                    "label": 0
                },
                {
                    "sent": "Movies simply don't rhythms, etc.",
                    "label": 0
                },
                {
                    "sent": "So we need some wood platforms data.",
                    "label": 0
                },
                {
                    "sent": "Ideally also will be able to compare methods and to really have a good crew or to be able to make judgments about what is every analytic able to discover.",
                    "label": 0
                },
                {
                    "sent": "What is it targeting?",
                    "label": 0
                },
                {
                    "sent": "Came the genome in the arms?",
                    "label": 0
                },
                {
                    "sent": "What can it reveal?",
                    "label": 0
                },
                {
                    "sent": "What can it highlight?",
                    "label": 0
                },
                {
                    "sent": "Usually they are used in this all makes.",
                    "label": 0
                },
                {
                    "sent": "So how can Alesis as sweeping over the Geno?",
                    "label": 0
                },
                {
                    "sent": "They make some inherent assumptions about proper hypothesis that you can really reach with them, but these hypothesis are not relevant all over the place all over the genome.",
                    "label": 0
                },
                {
                    "sent": "So for some parts it will work really well for other parts in front.",
                    "label": 0
                },
                {
                    "sent": "Works well, but to really get a grip on you know what works best in which scenario.",
                    "label": 0
                },
                {
                    "sent": "That is very kind.",
                    "label": 0
                },
                {
                    "sent": "Every person I've collected visualizes interruptions.",
                    "label": 0
                },
                {
                    "sent": "Please again, we develop severe, nothing.",
                    "label": 0
                },
                {
                    "sent": "Sorry we have done it as well.",
                    "label": 0
                },
                {
                    "sent": "Step up simulation, study check was infected so they'll be different static models, etc.",
                    "label": 0
                },
                {
                    "sent": "But it varies from one study to another, so it makes it very, very hard to make real comparisons because the nature of the simulation study was redundant.",
                    "label": 0
                },
                {
                    "sent": "So we're kind of lobbying groups in comics from from American.",
                    "label": 0
                },
                {
                    "sent": "Actually, it's it's initiated by by the edge group spaces infection.",
                    "label": 0
                },
                {
                    "sent": "Which method technology to trying to get some good realistic recommendation not to kind of promote or whatever you may think Indian direction analysis.",
                    "label": 0
                },
                {
                    "sent": "You develop also applied on those data you know because then we have this kind of benchmark and weaker immune rating.",
                    "label": 0
                },
                {
                    "sent": "Netflix take the best of several worlds and.",
                    "label": 0
                },
                {
                    "sent": "Develop something new.",
                    "label": 0
                },
                {
                    "sent": "You're not even thinking about that, and you'll make sense you created for this.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So no replication without a consensus about methodology.",
                    "label": 1
                },
                {
                    "sent": "The more complex the problem you would like to solve becomes, the more different ways you can detect this problem.",
                    "label": 0
                },
                {
                    "sent": "And therefore it's much more difficult to not to combine.",
                    "label": 0
                },
                {
                    "sent": "Results can be analogous.",
                    "label": 0
                },
                {
                    "sent": "They may.",
                    "label": 0
                },
                {
                    "sent": "Different Rainbow Disgusting is handled.",
                    "label": 0
                },
                {
                    "sent": "In the way you know features were selected for the analysis.",
                    "label": 0
                },
                {
                    "sent": "Anyway, it was taken into account to ignore the candy or let me generalize it to general comics correlations between features.",
                    "label": 0
                },
                {
                    "sent": "Do I allow them or not?",
                    "label": 0
                },
                {
                    "sent": "And what is my name?",
                    "label": 0
                },
                {
                    "sent": "What is my cutter?",
                    "label": 0
                },
                {
                    "sent": "In a very simple regression analysis, if you put in variables in a regression model and you're highly correlated with something which is called multicollinearity, it's it's a feature of the data.",
                    "label": 0
                },
                {
                    "sent": "So collected data may not appear.",
                    "label": 0
                },
                {
                    "sent": "That movie called linearity.",
                    "label": 0
                },
                {
                    "sent": "May not be hard harmful, but it may be harmful when it because it means that when you would leave out one of these variables, the effect sizes may change significantly.",
                    "label": 0
                },
                {
                    "sent": "Change setting.",
                    "label": 0
                },
                {
                    "sent": "Importance of.",
                    "label": 0
                },
                {
                    "sent": "Relationships not only in the context of people spaces, but I feel they will become much more important than their starting to integrate into components, and in that sense, and not only looking at the different layers and relationships with between these layers, like maybe quitting out analysis which most often involves 1 snap waiting to one friend script at certain.",
                    "label": 0
                },
                {
                    "sent": "Do that multiple times but also take into account and this entire.",
                    "label": 0
                },
                {
                    "sent": "Structured or D interactions.",
                    "label": 0
                },
                {
                    "sent": "You know, the gene expression network information.",
                    "label": 0
                },
                {
                    "sent": "Bring it, bring it all into one another.",
                    "label": 0
                },
                {
                    "sent": "So within and between architectures, and improving that into the model.",
                    "label": 1
                },
                {
                    "sent": "And last but not least, the missing data handling in here.",
                    "label": 0
                },
                {
                    "sent": "There may be room for something which is sold in in class statistics.",
                    "label": 0
                },
                {
                    "sent": "Of course in process, so coarsening refers to the situation where we do have a measurement, but on a much broader scale it's not as fine as you would have liked it to be.",
                    "label": 0
                },
                {
                    "sent": "So if you think you have a very easy example in, if you do much and impeding knology or clinical settings.",
                    "label": 0
                },
                {
                    "sent": "You may have.",
                    "label": 0
                },
                {
                    "sent": "You know the exact measurements on correct high cholesterol.",
                    "label": 0
                },
                {
                    "sent": "So on cholesterol levels or you may have.",
                    "label": 0
                },
                {
                    "sent": "An assessment on high or low, high or low.",
                    "label": 0
                },
                {
                    "sent": "This is on a much rougher scale, but because you have different skillsets, refers to the same overnight counts, but there are methods available to deal with this with these differences so that you can include all information into your.",
                    "label": 0
                },
                {
                    "sent": "I do not see the girl course.",
                    "label": 0
                },
                {
                    "sent": "Meaning if you're not in an animatronic for now, but I think there is improvement.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No, no I think well.",
                    "label": 0
                },
                {
                    "sent": "Be able to replicate.",
                    "label": 0
                },
                {
                    "sent": "So is this going to be a bad thing about?",
                    "label": 1
                },
                {
                    "sent": "Positive note.",
                    "label": 0
                },
                {
                    "sent": "Starting from the jewels.",
                    "label": 1
                },
                {
                    "sent": "Failure to replicate a genetic Association.",
                    "label": 0
                },
                {
                    "sent": "Not that bad because it's made to apply that important people about genetic architecture.",
                    "label": 0
                },
                {
                    "sent": "It's maybe because we were just only looking at a very narrow alternative, right?",
                    "label": 0
                },
                {
                    "sent": "We ignore it.",
                    "label": 0
                },
                {
                    "sent": "The interactions, perhaps in that particular study, and because of the fact that we ignore this more complex structure.",
                    "label": 0
                },
                {
                    "sent": "This is why you could not replicate.",
                    "label": 0
                },
                {
                    "sent": "So extrapolate this to the context of integrated analysis.",
                    "label": 0
                },
                {
                    "sent": "More complex structures.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So combining it's oh Gino.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "VR um?",
                    "label": 0
                },
                {
                    "sent": "Shall I say something about it very briefly?",
                    "label": 0
                },
                {
                    "sent": "So The thing is that this is a method that was primarily developed to detect interactions sitting in directions.",
                    "label": 0
                },
                {
                    "sent": "Get ready for the pending require orders as well, but the idea is that in a natural way, if you use Gmail type information, individuals can be.",
                    "label": 0
                },
                {
                    "sent": "Wired or categorized in one of these nights sells refering to the possible two locus genotype combinations that you have has to decide.",
                    "label": 0
                },
                {
                    "sent": "So every low self refers to snip snip tool use.",
                    "label": 0
                },
                {
                    "sent": "Here's why.",
                    "label": 0
                },
                {
                    "sent": "School maximum three genotypes.",
                    "label": 0
                },
                {
                    "sent": "So these are the three columns and three rows at each in the matrix and every individual for which you have collected data on.",
                    "label": 0
                },
                {
                    "sent": "We'll sit in one of these nine cells if there is information investment.",
                    "label": 0
                },
                {
                    "sent": "So the idea of such an algorithm is that you kind of prioritize or did not prioritize.",
                    "label": 0
                },
                {
                    "sent": "You kind of you want to label these movie local cells with respect to that rate of interest.",
                    "label": 0
                },
                {
                    "sent": "I mean, is this combination more likely to give rise to a disease individual as opposed to a cultural or more likely to give the right school higher survival rate as opposed to an old survival etc.",
                    "label": 0
                },
                {
                    "sent": "And then there are some.",
                    "label": 0
                },
                {
                    "sent": "Assessed using Association faces.",
                    "label": 0
                },
                {
                    "sent": "Statistical Association tests.",
                    "label": 0
                },
                {
                    "sent": "And then it is followed by a reduction method where all similar cells are being pulled.",
                    "label": 0
                },
                {
                    "sent": "So these are similar and these are similar with respect to risk or survival rate for what everybody would like this and a final Association test is being used so it isn't method and Assoc modeling method to pick up interactions.",
                    "label": 0
                },
                {
                    "sent": "And obviously you need to correct for this data snooping and significance.",
                    "label": 0
                },
                {
                    "sent": "Significant assessments need to be done in.",
                    "label": 0
                },
                {
                    "sent": "Indian the correct weight as well as a correction for multiple testing, but this is taken care of now where I would like to go in.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is what I just explained.",
                    "label": 0
                },
                {
                    "sent": "Every individual belongs to one of these cells and sometimes, especially if this is according populated cells or the small A and small beat, the view frequencies are very, very small.",
                    "label": 0
                },
                {
                    "sent": "It might be that you do not have any individuals sitting in that cell in your sample.",
                    "label": 0
                },
                {
                    "sent": "Now, why don't you make the X population and instead of looking at Snips, look at the we.",
                    "label": 0
                },
                {
                    "sent": "A region of the gene I think over G. And to a gene you can make different data sources and you can add CNBC snaps you can add if genetic markers left, leaving alone how to do the mapping, which is not easy.",
                    "label": 0
                },
                {
                    "sent": "But then suppose you can map it.",
                    "label": 0
                },
                {
                    "sent": "Then you could say well, instead of this natural organization of individuals into these cells, I can now impose a clustering algorithm on to these features map through my 1G, and this will give me some clusters.",
                    "label": 0
                },
                {
                    "sent": "These are the customers.",
                    "label": 0
                },
                {
                    "sent": "So from 1 gene to another G this may change.",
                    "label": 0
                },
                {
                    "sent": "Do you want maybe to make someone plus or minus two another five or you won't have empty cells here because it's enclosed by the clustering algorithm will always have people sitting across from it.",
                    "label": 0
                },
                {
                    "sent": "And this is a good starting point, because actually you can then apply the advantage of apology, compare oneself versus the other, try to label with, etc.",
                    "label": 0
                },
                {
                    "sent": "Although this is now in one dimension and not know where directions for people.",
                    "label": 0
                },
                {
                    "sent": "Think of it as generalizing to identify gene gene interactions, avoiding the problem that you need to extrapolate based on snip snip sequence.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now this means that it involves.",
                    "label": 0
                },
                {
                    "sent": "Selecting your features.",
                    "label": 0
                },
                {
                    "sent": "How am I going to select?",
                    "label": 0
                },
                {
                    "sent": "This is very, very important.",
                    "label": 0
                },
                {
                    "sent": "And also the classroom powder.",
                    "label": 0
                },
                {
                    "sent": "And the reason why I wanted to show this is not true that you give you all details about soda method, but just to show that this is a part of someone's work that whenever she used or as soon as she started using kernel PCA, so bring them all linearity aspect into the game.",
                    "label": 0
                },
                {
                    "sent": "Then the results started to be really really promising only then.",
                    "label": 0
                },
                {
                    "sent": "And this was an extra motivation for us that yes, we have to.",
                    "label": 0
                },
                {
                    "sent": "Have to bring more complexity into into our modeling.",
                    "label": 0
                },
                {
                    "sent": "And you may ask yourself, haven't toward if you compare with other performance.",
                    "label": 0
                },
                {
                    "sent": "So this was applied to sequencing data.",
                    "label": 0
                },
                {
                    "sent": "Next generation sequencing data, where you typically have common and rare variants.",
                    "label": 0
                },
                {
                    "sent": "So here the common and aware variants were mapped to a gene and roared of Queens, available for Red Barons analysis.",
                    "label": 0
                },
                {
                    "sent": "So this was compared to recognize siblings.",
                    "label": 0
                },
                {
                    "sent": "But it can be used to mix integrated purposes tonight teacher.",
                    "label": 0
                },
                {
                    "sent": "And I hope.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Made it.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We're done.",
                    "label": 0
                },
                {
                    "sent": "Hello.",
                    "label": 0
                },
                {
                    "sent": "In the title equals Integral Mix general integrative analysis.",
                    "label": 0
                },
                {
                    "sent": "I've made it clear that looking back at the Gevalia sociation direction studies is really learned a lot.",
                    "label": 0
                },
                {
                    "sent": "You know about how to move on to develop no more elaborate methods in the context of integrated planning, data analysis efforts, and there's a reason why I left the other flight plans.",
                    "label": 0
                },
                {
                    "sent": "We need to think about patients.",
                    "label": 0
                },
                {
                    "sent": "Characterization population characterizations apiece.",
                    "label": 0
                },
                {
                    "sent": "Right now it needs to be integrated.",
                    "label": 0
                },
                {
                    "sent": "Canals is legs ample here.",
                    "label": 0
                },
                {
                    "sent": "Example is the genomic end of your initial development collection, but you can actually also use it as a.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And actually, you can also link it to to the networks, not one of the other accrued divisions in the integro mix analysis, because there is something called statistical interaction networks.",
                    "label": 1
                },
                {
                    "sent": "So where the definition of the edge already incorporates information about that rate because two genes are connected in such a network, whenever one is modifying the effects on that rate of interest.",
                    "label": 0
                },
                {
                    "sent": "Whereas usually if you take.",
                    "label": 0
                },
                {
                    "sent": "Classical network approach is maybe a network may be developed in the cancer population in healthy population and the network properties are being compared.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I would like to leave some room for questions as well, so we conclusion the Steelers of challenges in greeted me overcome.",
                    "label": 0
                },
                {
                    "sent": "I haven't even talked about protocol with elements in the context of integrated analysis and not at all experts in that I give it to other people can be very very good quarter for standardizing data generation pre processing and fluency.",
                    "label": 1
                },
                {
                    "sent": "Development of computationally efficient analytic tools to extract and knowledge from this similar data.",
                    "label": 1
                },
                {
                    "sent": "Fights with different questions in mind and establishment of validation replication procedures where we need to rethink the definition of replication in the complex no longer interactions with certain.",
                    "label": 0
                },
                {
                    "sent": "Also integro mix and also validation.",
                    "label": 0
                },
                {
                    "sent": "How are we going to validate the results?",
                    "label": 0
                },
                {
                    "sent": "So I hope I've showed you that for example, my Gmail is gonna be very instrumental.",
                    "label": 0
                },
                {
                    "sent": "Prefer to think about how communication this week.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": []
        }
    }
}