{
    "id": "dfssk25b3wef47hjp5fk66ld2evhekks",
    "title": "Panel Discussion on Needs, Possibilities and Bottlenecks in Multimedia Knowledge Transfer",
    "info": {
        "author": [
            "Arnold Smeulders, Intelligent Systems Lab Amsterdam, University of Amsterdam",
            "Ajay Divakaran, Sarnoff Corporation",
            "Touradj Ebrahimi, École Polytechnique Fédérale de Lausanne",
            "Hong-Jiang Zhang, Microsoft Advanced Technology Center"
        ],
        "published": "Feb. 4, 2010",
        "recorded": "December 2009",
        "category": [
            "Top->Computers->Multimedia",
            "Top->Computer Science"
        ]
    },
    "url": "http://videolectures.net/multimedia09_paneldiscussion/",
    "segmentation": [
        [
            "Yeah, well, Alan asked me to prepare some slides that I I I around the need, possibility and the bottlenecks in multimedia.",
            "Now to transfer it just so broadly hopping.",
            "So I decided to take advantage of that.",
            "I come from industry and I myself has has has done the transfer from doing pure research to to industry research and from industry research too.",
            "And from just technology development to marketing, basically too.",
            "I'm going through this entire cycle off from technology to part."
        ],
        [
            "So I thought I will.",
            "Share with you some of the sort that automobile loadings an.",
            "Then see how we apply this to to to what we do in multimedia technology transfer.",
            "So first, let's look at the the 30 years of PC or personal computing revolution, computing revolution.",
            "And that itself is a process of development hard nearing and that create intellectual property.",
            "Technologies, and then it's a it is coming to a adoptation adoption process.",
            "No, so those those technology then got to bring consumer benefit.",
            "So what I'm saying here is, you know for what we have seen today, the Revolution or the progression they progress we have done.",
            "We have seen in the last 30 some years are around.",
            "Personal computing is actually the process of technology development and adopt adoption process and so start from a PC when IBM.",
            "Came out of this PC architecture and mothers after see saw opportunity and that Bill Gates come out and say I want to put a PC on every desktop in every home IBM look located Microsoft Lofty this small company.",
            "What are you talking about?",
            "Why people do that PC in every house in every home in every office.",
            "So it's another mistake IBM made.",
            "It was never really.",
            "Saw that PC is going to take off and they never saw the software to sell.",
            "Will be sold separately from Howard so they said OK why don't we also see this little software to aces Startup Company as Microsoft so?",
            "They are so when they first come up with it, it's not a graphic interface, so all you can do is you do a spreadsheet and you do what processor?",
            "So, but that's compared to the mainframe is already a huge step forward to bring the PC into people's work workspace.",
            "In this case, is a productivity tool.",
            "So an so computer can be used by people with little training instead of a scientist.",
            "Those really technology guys in the in the in the in the big machine rooms.",
            "So then the graphic interface came out.",
            "Miles came up and land came up.",
            "It just happens to be all those three things actually all happen in Silicon Valley, so this is there.",
            "Is this place called zero spot?",
            "There is this University called the Stanford's, where the mountain invented with graphic interface invited where the local area network invented once this happened.",
            "Computer now is connected together.",
            "PC Connect together.",
            "The power can be as strong as a super mainframe machine computer and then the graphic interface rated liberalize the PC.",
            "From from, you know professional training users into everybody.",
            "So now secretaries can use.",
            "Computers without fear destroy the computer and without fear not understanding that the programming logic behind that.",
            "So then the office application really become the Main Street.",
            "So that's the time Microsoft Word, Microsoft Office become mainstream.",
            "So again, is the technology and technology enabled?",
            "The application and the occasion come back push technology further.",
            "Well, you know what happened in the in the 90s?",
            "That is where the Internet came in and they are.",
            "The XML HTML came in and that's the time that PC now become really a a more communication media than just computing media.",
            "And it's become.",
            "Something immediate and.",
            "So now you see email client the web browsing, so that's just those two killers actually.",
            "Mayday Mayday, the PC.",
            "Penetrating into every home so that is where we are today about client plus cloud and the software plus service and thought.",
            "We were moving the PC from productivity from communication to creative creativity to personal.",
            "Social media.",
            "So that's just what I really want to say.",
            "Here is, you know, just technology alone will not bring value to the customer.",
            "Is the technology that enabled applications that brings better to the consumers?",
            "And.",
            "But if our company to succeed of our industry succeed of our society to succeed in innovation, you need to people doing different job.",
            "So in Microsoft, the ballpark of Oronde is actually on the product development side.",
            "We have over 20,000.",
            "Years working on software that can be shipped the next month, next year, next two years.",
            "And then we have something called Microsoft Research.",
            "You know, if we look at the maximum usage in mission and vision statement, the number one music is not to help company employees.",
            "It is to elevate the state of art.",
            "And the second one is to transfer technology to help the company.",
            "So that's basically they work on things 5 to 10 years out.",
            "And but so that's very much like people here in the universities.",
            "So, but how?",
            "How do we track, you know, come transform, those technology came out of basic research into our product.",
            "There is another layer, another group in between we call product laughs last.",
            "Alexander, which I personally personally manage in Beijing and the the.",
            "Various other lots in various places in in Microsoft so you you need people you need to have this completed and so those who work on ideas, basic ideas, those who just look at it tomorrow.",
            "You know today's products, those who look at tomorrow's problem so you need you need this layers and you need this steps and you need the people and people and in this three different steps.",
            "You need people with different skills, different mindset.",
            "I really emphasize about different mindset the.",
            "Then is what we see.",
            "And you have to think about long-term amounts of is a good example here is we, I think myself wondering is persistent is continue invest.",
            "You know, version one will not fly aversion to not fly versus three.",
            "OK, Windows 10 years.",
            "And for releases Office Word.",
            "11 years, 9 releases and Excel 10 years 5 releases.",
            "So it just look at long-term when you look at the product product pipeline today everybody everybody.",
            "Most people think Microsoft only have two part wrong.",
            "Can Microsoft get the Windows right at the office, right?",
            "Got Windows Server right?",
            "Gotta Xbox right and now I think we are.",
            "We finally also get it.",
            "Search right.",
            "So they are, but you see it's it's one is consistent long-term investment and it's baking vessel.",
            "So today you also look at, you know, here on the left side you know Microsoft is in.",
            "It is investing in thermal vertical application areas, education, healthcare and.",
            "Core and technical computing and robotics and all those things.",
            "So.",
            "Another aspect you know we talk about, at least on the bottom money.",
            "A lot of investment and I know I I surprise this this this slide for you to ask for more money for multimedia research, and I, you know, I I should have put another number is.",
            "The the any revenue or the number of employees and to see to to show even more that is a company that Microsoft invest a lot on R&D and per I mean in terms of the total revenue percentage in terms of number of dollars per employee and.",
            "The company would argue there more innovative.",
            "And but it is on the on the side.",
            "You know the numbers and then not and there.",
            "Remember last year at White 09 for Microsoft fiscal Year start from July 1st?",
            "Basically for lot of white there and I was.",
            "July there, 2008 which is.",
            "That crap when the crisis started and we still put a 9.1 billion dollar into R&D and this year.",
            "Start from July this year weight is increased to 1.5 so it does require a lot of money.",
            "For company to continue.",
            "Lead in their own field.",
            "So the key point.",
            "I like to say you know any technology or knowledge transfer is hot and take time and of course to take along a lot of money.",
            "And thank God you to product and services.",
            "Is is is usually comes along way so.",
            "And those of you who you know.",
            "That was my work.",
            "You have to work, but I made myself aim is that video thumbnail, which I did.",
            "You know 17 years ago and sorry just to see how old I am.",
            "Finally, in the making into mainstream is in the in the Bing search engine and images similarity search and in search engine.",
            "So in terms of the Articuno mass market, the pervasive use you finally see the light of it.",
            "And although the technology itself has been here and there.",
            "Add method and they are the content based video editing.",
            "Yes we use some of that there and we use it in the Microsoft Media Center and other places.",
            "But really mass market daily use.",
            "Compass search engine.",
            "And there.",
            "The.",
            "There are.",
            "Also think about it.",
            "Take take a lot of time to find the right opportunity.",
            "Not not.",
            "Not to mention technology itself.",
            "Need time to mature and need a market to provide a lot of feedback.",
            "And another thing I would like to point out here and share with you the case.",
            "I think I'm qualified to say that because I consider myself as a researcher and download research and today I'm a AA executive.",
            "Really look at the bottom line on top line.",
            "The company that is you have anything came up.",
            "You have to make money for the company and so then I also run the incubation team and but my incubation team is very different from people in the University.",
            "They may think you know I have a technology like to look.",
            "Where can I use this technology?",
            "So you basically have a heart, have a hammer?",
            "You're looking for Neil and but in my case now I look at the what market?",
            "We want in two to three years.",
            "And then.",
            "Come back to see what technology that I can.",
            "Use in this three, 2, three years timeframe and then build a product or service felt in that intent at the starting point is very different from where I used to be and.",
            "It's a it's from market from consumer, so I'm not saying you should all go to marketing to do market study.",
            "My my point is you'll never underestimate the complexity of market.",
            "And I think it today.",
            "The talk we heard earlier on the year.",
            "Quality of experience is actually another reflection.",
            "If you have always think about using mathematical models to describe the signal to noise ratio.",
            "Work on the wrong target.",
            "Really, you want to raise the quality of experience.",
            "And is that just a few?",
            "Equations of numerical matrix.",
            "So also I think if you look at the success of iPod and.",
            "You, I mean people give a lot of credit to Apple.",
            "Say you know they are.",
            "Very innovative but MP3 player has been there.",
            "Much longer than iPod, and that's why you know, I I I. Apple was forced to pay 1 billion dollar to this small Singapore company called Creative Labs.",
            "And because they those are companies that really this, this is the company that really invented a lot of those MP MP3 players.",
            "But it is.",
            "The whole ecosystem is the iTunes.",
            "That's the system that made the iPod success.",
            "Successful, so that allowed to the iPhone 6S.",
            "So the success of a product or service.",
            "Is far beyond just enough.",
            "So I'd like to stop here.",
            "Thank you very much.",
            "Just remember this.",
            "If you have any questions reserved for the shooter, couple minutes.",
            "So I'm going to.",
            "I'm not going to be able to hold the so as long as you did, because I'm sure that you have the whole Microsoft activity.",
            "I have a much more modest.",
            "Sphere of activities.",
            "So I I will be.",
            "I will be much shorter too.",
            "First, yeah.",
            "What actually Alan asked us?"
        ],
        [
            "Not as wait as he he asked us a he pretended he did.",
            "He actually asked us two slides.",
            "And he said talk about needs, possibilities and bottlenecks, which is 3 topics.",
            "With emphasis on bottlenecks, so I try to manage Anna mixing a little bit Nissan bottlenecks and one slide and then possibilities, maybe 1 second and I do not definitely pretend that this is covering the whole area.",
            "I'm just looking at it from a very small or window.",
            "With narrow not very very narrow view.",
            "So what are the bottlenecks?",
            "In multimedia knowledge and technology transfer, I suppose by knowledge you also meant included, so I know that my good member here doesn't like Killer applications, but.",
            "Or maybe we don't agree on definition of killer applications, but I think that's really one of the reasons.",
            "This transfer of technology I know how into into industry and into market has been limited in multimedia has been in fact because there have not been enough killer applications or now actually you correctly mentioned that it's not because somebody put the technology that could store in MP3.",
            "Audio, it was actually because there was iPod, iPhone and iTunes together and a few other things that made actually the success.",
            "Of of Apple and I will I will call it like a good killer app.",
            "Although I fully agree also that that it's not the technology that made it a killer app, it was something else.",
            "A social media also, although it remains to be seen.",
            "Apparently Facebook and YouTube both now make money.",
            "But social media also, in my opinion is a good a good example.",
            "Maybe search also definitely one 3D cinema maybe?",
            "Surveillance also these are areas where we have potential or maybe have had already experienced some killer application.",
            "What we need more?",
            "We really need more now.",
            "Maybe people don't like killer application because maybe it's a little bit overwhelming and exaggerated.",
            "It doesn't kill anybody, yeah, or it doesn't kill any other applications, but.",
            "But we need more applications and we really don't.",
            "Maybe one of the reasons that is related to that, and this is my second point, is the lack of maturity of multimedia tools.",
            "It is true.",
            "It's a fact that multimedia by many, many measures is not mature enough.",
            "We heard Arnold.",
            "He mentioned 100 years before the between the.",
            "WhatsApp and pump and and the first locomotive.",
            "We are not 100 years yet through multimedia, so it needs a little bit more time to become mature, but.",
            "Let's not get this perceived.",
            "Lack of maturity.",
            "Stop us.",
            "From going to marketplace.",
            "A good example of that is Picasa by many many measures.",
            "The face detection that is used in Picasa.",
            "I'm not even sure if ACM Multimedia.",
            "If somebody had, you know, submitted a paper on the face detection that is on Picasa, ACM multimedia would have accepted it because it was maybe even rejected.",
            "We know don't know that right?",
            "Somebody has to trace it back.",
            "But Google Founders paper to cigar.",
            "That's another very good example.",
            "That's another good example.",
            "I didn't know about so, but but you know the bottom line is that.",
            "You don't have to wait until your technology, in your opinion, is perfect.",
            "For the same reason technology is not all, sometimes even less than mature technologies, in your opinion are very good.",
            "And very needed.",
            "To try it.",
            "Yeah.",
            "The last bottleneck I would like to talk about is is.",
            "Legal complexities that are around IP.",
            "In fact, one of the reasons probably that we haven't seen as much.",
            "Transfer of technology.",
            "Into the marketplace has been IPR and multimedia.",
            "It's a very special case because there are actually 3 type of legal and intellectual property problems.",
            "One is like anywhere else, it's the patents and licensing and things like that.",
            "The second one is that multimedia is about content, right?",
            "Media is content and content is not free as opposed to what?",
            "Many think and there are Copyright issues.",
            "There are ownership issues and this is that makes it even more complex than just technology, intellectual property and on top of that we are now witnessing a third problem in multimedia peering and this is the question of trust and the question of privacy.",
            "So there is a lot of you know issues that are preventing deployment of.",
            "Of the of the technologies and transfer of technologies, and they know how into marketplace.",
            "Only because of that.",
            "A lot of people of course, are enjoying this.",
            "More lawyers are having a great time.",
            "Maybe that, but you know.",
            "That's a side effect and.",
            "Nevertheless, this remains remains the bottleneck.",
            "Now, what are the possibilities to improve?",
            "Again, please have in mind I'm really talking from a very very narrow window, and definitely none of this is meant to be to be universally applicable.",
            "I believe that more and more we have the capability and we should have what people refer to as experimentally driven research in multimedia.",
            "And we had some good examples.",
            "Price by the way, by you with the two billion images.",
            "Well at least you have done 80 million.",
            "I'm, you know, and these kind of things should really happen more.",
            "All day to do it, but you're right, yeah, data driven.",
            "You call it yeah I called it experimentally driven, but it's definitely whatever they name the essences.",
            "You want to have it and actually you know it has.",
            "Two good.",
            "Outcomes if you do it, one is that it is going to identify actually what the real problems are.",
            "She will be astonished you will discover maybe the problem is not very.",
            "You think it?",
            "Is it somewhere else?",
            "It does give you even knew challenges to you or to others.",
            "And also it's always nice.",
            "It gives you visibility and a showcase right?",
            "How can you know if if you have 100,000 and million people using something you have developed and you are benefiting as you are designing it?",
            "From there you know, use and they are benefiting from you.",
            "What kind of better if you do a good job?",
            "Of course.",
            "What kind of better visibility would you would like to have this perfect?",
            "On the same.",
            "You know length, but but maybe it is much more.",
            "It's a limited way.",
            "I think that there are and there should be more and more evaluation campaigns.",
            "Actually, I have one disable this video clip 2010 so this kind of initiatives are very, very important, because these are basically what.",
            "Low US to do, you know, compare and and if it is done well to to move forward and benefit from different strengths of different players.",
            "And it is a technology transfer to.",
            "It is a knowledge transfer to from one researcher to another, and from these researchers to industry.",
            "Same is true for standardization I. Sterilization actually has been quite successful in some sectors of multimedia like coding, compression, and things like that.",
            "A, but not as much in others like search like a data mining like annotation and many many others an I think that there is still a lot of room.",
            "For that, it's not just the stabilization for the K, for the sake of standardization, because otherwise you know evaluation companies do the same, we don't need that, but you really need in this jungle of multimedia to have some sort of, you know at least interoperability, if not for the users, at least for product.",
            "Builders and those who make products and services.",
            "Because otherwise you have to do everything right.",
            "Then systems have become very complex.",
            "This brings me actually to something that I think it's extremely important now for the success of multimedia, and this is the problem of certification.",
            "You know, when people do electronic devices like PC's, I don't know.",
            "Microphones, telephone, telephones etc.",
            "They certified right for electromagnetic compatibility for right and why not to have certification mechanisms.",
            "In terms of quality.",
            "As measured by something that has been standardized that people can do, why not to have certification for some features, for instance, of some specific sector search engines or or others?",
            "Really, you you offer a product or a service, you will have labels on them, right?",
            "That that gives you a from different metrics point of view what how well you are actually fulfilling these.",
            "What you are you're promising you are your focus.",
            "So I want to stop here.",
            "None of this is really.",
            "And by itself it's a.",
            "It's maybe a discussion and maybe we can discuss some of these aspects together.",
            "If there is some time left to discuss."
        ],
        [
            "So what I ended up doing was I. I merged those two things into my one talks.",
            "I'll just.",
            "Go back to the slides I showed you earlier today, but have a different emphasis.",
            "Um?",
            "So.",
            "If I could name if I could name a single bottleneck.",
            "I think that single bottleneck is just the mindset that the community appears to have.",
            "If we back off from that mindset.",
            "And think about what sorts of applications we can solve with currently available technology and what we can do further out.",
            "And then work backwards from that.",
            "Then I believe we can actually do some very interesting work.",
            "So let me give you a concrete example of that that.",
            "Um?",
            "So I showed you today the work on.",
            "Sports highlights extraction using an unusual event detection framework in time series.",
            "It turned out that we were able to take that type of idea and then turn around and apply to.",
            "Monitoring the health of an air conditioner.",
            "By just modeling the normal behavior of the air conditioner and then seeing deviation from the normal behavior.",
            "So.",
            "My belief is that the multimedia community has developed some very interesting set of tools.",
            "Other multimedia in general, the multimedia content analysis provides a very nice.",
            "A testbed or workbench for all sorts of very interesting art techniques.",
            "From math, mathematics, and engineering.",
            "So, um.",
            "So I would say that one thing is that it's just the Community needs to step back and think more in terms of.",
            "What kinds of applications could we conceive?",
            "So that is my thinking on the bottleneck.",
            "Of the single biggest bottleneck.",
            "But that said.",
            "I would go back to the themes I brought up so one is.",
            "In our presentation, you saw how much is involved in getting something to work in a product that all sorts of little details that you have to trace all the way back to.",
            "The principles of the technology as well, right?",
            "And.",
            "What what are you seeing as attendance in the multimedia communities?",
            "To not to try to take something and push it all the way to realization.",
            "There is usually some kind of community consensus that.",
            "You know, either this problem is solved or it's actually there is no way that is now going to be solved anymore than it has been, and then the entire community throws up its hands and moves on.",
            "And so there so this.",
            "Kind of trend.",
            "What it has done is that you don't.",
            "That is another reason for why.",
            "Have you not seen that many products in the arena?",
            "In my mind, majority in and of itself is not the biggest bottleneck here.",
            "I mean, for example, the audio classifiers that are described to you.",
            "They work at an efficiency of.",
            "You know, at a maximum of in the low 90s and often in the mid 18.",
            "But just because of the way we frame the problem just because of the choice of the problem, we were able to get our application to work and I think that in that sense the multimedia community needs to aim a little lower to find things.",
            "Where that type of level of maturity can still give you something.",
            "No.",
            "Having said all that scale, I think is still a very big issue.",
            "That the scale of the problem is huge.",
            "The problem itself is just the problem with the semantic gap and so forth.",
            "Those are difficult problems, and in my mind these problems will not be solved by merely harking to.",
            "More and more sophisticated machine learning techniques, and it's almost as if we wait for a machine learning technique to bubble up.",
            "In the machine learning community, then we go grab it, bring it and we try to see what we can do with it.",
            "In my mind, that's the wrong way to think.",
            "About the problems in the community, the better ways to find out what problem, which is that we should be solving and then to go out and look for what tools we could use to solve those problems.",
            "So.",
            "And if we do that, then I think we can develop algorithms that need to run on this variety of platforms.",
            "So these are all things that we need to understand at a systems level.",
            "We need to understand.",
            "How a person with a BlackBerry or person with a with a conventional TV set or person, it's or PC?",
            "How all these people can profit from?",
            "The.",
            "Platter of content that is out there and.",
            "Sam hopping on this team of changing mindsets, I feel that they have not paid sufficient attention to the issue of interfaces.",
            "And of the whole human system interaction, and I believe that if we look into that deeper.",
            "We will come back with insights that will help us go deeper into multimedia content analysis as well as develop.",
            "Much more effective interfaces.",
            "So in summary.",
            "In my mind, the bottleneck is the current mindset that we have.",
            "God.",
            "Let's first, so I had a few random things on.",
            "So what what is hot burns fastest so very hot these days is so you wonder what is most hot today in multimedia and definitely that is interface.",
            "I agree with you entirely.",
            "And basically if you look at the acceptance rate of iPhone as the normal standards, it's incredible really.",
            "Because I know so very many people who were totally amazed by the appearance of the iPhone and the but a year later, it was more than normal.",
            "So, but this is, I think this is an important consequence of what is very hot.",
            "Burns also very fast, so to say.",
            "And that has a consequence that multimedia trips over itself raised standards.",
            "Let me give you an example.",
            "I have an iPhone because in the end I am very old fashioned.",
            "I don't like gadgets and tools at all, but I thought the iPhone was really great so I bought 1 and now I'm irritated myself.",
            "But when I type with my finger it corrects me.",
            "And at some words it always connects wrong.",
            "Like it, it turns it into capitals LS, which is a Dutch word and also an abbreviation for the disease.",
            "In English.",
            "It makes it it turns into three capitals, and I've corrected this many times in Dutch.",
            "That means if so, if you, you can imagine that how often I have to type it.",
            "Yeah, but but if it is so smart and so well designed, you think, well, that could easily been implemented in the in the machine in my previous.",
            "My previous mode."
        ],
        [
            "I would never have had days set expectations so multimedia trips over itself raised the threshold or standard.",
            "And for, for example, the education from now home is boring.",
            "So I saw on John that you put education on the on the.",
            "On the list of farm.",
            "Most part in the future, maybe because of the capital, but I think the problem will increase so fast now that it will get that.",
            "I hope governments will realize that they have to really improve on educational tools and invest in it much sooner than now.",
            "Because basically if you have from this edge on you've played games and the average game time Now these days.",
            "For 50 years old is 4 hours a week and for nine years old it is 9 hours a week, so they are actually very bored by reading stuff from a book.",
            "They don't simply don't know.",
            "So education from now on is boring because we've raised the standard service.",
            "Multimedia.",
            "Comes in through the back door, so that's what I, well, we've all discussed it now.",
            "It's very personal so it's in predictable and ICT came in through the front door and so it was very predictable that people would be there that there would be resistance and so on.",
            "So you could plan very well ahead.",
            "Like with operating systems and so on.",
            "But multimedia is much more random behavior also impacting businesses.",
            "And there is an unresolved issue of who owns multimedia, is it?",
            "Is it?",
            "The one who."
        ],
        [
            "Hates it when I observe ubaya.",
            "A form from a form within the computer I will I observe your behavior is it owned by you or is it owned by the one who observes it and the Copyright as you discussed?",
            "Is unresolved only in this period of time.",
            "Copyright will be negligible, but everybody in the end will find it fair that someone who creates a real good product gets paid for it.",
            "So only in this.",
            "Thank your chance.",
            "Download as much from Pirate Bay as you can, because it will not last forever by whatever means, so to say.",
            "But the other side is also very wrong.",
            "But if you copy that, if you put over protective, it will be simply become useless inside to say so there's the debate is still governor.",
            "2nd is into business.",
            "Let me explain this one that basically if you want to start a business, I believe you have to do two things right.",
            "Not just one thing.",
            "But if first this is the Amazon route to success.",
            "And this is the gugelhupf to success.",
            "And the Amazon route to success is first, you have entirely new business model.",
            "But then if you have no technology, only a business model you can be we wiped out very easily by as you as anyone is capable of copying you.",
            "So at this point.",
            "Amazon bought a very advanced search engine.",
            "I believe it's called Alexis for 80,000,000 or so.",
            "And the and the man who sold the search engine was then moved onto the Internet Archive.",
            "But from then on they became in high tech.",
            "They were much better than the competition, so they had to do this that there not done this build of ours would have been this way because simply anyone could have copied.",
            "But then as soon as you hear well equipped large scale company you enter in a different phase and you only it's very hard to get you out of here.",
            "But here if you Google on the other hand had their very advanced search engine is really a shame.",
            "We should really model.",
            "About a good cry about it, that the paper was rejected because science as a whole is very conservative scheme.",
            "And really innovative ideas are not recognize.",
            "But anyway they gotta hire, they almost went bankrupt until they made the business invention of becoming advertising firm and basically now they're not a search engine firm that would correctly.",
            "They did not invent it, that they, they they, they, they, they, you know they let they borrowed and borrowed without pay from a company card there.",
            "Robert are OK and then they settled out of court.",
            "For how and there will almost always on disclosed amount up down?",
            "Yeah, OK, then that should be around three 200 or 300 million, but that was before they were not here.",
            "But I want the founder.",
            "I will wait until they went IPO.",
            "Other income went to bed another.",
            "OK, so I want I want to.",
            "I want to add on here because we talk about innovation.",
            "Actually the the paper Gary Gentleman Cigar R on the on.",
            "The fact that is not much new in terms of the information retrieval.",
            "Yeah, but what made them them actually successful is not just the retrieval.",
            "India is the server farms.",
            "That most effectively across all the information and other data and in scale up those things.",
            "So so is another great example of not invented here.",
            "You don't have to invent it here.",
            "Yeah, you can borrow from other companies and their reserves, amounting to fade.",
            "Well, there it is.",
            "But if you don't do it in a technological dimension and in the business dimension, and there are two great inventions there, I counted what whatever you say, but it is.",
            "I'm sure you're right, but that is the recognition together from here to there, which made them feel different surfaces.",
            "OK, let's go over multimedia and business.",
            "Because basically multimedia is.",
            "Large sweeping statement for profession nowadays is very poorly developed.",
            "Becausw, let's consider the example of search.",
            "Typically what you would have wanted for searches the preference in S of the negative events is very, very important at all for personal use, but.",
            "If you're searching for.",
            "Law or for architecture or for.",
            "And you get a negative answer.",
            "It is not there.",
            "You want to be certain is absolutely true, and this is a very hard question.",
            "I've seen zero papers on on the topic.",
            "Zero papers.",
            "For me it if you submitted to ACM, 2010, of which are what time will work in German, you are promised you get an oral presentation.",
            "My personal listing.",
            "If it makes sense.",
            "I'll explain later.",
            "We plan to submit the paper ourselves.",
            "A professional applications things were very much alike, so remember the type of images radiologist has to deal with.",
            "For the average, your average image search engine are all the same.",
            "And the image search engine will congratulate you with one group of pictures.",
            "Here's classified, namely the whole professional archive.",
            "So this, and if they wouldn't look the same, it wouldn't be much of a profession either, so that's why I that is relatively far away.",
            "And there's another thing we are coming out of the service era and the surface area is where basically the surface is treated as a servant is treated as a slave.",
            "So it's perfectly ties to measure will, it will never oppose you.",
            "It will always say this is exactly it with what.",
            "What is really needed now is the creative era over.",
            "Where if the question you raise to your mobile is not a good question, it will oppose you.",
            "And if it will say sorry, that's the wrong question.",
            "Like if you are walk.",
            "If I'm walking with home jungle through the city and I will say this one says, well wait, a second Overture did this.",
            "Now that is a real there's not a servant.",
            "There's not a service.",
            "That's what creation services, so we want.",
            "And that's of course related to request for negative answers, namely, the question is not relevant at all.",
            "And it's reasonable if the mobile is so advanced as, say, iPhones these days, then it's reasonable to expect that the mobile things and improves along.",
            "Why not and is not morally, why not, but it is, you'll soon find out if you have an industry that will halt is now will burn very fast, run final slide.",
            "In research, so the question is nearly today.",
            "Where does innovation come from?",
            "Does it come from industry while we are in the University?",
            "So we will politely say that it is the real innovation comes from University, but that's not relevant at all anymore, especially in the field of multimedia.",
            "The real doesn't come from industry.",
            "We've seen very good.",
            "Examples may be more innovative than some of University.",
            "If you if we are fair, we can always twist.",
            "In University we can always twist the rules such that we own research, but in fact we've seen today a good deal comes at the same level or higher from industry.",
            "But the real innovation, at least in large scale, comes from data owners and data owners.",
            "You own a few data and the you may own a few data and you may have access to a few data, but the real data owners are not here yet.",
            "So to say, especially not the ones which will create as soon as they realize that they are.",
            "Hands-on, they will own their own data rather than giving someone else wanted to say thank you.",
            "Posing.",
            "Like this?",
            "Anyone?",
            "Start a movie.",
            "You talk about certification.",
            "Yeah, but why do you need certification?",
            "If the users themselves use it or not, or if there?",
            "An application or.",
            "Arndale sharpish.",
            "Or anybody's certification, of course.",
            "OK, I can give you an answer, but it may take 2 minutes.",
            "Yes, so the question was why do we need this certification if.",
            "Anyways, in today's world of multimedia interconnection, users can themselves, you know, choose you look at the reviews and opinion of users.",
            "You know, and a lot of people do that indeed for hotels, and you know, resorts they go to.",
            "There is always some opinion put somewhere.",
            "Let me tell you actually, and I really want to don't want to sound too nasty by saying that, but but these are realities first.",
            "The reason for certification as a good approach is that it doesn't before, right, so you know if it is done really well, you don't have to buy a product.",
            "Or the few ones that by the 1st product as Guinea pig they don't have to go through this experience.",
            "So you will basically don't have the answer before and probably faster, right?",
            "So that that's that's really one difference, but it's not the most important difference.",
            "Let me play a little bit nasty and tell you really what the word is happening.",
            "You know, let's let's look at this like look at it like this.",
            "The world is basically now separated in a little bit of different areas.",
            "A that that are specializing in different things.",
            "For instance, I think Asia, especially China, has become the factory of the world.",
            "US is I don't know it used to be something, but I don't know what it is today.",
            "Europe.",
            "Is well, definitely, you know.",
            "Also, it's it has its niche, but if you if you really look at it at the long run from what you see is happening really.",
            "Is that a?",
            "Europe in fact, and if you look at the research, has put a lot of importance on standardization.",
            "In fact, lot of research in the field of multimedia funded by European Commission, it has one explicit question among four or five that says impact on standardization.",
            "You could debate whether it is really good or bad.",
            "Because Europe is made of many, many different nations and you know you need to have a market that is comments or you know even though there are countries that are have different cultures and different languages, you want to make sure that they they integrate and they interoperate.",
            "So sterilization.",
            "Probably that's the reason.",
            "But that's not enough.",
            "Today, whatever you do your.",
            "There will be somebody who can do it elsewhere.",
            "For cheaper.",
            "Because there are some constraints that do not exist.",
            "You know you could ask.",
            "8 years old through work, for instance, 12 hours per day is fine.",
            "There are other things you could destroy the nature if you want and turn it into cheaper products and the problem is that it's not only cheaper, it's often worse.",
            "So it's quality, which is worse than what you want to see.",
            "And at the same time.",
            "It's it.",
            "It competes because it's much cheaper.",
            "No, it's much cheaper, so people say instead of buying something that lasts for me, you know longer.",
            "Why don't I buy something?",
            "That is going to last.",
            "Much, much cheaper, but last much less so I can every month, let's say buy a new one for the same price, you know.",
            "How could you prevent the world and the society?",
            "Goes into this road, which is the road of mediocrity.",
            "Qualities go lower and lower and lower and lower.",
            "This has not only happened in multimedia, you can see that in clothing you can see that in airlines you can see that in a lot of things, right?",
            "Your absurd that also.",
            "Exactly, that's exactly what I'm getting at, right?",
            "So so so basically, really there is this big danger that we are going into.",
            "Into into a Rd where cheaper and more mediocre is taking over better and higher quality.",
            "Coming from Switzerland.",
            "I am personally very affected by this because Switzerland good or bad reasons.",
            "Has bet on quality.",
            "But of course quality has a price.",
            "And I believe, really, this is a very long introduction.",
            "Sorry to be so long, but I believe that then the way to ensure quality is certification.",
            "If you have certification, you cannot sell a product.",
            "If it doesn't or have a service that doesn't.",
            "Fulfill at least so minimal.",
            "Of quality.",
            "And so minimum requirements.",
            "You cannot sell it.",
            "That's why certification is so important.",
            "You can disagree, of course with me.",
            "I disagree with me, so I actually I. I would like to disagree with a lot of please do what is it?",
            "Question or so I also want.",
            "Shooting you.",
            "First we have to have a certification.",
            "Somebody and authority says it's OK, and then we go out and buy it.",
            "I mean, if you look at today's intent, travelers at it's the wisdom of the crowd that says this is good.",
            "This is not bad.",
            "So it's all of us that in the end, in terms of whether something will be bought or we're looking forward, satisfies our expectations of quality of experience or or not.",
            "So why do we need this certification authority?",
            "So I did.",
            "OK so I.",
            "Pull up no, no, no.",
            "I mean I mean.",
            "I hear you're just at best not what I was about to say.",
            "So I have sort of mixed feelings on.",
            "Standardization for the following reasons.",
            "I, as you know, was very intimately associated with the Impact 7 standard, right?",
            "And I saw both the strengths and weaknesses of the standardization process, particularly as practiced by the impact community.",
            "So the strength is that the standardization process provides an extraordinary kind of peer review.",
            "Which really is not seen in anything else.",
            "In in no other place do so many knowledgeable and smart people and motivate people get together in a room.",
            "And you know, really, really ripped the technology apart and then put it back together, right?",
            "So that is a great strength, right?",
            "But what I began to see, and you know, I have to apologize to Leonardo.",
            "In his absence.",
            "I already had a public bus stop with him on this once, but.",
            "Standard Edition cannot be for its own sake.",
            "And and I've been seeing a little bit of that.",
            "I believe that technology should have come to a certain level of maturity before you begin to talk about Sanderson.",
            "Otherwise, you actually begins to stifle.",
            "Other technology you don't let it develop really.",
            "You have to go now.",
            "Now now I know that MPEG has some very interesting exceptions to what I just said, I mean.",
            "MP3 was sort of invented as an afterthought by the impact community, and now is this very big thing, right?",
            "So I agree.",
            "That impact provides the Sky unique platform where technology has begun to be developed on the fly and all this, but also, for example, impact was blindsided.",
            "You know the whole age daughter series.",
            "Came out of left field and hit and back on Impact was caught flat footed by that whole thing.",
            "If I may say so.",
            "So as some water you can send and pick insider.",
            "I have how?",
            "I think the standardization should be applied with some do thought.",
            "And so when you talk about certification, first we need to fully understand exactly what it is that we're trying to certify.",
            "Second, we need to understand what the level of the maturity is.",
            "I mean, I'm seeing similar to now talk about the multimedia community.",
            "So for example, when I see efforts that now revolve around track, weird, right?",
            "So it is excellent that record has provided common data and everyone can work on it.",
            "But wait a minute sitting at Mitsubishi, right?",
            "I was able to step back and I saw wait a minute.",
            "Lot of the data that Racket is using right is not really applicable to the kinds of problems that I'm having to solve in industry.",
            "Right, so now admirably track weight has shown a pattern of going back and trying to augment datasets and trying to, you know, get new problems into the mix and all this right?",
            "But I feel that the involvement of a vibrant commercial sector is what keeps the whole thing very honest.",
            "That is why impact was such a smashing success because MPEG 2.",
            "A lot of stars aligned in the right way for impact to happen.",
            "The market was at the right place.",
            "the Cooper.",
            "The companies involved wanted to really get something done and the technology was also at the right place and all those things got put together.",
            "And of course you know Mpegs impacts unique way of doing it.",
            "Standardization.",
            "Also played a part so the mix of all those factors make maiden pick two very big success but post Impact 2.",
            "You have to step back and ask what the results of some of this declaration on the fly happened.",
            "So anyhow.",
            "To answer.",
            "So, well, let's not mix things up because there are a number of things that were said.",
            "I do not necessarily disagree, but it's maybe it was not clear what I said.",
            "So let me repeat.",
            "You know there the idea or the concept of sterilization or the concept of certification.",
            "It can be implemented wrong or right.",
            "So you know, of course, if you implement it wrongly.",
            "You know anything, any concept?",
            "You could shoot it because it can always be implemented wrongly, so there is.",
            "There is the concept and and then you have to implement it the right way.",
            "And I wouldn't really mix, because standardization and certification are not the same.",
            "Alright?",
            "So let's not mix them.",
            "Don't you know it I, I think that you raised the point and you use the word that I think that maybe you misunderstood what I mean and you maybe misunderstand what is certification.",
            "At least the way I define it.",
            "You mentioned certification authority.",
            "Certification doesn't need to be done by a certification authority.",
            "So to have a certification and this is what you saw in my slides, and this is what I always said.",
            "I didn't say you want certification authority.",
            "Indeed, that's one way.",
            "And maybe it is do passe.",
            "As they say, the French.",
            "What you need is certification.",
            "That's what America, Lego advocating for, and there are many, many ways.",
            "To have the certification.",
            "One way which is.",
            "I don't really even qualify that certification, but if you want it, it could have been indeed that social networks they take around, right?",
            "It's it's a way.",
            "It's a very loose way, not for my taste.",
            "It's called certification, but it's a way.",
            "Let's, let's say, for the purpose of discussion, that is, to it's a way of certification.",
            "Right, we comedian trivia, bad example.",
            "Media, yes, Wikipedia.",
            "Maybe it's a.",
            "It's a it's a better way of implementing it so.",
            "So let's not mix two things.",
            "One is the concept that you want to certify something.",
            "And you want to really have it.",
            "You don't go to discussion groups and you know find out you want to have when you buy something or when you subscribe to Tom.",
            "Those who actually sell this, they they, they tell you, not that you have to as a customer go and look what they tell you.",
            "You could always do that too, but you are as a seller you go and you say you know, hey, this is a product I'm selling.",
            "And this is fulfilling this, this, this this this certificates?",
            "They have received these certificates.",
            "Now how exactly the process of?",
            "Having this certificate is concerned it's a it's another debate.",
            "So what your sketch is fine.",
            "Old World outlook window.",
            "How do you get to that?",
            "So maybe you can answer that question.",
            "How can you get this certificate?",
            "This is or whatever.",
            "Well you need.",
            "Definitely a process for that.",
            "As I said, you know I I don't personally think that the process of just having the into in the jungle and you know just it appears you know by itself, it's.",
            "It's the easy way to do it, and it's maybe not even reliable enough.",
            "It can be.",
            "It can be you need.",
            "You need a mechanism that is trustable.",
            "For sure.",
            "And you have a mechanism that is verifiable.",
            "For sure.",
            "How it is implemented?",
            "That's the whole debate, right?",
            "I'm I'm not here to to give you the answer for that, because you know, they're all debate is now.",
            "What is the best way to find in the field of multimedia?",
            "Because this has happened in other fields in the field of multimedia.",
            "How can we come up with an efficient way of having certificates or it's application mechanisms?",
            "That are not do it.",
            "You know it creates a lot of overhead and and inefficiencies that that multimedia cannot afford, right?",
            "You cannot wait six months to to get your certificate right here, so there must be.",
            "There must be ways to do it.",
            "Quick please.",
            "It is a remarkable track for data, yes.",
            "Please contact so can you come and live with you know what I was talking about.",
            "There was that it started.",
            "That's why I put the qualify.",
            "That record has been consistently augmenting its data set.",
            "You know each year you see that there is some fresh data added.",
            "Right, and so there is a little more added and so forth.",
            "Yes, so that's so.",
            "That's fine, but but all I'm saying though, is that you can still see papers being published where people are not necessarily using the latest data.",
            "So so so.",
            "So what I'm saying therefore is.",
            "That whenever you have this sort of her.",
            "This sort of you can say consortium like activity.",
            "There is an unfortunate side effect of this kind.",
            "I don't pretend to know exactly what one can even do about it, but I'm just saying that it does exist.",
            "I can point to very concrete instances.",
            "And I mean I had to reject papers on that ground where you know they're basically still using an older data set when they should be using the newer data set and so forth.",
            "So my intention is not.",
            "Do just.",
            "Directly attack track with or anything, but I will point out that.",
            "Depending on which part of the multimedia industry you are in track with, May or may not cover exactly what it is you're trying to do.",
            "The question of data, so it's also tasks.",
            "Yes no, no.",
            "I mean I.",
            "Right, that's right.",
            "So so I mean.",
            "So.",
            "I mean, I'm referring to that when I say data set.",
            "I mean, I'm including the whole thing, I'm just saying.",
            "Love that I think the the the the video track I don't want tonight it's it's you know it's a value another hand that it's you know.",
            "If we don't leave without carefully without you know if we are not.",
            "In innovative enough that we actually fall into the trap that we actually created date of our own.",
            "Good feel, good feeling.",
            "You know it's basically for us to come up with some good papers that data against that data set an off and that is that is so small compared to the data we have people can get from from the web and I think this this this morning of my talk someone asked me the evaluation and they close system evaluation and you can only bring in this much value.",
            "And the the the the the real evaluation even further research should go before the open system or the.",
            "What is the?",
            "Are you playing in?",
            "New features and new new new new steps that actually make their make this system kind of self learning or self improve.",
            "Instead of saying I I feel this curve I beat this algorithm.",
            "The numbers might be a bit too possibly biased when you transfer the technology to open domain.",
            "Yes, it's because it's closed.",
            "You can very easily measure progress over the years.",
            "Well, even though progress is any will bring any benefit to the operation.",
            "Relevant also for the open domain.",
            "Yeah, but that's the full value.",
            "Actually, there you know this is this this whole point of.",
            "How to evaluate an whatever it is is extremely critical now.",
            "I don't really personally think that there is a universal solution to that.",
            "OK, it depends on so many things, but it's not because there is no universal solution available is not a good reason enough to not to do it.",
            "You see that that's almost a tendency that people are extreme, right?",
            "You know, epic, good, and pick back.",
            "Like anything in life, there are good and bad sides on everything.",
            "Sorry, I was hoping I didn't come across that way.",
            "No, no I I'm thinking general right that that people just of course anything you do you have good and bad sides in it and they they they they the important decision probably is.",
            "What are the part that are useful to take advantage of and what are the things that are less maybe efficiently done and maybe have another way of having it so so going back to the to the to the track we door.",
            "Any other evaluation campaign?",
            "I think each of them they serve a purpose.",
            "But beyond that purpose.",
            "It's dangerous to extend it, and I believe that you know.",
            "Yeah, you know.",
            "This is, I call it experimentally driven.",
            "You call the data driven and maybe there are some other names.",
            "This is this is definitely one way to go.",
            "However, there are a lot of also applications in multimedia services and products.",
            "You cannot do it.",
            "Is this this kind of data driven?",
            "You know, because not everything is also breakfast, right?",
            "So there are cases where you cannot do that right?",
            "And and in this case you know you did it again.",
            "You know another way.",
            "So I like the introduction of competition.",
            "So basically, what is a competition competition is that people agree to do research on the same data set.",
            "For that for for an instance on the same purpose.",
            "And if you look for instance at the tracking algorithms, I've been looking into lately that everybody carefully picks the algorithm it's suited for.",
            "Its so sorry, the data set to one data set, sometimes even two datasets.",
            "Or its own algorithm.",
            "So and even very serious journals except this practice.",
            "And there are in all the tracking papers, there are very, very few which explicitly name the limits of their algorithm.",
            "So then I prefer if that is the practice which was the practice, then I also in search, then I prefer competition because you agreed to do research on the same data set for the same purpose.",
            "But if you take that as a whole, but then I.",
            "Notice the door back in my research group that people start to focus on the result of the competition and they had this small margin of improvement over the other student and I completely lost the purpose of doing research, namely to understand why this is the case.",
            "So the Y has gone out of the window and the number improvement increases.",
            "Whereas so, but all of this that so by now, here's another advice.",
            "If you write a good white paper why it works or why it doesn't work, you get more attention than improving the incremental competition data, so to say.",
            "And to complete spectrum.",
            "That very few papers are hitting these days.",
            "All I've trained it on data set a of the BBC and I've applied it on CNN data.",
            "That was a real serious test.",
            "I know case probably knows from hard how many papers there are in this respect, but it is.",
            "But this is the real the real Sammy.",
            "Say me open, but sufficiently controllable that you can measure progress, so to say.",
            "I I I I'm 100% agree with you is we come back to the point that I was making on the impact standard.",
            "I think we even send that completely stopped after impact two.",
            "I think.",
            "I think everybody will say they downgrade job but they continued on the door.",
            "More research into it and started define impact 7 and they start even defined.",
            "How do you?",
            "How do you describe color histograms?",
            "And then we all know those things are not present.",
            "The novel present content well, so so you know it was in the very early stage of content within the retrieval why you want to put it another.",
            "So I think I think again, I'm not against the standard.",
            "What I'm saying is that you lossed direction.",
            "Really forgot what you started.",
            "So what's the original idea started with?",
            "So come back to generalize better, better than in the in the in the research community of people.",
            "Now you know trade the conference is a computation so so they they they start to think about the research is for the sake of publications.",
            "And that's where the danger come in.",
            "I think it's the same thing when when the impact community it just keep looking for what what next thing to standardize and so have the impact to that is that you end up four of them back four and even before intercourse closed and under any relocation they.",
            "Not at 7, and knowing that only the universities and research, research and communities is doing that.",
            "Really, before the things even came out of the batteries, you started standardizing and so today who's who knows what antisemitism is about and who use it.",
            "Because this is, this is a good debate and I think that we have to stop.",
            "Let me see.",
            "For the sake of also completeness, and I think that it's important to know so so you know there has been a lot of a lot of allegations about impact, whether it be good or not.",
            "Let me just tell you, I'm not a defendant, but you know, let me just set a few facts straight.",
            "A the most successful impact standard.",
            "Is MPEG 4 video.",
            "If you measure it in terms of codecs and stuff so you know, I think it's unfair to say.",
            "That after impact two, there hasn't been anything that has been good.",
            "And in fact, a number of respected companies on this panel.",
            "They are involved.",
            "If you are so so so strong.",
            "Opinionated about that.",
            "Convince your companies to stop contributing to it.",
            "Pick seven, however, that's correct, which is.",
            "I think it is.",
            "It's not a secret that then pick Seven has been.",
            "There has been a mistake whether.",
            "After that then pick 21 has been or not?",
            "Well Peter debate.",
            "I don't think it's not today decay, is it?",
            "It's important to talk about it, but you know, again, this goes again back to what I said.",
            "You take the whole thing and I could do one thing is bad or the whole thing is good.",
            "It's not like this.",
            "You know there are things.",
            "That in MPEG 2.",
            "Some, at least on this panel set was very good standard impact.",
            "Two is full of junk profiles that nobody is using, but there are one or two profiles in impact tool that are used and everybody says it is very successful.",
            "In fact, MPEG four, I think just because of lack of knowledge.",
            "Another thing people think it is it is not as successor picked too, but actually it is more.",
            "There are more MPEG four implementations.",
            "Then there were in Pic 2.",
            "Epic is good."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, well, Alan asked me to prepare some slides that I I I around the need, possibility and the bottlenecks in multimedia.",
                    "label": 1
                },
                {
                    "sent": "Now to transfer it just so broadly hopping.",
                    "label": 0
                },
                {
                    "sent": "So I decided to take advantage of that.",
                    "label": 0
                },
                {
                    "sent": "I come from industry and I myself has has has done the transfer from doing pure research to to industry research and from industry research too.",
                    "label": 0
                },
                {
                    "sent": "And from just technology development to marketing, basically too.",
                    "label": 0
                },
                {
                    "sent": "I'm going through this entire cycle off from technology to part.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I thought I will.",
                    "label": 0
                },
                {
                    "sent": "Share with you some of the sort that automobile loadings an.",
                    "label": 0
                },
                {
                    "sent": "Then see how we apply this to to to what we do in multimedia technology transfer.",
                    "label": 0
                },
                {
                    "sent": "So first, let's look at the the 30 years of PC or personal computing revolution, computing revolution.",
                    "label": 0
                },
                {
                    "sent": "And that itself is a process of development hard nearing and that create intellectual property.",
                    "label": 0
                },
                {
                    "sent": "Technologies, and then it's a it is coming to a adoptation adoption process.",
                    "label": 0
                },
                {
                    "sent": "No, so those those technology then got to bring consumer benefit.",
                    "label": 0
                },
                {
                    "sent": "So what I'm saying here is, you know for what we have seen today, the Revolution or the progression they progress we have done.",
                    "label": 0
                },
                {
                    "sent": "We have seen in the last 30 some years are around.",
                    "label": 0
                },
                {
                    "sent": "Personal computing is actually the process of technology development and adopt adoption process and so start from a PC when IBM.",
                    "label": 0
                },
                {
                    "sent": "Came out of this PC architecture and mothers after see saw opportunity and that Bill Gates come out and say I want to put a PC on every desktop in every home IBM look located Microsoft Lofty this small company.",
                    "label": 0
                },
                {
                    "sent": "What are you talking about?",
                    "label": 0
                },
                {
                    "sent": "Why people do that PC in every house in every home in every office.",
                    "label": 0
                },
                {
                    "sent": "So it's another mistake IBM made.",
                    "label": 0
                },
                {
                    "sent": "It was never really.",
                    "label": 0
                },
                {
                    "sent": "Saw that PC is going to take off and they never saw the software to sell.",
                    "label": 0
                },
                {
                    "sent": "Will be sold separately from Howard so they said OK why don't we also see this little software to aces Startup Company as Microsoft so?",
                    "label": 0
                },
                {
                    "sent": "They are so when they first come up with it, it's not a graphic interface, so all you can do is you do a spreadsheet and you do what processor?",
                    "label": 0
                },
                {
                    "sent": "So, but that's compared to the mainframe is already a huge step forward to bring the PC into people's work workspace.",
                    "label": 0
                },
                {
                    "sent": "In this case, is a productivity tool.",
                    "label": 0
                },
                {
                    "sent": "So an so computer can be used by people with little training instead of a scientist.",
                    "label": 0
                },
                {
                    "sent": "Those really technology guys in the in the in the in the big machine rooms.",
                    "label": 0
                },
                {
                    "sent": "So then the graphic interface came out.",
                    "label": 0
                },
                {
                    "sent": "Miles came up and land came up.",
                    "label": 0
                },
                {
                    "sent": "It just happens to be all those three things actually all happen in Silicon Valley, so this is there.",
                    "label": 0
                },
                {
                    "sent": "Is this place called zero spot?",
                    "label": 0
                },
                {
                    "sent": "There is this University called the Stanford's, where the mountain invented with graphic interface invited where the local area network invented once this happened.",
                    "label": 0
                },
                {
                    "sent": "Computer now is connected together.",
                    "label": 0
                },
                {
                    "sent": "PC Connect together.",
                    "label": 0
                },
                {
                    "sent": "The power can be as strong as a super mainframe machine computer and then the graphic interface rated liberalize the PC.",
                    "label": 0
                },
                {
                    "sent": "From from, you know professional training users into everybody.",
                    "label": 0
                },
                {
                    "sent": "So now secretaries can use.",
                    "label": 0
                },
                {
                    "sent": "Computers without fear destroy the computer and without fear not understanding that the programming logic behind that.",
                    "label": 0
                },
                {
                    "sent": "So then the office application really become the Main Street.",
                    "label": 0
                },
                {
                    "sent": "So that's the time Microsoft Word, Microsoft Office become mainstream.",
                    "label": 0
                },
                {
                    "sent": "So again, is the technology and technology enabled?",
                    "label": 0
                },
                {
                    "sent": "The application and the occasion come back push technology further.",
                    "label": 0
                },
                {
                    "sent": "Well, you know what happened in the in the 90s?",
                    "label": 0
                },
                {
                    "sent": "That is where the Internet came in and they are.",
                    "label": 0
                },
                {
                    "sent": "The XML HTML came in and that's the time that PC now become really a a more communication media than just computing media.",
                    "label": 0
                },
                {
                    "sent": "And it's become.",
                    "label": 0
                },
                {
                    "sent": "Something immediate and.",
                    "label": 0
                },
                {
                    "sent": "So now you see email client the web browsing, so that's just those two killers actually.",
                    "label": 0
                },
                {
                    "sent": "Mayday Mayday, the PC.",
                    "label": 0
                },
                {
                    "sent": "Penetrating into every home so that is where we are today about client plus cloud and the software plus service and thought.",
                    "label": 0
                },
                {
                    "sent": "We were moving the PC from productivity from communication to creative creativity to personal.",
                    "label": 0
                },
                {
                    "sent": "Social media.",
                    "label": 0
                },
                {
                    "sent": "So that's just what I really want to say.",
                    "label": 0
                },
                {
                    "sent": "Here is, you know, just technology alone will not bring value to the customer.",
                    "label": 0
                },
                {
                    "sent": "Is the technology that enabled applications that brings better to the consumers?",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "But if our company to succeed of our industry succeed of our society to succeed in innovation, you need to people doing different job.",
                    "label": 0
                },
                {
                    "sent": "So in Microsoft, the ballpark of Oronde is actually on the product development side.",
                    "label": 0
                },
                {
                    "sent": "We have over 20,000.",
                    "label": 0
                },
                {
                    "sent": "Years working on software that can be shipped the next month, next year, next two years.",
                    "label": 0
                },
                {
                    "sent": "And then we have something called Microsoft Research.",
                    "label": 0
                },
                {
                    "sent": "You know, if we look at the maximum usage in mission and vision statement, the number one music is not to help company employees.",
                    "label": 0
                },
                {
                    "sent": "It is to elevate the state of art.",
                    "label": 0
                },
                {
                    "sent": "And the second one is to transfer technology to help the company.",
                    "label": 0
                },
                {
                    "sent": "So that's basically they work on things 5 to 10 years out.",
                    "label": 0
                },
                {
                    "sent": "And but so that's very much like people here in the universities.",
                    "label": 0
                },
                {
                    "sent": "So, but how?",
                    "label": 0
                },
                {
                    "sent": "How do we track, you know, come transform, those technology came out of basic research into our product.",
                    "label": 0
                },
                {
                    "sent": "There is another layer, another group in between we call product laughs last.",
                    "label": 0
                },
                {
                    "sent": "Alexander, which I personally personally manage in Beijing and the the.",
                    "label": 0
                },
                {
                    "sent": "Various other lots in various places in in Microsoft so you you need people you need to have this completed and so those who work on ideas, basic ideas, those who just look at it tomorrow.",
                    "label": 0
                },
                {
                    "sent": "You know today's products, those who look at tomorrow's problem so you need you need this layers and you need this steps and you need the people and people and in this three different steps.",
                    "label": 0
                },
                {
                    "sent": "You need people with different skills, different mindset.",
                    "label": 0
                },
                {
                    "sent": "I really emphasize about different mindset the.",
                    "label": 0
                },
                {
                    "sent": "Then is what we see.",
                    "label": 0
                },
                {
                    "sent": "And you have to think about long-term amounts of is a good example here is we, I think myself wondering is persistent is continue invest.",
                    "label": 0
                },
                {
                    "sent": "You know, version one will not fly aversion to not fly versus three.",
                    "label": 0
                },
                {
                    "sent": "OK, Windows 10 years.",
                    "label": 0
                },
                {
                    "sent": "And for releases Office Word.",
                    "label": 0
                },
                {
                    "sent": "11 years, 9 releases and Excel 10 years 5 releases.",
                    "label": 0
                },
                {
                    "sent": "So it just look at long-term when you look at the product product pipeline today everybody everybody.",
                    "label": 0
                },
                {
                    "sent": "Most people think Microsoft only have two part wrong.",
                    "label": 0
                },
                {
                    "sent": "Can Microsoft get the Windows right at the office, right?",
                    "label": 0
                },
                {
                    "sent": "Got Windows Server right?",
                    "label": 0
                },
                {
                    "sent": "Gotta Xbox right and now I think we are.",
                    "label": 0
                },
                {
                    "sent": "We finally also get it.",
                    "label": 0
                },
                {
                    "sent": "Search right.",
                    "label": 0
                },
                {
                    "sent": "So they are, but you see it's it's one is consistent long-term investment and it's baking vessel.",
                    "label": 0
                },
                {
                    "sent": "So today you also look at, you know, here on the left side you know Microsoft is in.",
                    "label": 0
                },
                {
                    "sent": "It is investing in thermal vertical application areas, education, healthcare and.",
                    "label": 0
                },
                {
                    "sent": "Core and technical computing and robotics and all those things.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Another aspect you know we talk about, at least on the bottom money.",
                    "label": 0
                },
                {
                    "sent": "A lot of investment and I know I I surprise this this this slide for you to ask for more money for multimedia research, and I, you know, I I should have put another number is.",
                    "label": 0
                },
                {
                    "sent": "The the any revenue or the number of employees and to see to to show even more that is a company that Microsoft invest a lot on R&D and per I mean in terms of the total revenue percentage in terms of number of dollars per employee and.",
                    "label": 0
                },
                {
                    "sent": "The company would argue there more innovative.",
                    "label": 0
                },
                {
                    "sent": "And but it is on the on the side.",
                    "label": 0
                },
                {
                    "sent": "You know the numbers and then not and there.",
                    "label": 0
                },
                {
                    "sent": "Remember last year at White 09 for Microsoft fiscal Year start from July 1st?",
                    "label": 0
                },
                {
                    "sent": "Basically for lot of white there and I was.",
                    "label": 0
                },
                {
                    "sent": "July there, 2008 which is.",
                    "label": 0
                },
                {
                    "sent": "That crap when the crisis started and we still put a 9.1 billion dollar into R&D and this year.",
                    "label": 0
                },
                {
                    "sent": "Start from July this year weight is increased to 1.5 so it does require a lot of money.",
                    "label": 0
                },
                {
                    "sent": "For company to continue.",
                    "label": 0
                },
                {
                    "sent": "Lead in their own field.",
                    "label": 0
                },
                {
                    "sent": "So the key point.",
                    "label": 0
                },
                {
                    "sent": "I like to say you know any technology or knowledge transfer is hot and take time and of course to take along a lot of money.",
                    "label": 0
                },
                {
                    "sent": "And thank God you to product and services.",
                    "label": 0
                },
                {
                    "sent": "Is is is usually comes along way so.",
                    "label": 0
                },
                {
                    "sent": "And those of you who you know.",
                    "label": 0
                },
                {
                    "sent": "That was my work.",
                    "label": 0
                },
                {
                    "sent": "You have to work, but I made myself aim is that video thumbnail, which I did.",
                    "label": 0
                },
                {
                    "sent": "You know 17 years ago and sorry just to see how old I am.",
                    "label": 0
                },
                {
                    "sent": "Finally, in the making into mainstream is in the in the Bing search engine and images similarity search and in search engine.",
                    "label": 0
                },
                {
                    "sent": "So in terms of the Articuno mass market, the pervasive use you finally see the light of it.",
                    "label": 0
                },
                {
                    "sent": "And although the technology itself has been here and there.",
                    "label": 0
                },
                {
                    "sent": "Add method and they are the content based video editing.",
                    "label": 0
                },
                {
                    "sent": "Yes we use some of that there and we use it in the Microsoft Media Center and other places.",
                    "label": 0
                },
                {
                    "sent": "But really mass market daily use.",
                    "label": 0
                },
                {
                    "sent": "Compass search engine.",
                    "label": 0
                },
                {
                    "sent": "And there.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "There are.",
                    "label": 0
                },
                {
                    "sent": "Also think about it.",
                    "label": 0
                },
                {
                    "sent": "Take take a lot of time to find the right opportunity.",
                    "label": 0
                },
                {
                    "sent": "Not not.",
                    "label": 0
                },
                {
                    "sent": "Not to mention technology itself.",
                    "label": 0
                },
                {
                    "sent": "Need time to mature and need a market to provide a lot of feedback.",
                    "label": 0
                },
                {
                    "sent": "And another thing I would like to point out here and share with you the case.",
                    "label": 0
                },
                {
                    "sent": "I think I'm qualified to say that because I consider myself as a researcher and download research and today I'm a AA executive.",
                    "label": 0
                },
                {
                    "sent": "Really look at the bottom line on top line.",
                    "label": 0
                },
                {
                    "sent": "The company that is you have anything came up.",
                    "label": 0
                },
                {
                    "sent": "You have to make money for the company and so then I also run the incubation team and but my incubation team is very different from people in the University.",
                    "label": 0
                },
                {
                    "sent": "They may think you know I have a technology like to look.",
                    "label": 0
                },
                {
                    "sent": "Where can I use this technology?",
                    "label": 0
                },
                {
                    "sent": "So you basically have a heart, have a hammer?",
                    "label": 0
                },
                {
                    "sent": "You're looking for Neil and but in my case now I look at the what market?",
                    "label": 0
                },
                {
                    "sent": "We want in two to three years.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "Come back to see what technology that I can.",
                    "label": 0
                },
                {
                    "sent": "Use in this three, 2, three years timeframe and then build a product or service felt in that intent at the starting point is very different from where I used to be and.",
                    "label": 0
                },
                {
                    "sent": "It's a it's from market from consumer, so I'm not saying you should all go to marketing to do market study.",
                    "label": 0
                },
                {
                    "sent": "My my point is you'll never underestimate the complexity of market.",
                    "label": 0
                },
                {
                    "sent": "And I think it today.",
                    "label": 0
                },
                {
                    "sent": "The talk we heard earlier on the year.",
                    "label": 0
                },
                {
                    "sent": "Quality of experience is actually another reflection.",
                    "label": 0
                },
                {
                    "sent": "If you have always think about using mathematical models to describe the signal to noise ratio.",
                    "label": 0
                },
                {
                    "sent": "Work on the wrong target.",
                    "label": 0
                },
                {
                    "sent": "Really, you want to raise the quality of experience.",
                    "label": 0
                },
                {
                    "sent": "And is that just a few?",
                    "label": 0
                },
                {
                    "sent": "Equations of numerical matrix.",
                    "label": 0
                },
                {
                    "sent": "So also I think if you look at the success of iPod and.",
                    "label": 0
                },
                {
                    "sent": "You, I mean people give a lot of credit to Apple.",
                    "label": 0
                },
                {
                    "sent": "Say you know they are.",
                    "label": 0
                },
                {
                    "sent": "Very innovative but MP3 player has been there.",
                    "label": 0
                },
                {
                    "sent": "Much longer than iPod, and that's why you know, I I I. Apple was forced to pay 1 billion dollar to this small Singapore company called Creative Labs.",
                    "label": 0
                },
                {
                    "sent": "And because they those are companies that really this, this is the company that really invented a lot of those MP MP3 players.",
                    "label": 0
                },
                {
                    "sent": "But it is.",
                    "label": 0
                },
                {
                    "sent": "The whole ecosystem is the iTunes.",
                    "label": 0
                },
                {
                    "sent": "That's the system that made the iPod success.",
                    "label": 0
                },
                {
                    "sent": "Successful, so that allowed to the iPhone 6S.",
                    "label": 0
                },
                {
                    "sent": "So the success of a product or service.",
                    "label": 0
                },
                {
                    "sent": "Is far beyond just enough.",
                    "label": 0
                },
                {
                    "sent": "So I'd like to stop here.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Just remember this.",
                    "label": 0
                },
                {
                    "sent": "If you have any questions reserved for the shooter, couple minutes.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to be able to hold the so as long as you did, because I'm sure that you have the whole Microsoft activity.",
                    "label": 0
                },
                {
                    "sent": "I have a much more modest.",
                    "label": 0
                },
                {
                    "sent": "Sphere of activities.",
                    "label": 0
                },
                {
                    "sent": "So I I will be.",
                    "label": 0
                },
                {
                    "sent": "I will be much shorter too.",
                    "label": 0
                },
                {
                    "sent": "First, yeah.",
                    "label": 0
                },
                {
                    "sent": "What actually Alan asked us?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Not as wait as he he asked us a he pretended he did.",
                    "label": 0
                },
                {
                    "sent": "He actually asked us two slides.",
                    "label": 0
                },
                {
                    "sent": "And he said talk about needs, possibilities and bottlenecks, which is 3 topics.",
                    "label": 0
                },
                {
                    "sent": "With emphasis on bottlenecks, so I try to manage Anna mixing a little bit Nissan bottlenecks and one slide and then possibilities, maybe 1 second and I do not definitely pretend that this is covering the whole area.",
                    "label": 0
                },
                {
                    "sent": "I'm just looking at it from a very small or window.",
                    "label": 0
                },
                {
                    "sent": "With narrow not very very narrow view.",
                    "label": 0
                },
                {
                    "sent": "So what are the bottlenecks?",
                    "label": 0
                },
                {
                    "sent": "In multimedia knowledge and technology transfer, I suppose by knowledge you also meant included, so I know that my good member here doesn't like Killer applications, but.",
                    "label": 0
                },
                {
                    "sent": "Or maybe we don't agree on definition of killer applications, but I think that's really one of the reasons.",
                    "label": 0
                },
                {
                    "sent": "This transfer of technology I know how into into industry and into market has been limited in multimedia has been in fact because there have not been enough killer applications or now actually you correctly mentioned that it's not because somebody put the technology that could store in MP3.",
                    "label": 0
                },
                {
                    "sent": "Audio, it was actually because there was iPod, iPhone and iTunes together and a few other things that made actually the success.",
                    "label": 0
                },
                {
                    "sent": "Of of Apple and I will I will call it like a good killer app.",
                    "label": 0
                },
                {
                    "sent": "Although I fully agree also that that it's not the technology that made it a killer app, it was something else.",
                    "label": 0
                },
                {
                    "sent": "A social media also, although it remains to be seen.",
                    "label": 0
                },
                {
                    "sent": "Apparently Facebook and YouTube both now make money.",
                    "label": 0
                },
                {
                    "sent": "But social media also, in my opinion is a good a good example.",
                    "label": 0
                },
                {
                    "sent": "Maybe search also definitely one 3D cinema maybe?",
                    "label": 1
                },
                {
                    "sent": "Surveillance also these are areas where we have potential or maybe have had already experienced some killer application.",
                    "label": 0
                },
                {
                    "sent": "What we need more?",
                    "label": 0
                },
                {
                    "sent": "We really need more now.",
                    "label": 1
                },
                {
                    "sent": "Maybe people don't like killer application because maybe it's a little bit overwhelming and exaggerated.",
                    "label": 0
                },
                {
                    "sent": "It doesn't kill anybody, yeah, or it doesn't kill any other applications, but.",
                    "label": 0
                },
                {
                    "sent": "But we need more applications and we really don't.",
                    "label": 0
                },
                {
                    "sent": "Maybe one of the reasons that is related to that, and this is my second point, is the lack of maturity of multimedia tools.",
                    "label": 1
                },
                {
                    "sent": "It is true.",
                    "label": 0
                },
                {
                    "sent": "It's a fact that multimedia by many, many measures is not mature enough.",
                    "label": 0
                },
                {
                    "sent": "We heard Arnold.",
                    "label": 0
                },
                {
                    "sent": "He mentioned 100 years before the between the.",
                    "label": 0
                },
                {
                    "sent": "WhatsApp and pump and and the first locomotive.",
                    "label": 0
                },
                {
                    "sent": "We are not 100 years yet through multimedia, so it needs a little bit more time to become mature, but.",
                    "label": 0
                },
                {
                    "sent": "Let's not get this perceived.",
                    "label": 0
                },
                {
                    "sent": "Lack of maturity.",
                    "label": 0
                },
                {
                    "sent": "Stop us.",
                    "label": 0
                },
                {
                    "sent": "From going to marketplace.",
                    "label": 0
                },
                {
                    "sent": "A good example of that is Picasa by many many measures.",
                    "label": 0
                },
                {
                    "sent": "The face detection that is used in Picasa.",
                    "label": 0
                },
                {
                    "sent": "I'm not even sure if ACM Multimedia.",
                    "label": 0
                },
                {
                    "sent": "If somebody had, you know, submitted a paper on the face detection that is on Picasa, ACM multimedia would have accepted it because it was maybe even rejected.",
                    "label": 0
                },
                {
                    "sent": "We know don't know that right?",
                    "label": 0
                },
                {
                    "sent": "Somebody has to trace it back.",
                    "label": 0
                },
                {
                    "sent": "But Google Founders paper to cigar.",
                    "label": 0
                },
                {
                    "sent": "That's another very good example.",
                    "label": 0
                },
                {
                    "sent": "That's another good example.",
                    "label": 0
                },
                {
                    "sent": "I didn't know about so, but but you know the bottom line is that.",
                    "label": 0
                },
                {
                    "sent": "You don't have to wait until your technology, in your opinion, is perfect.",
                    "label": 0
                },
                {
                    "sent": "For the same reason technology is not all, sometimes even less than mature technologies, in your opinion are very good.",
                    "label": 0
                },
                {
                    "sent": "And very needed.",
                    "label": 0
                },
                {
                    "sent": "To try it.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "The last bottleneck I would like to talk about is is.",
                    "label": 0
                },
                {
                    "sent": "Legal complexities that are around IP.",
                    "label": 0
                },
                {
                    "sent": "In fact, one of the reasons probably that we haven't seen as much.",
                    "label": 0
                },
                {
                    "sent": "Transfer of technology.",
                    "label": 0
                },
                {
                    "sent": "Into the marketplace has been IPR and multimedia.",
                    "label": 0
                },
                {
                    "sent": "It's a very special case because there are actually 3 type of legal and intellectual property problems.",
                    "label": 0
                },
                {
                    "sent": "One is like anywhere else, it's the patents and licensing and things like that.",
                    "label": 0
                },
                {
                    "sent": "The second one is that multimedia is about content, right?",
                    "label": 0
                },
                {
                    "sent": "Media is content and content is not free as opposed to what?",
                    "label": 0
                },
                {
                    "sent": "Many think and there are Copyright issues.",
                    "label": 0
                },
                {
                    "sent": "There are ownership issues and this is that makes it even more complex than just technology, intellectual property and on top of that we are now witnessing a third problem in multimedia peering and this is the question of trust and the question of privacy.",
                    "label": 0
                },
                {
                    "sent": "So there is a lot of you know issues that are preventing deployment of.",
                    "label": 0
                },
                {
                    "sent": "Of the of the technologies and transfer of technologies, and they know how into marketplace.",
                    "label": 0
                },
                {
                    "sent": "Only because of that.",
                    "label": 0
                },
                {
                    "sent": "A lot of people of course, are enjoying this.",
                    "label": 0
                },
                {
                    "sent": "More lawyers are having a great time.",
                    "label": 0
                },
                {
                    "sent": "Maybe that, but you know.",
                    "label": 0
                },
                {
                    "sent": "That's a side effect and.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, this remains remains the bottleneck.",
                    "label": 0
                },
                {
                    "sent": "Now, what are the possibilities to improve?",
                    "label": 0
                },
                {
                    "sent": "Again, please have in mind I'm really talking from a very very narrow window, and definitely none of this is meant to be to be universally applicable.",
                    "label": 0
                },
                {
                    "sent": "I believe that more and more we have the capability and we should have what people refer to as experimentally driven research in multimedia.",
                    "label": 0
                },
                {
                    "sent": "And we had some good examples.",
                    "label": 0
                },
                {
                    "sent": "Price by the way, by you with the two billion images.",
                    "label": 0
                },
                {
                    "sent": "Well at least you have done 80 million.",
                    "label": 0
                },
                {
                    "sent": "I'm, you know, and these kind of things should really happen more.",
                    "label": 0
                },
                {
                    "sent": "All day to do it, but you're right, yeah, data driven.",
                    "label": 0
                },
                {
                    "sent": "You call it yeah I called it experimentally driven, but it's definitely whatever they name the essences.",
                    "label": 0
                },
                {
                    "sent": "You want to have it and actually you know it has.",
                    "label": 0
                },
                {
                    "sent": "Two good.",
                    "label": 0
                },
                {
                    "sent": "Outcomes if you do it, one is that it is going to identify actually what the real problems are.",
                    "label": 0
                },
                {
                    "sent": "She will be astonished you will discover maybe the problem is not very.",
                    "label": 0
                },
                {
                    "sent": "You think it?",
                    "label": 0
                },
                {
                    "sent": "Is it somewhere else?",
                    "label": 0
                },
                {
                    "sent": "It does give you even knew challenges to you or to others.",
                    "label": 0
                },
                {
                    "sent": "And also it's always nice.",
                    "label": 0
                },
                {
                    "sent": "It gives you visibility and a showcase right?",
                    "label": 0
                },
                {
                    "sent": "How can you know if if you have 100,000 and million people using something you have developed and you are benefiting as you are designing it?",
                    "label": 0
                },
                {
                    "sent": "From there you know, use and they are benefiting from you.",
                    "label": 0
                },
                {
                    "sent": "What kind of better if you do a good job?",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                },
                {
                    "sent": "What kind of better visibility would you would like to have this perfect?",
                    "label": 0
                },
                {
                    "sent": "On the same.",
                    "label": 0
                },
                {
                    "sent": "You know length, but but maybe it is much more.",
                    "label": 0
                },
                {
                    "sent": "It's a limited way.",
                    "label": 0
                },
                {
                    "sent": "I think that there are and there should be more and more evaluation campaigns.",
                    "label": 0
                },
                {
                    "sent": "Actually, I have one disable this video clip 2010 so this kind of initiatives are very, very important, because these are basically what.",
                    "label": 0
                },
                {
                    "sent": "Low US to do, you know, compare and and if it is done well to to move forward and benefit from different strengths of different players.",
                    "label": 0
                },
                {
                    "sent": "And it is a technology transfer to.",
                    "label": 0
                },
                {
                    "sent": "It is a knowledge transfer to from one researcher to another, and from these researchers to industry.",
                    "label": 0
                },
                {
                    "sent": "Same is true for standardization I. Sterilization actually has been quite successful in some sectors of multimedia like coding, compression, and things like that.",
                    "label": 0
                },
                {
                    "sent": "A, but not as much in others like search like a data mining like annotation and many many others an I think that there is still a lot of room.",
                    "label": 0
                },
                {
                    "sent": "For that, it's not just the stabilization for the K, for the sake of standardization, because otherwise you know evaluation companies do the same, we don't need that, but you really need in this jungle of multimedia to have some sort of, you know at least interoperability, if not for the users, at least for product.",
                    "label": 0
                },
                {
                    "sent": "Builders and those who make products and services.",
                    "label": 0
                },
                {
                    "sent": "Because otherwise you have to do everything right.",
                    "label": 0
                },
                {
                    "sent": "Then systems have become very complex.",
                    "label": 0
                },
                {
                    "sent": "This brings me actually to something that I think it's extremely important now for the success of multimedia, and this is the problem of certification.",
                    "label": 0
                },
                {
                    "sent": "You know, when people do electronic devices like PC's, I don't know.",
                    "label": 0
                },
                {
                    "sent": "Microphones, telephone, telephones etc.",
                    "label": 0
                },
                {
                    "sent": "They certified right for electromagnetic compatibility for right and why not to have certification mechanisms.",
                    "label": 0
                },
                {
                    "sent": "In terms of quality.",
                    "label": 0
                },
                {
                    "sent": "As measured by something that has been standardized that people can do, why not to have certification for some features, for instance, of some specific sector search engines or or others?",
                    "label": 0
                },
                {
                    "sent": "Really, you you offer a product or a service, you will have labels on them, right?",
                    "label": 0
                },
                {
                    "sent": "That that gives you a from different metrics point of view what how well you are actually fulfilling these.",
                    "label": 0
                },
                {
                    "sent": "What you are you're promising you are your focus.",
                    "label": 0
                },
                {
                    "sent": "So I want to stop here.",
                    "label": 0
                },
                {
                    "sent": "None of this is really.",
                    "label": 0
                },
                {
                    "sent": "And by itself it's a.",
                    "label": 0
                },
                {
                    "sent": "It's maybe a discussion and maybe we can discuss some of these aspects together.",
                    "label": 0
                },
                {
                    "sent": "If there is some time left to discuss.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what I ended up doing was I. I merged those two things into my one talks.",
                    "label": 0
                },
                {
                    "sent": "I'll just.",
                    "label": 0
                },
                {
                    "sent": "Go back to the slides I showed you earlier today, but have a different emphasis.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "If I could name if I could name a single bottleneck.",
                    "label": 0
                },
                {
                    "sent": "I think that single bottleneck is just the mindset that the community appears to have.",
                    "label": 0
                },
                {
                    "sent": "If we back off from that mindset.",
                    "label": 0
                },
                {
                    "sent": "And think about what sorts of applications we can solve with currently available technology and what we can do further out.",
                    "label": 0
                },
                {
                    "sent": "And then work backwards from that.",
                    "label": 0
                },
                {
                    "sent": "Then I believe we can actually do some very interesting work.",
                    "label": 0
                },
                {
                    "sent": "So let me give you a concrete example of that that.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So I showed you today the work on.",
                    "label": 0
                },
                {
                    "sent": "Sports highlights extraction using an unusual event detection framework in time series.",
                    "label": 0
                },
                {
                    "sent": "It turned out that we were able to take that type of idea and then turn around and apply to.",
                    "label": 0
                },
                {
                    "sent": "Monitoring the health of an air conditioner.",
                    "label": 0
                },
                {
                    "sent": "By just modeling the normal behavior of the air conditioner and then seeing deviation from the normal behavior.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "My belief is that the multimedia community has developed some very interesting set of tools.",
                    "label": 0
                },
                {
                    "sent": "Other multimedia in general, the multimedia content analysis provides a very nice.",
                    "label": 0
                },
                {
                    "sent": "A testbed or workbench for all sorts of very interesting art techniques.",
                    "label": 0
                },
                {
                    "sent": "From math, mathematics, and engineering.",
                    "label": 0
                },
                {
                    "sent": "So, um.",
                    "label": 0
                },
                {
                    "sent": "So I would say that one thing is that it's just the Community needs to step back and think more in terms of.",
                    "label": 0
                },
                {
                    "sent": "What kinds of applications could we conceive?",
                    "label": 0
                },
                {
                    "sent": "So that is my thinking on the bottleneck.",
                    "label": 0
                },
                {
                    "sent": "Of the single biggest bottleneck.",
                    "label": 0
                },
                {
                    "sent": "But that said.",
                    "label": 0
                },
                {
                    "sent": "I would go back to the themes I brought up so one is.",
                    "label": 0
                },
                {
                    "sent": "In our presentation, you saw how much is involved in getting something to work in a product that all sorts of little details that you have to trace all the way back to.",
                    "label": 0
                },
                {
                    "sent": "The principles of the technology as well, right?",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "What what are you seeing as attendance in the multimedia communities?",
                    "label": 0
                },
                {
                    "sent": "To not to try to take something and push it all the way to realization.",
                    "label": 0
                },
                {
                    "sent": "There is usually some kind of community consensus that.",
                    "label": 0
                },
                {
                    "sent": "You know, either this problem is solved or it's actually there is no way that is now going to be solved anymore than it has been, and then the entire community throws up its hands and moves on.",
                    "label": 0
                },
                {
                    "sent": "And so there so this.",
                    "label": 0
                },
                {
                    "sent": "Kind of trend.",
                    "label": 0
                },
                {
                    "sent": "What it has done is that you don't.",
                    "label": 0
                },
                {
                    "sent": "That is another reason for why.",
                    "label": 0
                },
                {
                    "sent": "Have you not seen that many products in the arena?",
                    "label": 0
                },
                {
                    "sent": "In my mind, majority in and of itself is not the biggest bottleneck here.",
                    "label": 0
                },
                {
                    "sent": "I mean, for example, the audio classifiers that are described to you.",
                    "label": 0
                },
                {
                    "sent": "They work at an efficiency of.",
                    "label": 0
                },
                {
                    "sent": "You know, at a maximum of in the low 90s and often in the mid 18.",
                    "label": 0
                },
                {
                    "sent": "But just because of the way we frame the problem just because of the choice of the problem, we were able to get our application to work and I think that in that sense the multimedia community needs to aim a little lower to find things.",
                    "label": 0
                },
                {
                    "sent": "Where that type of level of maturity can still give you something.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Having said all that scale, I think is still a very big issue.",
                    "label": 0
                },
                {
                    "sent": "That the scale of the problem is huge.",
                    "label": 0
                },
                {
                    "sent": "The problem itself is just the problem with the semantic gap and so forth.",
                    "label": 0
                },
                {
                    "sent": "Those are difficult problems, and in my mind these problems will not be solved by merely harking to.",
                    "label": 0
                },
                {
                    "sent": "More and more sophisticated machine learning techniques, and it's almost as if we wait for a machine learning technique to bubble up.",
                    "label": 0
                },
                {
                    "sent": "In the machine learning community, then we go grab it, bring it and we try to see what we can do with it.",
                    "label": 0
                },
                {
                    "sent": "In my mind, that's the wrong way to think.",
                    "label": 0
                },
                {
                    "sent": "About the problems in the community, the better ways to find out what problem, which is that we should be solving and then to go out and look for what tools we could use to solve those problems.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "And if we do that, then I think we can develop algorithms that need to run on this variety of platforms.",
                    "label": 0
                },
                {
                    "sent": "So these are all things that we need to understand at a systems level.",
                    "label": 0
                },
                {
                    "sent": "We need to understand.",
                    "label": 0
                },
                {
                    "sent": "How a person with a BlackBerry or person with a with a conventional TV set or person, it's or PC?",
                    "label": 0
                },
                {
                    "sent": "How all these people can profit from?",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Platter of content that is out there and.",
                    "label": 0
                },
                {
                    "sent": "Sam hopping on this team of changing mindsets, I feel that they have not paid sufficient attention to the issue of interfaces.",
                    "label": 0
                },
                {
                    "sent": "And of the whole human system interaction, and I believe that if we look into that deeper.",
                    "label": 0
                },
                {
                    "sent": "We will come back with insights that will help us go deeper into multimedia content analysis as well as develop.",
                    "label": 0
                },
                {
                    "sent": "Much more effective interfaces.",
                    "label": 0
                },
                {
                    "sent": "So in summary.",
                    "label": 0
                },
                {
                    "sent": "In my mind, the bottleneck is the current mindset that we have.",
                    "label": 0
                },
                {
                    "sent": "God.",
                    "label": 0
                },
                {
                    "sent": "Let's first, so I had a few random things on.",
                    "label": 0
                },
                {
                    "sent": "So what what is hot burns fastest so very hot these days is so you wonder what is most hot today in multimedia and definitely that is interface.",
                    "label": 0
                },
                {
                    "sent": "I agree with you entirely.",
                    "label": 0
                },
                {
                    "sent": "And basically if you look at the acceptance rate of iPhone as the normal standards, it's incredible really.",
                    "label": 0
                },
                {
                    "sent": "Because I know so very many people who were totally amazed by the appearance of the iPhone and the but a year later, it was more than normal.",
                    "label": 0
                },
                {
                    "sent": "So, but this is, I think this is an important consequence of what is very hot.",
                    "label": 0
                },
                {
                    "sent": "Burns also very fast, so to say.",
                    "label": 0
                },
                {
                    "sent": "And that has a consequence that multimedia trips over itself raised standards.",
                    "label": 0
                },
                {
                    "sent": "Let me give you an example.",
                    "label": 0
                },
                {
                    "sent": "I have an iPhone because in the end I am very old fashioned.",
                    "label": 0
                },
                {
                    "sent": "I don't like gadgets and tools at all, but I thought the iPhone was really great so I bought 1 and now I'm irritated myself.",
                    "label": 0
                },
                {
                    "sent": "But when I type with my finger it corrects me.",
                    "label": 0
                },
                {
                    "sent": "And at some words it always connects wrong.",
                    "label": 0
                },
                {
                    "sent": "Like it, it turns it into capitals LS, which is a Dutch word and also an abbreviation for the disease.",
                    "label": 0
                },
                {
                    "sent": "In English.",
                    "label": 0
                },
                {
                    "sent": "It makes it it turns into three capitals, and I've corrected this many times in Dutch.",
                    "label": 0
                },
                {
                    "sent": "That means if so, if you, you can imagine that how often I have to type it.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but but if it is so smart and so well designed, you think, well, that could easily been implemented in the in the machine in my previous.",
                    "label": 0
                },
                {
                    "sent": "My previous mode.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would never have had days set expectations so multimedia trips over itself raised the threshold or standard.",
                    "label": 0
                },
                {
                    "sent": "And for, for example, the education from now home is boring.",
                    "label": 0
                },
                {
                    "sent": "So I saw on John that you put education on the on the.",
                    "label": 0
                },
                {
                    "sent": "On the list of farm.",
                    "label": 0
                },
                {
                    "sent": "Most part in the future, maybe because of the capital, but I think the problem will increase so fast now that it will get that.",
                    "label": 0
                },
                {
                    "sent": "I hope governments will realize that they have to really improve on educational tools and invest in it much sooner than now.",
                    "label": 0
                },
                {
                    "sent": "Because basically if you have from this edge on you've played games and the average game time Now these days.",
                    "label": 0
                },
                {
                    "sent": "For 50 years old is 4 hours a week and for nine years old it is 9 hours a week, so they are actually very bored by reading stuff from a book.",
                    "label": 0
                },
                {
                    "sent": "They don't simply don't know.",
                    "label": 0
                },
                {
                    "sent": "So education from now on is boring because we've raised the standard service.",
                    "label": 0
                },
                {
                    "sent": "Multimedia.",
                    "label": 0
                },
                {
                    "sent": "Comes in through the back door, so that's what I, well, we've all discussed it now.",
                    "label": 0
                },
                {
                    "sent": "It's very personal so it's in predictable and ICT came in through the front door and so it was very predictable that people would be there that there would be resistance and so on.",
                    "label": 0
                },
                {
                    "sent": "So you could plan very well ahead.",
                    "label": 0
                },
                {
                    "sent": "Like with operating systems and so on.",
                    "label": 0
                },
                {
                    "sent": "But multimedia is much more random behavior also impacting businesses.",
                    "label": 0
                },
                {
                    "sent": "And there is an unresolved issue of who owns multimedia, is it?",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "The one who.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hates it when I observe ubaya.",
                    "label": 0
                },
                {
                    "sent": "A form from a form within the computer I will I observe your behavior is it owned by you or is it owned by the one who observes it and the Copyright as you discussed?",
                    "label": 0
                },
                {
                    "sent": "Is unresolved only in this period of time.",
                    "label": 0
                },
                {
                    "sent": "Copyright will be negligible, but everybody in the end will find it fair that someone who creates a real good product gets paid for it.",
                    "label": 0
                },
                {
                    "sent": "So only in this.",
                    "label": 0
                },
                {
                    "sent": "Thank your chance.",
                    "label": 0
                },
                {
                    "sent": "Download as much from Pirate Bay as you can, because it will not last forever by whatever means, so to say.",
                    "label": 0
                },
                {
                    "sent": "But the other side is also very wrong.",
                    "label": 0
                },
                {
                    "sent": "But if you copy that, if you put over protective, it will be simply become useless inside to say so there's the debate is still governor.",
                    "label": 0
                },
                {
                    "sent": "2nd is into business.",
                    "label": 0
                },
                {
                    "sent": "Let me explain this one that basically if you want to start a business, I believe you have to do two things right.",
                    "label": 0
                },
                {
                    "sent": "Not just one thing.",
                    "label": 0
                },
                {
                    "sent": "But if first this is the Amazon route to success.",
                    "label": 0
                },
                {
                    "sent": "And this is the gugelhupf to success.",
                    "label": 0
                },
                {
                    "sent": "And the Amazon route to success is first, you have entirely new business model.",
                    "label": 0
                },
                {
                    "sent": "But then if you have no technology, only a business model you can be we wiped out very easily by as you as anyone is capable of copying you.",
                    "label": 0
                },
                {
                    "sent": "So at this point.",
                    "label": 0
                },
                {
                    "sent": "Amazon bought a very advanced search engine.",
                    "label": 0
                },
                {
                    "sent": "I believe it's called Alexis for 80,000,000 or so.",
                    "label": 0
                },
                {
                    "sent": "And the and the man who sold the search engine was then moved onto the Internet Archive.",
                    "label": 0
                },
                {
                    "sent": "But from then on they became in high tech.",
                    "label": 0
                },
                {
                    "sent": "They were much better than the competition, so they had to do this that there not done this build of ours would have been this way because simply anyone could have copied.",
                    "label": 0
                },
                {
                    "sent": "But then as soon as you hear well equipped large scale company you enter in a different phase and you only it's very hard to get you out of here.",
                    "label": 0
                },
                {
                    "sent": "But here if you Google on the other hand had their very advanced search engine is really a shame.",
                    "label": 0
                },
                {
                    "sent": "We should really model.",
                    "label": 0
                },
                {
                    "sent": "About a good cry about it, that the paper was rejected because science as a whole is very conservative scheme.",
                    "label": 0
                },
                {
                    "sent": "And really innovative ideas are not recognize.",
                    "label": 0
                },
                {
                    "sent": "But anyway they gotta hire, they almost went bankrupt until they made the business invention of becoming advertising firm and basically now they're not a search engine firm that would correctly.",
                    "label": 0
                },
                {
                    "sent": "They did not invent it, that they, they they, they, they, they, you know they let they borrowed and borrowed without pay from a company card there.",
                    "label": 0
                },
                {
                    "sent": "Robert are OK and then they settled out of court.",
                    "label": 0
                },
                {
                    "sent": "For how and there will almost always on disclosed amount up down?",
                    "label": 0
                },
                {
                    "sent": "Yeah, OK, then that should be around three 200 or 300 million, but that was before they were not here.",
                    "label": 0
                },
                {
                    "sent": "But I want the founder.",
                    "label": 0
                },
                {
                    "sent": "I will wait until they went IPO.",
                    "label": 0
                },
                {
                    "sent": "Other income went to bed another.",
                    "label": 0
                },
                {
                    "sent": "OK, so I want I want to.",
                    "label": 0
                },
                {
                    "sent": "I want to add on here because we talk about innovation.",
                    "label": 0
                },
                {
                    "sent": "Actually the the paper Gary Gentleman Cigar R on the on.",
                    "label": 0
                },
                {
                    "sent": "The fact that is not much new in terms of the information retrieval.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but what made them them actually successful is not just the retrieval.",
                    "label": 0
                },
                {
                    "sent": "India is the server farms.",
                    "label": 0
                },
                {
                    "sent": "That most effectively across all the information and other data and in scale up those things.",
                    "label": 0
                },
                {
                    "sent": "So so is another great example of not invented here.",
                    "label": 0
                },
                {
                    "sent": "You don't have to invent it here.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you can borrow from other companies and their reserves, amounting to fade.",
                    "label": 0
                },
                {
                    "sent": "Well, there it is.",
                    "label": 0
                },
                {
                    "sent": "But if you don't do it in a technological dimension and in the business dimension, and there are two great inventions there, I counted what whatever you say, but it is.",
                    "label": 0
                },
                {
                    "sent": "I'm sure you're right, but that is the recognition together from here to there, which made them feel different surfaces.",
                    "label": 0
                },
                {
                    "sent": "OK, let's go over multimedia and business.",
                    "label": 0
                },
                {
                    "sent": "Because basically multimedia is.",
                    "label": 0
                },
                {
                    "sent": "Large sweeping statement for profession nowadays is very poorly developed.",
                    "label": 0
                },
                {
                    "sent": "Becausw, let's consider the example of search.",
                    "label": 0
                },
                {
                    "sent": "Typically what you would have wanted for searches the preference in S of the negative events is very, very important at all for personal use, but.",
                    "label": 0
                },
                {
                    "sent": "If you're searching for.",
                    "label": 0
                },
                {
                    "sent": "Law or for architecture or for.",
                    "label": 0
                },
                {
                    "sent": "And you get a negative answer.",
                    "label": 0
                },
                {
                    "sent": "It is not there.",
                    "label": 0
                },
                {
                    "sent": "You want to be certain is absolutely true, and this is a very hard question.",
                    "label": 0
                },
                {
                    "sent": "I've seen zero papers on on the topic.",
                    "label": 0
                },
                {
                    "sent": "Zero papers.",
                    "label": 0
                },
                {
                    "sent": "For me it if you submitted to ACM, 2010, of which are what time will work in German, you are promised you get an oral presentation.",
                    "label": 0
                },
                {
                    "sent": "My personal listing.",
                    "label": 0
                },
                {
                    "sent": "If it makes sense.",
                    "label": 0
                },
                {
                    "sent": "I'll explain later.",
                    "label": 0
                },
                {
                    "sent": "We plan to submit the paper ourselves.",
                    "label": 0
                },
                {
                    "sent": "A professional applications things were very much alike, so remember the type of images radiologist has to deal with.",
                    "label": 0
                },
                {
                    "sent": "For the average, your average image search engine are all the same.",
                    "label": 0
                },
                {
                    "sent": "And the image search engine will congratulate you with one group of pictures.",
                    "label": 0
                },
                {
                    "sent": "Here's classified, namely the whole professional archive.",
                    "label": 0
                },
                {
                    "sent": "So this, and if they wouldn't look the same, it wouldn't be much of a profession either, so that's why I that is relatively far away.",
                    "label": 0
                },
                {
                    "sent": "And there's another thing we are coming out of the service era and the surface area is where basically the surface is treated as a servant is treated as a slave.",
                    "label": 0
                },
                {
                    "sent": "So it's perfectly ties to measure will, it will never oppose you.",
                    "label": 0
                },
                {
                    "sent": "It will always say this is exactly it with what.",
                    "label": 0
                },
                {
                    "sent": "What is really needed now is the creative era over.",
                    "label": 0
                },
                {
                    "sent": "Where if the question you raise to your mobile is not a good question, it will oppose you.",
                    "label": 0
                },
                {
                    "sent": "And if it will say sorry, that's the wrong question.",
                    "label": 0
                },
                {
                    "sent": "Like if you are walk.",
                    "label": 0
                },
                {
                    "sent": "If I'm walking with home jungle through the city and I will say this one says, well wait, a second Overture did this.",
                    "label": 0
                },
                {
                    "sent": "Now that is a real there's not a servant.",
                    "label": 0
                },
                {
                    "sent": "There's not a service.",
                    "label": 0
                },
                {
                    "sent": "That's what creation services, so we want.",
                    "label": 0
                },
                {
                    "sent": "And that's of course related to request for negative answers, namely, the question is not relevant at all.",
                    "label": 0
                },
                {
                    "sent": "And it's reasonable if the mobile is so advanced as, say, iPhones these days, then it's reasonable to expect that the mobile things and improves along.",
                    "label": 0
                },
                {
                    "sent": "Why not and is not morally, why not, but it is, you'll soon find out if you have an industry that will halt is now will burn very fast, run final slide.",
                    "label": 0
                },
                {
                    "sent": "In research, so the question is nearly today.",
                    "label": 0
                },
                {
                    "sent": "Where does innovation come from?",
                    "label": 0
                },
                {
                    "sent": "Does it come from industry while we are in the University?",
                    "label": 0
                },
                {
                    "sent": "So we will politely say that it is the real innovation comes from University, but that's not relevant at all anymore, especially in the field of multimedia.",
                    "label": 0
                },
                {
                    "sent": "The real doesn't come from industry.",
                    "label": 0
                },
                {
                    "sent": "We've seen very good.",
                    "label": 0
                },
                {
                    "sent": "Examples may be more innovative than some of University.",
                    "label": 0
                },
                {
                    "sent": "If you if we are fair, we can always twist.",
                    "label": 0
                },
                {
                    "sent": "In University we can always twist the rules such that we own research, but in fact we've seen today a good deal comes at the same level or higher from industry.",
                    "label": 0
                },
                {
                    "sent": "But the real innovation, at least in large scale, comes from data owners and data owners.",
                    "label": 0
                },
                {
                    "sent": "You own a few data and the you may own a few data and you may have access to a few data, but the real data owners are not here yet.",
                    "label": 0
                },
                {
                    "sent": "So to say, especially not the ones which will create as soon as they realize that they are.",
                    "label": 0
                },
                {
                    "sent": "Hands-on, they will own their own data rather than giving someone else wanted to say thank you.",
                    "label": 0
                },
                {
                    "sent": "Posing.",
                    "label": 0
                },
                {
                    "sent": "Like this?",
                    "label": 0
                },
                {
                    "sent": "Anyone?",
                    "label": 0
                },
                {
                    "sent": "Start a movie.",
                    "label": 0
                },
                {
                    "sent": "You talk about certification.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but why do you need certification?",
                    "label": 0
                },
                {
                    "sent": "If the users themselves use it or not, or if there?",
                    "label": 0
                },
                {
                    "sent": "An application or.",
                    "label": 0
                },
                {
                    "sent": "Arndale sharpish.",
                    "label": 0
                },
                {
                    "sent": "Or anybody's certification, of course.",
                    "label": 1
                },
                {
                    "sent": "OK, I can give you an answer, but it may take 2 minutes.",
                    "label": 0
                },
                {
                    "sent": "Yes, so the question was why do we need this certification if.",
                    "label": 0
                },
                {
                    "sent": "Anyways, in today's world of multimedia interconnection, users can themselves, you know, choose you look at the reviews and opinion of users.",
                    "label": 0
                },
                {
                    "sent": "You know, and a lot of people do that indeed for hotels, and you know, resorts they go to.",
                    "label": 0
                },
                {
                    "sent": "There is always some opinion put somewhere.",
                    "label": 0
                },
                {
                    "sent": "Let me tell you actually, and I really want to don't want to sound too nasty by saying that, but but these are realities first.",
                    "label": 0
                },
                {
                    "sent": "The reason for certification as a good approach is that it doesn't before, right, so you know if it is done really well, you don't have to buy a product.",
                    "label": 0
                },
                {
                    "sent": "Or the few ones that by the 1st product as Guinea pig they don't have to go through this experience.",
                    "label": 0
                },
                {
                    "sent": "So you will basically don't have the answer before and probably faster, right?",
                    "label": 0
                },
                {
                    "sent": "So that that's that's really one difference, but it's not the most important difference.",
                    "label": 0
                },
                {
                    "sent": "Let me play a little bit nasty and tell you really what the word is happening.",
                    "label": 0
                },
                {
                    "sent": "You know, let's let's look at this like look at it like this.",
                    "label": 0
                },
                {
                    "sent": "The world is basically now separated in a little bit of different areas.",
                    "label": 0
                },
                {
                    "sent": "A that that are specializing in different things.",
                    "label": 0
                },
                {
                    "sent": "For instance, I think Asia, especially China, has become the factory of the world.",
                    "label": 0
                },
                {
                    "sent": "US is I don't know it used to be something, but I don't know what it is today.",
                    "label": 0
                },
                {
                    "sent": "Europe.",
                    "label": 0
                },
                {
                    "sent": "Is well, definitely, you know.",
                    "label": 0
                },
                {
                    "sent": "Also, it's it has its niche, but if you if you really look at it at the long run from what you see is happening really.",
                    "label": 0
                },
                {
                    "sent": "Is that a?",
                    "label": 0
                },
                {
                    "sent": "Europe in fact, and if you look at the research, has put a lot of importance on standardization.",
                    "label": 0
                },
                {
                    "sent": "In fact, lot of research in the field of multimedia funded by European Commission, it has one explicit question among four or five that says impact on standardization.",
                    "label": 0
                },
                {
                    "sent": "You could debate whether it is really good or bad.",
                    "label": 0
                },
                {
                    "sent": "Because Europe is made of many, many different nations and you know you need to have a market that is comments or you know even though there are countries that are have different cultures and different languages, you want to make sure that they they integrate and they interoperate.",
                    "label": 0
                },
                {
                    "sent": "So sterilization.",
                    "label": 0
                },
                {
                    "sent": "Probably that's the reason.",
                    "label": 0
                },
                {
                    "sent": "But that's not enough.",
                    "label": 0
                },
                {
                    "sent": "Today, whatever you do your.",
                    "label": 0
                },
                {
                    "sent": "There will be somebody who can do it elsewhere.",
                    "label": 0
                },
                {
                    "sent": "For cheaper.",
                    "label": 0
                },
                {
                    "sent": "Because there are some constraints that do not exist.",
                    "label": 0
                },
                {
                    "sent": "You know you could ask.",
                    "label": 0
                },
                {
                    "sent": "8 years old through work, for instance, 12 hours per day is fine.",
                    "label": 0
                },
                {
                    "sent": "There are other things you could destroy the nature if you want and turn it into cheaper products and the problem is that it's not only cheaper, it's often worse.",
                    "label": 0
                },
                {
                    "sent": "So it's quality, which is worse than what you want to see.",
                    "label": 0
                },
                {
                    "sent": "And at the same time.",
                    "label": 0
                },
                {
                    "sent": "It's it.",
                    "label": 0
                },
                {
                    "sent": "It competes because it's much cheaper.",
                    "label": 0
                },
                {
                    "sent": "No, it's much cheaper, so people say instead of buying something that lasts for me, you know longer.",
                    "label": 0
                },
                {
                    "sent": "Why don't I buy something?",
                    "label": 0
                },
                {
                    "sent": "That is going to last.",
                    "label": 0
                },
                {
                    "sent": "Much, much cheaper, but last much less so I can every month, let's say buy a new one for the same price, you know.",
                    "label": 0
                },
                {
                    "sent": "How could you prevent the world and the society?",
                    "label": 0
                },
                {
                    "sent": "Goes into this road, which is the road of mediocrity.",
                    "label": 0
                },
                {
                    "sent": "Qualities go lower and lower and lower and lower.",
                    "label": 0
                },
                {
                    "sent": "This has not only happened in multimedia, you can see that in clothing you can see that in airlines you can see that in a lot of things, right?",
                    "label": 0
                },
                {
                    "sent": "Your absurd that also.",
                    "label": 0
                },
                {
                    "sent": "Exactly, that's exactly what I'm getting at, right?",
                    "label": 0
                },
                {
                    "sent": "So so so basically, really there is this big danger that we are going into.",
                    "label": 0
                },
                {
                    "sent": "Into into a Rd where cheaper and more mediocre is taking over better and higher quality.",
                    "label": 0
                },
                {
                    "sent": "Coming from Switzerland.",
                    "label": 0
                },
                {
                    "sent": "I am personally very affected by this because Switzerland good or bad reasons.",
                    "label": 0
                },
                {
                    "sent": "Has bet on quality.",
                    "label": 0
                },
                {
                    "sent": "But of course quality has a price.",
                    "label": 0
                },
                {
                    "sent": "And I believe, really, this is a very long introduction.",
                    "label": 0
                },
                {
                    "sent": "Sorry to be so long, but I believe that then the way to ensure quality is certification.",
                    "label": 0
                },
                {
                    "sent": "If you have certification, you cannot sell a product.",
                    "label": 0
                },
                {
                    "sent": "If it doesn't or have a service that doesn't.",
                    "label": 0
                },
                {
                    "sent": "Fulfill at least so minimal.",
                    "label": 0
                },
                {
                    "sent": "Of quality.",
                    "label": 0
                },
                {
                    "sent": "And so minimum requirements.",
                    "label": 0
                },
                {
                    "sent": "You cannot sell it.",
                    "label": 0
                },
                {
                    "sent": "That's why certification is so important.",
                    "label": 0
                },
                {
                    "sent": "You can disagree, of course with me.",
                    "label": 0
                },
                {
                    "sent": "I disagree with me, so I actually I. I would like to disagree with a lot of please do what is it?",
                    "label": 0
                },
                {
                    "sent": "Question or so I also want.",
                    "label": 0
                },
                {
                    "sent": "Shooting you.",
                    "label": 0
                },
                {
                    "sent": "First we have to have a certification.",
                    "label": 0
                },
                {
                    "sent": "Somebody and authority says it's OK, and then we go out and buy it.",
                    "label": 0
                },
                {
                    "sent": "I mean, if you look at today's intent, travelers at it's the wisdom of the crowd that says this is good.",
                    "label": 0
                },
                {
                    "sent": "This is not bad.",
                    "label": 0
                },
                {
                    "sent": "So it's all of us that in the end, in terms of whether something will be bought or we're looking forward, satisfies our expectations of quality of experience or or not.",
                    "label": 0
                },
                {
                    "sent": "So why do we need this certification authority?",
                    "label": 0
                },
                {
                    "sent": "So I did.",
                    "label": 0
                },
                {
                    "sent": "OK so I.",
                    "label": 0
                },
                {
                    "sent": "Pull up no, no, no.",
                    "label": 0
                },
                {
                    "sent": "I mean I mean.",
                    "label": 0
                },
                {
                    "sent": "I hear you're just at best not what I was about to say.",
                    "label": 0
                },
                {
                    "sent": "So I have sort of mixed feelings on.",
                    "label": 0
                },
                {
                    "sent": "Standardization for the following reasons.",
                    "label": 0
                },
                {
                    "sent": "I, as you know, was very intimately associated with the Impact 7 standard, right?",
                    "label": 0
                },
                {
                    "sent": "And I saw both the strengths and weaknesses of the standardization process, particularly as practiced by the impact community.",
                    "label": 0
                },
                {
                    "sent": "So the strength is that the standardization process provides an extraordinary kind of peer review.",
                    "label": 0
                },
                {
                    "sent": "Which really is not seen in anything else.",
                    "label": 0
                },
                {
                    "sent": "In in no other place do so many knowledgeable and smart people and motivate people get together in a room.",
                    "label": 0
                },
                {
                    "sent": "And you know, really, really ripped the technology apart and then put it back together, right?",
                    "label": 0
                },
                {
                    "sent": "So that is a great strength, right?",
                    "label": 0
                },
                {
                    "sent": "But what I began to see, and you know, I have to apologize to Leonardo.",
                    "label": 0
                },
                {
                    "sent": "In his absence.",
                    "label": 0
                },
                {
                    "sent": "I already had a public bus stop with him on this once, but.",
                    "label": 0
                },
                {
                    "sent": "Standard Edition cannot be for its own sake.",
                    "label": 0
                },
                {
                    "sent": "And and I've been seeing a little bit of that.",
                    "label": 0
                },
                {
                    "sent": "I believe that technology should have come to a certain level of maturity before you begin to talk about Sanderson.",
                    "label": 0
                },
                {
                    "sent": "Otherwise, you actually begins to stifle.",
                    "label": 0
                },
                {
                    "sent": "Other technology you don't let it develop really.",
                    "label": 0
                },
                {
                    "sent": "You have to go now.",
                    "label": 0
                },
                {
                    "sent": "Now now I know that MPEG has some very interesting exceptions to what I just said, I mean.",
                    "label": 0
                },
                {
                    "sent": "MP3 was sort of invented as an afterthought by the impact community, and now is this very big thing, right?",
                    "label": 0
                },
                {
                    "sent": "So I agree.",
                    "label": 0
                },
                {
                    "sent": "That impact provides the Sky unique platform where technology has begun to be developed on the fly and all this, but also, for example, impact was blindsided.",
                    "label": 0
                },
                {
                    "sent": "You know the whole age daughter series.",
                    "label": 0
                },
                {
                    "sent": "Came out of left field and hit and back on Impact was caught flat footed by that whole thing.",
                    "label": 0
                },
                {
                    "sent": "If I may say so.",
                    "label": 0
                },
                {
                    "sent": "So as some water you can send and pick insider.",
                    "label": 0
                },
                {
                    "sent": "I have how?",
                    "label": 0
                },
                {
                    "sent": "I think the standardization should be applied with some do thought.",
                    "label": 0
                },
                {
                    "sent": "And so when you talk about certification, first we need to fully understand exactly what it is that we're trying to certify.",
                    "label": 0
                },
                {
                    "sent": "Second, we need to understand what the level of the maturity is.",
                    "label": 0
                },
                {
                    "sent": "I mean, I'm seeing similar to now talk about the multimedia community.",
                    "label": 0
                },
                {
                    "sent": "So for example, when I see efforts that now revolve around track, weird, right?",
                    "label": 0
                },
                {
                    "sent": "So it is excellent that record has provided common data and everyone can work on it.",
                    "label": 0
                },
                {
                    "sent": "But wait a minute sitting at Mitsubishi, right?",
                    "label": 0
                },
                {
                    "sent": "I was able to step back and I saw wait a minute.",
                    "label": 0
                },
                {
                    "sent": "Lot of the data that Racket is using right is not really applicable to the kinds of problems that I'm having to solve in industry.",
                    "label": 0
                },
                {
                    "sent": "Right, so now admirably track weight has shown a pattern of going back and trying to augment datasets and trying to, you know, get new problems into the mix and all this right?",
                    "label": 0
                },
                {
                    "sent": "But I feel that the involvement of a vibrant commercial sector is what keeps the whole thing very honest.",
                    "label": 0
                },
                {
                    "sent": "That is why impact was such a smashing success because MPEG 2.",
                    "label": 0
                },
                {
                    "sent": "A lot of stars aligned in the right way for impact to happen.",
                    "label": 0
                },
                {
                    "sent": "The market was at the right place.",
                    "label": 0
                },
                {
                    "sent": "the Cooper.",
                    "label": 0
                },
                {
                    "sent": "The companies involved wanted to really get something done and the technology was also at the right place and all those things got put together.",
                    "label": 1
                },
                {
                    "sent": "And of course you know Mpegs impacts unique way of doing it.",
                    "label": 0
                },
                {
                    "sent": "Standardization.",
                    "label": 0
                },
                {
                    "sent": "Also played a part so the mix of all those factors make maiden pick two very big success but post Impact 2.",
                    "label": 0
                },
                {
                    "sent": "You have to step back and ask what the results of some of this declaration on the fly happened.",
                    "label": 0
                },
                {
                    "sent": "So anyhow.",
                    "label": 0
                },
                {
                    "sent": "To answer.",
                    "label": 0
                },
                {
                    "sent": "So, well, let's not mix things up because there are a number of things that were said.",
                    "label": 0
                },
                {
                    "sent": "I do not necessarily disagree, but it's maybe it was not clear what I said.",
                    "label": 0
                },
                {
                    "sent": "So let me repeat.",
                    "label": 0
                },
                {
                    "sent": "You know there the idea or the concept of sterilization or the concept of certification.",
                    "label": 0
                },
                {
                    "sent": "It can be implemented wrong or right.",
                    "label": 0
                },
                {
                    "sent": "So you know, of course, if you implement it wrongly.",
                    "label": 0
                },
                {
                    "sent": "You know anything, any concept?",
                    "label": 0
                },
                {
                    "sent": "You could shoot it because it can always be implemented wrongly, so there is.",
                    "label": 0
                },
                {
                    "sent": "There is the concept and and then you have to implement it the right way.",
                    "label": 0
                },
                {
                    "sent": "And I wouldn't really mix, because standardization and certification are not the same.",
                    "label": 0
                },
                {
                    "sent": "Alright?",
                    "label": 0
                },
                {
                    "sent": "So let's not mix them.",
                    "label": 0
                },
                {
                    "sent": "Don't you know it I, I think that you raised the point and you use the word that I think that maybe you misunderstood what I mean and you maybe misunderstand what is certification.",
                    "label": 0
                },
                {
                    "sent": "At least the way I define it.",
                    "label": 0
                },
                {
                    "sent": "You mentioned certification authority.",
                    "label": 0
                },
                {
                    "sent": "Certification doesn't need to be done by a certification authority.",
                    "label": 0
                },
                {
                    "sent": "So to have a certification and this is what you saw in my slides, and this is what I always said.",
                    "label": 0
                },
                {
                    "sent": "I didn't say you want certification authority.",
                    "label": 0
                },
                {
                    "sent": "Indeed, that's one way.",
                    "label": 0
                },
                {
                    "sent": "And maybe it is do passe.",
                    "label": 0
                },
                {
                    "sent": "As they say, the French.",
                    "label": 0
                },
                {
                    "sent": "What you need is certification.",
                    "label": 0
                },
                {
                    "sent": "That's what America, Lego advocating for, and there are many, many ways.",
                    "label": 0
                },
                {
                    "sent": "To have the certification.",
                    "label": 0
                },
                {
                    "sent": "One way which is.",
                    "label": 0
                },
                {
                    "sent": "I don't really even qualify that certification, but if you want it, it could have been indeed that social networks they take around, right?",
                    "label": 0
                },
                {
                    "sent": "It's it's a way.",
                    "label": 0
                },
                {
                    "sent": "It's a very loose way, not for my taste.",
                    "label": 0
                },
                {
                    "sent": "It's called certification, but it's a way.",
                    "label": 0
                },
                {
                    "sent": "Let's, let's say, for the purpose of discussion, that is, to it's a way of certification.",
                    "label": 0
                },
                {
                    "sent": "Right, we comedian trivia, bad example.",
                    "label": 0
                },
                {
                    "sent": "Media, yes, Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's a.",
                    "label": 0
                },
                {
                    "sent": "It's a it's a better way of implementing it so.",
                    "label": 0
                },
                {
                    "sent": "So let's not mix two things.",
                    "label": 0
                },
                {
                    "sent": "One is the concept that you want to certify something.",
                    "label": 0
                },
                {
                    "sent": "And you want to really have it.",
                    "label": 0
                },
                {
                    "sent": "You don't go to discussion groups and you know find out you want to have when you buy something or when you subscribe to Tom.",
                    "label": 0
                },
                {
                    "sent": "Those who actually sell this, they they, they tell you, not that you have to as a customer go and look what they tell you.",
                    "label": 0
                },
                {
                    "sent": "You could always do that too, but you are as a seller you go and you say you know, hey, this is a product I'm selling.",
                    "label": 0
                },
                {
                    "sent": "And this is fulfilling this, this, this this this certificates?",
                    "label": 0
                },
                {
                    "sent": "They have received these certificates.",
                    "label": 0
                },
                {
                    "sent": "Now how exactly the process of?",
                    "label": 0
                },
                {
                    "sent": "Having this certificate is concerned it's a it's another debate.",
                    "label": 0
                },
                {
                    "sent": "So what your sketch is fine.",
                    "label": 0
                },
                {
                    "sent": "Old World outlook window.",
                    "label": 0
                },
                {
                    "sent": "How do you get to that?",
                    "label": 0
                },
                {
                    "sent": "So maybe you can answer that question.",
                    "label": 0
                },
                {
                    "sent": "How can you get this certificate?",
                    "label": 0
                },
                {
                    "sent": "This is or whatever.",
                    "label": 0
                },
                {
                    "sent": "Well you need.",
                    "label": 0
                },
                {
                    "sent": "Definitely a process for that.",
                    "label": 0
                },
                {
                    "sent": "As I said, you know I I don't personally think that the process of just having the into in the jungle and you know just it appears you know by itself, it's.",
                    "label": 0
                },
                {
                    "sent": "It's the easy way to do it, and it's maybe not even reliable enough.",
                    "label": 0
                },
                {
                    "sent": "It can be.",
                    "label": 0
                },
                {
                    "sent": "It can be you need.",
                    "label": 0
                },
                {
                    "sent": "You need a mechanism that is trustable.",
                    "label": 0
                },
                {
                    "sent": "For sure.",
                    "label": 0
                },
                {
                    "sent": "And you have a mechanism that is verifiable.",
                    "label": 0
                },
                {
                    "sent": "For sure.",
                    "label": 0
                },
                {
                    "sent": "How it is implemented?",
                    "label": 0
                },
                {
                    "sent": "That's the whole debate, right?",
                    "label": 0
                },
                {
                    "sent": "I'm I'm not here to to give you the answer for that, because you know, they're all debate is now.",
                    "label": 0
                },
                {
                    "sent": "What is the best way to find in the field of multimedia?",
                    "label": 0
                },
                {
                    "sent": "Because this has happened in other fields in the field of multimedia.",
                    "label": 0
                },
                {
                    "sent": "How can we come up with an efficient way of having certificates or it's application mechanisms?",
                    "label": 0
                },
                {
                    "sent": "That are not do it.",
                    "label": 0
                },
                {
                    "sent": "You know it creates a lot of overhead and and inefficiencies that that multimedia cannot afford, right?",
                    "label": 0
                },
                {
                    "sent": "You cannot wait six months to to get your certificate right here, so there must be.",
                    "label": 0
                },
                {
                    "sent": "There must be ways to do it.",
                    "label": 0
                },
                {
                    "sent": "Quick please.",
                    "label": 0
                },
                {
                    "sent": "It is a remarkable track for data, yes.",
                    "label": 0
                },
                {
                    "sent": "Please contact so can you come and live with you know what I was talking about.",
                    "label": 0
                },
                {
                    "sent": "There was that it started.",
                    "label": 0
                },
                {
                    "sent": "That's why I put the qualify.",
                    "label": 0
                },
                {
                    "sent": "That record has been consistently augmenting its data set.",
                    "label": 0
                },
                {
                    "sent": "You know each year you see that there is some fresh data added.",
                    "label": 0
                },
                {
                    "sent": "Right, and so there is a little more added and so forth.",
                    "label": 0
                },
                {
                    "sent": "Yes, so that's so.",
                    "label": 0
                },
                {
                    "sent": "That's fine, but but all I'm saying though, is that you can still see papers being published where people are not necessarily using the latest data.",
                    "label": 0
                },
                {
                    "sent": "So so so.",
                    "label": 0
                },
                {
                    "sent": "So what I'm saying therefore is.",
                    "label": 0
                },
                {
                    "sent": "That whenever you have this sort of her.",
                    "label": 0
                },
                {
                    "sent": "This sort of you can say consortium like activity.",
                    "label": 0
                },
                {
                    "sent": "There is an unfortunate side effect of this kind.",
                    "label": 0
                },
                {
                    "sent": "I don't pretend to know exactly what one can even do about it, but I'm just saying that it does exist.",
                    "label": 0
                },
                {
                    "sent": "I can point to very concrete instances.",
                    "label": 0
                },
                {
                    "sent": "And I mean I had to reject papers on that ground where you know they're basically still using an older data set when they should be using the newer data set and so forth.",
                    "label": 0
                },
                {
                    "sent": "So my intention is not.",
                    "label": 0
                },
                {
                    "sent": "Do just.",
                    "label": 0
                },
                {
                    "sent": "Directly attack track with or anything, but I will point out that.",
                    "label": 0
                },
                {
                    "sent": "Depending on which part of the multimedia industry you are in track with, May or may not cover exactly what it is you're trying to do.",
                    "label": 0
                },
                {
                    "sent": "The question of data, so it's also tasks.",
                    "label": 0
                },
                {
                    "sent": "Yes no, no.",
                    "label": 0
                },
                {
                    "sent": "I mean I.",
                    "label": 0
                },
                {
                    "sent": "Right, that's right.",
                    "label": 0
                },
                {
                    "sent": "So so I mean.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I mean, I'm referring to that when I say data set.",
                    "label": 0
                },
                {
                    "sent": "I mean, I'm including the whole thing, I'm just saying.",
                    "label": 0
                },
                {
                    "sent": "Love that I think the the the the video track I don't want tonight it's it's you know it's a value another hand that it's you know.",
                    "label": 0
                },
                {
                    "sent": "If we don't leave without carefully without you know if we are not.",
                    "label": 0
                },
                {
                    "sent": "In innovative enough that we actually fall into the trap that we actually created date of our own.",
                    "label": 0
                },
                {
                    "sent": "Good feel, good feeling.",
                    "label": 0
                },
                {
                    "sent": "You know it's basically for us to come up with some good papers that data against that data set an off and that is that is so small compared to the data we have people can get from from the web and I think this this this morning of my talk someone asked me the evaluation and they close system evaluation and you can only bring in this much value.",
                    "label": 0
                },
                {
                    "sent": "And the the the the the real evaluation even further research should go before the open system or the.",
                    "label": 0
                },
                {
                    "sent": "What is the?",
                    "label": 0
                },
                {
                    "sent": "Are you playing in?",
                    "label": 0
                },
                {
                    "sent": "New features and new new new new steps that actually make their make this system kind of self learning or self improve.",
                    "label": 0
                },
                {
                    "sent": "Instead of saying I I feel this curve I beat this algorithm.",
                    "label": 0
                },
                {
                    "sent": "The numbers might be a bit too possibly biased when you transfer the technology to open domain.",
                    "label": 0
                },
                {
                    "sent": "Yes, it's because it's closed.",
                    "label": 0
                },
                {
                    "sent": "You can very easily measure progress over the years.",
                    "label": 0
                },
                {
                    "sent": "Well, even though progress is any will bring any benefit to the operation.",
                    "label": 0
                },
                {
                    "sent": "Relevant also for the open domain.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but that's the full value.",
                    "label": 0
                },
                {
                    "sent": "Actually, there you know this is this this whole point of.",
                    "label": 0
                },
                {
                    "sent": "How to evaluate an whatever it is is extremely critical now.",
                    "label": 0
                },
                {
                    "sent": "I don't really personally think that there is a universal solution to that.",
                    "label": 0
                },
                {
                    "sent": "OK, it depends on so many things, but it's not because there is no universal solution available is not a good reason enough to not to do it.",
                    "label": 0
                },
                {
                    "sent": "You see that that's almost a tendency that people are extreme, right?",
                    "label": 0
                },
                {
                    "sent": "You know, epic, good, and pick back.",
                    "label": 0
                },
                {
                    "sent": "Like anything in life, there are good and bad sides on everything.",
                    "label": 0
                },
                {
                    "sent": "Sorry, I was hoping I didn't come across that way.",
                    "label": 0
                },
                {
                    "sent": "No, no I I'm thinking general right that that people just of course anything you do you have good and bad sides in it and they they they they the important decision probably is.",
                    "label": 0
                },
                {
                    "sent": "What are the part that are useful to take advantage of and what are the things that are less maybe efficiently done and maybe have another way of having it so so going back to the to the to the track we door.",
                    "label": 0
                },
                {
                    "sent": "Any other evaluation campaign?",
                    "label": 0
                },
                {
                    "sent": "I think each of them they serve a purpose.",
                    "label": 0
                },
                {
                    "sent": "But beyond that purpose.",
                    "label": 0
                },
                {
                    "sent": "It's dangerous to extend it, and I believe that you know.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you know.",
                    "label": 0
                },
                {
                    "sent": "This is, I call it experimentally driven.",
                    "label": 0
                },
                {
                    "sent": "You call the data driven and maybe there are some other names.",
                    "label": 0
                },
                {
                    "sent": "This is this is definitely one way to go.",
                    "label": 1
                },
                {
                    "sent": "However, there are a lot of also applications in multimedia services and products.",
                    "label": 0
                },
                {
                    "sent": "You cannot do it.",
                    "label": 0
                },
                {
                    "sent": "Is this this kind of data driven?",
                    "label": 0
                },
                {
                    "sent": "You know, because not everything is also breakfast, right?",
                    "label": 0
                },
                {
                    "sent": "So there are cases where you cannot do that right?",
                    "label": 0
                },
                {
                    "sent": "And and in this case you know you did it again.",
                    "label": 0
                },
                {
                    "sent": "You know another way.",
                    "label": 0
                },
                {
                    "sent": "So I like the introduction of competition.",
                    "label": 0
                },
                {
                    "sent": "So basically, what is a competition competition is that people agree to do research on the same data set.",
                    "label": 0
                },
                {
                    "sent": "For that for for an instance on the same purpose.",
                    "label": 0
                },
                {
                    "sent": "And if you look for instance at the tracking algorithms, I've been looking into lately that everybody carefully picks the algorithm it's suited for.",
                    "label": 0
                },
                {
                    "sent": "Its so sorry, the data set to one data set, sometimes even two datasets.",
                    "label": 0
                },
                {
                    "sent": "Or its own algorithm.",
                    "label": 0
                },
                {
                    "sent": "So and even very serious journals except this practice.",
                    "label": 0
                },
                {
                    "sent": "And there are in all the tracking papers, there are very, very few which explicitly name the limits of their algorithm.",
                    "label": 0
                },
                {
                    "sent": "So then I prefer if that is the practice which was the practice, then I also in search, then I prefer competition because you agreed to do research on the same data set for the same purpose.",
                    "label": 0
                },
                {
                    "sent": "But if you take that as a whole, but then I.",
                    "label": 0
                },
                {
                    "sent": "Notice the door back in my research group that people start to focus on the result of the competition and they had this small margin of improvement over the other student and I completely lost the purpose of doing research, namely to understand why this is the case.",
                    "label": 0
                },
                {
                    "sent": "So the Y has gone out of the window and the number improvement increases.",
                    "label": 0
                },
                {
                    "sent": "Whereas so, but all of this that so by now, here's another advice.",
                    "label": 0
                },
                {
                    "sent": "If you write a good white paper why it works or why it doesn't work, you get more attention than improving the incremental competition data, so to say.",
                    "label": 0
                },
                {
                    "sent": "And to complete spectrum.",
                    "label": 0
                },
                {
                    "sent": "That very few papers are hitting these days.",
                    "label": 0
                },
                {
                    "sent": "All I've trained it on data set a of the BBC and I've applied it on CNN data.",
                    "label": 0
                },
                {
                    "sent": "That was a real serious test.",
                    "label": 0
                },
                {
                    "sent": "I know case probably knows from hard how many papers there are in this respect, but it is.",
                    "label": 0
                },
                {
                    "sent": "But this is the real the real Sammy.",
                    "label": 0
                },
                {
                    "sent": "Say me open, but sufficiently controllable that you can measure progress, so to say.",
                    "label": 0
                },
                {
                    "sent": "I I I I'm 100% agree with you is we come back to the point that I was making on the impact standard.",
                    "label": 0
                },
                {
                    "sent": "I think we even send that completely stopped after impact two.",
                    "label": 0
                },
                {
                    "sent": "I think.",
                    "label": 0
                },
                {
                    "sent": "I think everybody will say they downgrade job but they continued on the door.",
                    "label": 0
                },
                {
                    "sent": "More research into it and started define impact 7 and they start even defined.",
                    "label": 0
                },
                {
                    "sent": "How do you?",
                    "label": 0
                },
                {
                    "sent": "How do you describe color histograms?",
                    "label": 0
                },
                {
                    "sent": "And then we all know those things are not present.",
                    "label": 0
                },
                {
                    "sent": "The novel present content well, so so you know it was in the very early stage of content within the retrieval why you want to put it another.",
                    "label": 0
                },
                {
                    "sent": "So I think I think again, I'm not against the standard.",
                    "label": 0
                },
                {
                    "sent": "What I'm saying is that you lossed direction.",
                    "label": 0
                },
                {
                    "sent": "Really forgot what you started.",
                    "label": 0
                },
                {
                    "sent": "So what's the original idea started with?",
                    "label": 0
                },
                {
                    "sent": "So come back to generalize better, better than in the in the in the research community of people.",
                    "label": 0
                },
                {
                    "sent": "Now you know trade the conference is a computation so so they they they start to think about the research is for the sake of publications.",
                    "label": 0
                },
                {
                    "sent": "And that's where the danger come in.",
                    "label": 0
                },
                {
                    "sent": "I think it's the same thing when when the impact community it just keep looking for what what next thing to standardize and so have the impact to that is that you end up four of them back four and even before intercourse closed and under any relocation they.",
                    "label": 0
                },
                {
                    "sent": "Not at 7, and knowing that only the universities and research, research and communities is doing that.",
                    "label": 0
                },
                {
                    "sent": "Really, before the things even came out of the batteries, you started standardizing and so today who's who knows what antisemitism is about and who use it.",
                    "label": 0
                },
                {
                    "sent": "Because this is, this is a good debate and I think that we have to stop.",
                    "label": 0
                },
                {
                    "sent": "Let me see.",
                    "label": 0
                },
                {
                    "sent": "For the sake of also completeness, and I think that it's important to know so so you know there has been a lot of a lot of allegations about impact, whether it be good or not.",
                    "label": 0
                },
                {
                    "sent": "Let me just tell you, I'm not a defendant, but you know, let me just set a few facts straight.",
                    "label": 0
                },
                {
                    "sent": "A the most successful impact standard.",
                    "label": 0
                },
                {
                    "sent": "Is MPEG 4 video.",
                    "label": 0
                },
                {
                    "sent": "If you measure it in terms of codecs and stuff so you know, I think it's unfair to say.",
                    "label": 0
                },
                {
                    "sent": "That after impact two, there hasn't been anything that has been good.",
                    "label": 0
                },
                {
                    "sent": "And in fact, a number of respected companies on this panel.",
                    "label": 0
                },
                {
                    "sent": "They are involved.",
                    "label": 0
                },
                {
                    "sent": "If you are so so so strong.",
                    "label": 0
                },
                {
                    "sent": "Opinionated about that.",
                    "label": 0
                },
                {
                    "sent": "Convince your companies to stop contributing to it.",
                    "label": 0
                },
                {
                    "sent": "Pick seven, however, that's correct, which is.",
                    "label": 0
                },
                {
                    "sent": "I think it is.",
                    "label": 0
                },
                {
                    "sent": "It's not a secret that then pick Seven has been.",
                    "label": 0
                },
                {
                    "sent": "There has been a mistake whether.",
                    "label": 0
                },
                {
                    "sent": "After that then pick 21 has been or not?",
                    "label": 0
                },
                {
                    "sent": "Well Peter debate.",
                    "label": 0
                },
                {
                    "sent": "I don't think it's not today decay, is it?",
                    "label": 0
                },
                {
                    "sent": "It's important to talk about it, but you know, again, this goes again back to what I said.",
                    "label": 0
                },
                {
                    "sent": "You take the whole thing and I could do one thing is bad or the whole thing is good.",
                    "label": 0
                },
                {
                    "sent": "It's not like this.",
                    "label": 0
                },
                {
                    "sent": "You know there are things.",
                    "label": 0
                },
                {
                    "sent": "That in MPEG 2.",
                    "label": 0
                },
                {
                    "sent": "Some, at least on this panel set was very good standard impact.",
                    "label": 0
                },
                {
                    "sent": "Two is full of junk profiles that nobody is using, but there are one or two profiles in impact tool that are used and everybody says it is very successful.",
                    "label": 0
                },
                {
                    "sent": "In fact, MPEG four, I think just because of lack of knowledge.",
                    "label": 0
                },
                {
                    "sent": "Another thing people think it is it is not as successor picked too, but actually it is more.",
                    "label": 0
                },
                {
                    "sent": "There are more MPEG four implementations.",
                    "label": 0
                },
                {
                    "sent": "Then there were in Pic 2.",
                    "label": 0
                },
                {
                    "sent": "Epic is good.",
                    "label": 0
                }
            ]
        }
    }
}