{
    "id": "dh5mtf6iog7v3myxxmgibdklwrk43iim",
    "title": "Computational Creativity in Music and Music Cognition",
    "info": {
        "author": [
            "Geraint Wiggins, School of Electronic Engineering and Computer Science, Queen Mary, University of London"
        ],
        "published": "Jan. 27, 2014",
        "recorded": "November 2013",
        "category": [
            "Top->Computer Science->Artificial Intelligence",
            "Top->Social Sciences->Psychology->Cognitive Psychology",
            "Top->Philosophy",
            "Top->Arts"
        ]
    },
    "url": "http://videolectures.net/ascc2013_wiggins_music/",
    "segmentation": [
        [
            "Thank you very much.",
            "It's a great pleasure to be here.",
            "Very exciting to be at the first pro Seco meeting.",
            "The second indeed meeting that Hannah has organized kind before us.",
            "So I shall start with no further ado."
        ],
        [
            "And tell you what I'm going to talk about.",
            "I will start by telling people what I'm going to talk about.",
            "Then I talk about it.",
            "Then I tell him I've talked about it.",
            "It's a good way to do things the first 45 minutes of me is going to be about how to characterize creative systems, so this is quite old work now that some people in the room may have read already.",
            "Some people in the room may not have seen it because it's sufficiently old, and some people may be in between the two.",
            "This is about trying to find ways based on existing philosophy.",
            "That we can compare creative systems one with another.",
            "The reason for wanting to do that is so that when we build systems of the kind that we've heard talked about this week.",
            "Then we can maybe start to do some science and compare them and say how they behave differently and so on and so forth.",
            "This is kind of a first step in that direction.",
            "Tamar"
        ],
        [
            "So I have a double lecture which is about a specific project which is part of a much longer term project in my lab.",
            "Looking at the information dynamics of music which started way back in 1997 before we even use the term computational creativity, I think maybe Tony was the first person to use the term computation was gone over there.",
            "In 1996.",
            "Nineteen 97 workshop wasn't it?",
            "Yeah, absolutely.",
            "So.",
            "So that was kind of where it all started to happen.",
            "I really said all started to go wrong at that point.",
            "I was mindless generation going on there so tomorrow's talk is going to be about a learning system that composes music specifically about the work of one of my former PhD students and now colleague Marcus Pierce and then."
        ],
        [
            "On Thursday, I will give a rather short election.",
            "As you can see, it's very short about the work we're currently doing in both the concrete and the learn to create projects which are two of the projects funded alongside Pro Seco by the EU.",
            "This one is going to be much more speculative because we haven't done the work yet and the idea is to put across some of the questions that might arise when we talk about the interaction between creativity and consciousness and the other things that go on in the human mind.",
            "OK, before I go on can I calibrate myself?",
            "Am I clear to everyone at the back?",
            "Yep OK, please stick a hand up if I'm not the same up there.",
            "Yeah, good."
        ],
        [
            "OK, so.",
            "I'm going to start off with an example of computational creativity, but I would claim is computational creativity and it's going to be in the area of automated composition, musical composition.",
            "It's going to be in a very specific style that of JS Bar, and it's going to be very old, not the style, but the work and that's there for a reason.",
            "This work does not go back as far as Ada Lady Lovelace, one of the founders of the Computing Science, before there were any computers.",
            "She did suggest that computers ought to be able to compose music.",
            "And as far as I know, the first recorded attempt to do that with a real computer in the sense that we understand it today, was by Hillary Isaacson back in the 1950s.",
            "This piece was part of it was performed for the first time in about 25 years last year at is Mia.",
            "Please more conference which was rather satisfactory.",
            "This, however, is very much the computer being used as a tool to generate musical structures.",
            "It's not about the computer being composer, the computer, the computer is a tool.",
            "The composers, but it's quite a successful piece and really rather substantially more successful than many automated compositions have been since be lots of subsequent attempts and as people have become more aware of the science here, or rather more aware of the lack of science, here, people have started to look at ways that they can say when they've succeeded or not.",
            "So one of the ways is to talk about style replication.",
            "Then you can say have I got the style of such and such a person or genre replication?",
            "Can we do jazz or not?",
            "Can we do something that people would agree was jazz?",
            "And one of the features of this kind of work is that it was almost never evaluated scientifically.",
            "I'm going to talk about evaluation the second half of tomorrow's talk.",
            "It's a problem for music."
        ],
        [
            "So we're going to start off with something successful, and then it's going to get progressively worse from there on.",
            "This gentleman is called chem Electro.",
            "He's a Turkish American who works in IBM Labs in Yorktown Heights.",
            "I think.",
            "Back in 1980, he was doing his PhD thesis on programming language called the Backtracking Specification Language, which was a sort of reinvention of prologue and the work that he chose to illustrate his PhD thesis with was the problem of harmonizing a hymn tune in the style of JS Bach.",
            "So this is a problem which has been done and done and done and done again.",
            "He was the first one to do it.",
            "And he was also the best one to do it, which is interesting.",
            "At least the results so far are best.",
            "Mild stuff I shouldn't call in chemical.",
            "I don't know.",
            "Absolute thesis is a formal computer science document about a particular programming language, but it also contains in Appendix 430 very carefully specified musical rules about how to do harmonization in the style of jazz bar.",
            "Actually, I personally believe that the music theoretic contribution of the thesis is far greater than the computer science contribution because no one ever used DSL.",
            "There we are.",
            "It was an interesting idea.",
            "It's an expert system.",
            "This is what it sounds like.",
            "OK, I apologize for the appalling echo there.",
            "That's something to do with my new computer which isn't set right now.",
            "I just said here's what it sounds like.",
            "Actually, maybe that isn't what it sounds like.",
            "Who thinks that was a computer who thinks it was JS Bach?",
            "Anybody got any clues?",
            "Difficult to judge, isn't it?",
            "OK that's why Turing tests don't work OK. You have to be an expert.",
            "Here's another harmonization.",
            "OK, so that was the same tune.",
            "One of those was indeed harmonized by JS Bach.",
            "The other was harmonized by actual Lu system Corral.",
            "Can anyone tell which was which?",
            "Anyone think the first one was bark?",
            "OK, anyone think the second one was bark?",
            "OK, anyone from the first group wants to tell me why you were right and the others were wrong.",
            "A little jarring in what sense?",
            "Spectrum.",
            "Well, you may have a point.",
            "Actually it's very barky and the second one it's 2 barking right?",
            "It sounds like someone's doing pastiche, which is exactly what the system was doing 1980.",
            "This was it's pretty damn good.",
            "It will do a lot better than your average first year music student.",
            "There's a music student over there.",
            "Snickering, yes?",
            "OK, so the first one was bark, the second one was corral and really the only way you can tell the difference is either by knowing the corral which across the bar expert will or by spotting the fact that it runs into pastiche because it has no sense of what's about right.",
            "OK, so the reason I wanted to show you this now is first of all to try and make what is otherwise quite a mathematical lecture interesting, and Secondly because we're going to come back to a problem very closely related problem at the end and I'm going to show you a system which on Thursday which does this.",
            "Not exactly this problem at the park problem, but a similar harmonization problem without any prior knowledge.",
            "This thing was an expert system, as I said of challu.",
            "Put together 430 odd hand coded rules about how to do this, so the system wasn't really doing anything intelligent at all, it was merely generating according to the rules that had been given the system.",
            "I'm going to show you on Thursday learns everything from scratch.",
            "And that, to me, suggests that it is probably more creative than something that doesn't do that OK?",
            "Onto"
        ],
        [
            "Informal stuff if we want to do science in any kind of field at all.",
            "It's very useful to have some kind of framework in which to work in which you can say here's one way of solving problem.",
            "Here's another way of solving the problem.",
            "Let's try and find some common ground to compare them.",
            "That's where I'm going with this and I'm starting from Margaret Boden's work, which most people know.",
            "Please put your hand up if you read the creative mind.",
            "Margaret Bowden's book.",
            "Oh surprisingly few people.",
            "OK, those people who haven't read it should read it.",
            "It's very easy read.",
            "It's a very good book an it really produces some views which are kind of fundamental to a lot of the thinking that goes on in this field, right?",
            "I'm glad that most of you haven't read, however, because it means my slides are less boring.",
            "OK, so in her 1990 book The Creative Mind.",
            "She outlines a characterization of what creative behavior might be from a cognitive philosophy perspective.",
            "So what philosophy, of course means is that you don't have to be formal, and at least that kind of philosophy, and she isn't formal.",
            "Which means, then, that the characterization is rather vague, as we found over the years, it's open to different interpretations, and one of the things that I've tried to do here is to pin down a particular interpretation that it might have.",
            "So then what I'm trying to do in this lecture is to take Bowdens ideas, which I shall explain briefly.",
            "Tony already alluded to them.",
            "Yesterday morning very clearly so.",
            "That was nice.",
            "I was able to delete some slides and.",
            "I'm going to try and give you a very quick graphical idea of how that works, and then I'm going to show you how it can be written down informally."
        ],
        [
            "Which I claim would be a useful thing to do.",
            "So creative activity is cast as the discovery of concept, which of course might correspond directly with Artifact, so it's not purely a cognitive.",
            "Theory concepts in a conceptual space.",
            "The conceptual space is the space of all possible things.",
            "In some sense, no.",
            "Actually, that's not true.",
            "The conceptual space is the space of all possible things that are the things you're looking for.",
            "So the space of all possible buses, or the space of all possible bananas if you're trying to create bananas or whatever.",
            "All possible concepts available to the creative agent looking for a particular thing, so it's kind of an AI ish kind of perspective because we're sort of assuming the solution in the way that we state the problem and we're going to address that later on.",
            "That space is constrained by rules, so you can think of each one of these blobs here as a point in a space which has a number of parameters in it which are constrained by rules.",
            "This is a very standard AI way of thinking.",
            "Some people would call this a search space.",
            "And within that space you have a starting point, which is possibly a novel concept and you have some partially created concepts and you have some complete concepts.",
            "The space as I said, is constrained by rules, so contradictory things are not allowed.",
            "You can't be both big and small, for example.",
            "And then we define something called exploratory creativity.",
            "This is one of bowdens terms, as the action of searching that conceptual space for a new concept.",
            "Something like this.",
            "Hey, we've won.",
            "So anyone who knows about artificial intelligence, good old fashioned as intelligence, knows that this is standard search.",
            "Except that it's not quite standard search.",
            "Because we don't really know what the concept is.",
            "In Standard I we always have the notion of a stopping point in creativity.",
            "We don't necessarily know what The thing is that we're looking for, so it complicates matters.",
            "But for the minute, let's just think in terms of this.",
            "So my point here is that you can find different concepts within a given space which are complete.",
            "And you can find the same concept in various different ways.",
            "OK. And it's important to understand here that this search idea is an abstraction.",
            "It's a way of describing things it is not making the strong claim that all creativity is search.",
            "The point is that this kind of search approach can be applied to solve any standard computational algorithm, including NP complete ones.",
            "Of course it might take an infinite time to do so, but at least you can begin to do that by searching.",
            "So what this means is that we can get computers to do things that we know computers cannot do.",
            "In the usual computational analytic way, that's the I mean.",
            "That's a very loose specification of the point."
        ],
        [
            "Right, so that's exploratory creativity.",
            "You imagine that there's a space of all things that you're interested in out there, and then it's finding the ones that you want in that space.",
            "That is the game transformation or creativity is a different kind of game, and Boden claims that it's a greater kind of creativity.",
            "I would dispute that claim, but I'm not going to go into that now.",
            "The idea of transformation or creativity is that you take that space of things and you transform it into a different one.",
            "Which means then that you can search in a different kind of way, perhaps.",
            "Or you can search for different kinds of things.",
            "One example of that might be, for example the kind of creativity that Arnold Schoenberg did when he moved from total music to non tonal music.",
            "It's a fairly big kind of shift for those people who know such things.",
            "OK, so.",
            "What you have to do in order to achieve this is to change the rules of the conceptual space so that the space itself, the constraints on it change.",
            "Alan Bundy and I, and probably other people, to have argued against this notion that transformation of creativity is necessarily bigger thinking than exploratory creativity.",
            "It's overly simple simply because it can be very hard to find concepts that are in your conceptual space, so it doesn't follow necessarily that a great creative act is a transformation or one."
        ],
        [
            "OK.",
            "Here are some reasons why people say computers are not creative, and indeed why they.",
            "Some people say that Bowdens specification is not creative.",
            "So a symbolic system cannot create new concepts, right?",
            "If we have an alphabet of symbols which claims to represent the solution, the set of solutions to some problem, then we can't create new concepts in that because we would have to create new meaning for those symbols.",
            "I think probably most people in the room realize that this is a spurious argument, right?",
            "The bottom line is you can do all sorts of things by having, for example, complex representations which are compositional, and then you create new compositions and you can create new symbols and so on and so forth.",
            "So this is, this is just a misunderstanding of what it is to represent things."
        ],
        [
            "A system which is exploring a search based defined by representation is not being creative.",
            "This would be true if it were the case that all representations were finite.",
            "But not all representations of finite, and since not all representations of finite, it means that you can't necessarily enumerate all the things that are in space, which means you can't necessarily know all of the things that are in a space.",
            "So in principle this is a spurious argument."
        ],
        [
            "I particularly like this one.",
            "Non symbolic systems generalize via simple mathematical process which is not created.",
            "This is the argument against neural networks being creative.",
            "It's a really simple process, it's just mathematics.",
            "How can it be creative?",
            "Who says this isn't what brains do?",
            "Nobody knows, so this is certainly not a proven claim, even if it's not a clearly spurious one.",
            "OK, I just thought I'd throw those in there because those are some of the standard arguments that people give against this kind of formalization.",
            "A lot of them can be summarized as all creativity is far too special to be formalized.",
            "We know what AI people think of that kind of thing."
        ],
        [
            "OK, so let's start from the obvious position, which isn't explicit in Bowden's book, but it's kind of implicit all the way through which we're going to represent this conceptual space as a space of multidimensional.",
            "Sorry as a multidimensional metric space.",
            "It doesn't have to be a metric space.",
            "Actually.",
            "It's quite useful if it's a metric space 10 years later.",
            "Pattaya before she produced a book called Conceptual Spaces which takes this a little further and the space is actually do have to be geometrical in a very particular way.",
            "One of two very particular ways.",
            "So in this example of sort of convergence here, these two pieces of work seem to be fairly separate in their development, but they've converged in a particular way.",
            "OK.",
            "But I'm talking about Bowdens conceptual space here.",
            "Not yet in force.",
            "Right, so partial and complete concepts are represented as points in the space, so there's an immediate consequence there, which is that we have to have some notion of undefined in our dimensions.",
            "If we're going to represent partial concepts, then there has to be some notion of a point in the space having values which are undefined.",
            "It's probably obvious to you that each dimension of the space is going to represent a feature of the domain.",
            "And then in good OL fashioned AI terms, each point in the space denotes a set of property value pairs."
        ],
        [
            "Right, so that's given us, our smoker, sport of things that we could make our sandwiches from.",
            "It hasn't given us a means of making sandwiches.",
            "And in order to do that, first of all, we need to know what constitutes a sandwich, not merely a pile of stuff, but something with some bread at the bottom, and so on and so forth.",
            "So we have a set of rules which specify what is a well formed thing within that space.",
            "That rule set of rules is called R and the conceptual space we call C for the want of anything more imaginative.",
            "Now here is the difference between this formalization and Boden, Boden is quite happy to talk about a conceptual space of things.",
            "Navigating it and finding the thing that you sort of knew you wanted.",
            "And that for me is a problem because I want to be creative in spaces where I didn't know I wanted a thing.",
            "I want to be able to recognize a creative act that I've made, even though I didn't realize that I was actually trying to do that at the time, and therefore there must be a universe which contains C, because otherwise you wouldn't be able to go outside.",
            "See simple as that.",
            "Therefore, this are the set of rules that Bowden talks about as well is a set of rules which picks particular elements of this conceptual space of sandwiches or postboxes or whatever it is.",
            "Giraffes from the universe.",
            "It's quite important to notice that there's a duality here, so you can talk about subspaces where you have a smaller number of dimensions.",
            "You select a number of dimensions from higher dimensional space, or you can talk about areas of the high dimensional space with undefined things.",
            "These two things are broadly equivalent, so you can think of them in which either way is comfortable, so therefore he's off his our first mathematical formula C is a subset of you.",
            "It says strict subset there because we probably will never be in a situation.",
            "Of trying to create in a context of everything we probably usable, I can't imagine a situation where we wouldn't have at least."
        ],
        [
            "Some idea of what we were trying to do.",
            "If we have a set of rules are then we need a language L in which to express it, so that's all fine, and we're going to need an interpreter for that, because otherwise it wouldn't actually do anything.",
            "So we have a language L, and the interpreter gives it semantics to allow us to express the rules are which define the conceptual space.",
            "Given a universe, you.",
            "So we will give a notation for that.",
            "An interpreter which matches arguments, a set of rules in L2.",
            "An effective procedure for selecting the elements of you.",
            "So now we can say something more precise, which is that C equals the result of interpreting our and applying the interpretation to you.",
            "So this is a filter effectively straightforward filter.",
            "We're going to need an old concept and you'll see why in a moment, and I'm going to call that top."
        ],
        [
            "So what we've got now is the means of identifying a class of things which are of interest.",
            "That's what the conceptual spaces.",
            "But what we don't have yet is a means of finding the ones in that set that we want to talk about.",
            "So we allow ourselves another set of rules, T. This is a program just like the set of rules are was.",
            "It's a program which is going this time to navigate our way through the space.",
            "So it's going to be trying to find ways of traversing that space.",
            "And those ways could be arbitrarily complicated, I should say.",
            "And to explore things and to find.",
            "First of all, complete solutions, but also then solutions which are desirable.",
            "I will talk about the desirability in a moment.",
            "So Bowden in her book and also in subsequent publications has emphasized the need for evaluation in creativity.",
            "And as we said in Dublin at the conference a couple of years ago we were scoffing for a decade.",
            "I think it was interning at mere generation.",
            "So the evaluation part is fundamentally important and we really don't know how to do it.",
            "So there's some open research to be done there.",
            "So we're going to do the same again.",
            "We're going to introduce a set of rules written in the same language.",
            "Really useful to have them all in the same language, which then may be used to accept or reject concepts in terms of their quality.",
            "Notice I'm being a little vague here about whether I'm talking bout booleans or whether I'm talking about continuous values, but if they could be fuzzy values, whatever you like, really here.",
            "And now we're going to talk about the effective procedure for traversing this space.",
            "I'm going to use a slightly complex, more complex symbol there, so that is going to take three sets of rules.",
            "Three sets of rules, which is and will return an effective procedure for computing an ordered set of partial concepts from another.",
            "So there's a lot in that.",
            "This is actually a generalization of the good old fashioned AI approach to specifying search algorithms.",
            "Actually.",
            "The difference, several differences.",
            "First of all, we've got a tripartite unit here.",
            "Doing our searching and then we have.",
            "Ordered set here or sequences.",
            "If you prefer to think of them that way.",
            "Rather than an agenda and a goal, and so and so forth.",
            "So we have no goal test here.",
            "By comparison with the old system.",
            "So now I can write this down.",
            "Which is then a general description of the way I process my concepts that I navigate my search space in terms of a specification of what the conceptual space is, a specification of, what my trans transition rules are, my exploracion rules, and of my evaluation rules.",
            "So I don't necessarily have to use all of those all the time.",
            "So I could be ignoring, for example, the evaluation rules and merely generating.",
            "Or I could be ignoring the conceptual space rules are and just wildly generating in the hope that I might find something valuable.",
            "How many hours do that, I wonder?",
            "I do as I can."
        ],
        [
            "Sometimes.",
            "OK. Another little bit of mathematical tool here.",
            "This operator Diamond, which I've borrowed from the fixed point operator in programming language semantics.",
            "Is useful because it allows us to create things to specify things like this.",
            "So actually this is a definition here.",
            "If I take a function and I do that to it, then this is what that means.",
            "Effectively what it means is that I'm going to keep on applying that function to everything that I could ever apply it to until I well, not, not until I reach a fixed point.",
            "Actually, we hope that we reach a fixed point, or it might be an infinite set, whichever is just an enumeration operator.",
            "So we can now enumerate the conceptual space for our creative agent starting from the empty concept, which is why I needed that to place to start from.",
            "So what this basically is saying is that I can enumerate my conceptual space C by applying the fixpoint operator to this function and then applying it to the empty concept.",
            "So I'm filling in my concept in all the possible ways that I'm allowed to according to those three sets of rules.",
            "So what I've done now is I've given a way of specifying that conceptual space that Bowden was talking about, I think."
        ],
        [
            "This thing could in principle be a subset of C, actually, because it could be that our set of rules.",
            "T which allows us to traverse that space does not give us a connected path through the entire space that our specifies.",
            "And so on and so forth.",
            "So, for example, given that interpreter and I've got my rules are in there, so my rules T could be looking at.",
            "My rules are and meter interpreting them an seeing what's going on and guiding the search accordingly?",
            "Equally, they could be looking at my rules E. And guiding the search according to the quality of the items that are being looked at, so on and so forth.",
            "OK.",
            "So these are the things I've just said.",
            "But what this is allowing us to do is to specify a little bit more precisely than Bowden does with their English words.",
            "Which parts of a system are which?",
            "Because we could just label them?",
            "Wouldn't say this part of the program is doing all this part of the program is doing T and so on.",
            "That's what I'm going to do later on in the muse."
        ],
        [
            "Work so here is what an exploratory creative system looks like if you specify it using this approach.",
            "It's a septuplet which consists of the universe, the language, perhaps the language should before the universe.",
            "Because you can't specify the universe without the language, it doesn't really matter.",
            "The two interpreters and then those three rules set.",
            "That's a specification of an exploratory creative system.",
            "According to Bowden's nation.",
            "So then what happens that so on?",
            "Something very strange will happen with my slides.",
            "This was supposed to be up.",
            "But I just said it anyway."
        ],
        [
            "OK, so that's exploratory creativity.",
            "It was quite easy, really.",
            "And then there's nothing particularly advanced about doing that.",
            "But then something interesting starts to happen.",
            "So Bowden talks about transformation or creativity as changing this rule set are.",
            "To represent a different conceptual space, but in this formalism.",
            "The rule set is available for scrutiny.",
            "Which it kind of isn't inboden's way of thinking.",
            "At least not explicitly.",
            "What's more, there's another set of rules that doesn't even mention that can be transformed.",
            "So first of all, we can transform R. As I said, to produce a new conceptual space.",
            "Imagine a cloud billowing as time moves on.",
            "But we could also transform T, so finding a new way to search the space is as much transformative as finding a.",
            "A new space to transfer to search.",
            "OK, so another little insight there which isn't in."
        ],
        [
            "Book.",
            "Yeah, if I may, why not transform E as well?",
            "Because it's really complicated.",
            "Right, yes, you can transfer me as well.",
            "The question is, according to what criteria do you do so?",
            "OK, I'm getting a little bit worried that I'm not going to have time to go all the way through my slides.",
            "I will come back to that later on if I may.",
            "OK, so the search space, now the full search base, the universe is the power set of that language.",
            "It's all the things we could express in that language.",
            "So that's how universe.",
            "And if we allow ourselves a meta language which allows us to describe both L and obviously its powerset."
        ],
        [
            "Then we can start to build a similar kind of description to the one idea of the exploratory creativity system about a transformation or creativity system.",
            "So we're going to need some rules to allow ourselves to explore this conceptual space of rule sets.",
            "So conceptual space of conceptual spaces I'm going to call that are sub L. 'cause I'm unimaginative, we're also going to need a search strategy.",
            "Exploratory strategy for defining that search base.",
            "So that's Isabelle.",
            "And carefully ignoring his question just now.",
            "As you can see I chose to ignore that question on this slide.",
            "Actually, we will have an evaluation criterion as well, but it's going to be different.",
            "It's going to be more complicated.",
            "So if we're going to use this meta language as before for these specifications and we can use the same interpreters for that matter."
        ],
        [
            "Language, so we make sure we do.",
            "That's in Amalgamated Metaobject language, like Prolog.",
            "The only thing we've got left is this evaluation question.",
            "And hey presto, when we write those down in the same order, we get something that looks exactly the same.",
            "So the argument that can be made here is that this shows us very clearly that transformation of creativity is nothing more than exploratory creativity.",
            "At the meta level, as Bruce Buchanan said in 2000 or at.",
            "As Bowden put it, exploratory creativity in the space of possible conceptual spaces.",
            "Plus it gives us the notion of the.",
            "T variation.",
            "Alright then, so the point here is that what we've done is to simplify the whole thing.",
            "We've picked the balloon of transformational creativity and said, look, we can characterize it like this and maybe understand better what it is.",
            "OK, this your question.",
            "The Isabelle may be characterized in terms of E, and I've written about how to do that, but it's far too complicated to talk about electric context.",
            "You have to have the paper in front of it to make sense."
        ],
        [
            "OK.",
            "So that wasn't really a big deal if we thought it.",
            "As I say, Bruce Buchanan wrote about this idea, creativity at the meta level in 2000, and if you read this book, you can sort of see it in there.",
            "All this does is allow us to go through a process which kind of makes the point.",
            "But now we can start saying some interesting things about our creative systems, and this is really the point of this whole business.",
            "We can look at how the different components of these descriptions interact, how how they interact can tell us useful information.",
            "So let's look at how."
        ],
        [
            "Some can fail to create.",
            "For example, it can be uninspired, I should say, incidentally, that this terminology.",
            "Fine, I wrote it down before Graham started looking at his terminology, or maybe at the same time, but certainly before I'd seen it so inspiration does not mean the same thing as inspiring set in grams formalism, different stuff, yes.",
            "Coincidence terminology, which is unfortunate, but it does not mean the same thing.",
            "OK, so I'm inspiration is the inability to produce valued outputs, but we can split it up into some useful things.",
            "Hopeless on inspiration, conceptual inspiration on inspiration and generative on inspiration.",
            "So these are things these are labels that we can apply to creative systems that work, or perhaps fail to work in particular ways.",
            "We can use them as well, formedness checks and so on."
        ],
        [
            "Hopeless an inspiration.",
            "Works very straightforwardly.",
            "There are no evaluated.",
            "There are no sorry.",
            "There are no concepts in the universe which are evaluated to be good according to this evaluation function.",
            "So this creative system has no chance of ever doing anything useful, so you might as well give up now.",
            "Maybe that's something you can prove given an actual system, so that's useful to know."
        ],
        [
            "Here's another one conceptual in an inspiration.",
            "So what this means is that our applying our rule set within our universe and evaluating things will never give us a value concept, so there are no valued concepts in our conceptual space.",
            "That's kind of Anil form system in some sense.",
            "So that's useful.",
            "This one can be used to trigger trigger a particular kind of behavior, which I've called aberrant and I'll come back to that later if I have time.",
            "I'm really running."
        ],
        [
            "Short OK generated by an inspiration is where.",
            "The translator sorry I keep wanting to say transformation for tea, but I don't mean that the transition rules here that take you around the space failed to find the value concepts so there aren't any valued concepts in the part of the space that your particular creative system can explore.",
            "I wouldn't be at all surprised if we end up in that situation a lot without realizing it.",
            "With our systems.",
            "OK, again, it would be rather useful.",
            "To do that, and here's the possibility of triggering a transformation.",
            "So.",
            "If we transform T here, we might have some chance of winning, and indeed the way that this fails might tell us how to transform T. So now we can start having a system which is reflective.",
            "Given this kind of reasoning, so we're starting to see why it's useful if the system can reflect on itself in this way, then it can change its behavior in ways that are probably human, like because certainly if we realized that our method of painting would never produce the kinds of images we wanted, then we probably change our method of painting, wouldn't we?",
            "Or perhaps switch to photography?"
        ],
        [
            "OK, let's look at this idea of aberration.",
            "The production of new concepts which are not existing which are not in the existing conceptual space.",
            "So this is deviation from the expected.",
            "How could that happen?",
            "Well, it can happen because there's a universe which is bigger than the conceptual space for a start.",
            "So you've got your conceptual space.",
            "You've got your bigger universe.",
            "You're transitioning, transitioning through your conceptual space, and you just pop outside for a moment and you find something out there which you consider.",
            "Why would you consider it?",
            "Well, if it evaluates to something good for, evaluates a good, then you found a reason.",
            "Perhaps to change your conceptual space and we've got."
        ],
        [
            "Three kinds of aberration.",
            "So aberration happens when a creative action, a creative agent, finds concepts of valued, but which are not in the conceptual space.",
            "And that, incidentally, is why Y has to be represented distinctly from are not one, just in terms of the other.",
            "And here's how you would write it down in my squigly formulation."
        ],
        [
            "Perfect aberration is the case where all aberrant concepts are valued.",
            "So what do you do there?",
            "All concepts which have been found which are outside the conceptual space are valuable.",
            "Change the conceptual space, right?",
            "You can do some machine learning and you can change the integral space, excellent.",
            "There we are."
        ],
        [
            "OK, productive aberration is less so less than perfect, but nevertheless we've still got some things that are valued.",
            "This is quite interesting, because we may want to transform our to include the new things, but we also want to transform T to exclude the things that are not valued.",
            "That and you.",
            "So we might want to check transform R or T or both."
        ],
        [
            "So you see, the kind of things that we can get into here.",
            "Some of them are really quite useful and subtle pointless aberration.",
            "Well, as with hopeless une inspiration.",
            "Pointless aberration is the case of just wandering off, doing something useful, doing something useless outside the conceptual space that, frankly, you know you should have been in, so that's something we don't want our systems to do generally.",
            "Or we just transform T sorry not all as well.",
            "We want transform T and."
        ],
        [
            "It's all there.",
            "OK, so the point of all of this is to pave the way for creative agents which can reason about their own behavior in a mechanistic way.",
            "We have a standard means of describing the behavior of a system, looking at what it does, looking at how it evaluates what it does.",
            "If you look at the paper and acting according to those behaviors.",
            "Question is, is this what humans do?",
            "I think it probably is some of the time.",
            "I think humans probably do these things deliberately some of the time.",
            "They probably do them implicitly some of the time.",
            "I really do want to emphasize a question that's come up a couple of times in conferences and so on that just because this is specified in terms of search to allow us to solve these computational problems that can only be solved by search, it doesn't mean that the systems that it is applying to have to be solved purely by have to be driven purely by search.",
            "And I'll give you an example of 1 tomorrow that isn't.",
            "OK."
        ],
        [
            "Here's an important question, just very quickly.",
            "What's the difference between good old-fashioned AI search and computational creativity?",
            "Based on this approach, OK, can I assume that everyone knows about what good old fashioned AI searches put up your hand if so.",
            "Good right?",
            "So I can really go through that fast.",
            "Then here is the."
        ],
        [
            "Algorithm for good old fashioned AI search given agenda, which is a sequence of states.",
            "If we found the solution, we stop.",
            "Note that we that immediately implies that we think there is a solution in our problem formulation, we remove the head from our sequence, giving a remainder S prime.",
            "We expand the head.",
            "That is to say we produce knew possible things from it concepts in Bones case giving S prime prime we merge S prime prime and S prime giving and US.",
            "And then we repeat from up there.",
            "We keep on going until we find a solution, whatever that may be OK, the key here to making this useful is as you all know, choosing different kinds of merging, and that's what gives us this very elegant way to put to express these algorithms.",
            "Of course, sorry, I should just make explicit in here.",
            "There has to be some kind of valuation function which is of different kinds.",
            "OK, so the key?"
        ],
        [
            "The features here is that there is a representation that can represent all and only outputs configurations of the problem, so it's kind of closed world which is not great for creativity.",
            "There's a specific solution detector which is a Boolean, which is when we've won and then we've got the heuristics.",
            "That's a little bit more creative sounding, but these two are not.",
            "The difference?"
        ],
        [
            "With the Creative Systems framework, has somebody else actually other than me called it first?",
            "Is that we have some kind of representation syntax which is itself mutable, because this system can change the rules of our defined.",
            "The syntax of the output effectively, and that can change.",
            "We have the search space, which is broadly the same as the conceptual space, so that at least is easy and we have a very similar algorithmic framework.",
            "We've got heuristics which are effectively our traversal rules and our value rules, so we kind of unpacked the heuristic elements a bit.",
            "And then there's this notion of agenda, which is like the current expansion of the space that I showed you way back using my angle bracket interpreter.",
            "What are the difference?"
        ],
        [
            "Is.",
            "Well, first of all, there's this close versus open world thing.",
            "The algorithmic framework in good old fashioned AI works on one operand.",
            "It works on the head of the agenda, which means you can't, for example, treats a genetic algorithm, let's say as in that framework.",
            "Well, that's not quite true, is it?",
            "You have to pop up to a meta level of populations to do so, which is ugly.",
            "Here you can have multiple operations, which means you can pick and choose what you're combining.",
            "You can do conceptual blending in this context."
        ],
        [
            "Fordley without having to put anything on top OK.",
            "The key point here, of course, is that good old fashioned AI can be implemented within the framework I've just proposed, but the converse is not directly true.",
            "Of course, you can always implement everything as search, so we could pop up to a meta level, but that's not the point.",
            "The point is, they're not equivalent.",
            "And Bowden was right.",
            "Creativity is not just a I search right.",
            "This was one of the criticisms that was leveled against her when she published the book.",
            "People said, oh that's just a I search.",
            "No, it isn't not at least as specified in that."
        ],
        [
            "That algorithm there.",
            "OK then, So what I've just done in a rather breathless 40 minutes is to introduce this creative systems work.",
            "This framework I've talked about, the conceptual space, the rule set are the traversal of that space defined concepts using the rule set T and the evaluation of rule set East, not T. That's an error.",
            "Sorry bout that.",
            "I've made the point that transformation or creativity is exploratory creativity at the meta level, which is a useful thing to know because it saves us going down the wrong path.",
            "And I've made the point that this creative systems framework is more expressive than the standard AI search framework of AI, notwithstanding the fact that one could, it could be implemented as a search problem in that context.",
            "OK, so then the aim is to help to use to use this to help to conceptualize creative systems.",
            "And that's what I propose to do in lectures two and three.",
            "So tomorrow I'm going to give you the full story of the creative system, and I'm going to try to explain it, at least loosely in these terms.",
            "One minute over.",
            "Any questions?"
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "It's a great pleasure to be here.",
                    "label": 0
                },
                {
                    "sent": "Very exciting to be at the first pro Seco meeting.",
                    "label": 0
                },
                {
                    "sent": "The second indeed meeting that Hannah has organized kind before us.",
                    "label": 0
                },
                {
                    "sent": "So I shall start with no further ado.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And tell you what I'm going to talk about.",
                    "label": 0
                },
                {
                    "sent": "I will start by telling people what I'm going to talk about.",
                    "label": 0
                },
                {
                    "sent": "Then I talk about it.",
                    "label": 0
                },
                {
                    "sent": "Then I tell him I've talked about it.",
                    "label": 0
                },
                {
                    "sent": "It's a good way to do things the first 45 minutes of me is going to be about how to characterize creative systems, so this is quite old work now that some people in the room may have read already.",
                    "label": 0
                },
                {
                    "sent": "Some people in the room may not have seen it because it's sufficiently old, and some people may be in between the two.",
                    "label": 0
                },
                {
                    "sent": "This is about trying to find ways based on existing philosophy.",
                    "label": 0
                },
                {
                    "sent": "That we can compare creative systems one with another.",
                    "label": 0
                },
                {
                    "sent": "The reason for wanting to do that is so that when we build systems of the kind that we've heard talked about this week.",
                    "label": 0
                },
                {
                    "sent": "Then we can maybe start to do some science and compare them and say how they behave differently and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "This is kind of a first step in that direction.",
                    "label": 0
                },
                {
                    "sent": "Tamar",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I have a double lecture which is about a specific project which is part of a much longer term project in my lab.",
                    "label": 0
                },
                {
                    "sent": "Looking at the information dynamics of music which started way back in 1997 before we even use the term computational creativity, I think maybe Tony was the first person to use the term computation was gone over there.",
                    "label": 0
                },
                {
                    "sent": "In 1996.",
                    "label": 0
                },
                {
                    "sent": "Nineteen 97 workshop wasn't it?",
                    "label": 0
                },
                {
                    "sent": "Yeah, absolutely.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So that was kind of where it all started to happen.",
                    "label": 0
                },
                {
                    "sent": "I really said all started to go wrong at that point.",
                    "label": 0
                },
                {
                    "sent": "I was mindless generation going on there so tomorrow's talk is going to be about a learning system that composes music specifically about the work of one of my former PhD students and now colleague Marcus Pierce and then.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On Thursday, I will give a rather short election.",
                    "label": 0
                },
                {
                    "sent": "As you can see, it's very short about the work we're currently doing in both the concrete and the learn to create projects which are two of the projects funded alongside Pro Seco by the EU.",
                    "label": 0
                },
                {
                    "sent": "This one is going to be much more speculative because we haven't done the work yet and the idea is to put across some of the questions that might arise when we talk about the interaction between creativity and consciousness and the other things that go on in the human mind.",
                    "label": 0
                },
                {
                    "sent": "OK, before I go on can I calibrate myself?",
                    "label": 0
                },
                {
                    "sent": "Am I clear to everyone at the back?",
                    "label": 0
                },
                {
                    "sent": "Yep OK, please stick a hand up if I'm not the same up there.",
                    "label": 0
                },
                {
                    "sent": "Yeah, good.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "I'm going to start off with an example of computational creativity, but I would claim is computational creativity and it's going to be in the area of automated composition, musical composition.",
                    "label": 0
                },
                {
                    "sent": "It's going to be in a very specific style that of JS Bar, and it's going to be very old, not the style, but the work and that's there for a reason.",
                    "label": 0
                },
                {
                    "sent": "This work does not go back as far as Ada Lady Lovelace, one of the founders of the Computing Science, before there were any computers.",
                    "label": 1
                },
                {
                    "sent": "She did suggest that computers ought to be able to compose music.",
                    "label": 0
                },
                {
                    "sent": "And as far as I know, the first recorded attempt to do that with a real computer in the sense that we understand it today, was by Hillary Isaacson back in the 1950s.",
                    "label": 0
                },
                {
                    "sent": "This piece was part of it was performed for the first time in about 25 years last year at is Mia.",
                    "label": 0
                },
                {
                    "sent": "Please more conference which was rather satisfactory.",
                    "label": 0
                },
                {
                    "sent": "This, however, is very much the computer being used as a tool to generate musical structures.",
                    "label": 0
                },
                {
                    "sent": "It's not about the computer being composer, the computer, the computer is a tool.",
                    "label": 0
                },
                {
                    "sent": "The composers, but it's quite a successful piece and really rather substantially more successful than many automated compositions have been since be lots of subsequent attempts and as people have become more aware of the science here, or rather more aware of the lack of science, here, people have started to look at ways that they can say when they've succeeded or not.",
                    "label": 0
                },
                {
                    "sent": "So one of the ways is to talk about style replication.",
                    "label": 0
                },
                {
                    "sent": "Then you can say have I got the style of such and such a person or genre replication?",
                    "label": 0
                },
                {
                    "sent": "Can we do jazz or not?",
                    "label": 0
                },
                {
                    "sent": "Can we do something that people would agree was jazz?",
                    "label": 0
                },
                {
                    "sent": "And one of the features of this kind of work is that it was almost never evaluated scientifically.",
                    "label": 1
                },
                {
                    "sent": "I'm going to talk about evaluation the second half of tomorrow's talk.",
                    "label": 0
                },
                {
                    "sent": "It's a problem for music.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we're going to start off with something successful, and then it's going to get progressively worse from there on.",
                    "label": 0
                },
                {
                    "sent": "This gentleman is called chem Electro.",
                    "label": 0
                },
                {
                    "sent": "He's a Turkish American who works in IBM Labs in Yorktown Heights.",
                    "label": 0
                },
                {
                    "sent": "I think.",
                    "label": 0
                },
                {
                    "sent": "Back in 1980, he was doing his PhD thesis on programming language called the Backtracking Specification Language, which was a sort of reinvention of prologue and the work that he chose to illustrate his PhD thesis with was the problem of harmonizing a hymn tune in the style of JS Bach.",
                    "label": 1
                },
                {
                    "sent": "So this is a problem which has been done and done and done and done again.",
                    "label": 0
                },
                {
                    "sent": "He was the first one to do it.",
                    "label": 0
                },
                {
                    "sent": "And he was also the best one to do it, which is interesting.",
                    "label": 0
                },
                {
                    "sent": "At least the results so far are best.",
                    "label": 0
                },
                {
                    "sent": "Mild stuff I shouldn't call in chemical.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "Absolute thesis is a formal computer science document about a particular programming language, but it also contains in Appendix 430 very carefully specified musical rules about how to do harmonization in the style of jazz bar.",
                    "label": 0
                },
                {
                    "sent": "Actually, I personally believe that the music theoretic contribution of the thesis is far greater than the computer science contribution because no one ever used DSL.",
                    "label": 0
                },
                {
                    "sent": "There we are.",
                    "label": 0
                },
                {
                    "sent": "It was an interesting idea.",
                    "label": 0
                },
                {
                    "sent": "It's an expert system.",
                    "label": 0
                },
                {
                    "sent": "This is what it sounds like.",
                    "label": 0
                },
                {
                    "sent": "OK, I apologize for the appalling echo there.",
                    "label": 0
                },
                {
                    "sent": "That's something to do with my new computer which isn't set right now.",
                    "label": 0
                },
                {
                    "sent": "I just said here's what it sounds like.",
                    "label": 0
                },
                {
                    "sent": "Actually, maybe that isn't what it sounds like.",
                    "label": 0
                },
                {
                    "sent": "Who thinks that was a computer who thinks it was JS Bach?",
                    "label": 0
                },
                {
                    "sent": "Anybody got any clues?",
                    "label": 0
                },
                {
                    "sent": "Difficult to judge, isn't it?",
                    "label": 0
                },
                {
                    "sent": "OK that's why Turing tests don't work OK. You have to be an expert.",
                    "label": 0
                },
                {
                    "sent": "Here's another harmonization.",
                    "label": 0
                },
                {
                    "sent": "OK, so that was the same tune.",
                    "label": 0
                },
                {
                    "sent": "One of those was indeed harmonized by JS Bach.",
                    "label": 0
                },
                {
                    "sent": "The other was harmonized by actual Lu system Corral.",
                    "label": 0
                },
                {
                    "sent": "Can anyone tell which was which?",
                    "label": 0
                },
                {
                    "sent": "Anyone think the first one was bark?",
                    "label": 0
                },
                {
                    "sent": "OK, anyone think the second one was bark?",
                    "label": 0
                },
                {
                    "sent": "OK, anyone from the first group wants to tell me why you were right and the others were wrong.",
                    "label": 0
                },
                {
                    "sent": "A little jarring in what sense?",
                    "label": 0
                },
                {
                    "sent": "Spectrum.",
                    "label": 0
                },
                {
                    "sent": "Well, you may have a point.",
                    "label": 0
                },
                {
                    "sent": "Actually it's very barky and the second one it's 2 barking right?",
                    "label": 0
                },
                {
                    "sent": "It sounds like someone's doing pastiche, which is exactly what the system was doing 1980.",
                    "label": 0
                },
                {
                    "sent": "This was it's pretty damn good.",
                    "label": 0
                },
                {
                    "sent": "It will do a lot better than your average first year music student.",
                    "label": 0
                },
                {
                    "sent": "There's a music student over there.",
                    "label": 0
                },
                {
                    "sent": "Snickering, yes?",
                    "label": 0
                },
                {
                    "sent": "OK, so the first one was bark, the second one was corral and really the only way you can tell the difference is either by knowing the corral which across the bar expert will or by spotting the fact that it runs into pastiche because it has no sense of what's about right.",
                    "label": 0
                },
                {
                    "sent": "OK, so the reason I wanted to show you this now is first of all to try and make what is otherwise quite a mathematical lecture interesting, and Secondly because we're going to come back to a problem very closely related problem at the end and I'm going to show you a system which on Thursday which does this.",
                    "label": 0
                },
                {
                    "sent": "Not exactly this problem at the park problem, but a similar harmonization problem without any prior knowledge.",
                    "label": 0
                },
                {
                    "sent": "This thing was an expert system, as I said of challu.",
                    "label": 0
                },
                {
                    "sent": "Put together 430 odd hand coded rules about how to do this, so the system wasn't really doing anything intelligent at all, it was merely generating according to the rules that had been given the system.",
                    "label": 0
                },
                {
                    "sent": "I'm going to show you on Thursday learns everything from scratch.",
                    "label": 1
                },
                {
                    "sent": "And that, to me, suggests that it is probably more creative than something that doesn't do that OK?",
                    "label": 0
                },
                {
                    "sent": "Onto",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Informal stuff if we want to do science in any kind of field at all.",
                    "label": 0
                },
                {
                    "sent": "It's very useful to have some kind of framework in which to work in which you can say here's one way of solving problem.",
                    "label": 0
                },
                {
                    "sent": "Here's another way of solving the problem.",
                    "label": 0
                },
                {
                    "sent": "Let's try and find some common ground to compare them.",
                    "label": 0
                },
                {
                    "sent": "That's where I'm going with this and I'm starting from Margaret Boden's work, which most people know.",
                    "label": 0
                },
                {
                    "sent": "Please put your hand up if you read the creative mind.",
                    "label": 0
                },
                {
                    "sent": "Margaret Bowden's book.",
                    "label": 0
                },
                {
                    "sent": "Oh surprisingly few people.",
                    "label": 0
                },
                {
                    "sent": "OK, those people who haven't read it should read it.",
                    "label": 0
                },
                {
                    "sent": "It's very easy read.",
                    "label": 0
                },
                {
                    "sent": "It's a very good book an it really produces some views which are kind of fundamental to a lot of the thinking that goes on in this field, right?",
                    "label": 0
                },
                {
                    "sent": "I'm glad that most of you haven't read, however, because it means my slides are less boring.",
                    "label": 0
                },
                {
                    "sent": "OK, so in her 1990 book The Creative Mind.",
                    "label": 1
                },
                {
                    "sent": "She outlines a characterization of what creative behavior might be from a cognitive philosophy perspective.",
                    "label": 0
                },
                {
                    "sent": "So what philosophy, of course means is that you don't have to be formal, and at least that kind of philosophy, and she isn't formal.",
                    "label": 0
                },
                {
                    "sent": "Which means, then, that the characterization is rather vague, as we found over the years, it's open to different interpretations, and one of the things that I've tried to do here is to pin down a particular interpretation that it might have.",
                    "label": 0
                },
                {
                    "sent": "So then what I'm trying to do in this lecture is to take Bowdens ideas, which I shall explain briefly.",
                    "label": 0
                },
                {
                    "sent": "Tony already alluded to them.",
                    "label": 0
                },
                {
                    "sent": "Yesterday morning very clearly so.",
                    "label": 0
                },
                {
                    "sent": "That was nice.",
                    "label": 0
                },
                {
                    "sent": "I was able to delete some slides and.",
                    "label": 0
                },
                {
                    "sent": "I'm going to try and give you a very quick graphical idea of how that works, and then I'm going to show you how it can be written down informally.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which I claim would be a useful thing to do.",
                    "label": 0
                },
                {
                    "sent": "So creative activity is cast as the discovery of concept, which of course might correspond directly with Artifact, so it's not purely a cognitive.",
                    "label": 1
                },
                {
                    "sent": "Theory concepts in a conceptual space.",
                    "label": 0
                },
                {
                    "sent": "The conceptual space is the space of all possible things.",
                    "label": 0
                },
                {
                    "sent": "In some sense, no.",
                    "label": 0
                },
                {
                    "sent": "Actually, that's not true.",
                    "label": 0
                },
                {
                    "sent": "The conceptual space is the space of all possible things that are the things you're looking for.",
                    "label": 0
                },
                {
                    "sent": "So the space of all possible buses, or the space of all possible bananas if you're trying to create bananas or whatever.",
                    "label": 0
                },
                {
                    "sent": "All possible concepts available to the creative agent looking for a particular thing, so it's kind of an AI ish kind of perspective because we're sort of assuming the solution in the way that we state the problem and we're going to address that later on.",
                    "label": 0
                },
                {
                    "sent": "That space is constrained by rules, so you can think of each one of these blobs here as a point in a space which has a number of parameters in it which are constrained by rules.",
                    "label": 0
                },
                {
                    "sent": "This is a very standard AI way of thinking.",
                    "label": 0
                },
                {
                    "sent": "Some people would call this a search space.",
                    "label": 0
                },
                {
                    "sent": "And within that space you have a starting point, which is possibly a novel concept and you have some partially created concepts and you have some complete concepts.",
                    "label": 0
                },
                {
                    "sent": "The space as I said, is constrained by rules, so contradictory things are not allowed.",
                    "label": 0
                },
                {
                    "sent": "You can't be both big and small, for example.",
                    "label": 0
                },
                {
                    "sent": "And then we define something called exploratory creativity.",
                    "label": 0
                },
                {
                    "sent": "This is one of bowdens terms, as the action of searching that conceptual space for a new concept.",
                    "label": 1
                },
                {
                    "sent": "Something like this.",
                    "label": 0
                },
                {
                    "sent": "Hey, we've won.",
                    "label": 0
                },
                {
                    "sent": "So anyone who knows about artificial intelligence, good old fashioned as intelligence, knows that this is standard search.",
                    "label": 0
                },
                {
                    "sent": "Except that it's not quite standard search.",
                    "label": 0
                },
                {
                    "sent": "Because we don't really know what the concept is.",
                    "label": 0
                },
                {
                    "sent": "In Standard I we always have the notion of a stopping point in creativity.",
                    "label": 0
                },
                {
                    "sent": "We don't necessarily know what The thing is that we're looking for, so it complicates matters.",
                    "label": 0
                },
                {
                    "sent": "But for the minute, let's just think in terms of this.",
                    "label": 0
                },
                {
                    "sent": "So my point here is that you can find different concepts within a given space which are complete.",
                    "label": 0
                },
                {
                    "sent": "And you can find the same concept in various different ways.",
                    "label": 0
                },
                {
                    "sent": "OK. And it's important to understand here that this search idea is an abstraction.",
                    "label": 0
                },
                {
                    "sent": "It's a way of describing things it is not making the strong claim that all creativity is search.",
                    "label": 0
                },
                {
                    "sent": "The point is that this kind of search approach can be applied to solve any standard computational algorithm, including NP complete ones.",
                    "label": 0
                },
                {
                    "sent": "Of course it might take an infinite time to do so, but at least you can begin to do that by searching.",
                    "label": 0
                },
                {
                    "sent": "So what this means is that we can get computers to do things that we know computers cannot do.",
                    "label": 0
                },
                {
                    "sent": "In the usual computational analytic way, that's the I mean.",
                    "label": 0
                },
                {
                    "sent": "That's a very loose specification of the point.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right, so that's exploratory creativity.",
                    "label": 0
                },
                {
                    "sent": "You imagine that there's a space of all things that you're interested in out there, and then it's finding the ones that you want in that space.",
                    "label": 0
                },
                {
                    "sent": "That is the game transformation or creativity is a different kind of game, and Boden claims that it's a greater kind of creativity.",
                    "label": 0
                },
                {
                    "sent": "I would dispute that claim, but I'm not going to go into that now.",
                    "label": 0
                },
                {
                    "sent": "The idea of transformation or creativity is that you take that space of things and you transform it into a different one.",
                    "label": 0
                },
                {
                    "sent": "Which means then that you can search in a different kind of way, perhaps.",
                    "label": 1
                },
                {
                    "sent": "Or you can search for different kinds of things.",
                    "label": 0
                },
                {
                    "sent": "One example of that might be, for example the kind of creativity that Arnold Schoenberg did when he moved from total music to non tonal music.",
                    "label": 0
                },
                {
                    "sent": "It's a fairly big kind of shift for those people who know such things.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 1
                },
                {
                    "sent": "What you have to do in order to achieve this is to change the rules of the conceptual space so that the space itself, the constraints on it change.",
                    "label": 0
                },
                {
                    "sent": "Alan Bundy and I, and probably other people, to have argued against this notion that transformation of creativity is necessarily bigger thinking than exploratory creativity.",
                    "label": 1
                },
                {
                    "sent": "It's overly simple simply because it can be very hard to find concepts that are in your conceptual space, so it doesn't follow necessarily that a great creative act is a transformation or one.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Here are some reasons why people say computers are not creative, and indeed why they.",
                    "label": 0
                },
                {
                    "sent": "Some people say that Bowdens specification is not creative.",
                    "label": 0
                },
                {
                    "sent": "So a symbolic system cannot create new concepts, right?",
                    "label": 1
                },
                {
                    "sent": "If we have an alphabet of symbols which claims to represent the solution, the set of solutions to some problem, then we can't create new concepts in that because we would have to create new meaning for those symbols.",
                    "label": 0
                },
                {
                    "sent": "I think probably most people in the room realize that this is a spurious argument, right?",
                    "label": 0
                },
                {
                    "sent": "The bottom line is you can do all sorts of things by having, for example, complex representations which are compositional, and then you create new compositions and you can create new symbols and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "So this is, this is just a misunderstanding of what it is to represent things.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A system which is exploring a search based defined by representation is not being creative.",
                    "label": 1
                },
                {
                    "sent": "This would be true if it were the case that all representations were finite.",
                    "label": 0
                },
                {
                    "sent": "But not all representations of finite, and since not all representations of finite, it means that you can't necessarily enumerate all the things that are in space, which means you can't necessarily know all of the things that are in a space.",
                    "label": 0
                },
                {
                    "sent": "So in principle this is a spurious argument.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I particularly like this one.",
                    "label": 0
                },
                {
                    "sent": "Non symbolic systems generalize via simple mathematical process which is not created.",
                    "label": 1
                },
                {
                    "sent": "This is the argument against neural networks being creative.",
                    "label": 0
                },
                {
                    "sent": "It's a really simple process, it's just mathematics.",
                    "label": 0
                },
                {
                    "sent": "How can it be creative?",
                    "label": 0
                },
                {
                    "sent": "Who says this isn't what brains do?",
                    "label": 0
                },
                {
                    "sent": "Nobody knows, so this is certainly not a proven claim, even if it's not a clearly spurious one.",
                    "label": 0
                },
                {
                    "sent": "OK, I just thought I'd throw those in there because those are some of the standard arguments that people give against this kind of formalization.",
                    "label": 0
                },
                {
                    "sent": "A lot of them can be summarized as all creativity is far too special to be formalized.",
                    "label": 0
                },
                {
                    "sent": "We know what AI people think of that kind of thing.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so let's start from the obvious position, which isn't explicit in Bowden's book, but it's kind of implicit all the way through which we're going to represent this conceptual space as a space of multidimensional.",
                    "label": 0
                },
                {
                    "sent": "Sorry as a multidimensional metric space.",
                    "label": 1
                },
                {
                    "sent": "It doesn't have to be a metric space.",
                    "label": 0
                },
                {
                    "sent": "Actually.",
                    "label": 0
                },
                {
                    "sent": "It's quite useful if it's a metric space 10 years later.",
                    "label": 0
                },
                {
                    "sent": "Pattaya before she produced a book called Conceptual Spaces which takes this a little further and the space is actually do have to be geometrical in a very particular way.",
                    "label": 0
                },
                {
                    "sent": "One of two very particular ways.",
                    "label": 0
                },
                {
                    "sent": "So in this example of sort of convergence here, these two pieces of work seem to be fairly separate in their development, but they've converged in a particular way.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "But I'm talking about Bowdens conceptual space here.",
                    "label": 0
                },
                {
                    "sent": "Not yet in force.",
                    "label": 0
                },
                {
                    "sent": "Right, so partial and complete concepts are represented as points in the space, so there's an immediate consequence there, which is that we have to have some notion of undefined in our dimensions.",
                    "label": 1
                },
                {
                    "sent": "If we're going to represent partial concepts, then there has to be some notion of a point in the space having values which are undefined.",
                    "label": 1
                },
                {
                    "sent": "It's probably obvious to you that each dimension of the space is going to represent a feature of the domain.",
                    "label": 0
                },
                {
                    "sent": "And then in good OL fashioned AI terms, each point in the space denotes a set of property value pairs.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right, so that's given us, our smoker, sport of things that we could make our sandwiches from.",
                    "label": 0
                },
                {
                    "sent": "It hasn't given us a means of making sandwiches.",
                    "label": 0
                },
                {
                    "sent": "And in order to do that, first of all, we need to know what constitutes a sandwich, not merely a pile of stuff, but something with some bread at the bottom, and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "So we have a set of rules which specify what is a well formed thing within that space.",
                    "label": 1
                },
                {
                    "sent": "That rule set of rules is called R and the conceptual space we call C for the want of anything more imaginative.",
                    "label": 0
                },
                {
                    "sent": "Now here is the difference between this formalization and Boden, Boden is quite happy to talk about a conceptual space of things.",
                    "label": 0
                },
                {
                    "sent": "Navigating it and finding the thing that you sort of knew you wanted.",
                    "label": 0
                },
                {
                    "sent": "And that for me is a problem because I want to be creative in spaces where I didn't know I wanted a thing.",
                    "label": 0
                },
                {
                    "sent": "I want to be able to recognize a creative act that I've made, even though I didn't realize that I was actually trying to do that at the time, and therefore there must be a universe which contains C, because otherwise you wouldn't be able to go outside.",
                    "label": 0
                },
                {
                    "sent": "See simple as that.",
                    "label": 0
                },
                {
                    "sent": "Therefore, this are the set of rules that Bowden talks about as well is a set of rules which picks particular elements of this conceptual space of sandwiches or postboxes or whatever it is.",
                    "label": 1
                },
                {
                    "sent": "Giraffes from the universe.",
                    "label": 0
                },
                {
                    "sent": "It's quite important to notice that there's a duality here, so you can talk about subspaces where you have a smaller number of dimensions.",
                    "label": 0
                },
                {
                    "sent": "You select a number of dimensions from higher dimensional space, or you can talk about areas of the high dimensional space with undefined things.",
                    "label": 0
                },
                {
                    "sent": "These two things are broadly equivalent, so you can think of them in which either way is comfortable, so therefore he's off his our first mathematical formula C is a subset of you.",
                    "label": 0
                },
                {
                    "sent": "It says strict subset there because we probably will never be in a situation.",
                    "label": 0
                },
                {
                    "sent": "Of trying to create in a context of everything we probably usable, I can't imagine a situation where we wouldn't have at least.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some idea of what we were trying to do.",
                    "label": 0
                },
                {
                    "sent": "If we have a set of rules are then we need a language L in which to express it, so that's all fine, and we're going to need an interpreter for that, because otherwise it wouldn't actually do anything.",
                    "label": 1
                },
                {
                    "sent": "So we have a language L, and the interpreter gives it semantics to allow us to express the rules are which define the conceptual space.",
                    "label": 0
                },
                {
                    "sent": "Given a universe, you.",
                    "label": 0
                },
                {
                    "sent": "So we will give a notation for that.",
                    "label": 1
                },
                {
                    "sent": "An interpreter which matches arguments, a set of rules in L2.",
                    "label": 1
                },
                {
                    "sent": "An effective procedure for selecting the elements of you.",
                    "label": 0
                },
                {
                    "sent": "So now we can say something more precise, which is that C equals the result of interpreting our and applying the interpretation to you.",
                    "label": 0
                },
                {
                    "sent": "So this is a filter effectively straightforward filter.",
                    "label": 0
                },
                {
                    "sent": "We're going to need an old concept and you'll see why in a moment, and I'm going to call that top.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what we've got now is the means of identifying a class of things which are of interest.",
                    "label": 0
                },
                {
                    "sent": "That's what the conceptual spaces.",
                    "label": 0
                },
                {
                    "sent": "But what we don't have yet is a means of finding the ones in that set that we want to talk about.",
                    "label": 0
                },
                {
                    "sent": "So we allow ourselves another set of rules, T. This is a program just like the set of rules are was.",
                    "label": 0
                },
                {
                    "sent": "It's a program which is going this time to navigate our way through the space.",
                    "label": 0
                },
                {
                    "sent": "So it's going to be trying to find ways of traversing that space.",
                    "label": 0
                },
                {
                    "sent": "And those ways could be arbitrarily complicated, I should say.",
                    "label": 0
                },
                {
                    "sent": "And to explore things and to find.",
                    "label": 0
                },
                {
                    "sent": "First of all, complete solutions, but also then solutions which are desirable.",
                    "label": 0
                },
                {
                    "sent": "I will talk about the desirability in a moment.",
                    "label": 0
                },
                {
                    "sent": "So Bowden in her book and also in subsequent publications has emphasized the need for evaluation in creativity.",
                    "label": 0
                },
                {
                    "sent": "And as we said in Dublin at the conference a couple of years ago we were scoffing for a decade.",
                    "label": 0
                },
                {
                    "sent": "I think it was interning at mere generation.",
                    "label": 0
                },
                {
                    "sent": "So the evaluation part is fundamentally important and we really don't know how to do it.",
                    "label": 0
                },
                {
                    "sent": "So there's some open research to be done there.",
                    "label": 0
                },
                {
                    "sent": "So we're going to do the same again.",
                    "label": 0
                },
                {
                    "sent": "We're going to introduce a set of rules written in the same language.",
                    "label": 1
                },
                {
                    "sent": "Really useful to have them all in the same language, which then may be used to accept or reject concepts in terms of their quality.",
                    "label": 1
                },
                {
                    "sent": "Notice I'm being a little vague here about whether I'm talking bout booleans or whether I'm talking about continuous values, but if they could be fuzzy values, whatever you like, really here.",
                    "label": 0
                },
                {
                    "sent": "And now we're going to talk about the effective procedure for traversing this space.",
                    "label": 0
                },
                {
                    "sent": "I'm going to use a slightly complex, more complex symbol there, so that is going to take three sets of rules.",
                    "label": 0
                },
                {
                    "sent": "Three sets of rules, which is and will return an effective procedure for computing an ordered set of partial concepts from another.",
                    "label": 1
                },
                {
                    "sent": "So there's a lot in that.",
                    "label": 0
                },
                {
                    "sent": "This is actually a generalization of the good old fashioned AI approach to specifying search algorithms.",
                    "label": 0
                },
                {
                    "sent": "Actually.",
                    "label": 0
                },
                {
                    "sent": "The difference, several differences.",
                    "label": 0
                },
                {
                    "sent": "First of all, we've got a tripartite unit here.",
                    "label": 0
                },
                {
                    "sent": "Doing our searching and then we have.",
                    "label": 0
                },
                {
                    "sent": "Ordered set here or sequences.",
                    "label": 0
                },
                {
                    "sent": "If you prefer to think of them that way.",
                    "label": 0
                },
                {
                    "sent": "Rather than an agenda and a goal, and so and so forth.",
                    "label": 0
                },
                {
                    "sent": "So we have no goal test here.",
                    "label": 0
                },
                {
                    "sent": "By comparison with the old system.",
                    "label": 0
                },
                {
                    "sent": "So now I can write this down.",
                    "label": 0
                },
                {
                    "sent": "Which is then a general description of the way I process my concepts that I navigate my search space in terms of a specification of what the conceptual space is, a specification of, what my trans transition rules are, my exploracion rules, and of my evaluation rules.",
                    "label": 0
                },
                {
                    "sent": "So I don't necessarily have to use all of those all the time.",
                    "label": 0
                },
                {
                    "sent": "So I could be ignoring, for example, the evaluation rules and merely generating.",
                    "label": 0
                },
                {
                    "sent": "Or I could be ignoring the conceptual space rules are and just wildly generating in the hope that I might find something valuable.",
                    "label": 0
                },
                {
                    "sent": "How many hours do that, I wonder?",
                    "label": 0
                },
                {
                    "sent": "I do as I can.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sometimes.",
                    "label": 0
                },
                {
                    "sent": "OK. Another little bit of mathematical tool here.",
                    "label": 0
                },
                {
                    "sent": "This operator Diamond, which I've borrowed from the fixed point operator in programming language semantics.",
                    "label": 0
                },
                {
                    "sent": "Is useful because it allows us to create things to specify things like this.",
                    "label": 0
                },
                {
                    "sent": "So actually this is a definition here.",
                    "label": 0
                },
                {
                    "sent": "If I take a function and I do that to it, then this is what that means.",
                    "label": 0
                },
                {
                    "sent": "Effectively what it means is that I'm going to keep on applying that function to everything that I could ever apply it to until I well, not, not until I reach a fixed point.",
                    "label": 0
                },
                {
                    "sent": "Actually, we hope that we reach a fixed point, or it might be an infinite set, whichever is just an enumeration operator.",
                    "label": 0
                },
                {
                    "sent": "So we can now enumerate the conceptual space for our creative agent starting from the empty concept, which is why I needed that to place to start from.",
                    "label": 1
                },
                {
                    "sent": "So what this basically is saying is that I can enumerate my conceptual space C by applying the fixpoint operator to this function and then applying it to the empty concept.",
                    "label": 0
                },
                {
                    "sent": "So I'm filling in my concept in all the possible ways that I'm allowed to according to those three sets of rules.",
                    "label": 0
                },
                {
                    "sent": "So what I've done now is I've given a way of specifying that conceptual space that Bowden was talking about, I think.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This thing could in principle be a subset of C, actually, because it could be that our set of rules.",
                    "label": 1
                },
                {
                    "sent": "T which allows us to traverse that space does not give us a connected path through the entire space that our specifies.",
                    "label": 0
                },
                {
                    "sent": "And so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "So, for example, given that interpreter and I've got my rules are in there, so my rules T could be looking at.",
                    "label": 0
                },
                {
                    "sent": "My rules are and meter interpreting them an seeing what's going on and guiding the search accordingly?",
                    "label": 0
                },
                {
                    "sent": "Equally, they could be looking at my rules E. And guiding the search according to the quality of the items that are being looked at, so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So these are the things I've just said.",
                    "label": 0
                },
                {
                    "sent": "But what this is allowing us to do is to specify a little bit more precisely than Bowden does with their English words.",
                    "label": 0
                },
                {
                    "sent": "Which parts of a system are which?",
                    "label": 0
                },
                {
                    "sent": "Because we could just label them?",
                    "label": 0
                },
                {
                    "sent": "Wouldn't say this part of the program is doing all this part of the program is doing T and so on.",
                    "label": 0
                },
                {
                    "sent": "That's what I'm going to do later on in the muse.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Work so here is what an exploratory creative system looks like if you specify it using this approach.",
                    "label": 1
                },
                {
                    "sent": "It's a septuplet which consists of the universe, the language, perhaps the language should before the universe.",
                    "label": 1
                },
                {
                    "sent": "Because you can't specify the universe without the language, it doesn't really matter.",
                    "label": 0
                },
                {
                    "sent": "The two interpreters and then those three rules set.",
                    "label": 0
                },
                {
                    "sent": "That's a specification of an exploratory creative system.",
                    "label": 1
                },
                {
                    "sent": "According to Bowden's nation.",
                    "label": 0
                },
                {
                    "sent": "So then what happens that so on?",
                    "label": 0
                },
                {
                    "sent": "Something very strange will happen with my slides.",
                    "label": 0
                },
                {
                    "sent": "This was supposed to be up.",
                    "label": 0
                },
                {
                    "sent": "But I just said it anyway.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so that's exploratory creativity.",
                    "label": 0
                },
                {
                    "sent": "It was quite easy, really.",
                    "label": 0
                },
                {
                    "sent": "And then there's nothing particularly advanced about doing that.",
                    "label": 0
                },
                {
                    "sent": "But then something interesting starts to happen.",
                    "label": 0
                },
                {
                    "sent": "So Bowden talks about transformation or creativity as changing this rule set are.",
                    "label": 1
                },
                {
                    "sent": "To represent a different conceptual space, but in this formalism.",
                    "label": 0
                },
                {
                    "sent": "The rule set is available for scrutiny.",
                    "label": 0
                },
                {
                    "sent": "Which it kind of isn't inboden's way of thinking.",
                    "label": 0
                },
                {
                    "sent": "At least not explicitly.",
                    "label": 0
                },
                {
                    "sent": "What's more, there's another set of rules that doesn't even mention that can be transformed.",
                    "label": 1
                },
                {
                    "sent": "So first of all, we can transform R. As I said, to produce a new conceptual space.",
                    "label": 0
                },
                {
                    "sent": "Imagine a cloud billowing as time moves on.",
                    "label": 0
                },
                {
                    "sent": "But we could also transform T, so finding a new way to search the space is as much transformative as finding a.",
                    "label": 0
                },
                {
                    "sent": "A new space to transfer to search.",
                    "label": 0
                },
                {
                    "sent": "OK, so another little insight there which isn't in.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Book.",
                    "label": 0
                },
                {
                    "sent": "Yeah, if I may, why not transform E as well?",
                    "label": 0
                },
                {
                    "sent": "Because it's really complicated.",
                    "label": 0
                },
                {
                    "sent": "Right, yes, you can transfer me as well.",
                    "label": 0
                },
                {
                    "sent": "The question is, according to what criteria do you do so?",
                    "label": 0
                },
                {
                    "sent": "OK, I'm getting a little bit worried that I'm not going to have time to go all the way through my slides.",
                    "label": 0
                },
                {
                    "sent": "I will come back to that later on if I may.",
                    "label": 0
                },
                {
                    "sent": "OK, so the search space, now the full search base, the universe is the power set of that language.",
                    "label": 1
                },
                {
                    "sent": "It's all the things we could express in that language.",
                    "label": 0
                },
                {
                    "sent": "So that's how universe.",
                    "label": 0
                },
                {
                    "sent": "And if we allow ourselves a meta language which allows us to describe both L and obviously its powerset.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then we can start to build a similar kind of description to the one idea of the exploratory creativity system about a transformation or creativity system.",
                    "label": 0
                },
                {
                    "sent": "So we're going to need some rules to allow ourselves to explore this conceptual space of rule sets.",
                    "label": 0
                },
                {
                    "sent": "So conceptual space of conceptual spaces I'm going to call that are sub L. 'cause I'm unimaginative, we're also going to need a search strategy.",
                    "label": 0
                },
                {
                    "sent": "Exploratory strategy for defining that search base.",
                    "label": 0
                },
                {
                    "sent": "So that's Isabelle.",
                    "label": 0
                },
                {
                    "sent": "And carefully ignoring his question just now.",
                    "label": 0
                },
                {
                    "sent": "As you can see I chose to ignore that question on this slide.",
                    "label": 0
                },
                {
                    "sent": "Actually, we will have an evaluation criterion as well, but it's going to be different.",
                    "label": 0
                },
                {
                    "sent": "It's going to be more complicated.",
                    "label": 0
                },
                {
                    "sent": "So if we're going to use this meta language as before for these specifications and we can use the same interpreters for that matter.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Language, so we make sure we do.",
                    "label": 0
                },
                {
                    "sent": "That's in Amalgamated Metaobject language, like Prolog.",
                    "label": 0
                },
                {
                    "sent": "The only thing we've got left is this evaluation question.",
                    "label": 1
                },
                {
                    "sent": "And hey presto, when we write those down in the same order, we get something that looks exactly the same.",
                    "label": 0
                },
                {
                    "sent": "So the argument that can be made here is that this shows us very clearly that transformation of creativity is nothing more than exploratory creativity.",
                    "label": 1
                },
                {
                    "sent": "At the meta level, as Bruce Buchanan said in 2000 or at.",
                    "label": 0
                },
                {
                    "sent": "As Bowden put it, exploratory creativity in the space of possible conceptual spaces.",
                    "label": 0
                },
                {
                    "sent": "Plus it gives us the notion of the.",
                    "label": 0
                },
                {
                    "sent": "T variation.",
                    "label": 0
                },
                {
                    "sent": "Alright then, so the point here is that what we've done is to simplify the whole thing.",
                    "label": 0
                },
                {
                    "sent": "We've picked the balloon of transformational creativity and said, look, we can characterize it like this and maybe understand better what it is.",
                    "label": 0
                },
                {
                    "sent": "OK, this your question.",
                    "label": 0
                },
                {
                    "sent": "The Isabelle may be characterized in terms of E, and I've written about how to do that, but it's far too complicated to talk about electric context.",
                    "label": 1
                },
                {
                    "sent": "You have to have the paper in front of it to make sense.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So that wasn't really a big deal if we thought it.",
                    "label": 0
                },
                {
                    "sent": "As I say, Bruce Buchanan wrote about this idea, creativity at the meta level in 2000, and if you read this book, you can sort of see it in there.",
                    "label": 0
                },
                {
                    "sent": "All this does is allow us to go through a process which kind of makes the point.",
                    "label": 0
                },
                {
                    "sent": "But now we can start saying some interesting things about our creative systems, and this is really the point of this whole business.",
                    "label": 0
                },
                {
                    "sent": "We can look at how the different components of these descriptions interact, how how they interact can tell us useful information.",
                    "label": 1
                },
                {
                    "sent": "So let's look at how.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some can fail to create.",
                    "label": 0
                },
                {
                    "sent": "For example, it can be uninspired, I should say, incidentally, that this terminology.",
                    "label": 0
                },
                {
                    "sent": "Fine, I wrote it down before Graham started looking at his terminology, or maybe at the same time, but certainly before I'd seen it so inspiration does not mean the same thing as inspiring set in grams formalism, different stuff, yes.",
                    "label": 0
                },
                {
                    "sent": "Coincidence terminology, which is unfortunate, but it does not mean the same thing.",
                    "label": 0
                },
                {
                    "sent": "OK, so I'm inspiration is the inability to produce valued outputs, but we can split it up into some useful things.",
                    "label": 1
                },
                {
                    "sent": "Hopeless on inspiration, conceptual inspiration on inspiration and generative on inspiration.",
                    "label": 0
                },
                {
                    "sent": "So these are things these are labels that we can apply to creative systems that work, or perhaps fail to work in particular ways.",
                    "label": 0
                },
                {
                    "sent": "We can use them as well, formedness checks and so on.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hopeless an inspiration.",
                    "label": 0
                },
                {
                    "sent": "Works very straightforwardly.",
                    "label": 0
                },
                {
                    "sent": "There are no evaluated.",
                    "label": 0
                },
                {
                    "sent": "There are no sorry.",
                    "label": 0
                },
                {
                    "sent": "There are no concepts in the universe which are evaluated to be good according to this evaluation function.",
                    "label": 1
                },
                {
                    "sent": "So this creative system has no chance of ever doing anything useful, so you might as well give up now.",
                    "label": 0
                },
                {
                    "sent": "Maybe that's something you can prove given an actual system, so that's useful to know.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here's another one conceptual in an inspiration.",
                    "label": 0
                },
                {
                    "sent": "So what this means is that our applying our rule set within our universe and evaluating things will never give us a value concept, so there are no valued concepts in our conceptual space.",
                    "label": 1
                },
                {
                    "sent": "That's kind of Anil form system in some sense.",
                    "label": 0
                },
                {
                    "sent": "So that's useful.",
                    "label": 0
                },
                {
                    "sent": "This one can be used to trigger trigger a particular kind of behavior, which I've called aberrant and I'll come back to that later if I have time.",
                    "label": 0
                },
                {
                    "sent": "I'm really running.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Short OK generated by an inspiration is where.",
                    "label": 1
                },
                {
                    "sent": "The translator sorry I keep wanting to say transformation for tea, but I don't mean that the transition rules here that take you around the space failed to find the value concepts so there aren't any valued concepts in the part of the space that your particular creative system can explore.",
                    "label": 1
                },
                {
                    "sent": "I wouldn't be at all surprised if we end up in that situation a lot without realizing it.",
                    "label": 0
                },
                {
                    "sent": "With our systems.",
                    "label": 0
                },
                {
                    "sent": "OK, again, it would be rather useful.",
                    "label": 0
                },
                {
                    "sent": "To do that, and here's the possibility of triggering a transformation.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 1
                },
                {
                    "sent": "If we transform T here, we might have some chance of winning, and indeed the way that this fails might tell us how to transform T. So now we can start having a system which is reflective.",
                    "label": 0
                },
                {
                    "sent": "Given this kind of reasoning, so we're starting to see why it's useful if the system can reflect on itself in this way, then it can change its behavior in ways that are probably human, like because certainly if we realized that our method of painting would never produce the kinds of images we wanted, then we probably change our method of painting, wouldn't we?",
                    "label": 0
                },
                {
                    "sent": "Or perhaps switch to photography?",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, let's look at this idea of aberration.",
                    "label": 0
                },
                {
                    "sent": "The production of new concepts which are not existing which are not in the existing conceptual space.",
                    "label": 1
                },
                {
                    "sent": "So this is deviation from the expected.",
                    "label": 0
                },
                {
                    "sent": "How could that happen?",
                    "label": 0
                },
                {
                    "sent": "Well, it can happen because there's a universe which is bigger than the conceptual space for a start.",
                    "label": 0
                },
                {
                    "sent": "So you've got your conceptual space.",
                    "label": 0
                },
                {
                    "sent": "You've got your bigger universe.",
                    "label": 0
                },
                {
                    "sent": "You're transitioning, transitioning through your conceptual space, and you just pop outside for a moment and you find something out there which you consider.",
                    "label": 0
                },
                {
                    "sent": "Why would you consider it?",
                    "label": 0
                },
                {
                    "sent": "Well, if it evaluates to something good for, evaluates a good, then you found a reason.",
                    "label": 0
                },
                {
                    "sent": "Perhaps to change your conceptual space and we've got.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Three kinds of aberration.",
                    "label": 0
                },
                {
                    "sent": "So aberration happens when a creative action, a creative agent, finds concepts of valued, but which are not in the conceptual space.",
                    "label": 1
                },
                {
                    "sent": "And that, incidentally, is why Y has to be represented distinctly from are not one, just in terms of the other.",
                    "label": 0
                },
                {
                    "sent": "And here's how you would write it down in my squigly formulation.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Perfect aberration is the case where all aberrant concepts are valued.",
                    "label": 1
                },
                {
                    "sent": "So what do you do there?",
                    "label": 0
                },
                {
                    "sent": "All concepts which have been found which are outside the conceptual space are valuable.",
                    "label": 0
                },
                {
                    "sent": "Change the conceptual space, right?",
                    "label": 0
                },
                {
                    "sent": "You can do some machine learning and you can change the integral space, excellent.",
                    "label": 0
                },
                {
                    "sent": "There we are.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, productive aberration is less so less than perfect, but nevertheless we've still got some things that are valued.",
                    "label": 0
                },
                {
                    "sent": "This is quite interesting, because we may want to transform our to include the new things, but we also want to transform T to exclude the things that are not valued.",
                    "label": 0
                },
                {
                    "sent": "That and you.",
                    "label": 0
                },
                {
                    "sent": "So we might want to check transform R or T or both.",
                    "label": 1
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So you see, the kind of things that we can get into here.",
                    "label": 0
                },
                {
                    "sent": "Some of them are really quite useful and subtle pointless aberration.",
                    "label": 0
                },
                {
                    "sent": "Well, as with hopeless une inspiration.",
                    "label": 0
                },
                {
                    "sent": "Pointless aberration is the case of just wandering off, doing something useful, doing something useless outside the conceptual space that, frankly, you know you should have been in, so that's something we don't want our systems to do generally.",
                    "label": 0
                },
                {
                    "sent": "Or we just transform T sorry not all as well.",
                    "label": 0
                },
                {
                    "sent": "We want transform T and.",
                    "label": 1
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's all there.",
                    "label": 0
                },
                {
                    "sent": "OK, so the point of all of this is to pave the way for creative agents which can reason about their own behavior in a mechanistic way.",
                    "label": 1
                },
                {
                    "sent": "We have a standard means of describing the behavior of a system, looking at what it does, looking at how it evaluates what it does.",
                    "label": 0
                },
                {
                    "sent": "If you look at the paper and acting according to those behaviors.",
                    "label": 1
                },
                {
                    "sent": "Question is, is this what humans do?",
                    "label": 0
                },
                {
                    "sent": "I think it probably is some of the time.",
                    "label": 0
                },
                {
                    "sent": "I think humans probably do these things deliberately some of the time.",
                    "label": 0
                },
                {
                    "sent": "They probably do them implicitly some of the time.",
                    "label": 1
                },
                {
                    "sent": "I really do want to emphasize a question that's come up a couple of times in conferences and so on that just because this is specified in terms of search to allow us to solve these computational problems that can only be solved by search, it doesn't mean that the systems that it is applying to have to be solved purely by have to be driven purely by search.",
                    "label": 0
                },
                {
                    "sent": "And I'll give you an example of 1 tomorrow that isn't.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here's an important question, just very quickly.",
                    "label": 0
                },
                {
                    "sent": "What's the difference between good old-fashioned AI search and computational creativity?",
                    "label": 1
                },
                {
                    "sent": "Based on this approach, OK, can I assume that everyone knows about what good old fashioned AI searches put up your hand if so.",
                    "label": 0
                },
                {
                    "sent": "Good right?",
                    "label": 0
                },
                {
                    "sent": "So I can really go through that fast.",
                    "label": 0
                },
                {
                    "sent": "Then here is the.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Algorithm for good old fashioned AI search given agenda, which is a sequence of states.",
                    "label": 1
                },
                {
                    "sent": "If we found the solution, we stop.",
                    "label": 1
                },
                {
                    "sent": "Note that we that immediately implies that we think there is a solution in our problem formulation, we remove the head from our sequence, giving a remainder S prime.",
                    "label": 0
                },
                {
                    "sent": "We expand the head.",
                    "label": 0
                },
                {
                    "sent": "That is to say we produce knew possible things from it concepts in Bones case giving S prime prime we merge S prime prime and S prime giving and US.",
                    "label": 1
                },
                {
                    "sent": "And then we repeat from up there.",
                    "label": 0
                },
                {
                    "sent": "We keep on going until we find a solution, whatever that may be OK, the key here to making this useful is as you all know, choosing different kinds of merging, and that's what gives us this very elegant way to put to express these algorithms.",
                    "label": 0
                },
                {
                    "sent": "Of course, sorry, I should just make explicit in here.",
                    "label": 0
                },
                {
                    "sent": "There has to be some kind of valuation function which is of different kinds.",
                    "label": 0
                },
                {
                    "sent": "OK, so the key?",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The features here is that there is a representation that can represent all and only outputs configurations of the problem, so it's kind of closed world which is not great for creativity.",
                    "label": 1
                },
                {
                    "sent": "There's a specific solution detector which is a Boolean, which is when we've won and then we've got the heuristics.",
                    "label": 0
                },
                {
                    "sent": "That's a little bit more creative sounding, but these two are not.",
                    "label": 0
                },
                {
                    "sent": "The difference?",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "With the Creative Systems framework, has somebody else actually other than me called it first?",
                    "label": 0
                },
                {
                    "sent": "Is that we have some kind of representation syntax which is itself mutable, because this system can change the rules of our defined.",
                    "label": 1
                },
                {
                    "sent": "The syntax of the output effectively, and that can change.",
                    "label": 0
                },
                {
                    "sent": "We have the search space, which is broadly the same as the conceptual space, so that at least is easy and we have a very similar algorithmic framework.",
                    "label": 1
                },
                {
                    "sent": "We've got heuristics which are effectively our traversal rules and our value rules, so we kind of unpacked the heuristic elements a bit.",
                    "label": 0
                },
                {
                    "sent": "And then there's this notion of agenda, which is like the current expansion of the space that I showed you way back using my angle bracket interpreter.",
                    "label": 0
                },
                {
                    "sent": "What are the difference?",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is.",
                    "label": 0
                },
                {
                    "sent": "Well, first of all, there's this close versus open world thing.",
                    "label": 1
                },
                {
                    "sent": "The algorithmic framework in good old fashioned AI works on one operand.",
                    "label": 0
                },
                {
                    "sent": "It works on the head of the agenda, which means you can't, for example, treats a genetic algorithm, let's say as in that framework.",
                    "label": 0
                },
                {
                    "sent": "Well, that's not quite true, is it?",
                    "label": 0
                },
                {
                    "sent": "You have to pop up to a meta level of populations to do so, which is ugly.",
                    "label": 0
                },
                {
                    "sent": "Here you can have multiple operations, which means you can pick and choose what you're combining.",
                    "label": 0
                },
                {
                    "sent": "You can do conceptual blending in this context.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fordley without having to put anything on top OK.",
                    "label": 0
                },
                {
                    "sent": "The key point here, of course, is that good old fashioned AI can be implemented within the framework I've just proposed, but the converse is not directly true.",
                    "label": 0
                },
                {
                    "sent": "Of course, you can always implement everything as search, so we could pop up to a meta level, but that's not the point.",
                    "label": 0
                },
                {
                    "sent": "The point is, they're not equivalent.",
                    "label": 0
                },
                {
                    "sent": "And Bowden was right.",
                    "label": 0
                },
                {
                    "sent": "Creativity is not just a I search right.",
                    "label": 1
                },
                {
                    "sent": "This was one of the criticisms that was leveled against her when she published the book.",
                    "label": 0
                },
                {
                    "sent": "People said, oh that's just a I search.",
                    "label": 0
                },
                {
                    "sent": "No, it isn't not at least as specified in that.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That algorithm there.",
                    "label": 0
                },
                {
                    "sent": "OK then, So what I've just done in a rather breathless 40 minutes is to introduce this creative systems work.",
                    "label": 0
                },
                {
                    "sent": "This framework I've talked about, the conceptual space, the rule set are the traversal of that space defined concepts using the rule set T and the evaluation of rule set East, not T. That's an error.",
                    "label": 1
                },
                {
                    "sent": "Sorry bout that.",
                    "label": 1
                },
                {
                    "sent": "I've made the point that transformation or creativity is exploratory creativity at the meta level, which is a useful thing to know because it saves us going down the wrong path.",
                    "label": 0
                },
                {
                    "sent": "And I've made the point that this creative systems framework is more expressive than the standard AI search framework of AI, notwithstanding the fact that one could, it could be implemented as a search problem in that context.",
                    "label": 1
                },
                {
                    "sent": "OK, so then the aim is to help to use to use this to help to conceptualize creative systems.",
                    "label": 1
                },
                {
                    "sent": "And that's what I propose to do in lectures two and three.",
                    "label": 0
                },
                {
                    "sent": "So tomorrow I'm going to give you the full story of the creative system, and I'm going to try to explain it, at least loosely in these terms.",
                    "label": 0
                },
                {
                    "sent": "One minute over.",
                    "label": 0
                },
                {
                    "sent": "Any questions?",
                    "label": 0
                }
            ]
        }
    }
}