{
    "id": "dkgay6c55ouxrwypvpoh5y372xeyrq7a",
    "title": "EURIDICE Project Infrastructure",
    "info": {
        "author": [
            "Richard Stevens, Insiel SpA"
        ],
        "published": "Feb. 20, 2008",
        "recorded": "February 2008",
        "category": [
            "Top->Science->Scientific Projects"
        ]
    },
    "url": "http://videolectures.net/ekom08_stevens_pi/",
    "segmentation": [
        [
            "I'm just going to tell you a little bit about how we plan to work during the course of the project.",
            "Anne, this shouldn't take very long at all because the the basic approach that I will take is called simplicity an we already have defined most of these.",
            "And ways of working we have agreed upon them in the consortium agreement and in the Technical Annex.",
            "So most of this stuff won't ring new like like a large number of people that I see here.",
            "I've been running these.",
            "I guess the word was more than five years I've been involved in in these, just not to say how long I've been doing this, 'cause it might give away my age, but.",
            "So the idea is bad."
        ],
        [
            "Basically, is simplicity.",
            "That means we're going to use simplistic in ways of executing the work.",
            "We have a very simple IT infrastructure, and then we'll also talk a bit about the templates in quality that we expected."
        ],
        [
            "No course of the project so.",
            "Executing the dao.",
            "If you look in the technical annex you'll see this picture here.",
            "And you actually have a copy of this in your thing.",
            "You can look at it and see what it actually says.",
            "But basically it describes how we he carry out any particular activity during the project.",
            "Most of what we've focused on so far today are P1P2 and P3.",
            "Here you have someone who is responsible for each one of those activities down to a work package level, OK?",
            "Then there's also some group up there called project management, which you've already had some taste of by being here today, and if they're supported by a project office and there are some people kind of up there floating around like me that you can't really figure out what they're supposed to be doing because the work is really happening right here.",
            "And in fact, this is what I want to."
        ],
        [
            "Emphasize.",
            "Just like.",
            "Eric Heiden thought he had a good way to get to the Olympics and was writing it all down at a plan and everything.",
            "We have a good way to create the objectives in this project to get to him.",
            "To what the Commission expects from us and what we expect from ourselves, we have defined a very good work package structure and each work package has a him, a person whose name as.",
            "Sorry.",
            "A person who is named as leader.",
            "Now in this person, is the person I expect to execute the project in 99.9% of the project activities.",
            "This person will be.",
            "Responsible understand what's happening.",
            "Have a plan to get there and only have two.",
            "He will have to monitor deviations from this plan, but not even necessarily have to communicate them all.",
            "So if if he finds a viable solution that that works within the same time frame, the same allocation of budget doesn't change the impact on the other work packages.",
            "He's probably going to take the initiative without even mentioning it to the rest of the project, because we really don't.",
            "We don't have as clear of a view of the work that he's doing.",
            "Then he will, so we've already seen some of the work package leaders from work from P1.",
            "The same structure holds two and P2 and in P3.",
            "We expect those people.",
            "To be autonomous in a certain sense, and I know that I know all of the people I know him well.",
            "I've seen him work in other projects and I'm sure that well except for Michael Ann know there's one or two that I haven't actually seen in projects.",
            "But I feel confident about them because of the fact that, you know, we've.",
            "We've seen the work progressing now.",
            "The first thing that the work package leader will be expected to do is just make sure that there's no.",
            "Errors, I mean, we went through this thing probably 10 times.",
            "There were some real nitpickers from the European go.",
            "I mean.",
            "They did find a lot of problems in the he you know the incorrect allocation of resources or timing or deliverable schedule then actually we had some people within the consortium.",
            "Two that were very fine tooth and went through it.",
            "An in the proposal stage and in the post proposal negotiation stage we went through and actually made a four submitted versions of this document.",
            "It shouldn't have too many big problems, but.",
            "We're humans, and I've done this a lot of times, and I know that there's you get there and you're actually trying to plan the schedule for a certain deliverable, and you realize that you've had the delivery date after the some artifact that's needed to make that so you have to make some changes.",
            "So the first thing is the project manager is going to do is verify that that can't has no inconsistencies.",
            "I'd bring up the Gantt again, but I think it's pretty.",
            "He it's pretty.",
            "It's beyond the scope of this presentation to go through the phases.",
            "The work package leader will.",
            "Some of you have already started doing this.",
            "Some of you have already talked to me about a few things.",
            "They will verify that and request any changes that might be necessary in your work packages.",
            "Now this this person will also make sure that the group is all on board.",
            "All the people have been have responded that are in my group and these are their contact details.",
            "We will.",
            "I'll talk about this in a minute.",
            "They will.",
            "They will be responsible for setting up or at least communicating the information to set up the mailing list for each work package.",
            "Each work package will have its own men in this they will be responsible for setting up the meeting schedule for the next period.",
            "Now next period is different from project to project.",
            "Some of the projects haven't begun yet.",
            "Is some of them are.",
            "Already planning their next meeting so these can be three different types of meetings and will talk about this in a little bit too, so they will set up the Skype teleconference.",
            "An face to face meeting and then this person in the first meeting will ensure that all the participants in their work package are exactly clear on when they are going to start and what's going to be expected of them during that.",
            "And of course, just make sure that that's known.",
            "This person will be responsible for the management reports that will be relating to their work package.",
            "Now we have an agreement with Mr Hoofs is that he gave us a little less money so we can't make all those long extensive management reports and he just wants to know that him things are on track.",
            "We're doing what's explained in the description of work.",
            "If there is any deviation what that might be probably on a yearly basis, will have a more.",
            "Extensive report, but we won't have those management reports that some of you are used to from the past, just very.",
            "He already knows what's written in the work package.",
            "There's no reason to rewrite it again in the management report.",
            "That will be more of a task that I will take care of.",
            "But more important, we will be a.",
            "We will be an objective driven group.",
            "Our objectives in great part are.",
            "Distinguished by deliverables.",
            "And that's what's going to be the driver of the work packages.",
            "From all of your experience, you'll know that if the deliverables are well done and on time, the Commission is going to be happy with us.",
            "We have an obligation to the Commission because they are paying more than half of the project funds we want them to be happy with us, and that's the.",
            "The single most common cause of I don't know what to call them, but unhappy remarks in reviews by the Commission is about the deliverables.",
            "So this work package leader, although he might not be responsible for the deliverable, will be responsible for all of the deliverables in his work package and responsible for the responsibles making sure that they are responsible for their deliverables.",
            "He has, I mean, it's it's tough to be funny in a presentation like this.",
            "Give me a break.",
            "OK, so that will mean here, right from the start.",
            "Right through the work package, making sure that he is defined the person and I don't want an organization.",
            "I want a person who is responsible for each deliverable and that actually is broken down in might not be the same person, but for a draft version and then the final version and several of the deliverables, especially those that will have a lot of text, will need some kind of peer review.",
            "Or if they're written by non native English speakers, might also need a language check because we don't want that.",
            "So the the work package leader.",
            "Will be irresponsible for him.",
            "Making sure that this quality level is inherent in all of them, making sure that the peer review has been duly taken into consideration an.",
            "And that the the the peer review is signed off that these will be further defined and we'll talk about this in a minute, again to the procedure in a document or the project Handbook that will be presented to you at Month 4.",
            "But some of the deliverables will need to know about this information long before the project manager should already have a plan for those things we have already agreed on this basically, and we've already said it, and we've all signed the contracts and stuff.",
            "I'm just repeating things to you now.",
            "For this, because otherwise we don't know what to do until the treasure hunt starts.",
            "In the Projectmanager will be pretty much autonomous.",
            "Until something happens where they need to share information or a maybe there are some uncertainties and they need to activate another project."
        ],
        [
            "Structure we have other project structures we have.",
            "List that picture that I showed you before with names and surnames.",
            "Actually talks about all of these groups.",
            "All of these groups are already defined.",
            "We will ratify that probably this afternoon unless there are any.",
            "Any change requests in the meeting that we will have after this, but we will have the General Assembly, which is the big group the steering committee which is taking issues and bringing him on to the table when you need to have a change of action, they will be advised by the technical coordinator who I'm not sure actually how this played out because it it should be Michael.",
            "You're the technical coordinator under the technical coordinator.",
            "We have full view for the network questions.",
            "Is that correct or is it gram it's gram?",
            "Sorry, gram and.",
            "Oh yes, sorry and Guido for him advice because there are he.",
            "This is a complex project here.",
            "We need a lot of sound technical help.",
            "So these three individuals and their organizations will be performing something called technical coordinator that sure it needs to be seen.",
            "What exactly they will do.",
            "We might not have any big technical problems.",
            "Everyone will stay sure the.",
            "The FIFA agent platform can easily be exported by a web service and blah blah blah.",
            "Or maybe we might say look, we can't use the FIFA based so we need to think is there an available agent platform.",
            "Then they need to discuss that.",
            "Then they need to go back to the work package leader and then make a choice with them where the work package leader cannot make that choice.",
            "Financial manager, that's our controller.",
            "He's got more experience than.",
            "Then then, then myself.",
            "In this he will be your point of reference for any questions he will be, or his staff will be contacting you for all financial questions and reporting from the Commission.",
            "There's the exploitation and I PR manager who you met earlier.",
            "Jens Schumacher.",
            "He will be so I don't know why it just not.",
            "OK, so not all the names are on there, but yes, Schumacher who spoken with earlier.",
            "He'd be responsible for evaluating papers and telling you yeah, no problem.",
            "Yeah, go there or go to this conference.",
            "No, we're already in this conference.",
            "He'll be bombarding you sometimes with a lot of plans from the project to participate in conferences and things.",
            "Obviously he's doing it for your own good to quality and risk manager cost us.",
            "He will be helping you with.",
            "All of those questions about how does the peer review process happen?",
            "How many weeks before the delivery date should something be put on the wiki?",
            "How far in advance do I need to?",
            "How much can I pay a peer reviewer?",
            "We have money that Wolfgang is hoping we don't spend for external peer reviewers, especially where those topics might be slightly far from the general group, or we cannot.",
            "We reserved a little money.",
            "Just a little for peer reviewers.",
            "We have the advisory and assessment committees, which are the scientific and technical Committee and the Pilot Committee.",
            "Bearnard is the head of the pilot Committee.",
            "That's to make sure that in what happens a lot in these types of projects is that you get.",
            "Comparison of apples to oranges.",
            "So we have fish in a container somewhere in Greece or.",
            "I wear it up in balloon and they're completely different now when we go in and run the pilots, it's important that they all have a common infrastructure that there's some kind of neutral partner out there going.",
            "Yeah, that looks there.",
            "Realistically.",
            "Comperable the two pilots go ahead make we better look at this one a little bit better.",
            "Bring it to the technical committee if needed so.",
            "Bernard will be fielding those questions as well, so basically we have.",
            "Envisioned.",
            "A lot of possible problems even.",
            "It cost us.",
            "Here is also made a list of.",
            "Typical risks that this type of project will be running into an some at this point.",
            "Very preliminary analysis of how to deal with those risks.",
            "If they should show up, but here that can happen, you know.",
            "There's some new great new technology coming up on the horizon over the 1st next couple years.",
            "Facebook or something like this.",
            "Facebook Logistics is taking over our market.",
            "I don't know what are we going to do with that and maybe we want to integrate it.",
            "Maybe we want to do something different.",
            "That's the type of risk that he might see, or a partner prime key partner drops out of the out of the concert.",
            "Him by the way people might be.",
            "Interested in knowing.",
            "Damn Nokia closed the Bokum Research Center.",
            "So Klaus called me and he wished all of you that worked with him a the best of luck on the project.",
            "He wondered if anyone wanted to give him a job too so?",
            "He said he's a good guy.",
            "I have his CV if if you want to give my job OK yeah sorry.",
            "Alright I'm sitting there."
        ],
        [
            "Walking away and it's time to go to the boat so I'm just going to say we have now a preliminary website up.",
            "It will be shifted.",
            "It's going to be as opamp loan.",
            "That's going to have a public area that's going to be a project description concerning contract calendar.",
            "How to get more information and public document downloads.",
            "So guys like Henry have already said, yeah, please put my documents up.",
            "That will be done the member area.",
            "Instead, this is how we're going to work.",
            "We're just going to use the see Ms with check in and check out we're not going to hold code repository that will be held by you guys and your own companies 'cause you have different rules and that just doesn't work on projects like this.",
            "We will be having a document repository where final code can be put and documents can be put.",
            "There will be a check in check out just Simple folder base.",
            "It works fine for a project like this.",
            "We don't need anything too."
        ],
        [
            "Complicated will have mailing lists.",
            "This will be a little bit more pain in the neck because there will be a general 1A general public one and administration list for admin people each view P will have, so you might be on three or four of these lists and you might get a few, but we need.",
            "This is the minimum level."
        ],
        [
            "We have a Webex system where you can give us a request.",
            "Will set up a meeting or each partner.",
            "Some partners do have their own systems.",
            "You can obviously use your own system if you want an.",
            "We will have Skype.",
            "These will be provided by the WP leader to the group with an agenda with an agenda.",
            "Every meeting will have an agenda except for.",
            "This feeding 7 pieces of it in."
        ],
        [
            "Future.",
            "And that will be of course described in the Quality Handbook, which will be coming out.",
            "Unfortunately in Month 4, but that's what we plan will probably give you some ideas alot.",
            "Before that the final version will be ready in month for that will go through all of the different things and it will also give you templates.",
            "I'm actually going to cut this real short because the people who are leaving need to leave.",
            "Of course we will have.",
            "We are available for questions and comments and we work together with the project management team to make sure you have well documented this information."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm just going to tell you a little bit about how we plan to work during the course of the project.",
                    "label": 0
                },
                {
                    "sent": "Anne, this shouldn't take very long at all because the the basic approach that I will take is called simplicity an we already have defined most of these.",
                    "label": 0
                },
                {
                    "sent": "And ways of working we have agreed upon them in the consortium agreement and in the Technical Annex.",
                    "label": 0
                },
                {
                    "sent": "So most of this stuff won't ring new like like a large number of people that I see here.",
                    "label": 0
                },
                {
                    "sent": "I've been running these.",
                    "label": 0
                },
                {
                    "sent": "I guess the word was more than five years I've been involved in in these, just not to say how long I've been doing this, 'cause it might give away my age, but.",
                    "label": 0
                },
                {
                    "sent": "So the idea is bad.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Basically, is simplicity.",
                    "label": 0
                },
                {
                    "sent": "That means we're going to use simplistic in ways of executing the work.",
                    "label": 1
                },
                {
                    "sent": "We have a very simple IT infrastructure, and then we'll also talk a bit about the templates in quality that we expected.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No course of the project so.",
                    "label": 0
                },
                {
                    "sent": "Executing the dao.",
                    "label": 0
                },
                {
                    "sent": "If you look in the technical annex you'll see this picture here.",
                    "label": 0
                },
                {
                    "sent": "And you actually have a copy of this in your thing.",
                    "label": 0
                },
                {
                    "sent": "You can look at it and see what it actually says.",
                    "label": 0
                },
                {
                    "sent": "But basically it describes how we he carry out any particular activity during the project.",
                    "label": 0
                },
                {
                    "sent": "Most of what we've focused on so far today are P1P2 and P3.",
                    "label": 0
                },
                {
                    "sent": "Here you have someone who is responsible for each one of those activities down to a work package level, OK?",
                    "label": 0
                },
                {
                    "sent": "Then there's also some group up there called project management, which you've already had some taste of by being here today, and if they're supported by a project office and there are some people kind of up there floating around like me that you can't really figure out what they're supposed to be doing because the work is really happening right here.",
                    "label": 0
                },
                {
                    "sent": "And in fact, this is what I want to.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Emphasize.",
                    "label": 0
                },
                {
                    "sent": "Just like.",
                    "label": 0
                },
                {
                    "sent": "Eric Heiden thought he had a good way to get to the Olympics and was writing it all down at a plan and everything.",
                    "label": 0
                },
                {
                    "sent": "We have a good way to create the objectives in this project to get to him.",
                    "label": 0
                },
                {
                    "sent": "To what the Commission expects from us and what we expect from ourselves, we have defined a very good work package structure and each work package has a him, a person whose name as.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "A person who is named as leader.",
                    "label": 0
                },
                {
                    "sent": "Now in this person, is the person I expect to execute the project in 99.9% of the project activities.",
                    "label": 0
                },
                {
                    "sent": "This person will be.",
                    "label": 0
                },
                {
                    "sent": "Responsible understand what's happening.",
                    "label": 0
                },
                {
                    "sent": "Have a plan to get there and only have two.",
                    "label": 0
                },
                {
                    "sent": "He will have to monitor deviations from this plan, but not even necessarily have to communicate them all.",
                    "label": 0
                },
                {
                    "sent": "So if if he finds a viable solution that that works within the same time frame, the same allocation of budget doesn't change the impact on the other work packages.",
                    "label": 0
                },
                {
                    "sent": "He's probably going to take the initiative without even mentioning it to the rest of the project, because we really don't.",
                    "label": 0
                },
                {
                    "sent": "We don't have as clear of a view of the work that he's doing.",
                    "label": 0
                },
                {
                    "sent": "Then he will, so we've already seen some of the work package leaders from work from P1.",
                    "label": 0
                },
                {
                    "sent": "The same structure holds two and P2 and in P3.",
                    "label": 0
                },
                {
                    "sent": "We expect those people.",
                    "label": 0
                },
                {
                    "sent": "To be autonomous in a certain sense, and I know that I know all of the people I know him well.",
                    "label": 0
                },
                {
                    "sent": "I've seen him work in other projects and I'm sure that well except for Michael Ann know there's one or two that I haven't actually seen in projects.",
                    "label": 0
                },
                {
                    "sent": "But I feel confident about them because of the fact that, you know, we've.",
                    "label": 0
                },
                {
                    "sent": "We've seen the work progressing now.",
                    "label": 0
                },
                {
                    "sent": "The first thing that the work package leader will be expected to do is just make sure that there's no.",
                    "label": 0
                },
                {
                    "sent": "Errors, I mean, we went through this thing probably 10 times.",
                    "label": 0
                },
                {
                    "sent": "There were some real nitpickers from the European go.",
                    "label": 0
                },
                {
                    "sent": "I mean.",
                    "label": 0
                },
                {
                    "sent": "They did find a lot of problems in the he you know the incorrect allocation of resources or timing or deliverable schedule then actually we had some people within the consortium.",
                    "label": 0
                },
                {
                    "sent": "Two that were very fine tooth and went through it.",
                    "label": 0
                },
                {
                    "sent": "An in the proposal stage and in the post proposal negotiation stage we went through and actually made a four submitted versions of this document.",
                    "label": 0
                },
                {
                    "sent": "It shouldn't have too many big problems, but.",
                    "label": 0
                },
                {
                    "sent": "We're humans, and I've done this a lot of times, and I know that there's you get there and you're actually trying to plan the schedule for a certain deliverable, and you realize that you've had the delivery date after the some artifact that's needed to make that so you have to make some changes.",
                    "label": 0
                },
                {
                    "sent": "So the first thing is the project manager is going to do is verify that that can't has no inconsistencies.",
                    "label": 0
                },
                {
                    "sent": "I'd bring up the Gantt again, but I think it's pretty.",
                    "label": 0
                },
                {
                    "sent": "He it's pretty.",
                    "label": 0
                },
                {
                    "sent": "It's beyond the scope of this presentation to go through the phases.",
                    "label": 0
                },
                {
                    "sent": "The work package leader will.",
                    "label": 1
                },
                {
                    "sent": "Some of you have already started doing this.",
                    "label": 0
                },
                {
                    "sent": "Some of you have already talked to me about a few things.",
                    "label": 0
                },
                {
                    "sent": "They will verify that and request any changes that might be necessary in your work packages.",
                    "label": 0
                },
                {
                    "sent": "Now this this person will also make sure that the group is all on board.",
                    "label": 0
                },
                {
                    "sent": "All the people have been have responded that are in my group and these are their contact details.",
                    "label": 0
                },
                {
                    "sent": "We will.",
                    "label": 0
                },
                {
                    "sent": "I'll talk about this in a minute.",
                    "label": 0
                },
                {
                    "sent": "They will.",
                    "label": 0
                },
                {
                    "sent": "They will be responsible for setting up or at least communicating the information to set up the mailing list for each work package.",
                    "label": 0
                },
                {
                    "sent": "Each work package will have its own men in this they will be responsible for setting up the meeting schedule for the next period.",
                    "label": 1
                },
                {
                    "sent": "Now next period is different from project to project.",
                    "label": 0
                },
                {
                    "sent": "Some of the projects haven't begun yet.",
                    "label": 0
                },
                {
                    "sent": "Is some of them are.",
                    "label": 0
                },
                {
                    "sent": "Already planning their next meeting so these can be three different types of meetings and will talk about this in a little bit too, so they will set up the Skype teleconference.",
                    "label": 0
                },
                {
                    "sent": "An face to face meeting and then this person in the first meeting will ensure that all the participants in their work package are exactly clear on when they are going to start and what's going to be expected of them during that.",
                    "label": 1
                },
                {
                    "sent": "And of course, just make sure that that's known.",
                    "label": 0
                },
                {
                    "sent": "This person will be responsible for the management reports that will be relating to their work package.",
                    "label": 0
                },
                {
                    "sent": "Now we have an agreement with Mr Hoofs is that he gave us a little less money so we can't make all those long extensive management reports and he just wants to know that him things are on track.",
                    "label": 0
                },
                {
                    "sent": "We're doing what's explained in the description of work.",
                    "label": 0
                },
                {
                    "sent": "If there is any deviation what that might be probably on a yearly basis, will have a more.",
                    "label": 0
                },
                {
                    "sent": "Extensive report, but we won't have those management reports that some of you are used to from the past, just very.",
                    "label": 0
                },
                {
                    "sent": "He already knows what's written in the work package.",
                    "label": 0
                },
                {
                    "sent": "There's no reason to rewrite it again in the management report.",
                    "label": 0
                },
                {
                    "sent": "That will be more of a task that I will take care of.",
                    "label": 0
                },
                {
                    "sent": "But more important, we will be a.",
                    "label": 0
                },
                {
                    "sent": "We will be an objective driven group.",
                    "label": 0
                },
                {
                    "sent": "Our objectives in great part are.",
                    "label": 0
                },
                {
                    "sent": "Distinguished by deliverables.",
                    "label": 0
                },
                {
                    "sent": "And that's what's going to be the driver of the work packages.",
                    "label": 0
                },
                {
                    "sent": "From all of your experience, you'll know that if the deliverables are well done and on time, the Commission is going to be happy with us.",
                    "label": 0
                },
                {
                    "sent": "We have an obligation to the Commission because they are paying more than half of the project funds we want them to be happy with us, and that's the.",
                    "label": 0
                },
                {
                    "sent": "The single most common cause of I don't know what to call them, but unhappy remarks in reviews by the Commission is about the deliverables.",
                    "label": 0
                },
                {
                    "sent": "So this work package leader, although he might not be responsible for the deliverable, will be responsible for all of the deliverables in his work package and responsible for the responsibles making sure that they are responsible for their deliverables.",
                    "label": 1
                },
                {
                    "sent": "He has, I mean, it's it's tough to be funny in a presentation like this.",
                    "label": 0
                },
                {
                    "sent": "Give me a break.",
                    "label": 0
                },
                {
                    "sent": "OK, so that will mean here, right from the start.",
                    "label": 0
                },
                {
                    "sent": "Right through the work package, making sure that he is defined the person and I don't want an organization.",
                    "label": 0
                },
                {
                    "sent": "I want a person who is responsible for each deliverable and that actually is broken down in might not be the same person, but for a draft version and then the final version and several of the deliverables, especially those that will have a lot of text, will need some kind of peer review.",
                    "label": 0
                },
                {
                    "sent": "Or if they're written by non native English speakers, might also need a language check because we don't want that.",
                    "label": 0
                },
                {
                    "sent": "So the the work package leader.",
                    "label": 0
                },
                {
                    "sent": "Will be irresponsible for him.",
                    "label": 0
                },
                {
                    "sent": "Making sure that this quality level is inherent in all of them, making sure that the peer review has been duly taken into consideration an.",
                    "label": 0
                },
                {
                    "sent": "And that the the the peer review is signed off that these will be further defined and we'll talk about this in a minute, again to the procedure in a document or the project Handbook that will be presented to you at Month 4.",
                    "label": 0
                },
                {
                    "sent": "But some of the deliverables will need to know about this information long before the project manager should already have a plan for those things we have already agreed on this basically, and we've already said it, and we've all signed the contracts and stuff.",
                    "label": 0
                },
                {
                    "sent": "I'm just repeating things to you now.",
                    "label": 0
                },
                {
                    "sent": "For this, because otherwise we don't know what to do until the treasure hunt starts.",
                    "label": 0
                },
                {
                    "sent": "In the Projectmanager will be pretty much autonomous.",
                    "label": 0
                },
                {
                    "sent": "Until something happens where they need to share information or a maybe there are some uncertainties and they need to activate another project.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Structure we have other project structures we have.",
                    "label": 0
                },
                {
                    "sent": "List that picture that I showed you before with names and surnames.",
                    "label": 0
                },
                {
                    "sent": "Actually talks about all of these groups.",
                    "label": 0
                },
                {
                    "sent": "All of these groups are already defined.",
                    "label": 0
                },
                {
                    "sent": "We will ratify that probably this afternoon unless there are any.",
                    "label": 0
                },
                {
                    "sent": "Any change requests in the meeting that we will have after this, but we will have the General Assembly, which is the big group the steering committee which is taking issues and bringing him on to the table when you need to have a change of action, they will be advised by the technical coordinator who I'm not sure actually how this played out because it it should be Michael.",
                    "label": 0
                },
                {
                    "sent": "You're the technical coordinator under the technical coordinator.",
                    "label": 0
                },
                {
                    "sent": "We have full view for the network questions.",
                    "label": 0
                },
                {
                    "sent": "Is that correct or is it gram it's gram?",
                    "label": 0
                },
                {
                    "sent": "Sorry, gram and.",
                    "label": 0
                },
                {
                    "sent": "Oh yes, sorry and Guido for him advice because there are he.",
                    "label": 0
                },
                {
                    "sent": "This is a complex project here.",
                    "label": 0
                },
                {
                    "sent": "We need a lot of sound technical help.",
                    "label": 0
                },
                {
                    "sent": "So these three individuals and their organizations will be performing something called technical coordinator that sure it needs to be seen.",
                    "label": 0
                },
                {
                    "sent": "What exactly they will do.",
                    "label": 0
                },
                {
                    "sent": "We might not have any big technical problems.",
                    "label": 0
                },
                {
                    "sent": "Everyone will stay sure the.",
                    "label": 0
                },
                {
                    "sent": "The FIFA agent platform can easily be exported by a web service and blah blah blah.",
                    "label": 0
                },
                {
                    "sent": "Or maybe we might say look, we can't use the FIFA based so we need to think is there an available agent platform.",
                    "label": 0
                },
                {
                    "sent": "Then they need to discuss that.",
                    "label": 0
                },
                {
                    "sent": "Then they need to go back to the work package leader and then make a choice with them where the work package leader cannot make that choice.",
                    "label": 0
                },
                {
                    "sent": "Financial manager, that's our controller.",
                    "label": 0
                },
                {
                    "sent": "He's got more experience than.",
                    "label": 0
                },
                {
                    "sent": "Then then, then myself.",
                    "label": 0
                },
                {
                    "sent": "In this he will be your point of reference for any questions he will be, or his staff will be contacting you for all financial questions and reporting from the Commission.",
                    "label": 0
                },
                {
                    "sent": "There's the exploitation and I PR manager who you met earlier.",
                    "label": 0
                },
                {
                    "sent": "Jens Schumacher.",
                    "label": 0
                },
                {
                    "sent": "He will be so I don't know why it just not.",
                    "label": 0
                },
                {
                    "sent": "OK, so not all the names are on there, but yes, Schumacher who spoken with earlier.",
                    "label": 0
                },
                {
                    "sent": "He'd be responsible for evaluating papers and telling you yeah, no problem.",
                    "label": 0
                },
                {
                    "sent": "Yeah, go there or go to this conference.",
                    "label": 0
                },
                {
                    "sent": "No, we're already in this conference.",
                    "label": 0
                },
                {
                    "sent": "He'll be bombarding you sometimes with a lot of plans from the project to participate in conferences and things.",
                    "label": 0
                },
                {
                    "sent": "Obviously he's doing it for your own good to quality and risk manager cost us.",
                    "label": 0
                },
                {
                    "sent": "He will be helping you with.",
                    "label": 0
                },
                {
                    "sent": "All of those questions about how does the peer review process happen?",
                    "label": 0
                },
                {
                    "sent": "How many weeks before the delivery date should something be put on the wiki?",
                    "label": 0
                },
                {
                    "sent": "How far in advance do I need to?",
                    "label": 0
                },
                {
                    "sent": "How much can I pay a peer reviewer?",
                    "label": 0
                },
                {
                    "sent": "We have money that Wolfgang is hoping we don't spend for external peer reviewers, especially where those topics might be slightly far from the general group, or we cannot.",
                    "label": 0
                },
                {
                    "sent": "We reserved a little money.",
                    "label": 0
                },
                {
                    "sent": "Just a little for peer reviewers.",
                    "label": 0
                },
                {
                    "sent": "We have the advisory and assessment committees, which are the scientific and technical Committee and the Pilot Committee.",
                    "label": 1
                },
                {
                    "sent": "Bearnard is the head of the pilot Committee.",
                    "label": 0
                },
                {
                    "sent": "That's to make sure that in what happens a lot in these types of projects is that you get.",
                    "label": 0
                },
                {
                    "sent": "Comparison of apples to oranges.",
                    "label": 0
                },
                {
                    "sent": "So we have fish in a container somewhere in Greece or.",
                    "label": 0
                },
                {
                    "sent": "I wear it up in balloon and they're completely different now when we go in and run the pilots, it's important that they all have a common infrastructure that there's some kind of neutral partner out there going.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that looks there.",
                    "label": 0
                },
                {
                    "sent": "Realistically.",
                    "label": 0
                },
                {
                    "sent": "Comperable the two pilots go ahead make we better look at this one a little bit better.",
                    "label": 0
                },
                {
                    "sent": "Bring it to the technical committee if needed so.",
                    "label": 0
                },
                {
                    "sent": "Bernard will be fielding those questions as well, so basically we have.",
                    "label": 0
                },
                {
                    "sent": "Envisioned.",
                    "label": 0
                },
                {
                    "sent": "A lot of possible problems even.",
                    "label": 0
                },
                {
                    "sent": "It cost us.",
                    "label": 0
                },
                {
                    "sent": "Here is also made a list of.",
                    "label": 0
                },
                {
                    "sent": "Typical risks that this type of project will be running into an some at this point.",
                    "label": 0
                },
                {
                    "sent": "Very preliminary analysis of how to deal with those risks.",
                    "label": 0
                },
                {
                    "sent": "If they should show up, but here that can happen, you know.",
                    "label": 0
                },
                {
                    "sent": "There's some new great new technology coming up on the horizon over the 1st next couple years.",
                    "label": 0
                },
                {
                    "sent": "Facebook or something like this.",
                    "label": 0
                },
                {
                    "sent": "Facebook Logistics is taking over our market.",
                    "label": 0
                },
                {
                    "sent": "I don't know what are we going to do with that and maybe we want to integrate it.",
                    "label": 0
                },
                {
                    "sent": "Maybe we want to do something different.",
                    "label": 0
                },
                {
                    "sent": "That's the type of risk that he might see, or a partner prime key partner drops out of the out of the concert.",
                    "label": 0
                },
                {
                    "sent": "Him by the way people might be.",
                    "label": 0
                },
                {
                    "sent": "Interested in knowing.",
                    "label": 0
                },
                {
                    "sent": "Damn Nokia closed the Bokum Research Center.",
                    "label": 0
                },
                {
                    "sent": "So Klaus called me and he wished all of you that worked with him a the best of luck on the project.",
                    "label": 0
                },
                {
                    "sent": "He wondered if anyone wanted to give him a job too so?",
                    "label": 0
                },
                {
                    "sent": "He said he's a good guy.",
                    "label": 0
                },
                {
                    "sent": "I have his CV if if you want to give my job OK yeah sorry.",
                    "label": 0
                },
                {
                    "sent": "Alright I'm sitting there.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Walking away and it's time to go to the boat so I'm just going to say we have now a preliminary website up.",
                    "label": 0
                },
                {
                    "sent": "It will be shifted.",
                    "label": 0
                },
                {
                    "sent": "It's going to be as opamp loan.",
                    "label": 0
                },
                {
                    "sent": "That's going to have a public area that's going to be a project description concerning contract calendar.",
                    "label": 1
                },
                {
                    "sent": "How to get more information and public document downloads.",
                    "label": 0
                },
                {
                    "sent": "So guys like Henry have already said, yeah, please put my documents up.",
                    "label": 1
                },
                {
                    "sent": "That will be done the member area.",
                    "label": 0
                },
                {
                    "sent": "Instead, this is how we're going to work.",
                    "label": 0
                },
                {
                    "sent": "We're just going to use the see Ms with check in and check out we're not going to hold code repository that will be held by you guys and your own companies 'cause you have different rules and that just doesn't work on projects like this.",
                    "label": 0
                },
                {
                    "sent": "We will be having a document repository where final code can be put and documents can be put.",
                    "label": 0
                },
                {
                    "sent": "There will be a check in check out just Simple folder base.",
                    "label": 1
                },
                {
                    "sent": "It works fine for a project like this.",
                    "label": 0
                },
                {
                    "sent": "We don't need anything too.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Complicated will have mailing lists.",
                    "label": 1
                },
                {
                    "sent": "This will be a little bit more pain in the neck because there will be a general 1A general public one and administration list for admin people each view P will have, so you might be on three or four of these lists and you might get a few, but we need.",
                    "label": 1
                },
                {
                    "sent": "This is the minimum level.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have a Webex system where you can give us a request.",
                    "label": 0
                },
                {
                    "sent": "Will set up a meeting or each partner.",
                    "label": 1
                },
                {
                    "sent": "Some partners do have their own systems.",
                    "label": 1
                },
                {
                    "sent": "You can obviously use your own system if you want an.",
                    "label": 0
                },
                {
                    "sent": "We will have Skype.",
                    "label": 0
                },
                {
                    "sent": "These will be provided by the WP leader to the group with an agenda with an agenda.",
                    "label": 0
                },
                {
                    "sent": "Every meeting will have an agenda except for.",
                    "label": 0
                },
                {
                    "sent": "This feeding 7 pieces of it in.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Future.",
                    "label": 0
                },
                {
                    "sent": "And that will be of course described in the Quality Handbook, which will be coming out.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately in Month 4, but that's what we plan will probably give you some ideas alot.",
                    "label": 0
                },
                {
                    "sent": "Before that the final version will be ready in month for that will go through all of the different things and it will also give you templates.",
                    "label": 0
                },
                {
                    "sent": "I'm actually going to cut this real short because the people who are leaving need to leave.",
                    "label": 0
                },
                {
                    "sent": "Of course we will have.",
                    "label": 0
                },
                {
                    "sent": "We are available for questions and comments and we work together with the project management team to make sure you have well documented this information.",
                    "label": 0
                }
            ]
        }
    }
}