{
    "id": "dn7rwppep5ogjaqbr4zqaj4ahx2kcuck",
    "title": "Experiences in Aquaculture",
    "info": {
        "author": [
            "Dudley Dolan, Q-Validus Ltd.",
            "Kostas Seferis, Integrated Information Systems (i2s) SA"
        ],
        "published": "Dec. 1, 2015",
        "recorded": "November 2015",
        "category": [
            "Top->Computer Science->Big Data",
            "Top->Computer Science->Information Security",
            "Top->Technology->Systems and Cybernetics"
        ]
    },
    "url": "http://videolectures.net/esr2015_seferis_dolan_aquaculture/",
    "segmentation": [
        [
            "OK hello everybody, I'm going to talk to you about a totally different sector.",
            "Its food production sector."
        ],
        [
            "Is a quick answer I aquaculture is very interesting and very dynamic sector.",
            "It's very interesting because we forecast that.",
            "Total the global production is going to increase from 45 million tons.",
            "That is now 285 million tons in about 15 years time.",
            "So it's it's going to double in about 15 years and is considered to be a very significant source of protein for the people to cover the needs of the increasing population."
        ],
        [
            "So a.",
            "The catch with white.",
            "This is amazing.",
            "And So what we need to do is to produce more face Murphy's in pepper, pepper, pepper, water per unit.",
            "But square meter of land or volume of water."
        ],
        [
            "A OK, why the sector needs to be the big the big data?",
            "Because there is a lot of valuable knowledge in this sector.",
            "There are a lot of data that are currently unexploited and if we are able to convert the data into knowledge the companies will be able to make better decisions, smarter decisions and dramatically improve performance.",
            "Of course this will also have another very important impact which is the impact on the environment.",
            "Because the most the most efficient your production is, the less is the impact.",
            "Also, for the for the for the environment another very important dimension is to change the culture in the company to make the cut in the sector.",
            "To make the companies using open data to share experiences to serve performance information.",
            "Because this is going to improve to help them to improve."
        ],
        [
            "OK, now we go to the sector can get from from big Data.",
            "They can answer very important questions.",
            "They can answer questions like how the environmental parameters, the production strategies that the feeding the feeding strategies and the feed types and all the other things that are in the hands of the production manager, how all those parameters influence the success of the production and if they do that they will be able also to identify turn.",
            "Certain patterns and trends and associations and and even develop two models that will help them to make not only descriptive analysis but also predictive predictive data mining.",
            "To be able to predict the result of their efforts based on the history of its farm."
        ],
        [
            "The argument is that what we're trying to do is to respond to this to this need is a European Commission funded project under the framework of Horizon 2020, and what?",
            "What is the name of the project is to develop a cloud platform that will help the companies to transform data into knowledge and then to use this knowledge to improve efficiency and you know.",
            "The increased production in and in and in an environmentally friendly and sustainable way."
        ],
        [
            "OK, what is new with this project?",
            "It is the first time that experts from different areas like data mining, big data, aquaculture work together to make this kind of solution for for the sector.",
            "So what we're going to do, and this is our mission statement to we're going to improve fish production by combining statistics, data mining, machine learning.",
            "And the open data."
        ],
        [
            "OK, I will not repeat the same thing.",
            "This is our our mentality, but we're going to improve is all the main production KPI's like the feed conversion rate and mortality rate, the rate, the fees are growing.",
            "So the production time improve the Halo health of the fees etc etc.",
            "And we're going to offer this as a cloud service to the companies be cause many of them RSM isn't.",
            "It is impossible for them to hire A data analyst that analysts or consultants too.",
            "To do this a job, then they themselves, as I told you the an important aspect of the project is that it wants to change the culture in the sector.",
            "What we're going to do is we're going to support the companies to compare the results of their analysis with similar results of different companies.",
            "So this is clearly a benchmarking which will help have two positive effects.",
            "It will help the companies to improve.",
            "And it will also contribute to the generation of a knowledge base with very, very important information about the sector that will be very useful to all the other stakeholders, like governments research institutes.",
            "Potential investors etc."
        ],
        [
            "EH, OK. As we said before, we have three main.",
            "Axis it's it will be a cloud platform.",
            "It will support multilingual data because obviously the the data are in different languages in different in different countries.",
            "And what we want to do is to develop something."
        ],
        [
            "Practical that is going to to answer real business business questions.",
            "And we think that this system is going also to narrow the gap between the academics and the and the industrial people.",
            "It will allow the companies to make some data available without.",
            "Giving out corporate information that is really critical and they are very, very concerned about the privacy of their data and so we are dealing with sensitive data and we want to be the ones that will implement first time data analytics in our quick."
        ],
        [
            "Social sector here is a list of the sum of the of the of the important business questions that we want to to answer with with our customers and the answer to each of those questions have has a very significant.",
            "Value.",
            "Can can have a very significant positive effect on the on the performance of of the."
        ],
        [
            "Company.",
            "OK, and what we're going to do is to help the companies to understand what has happened, why and of course to predict."
        ],
        [
            "The future to do that, we're using a mix of technologies.",
            "We're using descriptive statistics that will help them to visualize information about their performance."
        ],
        [
            "All kinds of visualization tools."
        ],
        [
            "Also, tools that help them to develop models and patterns about main production.",
            "Data."
        ],
        [
            "Anne."
        ],
        [
            "And finally, this is I think the best part advanced the machine learning technologies and algorithms that help them.",
            "To quantify.",
            "The effect of all the parameters that influence the result of the production process.",
            "To the to to the result until now companies have just feelings that they have no tools to be able to translate those feelings to numbers and take decisions based on on facts.",
            "So this is an example of neural network that tells the companies which are the most important parameters that influence the success of the production in a negative or positive way, so they know where to focus their efforts for.",
            "Improvements."
        ],
        [
            "This is another example which is another neural network that allows them to predict what will both will be the outcome of the harvest based on the history and a number of and all the characteristics of the populations which also has a very high business value."
        ],
        [
            "And of course, what we're going to do is to develop standards for both sector and that Lincoln can say more.",
            "On this.",
            "Thank you Chris.",
            "I congratulate you with speed of getting through that I didn't think I'd be here so quickly with our as Costas has said, the agriculture area is is of considerable importance.",
            "Worldwide, and we propose in our approach to standards to liaise with ISO, the International Standards Organization which has a working Group 9 which is started to look at overarching standards for big data and we will be following what they're doing and ensuring that we will work within whatever framework they come up with.",
            "And I think very well she will be speaking after this session will.",
            "Address some issues and in terms of working Group 9, but this is a European funded project so we are going to develop a business plan for a San workshop.",
            "San is the European standards body and we will develop a send workshop on big data and.",
            "In order to be not to duplicate the efforts of I so we will look at particular industry sectors taking the overarching plan from ISO and looking at industry sectors and the first industry sector will be at the food industry.",
            "Agriculture, in particular other areas that we have, are considering our manufacturing and and healthcare.",
            "We plan to create a draft send workshop agreement to CWA.",
            "Ascend Workshop Agreement is a document produced by San.",
            "It is not a standard, but it is an agreed document by members of a workshop who are peers.",
            "Workshops are open there, open to academics, industry people, anyone who has an interest in the area, and it's open not only to people from Europe, but people from across the world.",
            "And we have I'm involved in another send workshop where we have active participation from people in in Russia and in Japan and in Canada.",
            "So it's it's it's it's taking San as a European organization an looking more broadly, we will present our draft San Workshop Agreement regarding agriculture to the stakeholders and hopefully having a approval from them.",
            "We will.",
            "Produce a sand workshop agreement for agriculture.",
            "The Send Workshop agreement will then give guidelines for people to share data.",
            "It will be very important that people in different parts of the world can share the data that competitors can share data so that they will take the best knowledge that has been gained from the agriculture product, which cost us has described and an share that data with other people to get the benefits for production and efficiency and.",
            "Improving the quality and and efficiency of producing the the fish.",
            "So that's the idea.",
            "I'm not going to go into standards and but our initial thought is to produce in not a standard, but Ascend Workshop agreement.",
            "And if that is acceptable we will move onto standards later on.",
            "But the first thing is an agreement on how to share the data, 'cause we've seen that there's been a lot of big data.",
            "Produced with agriculture.",
            "So it passed you back.",
            "Where are we actually the last?"
        ],
        [
            "Overhead, yeah, and what we're going to say is that first of all, thank you for your attention.",
            "We will be happy to hear from you and if you want to be in touch with with us, you know we welcome any comments, ideas, suggestions, etc.",
            "That's it."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK hello everybody, I'm going to talk to you about a totally different sector.",
                    "label": 0
                },
                {
                    "sent": "Its food production sector.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is a quick answer I aquaculture is very interesting and very dynamic sector.",
                    "label": 0
                },
                {
                    "sent": "It's very interesting because we forecast that.",
                    "label": 0
                },
                {
                    "sent": "Total the global production is going to increase from 45 million tons.",
                    "label": 1
                },
                {
                    "sent": "That is now 285 million tons in about 15 years time.",
                    "label": 1
                },
                {
                    "sent": "So it's it's going to double in about 15 years and is considered to be a very significant source of protein for the people to cover the needs of the increasing population.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So a.",
                    "label": 0
                },
                {
                    "sent": "The catch with white.",
                    "label": 0
                },
                {
                    "sent": "This is amazing.",
                    "label": 0
                },
                {
                    "sent": "And So what we need to do is to produce more face Murphy's in pepper, pepper, pepper, water per unit.",
                    "label": 1
                },
                {
                    "sent": "But square meter of land or volume of water.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A OK, why the sector needs to be the big the big data?",
                    "label": 0
                },
                {
                    "sent": "Because there is a lot of valuable knowledge in this sector.",
                    "label": 1
                },
                {
                    "sent": "There are a lot of data that are currently unexploited and if we are able to convert the data into knowledge the companies will be able to make better decisions, smarter decisions and dramatically improve performance.",
                    "label": 1
                },
                {
                    "sent": "Of course this will also have another very important impact which is the impact on the environment.",
                    "label": 0
                },
                {
                    "sent": "Because the most the most efficient your production is, the less is the impact.",
                    "label": 0
                },
                {
                    "sent": "Also, for the for the for the environment another very important dimension is to change the culture in the company to make the cut in the sector.",
                    "label": 1
                },
                {
                    "sent": "To make the companies using open data to share experiences to serve performance information.",
                    "label": 0
                },
                {
                    "sent": "Because this is going to improve to help them to improve.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, now we go to the sector can get from from big Data.",
                    "label": 1
                },
                {
                    "sent": "They can answer very important questions.",
                    "label": 0
                },
                {
                    "sent": "They can answer questions like how the environmental parameters, the production strategies that the feeding the feeding strategies and the feed types and all the other things that are in the hands of the production manager, how all those parameters influence the success of the production and if they do that they will be able also to identify turn.",
                    "label": 1
                },
                {
                    "sent": "Certain patterns and trends and associations and and even develop two models that will help them to make not only descriptive analysis but also predictive predictive data mining.",
                    "label": 0
                },
                {
                    "sent": "To be able to predict the result of their efforts based on the history of its farm.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The argument is that what we're trying to do is to respond to this to this need is a European Commission funded project under the framework of Horizon 2020, and what?",
                    "label": 1
                },
                {
                    "sent": "What is the name of the project is to develop a cloud platform that will help the companies to transform data into knowledge and then to use this knowledge to improve efficiency and you know.",
                    "label": 1
                },
                {
                    "sent": "The increased production in and in and in an environmentally friendly and sustainable way.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, what is new with this project?",
                    "label": 1
                },
                {
                    "sent": "It is the first time that experts from different areas like data mining, big data, aquaculture work together to make this kind of solution for for the sector.",
                    "label": 1
                },
                {
                    "sent": "So what we're going to do, and this is our mission statement to we're going to improve fish production by combining statistics, data mining, machine learning.",
                    "label": 0
                },
                {
                    "sent": "And the open data.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, I will not repeat the same thing.",
                    "label": 0
                },
                {
                    "sent": "This is our our mentality, but we're going to improve is all the main production KPI's like the feed conversion rate and mortality rate, the rate, the fees are growing.",
                    "label": 0
                },
                {
                    "sent": "So the production time improve the Halo health of the fees etc etc.",
                    "label": 1
                },
                {
                    "sent": "And we're going to offer this as a cloud service to the companies be cause many of them RSM isn't.",
                    "label": 0
                },
                {
                    "sent": "It is impossible for them to hire A data analyst that analysts or consultants too.",
                    "label": 0
                },
                {
                    "sent": "To do this a job, then they themselves, as I told you the an important aspect of the project is that it wants to change the culture in the sector.",
                    "label": 0
                },
                {
                    "sent": "What we're going to do is we're going to support the companies to compare the results of their analysis with similar results of different companies.",
                    "label": 1
                },
                {
                    "sent": "So this is clearly a benchmarking which will help have two positive effects.",
                    "label": 0
                },
                {
                    "sent": "It will help the companies to improve.",
                    "label": 0
                },
                {
                    "sent": "And it will also contribute to the generation of a knowledge base with very, very important information about the sector that will be very useful to all the other stakeholders, like governments research institutes.",
                    "label": 1
                },
                {
                    "sent": "Potential investors etc.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "EH, OK. As we said before, we have three main.",
                    "label": 0
                },
                {
                    "sent": "Axis it's it will be a cloud platform.",
                    "label": 0
                },
                {
                    "sent": "It will support multilingual data because obviously the the data are in different languages in different in different countries.",
                    "label": 0
                },
                {
                    "sent": "And what we want to do is to develop something.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Practical that is going to to answer real business business questions.",
                    "label": 0
                },
                {
                    "sent": "And we think that this system is going also to narrow the gap between the academics and the and the industrial people.",
                    "label": 1
                },
                {
                    "sent": "It will allow the companies to make some data available without.",
                    "label": 1
                },
                {
                    "sent": "Giving out corporate information that is really critical and they are very, very concerned about the privacy of their data and so we are dealing with sensitive data and we want to be the ones that will implement first time data analytics in our quick.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Social sector here is a list of the sum of the of the of the important business questions that we want to to answer with with our customers and the answer to each of those questions have has a very significant.",
                    "label": 0
                },
                {
                    "sent": "Value.",
                    "label": 0
                },
                {
                    "sent": "Can can have a very significant positive effect on the on the performance of of the.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Company.",
                    "label": 0
                },
                {
                    "sent": "OK, and what we're going to do is to help the companies to understand what has happened, why and of course to predict.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The future to do that, we're using a mix of technologies.",
                    "label": 0
                },
                {
                    "sent": "We're using descriptive statistics that will help them to visualize information about their performance.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All kinds of visualization tools.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, tools that help them to develop models and patterns about main production.",
                    "label": 0
                },
                {
                    "sent": "Data.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And finally, this is I think the best part advanced the machine learning technologies and algorithms that help them.",
                    "label": 1
                },
                {
                    "sent": "To quantify.",
                    "label": 0
                },
                {
                    "sent": "The effect of all the parameters that influence the result of the production process.",
                    "label": 0
                },
                {
                    "sent": "To the to to the result until now companies have just feelings that they have no tools to be able to translate those feelings to numbers and take decisions based on on facts.",
                    "label": 0
                },
                {
                    "sent": "So this is an example of neural network that tells the companies which are the most important parameters that influence the success of the production in a negative or positive way, so they know where to focus their efforts for.",
                    "label": 0
                },
                {
                    "sent": "Improvements.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is another example which is another neural network that allows them to predict what will both will be the outcome of the harvest based on the history and a number of and all the characteristics of the populations which also has a very high business value.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And of course, what we're going to do is to develop standards for both sector and that Lincoln can say more.",
                    "label": 0
                },
                {
                    "sent": "On this.",
                    "label": 0
                },
                {
                    "sent": "Thank you Chris.",
                    "label": 0
                },
                {
                    "sent": "I congratulate you with speed of getting through that I didn't think I'd be here so quickly with our as Costas has said, the agriculture area is is of considerable importance.",
                    "label": 0
                },
                {
                    "sent": "Worldwide, and we propose in our approach to standards to liaise with ISO, the International Standards Organization which has a working Group 9 which is started to look at overarching standards for big data and we will be following what they're doing and ensuring that we will work within whatever framework they come up with.",
                    "label": 1
                },
                {
                    "sent": "And I think very well she will be speaking after this session will.",
                    "label": 0
                },
                {
                    "sent": "Address some issues and in terms of working Group 9, but this is a European funded project so we are going to develop a business plan for a San workshop.",
                    "label": 1
                },
                {
                    "sent": "San is the European standards body and we will develop a send workshop on big data and.",
                    "label": 0
                },
                {
                    "sent": "In order to be not to duplicate the efforts of I so we will look at particular industry sectors taking the overarching plan from ISO and looking at industry sectors and the first industry sector will be at the food industry.",
                    "label": 0
                },
                {
                    "sent": "Agriculture, in particular other areas that we have, are considering our manufacturing and and healthcare.",
                    "label": 1
                },
                {
                    "sent": "We plan to create a draft send workshop agreement to CWA.",
                    "label": 0
                },
                {
                    "sent": "Ascend Workshop Agreement is a document produced by San.",
                    "label": 0
                },
                {
                    "sent": "It is not a standard, but it is an agreed document by members of a workshop who are peers.",
                    "label": 0
                },
                {
                    "sent": "Workshops are open there, open to academics, industry people, anyone who has an interest in the area, and it's open not only to people from Europe, but people from across the world.",
                    "label": 0
                },
                {
                    "sent": "And we have I'm involved in another send workshop where we have active participation from people in in Russia and in Japan and in Canada.",
                    "label": 1
                },
                {
                    "sent": "So it's it's it's it's taking San as a European organization an looking more broadly, we will present our draft San Workshop Agreement regarding agriculture to the stakeholders and hopefully having a approval from them.",
                    "label": 0
                },
                {
                    "sent": "We will.",
                    "label": 0
                },
                {
                    "sent": "Produce a sand workshop agreement for agriculture.",
                    "label": 0
                },
                {
                    "sent": "The Send Workshop agreement will then give guidelines for people to share data.",
                    "label": 0
                },
                {
                    "sent": "It will be very important that people in different parts of the world can share the data that competitors can share data so that they will take the best knowledge that has been gained from the agriculture product, which cost us has described and an share that data with other people to get the benefits for production and efficiency and.",
                    "label": 0
                },
                {
                    "sent": "Improving the quality and and efficiency of producing the the fish.",
                    "label": 0
                },
                {
                    "sent": "So that's the idea.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to go into standards and but our initial thought is to produce in not a standard, but Ascend Workshop agreement.",
                    "label": 0
                },
                {
                    "sent": "And if that is acceptable we will move onto standards later on.",
                    "label": 0
                },
                {
                    "sent": "But the first thing is an agreement on how to share the data, 'cause we've seen that there's been a lot of big data.",
                    "label": 0
                },
                {
                    "sent": "Produced with agriculture.",
                    "label": 0
                },
                {
                    "sent": "So it passed you back.",
                    "label": 0
                },
                {
                    "sent": "Where are we actually the last?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Overhead, yeah, and what we're going to say is that first of all, thank you for your attention.",
                    "label": 0
                },
                {
                    "sent": "We will be happy to hear from you and if you want to be in touch with with us, you know we welcome any comments, ideas, suggestions, etc.",
                    "label": 1
                },
                {
                    "sent": "That's it.",
                    "label": 0
                }
            ]
        }
    }
}