{
    "id": "dti7lt2ajm365fhf2zbdd2ubihezbfat",
    "title": "One Equilibrium Is Not Enough: Computing Game-Theoretic Solutions to Act Strategically",
    "info": {
        "author": [
            "Vincent Conitzer, Department of Computer Science, Duke University"
        ],
        "published": "Aug. 23, 2011",
        "recorded": "July 2011",
        "category": [
            "Top->Computer Science",
            "Top->Mathematics->Game Theory"
        ]
    },
    "url": "http://videolectures.net/ijcai2011_conitzer_equilibrium/",
    "segmentation": [
        [
            "So in the world there are many environments where multiple entities have to interact even though they have different preferences."
        ],
        [
            "And in recent years, AI researchers have become especially interested in these types of settings.",
            "Of course, the most natural points for connection are the ones that already have something to do with computer science, so one."
        ],
        [
            "Example is sponsored search auctions.",
            "These are the options that companies like Google used to allocate the advertisement space on their site and we'll hear more about this from Susan Athey tomorrow morning.",
            "If you can make it in reality, AI researchers are interested in a lot of different types of options as well, such as combined net which boy just mentioned."
        ],
        [
            "On the Internet we also find many Ratingen voting systems, and then there are various new types of marketplaces that AI researchers have been can."
        ],
        [
            "Meeting to one example is a kidney exchange, so in a kidney exchange 2 patients can get together and swap their donors.",
            "If this results in better matches for both of them without any money changing."
        ],
        [
            "Another example is prediction markets.",
            "So in a prediction markets, securities are traded with the purpose of estimating a probability of some future event, such as whether Obama will be reelected."
        ],
        [
            "And finally, boy already mentioned this, that we've done a little bit of work on creating markets that make matching donations to charitable causes more efficient."
        ],
        [
            "And then finally another example is security and."
        ],
        [
            "This is the one that I'll talk about today just because of time."
        ],
        [
            "Reasons if you're interested in some of the other work, I would like to shamelessly promote my communications of the ACM article from last year, which talks about all of these topics."
        ],
        [
            "Within AI we also face these types of issues."
        ],
        [
            "In particular, in game playing, there's a long tradition of game playing in AI games, such as chess.",
            "Mostly, we're all familiar with, but if you're like me and your interest in game theory, you're probably more excited by games that have imperfect information, which means that a single player cannot see the whole state of the game."
        ],
        [
            "Typical examples are games that involve cards such as poker, and in fact in the AI community, many people have become interested in poker competitions, so there."
        ],
        [
            "Computer, computer poker competitions.",
            "But there's also some ones with humans.",
            "Here we see some pictures.",
            "So on the left.",
            "Here we see the AAAI 2007.",
            "There was the first man Machine poker championship.",
            "On the right we see a little puzzle, which is can you tell which two are to CMU researchers and which one is the poker professional.",
            "It may help to know that the poker poker professional poker pros nickname is Jesus.",
            "So I myself have actually not made any significant contribu."
        ],
        [
            "Insta poker at all.",
            "One thing I did do is if you go to my website you can find the source code for an optimal player for a class of liars dice games.",
            "So these are games that involve rolling dice and then bluffing to your opponent about how much you roll."
        ],
        [
            "More broadly, speaking in Multiagent systems we also see these issues come up.",
            "So here we have a little example where shaky to robots has a goal of getting a particular room blocked off, and Meanwhile there's a Roomba.",
            "Was the goal of cleaning that particular room so you can see the potential for conflict here, but it's not necessarily unavoidable, and they may be able to resolve it.",
            "So how do these things work themselves out?"
        ],
        [
            "It really leads us to microeconomic theory.",
            "As boy already mentioned, what I've put up here is this is one of the main graduate textbooks in microeconomic theory, if not the main one.",
            "The reason I'm putting up this one is, well, I have a copy of it and have used it heavily."
        ],
        [
            "But also the first author is on the table Mascola who talked to us this morning."
        ],
        [
            "So what are some useful tools for microeconomic theory for AI?",
            "And for me, as boy already mentioned, they really fall into three different categories.",
            "Game theory, so game theory is about how do you act strategically in an environment with other strategic agents?"
        ],
        [
            "There's also social choice, which is about how do you make a decision?",
            "A joint decision in an environment with multiple agents with different preferences?"
        ],
        [
            "And finally, there is mechanism design which in a way combines the two because it is about making joint decisions in environments where the agents act strategically.",
            "Ann won't necessarily report their preferences truthfully if that's not in their best interest.",
            "What I've done here, by the way, is I've taken all of my PhD students former and current, and associated them roughly with one topic each.",
            "Very proud of the work that all of them have done, but for the purpose of this."
        ],
        [
            "Talk, I'll focus on a single topic, which is game theory.",
            "Now, I know that many of you are already familiar to some extent with game theory, but I want to take things from the beginning."
        ],
        [
            "So here's a simple example, one that probably most people are familiar with.",
            "It's the example of a penalty kick in soccer.",
            "Interesting thing about a penalty kick in soccer is the ball is so close to the goal that if your goal, if your goalkeeper and your strategy is well, let me just see where the ball goes and I'll try to jump in that direction.",
            "You'll be too late, so effectively what they have to do is they have to make the decision at the same time the goalkeeper has to decide whether to jump left to right and the kicker has to decide whether to kick left or right.",
            "So how might this unfold so?"
        ],
        [
            "Here's one way it might unfold, maybe to kick her thinks that well, there's a 60% probability that the goalkeeper will jump to the left."
        ],
        [
            "And hence I should shoot to the right.",
            "The goalkeeper.",
            "She might be a little bit more."
        ],
        [
            "Fistic ated so she might be thinking about what the kicker is thinking about what she will do, so she might believe that the kicker thinks that there is a 70% probability that she will jump to the left."
        ],
        [
            "And if she believes that she will also believe that the kicker will kick to the right, and let's say she believes all this with probability one."
        ],
        [
            "If that's how it is, she's going to jump to the right and stop the ball.",
            "This example is intended to raise a couple of questions.",
            "One of the questions is 2 of my grandparents were avid painters.",
            "And so, how did I end up with such a lack of artistic talent?",
            "But the other one is more relevant for this talk."
        ],
        [
            "At and it is, you know, is this a rational outcome?",
            "And it's not a wildly irrational outcome.",
            "At least the actions are consistent with the beliefs, but we may also ask whether the beliefs themselves are in fact rational, and this is what game theory does.",
            "It tries to get you both rational actions and beliefs at the same time."
        ],
        [
            "So how can we figure out how to solve this particular game?",
            "First we have to model it in a precise mathematical way, and this is typically done as normal form or by matrix game which we see over here.",
            "We make one of the players the role player choosing a row, so this is the goalkeeper choosing either to go to the left or to the right, and the column player to kick our chooses either to kick it to the left or to the right.",
            "So maybe the goalkeeper goes to the right and the kicker kicks left.",
            "We end up over here.",
            "This will give you the utilities for the two different players.",
            "In this case the kicker will in fact score so the goalkeeper goes one goal down and the kicker goes one go up right?",
            "So this is known as the normal form of the game."
        ],
        [
            "And if you already know some game theory, you know that the solution here is going to be that both players should play both of their actions with 50% probability each.",
            "From here, it's actually not that big of a leap to security settings."
        ],
        [
            "So here I've very slightly modified the example to turn it into a security example, so we have a guard at Barcelona's airport West.",
            "Decide whether to defend Terminal 2A or terminal."
        ],
        [
            "To be maybe maybe he goes to terminal to be and simultaneously we have an attacker who goes to either terminal 2A or terminal 2B.",
            "You can see this game has a very similar structure to the penalty kick game.",
            "And so we would presumably see this reflected in the normal."
        ],
        [
            "Arm as well, except in the real world, things may not be quite 0 sum right?",
            "So in this particular example, the attacker really likes to attack to be successful attack on 2B would be worth 2 to him, but the defender, actually she cares just as much about two as to be right and so now this game is no longer 0 sum.",
            "How should we solve it?"
        ],
        [
            "The solution here happens to be 2/3 going to two before the defender, the guard.",
            "So this may look like kinda playfully."
        ],
        [
            "Sample but in recent years, thanks to the work of our friends and colleagues at the University of Southern California, these things have become very real.",
            "In particular, you may have seen James Peters talk earlier today on airport security.",
            "So if you go to, for instance, Los Angeles International Airport now the way that they decide where checkpoints go, where canine units go is by running an algorithm that computes a game theoretic solution for this problem.",
            "The USC Group has also been working with the federal Air marshals, so the question here is which flights get a Federal Air Marshall assigned to them and the Coast Guard, and they have other applications in the works.",
            "So I hope by the end of the talk to give you some idea about the technical aspects of some of this work."
        ],
        [
            "But for now I want to 1st zoom out a little bit and talk about game theory in general because I don't want to assume that anyone already knows about game theory.",
            "Hopefully it will be a little bit entertaining to people who already know some.",
            "So here's a game that I call.",
            "Should I buy an SUV if you know the prisoners dilemma?",
            "It's basically the same game.",
            "In this game you're deciding what kind of car did by either a large car and SUV or a small car that you can also buy an.",
            "Your only goal is to minimize your own costs.",
            "This is what we're assuming.",
            "So the larger vehicle would be more expensive, both because it's itself more expensive and it uses more gas.",
            "And this is all you care about, except for one more thing."
        ],
        [
            "Which is that unfortunately, probably one day you'll get into an accident.",
            "Let's hope it's a minor one.",
            "But the cost, did you experience as a result of this accident?",
            "Depends on the car.",
            "Did you drive?",
            "But also the card at this other person drives and this other person is out there somewhere right now also making the same decision that you are OK the costed you experience if you both drive the same size of vehicle will be 5.",
            "But if one of you drives a smaller vehicle, your cost will be 8 and the person with the larger vehicle will have a cost of only two."
        ],
        [
            "If you add up all of these costs, you get the following game.",
            "The numbers here are negative because their costs and this game is an interesting property, which is let's reason from the perspective of the role player.",
            "If the other player buys an SUV, you'd be better off also buying an SUV and getting a cost of negative 10 rather than negative 11.",
            "But if the other player buys a small vehicle, you're still better off buying an SUV and getting negative 7 instead of negative 8, right?"
        ],
        [
            "So we say that.",
            "The choice of Anastrophe dominates the choice of a small car because regardless of what the other player does, you're better off choosing an SUV.",
            "And of course, this is the case for both play."
        ],
        [
            "Quite a bit of interesting work has been quite a bit of work has been done.",
            "I don't want to say my own work is interesting, but.",
            "On the computational aspects of dominance.",
            "Buds one thing also here to point out is that there's something unfortunate about the situation because both players will in fact choose to buy an SUV, giving both players a cost of 10.",
            "But there is a better outcome where both players get a cost of 8th.",
            "OK, and so how do we?",
            "This is somewhat inherently frustrating.",
            "This is something that you see pop up in game theory very often.",
            "You might think about how to fix this.",
            "One way to fix it is by using taxes or something like that.",
            "We heard a nice talk earlier today by Mike Wooldridge on that, but I don't want to think about that at all in this talk, so I'm always just going to take the game is given and we're just going to try to solve the game as it is.",
            "So here we're stuck with this bad solution."
        ],
        [
            "Here's another game.",
            "This is the game of chicken.",
            "You may have seen this before, so in this game two players drive cars straight out each other.",
            "If one player goes straight and the other one dodges the player to go straight wins.",
            "So we see that here.",
            "So here the role player goes straight in the column, player Dodges the role play against utility one.",
            "The common player gets negative one.",
            "If both players go straight, they both get a utility of negative 5 for dying, and if they both Dodge.",
            "They both, could you tell you have zero?",
            "It's kind of a tie.",
            "This is assuming that they're smart enough to have a convention to both Dodge to the right.",
            "If one of them were to Dodge the left, you might get an even worse outcome.",
            "So how do we solve a game like chicken?",
            "This is definitely more tricky because there's no longer a dominant strategy.",
            "What you want to do depends on what the other play."
        ],
        [
            "Are those.",
            "And this leads us to Nash equilibrium.",
            "You may."
        ],
        [
            "I've seen the movie beautiful mind."
        ],
        [
            "But that's not."
        ],
        [
            "Nash, that's Russell Crowe."
        ],
        [
            "So this is Nash.",
            "And what is a Nash equilibrium?",
            "It's a profile consisting of a strategy for each play."
        ],
        [
            "Sorry for."
        ],
        [
            "Turn out to be exactly indifferent between dajing and going."
        ],
        [
            "OK, if."
        ],
        [
            "If you work in game theory long enough, you start to see games everywhere.",
            "So actually I'm playing a game with you right now, which I called the presentation game.",
            "I have a choice either to put effort into my presentation or not to put effort into my presentation, and you have a choice to pay attention or not to pay attention.",
            "OK, this game has a variety of outcomes.",
            "One is where I don't put an effort and you don't pay attention and this is kind of a no up.",
            "Yeah, nobody gets any better or worse off.",
            "Another outcome is where I put an effort, but you don't pay attention.",
            "So this is a little bit worse for me 'cause I wasted some effort.",
            "You don't know any different.",
            "A better outcome is where I put an effort and you pay attention.",
            "And then there's a really bad outcome where I don't put any effort in and you do pay attention because you know now I look really bad and you get completely disillusioned with the idea of paying attention to talks.",
            "So we want to avoid that outcome."
        ],
        [
            "This game has a couple of different equilibrium.",
            "There's a good equilibrium over here where I put effort in and you pay attention.",
            "There's a bad, worse equilibrium over here where I don't put in effort and you don't pay attention.",
            "It turns out there's another mixed strategy equilibrium.",
            "This is one that unfortunately."
        ],
        [
            "All too familiar in the room."
        ],
        [
            "World, it's the one where the speaker is probably putting in a lot of effort and the audience is probably not paying any attention."
        ],
        [
            "This is really bad for the person."
        ],
        [
            "By the way.",
            "In a way, we always want to think about how to model and represent our the world and games in particular.",
            "Now in this talk I'm going to focus exclusively on normal form games, but I do want to quickly point out some other ways of repres."
        ],
        [
            "Nothing games, one is Beijing game.",
            "So Beijing Games allow you to express uncertainty such as you may not be sure about your opponents utilities."
        ],
        [
            "Extensive form games.",
            "These are generalization of the game trees that we see in our AI classes, but they also allow for modeling imperfect information and therefore can model games such as poker.",
            "In fact, this is a small poker game right here."
        ],
        [
            "There are stochastic games which you can think of as MDP's with multiple players."
        ],
        [
            "And then there are some representation schemes introduced by AI research."
        ],
        [
            "Are such as graphical."
        ],
        [
            "Games Action Graph Games, an multiagent influence diagrams the latter.",
            "They generalize influence diagrams, which in turn generalize Bay."
        ],
        [
            "And that works."
        ],
        [
            "So."
        ],
        [
            "How hard is it to compute Nash equilibrium?",
            "Let's say in normal form games?",
            "That's not that well defined.",
            "The question do you want to compute all of the Nash equilibrium?",
            "Do you want to compute the best Nash equilibrium, or do you just want to compute anyone Nash equilibrium?",
            "You don't care which one?",
            "If we focus on the last question for a second, that's actually one that has received a lot of attention, not just from AI researchers, but also from theoretical computer science researchers leading crystals.",
            "Puppeteer, at some point to proclaim it one of the two most important concrete open questions on the boundary of polynomial time.",
            "A couple of years after he said that."
        ],
        [
            "The question basically got resolved, so it turns out to be pad complete to compute one Nash equilibrium."
        ],
        [
            "In fact, he himself was involved in this result as well.",
            "Now you may not know what Pee Pad is, so pee pad completeness is some evidence that there's probably not going to be a polynomial time solution.",
            "It's some reasonable evidence is probably not as strong evidence as NP hardness that there's no tractable solution.",
            "So anyway, P pad stands for polynomial parity arguments directed.",
            "If that sounds awkward or difficult to remember, it may not help to know that."
        ],
        [
            "It was introduced by Crystals Papademetriou.",
            "So he had his hands all over this result."
        ],
        [
            "But what I want to ask as well, it's not really clear that just computing one Nash equilibrium does the trick for us.",
            "Are we happy if we look at the presentation game and compute one of the Vatican, Libya, for instance?",
            "Presumably not.",
            "So we might hope to compute in some sense a good equity."
        ],
        [
            "Grim, but that turns out to in fact be NP hard.",
            "So here is a little bit of a sketch of a reduction that we have from satisfiability to a game, so this reduction will take any satisfiability instance such as this one over here, which has two solutions and map it."
        ],
        [
            "To a game I'm not going to describe exactly how this game gets created."
        ],
        [
            "But the important takeaway points are this game that you create is going to have for every solution that the original satisfiability instance had.",
            "If any, there's going to be a good equilibrium, right?",
            "So there's a green equilibrium here corresponding to the green solution, and so on.",
            "And then also there's going to always be one additional.",
            "Librium, which is the default equilibrium which is going to give relatively low utilities to the players.",
            "And the reason that this shows that this is an NP hard problem that's an NP hard problem.",
            "To find a good equilibrium is that suppose that you had such an algorithm.",
            "Then you could use it to solve satisfiability, because what would you do?",
            "You take your satisfiability and turn it into this game.",
            "See if you would get a good equilibrium out of it.",
            "If it's anything better than epsilon epsilon.",
            "You're going to know that the satisfiability instance had a solution otherwise not, and you can draw a bunch of other implications from this result as well from this reduction."
        ],
        [
            "These hardness results haven't really prevented people from looking for algorithms to solve games anyway.",
            "For Nash equilibrium, probably the best known algorithm is to Lemke Howson algorithm which really exploits the structure of the problem in a very nice way.",
            "Unfortunately, in some cases it still takes exponential."
        ],
        [
            "I'm little bit more of an AI type of approaches to search for an equilibrium.",
            "Turns out that you just need to search over to supports.",
            "Once you've identified the supports the positive probability actions in the equilibrium.",
            "It's an easy problem and this you can also use to turn into a mixed integer programming formulation, which can be used to compute an optimal equilibrium."
        ],
        [
            "Then there's work on special cases where you can efficiently either solve the whole game or reduce it to a smaller game that you can then solve."
        ],
        [
            "With another method and also a lot of work on computing approximate equilibrium.",
            "But regardless of whether these algorithms scale to your particular problem, there's still a deeper problem which is the equilibrium selection problem, which is well in general, game is going to have multiple equilibrium, so which one should you play?",
            "What should you play in chicken?",
            "And this is a very frustrating situation that actually we still don't really know what the plan chicken, right?",
            "And it's it's kind of inherent in the definition of Nash equal."
        ],
        [
            "So maybe we can get around this problem somehow.",
            "Right, So what if I told you that there is some way in which we can avoid the equilibrium selection problem altogether?",
            "That is computationally more tractable.",
            "And finally, that's guaranteed to give you at least as good a utility as any Nash equilibrium.",
            "So obviously I must be changing something about how we're solving the game here, right?",
            "And that's what I'll do."
        ],
        [
            "But this is actually what is used in the security application, so we'll start getting to that."
        ],
        [
            "And the idea is the idea of commitments.",
            "If one of the players can commit before the other player gets the move.",
            "It changes the game in a way so this game here is a typical example of it.",
            "By the way, these games where one player gets to move before the other are usually known as Stackelberg Games.",
            "OK, this particular game is very easy to solve."
        ],
        [
            "It has unique Nash equilibrium in the top left corner.",
            "It's not that hard to see.",
            "You can see that the top strategy actually dominates the bottom strategy.",
            "From there on, it's easy, but now if you."
        ],
        [
            "Change it so that.",
            "The game is played as follows."
        ],
        [
            "Where one player first commits to playing one of the rows."
        ],
        [
            "Then the other player first observes this commitment and only then chooses a column.",
            "This changes the game in a fundamental way."
        ],
        [
            "And actually it becomes optimal for the first player to play to down row.",
            "Why is that?",
            "Because if you played a down row, the best response for the for the column player is to get this one and play right rather than to get to 0 by playing left.",
            "OK, but this actually gives the role player utility of two rather than the one that she would have gotten either in the equilibrium or by committing to up."
        ],
        [
            "You can do even better in the same game bikam."
        ],
        [
            "Into a mixed strategy.",
            "So if you commit to something like playing 51% of the time down, then it's still optimal for the column player to play right?"
        ],
        [
            "Why?",
            "Because by playing right he gets 151% of the time versus getting 149% of the time by playing left, right?",
            "But this actually gives the role player two half the time and three half the time just about right.",
            "And so it's even better than getting the two from committing to down."
        ],
        [
            "So these we sometimes also called Stackelberg make strategies."
        ],
        [
            "So what does this have to do?"
        ],
        [
            "With security, why would you think that this is a reasonable model for?"
        ],
        [
            "Security.",
            "And the reason is as follows.",
            "So you can argue or one argument anyway is that the defender has to choose some targets of defend every single day, but the attacker can just."
        ],
        [
            "Wait and observe for a while.",
            "OK, so for instance, maybe the first day the defender."
        ],
        [
            "Defense 2"
        ],
        [
            "Day and so every day."
        ],
        [
            "Defender makes choice, and attackers just kind of sitting out.",
            "For now observing what's going on up to the point where the attacker has a pretty good idea of what the distribution is that the defender."
        ],
        [
            "Using.",
            "And then attacks right, and so this corresponds more closely to the model that I just described."
        ],
        [
            "This is not a watertight argument.",
            "And in fact, quite a bit of work has already looked at, well, you know, what?",
            "If the observe ability isn't perfect?",
            "Those kinds of questions, but I'll give another reason why this is a reasonable model in just a little bit."
        ],
        [
            "So going away from security games again and to the general case for a little bit, so how hard is it to compute this optimal Stackelberg strategy?",
            "And it turns out actually it's not pee pad complete or NP hard or anything.",
            "There's a very simple polynomial time algorithm using linear programming for it."
        ],
        [
            "The way it works is as follows.",
            "We do dividing conquer over different columns of the game so for every for every column see star we're going to ask the following question.",
            "If my goal as a role player is to incentivize the column player to play that particular see Star.",
            "What's the best way I can do?"
        ],
        [
            "And this actually corresponds to very simple linear program.",
            "We're going to put probabilities on.",
            "The rows are going to be our variables to have."
        ],
        [
            "Yes, on the one that's a distribution constraint for every alternative column, the column player might play the expected utility for the column player of playing that should be at most expected utility for playing the column that we actually want the follow."
        ],
        [
            "To play and then under that constraint, we maximize our."
        ],
        [
            "Unexpected utility so very simple in your program, but this actually shows it's doable in polynome."
        ],
        [
            "All time.",
            "There's various other nice."
        ],
        [
            "Properties of commitments make strategies, so if you look at a 0 sum game, actually you end up doing the exact same thing as an ad."
        ],
        [
            "Equilibrium.",
            "In any game, the leaders payoff from committing to mix strategy is going to be at least as good as any national."
        ],
        [
            "The rim.",
            "And finally, there's no equilibrium selection problem anymore, because in the Stackelberg model, for instance, in the game of Chicken, the Stackelberg leader will just go straight and the follower better get out of the way."
        ],
        [
            "This model introduces a lot of other questions, even in normal form games, but particularly interesting also is to compute these optimal strategies to commit to another game."
        ],
        [
            "Things as well.",
            "For example, invasion games so Beijing Games were actually what was used for the original Los Angeles airport application that was this paper over here."
        ],
        [
            "We've also been looking at it in the config."
        ],
        [
            "So extensive form games are now stochastic games as well.",
            "So that's all for."
        ],
        [
            "Unrestricted games now I want to talk a little bit about the particular structure that the security games have.",
            "And this is the model of security games that was introduced by the USC Group it."
        ],
        [
            "Works as follows, so in such a game there are some set of targets T which might be attacked.",
            "So if we think about the federal air Marshals domain, these are."
        ],
        [
            "Flights that might be attacked.",
            "There is a set of security resources Omega which is available to the defender, so this might be your Federal Air Marshall."
        ],
        [
            "There's a set of schedules, so a schedule is in the case of federal Air Marshals.",
            "It's a tour of flights that a single Air Marshall could conceivably go on at the same time, or in a single."
        ],
        [
            "Sword.",
            "And then there's some constraints on which federal air marshals can be assigned to which tours of flights."
        ],
        [
            "And then the attacker is going to choose a single target to attack."
        ],
        [
            "And then there are some natural constraints on the utilities that that that all the players receive from this.",
            "So it's determined by which target is attacked, an whether that target is defended or not.",
            "Of course, the defender prefers it to be defendant, and the attacker prefers it to be not defend."
        ],
        [
            "Because it's a restricted class of games.",
            "It opens up the possibility that this game has this class of games, has interesting game theoretic properties.",
            "Maybe they're like 0 sum games in some sense, and it turns out that that's the case."
        ],
        [
            "So in particular it has this property that any Stackelberg strategy in this game will also be a national strategy.",
            "So that to some extent alleviates any concern that you might have about using the Stackelberg concept."
        ],
        [
            "This framework it also has what's known as the interchangeability property for Nash equilibrium.",
            "What does that mean?",
            "So here I've shown a game and not a security game, with interchangeability property and I've pointed out two of its Nash equilibrium.",
            "There's this regular Nash equilibrium in this blue Nash equilibrium."
        ],
        [
            "It turns out you can do things like this.",
            "You can swap."
        ],
        [
            "Two colored Nash is an.",
            "You'll still end up with two Nash equilibrium, so you can kind of mix and match, and you're guaranteed to still have a Nash equilibrium, and the security games also have this property.",
            "Games in general don't have this property like the game of chicken does not have this property.",
            "By the way, we've also recently looked at what happens if the attacker is able to attack multiple targets at once, and then some of these properties change, or at least the first one goes away, but the second one is still there.",
            "And if you're interested in that, I would invite you to see DM's poster and talk."
        ],
        [
            "Finally, I want to talk a little bit about scalability.",
            "So one problem with these security games is that we can convert them to the normal form and then solve that, but the normal form will in general have exponential size in the more natural security game representation, so we may not be able to use that and so quite a bit of work has been done by the USC Group as well as us.",
            "Algorithms for solving these games anyway?"
        ],
        [
            "I'll say something about that in a second and another class of games besides this basic model of security games are various types of games on graphs.",
            "Over here is an example of work that we've also been doing with the USC Group, where we consider where to put checkpoints in the city like Mumbai to prevent terrorist attacks."
        ],
        [
            "Some of the techniques that are helpful in these cases include the."
        ],
        [
            "Sign.",
            "One is to come up with compact linear programs, right?",
            "So if you take the linear program for the normal form of the game, that's going to have exponential size because there's going to be a probability for every assignment of resources two targets.",
            "But sometimes you can actually just reason about the marginal probabilities of assigning particular resources to particular targets, and that sometimes works in some and under some conditions that works.",
            "And then you have a polynomially or you have an exponentially smaller linear program to deal with, and sometimes it doesn't work."
        ],
        [
            "And it doesn't work.",
            "There's other things you can do, like you can instead of writing down the huge help you right away, you can try to generate it one step at a time using techniques from column and constraint generation.",
            "And if you're lucky, you end up in the end terminating with a much smaller linear program.",
            "But these games, especially games on graphs, are still very challenging."
        ],
        [
            "So to summarize a little bit.",
            "I think we in a I have really benefited a lot from work done previously in game theory, but as we get more sophisticated we're really starting to push at some of the boundaries of game theory as well, so it's maybe not too surprising that this happens on the computational and representational ends.",
            "It also happens in learning games, and perhaps more surprising recently various groups have also been working on playing games with human subjects, and so we're making contributions on the behavioral side of things.",
            "And we're even making some fundamental conceptual contributions, I think, especially because we have to deal with these equilibrium selection type of issues in real life.",
            "As kind of a higher level comments, I think AI researchers have also really contributed to a shift in the view of microeconomic theory.",
            "So, and the shift is kind of away from seeing microeconomic theory as just an idealized model of the real world and towards seeing it as a useful tool kit that we can use to create new types of applications.",
            "And I think many of these applications are so left to be discovered an I hope some of you will join us in finding outlook as well.",
            "But before we get to that I want."
        ],
        [
            "Quickly thank some people and organizations.",
            "First of all, the organizations that have funded me since the beginning of my PhD."
        ],
        [
            "My academic family.",
            "This is a very partial subtree of my academic family.",
            "Now I drew this picture in a somewhat clumsy way, because there's only a very tiny little arrow from Thomas coming to me really that should be a big fat arrow.",
            "I've learned a lot from Thomas as an advisor.",
            "For me, he was a very good advisor.",
            "I've also benefited tremendously, tremendously from very talented graduate students.",
            "So in particular, if you're hiring in the next couple of years, I would encourage you to really pay attention to some of these guys who will be on the market.",
            "I also want to quickly thank Barbara Grosz and Ivy Pfeffer for teaching the courses at Harvard that got me interested in this originally."
        ],
        [
            "I want to thank my colleagues in a a Duke.",
            "In this case there should be a big fat arrow from run, so I've learned a lot from ran over the years.",
            "He's been my mentor there since the day that I got there.",
            "I also want to point out to prevent any confusion that in spite of these nice little frames, Alan and Don are still very much alive and we enjoy seeing them from time to time.",
            "Ah."
        ],
        [
            "And finally, I want to thank my family, without whom, without whom I wouldn't exist, but also without who's loving support.",
            "I wouldn't be anywhere close to where I am today.",
            "Thank you very much.",
            "You pointed out that the.",
            "Stackelberg assumption that there's commitment power that the agencies that have are defending have static have the ability to do a Stackelberg commitment is controversial, but actually they could do things further to promote that commitment.",
            "You know they could pump the air marshals can publish their schedules and show verify that they really are going with them, that their animal sense.",
            "Do they do this?",
            "Would you advocate that they do?",
            "This did happen.",
            "This gives them some extra benefits, so so as to what's going on right now.",
            "So with federal air Marshals, it's particularly interesting because they actually try to stay on their cover, right?",
            "So you might think, well, maybe at the end of the flight they should identify themselves.",
            "And hey, by the way, I was the Federal Air Marshall.",
            "I don't think that's going to happen.",
            "One reasonable reason why you might not want to do that.",
            "So if you think you've modeled everything perfectly, you wouldn't hurt and might even help to do that right?",
            "And you're exactly right about that.",
            "In the real world, however, you might be concerned that you've actually missed something in the modeling an from declaring the strategy, it becomes very obvious that you haven't thought about this one particular kind of attack, so I think it's a great question, and it also leads into these issues of unawareness and game theory that some people are studying that you may not even be aware of everything that you or your opponent might do.",
            "And those are still very inherently difficult issues.",
            "So we need more research on it."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in the world there are many environments where multiple entities have to interact even though they have different preferences.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in recent years, AI researchers have become especially interested in these types of settings.",
                    "label": 0
                },
                {
                    "sent": "Of course, the most natural points for connection are the ones that already have something to do with computer science, so one.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Example is sponsored search auctions.",
                    "label": 0
                },
                {
                    "sent": "These are the options that companies like Google used to allocate the advertisement space on their site and we'll hear more about this from Susan Athey tomorrow morning.",
                    "label": 0
                },
                {
                    "sent": "If you can make it in reality, AI researchers are interested in a lot of different types of options as well, such as combined net which boy just mentioned.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the Internet we also find many Ratingen voting systems, and then there are various new types of marketplaces that AI researchers have been can.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Meeting to one example is a kidney exchange, so in a kidney exchange 2 patients can get together and swap their donors.",
                    "label": 0
                },
                {
                    "sent": "If this results in better matches for both of them without any money changing.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another example is prediction markets.",
                    "label": 0
                },
                {
                    "sent": "So in a prediction markets, securities are traded with the purpose of estimating a probability of some future event, such as whether Obama will be reelected.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally, boy already mentioned this, that we've done a little bit of work on creating markets that make matching donations to charitable causes more efficient.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then finally another example is security and.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the one that I'll talk about today just because of time.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Reasons if you're interested in some of the other work, I would like to shamelessly promote my communications of the ACM article from last year, which talks about all of these topics.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Within AI we also face these types of issues.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In particular, in game playing, there's a long tradition of game playing in AI games, such as chess.",
                    "label": 0
                },
                {
                    "sent": "Mostly, we're all familiar with, but if you're like me and your interest in game theory, you're probably more excited by games that have imperfect information, which means that a single player cannot see the whole state of the game.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Typical examples are games that involve cards such as poker, and in fact in the AI community, many people have become interested in poker competitions, so there.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Computer, computer poker competitions.",
                    "label": 0
                },
                {
                    "sent": "But there's also some ones with humans.",
                    "label": 0
                },
                {
                    "sent": "Here we see some pictures.",
                    "label": 0
                },
                {
                    "sent": "So on the left.",
                    "label": 0
                },
                {
                    "sent": "Here we see the AAAI 2007.",
                    "label": 0
                },
                {
                    "sent": "There was the first man Machine poker championship.",
                    "label": 0
                },
                {
                    "sent": "On the right we see a little puzzle, which is can you tell which two are to CMU researchers and which one is the poker professional.",
                    "label": 0
                },
                {
                    "sent": "It may help to know that the poker poker professional poker pros nickname is Jesus.",
                    "label": 0
                },
                {
                    "sent": "So I myself have actually not made any significant contribu.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Insta poker at all.",
                    "label": 0
                },
                {
                    "sent": "One thing I did do is if you go to my website you can find the source code for an optimal player for a class of liars dice games.",
                    "label": 0
                },
                {
                    "sent": "So these are games that involve rolling dice and then bluffing to your opponent about how much you roll.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "More broadly, speaking in Multiagent systems we also see these issues come up.",
                    "label": 1
                },
                {
                    "sent": "So here we have a little example where shaky to robots has a goal of getting a particular room blocked off, and Meanwhile there's a Roomba.",
                    "label": 0
                },
                {
                    "sent": "Was the goal of cleaning that particular room so you can see the potential for conflict here, but it's not necessarily unavoidable, and they may be able to resolve it.",
                    "label": 0
                },
                {
                    "sent": "So how do these things work themselves out?",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It really leads us to microeconomic theory.",
                    "label": 0
                },
                {
                    "sent": "As boy already mentioned, what I've put up here is this is one of the main graduate textbooks in microeconomic theory, if not the main one.",
                    "label": 0
                },
                {
                    "sent": "The reason I'm putting up this one is, well, I have a copy of it and have used it heavily.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But also the first author is on the table Mascola who talked to us this morning.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what are some useful tools for microeconomic theory for AI?",
                    "label": 0
                },
                {
                    "sent": "And for me, as boy already mentioned, they really fall into three different categories.",
                    "label": 0
                },
                {
                    "sent": "Game theory, so game theory is about how do you act strategically in an environment with other strategic agents?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's also social choice, which is about how do you make a decision?",
                    "label": 0
                },
                {
                    "sent": "A joint decision in an environment with multiple agents with different preferences?",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally, there is mechanism design which in a way combines the two because it is about making joint decisions in environments where the agents act strategically.",
                    "label": 0
                },
                {
                    "sent": "Ann won't necessarily report their preferences truthfully if that's not in their best interest.",
                    "label": 0
                },
                {
                    "sent": "What I've done here, by the way, is I've taken all of my PhD students former and current, and associated them roughly with one topic each.",
                    "label": 0
                },
                {
                    "sent": "Very proud of the work that all of them have done, but for the purpose of this.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Talk, I'll focus on a single topic, which is game theory.",
                    "label": 0
                },
                {
                    "sent": "Now, I know that many of you are already familiar to some extent with game theory, but I want to take things from the beginning.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here's a simple example, one that probably most people are familiar with.",
                    "label": 0
                },
                {
                    "sent": "It's the example of a penalty kick in soccer.",
                    "label": 0
                },
                {
                    "sent": "Interesting thing about a penalty kick in soccer is the ball is so close to the goal that if your goal, if your goalkeeper and your strategy is well, let me just see where the ball goes and I'll try to jump in that direction.",
                    "label": 0
                },
                {
                    "sent": "You'll be too late, so effectively what they have to do is they have to make the decision at the same time the goalkeeper has to decide whether to jump left to right and the kicker has to decide whether to kick left or right.",
                    "label": 0
                },
                {
                    "sent": "So how might this unfold so?",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's one way it might unfold, maybe to kick her thinks that well, there's a 60% probability that the goalkeeper will jump to the left.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And hence I should shoot to the right.",
                    "label": 0
                },
                {
                    "sent": "The goalkeeper.",
                    "label": 0
                },
                {
                    "sent": "She might be a little bit more.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Fistic ated so she might be thinking about what the kicker is thinking about what she will do, so she might believe that the kicker thinks that there is a 70% probability that she will jump to the left.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And if she believes that she will also believe that the kicker will kick to the right, and let's say she believes all this with probability one.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If that's how it is, she's going to jump to the right and stop the ball.",
                    "label": 0
                },
                {
                    "sent": "This example is intended to raise a couple of questions.",
                    "label": 0
                },
                {
                    "sent": "One of the questions is 2 of my grandparents were avid painters.",
                    "label": 0
                },
                {
                    "sent": "And so, how did I end up with such a lack of artistic talent?",
                    "label": 0
                },
                {
                    "sent": "But the other one is more relevant for this talk.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At and it is, you know, is this a rational outcome?",
                    "label": 1
                },
                {
                    "sent": "And it's not a wildly irrational outcome.",
                    "label": 0
                },
                {
                    "sent": "At least the actions are consistent with the beliefs, but we may also ask whether the beliefs themselves are in fact rational, and this is what game theory does.",
                    "label": 0
                },
                {
                    "sent": "It tries to get you both rational actions and beliefs at the same time.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So how can we figure out how to solve this particular game?",
                    "label": 0
                },
                {
                    "sent": "First we have to model it in a precise mathematical way, and this is typically done as normal form or by matrix game which we see over here.",
                    "label": 0
                },
                {
                    "sent": "We make one of the players the role player choosing a row, so this is the goalkeeper choosing either to go to the left or to the right, and the column player to kick our chooses either to kick it to the left or to the right.",
                    "label": 0
                },
                {
                    "sent": "So maybe the goalkeeper goes to the right and the kicker kicks left.",
                    "label": 0
                },
                {
                    "sent": "We end up over here.",
                    "label": 0
                },
                {
                    "sent": "This will give you the utilities for the two different players.",
                    "label": 0
                },
                {
                    "sent": "In this case the kicker will in fact score so the goalkeeper goes one goal down and the kicker goes one go up right?",
                    "label": 0
                },
                {
                    "sent": "So this is known as the normal form of the game.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And if you already know some game theory, you know that the solution here is going to be that both players should play both of their actions with 50% probability each.",
                    "label": 0
                },
                {
                    "sent": "From here, it's actually not that big of a leap to security settings.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here I've very slightly modified the example to turn it into a security example, so we have a guard at Barcelona's airport West.",
                    "label": 0
                },
                {
                    "sent": "Decide whether to defend Terminal 2A or terminal.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To be maybe maybe he goes to terminal to be and simultaneously we have an attacker who goes to either terminal 2A or terminal 2B.",
                    "label": 1
                },
                {
                    "sent": "You can see this game has a very similar structure to the penalty kick game.",
                    "label": 0
                },
                {
                    "sent": "And so we would presumably see this reflected in the normal.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Arm as well, except in the real world, things may not be quite 0 sum right?",
                    "label": 0
                },
                {
                    "sent": "So in this particular example, the attacker really likes to attack to be successful attack on 2B would be worth 2 to him, but the defender, actually she cares just as much about two as to be right and so now this game is no longer 0 sum.",
                    "label": 0
                },
                {
                    "sent": "How should we solve it?",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The solution here happens to be 2/3 going to two before the defender, the guard.",
                    "label": 0
                },
                {
                    "sent": "So this may look like kinda playfully.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sample but in recent years, thanks to the work of our friends and colleagues at the University of Southern California, these things have become very real.",
                    "label": 0
                },
                {
                    "sent": "In particular, you may have seen James Peters talk earlier today on airport security.",
                    "label": 0
                },
                {
                    "sent": "So if you go to, for instance, Los Angeles International Airport now the way that they decide where checkpoints go, where canine units go is by running an algorithm that computes a game theoretic solution for this problem.",
                    "label": 0
                },
                {
                    "sent": "The USC Group has also been working with the federal Air marshals, so the question here is which flights get a Federal Air Marshall assigned to them and the Coast Guard, and they have other applications in the works.",
                    "label": 1
                },
                {
                    "sent": "So I hope by the end of the talk to give you some idea about the technical aspects of some of this work.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But for now I want to 1st zoom out a little bit and talk about game theory in general because I don't want to assume that anyone already knows about game theory.",
                    "label": 0
                },
                {
                    "sent": "Hopefully it will be a little bit entertaining to people who already know some.",
                    "label": 0
                },
                {
                    "sent": "So here's a game that I call.",
                    "label": 0
                },
                {
                    "sent": "Should I buy an SUV if you know the prisoners dilemma?",
                    "label": 0
                },
                {
                    "sent": "It's basically the same game.",
                    "label": 0
                },
                {
                    "sent": "In this game you're deciding what kind of car did by either a large car and SUV or a small car that you can also buy an.",
                    "label": 0
                },
                {
                    "sent": "Your only goal is to minimize your own costs.",
                    "label": 0
                },
                {
                    "sent": "This is what we're assuming.",
                    "label": 0
                },
                {
                    "sent": "So the larger vehicle would be more expensive, both because it's itself more expensive and it uses more gas.",
                    "label": 0
                },
                {
                    "sent": "And this is all you care about, except for one more thing.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which is that unfortunately, probably one day you'll get into an accident.",
                    "label": 0
                },
                {
                    "sent": "Let's hope it's a minor one.",
                    "label": 0
                },
                {
                    "sent": "But the cost, did you experience as a result of this accident?",
                    "label": 0
                },
                {
                    "sent": "Depends on the car.",
                    "label": 0
                },
                {
                    "sent": "Did you drive?",
                    "label": 0
                },
                {
                    "sent": "But also the card at this other person drives and this other person is out there somewhere right now also making the same decision that you are OK the costed you experience if you both drive the same size of vehicle will be 5.",
                    "label": 0
                },
                {
                    "sent": "But if one of you drives a smaller vehicle, your cost will be 8 and the person with the larger vehicle will have a cost of only two.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you add up all of these costs, you get the following game.",
                    "label": 0
                },
                {
                    "sent": "The numbers here are negative because their costs and this game is an interesting property, which is let's reason from the perspective of the role player.",
                    "label": 0
                },
                {
                    "sent": "If the other player buys an SUV, you'd be better off also buying an SUV and getting a cost of negative 10 rather than negative 11.",
                    "label": 0
                },
                {
                    "sent": "But if the other player buys a small vehicle, you're still better off buying an SUV and getting negative 7 instead of negative 8, right?",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we say that.",
                    "label": 0
                },
                {
                    "sent": "The choice of Anastrophe dominates the choice of a small car because regardless of what the other player does, you're better off choosing an SUV.",
                    "label": 0
                },
                {
                    "sent": "And of course, this is the case for both play.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Quite a bit of interesting work has been quite a bit of work has been done.",
                    "label": 0
                },
                {
                    "sent": "I don't want to say my own work is interesting, but.",
                    "label": 0
                },
                {
                    "sent": "On the computational aspects of dominance.",
                    "label": 1
                },
                {
                    "sent": "Buds one thing also here to point out is that there's something unfortunate about the situation because both players will in fact choose to buy an SUV, giving both players a cost of 10.",
                    "label": 0
                },
                {
                    "sent": "But there is a better outcome where both players get a cost of 8th.",
                    "label": 0
                },
                {
                    "sent": "OK, and so how do we?",
                    "label": 0
                },
                {
                    "sent": "This is somewhat inherently frustrating.",
                    "label": 0
                },
                {
                    "sent": "This is something that you see pop up in game theory very often.",
                    "label": 0
                },
                {
                    "sent": "You might think about how to fix this.",
                    "label": 0
                },
                {
                    "sent": "One way to fix it is by using taxes or something like that.",
                    "label": 0
                },
                {
                    "sent": "We heard a nice talk earlier today by Mike Wooldridge on that, but I don't want to think about that at all in this talk, so I'm always just going to take the game is given and we're just going to try to solve the game as it is.",
                    "label": 0
                },
                {
                    "sent": "So here we're stuck with this bad solution.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here's another game.",
                    "label": 0
                },
                {
                    "sent": "This is the game of chicken.",
                    "label": 0
                },
                {
                    "sent": "You may have seen this before, so in this game two players drive cars straight out each other.",
                    "label": 1
                },
                {
                    "sent": "If one player goes straight and the other one dodges the player to go straight wins.",
                    "label": 1
                },
                {
                    "sent": "So we see that here.",
                    "label": 0
                },
                {
                    "sent": "So here the role player goes straight in the column, player Dodges the role play against utility one.",
                    "label": 1
                },
                {
                    "sent": "The common player gets negative one.",
                    "label": 0
                },
                {
                    "sent": "If both players go straight, they both get a utility of negative 5 for dying, and if they both Dodge.",
                    "label": 0
                },
                {
                    "sent": "They both, could you tell you have zero?",
                    "label": 0
                },
                {
                    "sent": "It's kind of a tie.",
                    "label": 0
                },
                {
                    "sent": "This is assuming that they're smart enough to have a convention to both Dodge to the right.",
                    "label": 0
                },
                {
                    "sent": "If one of them were to Dodge the left, you might get an even worse outcome.",
                    "label": 0
                },
                {
                    "sent": "So how do we solve a game like chicken?",
                    "label": 0
                },
                {
                    "sent": "This is definitely more tricky because there's no longer a dominant strategy.",
                    "label": 0
                },
                {
                    "sent": "What you want to do depends on what the other play.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are those.",
                    "label": 0
                },
                {
                    "sent": "And this leads us to Nash equilibrium.",
                    "label": 0
                },
                {
                    "sent": "You may.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I've seen the movie beautiful mind.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But that's not.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nash, that's Russell Crowe.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is Nash.",
                    "label": 0
                },
                {
                    "sent": "And what is a Nash equilibrium?",
                    "label": 1
                },
                {
                    "sent": "It's a profile consisting of a strategy for each play.",
                    "label": 1
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sorry for.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Turn out to be exactly indifferent between dajing and going.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, if.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If you work in game theory long enough, you start to see games everywhere.",
                    "label": 0
                },
                {
                    "sent": "So actually I'm playing a game with you right now, which I called the presentation game.",
                    "label": 1
                },
                {
                    "sent": "I have a choice either to put effort into my presentation or not to put effort into my presentation, and you have a choice to pay attention or not to pay attention.",
                    "label": 1
                },
                {
                    "sent": "OK, this game has a variety of outcomes.",
                    "label": 0
                },
                {
                    "sent": "One is where I don't put an effort and you don't pay attention and this is kind of a no up.",
                    "label": 0
                },
                {
                    "sent": "Yeah, nobody gets any better or worse off.",
                    "label": 0
                },
                {
                    "sent": "Another outcome is where I put an effort, but you don't pay attention.",
                    "label": 0
                },
                {
                    "sent": "So this is a little bit worse for me 'cause I wasted some effort.",
                    "label": 0
                },
                {
                    "sent": "You don't know any different.",
                    "label": 0
                },
                {
                    "sent": "A better outcome is where I put an effort and you pay attention.",
                    "label": 0
                },
                {
                    "sent": "And then there's a really bad outcome where I don't put any effort in and you do pay attention because you know now I look really bad and you get completely disillusioned with the idea of paying attention to talks.",
                    "label": 0
                },
                {
                    "sent": "So we want to avoid that outcome.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This game has a couple of different equilibrium.",
                    "label": 0
                },
                {
                    "sent": "There's a good equilibrium over here where I put effort in and you pay attention.",
                    "label": 1
                },
                {
                    "sent": "There's a bad, worse equilibrium over here where I don't put in effort and you don't pay attention.",
                    "label": 0
                },
                {
                    "sent": "It turns out there's another mixed strategy equilibrium.",
                    "label": 0
                },
                {
                    "sent": "This is one that unfortunately.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All too familiar in the room.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "World, it's the one where the speaker is probably putting in a lot of effort and the audience is probably not paying any attention.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is really bad for the person.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "By the way.",
                    "label": 0
                },
                {
                    "sent": "In a way, we always want to think about how to model and represent our the world and games in particular.",
                    "label": 0
                },
                {
                    "sent": "Now in this talk I'm going to focus exclusively on normal form games, but I do want to quickly point out some other ways of repres.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nothing games, one is Beijing game.",
                    "label": 0
                },
                {
                    "sent": "So Beijing Games allow you to express uncertainty such as you may not be sure about your opponents utilities.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Extensive form games.",
                    "label": 0
                },
                {
                    "sent": "These are generalization of the game trees that we see in our AI classes, but they also allow for modeling imperfect information and therefore can model games such as poker.",
                    "label": 0
                },
                {
                    "sent": "In fact, this is a small poker game right here.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There are stochastic games which you can think of as MDP's with multiple players.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then there are some representation schemes introduced by AI research.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are such as graphical.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Games Action Graph Games, an multiagent influence diagrams the latter.",
                    "label": 0
                },
                {
                    "sent": "They generalize influence diagrams, which in turn generalize Bay.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that works.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How hard is it to compute Nash equilibrium?",
                    "label": 0
                },
                {
                    "sent": "Let's say in normal form games?",
                    "label": 0
                },
                {
                    "sent": "That's not that well defined.",
                    "label": 0
                },
                {
                    "sent": "The question do you want to compute all of the Nash equilibrium?",
                    "label": 0
                },
                {
                    "sent": "Do you want to compute the best Nash equilibrium, or do you just want to compute anyone Nash equilibrium?",
                    "label": 1
                },
                {
                    "sent": "You don't care which one?",
                    "label": 0
                },
                {
                    "sent": "If we focus on the last question for a second, that's actually one that has received a lot of attention, not just from AI researchers, but also from theoretical computer science researchers leading crystals.",
                    "label": 0
                },
                {
                    "sent": "Puppeteer, at some point to proclaim it one of the two most important concrete open questions on the boundary of polynomial time.",
                    "label": 1
                },
                {
                    "sent": "A couple of years after he said that.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The question basically got resolved, so it turns out to be pad complete to compute one Nash equilibrium.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In fact, he himself was involved in this result as well.",
                    "label": 0
                },
                {
                    "sent": "Now you may not know what Pee Pad is, so pee pad completeness is some evidence that there's probably not going to be a polynomial time solution.",
                    "label": 0
                },
                {
                    "sent": "It's some reasonable evidence is probably not as strong evidence as NP hardness that there's no tractable solution.",
                    "label": 0
                },
                {
                    "sent": "So anyway, P pad stands for polynomial parity arguments directed.",
                    "label": 0
                },
                {
                    "sent": "If that sounds awkward or difficult to remember, it may not help to know that.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It was introduced by Crystals Papademetriou.",
                    "label": 0
                },
                {
                    "sent": "So he had his hands all over this result.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But what I want to ask as well, it's not really clear that just computing one Nash equilibrium does the trick for us.",
                    "label": 0
                },
                {
                    "sent": "Are we happy if we look at the presentation game and compute one of the Vatican, Libya, for instance?",
                    "label": 0
                },
                {
                    "sent": "Presumably not.",
                    "label": 0
                },
                {
                    "sent": "So we might hope to compute in some sense a good equity.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Grim, but that turns out to in fact be NP hard.",
                    "label": 0
                },
                {
                    "sent": "So here is a little bit of a sketch of a reduction that we have from satisfiability to a game, so this reduction will take any satisfiability instance such as this one over here, which has two solutions and map it.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To a game I'm not going to describe exactly how this game gets created.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But the important takeaway points are this game that you create is going to have for every solution that the original satisfiability instance had.",
                    "label": 0
                },
                {
                    "sent": "If any, there's going to be a good equilibrium, right?",
                    "label": 0
                },
                {
                    "sent": "So there's a green equilibrium here corresponding to the green solution, and so on.",
                    "label": 0
                },
                {
                    "sent": "And then also there's going to always be one additional.",
                    "label": 0
                },
                {
                    "sent": "Librium, which is the default equilibrium which is going to give relatively low utilities to the players.",
                    "label": 0
                },
                {
                    "sent": "And the reason that this shows that this is an NP hard problem that's an NP hard problem.",
                    "label": 0
                },
                {
                    "sent": "To find a good equilibrium is that suppose that you had such an algorithm.",
                    "label": 0
                },
                {
                    "sent": "Then you could use it to solve satisfiability, because what would you do?",
                    "label": 0
                },
                {
                    "sent": "You take your satisfiability and turn it into this game.",
                    "label": 0
                },
                {
                    "sent": "See if you would get a good equilibrium out of it.",
                    "label": 0
                },
                {
                    "sent": "If it's anything better than epsilon epsilon.",
                    "label": 0
                },
                {
                    "sent": "You're going to know that the satisfiability instance had a solution otherwise not, and you can draw a bunch of other implications from this result as well from this reduction.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These hardness results haven't really prevented people from looking for algorithms to solve games anyway.",
                    "label": 0
                },
                {
                    "sent": "For Nash equilibrium, probably the best known algorithm is to Lemke Howson algorithm which really exploits the structure of the problem in a very nice way.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, in some cases it still takes exponential.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm little bit more of an AI type of approaches to search for an equilibrium.",
                    "label": 0
                },
                {
                    "sent": "Turns out that you just need to search over to supports.",
                    "label": 0
                },
                {
                    "sent": "Once you've identified the supports the positive probability actions in the equilibrium.",
                    "label": 0
                },
                {
                    "sent": "It's an easy problem and this you can also use to turn into a mixed integer programming formulation, which can be used to compute an optimal equilibrium.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then there's work on special cases where you can efficiently either solve the whole game or reduce it to a smaller game that you can then solve.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With another method and also a lot of work on computing approximate equilibrium.",
                    "label": 0
                },
                {
                    "sent": "But regardless of whether these algorithms scale to your particular problem, there's still a deeper problem which is the equilibrium selection problem, which is well in general, game is going to have multiple equilibrium, so which one should you play?",
                    "label": 0
                },
                {
                    "sent": "What should you play in chicken?",
                    "label": 0
                },
                {
                    "sent": "And this is a very frustrating situation that actually we still don't really know what the plan chicken, right?",
                    "label": 0
                },
                {
                    "sent": "And it's it's kind of inherent in the definition of Nash equal.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So maybe we can get around this problem somehow.",
                    "label": 0
                },
                {
                    "sent": "Right, So what if I told you that there is some way in which we can avoid the equilibrium selection problem altogether?",
                    "label": 0
                },
                {
                    "sent": "That is computationally more tractable.",
                    "label": 0
                },
                {
                    "sent": "And finally, that's guaranteed to give you at least as good a utility as any Nash equilibrium.",
                    "label": 0
                },
                {
                    "sent": "So obviously I must be changing something about how we're solving the game here, right?",
                    "label": 0
                },
                {
                    "sent": "And that's what I'll do.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But this is actually what is used in the security application, so we'll start getting to that.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the idea is the idea of commitments.",
                    "label": 0
                },
                {
                    "sent": "If one of the players can commit before the other player gets the move.",
                    "label": 1
                },
                {
                    "sent": "It changes the game in a way so this game here is a typical example of it.",
                    "label": 0
                },
                {
                    "sent": "By the way, these games where one player gets to move before the other are usually known as Stackelberg Games.",
                    "label": 0
                },
                {
                    "sent": "OK, this particular game is very easy to solve.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It has unique Nash equilibrium in the top left corner.",
                    "label": 1
                },
                {
                    "sent": "It's not that hard to see.",
                    "label": 0
                },
                {
                    "sent": "You can see that the top strategy actually dominates the bottom strategy.",
                    "label": 0
                },
                {
                    "sent": "From there on, it's easy, but now if you.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Change it so that.",
                    "label": 0
                },
                {
                    "sent": "The game is played as follows.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Where one player first commits to playing one of the rows.",
                    "label": 0
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then the other player first observes this commitment and only then chooses a column.",
                    "label": 0
                },
                {
                    "sent": "This changes the game in a fundamental way.",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And actually it becomes optimal for the first player to play to down row.",
                    "label": 0
                },
                {
                    "sent": "Why is that?",
                    "label": 0
                },
                {
                    "sent": "Because if you played a down row, the best response for the for the column player is to get this one and play right rather than to get to 0 by playing left.",
                    "label": 0
                },
                {
                    "sent": "OK, but this actually gives the role player utility of two rather than the one that she would have gotten either in the equilibrium or by committing to up.",
                    "label": 0
                }
            ]
        },
        "clip_85": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can do even better in the same game bikam.",
                    "label": 0
                }
            ]
        },
        "clip_86": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Into a mixed strategy.",
                    "label": 0
                },
                {
                    "sent": "So if you commit to something like playing 51% of the time down, then it's still optimal for the column player to play right?",
                    "label": 0
                }
            ]
        },
        "clip_87": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because by playing right he gets 151% of the time versus getting 149% of the time by playing left, right?",
                    "label": 0
                },
                {
                    "sent": "But this actually gives the role player two half the time and three half the time just about right.",
                    "label": 0
                },
                {
                    "sent": "And so it's even better than getting the two from committing to down.",
                    "label": 0
                }
            ]
        },
        "clip_88": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So these we sometimes also called Stackelberg make strategies.",
                    "label": 0
                }
            ]
        },
        "clip_89": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what does this have to do?",
                    "label": 0
                }
            ]
        },
        "clip_90": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With security, why would you think that this is a reasonable model for?",
                    "label": 0
                }
            ]
        },
        "clip_91": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Security.",
                    "label": 0
                },
                {
                    "sent": "And the reason is as follows.",
                    "label": 0
                },
                {
                    "sent": "So you can argue or one argument anyway is that the defender has to choose some targets of defend every single day, but the attacker can just.",
                    "label": 0
                }
            ]
        },
        "clip_92": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Wait and observe for a while.",
                    "label": 0
                },
                {
                    "sent": "OK, so for instance, maybe the first day the defender.",
                    "label": 0
                }
            ]
        },
        "clip_93": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Defense 2",
                    "label": 0
                }
            ]
        },
        "clip_94": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Day and so every day.",
                    "label": 0
                }
            ]
        },
        "clip_95": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Defender makes choice, and attackers just kind of sitting out.",
                    "label": 0
                },
                {
                    "sent": "For now observing what's going on up to the point where the attacker has a pretty good idea of what the distribution is that the defender.",
                    "label": 0
                }
            ]
        },
        "clip_96": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Using.",
                    "label": 0
                },
                {
                    "sent": "And then attacks right, and so this corresponds more closely to the model that I just described.",
                    "label": 0
                }
            ]
        },
        "clip_97": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is not a watertight argument.",
                    "label": 0
                },
                {
                    "sent": "And in fact, quite a bit of work has already looked at, well, you know, what?",
                    "label": 0
                },
                {
                    "sent": "If the observe ability isn't perfect?",
                    "label": 0
                },
                {
                    "sent": "Those kinds of questions, but I'll give another reason why this is a reasonable model in just a little bit.",
                    "label": 0
                }
            ]
        },
        "clip_98": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So going away from security games again and to the general case for a little bit, so how hard is it to compute this optimal Stackelberg strategy?",
                    "label": 0
                },
                {
                    "sent": "And it turns out actually it's not pee pad complete or NP hard or anything.",
                    "label": 0
                },
                {
                    "sent": "There's a very simple polynomial time algorithm using linear programming for it.",
                    "label": 0
                }
            ]
        },
        "clip_99": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The way it works is as follows.",
                    "label": 0
                },
                {
                    "sent": "We do dividing conquer over different columns of the game so for every for every column see star we're going to ask the following question.",
                    "label": 0
                },
                {
                    "sent": "If my goal as a role player is to incentivize the column player to play that particular see Star.",
                    "label": 0
                },
                {
                    "sent": "What's the best way I can do?",
                    "label": 0
                }
            ]
        },
        "clip_100": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this actually corresponds to very simple linear program.",
                    "label": 0
                },
                {
                    "sent": "We're going to put probabilities on.",
                    "label": 0
                },
                {
                    "sent": "The rows are going to be our variables to have.",
                    "label": 0
                }
            ]
        },
        "clip_101": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yes, on the one that's a distribution constraint for every alternative column, the column player might play the expected utility for the column player of playing that should be at most expected utility for playing the column that we actually want the follow.",
                    "label": 0
                }
            ]
        },
        "clip_102": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To play and then under that constraint, we maximize our.",
                    "label": 0
                }
            ]
        },
        "clip_103": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Unexpected utility so very simple in your program, but this actually shows it's doable in polynome.",
                    "label": 0
                }
            ]
        },
        "clip_104": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All time.",
                    "label": 0
                },
                {
                    "sent": "There's various other nice.",
                    "label": 0
                }
            ]
        },
        "clip_105": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Properties of commitments make strategies, so if you look at a 0 sum game, actually you end up doing the exact same thing as an ad.",
                    "label": 0
                }
            ]
        },
        "clip_106": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Equilibrium.",
                    "label": 0
                },
                {
                    "sent": "In any game, the leaders payoff from committing to mix strategy is going to be at least as good as any national.",
                    "label": 0
                }
            ]
        },
        "clip_107": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The rim.",
                    "label": 0
                },
                {
                    "sent": "And finally, there's no equilibrium selection problem anymore, because in the Stackelberg model, for instance, in the game of Chicken, the Stackelberg leader will just go straight and the follower better get out of the way.",
                    "label": 0
                }
            ]
        },
        "clip_108": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This model introduces a lot of other questions, even in normal form games, but particularly interesting also is to compute these optimal strategies to commit to another game.",
                    "label": 0
                }
            ]
        },
        "clip_109": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Things as well.",
                    "label": 0
                },
                {
                    "sent": "For example, invasion games so Beijing Games were actually what was used for the original Los Angeles airport application that was this paper over here.",
                    "label": 0
                }
            ]
        },
        "clip_110": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We've also been looking at it in the config.",
                    "label": 0
                }
            ]
        },
        "clip_111": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So extensive form games are now stochastic games as well.",
                    "label": 0
                },
                {
                    "sent": "So that's all for.",
                    "label": 0
                }
            ]
        },
        "clip_112": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Unrestricted games now I want to talk a little bit about the particular structure that the security games have.",
                    "label": 0
                },
                {
                    "sent": "And this is the model of security games that was introduced by the USC Group it.",
                    "label": 0
                }
            ]
        },
        "clip_113": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Works as follows, so in such a game there are some set of targets T which might be attacked.",
                    "label": 0
                },
                {
                    "sent": "So if we think about the federal air Marshals domain, these are.",
                    "label": 0
                }
            ]
        },
        "clip_114": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Flights that might be attacked.",
                    "label": 0
                },
                {
                    "sent": "There is a set of security resources Omega which is available to the defender, so this might be your Federal Air Marshall.",
                    "label": 0
                }
            ]
        },
        "clip_115": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's a set of schedules, so a schedule is in the case of federal Air Marshals.",
                    "label": 0
                },
                {
                    "sent": "It's a tour of flights that a single Air Marshall could conceivably go on at the same time, or in a single.",
                    "label": 0
                }
            ]
        },
        "clip_116": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sword.",
                    "label": 0
                },
                {
                    "sent": "And then there's some constraints on which federal air marshals can be assigned to which tours of flights.",
                    "label": 0
                }
            ]
        },
        "clip_117": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then the attacker is going to choose a single target to attack.",
                    "label": 0
                }
            ]
        },
        "clip_118": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then there are some natural constraints on the utilities that that that all the players receive from this.",
                    "label": 0
                },
                {
                    "sent": "So it's determined by which target is attacked, an whether that target is defended or not.",
                    "label": 1
                },
                {
                    "sent": "Of course, the defender prefers it to be defendant, and the attacker prefers it to be not defend.",
                    "label": 0
                }
            ]
        },
        "clip_119": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Because it's a restricted class of games.",
                    "label": 0
                },
                {
                    "sent": "It opens up the possibility that this game has this class of games, has interesting game theoretic properties.",
                    "label": 0
                },
                {
                    "sent": "Maybe they're like 0 sum games in some sense, and it turns out that that's the case.",
                    "label": 0
                }
            ]
        },
        "clip_120": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in particular it has this property that any Stackelberg strategy in this game will also be a national strategy.",
                    "label": 0
                },
                {
                    "sent": "So that to some extent alleviates any concern that you might have about using the Stackelberg concept.",
                    "label": 0
                }
            ]
        },
        "clip_121": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This framework it also has what's known as the interchangeability property for Nash equilibrium.",
                    "label": 1
                },
                {
                    "sent": "What does that mean?",
                    "label": 0
                },
                {
                    "sent": "So here I've shown a game and not a security game, with interchangeability property and I've pointed out two of its Nash equilibrium.",
                    "label": 0
                },
                {
                    "sent": "There's this regular Nash equilibrium in this blue Nash equilibrium.",
                    "label": 0
                }
            ]
        },
        "clip_122": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It turns out you can do things like this.",
                    "label": 0
                },
                {
                    "sent": "You can swap.",
                    "label": 0
                }
            ]
        },
        "clip_123": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Two colored Nash is an.",
                    "label": 0
                },
                {
                    "sent": "You'll still end up with two Nash equilibrium, so you can kind of mix and match, and you're guaranteed to still have a Nash equilibrium, and the security games also have this property.",
                    "label": 0
                },
                {
                    "sent": "Games in general don't have this property like the game of chicken does not have this property.",
                    "label": 0
                },
                {
                    "sent": "By the way, we've also recently looked at what happens if the attacker is able to attack multiple targets at once, and then some of these properties change, or at least the first one goes away, but the second one is still there.",
                    "label": 0
                },
                {
                    "sent": "And if you're interested in that, I would invite you to see DM's poster and talk.",
                    "label": 0
                }
            ]
        },
        "clip_124": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Finally, I want to talk a little bit about scalability.",
                    "label": 0
                },
                {
                    "sent": "So one problem with these security games is that we can convert them to the normal form and then solve that, but the normal form will in general have exponential size in the more natural security game representation, so we may not be able to use that and so quite a bit of work has been done by the USC Group as well as us.",
                    "label": 0
                },
                {
                    "sent": "Algorithms for solving these games anyway?",
                    "label": 0
                }
            ]
        },
        "clip_125": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'll say something about that in a second and another class of games besides this basic model of security games are various types of games on graphs.",
                    "label": 0
                },
                {
                    "sent": "Over here is an example of work that we've also been doing with the USC Group, where we consider where to put checkpoints in the city like Mumbai to prevent terrorist attacks.",
                    "label": 0
                }
            ]
        },
        "clip_126": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some of the techniques that are helpful in these cases include the.",
                    "label": 0
                }
            ]
        },
        "clip_127": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sign.",
                    "label": 0
                },
                {
                    "sent": "One is to come up with compact linear programs, right?",
                    "label": 0
                },
                {
                    "sent": "So if you take the linear program for the normal form of the game, that's going to have exponential size because there's going to be a probability for every assignment of resources two targets.",
                    "label": 0
                },
                {
                    "sent": "But sometimes you can actually just reason about the marginal probabilities of assigning particular resources to particular targets, and that sometimes works in some and under some conditions that works.",
                    "label": 0
                },
                {
                    "sent": "And then you have a polynomially or you have an exponentially smaller linear program to deal with, and sometimes it doesn't work.",
                    "label": 0
                }
            ]
        },
        "clip_128": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it doesn't work.",
                    "label": 0
                },
                {
                    "sent": "There's other things you can do, like you can instead of writing down the huge help you right away, you can try to generate it one step at a time using techniques from column and constraint generation.",
                    "label": 0
                },
                {
                    "sent": "And if you're lucky, you end up in the end terminating with a much smaller linear program.",
                    "label": 0
                },
                {
                    "sent": "But these games, especially games on graphs, are still very challenging.",
                    "label": 0
                }
            ]
        },
        "clip_129": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to summarize a little bit.",
                    "label": 0
                },
                {
                    "sent": "I think we in a I have really benefited a lot from work done previously in game theory, but as we get more sophisticated we're really starting to push at some of the boundaries of game theory as well, so it's maybe not too surprising that this happens on the computational and representational ends.",
                    "label": 0
                },
                {
                    "sent": "It also happens in learning games, and perhaps more surprising recently various groups have also been working on playing games with human subjects, and so we're making contributions on the behavioral side of things.",
                    "label": 0
                },
                {
                    "sent": "And we're even making some fundamental conceptual contributions, I think, especially because we have to deal with these equilibrium selection type of issues in real life.",
                    "label": 0
                },
                {
                    "sent": "As kind of a higher level comments, I think AI researchers have also really contributed to a shift in the view of microeconomic theory.",
                    "label": 0
                },
                {
                    "sent": "So, and the shift is kind of away from seeing microeconomic theory as just an idealized model of the real world and towards seeing it as a useful tool kit that we can use to create new types of applications.",
                    "label": 0
                },
                {
                    "sent": "And I think many of these applications are so left to be discovered an I hope some of you will join us in finding outlook as well.",
                    "label": 0
                },
                {
                    "sent": "But before we get to that I want.",
                    "label": 0
                }
            ]
        },
        "clip_130": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Quickly thank some people and organizations.",
                    "label": 0
                },
                {
                    "sent": "First of all, the organizations that have funded me since the beginning of my PhD.",
                    "label": 0
                }
            ]
        },
        "clip_131": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My academic family.",
                    "label": 0
                },
                {
                    "sent": "This is a very partial subtree of my academic family.",
                    "label": 0
                },
                {
                    "sent": "Now I drew this picture in a somewhat clumsy way, because there's only a very tiny little arrow from Thomas coming to me really that should be a big fat arrow.",
                    "label": 0
                },
                {
                    "sent": "I've learned a lot from Thomas as an advisor.",
                    "label": 0
                },
                {
                    "sent": "For me, he was a very good advisor.",
                    "label": 0
                },
                {
                    "sent": "I've also benefited tremendously, tremendously from very talented graduate students.",
                    "label": 0
                },
                {
                    "sent": "So in particular, if you're hiring in the next couple of years, I would encourage you to really pay attention to some of these guys who will be on the market.",
                    "label": 0
                },
                {
                    "sent": "I also want to quickly thank Barbara Grosz and Ivy Pfeffer for teaching the courses at Harvard that got me interested in this originally.",
                    "label": 0
                }
            ]
        },
        "clip_132": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I want to thank my colleagues in a a Duke.",
                    "label": 0
                },
                {
                    "sent": "In this case there should be a big fat arrow from run, so I've learned a lot from ran over the years.",
                    "label": 0
                },
                {
                    "sent": "He's been my mentor there since the day that I got there.",
                    "label": 0
                },
                {
                    "sent": "I also want to point out to prevent any confusion that in spite of these nice little frames, Alan and Don are still very much alive and we enjoy seeing them from time to time.",
                    "label": 0
                },
                {
                    "sent": "Ah.",
                    "label": 0
                }
            ]
        },
        "clip_133": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally, I want to thank my family, without whom, without whom I wouldn't exist, but also without who's loving support.",
                    "label": 0
                },
                {
                    "sent": "I wouldn't be anywhere close to where I am today.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "You pointed out that the.",
                    "label": 0
                },
                {
                    "sent": "Stackelberg assumption that there's commitment power that the agencies that have are defending have static have the ability to do a Stackelberg commitment is controversial, but actually they could do things further to promote that commitment.",
                    "label": 0
                },
                {
                    "sent": "You know they could pump the air marshals can publish their schedules and show verify that they really are going with them, that their animal sense.",
                    "label": 0
                },
                {
                    "sent": "Do they do this?",
                    "label": 0
                },
                {
                    "sent": "Would you advocate that they do?",
                    "label": 0
                },
                {
                    "sent": "This did happen.",
                    "label": 0
                },
                {
                    "sent": "This gives them some extra benefits, so so as to what's going on right now.",
                    "label": 0
                },
                {
                    "sent": "So with federal air Marshals, it's particularly interesting because they actually try to stay on their cover, right?",
                    "label": 0
                },
                {
                    "sent": "So you might think, well, maybe at the end of the flight they should identify themselves.",
                    "label": 0
                },
                {
                    "sent": "And hey, by the way, I was the Federal Air Marshall.",
                    "label": 0
                },
                {
                    "sent": "I don't think that's going to happen.",
                    "label": 0
                },
                {
                    "sent": "One reasonable reason why you might not want to do that.",
                    "label": 0
                },
                {
                    "sent": "So if you think you've modeled everything perfectly, you wouldn't hurt and might even help to do that right?",
                    "label": 0
                },
                {
                    "sent": "And you're exactly right about that.",
                    "label": 0
                },
                {
                    "sent": "In the real world, however, you might be concerned that you've actually missed something in the modeling an from declaring the strategy, it becomes very obvious that you haven't thought about this one particular kind of attack, so I think it's a great question, and it also leads into these issues of unawareness and game theory that some people are studying that you may not even be aware of everything that you or your opponent might do.",
                    "label": 0
                },
                {
                    "sent": "And those are still very inherently difficult issues.",
                    "label": 0
                },
                {
                    "sent": "So we need more research on it.",
                    "label": 0
                }
            ]
        }
    }
}