{
    "id": "duerwipmyxoyqmxyia2vwql4m6dtwdfr",
    "title": "report on Crowdfest task 6 “Choice of a business model for the language-learning crowdsourcing platform”",
    "info": {
        "author": [
            "Nina Gorovaia, European Future Innovation System Centre (EFIS)"
        ],
        "published": "April 8, 2019",
        "recorded": "March 2019",
        "category": [
            "Top->Computer Science->Crowdsourcing",
            "Top->Humanities->Languages"
        ]
    },
    "url": "http://videolectures.net/3rdAnnualActionMeeting2019_gorovaia_report_task/",
    "segmentation": [
        [
            "OK, thank you very much for nice presentation.",
            "I proposed this task on business models because I'm a researcher in business in the conomiques and I'm specifically interested in startups and I thought it would be cool considering our work here in this group that we know more.",
            "What does it take to start such a platform?",
            "How much funding?",
            "You should be expecting to get how fast are the growth rates and so on and so forth.",
            "So once I propose the task, I've got a few team members that also seemed to be excited about the topic.",
            "It was Branislav, Martin, Katarina and the recently added here the name of my PhD student who helped me to find some data from corporate databases which are usually paid subscription from the University.",
            "And I also applied for an SDSM so.",
            "He could come to Cyprus to finish this project because the the the market is big.",
            "The companies are very many of them and it's really.",
            "Lots of work to collect information about them and create a database that can be used later for analysis or for a business plan so."
        ],
        [
            "So just to begin with a bit of Thierry are I will describe a few generic business models that we used in our literature review.",
            "So essentially business model is a recipe on how your proposed to do business and how you're going to make money on any business venture.",
            "So these examples do not necessarily relate to crowdsourcing in language learning market.",
            "It's kind of general.",
            "But trust me, all these business models can be applied to various companies starting from traditional industries to new Internet business startups.",
            "So the first one is, I suppose, quite known to you and populates advertising business model.",
            "It's a company like Facebook that provides kind of platform for free to use to as many participants as possible, but then exposes them to advertising's of companies that pay for those advertisements.",
            "So you also have a special case of a freemium model where customers are exposed to the basic service for free and then paying for premium features and usually this is a much smaller set of customers.",
            "Or this could be subscription fees or some revenue sharing fees or sponsorships so on.",
            "The other model that is quite popular, so in language learning, it seems to me the switchboard model where you bring the providers and the customers together and the company essentially provides a platform and charges Commission for for every transaction.",
            "An entrepreneurial business model means that companies trying to enter, not the general market, but a very specialized niche market with a special product establish itself there and then sell the company as a.",
            "Company is a product itself to a bigger company, so an example of such a business is Skype that was created by a team of enthusiasts and then sold to.",
            "Don't remember to whom was it sold to Google or Microsoft?",
            "Sorry yeah, then a customer solution model it's model where you are not making profits actually on selling products but you sell expertise to improve customer operations and from my understanding people says working like that.",
            "You can use a multi component system where you sell kind of the high quality product or Lexi.",
            "HP's using this model, they sell high quality printers reasonably cheap, but most of the money they make on selling cartridges which are expensive.",
            "Time model this when you create something really innovative and you are the first move in the market and you're kind of a pioneer and you have also a profit multiplier model where you create a model that does not necessarily make money on its own, but it can be used for licensing.",
            "The classic example of it is Walt Disney Movies, Mickey Mouse and Snow White and so on and so forth."
        ],
        [
            "So refering to with specific study, we try to define the empirical scope.",
            "First we thought that maybe we should use platforms that are kind of based on crowdsourcing, not necessarily in language learning.",
            "Then we discovered that there are sufficient language learning platforms that are based on crowdsourcing or this could be also language learning applications that are not using crowdsourcing so altogether.",
            "From my end from a website that I'm kind of writing here, it's a website that.",
            "At least companies that gold that got venture capital investments were identified.",
            "700 companies that are working in language learning business."
        ],
        [
            "So ideally you we need to do the environmental analysis and the industry analysis and then specific target market analysis.",
            "So industry analysis is interesting to understand.",
            "Who are the main players and how is this industry attractive?",
            "Whether there is a window of opportunity to enter if the industry is consolidated or fragmented becausw if let's say the industry is consolidated and has two major players that.",
            "It means the entry barriers are very high and it essentially excludes any potential market entrants and you analyze such issues as rivalry among existing firms, the substitutes, the bargaining power of suppliers of bias, and so on.",
            "So this is a classic Michael Porter's model that is used for competitive."
        ],
        [
            "Alesis, so, in terms of the kind of prospects and potential for the language learning market market, I think it's very attractive 'cause it's estimated over around 60 billion dollars and it's growing very fast because the kind of globalization increases the need for people to learn foreign languages.",
            "So according to an estimate I have here, it grows 17% per year and this is kind of really.",
            "Amazing figure that shows that there are many opportunities and despite their large size, the field of specifically digital learning language learning is extremely fragmented.",
            "So it means there are many companies here and market entry is relatively easy and for example a company that many of you know it's called Rosetta Stone.",
            "It had a revenue of 154 million euros in 2017 and it equals.",
            "Only three point 4% of this market, so it's not a kind of consolidated industry.",
            "And it gives space for many other new entry."
        ],
        [
            "So during our crowd, first we try to analyze the following platforms, at least looking at the biggest players sobu pseudo lingua bobble, mingle life, matcha memorize Woodward dive and we looked at information like the year of Foundation founders, growth of the platform like number of users per year, the main product that they offer, startup funding that they received.",
            "Investors form of business ownership or original business model.",
            "Subsequent business model becausw.",
            "Usually company center with one value proposition and then in the in the course of years and with some experience they change it and lots of information.",
            "Here was collected from Crunchbase which is a publicly available database or venture capitalists and investments and kind of more.",
            "Newly updated information was updated from.",
            "Orbis, which is the comprehensive database of companies around the world and just."
        ],
        [
            "Give you a feel of what kind of data we found to what we learned, so I kind of present 3 four case studies, yeah?",
            "The patterns are almost kind of similar, so I will start with Boussu are started 2008 number of users growing reasonably fast from 6 million in 2012, two 65 million and then you see the numbers in terms of investments that they got from venture capital from 400,000.",
            "Euros then to 6 million.",
            "Thirty five millions and so on.",
            "So quite you need.",
            "Count the few rounds of investments like that, operating revenues, judging the year to sell, statistics of the date of 2017 is 10,000,000, but the profit loss period is minus 6 million.",
            "So and if you see also the profit margins that for the last four years, it's obvious that the companies is negative.",
            "So it does take a few years to reach a break even.",
            "And, uh, essentially the same pattern was observed with all the other bigger companies.",
            "So in spite of the fact that the platform grows so fast, got so much money in venture capital funding, it keeps being negative for.",
            "For quite a few years, hopefully until when the break break even point comes so."
        ],
        [
            "A similar pattern you observe with dual lingo, it started 2011.",
            "It rich now 3 million users are so it got all kind of investment.",
            "Total funding was hundred 108 million.",
            "So it uses advertising.",
            "Oh advertisement model.",
            "Freemium model operating revenues for 2017 two 150,000 and are with with.",
            "Profit loss.",
            "Negative margin.",
            "It's the same essentially, so I I did not put the data here, but it's there."
        ],
        [
            "So for barbell start up year 2007 funding.",
            "Funding 33 million.",
            "Some important are some important investments.",
            "Investors include the publisher publishers like Reed Elsevier, and in case of.",
            "Boussu it was McGraw Hill so I think it it's it helps to create better content.",
            "Then profit loss statement again minus 8 million revenues, 71 million in 2016 and profit margins are also negative.",
            "So the company uses paid content.",
            "No ads, transparent subscription based business model.",
            "But still again it needs.",
            "Maybe I don't know how many years to break, even if if it ever reaches this point."
        ],
        [
            "So and the only kind of company where I discovered, although I cannot confirm it by the financial database, that they became financially positivism.",
            "Memorize Wikipedia reports that last year they are.",
            "They started breaking even, although are kind of my financial database, the Reportes for 2017 the profit.",
            "Sorry the loss of 2 million.",
            "OK, I'm finishing soon so.",
            "Again, this is a.",
            "This remains to be confirmed is they are really profitable.",
            "But in any case this happened due to the switch into their into the switch into the business model where they started using only premium features and where the number of paid users kind of increased significantly.",
            "Are they also got some criticism 'cause they tried to move the content that the free crowd source participants try?",
            "Kind of uploaded on the on one platform and.",
            "They did not.",
            "The users felt it's very bad that the company wants to close it down or move it to another platform so.",
            "There was some negative publicity recently due to the fact that the crowd sources couldn't get access to their data."
        ],
        [
            "So as a next step, after the environmental analysis, what we have to do is to do the organizational analysis, and this essentially includes the analysis of value proposition of each company to understand what is unique in each business model and what is valuable, what is real, and whether it's easy or difficult to imitate.",
            "Becausw successful business model usually gets.",
            "Imitated very fast, and this essentially means that the company that had an idea usually loses it to the second mover who just copied it successfully.",
            "OK and."
        ],
        [
            "The work in progress includes, of course, organizational and financial feasibility, so I'm ready to answer any questions and thank you for attention.",
            "Thank you very much.",
            "I think we can take one one question or two questions if there are questions.",
            "How can we exploit all of this information?",
            "How can we profit from all this information and try to do something in and collect collect you, have you discuss various platforms so you already have some prototypes, right?",
            "At least I've got to know many people with various ideas would could be done so, and it's OK to have an idea, but not many people get it from idea to a commercialization and to a real company, so this kind of work helps you understand what needs to be done and kind of what kind of investment you have to seek and how you have to kind of what market you are trying to enter.",
            "If you want your platform to.",
            "Become a company of tomorrow.",
            "OK, thank you.",
            "There's another question.",
            "There nobody like.",
            "Marketing business models were really close behind you mentioned.",
            "Imitate models now give an example to me.",
            "Imitate.",
            "I cannot yet give an example in related to language learning OK, but just understand are kind of a very interesting company that many of you know and use it as a kind of consumer product.",
            "It's a Gillette Razor, Gillette sensor razor.",
            "OK, so the product everyone has seen it.",
            "Many people use it and like it, but no one can copy it.",
            "Becauses the company developed such a state of the art sophisticated equipment to produce them that no, our kind of person has seen, unless they are kind of the employees of the company and so that specific equipment and machinery is impossible to replicate.",
            "Digital examples like applications.",
            "I've got an example.",
            "I've got an example, should more is very difficult to replicate.",
            "Because they are the rules of the game are not online.",
            "You got to discover them by themselves by yourself.",
            "Yeah OK, you asked for an example.",
            "OK so I have to keep some of your aspects of your business model secret.",
            "I understand that there are not many opportunities to make a patent over this, but let's say if you can kind of hide some of the secrets.",
            "It's not obvious to the outside.",
            "Contributes to you to your product being difficult to imitate and then it.",
            "It may not also be within a product.",
            "It could be within a company itself.",
            "Becausw the issues like organizational culture are difficult to imitate then not obvious with outsiders.",
            "OK, thank you very much, you're welcome."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, thank you very much for nice presentation.",
                    "label": 0
                },
                {
                    "sent": "I proposed this task on business models because I'm a researcher in business in the conomiques and I'm specifically interested in startups and I thought it would be cool considering our work here in this group that we know more.",
                    "label": 0
                },
                {
                    "sent": "What does it take to start such a platform?",
                    "label": 0
                },
                {
                    "sent": "How much funding?",
                    "label": 0
                },
                {
                    "sent": "You should be expecting to get how fast are the growth rates and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "So once I propose the task, I've got a few team members that also seemed to be excited about the topic.",
                    "label": 0
                },
                {
                    "sent": "It was Branislav, Martin, Katarina and the recently added here the name of my PhD student who helped me to find some data from corporate databases which are usually paid subscription from the University.",
                    "label": 0
                },
                {
                    "sent": "And I also applied for an SDSM so.",
                    "label": 0
                },
                {
                    "sent": "He could come to Cyprus to finish this project because the the the market is big.",
                    "label": 0
                },
                {
                    "sent": "The companies are very many of them and it's really.",
                    "label": 0
                },
                {
                    "sent": "Lots of work to collect information about them and create a database that can be used later for analysis or for a business plan so.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So just to begin with a bit of Thierry are I will describe a few generic business models that we used in our literature review.",
                    "label": 0
                },
                {
                    "sent": "So essentially business model is a recipe on how your proposed to do business and how you're going to make money on any business venture.",
                    "label": 0
                },
                {
                    "sent": "So these examples do not necessarily relate to crowdsourcing in language learning market.",
                    "label": 0
                },
                {
                    "sent": "It's kind of general.",
                    "label": 0
                },
                {
                    "sent": "But trust me, all these business models can be applied to various companies starting from traditional industries to new Internet business startups.",
                    "label": 0
                },
                {
                    "sent": "So the first one is, I suppose, quite known to you and populates advertising business model.",
                    "label": 0
                },
                {
                    "sent": "It's a company like Facebook that provides kind of platform for free to use to as many participants as possible, but then exposes them to advertising's of companies that pay for those advertisements.",
                    "label": 0
                },
                {
                    "sent": "So you also have a special case of a freemium model where customers are exposed to the basic service for free and then paying for premium features and usually this is a much smaller set of customers.",
                    "label": 1
                },
                {
                    "sent": "Or this could be subscription fees or some revenue sharing fees or sponsorships so on.",
                    "label": 0
                },
                {
                    "sent": "The other model that is quite popular, so in language learning, it seems to me the switchboard model where you bring the providers and the customers together and the company essentially provides a platform and charges Commission for for every transaction.",
                    "label": 0
                },
                {
                    "sent": "An entrepreneurial business model means that companies trying to enter, not the general market, but a very specialized niche market with a special product establish itself there and then sell the company as a.",
                    "label": 1
                },
                {
                    "sent": "Company is a product itself to a bigger company, so an example of such a business is Skype that was created by a team of enthusiasts and then sold to.",
                    "label": 0
                },
                {
                    "sent": "Don't remember to whom was it sold to Google or Microsoft?",
                    "label": 1
                },
                {
                    "sent": "Sorry yeah, then a customer solution model it's model where you are not making profits actually on selling products but you sell expertise to improve customer operations and from my understanding people says working like that.",
                    "label": 1
                },
                {
                    "sent": "You can use a multi component system where you sell kind of the high quality product or Lexi.",
                    "label": 0
                },
                {
                    "sent": "HP's using this model, they sell high quality printers reasonably cheap, but most of the money they make on selling cartridges which are expensive.",
                    "label": 0
                },
                {
                    "sent": "Time model this when you create something really innovative and you are the first move in the market and you're kind of a pioneer and you have also a profit multiplier model where you create a model that does not necessarily make money on its own, but it can be used for licensing.",
                    "label": 1
                },
                {
                    "sent": "The classic example of it is Walt Disney Movies, Mickey Mouse and Snow White and so on and so forth.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So refering to with specific study, we try to define the empirical scope.",
                    "label": 1
                },
                {
                    "sent": "First we thought that maybe we should use platforms that are kind of based on crowdsourcing, not necessarily in language learning.",
                    "label": 0
                },
                {
                    "sent": "Then we discovered that there are sufficient language learning platforms that are based on crowdsourcing or this could be also language learning applications that are not using crowdsourcing so altogether.",
                    "label": 1
                },
                {
                    "sent": "From my end from a website that I'm kind of writing here, it's a website that.",
                    "label": 0
                },
                {
                    "sent": "At least companies that gold that got venture capital investments were identified.",
                    "label": 1
                },
                {
                    "sent": "700 companies that are working in language learning business.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So ideally you we need to do the environmental analysis and the industry analysis and then specific target market analysis.",
                    "label": 1
                },
                {
                    "sent": "So industry analysis is interesting to understand.",
                    "label": 0
                },
                {
                    "sent": "Who are the main players and how is this industry attractive?",
                    "label": 0
                },
                {
                    "sent": "Whether there is a window of opportunity to enter if the industry is consolidated or fragmented becausw if let's say the industry is consolidated and has two major players that.",
                    "label": 0
                },
                {
                    "sent": "It means the entry barriers are very high and it essentially excludes any potential market entrants and you analyze such issues as rivalry among existing firms, the substitutes, the bargaining power of suppliers of bias, and so on.",
                    "label": 1
                },
                {
                    "sent": "So this is a classic Michael Porter's model that is used for competitive.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alesis, so, in terms of the kind of prospects and potential for the language learning market market, I think it's very attractive 'cause it's estimated over around 60 billion dollars and it's growing very fast because the kind of globalization increases the need for people to learn foreign languages.",
                    "label": 0
                },
                {
                    "sent": "So according to an estimate I have here, it grows 17% per year and this is kind of really.",
                    "label": 0
                },
                {
                    "sent": "Amazing figure that shows that there are many opportunities and despite their large size, the field of specifically digital learning language learning is extremely fragmented.",
                    "label": 1
                },
                {
                    "sent": "So it means there are many companies here and market entry is relatively easy and for example a company that many of you know it's called Rosetta Stone.",
                    "label": 0
                },
                {
                    "sent": "It had a revenue of 154 million euros in 2017 and it equals.",
                    "label": 1
                },
                {
                    "sent": "Only three point 4% of this market, so it's not a kind of consolidated industry.",
                    "label": 0
                },
                {
                    "sent": "And it gives space for many other new entry.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So during our crowd, first we try to analyze the following platforms, at least looking at the biggest players sobu pseudo lingua bobble, mingle life, matcha memorize Woodward dive and we looked at information like the year of Foundation founders, growth of the platform like number of users per year, the main product that they offer, startup funding that they received.",
                    "label": 1
                },
                {
                    "sent": "Investors form of business ownership or original business model.",
                    "label": 0
                },
                {
                    "sent": "Subsequent business model becausw.",
                    "label": 0
                },
                {
                    "sent": "Usually company center with one value proposition and then in the in the course of years and with some experience they change it and lots of information.",
                    "label": 0
                },
                {
                    "sent": "Here was collected from Crunchbase which is a publicly available database or venture capitalists and investments and kind of more.",
                    "label": 1
                },
                {
                    "sent": "Newly updated information was updated from.",
                    "label": 0
                },
                {
                    "sent": "Orbis, which is the comprehensive database of companies around the world and just.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Give you a feel of what kind of data we found to what we learned, so I kind of present 3 four case studies, yeah?",
                    "label": 0
                },
                {
                    "sent": "The patterns are almost kind of similar, so I will start with Boussu are started 2008 number of users growing reasonably fast from 6 million in 2012, two 65 million and then you see the numbers in terms of investments that they got from venture capital from 400,000.",
                    "label": 1
                },
                {
                    "sent": "Euros then to 6 million.",
                    "label": 0
                },
                {
                    "sent": "Thirty five millions and so on.",
                    "label": 0
                },
                {
                    "sent": "So quite you need.",
                    "label": 0
                },
                {
                    "sent": "Count the few rounds of investments like that, operating revenues, judging the year to sell, statistics of the date of 2017 is 10,000,000, but the profit loss period is minus 6 million.",
                    "label": 0
                },
                {
                    "sent": "So and if you see also the profit margins that for the last four years, it's obvious that the companies is negative.",
                    "label": 0
                },
                {
                    "sent": "So it does take a few years to reach a break even.",
                    "label": 0
                },
                {
                    "sent": "And, uh, essentially the same pattern was observed with all the other bigger companies.",
                    "label": 1
                },
                {
                    "sent": "So in spite of the fact that the platform grows so fast, got so much money in venture capital funding, it keeps being negative for.",
                    "label": 0
                },
                {
                    "sent": "For quite a few years, hopefully until when the break break even point comes so.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A similar pattern you observe with dual lingo, it started 2011.",
                    "label": 0
                },
                {
                    "sent": "It rich now 3 million users are so it got all kind of investment.",
                    "label": 0
                },
                {
                    "sent": "Total funding was hundred 108 million.",
                    "label": 0
                },
                {
                    "sent": "So it uses advertising.",
                    "label": 0
                },
                {
                    "sent": "Oh advertisement model.",
                    "label": 0
                },
                {
                    "sent": "Freemium model operating revenues for 2017 two 150,000 and are with with.",
                    "label": 0
                },
                {
                    "sent": "Profit loss.",
                    "label": 0
                },
                {
                    "sent": "Negative margin.",
                    "label": 0
                },
                {
                    "sent": "It's the same essentially, so I I did not put the data here, but it's there.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for barbell start up year 2007 funding.",
                    "label": 0
                },
                {
                    "sent": "Funding 33 million.",
                    "label": 0
                },
                {
                    "sent": "Some important are some important investments.",
                    "label": 0
                },
                {
                    "sent": "Investors include the publisher publishers like Reed Elsevier, and in case of.",
                    "label": 0
                },
                {
                    "sent": "Boussu it was McGraw Hill so I think it it's it helps to create better content.",
                    "label": 0
                },
                {
                    "sent": "Then profit loss statement again minus 8 million revenues, 71 million in 2016 and profit margins are also negative.",
                    "label": 0
                },
                {
                    "sent": "So the company uses paid content.",
                    "label": 0
                },
                {
                    "sent": "No ads, transparent subscription based business model.",
                    "label": 1
                },
                {
                    "sent": "But still again it needs.",
                    "label": 0
                },
                {
                    "sent": "Maybe I don't know how many years to break, even if if it ever reaches this point.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So and the only kind of company where I discovered, although I cannot confirm it by the financial database, that they became financially positivism.",
                    "label": 0
                },
                {
                    "sent": "Memorize Wikipedia reports that last year they are.",
                    "label": 0
                },
                {
                    "sent": "They started breaking even, although are kind of my financial database, the Reportes for 2017 the profit.",
                    "label": 0
                },
                {
                    "sent": "Sorry the loss of 2 million.",
                    "label": 0
                },
                {
                    "sent": "OK, I'm finishing soon so.",
                    "label": 0
                },
                {
                    "sent": "Again, this is a.",
                    "label": 0
                },
                {
                    "sent": "This remains to be confirmed is they are really profitable.",
                    "label": 0
                },
                {
                    "sent": "But in any case this happened due to the switch into their into the switch into the business model where they started using only premium features and where the number of paid users kind of increased significantly.",
                    "label": 1
                },
                {
                    "sent": "Are they also got some criticism 'cause they tried to move the content that the free crowd source participants try?",
                    "label": 0
                },
                {
                    "sent": "Kind of uploaded on the on one platform and.",
                    "label": 0
                },
                {
                    "sent": "They did not.",
                    "label": 0
                },
                {
                    "sent": "The users felt it's very bad that the company wants to close it down or move it to another platform so.",
                    "label": 0
                },
                {
                    "sent": "There was some negative publicity recently due to the fact that the crowd sources couldn't get access to their data.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So as a next step, after the environmental analysis, what we have to do is to do the organizational analysis, and this essentially includes the analysis of value proposition of each company to understand what is unique in each business model and what is valuable, what is real, and whether it's easy or difficult to imitate.",
                    "label": 1
                },
                {
                    "sent": "Becausw successful business model usually gets.",
                    "label": 0
                },
                {
                    "sent": "Imitated very fast, and this essentially means that the company that had an idea usually loses it to the second mover who just copied it successfully.",
                    "label": 0
                },
                {
                    "sent": "OK and.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The work in progress includes, of course, organizational and financial feasibility, so I'm ready to answer any questions and thank you for attention.",
                    "label": 1
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "I think we can take one one question or two questions if there are questions.",
                    "label": 0
                },
                {
                    "sent": "How can we exploit all of this information?",
                    "label": 0
                },
                {
                    "sent": "How can we profit from all this information and try to do something in and collect collect you, have you discuss various platforms so you already have some prototypes, right?",
                    "label": 0
                },
                {
                    "sent": "At least I've got to know many people with various ideas would could be done so, and it's OK to have an idea, but not many people get it from idea to a commercialization and to a real company, so this kind of work helps you understand what needs to be done and kind of what kind of investment you have to seek and how you have to kind of what market you are trying to enter.",
                    "label": 0
                },
                {
                    "sent": "If you want your platform to.",
                    "label": 0
                },
                {
                    "sent": "Become a company of tomorrow.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you.",
                    "label": 0
                },
                {
                    "sent": "There's another question.",
                    "label": 0
                },
                {
                    "sent": "There nobody like.",
                    "label": 0
                },
                {
                    "sent": "Marketing business models were really close behind you mentioned.",
                    "label": 0
                },
                {
                    "sent": "Imitate models now give an example to me.",
                    "label": 0
                },
                {
                    "sent": "Imitate.",
                    "label": 0
                },
                {
                    "sent": "I cannot yet give an example in related to language learning OK, but just understand are kind of a very interesting company that many of you know and use it as a kind of consumer product.",
                    "label": 0
                },
                {
                    "sent": "It's a Gillette Razor, Gillette sensor razor.",
                    "label": 0
                },
                {
                    "sent": "OK, so the product everyone has seen it.",
                    "label": 0
                },
                {
                    "sent": "Many people use it and like it, but no one can copy it.",
                    "label": 0
                },
                {
                    "sent": "Becauses the company developed such a state of the art sophisticated equipment to produce them that no, our kind of person has seen, unless they are kind of the employees of the company and so that specific equipment and machinery is impossible to replicate.",
                    "label": 0
                },
                {
                    "sent": "Digital examples like applications.",
                    "label": 0
                },
                {
                    "sent": "I've got an example.",
                    "label": 0
                },
                {
                    "sent": "I've got an example, should more is very difficult to replicate.",
                    "label": 0
                },
                {
                    "sent": "Because they are the rules of the game are not online.",
                    "label": 0
                },
                {
                    "sent": "You got to discover them by themselves by yourself.",
                    "label": 0
                },
                {
                    "sent": "Yeah OK, you asked for an example.",
                    "label": 0
                },
                {
                    "sent": "OK so I have to keep some of your aspects of your business model secret.",
                    "label": 0
                },
                {
                    "sent": "I understand that there are not many opportunities to make a patent over this, but let's say if you can kind of hide some of the secrets.",
                    "label": 0
                },
                {
                    "sent": "It's not obvious to the outside.",
                    "label": 0
                },
                {
                    "sent": "Contributes to you to your product being difficult to imitate and then it.",
                    "label": 0
                },
                {
                    "sent": "It may not also be within a product.",
                    "label": 0
                },
                {
                    "sent": "It could be within a company itself.",
                    "label": 0
                },
                {
                    "sent": "Becausw the issues like organizational culture are difficult to imitate then not obvious with outsiders.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you very much, you're welcome.",
                    "label": 0
                }
            ]
        }
    }
}