{
    "id": "dvvexutql26vtsjdxqfzaprpk77w3q5q",
    "title": "QuerioDALI: Question Answering over Dynamic and Linked Knowledge Graphs",
    "info": {
        "author": [
            "Vanessa Lopez, IBM Research Ireland"
        ],
        "published": "Nov. 10, 2016",
        "recorded": "October 2016",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2016_lopez_knowledge_graphs/",
    "segmentation": [
        [
            "Good afternoon everybody going to well, it's great to be here in Japan.",
            "Many things have happened to me before the presentation, but an earthquake is a false so far.",
            "I saw this cute DLC in in that was the most dangerous thing.",
            "They behave like a Spanish bulls.",
            "Well, anyway, I just now.",
            "Seriously, it's great to be here to present our work on question.",
            "Answering that we are you doing as IBM Research in Dublin, and in particular in particular why we are doing."
        ],
        [
            "This.",
            "So traditionally question answering has focus on unstructured information.",
            "Getting answers from paragraph of test.",
            "In here we wanted to create the technology that enables a non technical user to post questions either by you speaking or writing in natural language.",
            "And the answer is retrieved from from knowledge graphs that are extracted from Lynn data sources.",
            "Open an enterprise data.",
            "As this is a medical application track, I'm going to focus quite a bit on the use case."
        ],
        [
            "With this integrated care, so integrated care Tigers targets high cost, high need patients.",
            "Let me introduce you $1,000,000 memory.",
            "So $1,000,000 Murray was 100 homeless alcoholic man in Nevada does for 10 years he was living on the street.",
            "He ran a medical bill larger than anyone in Nevada and is a good example of a high cost high need patients that uses multiple and connected services in particular emergency room emergency rooms.",
            "It's also an example of why social program problems are sometimes cheaper to solve than to ignore.",
            "It costs $1,000,000 to do Nada.",
            "Nothing about Mary.",
            "So."
        ],
        [
            "Integrated care it centers in the patient and in the end it is provided care rather than in a particular program or a particular problem.",
            "So I can workout needs to gain a holistic view of an individual in order in order to make better corporate care, personalized plans, and to take informed decisions.",
            "This is already a multifaceted, very complex view.",
            "It goes beyond the clinical domain where you see the diagnosis on the medications to the behavioral lifestyle.",
            "Diet exercises to the social aspects, adequate shelter in access to food, finances as well to the social connections of the persons and their care.",
            "And communities the safety net of care and community providers.",
            "As well as relevant as there is a lot of relevant open data as well as their own demographics in the area with the individual."
        ],
        [
            "Leaves and so on.",
            "So in this scenario, semantics are crucial for understanding and interlinking complex data.",
            "It is very contextual because what is relevant is really depends on the user task and we need natural language for the users to interact with this contextual system."
        ],
        [
            "This application here.",
            "So this is our Blue Lance application.",
            "It combines is an average of Question answer is and explorations.",
            "There are multiple challenges in this domain.",
            "Here we aim to tackle the question of how to make this information accessible to our care team in a natural way.",
            "Presenting the right info on the right time so they can worker can see an overview of a patient.",
            "In this case Teresa, and it can navigate through the different lenses total classified according to the domains of clinical, social, behavioral and so and so on using a Watson Natural Language classifier.",
            "And the system uses a combination of a structure and a structure knowledge so care workers cannot anytime input new voice notes and then the system will stress the entities and the sentiment and related cars.",
            "So in here we could integrate the search system to find information that is not presented in the cards, but a simple search system will not be enough to is a coworker has more complex information needs or if he has she has needs in which you had to combine the social information.",
            "With the clinical information, or just let's say open domain information with enterprise information, so we integrated query values so we can ask a question like what are the side effects of Theresa Drugs and it will use the size of the publicly available sided ontology to find the side effects of different drugs and our system of record of Teresa with with her different medications, combine the boat and it can give there for an answer."
        ],
        [
            "So we're in the requirements for this hour question.",
            "Answering system was study has to be.",
            "We want to reduce all the Watson NLP capabilities to create an open domain question answering, but on structured data there is not a fixed schema.",
            "Even if we consider the kernel main is too complex to assume there will be a unique model about everything.",
            "The data is dynamic and evolving, so we cannot rely on static indexes.",
            "We don't have training data and then data is very hard to acquire.",
            "Is particularly hard in the curve on main with all the privacy issues.",
            "And we need to perhaps the main difference with respect to unstructured question.",
            "Answering another question.",
            "Answering systems that use semantic data is that we need to combine facts and evidences from from different."
        ],
        [
            "Sources.",
            "So we use the traditional pipeline for question answering, where first we we try to understand the user they understand the user query with an anchor.",
            "The vocabulary of the query into the vocabulary.",
            "As ontologies we look for the graph patterns of the better interpretations.",
            "Considering the knowledge graphs and we combine information across sources if needed.",
            "Ranking aggro across alternative representations regarding the knowledge that we are using.",
            "So in."
        ],
        [
            "Here the point is that we don't want to create a unique knowledge graph about everything, but we want to reuse whatever link data is available as well.",
            "Open an enterprise later so we have a system that we call Valley that basically follows the W. 3C principles to take a relational data in table data and link to link it into an interlink, and we have craft.",
            "So like that we we created for example, a safety net providers using the data from the New York City data Portal and we could answer a query like which hospitals with elderly care has the lowest readmission rates for cardiology.",
            "This queries is answer using the New York City hospitals that are served.",
            "We contains information about hospitals and medical facilities like nursing home or lyrical, and the medical data set which contains information about the readmission rates for hospitals.",
            "By combining both together.",
            "We get the list of hospitals rank by the lowest by the lowest number.",
            "Here we interface data in two different ways.",
            "An any data can be a little so anytime as long as it's exposed in this particular point.",
            "So we have question.",
            "Answer is that our Federated and we use it to extract the answers and question an apology annotators available in data data sources that are used to semantically spend like the query.",
            "For example something like a DV pedia.",
            "Could we use?",
            "As a as a source of answers, but in any American domain we use it to semantically spend the query and find synonyms and so on."
        ],
        [
            "So the first step is a linguistic parsing.",
            "We will use the Watson NLP pipeline to Astrata dependency tree, from which we from which we struck the predicate argument structure.",
            "While we call the past triples.",
            "That relates the hell that are released, the terms together we also use name entity structures like Alchemy API and EPS post like to find multi words like elderly care.",
            "So now we have in the past triple the words how there was relate together, but that doesn't necessarily correspond.",
            "So how the way the knowledge is structuring ontology?"
        ],
        [
            "And this is important because it means that we cannot make any assumption about how the knowledge is structured.",
            "So for a candidate for a terminal query, this can map to whatever is a class and instance of property at a literal linguistic property may correspond to a linguistic ontological property wasn't a logical property, but maybe also correspond to a type.",
            "It is necessary to do semantic expansion to find the right terms, like in this case that elderly care and nursing home are synonyms, and then at the end what happen is that we have a very large estate of candy.",
            "Space of candidate solutions.",
            "Balancing precision and recall is a challenge in every step of the process, so we we have some eristics to try to find a more.",
            "The most precise matches.",
            "So the next steps are less computational expensive.",
            "These are based on a confidence on the mapping based on a string distance Vincent based on the type of lexical relationship.",
            "Another semantic features extracted from the annotators, and there are more details in the table."
        ],
        [
            "And then once we have all these lattice space of candidate entities from past triple, they need to be combined together so we can create the graph pattern, query that that makes sense for that triple, we discard the candidate mappings that cannot be connected, and we discuss those that list to know answers again.",
            "Here we have a.",
            "There is a library, lots of space of possible combinations.",
            "So we have an iterative algorithm to try to find the most precise and accurate.",
            "Accurate translations fails, so those that cover most of the terms or all the terms in the past in the past as well as we look for the shortest path connecting the terms, so is computationally less expensive and probably is more relevant as well."
        ],
        [
            "We use a set of templates that remain independent and data set independent, but they guide the search for connections that make sense.",
            "The calling to the types of entities.",
            "So for example in this question, who is the director of Movies starring Benicio Del Toro and Catherine Zeta Jones.",
            "This contains 3 three different predicate argument structures.",
            "Therefore, in this step we had to come when we have more than Grandpa stripper, we have to combine the the different graph patterns translations in a way that the if they belong to the same graph, if they have joined term in common and if they joining produces a set of results.",
            "So in here we have a translation for a person, for example for movies starring Benicio Del Toro.",
            "We look for an instance of a movie that has a property starting with an instance.",
            "When you show El Toro.",
            "Crazy for the triple person direct movies.",
            "We may have a translation of an instance of a person that has a property director with an instance of a movie, or it may be the case that we have an instance of a person who that is also an instance of a director and has a property with movies.",
            "So there are possible interpretations.",
            "The joint term here is obviously movies.",
            "This is an example of this template, so these templates look at the types of the candidates as well as if it's a fact or query or if you were looking for a Boolean query or if it's a comparative superlative.",
            "So here we have which mountains are higher than the Nanga Parbat because we don't have training data, relationships are notably difficult to to find, so in this case we look for the relationships that make sense for the subject on in, on the basics of the subjects on the object.",
            "So between other relationships that make sense between mountains, we have elevation, and then we use our pool of annotators to find the semantically related mapping.",
            "So elevation is.",
            "Is semantically related to hide by looking at the semantic distance in in one of the graphs.",
            "In this case is warm it, and then if there's retrieves ricin answer in.",
            "Basically elevation is a data type property, meaning it has a value.",
            "So in the filter it applies a comparison.",
            "So it looks for all the instances of amount interhealth iproperty elevation which number is higher than the value of the property elevation for Nanga Parbat."
        ],
        [
            "Leslie, if the graph patterns have translations across different graph with it an extra level of complexity because we have to melt fats across different sources.",
            "In here it may be that the elements that represent the same real world entity has different you Riz across graph, so we need to do entity coreference as well as student.",
            "If I'd in the joint term we use in sinuses, syntactic Anna semantic approach, so the semantic approach look for a.",
            "Kind of also in my same as linkages across entities and the synthetic approach looks similar.",
            "Labels.",
            "We do that because mostly many times we are missing a relationships or same as relationship.",
            "I'm looking at this example I supplied and only having side effects for Teresa conditions.",
            "The first thing is to find a joint term which in this case is not obvious but there basically we have the first part of the query, the side effects of a player monitor this again translated into the Cyber Ontology.",
            "And then we have a condition of the patient of Theresa.",
            "They join.",
            "Here is side effects and conditions.",
            "So it finds it finds a path as accepted.",
            "The graph that makes sense for this.",
            "So that also has a condition that is, that is link an inside ontologies.",
            "We have that the plane owner has the event is a side effect.",
            "They are both linked through a common DB pedia term, and that's how we found out that the answer is actually yes."
        ],
        [
            "We have already seen a standard benchmarks, so we evaluated first in another nominee scenario, for which we use a QLD 5 vents malaver DV Pedia an we evaluated as well using the free 917 bensman over freeways.",
            "Those two batsman are are open domain using large and very tedious ontology but otherwise they're quite different because if QLD has quite complex query secure including comparatives, superlatives and relationships.",
            "Previous in Freebase acquires in this previous pencil according cell most simple by the anchoring is really difficult.",
            "For example, for a property such as founders, there are 200 S matches and most of the boats is question answering systems that use Freebase or by our base and semi supervised learning and information I'll approaches.",
            "So today we had a.",
            "What is the first time that this an ontology based approach supply it and then we also evaluated in the biomedical scenario for that there is also a QLD 4.",
            "Which uses sizer drachman, and this is some ontologies.",
            "And here is how many specific the results there for us are better because we have so much ambiguity by the sum of the queries, requires to be Ansel across different sources, which the margin is one of the things we wanted to evaluate, so the results are discussed in the paper basically here to say that the performance we obtain is compatible to the best performing systems that participated in these benchmarks and as well based on training data.",
            "Oh yeah."
        ],
        [
            "So this results in many ways is far from over there.",
            "Many, many many open questions.",
            "So first of all we will like to in click increase the complexity of the questions and to be able to answer what is the meaning of life?",
            "How do you turn water into wine?",
            "Well, not really, but at least to be able to make a better temporal reasoning and to include negations and so on and very big issue of this kind of systems is brittleness.",
            "That is, the knowledge is not included in the knowledge.",
            "In the Knowledge Graph, there will be no answer.",
            "So by creating multiple sources, we try to reduce the brittleness because we bring more information into the system.",
            "But then we have more scalability and noise and intelligibility problems.",
            "1 interesting approach taken by the last benchmarks in QLD CI build question answering in which you will find answers from a structural fats in the pedia and as well as Astra's family.",
            "And our solution is to their approach to become more committed.",
            "In reality we want to increase the precision and recall even if we are able to achieve compatible resourced assistant are required training.",
            "We really need some kind of an approach that has some kind of active learning.",
            "That lens from users and improve the performance overtime because we if we don't have available training data and also maybe personalized based on their roles to stores now serves answer on."
        ],
        [
            "That's all, thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good afternoon everybody going to well, it's great to be here in Japan.",
                    "label": 0
                },
                {
                    "sent": "Many things have happened to me before the presentation, but an earthquake is a false so far.",
                    "label": 0
                },
                {
                    "sent": "I saw this cute DLC in in that was the most dangerous thing.",
                    "label": 0
                },
                {
                    "sent": "They behave like a Spanish bulls.",
                    "label": 0
                },
                {
                    "sent": "Well, anyway, I just now.",
                    "label": 0
                },
                {
                    "sent": "Seriously, it's great to be here to present our work on question.",
                    "label": 0
                },
                {
                    "sent": "Answering that we are you doing as IBM Research in Dublin, and in particular in particular why we are doing.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "So traditionally question answering has focus on unstructured information.",
                    "label": 0
                },
                {
                    "sent": "Getting answers from paragraph of test.",
                    "label": 0
                },
                {
                    "sent": "In here we wanted to create the technology that enables a non technical user to post questions either by you speaking or writing in natural language.",
                    "label": 0
                },
                {
                    "sent": "And the answer is retrieved from from knowledge graphs that are extracted from Lynn data sources.",
                    "label": 1
                },
                {
                    "sent": "Open an enterprise data.",
                    "label": 0
                },
                {
                    "sent": "As this is a medical application track, I'm going to focus quite a bit on the use case.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "With this integrated care, so integrated care Tigers targets high cost, high need patients.",
                    "label": 1
                },
                {
                    "sent": "Let me introduce you $1,000,000 memory.",
                    "label": 0
                },
                {
                    "sent": "So $1,000,000 Murray was 100 homeless alcoholic man in Nevada does for 10 years he was living on the street.",
                    "label": 0
                },
                {
                    "sent": "He ran a medical bill larger than anyone in Nevada and is a good example of a high cost high need patients that uses multiple and connected services in particular emergency room emergency rooms.",
                    "label": 0
                },
                {
                    "sent": "It's also an example of why social program problems are sometimes cheaper to solve than to ignore.",
                    "label": 0
                },
                {
                    "sent": "It costs $1,000,000 to do Nada.",
                    "label": 1
                },
                {
                    "sent": "Nothing about Mary.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Integrated care it centers in the patient and in the end it is provided care rather than in a particular program or a particular problem.",
                    "label": 0
                },
                {
                    "sent": "So I can workout needs to gain a holistic view of an individual in order in order to make better corporate care, personalized plans, and to take informed decisions.",
                    "label": 0
                },
                {
                    "sent": "This is already a multifaceted, very complex view.",
                    "label": 0
                },
                {
                    "sent": "It goes beyond the clinical domain where you see the diagnosis on the medications to the behavioral lifestyle.",
                    "label": 0
                },
                {
                    "sent": "Diet exercises to the social aspects, adequate shelter in access to food, finances as well to the social connections of the persons and their care.",
                    "label": 0
                },
                {
                    "sent": "And communities the safety net of care and community providers.",
                    "label": 0
                },
                {
                    "sent": "As well as relevant as there is a lot of relevant open data as well as their own demographics in the area with the individual.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Leaves and so on.",
                    "label": 0
                },
                {
                    "sent": "So in this scenario, semantics are crucial for understanding and interlinking complex data.",
                    "label": 1
                },
                {
                    "sent": "It is very contextual because what is relevant is really depends on the user task and we need natural language for the users to interact with this contextual system.",
                    "label": 1
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This application here.",
                    "label": 0
                },
                {
                    "sent": "So this is our Blue Lance application.",
                    "label": 0
                },
                {
                    "sent": "It combines is an average of Question answer is and explorations.",
                    "label": 0
                },
                {
                    "sent": "There are multiple challenges in this domain.",
                    "label": 0
                },
                {
                    "sent": "Here we aim to tackle the question of how to make this information accessible to our care team in a natural way.",
                    "label": 1
                },
                {
                    "sent": "Presenting the right info on the right time so they can worker can see an overview of a patient.",
                    "label": 0
                },
                {
                    "sent": "In this case Teresa, and it can navigate through the different lenses total classified according to the domains of clinical, social, behavioral and so and so on using a Watson Natural Language classifier.",
                    "label": 0
                },
                {
                    "sent": "And the system uses a combination of a structure and a structure knowledge so care workers cannot anytime input new voice notes and then the system will stress the entities and the sentiment and related cars.",
                    "label": 0
                },
                {
                    "sent": "So in here we could integrate the search system to find information that is not presented in the cards, but a simple search system will not be enough to is a coworker has more complex information needs or if he has she has needs in which you had to combine the social information.",
                    "label": 0
                },
                {
                    "sent": "With the clinical information, or just let's say open domain information with enterprise information, so we integrated query values so we can ask a question like what are the side effects of Theresa Drugs and it will use the size of the publicly available sided ontology to find the side effects of different drugs and our system of record of Teresa with with her different medications, combine the boat and it can give there for an answer.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we're in the requirements for this hour question.",
                    "label": 0
                },
                {
                    "sent": "Answering system was study has to be.",
                    "label": 0
                },
                {
                    "sent": "We want to reduce all the Watson NLP capabilities to create an open domain question answering, but on structured data there is not a fixed schema.",
                    "label": 0
                },
                {
                    "sent": "Even if we consider the kernel main is too complex to assume there will be a unique model about everything.",
                    "label": 0
                },
                {
                    "sent": "The data is dynamic and evolving, so we cannot rely on static indexes.",
                    "label": 0
                },
                {
                    "sent": "We don't have training data and then data is very hard to acquire.",
                    "label": 0
                },
                {
                    "sent": "Is particularly hard in the curve on main with all the privacy issues.",
                    "label": 0
                },
                {
                    "sent": "And we need to perhaps the main difference with respect to unstructured question.",
                    "label": 0
                },
                {
                    "sent": "Answering another question.",
                    "label": 0
                },
                {
                    "sent": "Answering systems that use semantic data is that we need to combine facts and evidences from from different.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sources.",
                    "label": 0
                },
                {
                    "sent": "So we use the traditional pipeline for question answering, where first we we try to understand the user they understand the user query with an anchor.",
                    "label": 0
                },
                {
                    "sent": "The vocabulary of the query into the vocabulary.",
                    "label": 0
                },
                {
                    "sent": "As ontologies we look for the graph patterns of the better interpretations.",
                    "label": 0
                },
                {
                    "sent": "Considering the knowledge graphs and we combine information across sources if needed.",
                    "label": 1
                },
                {
                    "sent": "Ranking aggro across alternative representations regarding the knowledge that we are using.",
                    "label": 0
                },
                {
                    "sent": "So in.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here the point is that we don't want to create a unique knowledge graph about everything, but we want to reuse whatever link data is available as well.",
                    "label": 0
                },
                {
                    "sent": "Open an enterprise later so we have a system that we call Valley that basically follows the W. 3C principles to take a relational data in table data and link to link it into an interlink, and we have craft.",
                    "label": 0
                },
                {
                    "sent": "So like that we we created for example, a safety net providers using the data from the New York City data Portal and we could answer a query like which hospitals with elderly care has the lowest readmission rates for cardiology.",
                    "label": 0
                },
                {
                    "sent": "This queries is answer using the New York City hospitals that are served.",
                    "label": 0
                },
                {
                    "sent": "We contains information about hospitals and medical facilities like nursing home or lyrical, and the medical data set which contains information about the readmission rates for hospitals.",
                    "label": 0
                },
                {
                    "sent": "By combining both together.",
                    "label": 0
                },
                {
                    "sent": "We get the list of hospitals rank by the lowest by the lowest number.",
                    "label": 0
                },
                {
                    "sent": "Here we interface data in two different ways.",
                    "label": 0
                },
                {
                    "sent": "An any data can be a little so anytime as long as it's exposed in this particular point.",
                    "label": 0
                },
                {
                    "sent": "So we have question.",
                    "label": 0
                },
                {
                    "sent": "Answer is that our Federated and we use it to extract the answers and question an apology annotators available in data data sources that are used to semantically spend like the query.",
                    "label": 0
                },
                {
                    "sent": "For example something like a DV pedia.",
                    "label": 0
                },
                {
                    "sent": "Could we use?",
                    "label": 0
                },
                {
                    "sent": "As a as a source of answers, but in any American domain we use it to semantically spend the query and find synonyms and so on.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the first step is a linguistic parsing.",
                    "label": 0
                },
                {
                    "sent": "We will use the Watson NLP pipeline to Astrata dependency tree, from which we from which we struck the predicate argument structure.",
                    "label": 0
                },
                {
                    "sent": "While we call the past triples.",
                    "label": 0
                },
                {
                    "sent": "That relates the hell that are released, the terms together we also use name entity structures like Alchemy API and EPS post like to find multi words like elderly care.",
                    "label": 0
                },
                {
                    "sent": "So now we have in the past triple the words how there was relate together, but that doesn't necessarily correspond.",
                    "label": 0
                },
                {
                    "sent": "So how the way the knowledge is structuring ontology?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is important because it means that we cannot make any assumption about how the knowledge is structured.",
                    "label": 0
                },
                {
                    "sent": "So for a candidate for a terminal query, this can map to whatever is a class and instance of property at a literal linguistic property may correspond to a linguistic ontological property wasn't a logical property, but maybe also correspond to a type.",
                    "label": 0
                },
                {
                    "sent": "It is necessary to do semantic expansion to find the right terms, like in this case that elderly care and nursing home are synonyms, and then at the end what happen is that we have a very large estate of candy.",
                    "label": 0
                },
                {
                    "sent": "Space of candidate solutions.",
                    "label": 0
                },
                {
                    "sent": "Balancing precision and recall is a challenge in every step of the process, so we we have some eristics to try to find a more.",
                    "label": 0
                },
                {
                    "sent": "The most precise matches.",
                    "label": 0
                },
                {
                    "sent": "So the next steps are less computational expensive.",
                    "label": 0
                },
                {
                    "sent": "These are based on a confidence on the mapping based on a string distance Vincent based on the type of lexical relationship.",
                    "label": 0
                },
                {
                    "sent": "Another semantic features extracted from the annotators, and there are more details in the table.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then once we have all these lattice space of candidate entities from past triple, they need to be combined together so we can create the graph pattern, query that that makes sense for that triple, we discard the candidate mappings that cannot be connected, and we discuss those that list to know answers again.",
                    "label": 0
                },
                {
                    "sent": "Here we have a.",
                    "label": 0
                },
                {
                    "sent": "There is a library, lots of space of possible combinations.",
                    "label": 0
                },
                {
                    "sent": "So we have an iterative algorithm to try to find the most precise and accurate.",
                    "label": 0
                },
                {
                    "sent": "Accurate translations fails, so those that cover most of the terms or all the terms in the past in the past as well as we look for the shortest path connecting the terms, so is computationally less expensive and probably is more relevant as well.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We use a set of templates that remain independent and data set independent, but they guide the search for connections that make sense.",
                    "label": 0
                },
                {
                    "sent": "The calling to the types of entities.",
                    "label": 0
                },
                {
                    "sent": "So for example in this question, who is the director of Movies starring Benicio Del Toro and Catherine Zeta Jones.",
                    "label": 1
                },
                {
                    "sent": "This contains 3 three different predicate argument structures.",
                    "label": 0
                },
                {
                    "sent": "Therefore, in this step we had to come when we have more than Grandpa stripper, we have to combine the the different graph patterns translations in a way that the if they belong to the same graph, if they have joined term in common and if they joining produces a set of results.",
                    "label": 0
                },
                {
                    "sent": "So in here we have a translation for a person, for example for movies starring Benicio Del Toro.",
                    "label": 1
                },
                {
                    "sent": "We look for an instance of a movie that has a property starting with an instance.",
                    "label": 0
                },
                {
                    "sent": "When you show El Toro.",
                    "label": 0
                },
                {
                    "sent": "Crazy for the triple person direct movies.",
                    "label": 0
                },
                {
                    "sent": "We may have a translation of an instance of a person that has a property director with an instance of a movie, or it may be the case that we have an instance of a person who that is also an instance of a director and has a property with movies.",
                    "label": 0
                },
                {
                    "sent": "So there are possible interpretations.",
                    "label": 0
                },
                {
                    "sent": "The joint term here is obviously movies.",
                    "label": 0
                },
                {
                    "sent": "This is an example of this template, so these templates look at the types of the candidates as well as if it's a fact or query or if you were looking for a Boolean query or if it's a comparative superlative.",
                    "label": 0
                },
                {
                    "sent": "So here we have which mountains are higher than the Nanga Parbat because we don't have training data, relationships are notably difficult to to find, so in this case we look for the relationships that make sense for the subject on in, on the basics of the subjects on the object.",
                    "label": 0
                },
                {
                    "sent": "So between other relationships that make sense between mountains, we have elevation, and then we use our pool of annotators to find the semantically related mapping.",
                    "label": 0
                },
                {
                    "sent": "So elevation is.",
                    "label": 0
                },
                {
                    "sent": "Is semantically related to hide by looking at the semantic distance in in one of the graphs.",
                    "label": 0
                },
                {
                    "sent": "In this case is warm it, and then if there's retrieves ricin answer in.",
                    "label": 0
                },
                {
                    "sent": "Basically elevation is a data type property, meaning it has a value.",
                    "label": 0
                },
                {
                    "sent": "So in the filter it applies a comparison.",
                    "label": 0
                },
                {
                    "sent": "So it looks for all the instances of amount interhealth iproperty elevation which number is higher than the value of the property elevation for Nanga Parbat.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Leslie, if the graph patterns have translations across different graph with it an extra level of complexity because we have to melt fats across different sources.",
                    "label": 0
                },
                {
                    "sent": "In here it may be that the elements that represent the same real world entity has different you Riz across graph, so we need to do entity coreference as well as student.",
                    "label": 0
                },
                {
                    "sent": "If I'd in the joint term we use in sinuses, syntactic Anna semantic approach, so the semantic approach look for a.",
                    "label": 0
                },
                {
                    "sent": "Kind of also in my same as linkages across entities and the synthetic approach looks similar.",
                    "label": 0
                },
                {
                    "sent": "Labels.",
                    "label": 0
                },
                {
                    "sent": "We do that because mostly many times we are missing a relationships or same as relationship.",
                    "label": 0
                },
                {
                    "sent": "I'm looking at this example I supplied and only having side effects for Teresa conditions.",
                    "label": 0
                },
                {
                    "sent": "The first thing is to find a joint term which in this case is not obvious but there basically we have the first part of the query, the side effects of a player monitor this again translated into the Cyber Ontology.",
                    "label": 0
                },
                {
                    "sent": "And then we have a condition of the patient of Theresa.",
                    "label": 0
                },
                {
                    "sent": "They join.",
                    "label": 0
                },
                {
                    "sent": "Here is side effects and conditions.",
                    "label": 0
                },
                {
                    "sent": "So it finds it finds a path as accepted.",
                    "label": 0
                },
                {
                    "sent": "The graph that makes sense for this.",
                    "label": 0
                },
                {
                    "sent": "So that also has a condition that is, that is link an inside ontologies.",
                    "label": 0
                },
                {
                    "sent": "We have that the plane owner has the event is a side effect.",
                    "label": 0
                },
                {
                    "sent": "They are both linked through a common DB pedia term, and that's how we found out that the answer is actually yes.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have already seen a standard benchmarks, so we evaluated first in another nominee scenario, for which we use a QLD 5 vents malaver DV Pedia an we evaluated as well using the free 917 bensman over freeways.",
                    "label": 0
                },
                {
                    "sent": "Those two batsman are are open domain using large and very tedious ontology but otherwise they're quite different because if QLD has quite complex query secure including comparatives, superlatives and relationships.",
                    "label": 0
                },
                {
                    "sent": "Previous in Freebase acquires in this previous pencil according cell most simple by the anchoring is really difficult.",
                    "label": 0
                },
                {
                    "sent": "For example, for a property such as founders, there are 200 S matches and most of the boats is question answering systems that use Freebase or by our base and semi supervised learning and information I'll approaches.",
                    "label": 0
                },
                {
                    "sent": "So today we had a.",
                    "label": 0
                },
                {
                    "sent": "What is the first time that this an ontology based approach supply it and then we also evaluated in the biomedical scenario for that there is also a QLD 4.",
                    "label": 0
                },
                {
                    "sent": "Which uses sizer drachman, and this is some ontologies.",
                    "label": 0
                },
                {
                    "sent": "And here is how many specific the results there for us are better because we have so much ambiguity by the sum of the queries, requires to be Ansel across different sources, which the margin is one of the things we wanted to evaluate, so the results are discussed in the paper basically here to say that the performance we obtain is compatible to the best performing systems that participated in these benchmarks and as well based on training data.",
                    "label": 0
                },
                {
                    "sent": "Oh yeah.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this results in many ways is far from over there.",
                    "label": 0
                },
                {
                    "sent": "Many, many many open questions.",
                    "label": 0
                },
                {
                    "sent": "So first of all we will like to in click increase the complexity of the questions and to be able to answer what is the meaning of life?",
                    "label": 0
                },
                {
                    "sent": "How do you turn water into wine?",
                    "label": 0
                },
                {
                    "sent": "Well, not really, but at least to be able to make a better temporal reasoning and to include negations and so on and very big issue of this kind of systems is brittleness.",
                    "label": 0
                },
                {
                    "sent": "That is, the knowledge is not included in the knowledge.",
                    "label": 0
                },
                {
                    "sent": "In the Knowledge Graph, there will be no answer.",
                    "label": 0
                },
                {
                    "sent": "So by creating multiple sources, we try to reduce the brittleness because we bring more information into the system.",
                    "label": 0
                },
                {
                    "sent": "But then we have more scalability and noise and intelligibility problems.",
                    "label": 0
                },
                {
                    "sent": "1 interesting approach taken by the last benchmarks in QLD CI build question answering in which you will find answers from a structural fats in the pedia and as well as Astra's family.",
                    "label": 0
                },
                {
                    "sent": "And our solution is to their approach to become more committed.",
                    "label": 0
                },
                {
                    "sent": "In reality we want to increase the precision and recall even if we are able to achieve compatible resourced assistant are required training.",
                    "label": 0
                },
                {
                    "sent": "We really need some kind of an approach that has some kind of active learning.",
                    "label": 0
                },
                {
                    "sent": "That lens from users and improve the performance overtime because we if we don't have available training data and also maybe personalized based on their roles to stores now serves answer on.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's all, thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}