{
    "id": "dxqrvfrae7co2ngd5iaimlwgzvj77y5a",
    "title": "Euro-MOTOR: A multi-centre population-based case-control study of metals and solvents exposure as risk factors for amyotrophic lateral sclerosis",
    "info": {
        "author": [
            "James P. K. Rooney, Trinity Biomedical Sciences Institute, Trinity College Dublin"
        ],
        "published": "July 21, 2017",
        "recorded": "May 2017",
        "category": [
            "Top->Medicine",
            "Top->Medicine->Neuroscience"
        ]
    },
    "url": "http://videolectures.net/encals2017_rooney_euro_MOTOR/",
    "segmentation": [
        [
            "My name is James Rooney.",
            "I'm a research fellow at Trinity College in Dublin, working for professor.",
            "Working for Presta, Orla, Hardiman, and I'm presenting today on behalf of the Euro Motor Consortium.",
            "My presentation is entitled you're a motor, a multi tenant multicenter case control, study of metals and solvents, exposures as risk factors for a less."
        ],
        [
            "So.",
            "Exposure to metals and Sullivans have been proposed as risk factors for a less going back many years, and there's been different kinds of studies that have prompted this proposal.",
            "There's been occupational studies just been surveys of people using chemicals at home, and there's been some biometric studies, but the results in the literature are kind of mixed and part of the reason for that is that there's heterogeneous study designs and it makes it difficult to compare across studies, and it's also difficult to assess historical exposures.",
            "If patients are presenting today, it's very hard to find out what they were exposed to 20 years ago or 30 years ago.",
            "So."
        ],
        [
            "With that background, the Euromotion Consortium was set up.",
            "It's a large case control study of environmental exposures across 5 European populations, 3 and 82 in the North of Italy and one in the South Ireland and the Netherlands.",
            "Anne, it's set up to explore the pathology of LS using a system biology approach.",
            "So today I'm going to present results from assessment of occupational exposures to metals and solvents."
        ],
        [
            "So between 2011 and 2015.",
            "Incident LS cases recruited in Ireland, Italy and the Netherlands.",
            "This included where anyone with possible probable and definite at a school criteria suspected cases weren't included.",
            "Controls were recruited matched by age, gender, and location for patients."
        ],
        [
            "So for everyone who is enrolled, we gathered demographic details, age, gender, education and resident residential history.",
            "And for for the patients we got clinical details such as their age of onset, inside of onset, diagnostic delay, El Escorial criteria and a less ephorus and informations on controls.",
            "We got medical history, cardiovascular disease, diabetes, history of cancer or trauma.",
            "We also serve it on information for about other lifestyle factors such as sports, hobbies, cigarettes, alcohol, drugs, both prescribed and recreational.",
            "Finally, we did an occupational exposure assessment."
        ],
        [
            "So the occupational exposure assessment.",
            "Consisted of the following we took a full occupational history from all the patients and controls.",
            "This included job title, The Tasks performed, the years they worked, and the errors per week that they did in each job.",
            "So for every one of those jobs we applied disco coding to the jobs.",
            "Now ESCO stands for the International Standard Classification of Occupations and the 68 and 88 refers to two different years that this was these were formalized in 1968, nineteen 88.",
            "So taking those ethical code of jobs, we were able to use job exposure matrices to to estimate exposures in the individuals.",
            "So job exposure matrices are designed by occupational health experts and they've been used in other fields, such as respiratory disease and cancer and their well established.",
            "And in the results in presenting today, there's three.",
            "Different job exposure matrices matrices that we use the Aloha Gem the Dom Jen and Ben Jen, and they're all.",
            "There are some overlap, but."
        ],
        [
            "Kingdom, but the Aloha jam sorry, the ones in red are the the ones I'm reporting today, so I'm talking bout metals, solvents which split into aromatic, aromatic chlorinated another solvents chromium and nickel from the Dom Jen and then Benjamin is just benzene.",
            "I should say benzene is actually an are aromatic solvent itself."
        ],
        [
            "So once we had all that data, we used multivariate logistic regression to examine the associations between exposure and disease.",
            "So each very each exposure was treated as a yes or no.",
            "So it was a binary exposure.",
            "We corrected for age education and study site.",
            "We also did models including and excluding people who are known to be seen on or F 72.",
            "And after that we built additional models adjusting for other lifestyle factors such as alcohol, smoking, physical activity, things that have been associated or proposed as risk factors for a less in the past.",
            "We also did a sensitivity analysis stratified by gender education inside of an set.",
            "And finally, we did a mixed effects model to allow for heterogeneity by study site, because it might be that exposures are different country country."
        ],
        [
            "So this is my first table.",
            "It's a bit big, so I apologize for that, but I'll I'll run through it and there were in total.",
            "1557 patients and 2922 controls.",
            "From Apulia in South Italy there was 353 in total Lombardy in the North of Italy, the street and 76 Piedmont and Valdosta 552, again in North of Italy, Ireland 526 and from the Netherlands was 2671, and that was patients controls combined.",
            "Across the different cohorts for Ireland and the Netherlands, we had a ratio of two controls for education and for Italy was a bit closer to 1's to one.",
            "In terms of percent male patients, there was no differences between patients and controls across the cohorts.",
            "Neither was there for the age that they were served at serving.",
            "The bottom column there shows their education classification and that's their classified according to the International Standard Classification of Education.",
            "So there were some differences in Lombardy and Piedmont between cases and controls, with the controls being slightly higher educated."
        ],
        [
            "And this table then shows the summary of lifestyle, other lifestyle factors.",
            "So smoking, drinking and leisure time physical activity.",
            "And there were differences in consumption of alcohol in both Puglia and the Netherlands, with higher consumption in controls compared to patients in both cases and for leisure time.",
            "Physical activity.",
            "There was only a difference in the Netherlands, with slightly higher leisure time.",
            "Physical activity."
        ],
        [
            "So this these are the results from the first exposure model.",
            "I'll just explain the headings on the column of the role titles on the side, so the 1st two are from the Dom.",
            "Jenn, that's the chromium and nickel.",
            "The next four are from the Aloha Gem, so metals, aromatic solvents, chlorinated solvents and other solvents and then the final one is benzene.",
            "So.",
            "These models have all been adjusted for age, gender, education and cohort.",
            "So the ones in red are the ones that were Stickley significant, so there was an odds ratio of 1.2, three for exposure to metals in the lower jump, an 1.2 version to aromatic solvents and for benzene.",
            "Then it was slightly higher odds ratio of 1.26.",
            "So the next thing we did was excluded 118C9RF72 cases.",
            "And that had a couple of facts.",
            "Chromium became significant at 1.31 as an answer issue and the odds ratios for the others became slightly higher than they were before.",
            "In each case.",
            "And then the final column, and so we've excluded.",
            "We've still excluded the C9 or F72 cases, but we've also adjusted for physical activity, smoking and alcohol status, and the same for exposures remained significant on the other issues didn't really change very much."
        ],
        [
            "So on this page then we have stratified by gender and you can see that in.",
            "Metals are magic solvents and benzene remains significant in males only.",
            "However, the.",
            "Odds ratios weren't particularly that one's a little bit different, but in general they were close between males and females, and if you look at the number.",
            "Number of males is higher than in females, so this may be just an effect of power.",
            "Then we started for education.",
            "And we found that aromatic solvents, chlorinated solvents and benzene were significant in the in the lower education classification, and this likely reflects that.",
            "Exposures to people get through.",
            "Sorry occupationally, linked exposures depending on peoples education originally.",
            "And finally, then we stratified by sight of onset.",
            "So in these models we include we compared spinal patients to controls only or Boulder pages to controls.",
            "So for spinal patients we found that metals and aromatic solvents remains significant.",
            "Benzie and for the Boulder patients, benzene was actually more significant and metals aromatic solvents were insignificant.",
            "Although the operations didn't change much.",
            "So again, that might be an effective power."
        ],
        [
            "So this this forest plot here.",
            "Is generated from a mixed model allowing for heterogeneity by study site.",
            "The upper graph is for the Aloha metals.",
            "The middle one is for chromium and the lower one is for nickel, and you can see that there's a similar pattern across all three.",
            "The.",
            "Two sites in northern Italy.",
            "Lombardy and Piedmont have higher odds ratios than the other sites and actually the overall odds ratios.",
            "Our heart increased from from the logistic regressions and you can.",
            "That's what the second table is for, so.",
            "We have 1.5 four whereas before it was 1.28.",
            "We now have 1.5 before it was 1.31 and we now have 1.38 for nickel.",
            "For us we had 1.18 before, so accounting for the heterogeneity and leads to increased estimates."
        ],
        [
            "When we did the same thing for solvents, however, we didn't see the same pattern.",
            "So this these two graphs are for automatic solvents on for chlorinated solvents and you can see there more or less in a straight line for all sites.",
            "And actually, the odds ratios didn't really change much, so if you were comparing 1.19, two, 1.22 and 1.13 to 1.15 from from the previous model, so allowing for heterogeneity didn't really make any difference here."
        ],
        [
            "And we had the same.",
            "Pattern for the other solvents and benzie."
        ],
        [
            "So this begs the question of why we got hydrogen energy for metals but not for solvents.",
            "Well, there is a higher prevalence of exposure to the metals in the northern Italian sites, and that's true.",
            "That's determined by the occupations.",
            "I haven't had a chance to investigate exactly which occupations are linked to that, but that we know that this is true.",
            "And the other factor consider is that.",
            "The If you consider the whole cohort of 4479 people, the exposure to ratic solvents and benzene is much higher by 26 percent 25% compared to the metals which 16% for a lower metals and 8% for the chromium.",
            "And I think it's about 8% for the nickel as well.",
            "So it might be that the.",
            "The exposures which are lower across the whole court are more susceptible to statistical noise."
        ],
        [
            "So.",
            "In conclusion, metals chromium and aromatic solvent exposures are associated with increased odds of a less.",
            "Undesirables to adjustment for life.",
            "Tough factors.",
            "Removing C9 or F-70 patients appears to increase the odds ratios and that's consistent with the multi step theory of a lesser multiple pathways from being healthy to having a less.",
            "And it implicates exposures in sporadic KLS more so than CNN or F. So 1 take away from this is whether exposure studies in a less may need to be stratified by C9 or F72 status, or perhaps exclude those patients.",
            "I would think stratifying is more sensible because we have 118 C #72 patients, so I can't say completely that the expose those exposures are not important.",
            "In those people 'cause it's not really enough.",
            "But it does seem to be less important.",
            "And finally, we've heterogeneity by study site for metals, but not solvents."
        ],
        [
            "So I'd like to take knowledge, my collaborators, Anne, and particularly role from Universal and and his team and at the Institute for Risk Assessment Scientists Sciences in Utrecht, who helped us with the job exposure matrices for the study."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "My name is James Rooney.",
                    "label": 0
                },
                {
                    "sent": "I'm a research fellow at Trinity College in Dublin, working for professor.",
                    "label": 1
                },
                {
                    "sent": "Working for Presta, Orla, Hardiman, and I'm presenting today on behalf of the Euro Motor Consortium.",
                    "label": 1
                },
                {
                    "sent": "My presentation is entitled you're a motor, a multi tenant multicenter case control, study of metals and solvents, exposures as risk factors for a less.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Exposure to metals and Sullivans have been proposed as risk factors for a less going back many years, and there's been different kinds of studies that have prompted this proposal.",
                    "label": 1
                },
                {
                    "sent": "There's been occupational studies just been surveys of people using chemicals at home, and there's been some biometric studies, but the results in the literature are kind of mixed and part of the reason for that is that there's heterogeneous study designs and it makes it difficult to compare across studies, and it's also difficult to assess historical exposures.",
                    "label": 1
                },
                {
                    "sent": "If patients are presenting today, it's very hard to find out what they were exposed to 20 years ago or 30 years ago.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "With that background, the Euromotion Consortium was set up.",
                    "label": 0
                },
                {
                    "sent": "It's a large case control study of environmental exposures across 5 European populations, 3 and 82 in the North of Italy and one in the South Ireland and the Netherlands.",
                    "label": 1
                },
                {
                    "sent": "Anne, it's set up to explore the pathology of LS using a system biology approach.",
                    "label": 1
                },
                {
                    "sent": "So today I'm going to present results from assessment of occupational exposures to metals and solvents.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So between 2011 and 2015.",
                    "label": 1
                },
                {
                    "sent": "Incident LS cases recruited in Ireland, Italy and the Netherlands.",
                    "label": 1
                },
                {
                    "sent": "This included where anyone with possible probable and definite at a school criteria suspected cases weren't included.",
                    "label": 1
                },
                {
                    "sent": "Controls were recruited matched by age, gender, and location for patients.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for everyone who is enrolled, we gathered demographic details, age, gender, education and resident residential history.",
                    "label": 1
                },
                {
                    "sent": "And for for the patients we got clinical details such as their age of onset, inside of onset, diagnostic delay, El Escorial criteria and a less ephorus and informations on controls.",
                    "label": 1
                },
                {
                    "sent": "We got medical history, cardiovascular disease, diabetes, history of cancer or trauma.",
                    "label": 1
                },
                {
                    "sent": "We also serve it on information for about other lifestyle factors such as sports, hobbies, cigarettes, alcohol, drugs, both prescribed and recreational.",
                    "label": 1
                },
                {
                    "sent": "Finally, we did an occupational exposure assessment.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the occupational exposure assessment.",
                    "label": 0
                },
                {
                    "sent": "Consisted of the following we took a full occupational history from all the patients and controls.",
                    "label": 0
                },
                {
                    "sent": "This included job title, The Tasks performed, the years they worked, and the errors per week that they did in each job.",
                    "label": 0
                },
                {
                    "sent": "So for every one of those jobs we applied disco coding to the jobs.",
                    "label": 0
                },
                {
                    "sent": "Now ESCO stands for the International Standard Classification of Occupations and the 68 and 88 refers to two different years that this was these were formalized in 1968, nineteen 88.",
                    "label": 1
                },
                {
                    "sent": "So taking those ethical code of jobs, we were able to use job exposure matrices to to estimate exposures in the individuals.",
                    "label": 0
                },
                {
                    "sent": "So job exposure matrices are designed by occupational health experts and they've been used in other fields, such as respiratory disease and cancer and their well established.",
                    "label": 0
                },
                {
                    "sent": "And in the results in presenting today, there's three.",
                    "label": 0
                },
                {
                    "sent": "Different job exposure matrices matrices that we use the Aloha Gem the Dom Jen and Ben Jen, and they're all.",
                    "label": 0
                },
                {
                    "sent": "There are some overlap, but.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Kingdom, but the Aloha jam sorry, the ones in red are the the ones I'm reporting today, so I'm talking bout metals, solvents which split into aromatic, aromatic chlorinated another solvents chromium and nickel from the Dom Jen and then Benjamin is just benzene.",
                    "label": 0
                },
                {
                    "sent": "I should say benzene is actually an are aromatic solvent itself.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So once we had all that data, we used multivariate logistic regression to examine the associations between exposure and disease.",
                    "label": 0
                },
                {
                    "sent": "So each very each exposure was treated as a yes or no.",
                    "label": 0
                },
                {
                    "sent": "So it was a binary exposure.",
                    "label": 0
                },
                {
                    "sent": "We corrected for age education and study site.",
                    "label": 1
                },
                {
                    "sent": "We also did models including and excluding people who are known to be seen on or F 72.",
                    "label": 1
                },
                {
                    "sent": "And after that we built additional models adjusting for other lifestyle factors such as alcohol, smoking, physical activity, things that have been associated or proposed as risk factors for a less in the past.",
                    "label": 1
                },
                {
                    "sent": "We also did a sensitivity analysis stratified by gender education inside of an set.",
                    "label": 0
                },
                {
                    "sent": "And finally, we did a mixed effects model to allow for heterogeneity by study site, because it might be that exposures are different country country.",
                    "label": 1
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is my first table.",
                    "label": 0
                },
                {
                    "sent": "It's a bit big, so I apologize for that, but I'll I'll run through it and there were in total.",
                    "label": 0
                },
                {
                    "sent": "1557 patients and 2922 controls.",
                    "label": 0
                },
                {
                    "sent": "From Apulia in South Italy there was 353 in total Lombardy in the North of Italy, the street and 76 Piedmont and Valdosta 552, again in North of Italy, Ireland 526 and from the Netherlands was 2671, and that was patients controls combined.",
                    "label": 0
                },
                {
                    "sent": "Across the different cohorts for Ireland and the Netherlands, we had a ratio of two controls for education and for Italy was a bit closer to 1's to one.",
                    "label": 0
                },
                {
                    "sent": "In terms of percent male patients, there was no differences between patients and controls across the cohorts.",
                    "label": 0
                },
                {
                    "sent": "Neither was there for the age that they were served at serving.",
                    "label": 0
                },
                {
                    "sent": "The bottom column there shows their education classification and that's their classified according to the International Standard Classification of Education.",
                    "label": 1
                },
                {
                    "sent": "So there were some differences in Lombardy and Piedmont between cases and controls, with the controls being slightly higher educated.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this table then shows the summary of lifestyle, other lifestyle factors.",
                    "label": 1
                },
                {
                    "sent": "So smoking, drinking and leisure time physical activity.",
                    "label": 0
                },
                {
                    "sent": "And there were differences in consumption of alcohol in both Puglia and the Netherlands, with higher consumption in controls compared to patients in both cases and for leisure time.",
                    "label": 0
                },
                {
                    "sent": "Physical activity.",
                    "label": 0
                },
                {
                    "sent": "There was only a difference in the Netherlands, with slightly higher leisure time.",
                    "label": 0
                },
                {
                    "sent": "Physical activity.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this these are the results from the first exposure model.",
                    "label": 0
                },
                {
                    "sent": "I'll just explain the headings on the column of the role titles on the side, so the 1st two are from the Dom.",
                    "label": 0
                },
                {
                    "sent": "Jenn, that's the chromium and nickel.",
                    "label": 0
                },
                {
                    "sent": "The next four are from the Aloha Gem, so metals, aromatic solvents, chlorinated solvents and other solvents and then the final one is benzene.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "These models have all been adjusted for age, gender, education and cohort.",
                    "label": 1
                },
                {
                    "sent": "So the ones in red are the ones that were Stickley significant, so there was an odds ratio of 1.2, three for exposure to metals in the lower jump, an 1.2 version to aromatic solvents and for benzene.",
                    "label": 0
                },
                {
                    "sent": "Then it was slightly higher odds ratio of 1.26.",
                    "label": 0
                },
                {
                    "sent": "So the next thing we did was excluded 118C9RF72 cases.",
                    "label": 0
                },
                {
                    "sent": "And that had a couple of facts.",
                    "label": 0
                },
                {
                    "sent": "Chromium became significant at 1.31 as an answer issue and the odds ratios for the others became slightly higher than they were before.",
                    "label": 0
                },
                {
                    "sent": "In each case.",
                    "label": 0
                },
                {
                    "sent": "And then the final column, and so we've excluded.",
                    "label": 1
                },
                {
                    "sent": "We've still excluded the C9 or F72 cases, but we've also adjusted for physical activity, smoking and alcohol status, and the same for exposures remained significant on the other issues didn't really change very much.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So on this page then we have stratified by gender and you can see that in.",
                    "label": 0
                },
                {
                    "sent": "Metals are magic solvents and benzene remains significant in males only.",
                    "label": 0
                },
                {
                    "sent": "However, the.",
                    "label": 0
                },
                {
                    "sent": "Odds ratios weren't particularly that one's a little bit different, but in general they were close between males and females, and if you look at the number.",
                    "label": 0
                },
                {
                    "sent": "Number of males is higher than in females, so this may be just an effect of power.",
                    "label": 0
                },
                {
                    "sent": "Then we started for education.",
                    "label": 0
                },
                {
                    "sent": "And we found that aromatic solvents, chlorinated solvents and benzene were significant in the in the lower education classification, and this likely reflects that.",
                    "label": 0
                },
                {
                    "sent": "Exposures to people get through.",
                    "label": 0
                },
                {
                    "sent": "Sorry occupationally, linked exposures depending on peoples education originally.",
                    "label": 0
                },
                {
                    "sent": "And finally, then we stratified by sight of onset.",
                    "label": 0
                },
                {
                    "sent": "So in these models we include we compared spinal patients to controls only or Boulder pages to controls.",
                    "label": 0
                },
                {
                    "sent": "So for spinal patients we found that metals and aromatic solvents remains significant.",
                    "label": 0
                },
                {
                    "sent": "Benzie and for the Boulder patients, benzene was actually more significant and metals aromatic solvents were insignificant.",
                    "label": 0
                },
                {
                    "sent": "Although the operations didn't change much.",
                    "label": 0
                },
                {
                    "sent": "So again, that might be an effective power.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this this forest plot here.",
                    "label": 0
                },
                {
                    "sent": "Is generated from a mixed model allowing for heterogeneity by study site.",
                    "label": 1
                },
                {
                    "sent": "The upper graph is for the Aloha metals.",
                    "label": 0
                },
                {
                    "sent": "The middle one is for chromium and the lower one is for nickel, and you can see that there's a similar pattern across all three.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Two sites in northern Italy.",
                    "label": 0
                },
                {
                    "sent": "Lombardy and Piedmont have higher odds ratios than the other sites and actually the overall odds ratios.",
                    "label": 0
                },
                {
                    "sent": "Our heart increased from from the logistic regressions and you can.",
                    "label": 0
                },
                {
                    "sent": "That's what the second table is for, so.",
                    "label": 0
                },
                {
                    "sent": "We have 1.5 four whereas before it was 1.28.",
                    "label": 0
                },
                {
                    "sent": "We now have 1.5 before it was 1.31 and we now have 1.38 for nickel.",
                    "label": 1
                },
                {
                    "sent": "For us we had 1.18 before, so accounting for the heterogeneity and leads to increased estimates.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "When we did the same thing for solvents, however, we didn't see the same pattern.",
                    "label": 0
                },
                {
                    "sent": "So this these two graphs are for automatic solvents on for chlorinated solvents and you can see there more or less in a straight line for all sites.",
                    "label": 1
                },
                {
                    "sent": "And actually, the odds ratios didn't really change much, so if you were comparing 1.19, two, 1.22 and 1.13 to 1.15 from from the previous model, so allowing for heterogeneity didn't really make any difference here.",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we had the same.",
                    "label": 0
                },
                {
                    "sent": "Pattern for the other solvents and benzie.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this begs the question of why we got hydrogen energy for metals but not for solvents.",
                    "label": 1
                },
                {
                    "sent": "Well, there is a higher prevalence of exposure to the metals in the northern Italian sites, and that's true.",
                    "label": 1
                },
                {
                    "sent": "That's determined by the occupations.",
                    "label": 0
                },
                {
                    "sent": "I haven't had a chance to investigate exactly which occupations are linked to that, but that we know that this is true.",
                    "label": 0
                },
                {
                    "sent": "And the other factor consider is that.",
                    "label": 0
                },
                {
                    "sent": "The If you consider the whole cohort of 4479 people, the exposure to ratic solvents and benzene is much higher by 26 percent 25% compared to the metals which 16% for a lower metals and 8% for the chromium.",
                    "label": 0
                },
                {
                    "sent": "And I think it's about 8% for the nickel as well.",
                    "label": 0
                },
                {
                    "sent": "So it might be that the.",
                    "label": 0
                },
                {
                    "sent": "The exposures which are lower across the whole court are more susceptible to statistical noise.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "In conclusion, metals chromium and aromatic solvent exposures are associated with increased odds of a less.",
                    "label": 1
                },
                {
                    "sent": "Undesirables to adjustment for life.",
                    "label": 0
                },
                {
                    "sent": "Tough factors.",
                    "label": 1
                },
                {
                    "sent": "Removing C9 or F-70 patients appears to increase the odds ratios and that's consistent with the multi step theory of a lesser multiple pathways from being healthy to having a less.",
                    "label": 0
                },
                {
                    "sent": "And it implicates exposures in sporadic KLS more so than CNN or F. So 1 take away from this is whether exposure studies in a less may need to be stratified by C9 or F72 status, or perhaps exclude those patients.",
                    "label": 0
                },
                {
                    "sent": "I would think stratifying is more sensible because we have 118 C #72 patients, so I can't say completely that the expose those exposures are not important.",
                    "label": 0
                },
                {
                    "sent": "In those people 'cause it's not really enough.",
                    "label": 0
                },
                {
                    "sent": "But it does seem to be less important.",
                    "label": 0
                },
                {
                    "sent": "And finally, we've heterogeneity by study site for metals, but not solvents.",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'd like to take knowledge, my collaborators, Anne, and particularly role from Universal and and his team and at the Institute for Risk Assessment Scientists Sciences in Utrecht, who helped us with the job exposure matrices for the study.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": []
        }
    }
}