{
    "id": "dxuoemk7y5iwqbmp7rc7agxai74iw6sn",
    "title": "FIDEUS: Innovative logistics for European cities",
    "info": {
        "author": [
            "Peter Sonnabend, DHL Express"
        ],
        "published": "May 21, 2008",
        "recorded": "April 2008",
        "category": [
            "Top->Business->Transportation and Logistics"
        ]
    },
    "url": "http://videolectures.net/tra08_sonnabend_fideus/",
    "segmentation": [
        [
            "Thank you Mike for the introductions of pleasure of introducing you in the remaining time to for those project.",
            "Unlike the other three projects, in fact, for Daves is nearing its conclusion.",
            "If you wonder what the acronym is for its freight, innovative deliveries in European urban space, and as Mike Settings introduction, is taking us straight into the."
        ],
        [
            "Urban domain.",
            "For theirs is reaching black in its early roots to the year 2003, and at that time a group of stakeholders meeting at the initiative of Fraunhofer in fact came to the conclusion that a joint cooperative project ship we set up in order to meet the surge of goods movements in Europe as a whole and specifically into the urban areas.",
            "In the realization that problems that were existing at that time.",
            "With deliveries in the urban domain would certainly grow with the surge of."
        ],
        [
            "Transportation.",
            "If we look how on very general terms, logistics operators trying to cope with the increase of transport demand, it's essentially in trying to achieve an optimum circulation of its assets.",
            "Largely that would be the sizing and selection of vehicles to do a certain job and thus make the best out of the available time of those vehicles and drivers.",
            "And thereby you would arrive at a most efficient scenario operation in terms of cost.",
            "Which of course, being a commercial operation is a predominant but also reducing congestion that is being induced and minimizing the fuel consumption and the associated pollution.",
            "CO2 at that time wasn't quite such a big thing.",
            "Everyone focused more on local pollution, noise emissions.",
            "I think in the end we have to arrive at a solution that will fit all the three together.",
            "However, also we have to realize that the logistics providers are only one instrument.",
            "To solve the issue of increased transportation demand that in fact there are a number of framework parameters that will influence or logistic service providers ability to arrive at the theoretical optimum."
        ],
        [
            "Of his solution.",
            "Which often relevant enough in all the cities across the results in pictures like that and you consentually see them nearly on every work day.",
            "Clogged up streets in inefficient operations.",
            "Lots of regulations, quite sensible and some kind quite nonsense."
        ],
        [
            "This will backfiring in the other.",
            "What are the main problem issues?",
            "The problem issue number one certainly is a lack of dedicated infrastructure.",
            "If you look at a port which has its own problems.",
            "Of course this is a dedicated infrastructure to freight.",
            "If you arrive eventually at the urban domain, you would essentially felt like being Delta current from the bottom of the deck because the infrastructure that you find in cities as far as the road and roadside infrastructure is concerned is entirely driven for passengers.",
            "It leaves very little room for freight for the past 30 years.",
            "We put in bus lanes and tram lanes and metros and everything afraid has not been granted terribly much.",
            "Couple of loading zones perhaps, but then usually you would find them blocked up with next shopkeeper circulation and the sizing of vehicles of course is impaired as well.",
            "Usually where you would try to go with a single truck you may find that the truck has no possibility to move into a narrow historic street, so you verterra van or several vans instead, which again backfires on the vehicle circulation.",
            "Other issues there are regulatory constraints.",
            "You have a lot of delays, of course, from congestion from looking for space to park.",
            "Again, that is unproductive.",
            "Deley where you do nothing to earn your share of delivering shipments as your customers are paying you for.",
            "So again, that Dillet needs to be coped with by introducing extra vehicles which does ones for relieving consistent, which is quite the opposite.",
            "There's no coherent automotive strategy for return to fuels as a set.",
            "Two years back everyone was looking at particulates.",
            "Today it's CO2 2010.",
            "When the new regulations come, it will be an OX.",
            "And every time new strategies are being presented and the last is organization depending on which country you are, 15 to 50% are owner drivers, shopkeepers doing their own deliveries which are not organized in any network whatsoever.",
            "Or."
        ],
        [
            "This meets again.",
            "What are possible answers?",
            "Ones logistics organization?",
            "I won't go too much into detail here.",
            "This is the century center around the issue of urban distribution centers.",
            "This is very well known solutions from the industrial applications.",
            "If you go to big chemical parks, automotive manufacturing plants or airports, in fact you will have a central receiving area and from there you will distribute to several stations in a wider area.",
            "What we see when we take this.",
            "To places like London Heathrow or to Bristol in the UK with DHL Excel, we find that you can save alot up to more than 70% on freight delivery traffic, but it comes of course as a cost.",
            "So really the issue here is more organizational and economic rather than."
        ],
        [
            "Actually technical.",
            "But still, if you have that organization, you still have to cope with the last mile issue.",
            "And this is where for days kicks in.",
            "The point is, how do you reach in an organized fashion?",
            "The actual receiver from whatever transitory Depot you."
        ],
        [
            "We're having and.",
            "This again is where for Daves is coming in for Davis Wars and Express Initiative to bring together the various stakeholders, not just logistics, not just older motive, alter the public authorities and all three together with the help of the academic areas, working towards possible solutions."
        ],
        [
            "So these are the stakeholder partners from the cities from the technology partners, the OEMs, automotive manufacturers, logistics companies and the academics."
        ],
        [
            "Essentially, what for Dave started with was to create a blueprint to guide the stakeholder consultation and how to create logistics scenarios for particular applications, and then using three different types of vehicles from an electric microcarrier through a 3.5 ton van up to a 12 to a medium truck.",
            "We arrived at three implementation scenarios, one for Hanover in Germany, one for Lyon in France and."
        ],
        [
            "For Barcelona in Spain.",
            "To start with Hanover, Hanover essentially focused on parcel distribution using a combination or van and microcarrier and also looking at the."
        ],
        [
            "Effects of second line parking.",
            "So three scenarios were created.",
            "Called urban life and City hub for the operation of a feeder vehicle.",
            "In this case of an parcel van to serve a feeder as a seat as a feeder for the Microcarrier, which would then do the capillary distribution in the target area and the third scenario was second Lane with the effect of on street parking.",
            "For the."
        ],
        [
            "For deliveries.",
            "Looking at the first 2 scenarios, the main issue.",
            "To use the MICROCARRIER was essentially to increase the catchment area that could be served from a place where you stop a feeder vehicle.",
            "Usually if you have a van.",
            "The van will stop.",
            "The driver will get out.",
            "He may have a mechanical sack cart to ferry around 10 or 12 parcels, but he can't go very far because then he's done his deliveries.",
            "He has to come back.",
            "This will be very unproductive if he tries to go away for a longer distance from his parked vehicle.",
            "The MICROCARRIER was specifically designed to give a mechanized support vehicle which would be able to move in sensitive areas like pedestrian zones, historic narrow streets, or otherwise.",
            "Com Darius.",
            "We're offering the capacity and the range to actually advance and thus reduce the number of stops and movement of the feet of eagle.",
            "We use two different types of transit points, one as you see here is essentially a long term parking place that was flagged out by the public administration for the duration of the trial.",
            "This is where the feeder vehicle was parked while the Microcarrier was doing the onward distribution.",
            "The second one this is the city hub case Wars using for the same purpose of stationary building.",
            "In fact, it's an underground car park which is adjacent to the."
        ],
        [
            "Austrian zone of Hanover.",
            "And the scenarios both of them together were operated for three months in full commercial operation.",
            "In the month of August, September and October, this is the urban life scenario in Accompt residential area.",
            "So the only motorized vehicle usually allowed, sorry.",
            "Wrong button.",
            "The only motorized vehicle that you will usually see there is the trim, and you see there is not much space to park a motorized vehicle in the area and the rest of the street is pedestrianised.",
            "We see here the feeder vehicle with preloaded cages in the microcarrier, leaving for the cap."
        ],
        [
            "Larry distribution.",
            "This is the same scenario for the city hub.",
            "This isn't a pedestrian zone of Hanover City Center.",
            "And you see, in fact, one of the conventional vehicles up here and the microcarrier doing delivery to the small shops here, an effect two offices that are sitting in the first and second story, because this is where a lot of small parcels go and these were taken off the van, thus relieving the van from these sort of small scale deliveries.",
            "It's a bit like you don't want to have a trailer truck that takes a lot of pelletized goods to deliver a single parcel.",
            "21 receiver so usually try to divert."
        ],
        [
            "From that operation.",
            "In second line we were looking at the possibilities too.",
            "In fact, avoid second line parking by using a demarked loading zone.",
            "I won't go into too much details here and century.",
            "It came back to the old question of how to enforce the loading zone.",
            "What we saw however, was there is quite an effect and this was calculated by Fraunhofer for the City of Hannover, which is an annual basis leading to something like four and a half 1000 liters of fuel used on top of what usually be used in free flow."
        ],
        [
            "In traffic.",
            "So the overall findings were quite successful on qualitative basis.",
            "We found that the Michael Carey can indeed be one option to provide services to regulated area in the city.",
            "We found also that the CNG van, the natural gas van offered a substantial reduction of noise compared to the normal traffic, and certainly something that might be looked in after something to follow up on for days.",
            "Could be a joint district service using a microcarrier for several small operators that would arrive and dump their load for cross loading at a transit point.",
            "However, there are two major issues.",
            "There are open at this point.",
            "One is that the Microcarrier still needs further design.",
            "It needs some serious industrialization and the other issue is the availability of qualified loading cross loading space as part of the urban space manage."
        ],
        [
            "Just a side trick.",
            "There are several variants right now for the micro carrier you see on the right hand side the two variants that were tested in for days, but what you see on the left on the big picture, this is an operational vehicle that is used in Malaga by DHL, Liberia, so you see there are through different pathways, similar solutions that are working and I think that future probably lies somewhere in."
        ],
        [
            "Between these vehicles, if we look at loading zone enforcement, just let me show you one short.",
            "Aspect of a project called Perfume.",
            "This is part of the life program of DG Environment and last year in November we opened the first environmental loading point for environmentally enhanced vehicles in Bremen.",
            "Essentially what the loading zone does is to detect the occupancy of the loading zone and identify whether it's an authorized vehicle or not by means of an RFID tag.",
            "If it is an authorized vehicle, nothing is happening.",
            "If it's non authorized vehicle.",
            "But for the time being, it's just showing a red light saying you shouldn't be here.",
            "Please go away, but of course you could replace this easily with a communication device calling to the traffic warden to actually come along an issue either of."
        ],
        [
            "I will get that out trucking.",
            "But the other main issue that we looked at Infidels Wars looking at the medium truck again, it was the question on how to serve with an environmentally and ergonomically optimized vehicle controlled area in the city.",
            "And Lyon was focusing on the issue of reducing emissions pollutant emission."
        ],
        [
            "It's in the preparation for an urban environmental zone.",
            "Which is being introduced successively in Lyon.",
            "And Barcelona was looking at night deliveries and so more focused."
        ],
        [
            "Or noise.",
            "In Lyon, specially converted Midland Truck of Renault with special in Capsulation special Ergonomics and Special Structural properties to reuse noise and emissions was being used in quite normal operation."
        ],
        [
            "And so.",
            "Not much logistics issues here, here, see."
        ],
        [
            "The noise test.",
            "And what was found was there was a very good feedback to start with from or about the intense cooperation between the logistics operator and the vehicle manufacturer.",
            "And we think this is normal, but apparently no, everyone appreciated this to be some new ground to be explored together.",
            "We saw some significant noise reductions in what is called the low emission mode.",
            "Also, low noise mode.",
            "What essentially this means is that the engine performance is reduced only allowing a top speed of 45 kilometres, which is however in the circulation in the inner city quite OK for the driver at least that was the finding that we have only young as well.",
            "In Barcelona we didn't really see a big impact on the fuel consumption, but that was a century becausw.",
            "For operational organizational reasons, we had to replace the usually used 7.5 truck that DHL in Lyon is using in the area with a 12 ton truck because we had nothing else which of course increases quite substantially over fuel consumption.",
            "So this was a bit of a constraint that we had in."
        ],
        [
            "Base setup of the scenario.",
            "The same vehicle was then used in Barcelona.",
            "In fact, that was done in March.",
            "Barcelona is operating so called quiet Night Delivery program where they issue exam permits for otherwise forbidden deliveries during the night time.",
            "These tests were not number DHL, but by the supermarket chain Candis, and in fact it was originally conceived only to regard night deliveries, but it's the test was also."
        ],
        [
            "Send it today deliveries.",
            "So the vehicle essentially worked round the Clock in supermarket deliveries, cage material coming from a terminal from Candis on the outskirts of Barcelona and then going into the residential area in the nighttime scenarios, the low Noise mode which carries the engine reduction was only used in the very terminal area of the itinerary, which means when the vehicle entered their highly residential area where the supermarket is located and then doing the night delivery, the day deliveries were actually done with a low noise mode.",
            "Active all the way along all the speed limits.",
            "Thirty 5080 kilometres, bearing in mind of course, at the top speed in low Noise mode is not exceeding 50 kilometres, so we were looking at the various effects there and the evaluation there is not quite concluded.",
            "We will again using like in Lyon, a telematics platform to do determine the excess of regulated area and then because of the.",
            "Some issues with the ultimate with a full automation essentially inform the driver to switch into the low noise respectively lower."
        ],
        [
            "Mission mode.",
            "Again, here you see some.",
            "Impressions"
        ],
        [
            "On the trial in March.",
            "So the findings, again very positive about the cooperation between the operator and the OEM.",
            "We saw again a very considerable reduction of noise, but of course.",
            "So this also carries some some interesting positive side effects, but the point especially for the night deliveries, and this was something that confirms similar findings from the peak program in the Netherlands was in fact it's not just the vehicle you have to have the balance between the vehicle, noise, equipment, noise and the driver behavior.",
            "Noisy old roll cages that clatter on a ramp shut their doors going up and down, drivers banging doors up.",
            "Being indoors or turning up the radio, this does not really add to sound operations, so we can waste a lot of money on a very silent truck if you don't educate the driver.",
            "If you work with shoddy equipment then you won't go anywhere far.",
            "You will still be a nuisance to people around you.",
            "But on the whole, in fact, especially for the night delivery, Barcelona was seeing a confirmation that in fact efficiency can be substantially increased by using off peak deliveries at least to certain specialized."
        ],
        [
            "Actors.",
            "One thing that was in common to all the three sites was a very very good public perception.",
            "So we really got an enormously will enormously good feedback from century all parties that were confronted with the with the trials, residents, retailers, the press, politicians.",
            "Once we went out in the street, there were TV crews and press crews all over the place.",
            "Our driver in Hanover was spending about.",
            "As much time explaining the the trials as he did, delivering the partials and you see we had a number of TV and press coverage is, I think this one actually was the most important one Evening News on TF1, the French Premier first channel, and that, I believe, was seen by something like 10 or 11 million people."
        ],
        [
            "So in fact, the stakeholder cooperation that made for those possible.",
            "I think that was the thing that has to be considered the biggest asset.",
            "And the biggest challenge, because it takes a lot of lead time.",
            "Each of the scenarios, at least of one year of intensive preparation between stakeholders first to warm up to the subject.",
            "Secondly, to concert the interest and bring those together and then in the end arrive at a working solution.",
            "And it's not the solution in its own right, but it's a start towards.",
            "Local solutions for globalizing business and I thank you for your attention.",
            "If there's any questions back to you, Mike."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you Mike for the introductions of pleasure of introducing you in the remaining time to for those project.",
                    "label": 0
                },
                {
                    "sent": "Unlike the other three projects, in fact, for Daves is nearing its conclusion.",
                    "label": 0
                },
                {
                    "sent": "If you wonder what the acronym is for its freight, innovative deliveries in European urban space, and as Mike Settings introduction, is taking us straight into the.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Urban domain.",
                    "label": 0
                },
                {
                    "sent": "For theirs is reaching black in its early roots to the year 2003, and at that time a group of stakeholders meeting at the initiative of Fraunhofer in fact came to the conclusion that a joint cooperative project ship we set up in order to meet the surge of goods movements in Europe as a whole and specifically into the urban areas.",
                    "label": 0
                },
                {
                    "sent": "In the realization that problems that were existing at that time.",
                    "label": 0
                },
                {
                    "sent": "With deliveries in the urban domain would certainly grow with the surge of.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Transportation.",
                    "label": 0
                },
                {
                    "sent": "If we look how on very general terms, logistics operators trying to cope with the increase of transport demand, it's essentially in trying to achieve an optimum circulation of its assets.",
                    "label": 0
                },
                {
                    "sent": "Largely that would be the sizing and selection of vehicles to do a certain job and thus make the best out of the available time of those vehicles and drivers.",
                    "label": 1
                },
                {
                    "sent": "And thereby you would arrive at a most efficient scenario operation in terms of cost.",
                    "label": 1
                },
                {
                    "sent": "Which of course, being a commercial operation is a predominant but also reducing congestion that is being induced and minimizing the fuel consumption and the associated pollution.",
                    "label": 0
                },
                {
                    "sent": "CO2 at that time wasn't quite such a big thing.",
                    "label": 0
                },
                {
                    "sent": "Everyone focused more on local pollution, noise emissions.",
                    "label": 0
                },
                {
                    "sent": "I think in the end we have to arrive at a solution that will fit all the three together.",
                    "label": 0
                },
                {
                    "sent": "However, also we have to realize that the logistics providers are only one instrument.",
                    "label": 1
                },
                {
                    "sent": "To solve the issue of increased transportation demand that in fact there are a number of framework parameters that will influence or logistic service providers ability to arrive at the theoretical optimum.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of his solution.",
                    "label": 0
                },
                {
                    "sent": "Which often relevant enough in all the cities across the results in pictures like that and you consentually see them nearly on every work day.",
                    "label": 0
                },
                {
                    "sent": "Clogged up streets in inefficient operations.",
                    "label": 0
                },
                {
                    "sent": "Lots of regulations, quite sensible and some kind quite nonsense.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This will backfiring in the other.",
                    "label": 0
                },
                {
                    "sent": "What are the main problem issues?",
                    "label": 1
                },
                {
                    "sent": "The problem issue number one certainly is a lack of dedicated infrastructure.",
                    "label": 1
                },
                {
                    "sent": "If you look at a port which has its own problems.",
                    "label": 0
                },
                {
                    "sent": "Of course this is a dedicated infrastructure to freight.",
                    "label": 1
                },
                {
                    "sent": "If you arrive eventually at the urban domain, you would essentially felt like being Delta current from the bottom of the deck because the infrastructure that you find in cities as far as the road and roadside infrastructure is concerned is entirely driven for passengers.",
                    "label": 0
                },
                {
                    "sent": "It leaves very little room for freight for the past 30 years.",
                    "label": 0
                },
                {
                    "sent": "We put in bus lanes and tram lanes and metros and everything afraid has not been granted terribly much.",
                    "label": 0
                },
                {
                    "sent": "Couple of loading zones perhaps, but then usually you would find them blocked up with next shopkeeper circulation and the sizing of vehicles of course is impaired as well.",
                    "label": 1
                },
                {
                    "sent": "Usually where you would try to go with a single truck you may find that the truck has no possibility to move into a narrow historic street, so you verterra van or several vans instead, which again backfires on the vehicle circulation.",
                    "label": 0
                },
                {
                    "sent": "Other issues there are regulatory constraints.",
                    "label": 0
                },
                {
                    "sent": "You have a lot of delays, of course, from congestion from looking for space to park.",
                    "label": 0
                },
                {
                    "sent": "Again, that is unproductive.",
                    "label": 0
                },
                {
                    "sent": "Deley where you do nothing to earn your share of delivering shipments as your customers are paying you for.",
                    "label": 1
                },
                {
                    "sent": "So again, that Dillet needs to be coped with by introducing extra vehicles which does ones for relieving consistent, which is quite the opposite.",
                    "label": 0
                },
                {
                    "sent": "There's no coherent automotive strategy for return to fuels as a set.",
                    "label": 0
                },
                {
                    "sent": "Two years back everyone was looking at particulates.",
                    "label": 0
                },
                {
                    "sent": "Today it's CO2 2010.",
                    "label": 0
                },
                {
                    "sent": "When the new regulations come, it will be an OX.",
                    "label": 0
                },
                {
                    "sent": "And every time new strategies are being presented and the last is organization depending on which country you are, 15 to 50% are owner drivers, shopkeepers doing their own deliveries which are not organized in any network whatsoever.",
                    "label": 0
                },
                {
                    "sent": "Or.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This meets again.",
                    "label": 0
                },
                {
                    "sent": "What are possible answers?",
                    "label": 0
                },
                {
                    "sent": "Ones logistics organization?",
                    "label": 0
                },
                {
                    "sent": "I won't go too much into detail here.",
                    "label": 0
                },
                {
                    "sent": "This is the century center around the issue of urban distribution centers.",
                    "label": 0
                },
                {
                    "sent": "This is very well known solutions from the industrial applications.",
                    "label": 0
                },
                {
                    "sent": "If you go to big chemical parks, automotive manufacturing plants or airports, in fact you will have a central receiving area and from there you will distribute to several stations in a wider area.",
                    "label": 1
                },
                {
                    "sent": "What we see when we take this.",
                    "label": 1
                },
                {
                    "sent": "To places like London Heathrow or to Bristol in the UK with DHL Excel, we find that you can save alot up to more than 70% on freight delivery traffic, but it comes of course as a cost.",
                    "label": 0
                },
                {
                    "sent": "So really the issue here is more organizational and economic rather than.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually technical.",
                    "label": 0
                },
                {
                    "sent": "But still, if you have that organization, you still have to cope with the last mile issue.",
                    "label": 0
                },
                {
                    "sent": "And this is where for days kicks in.",
                    "label": 0
                },
                {
                    "sent": "The point is, how do you reach in an organized fashion?",
                    "label": 0
                },
                {
                    "sent": "The actual receiver from whatever transitory Depot you.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We're having and.",
                    "label": 0
                },
                {
                    "sent": "This again is where for Daves is coming in for Davis Wars and Express Initiative to bring together the various stakeholders, not just logistics, not just older motive, alter the public authorities and all three together with the help of the academic areas, working towards possible solutions.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So these are the stakeholder partners from the cities from the technology partners, the OEMs, automotive manufacturers, logistics companies and the academics.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Essentially, what for Dave started with was to create a blueprint to guide the stakeholder consultation and how to create logistics scenarios for particular applications, and then using three different types of vehicles from an electric microcarrier through a 3.5 ton van up to a 12 to a medium truck.",
                    "label": 0
                },
                {
                    "sent": "We arrived at three implementation scenarios, one for Hanover in Germany, one for Lyon in France and.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For Barcelona in Spain.",
                    "label": 0
                },
                {
                    "sent": "To start with Hanover, Hanover essentially focused on parcel distribution using a combination or van and microcarrier and also looking at the.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Effects of second line parking.",
                    "label": 0
                },
                {
                    "sent": "So three scenarios were created.",
                    "label": 0
                },
                {
                    "sent": "Called urban life and City hub for the operation of a feeder vehicle.",
                    "label": 1
                },
                {
                    "sent": "In this case of an parcel van to serve a feeder as a seat as a feeder for the Microcarrier, which would then do the capillary distribution in the target area and the third scenario was second Lane with the effect of on street parking.",
                    "label": 1
                },
                {
                    "sent": "For the.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For deliveries.",
                    "label": 0
                },
                {
                    "sent": "Looking at the first 2 scenarios, the main issue.",
                    "label": 0
                },
                {
                    "sent": "To use the MICROCARRIER was essentially to increase the catchment area that could be served from a place where you stop a feeder vehicle.",
                    "label": 0
                },
                {
                    "sent": "Usually if you have a van.",
                    "label": 0
                },
                {
                    "sent": "The van will stop.",
                    "label": 0
                },
                {
                    "sent": "The driver will get out.",
                    "label": 0
                },
                {
                    "sent": "He may have a mechanical sack cart to ferry around 10 or 12 parcels, but he can't go very far because then he's done his deliveries.",
                    "label": 0
                },
                {
                    "sent": "He has to come back.",
                    "label": 0
                },
                {
                    "sent": "This will be very unproductive if he tries to go away for a longer distance from his parked vehicle.",
                    "label": 0
                },
                {
                    "sent": "The MICROCARRIER was specifically designed to give a mechanized support vehicle which would be able to move in sensitive areas like pedestrian zones, historic narrow streets, or otherwise.",
                    "label": 0
                },
                {
                    "sent": "Com Darius.",
                    "label": 0
                },
                {
                    "sent": "We're offering the capacity and the range to actually advance and thus reduce the number of stops and movement of the feet of eagle.",
                    "label": 0
                },
                {
                    "sent": "We use two different types of transit points, one as you see here is essentially a long term parking place that was flagged out by the public administration for the duration of the trial.",
                    "label": 0
                },
                {
                    "sent": "This is where the feeder vehicle was parked while the Microcarrier was doing the onward distribution.",
                    "label": 0
                },
                {
                    "sent": "The second one this is the city hub case Wars using for the same purpose of stationary building.",
                    "label": 0
                },
                {
                    "sent": "In fact, it's an underground car park which is adjacent to the.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Austrian zone of Hanover.",
                    "label": 0
                },
                {
                    "sent": "And the scenarios both of them together were operated for three months in full commercial operation.",
                    "label": 0
                },
                {
                    "sent": "In the month of August, September and October, this is the urban life scenario in Accompt residential area.",
                    "label": 1
                },
                {
                    "sent": "So the only motorized vehicle usually allowed, sorry.",
                    "label": 0
                },
                {
                    "sent": "Wrong button.",
                    "label": 0
                },
                {
                    "sent": "The only motorized vehicle that you will usually see there is the trim, and you see there is not much space to park a motorized vehicle in the area and the rest of the street is pedestrianised.",
                    "label": 0
                },
                {
                    "sent": "We see here the feeder vehicle with preloaded cages in the microcarrier, leaving for the cap.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Larry distribution.",
                    "label": 0
                },
                {
                    "sent": "This is the same scenario for the city hub.",
                    "label": 1
                },
                {
                    "sent": "This isn't a pedestrian zone of Hanover City Center.",
                    "label": 0
                },
                {
                    "sent": "And you see, in fact, one of the conventional vehicles up here and the microcarrier doing delivery to the small shops here, an effect two offices that are sitting in the first and second story, because this is where a lot of small parcels go and these were taken off the van, thus relieving the van from these sort of small scale deliveries.",
                    "label": 0
                },
                {
                    "sent": "It's a bit like you don't want to have a trailer truck that takes a lot of pelletized goods to deliver a single parcel.",
                    "label": 0
                },
                {
                    "sent": "21 receiver so usually try to divert.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From that operation.",
                    "label": 0
                },
                {
                    "sent": "In second line we were looking at the possibilities too.",
                    "label": 0
                },
                {
                    "sent": "In fact, avoid second line parking by using a demarked loading zone.",
                    "label": 0
                },
                {
                    "sent": "I won't go into too much details here and century.",
                    "label": 0
                },
                {
                    "sent": "It came back to the old question of how to enforce the loading zone.",
                    "label": 0
                },
                {
                    "sent": "What we saw however, was there is quite an effect and this was calculated by Fraunhofer for the City of Hannover, which is an annual basis leading to something like four and a half 1000 liters of fuel used on top of what usually be used in free flow.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In traffic.",
                    "label": 0
                },
                {
                    "sent": "So the overall findings were quite successful on qualitative basis.",
                    "label": 0
                },
                {
                    "sent": "We found that the Michael Carey can indeed be one option to provide services to regulated area in the city.",
                    "label": 0
                },
                {
                    "sent": "We found also that the CNG van, the natural gas van offered a substantial reduction of noise compared to the normal traffic, and certainly something that might be looked in after something to follow up on for days.",
                    "label": 1
                },
                {
                    "sent": "Could be a joint district service using a microcarrier for several small operators that would arrive and dump their load for cross loading at a transit point.",
                    "label": 0
                },
                {
                    "sent": "However, there are two major issues.",
                    "label": 0
                },
                {
                    "sent": "There are open at this point.",
                    "label": 1
                },
                {
                    "sent": "One is that the Microcarrier still needs further design.",
                    "label": 1
                },
                {
                    "sent": "It needs some serious industrialization and the other issue is the availability of qualified loading cross loading space as part of the urban space manage.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just a side trick.",
                    "label": 0
                },
                {
                    "sent": "There are several variants right now for the micro carrier you see on the right hand side the two variants that were tested in for days, but what you see on the left on the big picture, this is an operational vehicle that is used in Malaga by DHL, Liberia, so you see there are through different pathways, similar solutions that are working and I think that future probably lies somewhere in.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Between these vehicles, if we look at loading zone enforcement, just let me show you one short.",
                    "label": 1
                },
                {
                    "sent": "Aspect of a project called Perfume.",
                    "label": 0
                },
                {
                    "sent": "This is part of the life program of DG Environment and last year in November we opened the first environmental loading point for environmentally enhanced vehicles in Bremen.",
                    "label": 0
                },
                {
                    "sent": "Essentially what the loading zone does is to detect the occupancy of the loading zone and identify whether it's an authorized vehicle or not by means of an RFID tag.",
                    "label": 0
                },
                {
                    "sent": "If it is an authorized vehicle, nothing is happening.",
                    "label": 0
                },
                {
                    "sent": "If it's non authorized vehicle.",
                    "label": 0
                },
                {
                    "sent": "But for the time being, it's just showing a red light saying you shouldn't be here.",
                    "label": 0
                },
                {
                    "sent": "Please go away, but of course you could replace this easily with a communication device calling to the traffic warden to actually come along an issue either of.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will get that out trucking.",
                    "label": 0
                },
                {
                    "sent": "But the other main issue that we looked at Infidels Wars looking at the medium truck again, it was the question on how to serve with an environmentally and ergonomically optimized vehicle controlled area in the city.",
                    "label": 0
                },
                {
                    "sent": "And Lyon was focusing on the issue of reducing emissions pollutant emission.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's in the preparation for an urban environmental zone.",
                    "label": 0
                },
                {
                    "sent": "Which is being introduced successively in Lyon.",
                    "label": 0
                },
                {
                    "sent": "And Barcelona was looking at night deliveries and so more focused.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or noise.",
                    "label": 0
                },
                {
                    "sent": "In Lyon, specially converted Midland Truck of Renault with special in Capsulation special Ergonomics and Special Structural properties to reuse noise and emissions was being used in quite normal operation.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so.",
                    "label": 0
                },
                {
                    "sent": "Not much logistics issues here, here, see.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The noise test.",
                    "label": 0
                },
                {
                    "sent": "And what was found was there was a very good feedback to start with from or about the intense cooperation between the logistics operator and the vehicle manufacturer.",
                    "label": 0
                },
                {
                    "sent": "And we think this is normal, but apparently no, everyone appreciated this to be some new ground to be explored together.",
                    "label": 0
                },
                {
                    "sent": "We saw some significant noise reductions in what is called the low emission mode.",
                    "label": 1
                },
                {
                    "sent": "Also, low noise mode.",
                    "label": 0
                },
                {
                    "sent": "What essentially this means is that the engine performance is reduced only allowing a top speed of 45 kilometres, which is however in the circulation in the inner city quite OK for the driver at least that was the finding that we have only young as well.",
                    "label": 1
                },
                {
                    "sent": "In Barcelona we didn't really see a big impact on the fuel consumption, but that was a century becausw.",
                    "label": 0
                },
                {
                    "sent": "For operational organizational reasons, we had to replace the usually used 7.5 truck that DHL in Lyon is using in the area with a 12 ton truck because we had nothing else which of course increases quite substantially over fuel consumption.",
                    "label": 1
                },
                {
                    "sent": "So this was a bit of a constraint that we had in.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Base setup of the scenario.",
                    "label": 0
                },
                {
                    "sent": "The same vehicle was then used in Barcelona.",
                    "label": 0
                },
                {
                    "sent": "In fact, that was done in March.",
                    "label": 0
                },
                {
                    "sent": "Barcelona is operating so called quiet Night Delivery program where they issue exam permits for otherwise forbidden deliveries during the night time.",
                    "label": 0
                },
                {
                    "sent": "These tests were not number DHL, but by the supermarket chain Candis, and in fact it was originally conceived only to regard night deliveries, but it's the test was also.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Send it today deliveries.",
                    "label": 0
                },
                {
                    "sent": "So the vehicle essentially worked round the Clock in supermarket deliveries, cage material coming from a terminal from Candis on the outskirts of Barcelona and then going into the residential area in the nighttime scenarios, the low Noise mode which carries the engine reduction was only used in the very terminal area of the itinerary, which means when the vehicle entered their highly residential area where the supermarket is located and then doing the night delivery, the day deliveries were actually done with a low noise mode.",
                    "label": 0
                },
                {
                    "sent": "Active all the way along all the speed limits.",
                    "label": 1
                },
                {
                    "sent": "Thirty 5080 kilometres, bearing in mind of course, at the top speed in low Noise mode is not exceeding 50 kilometres, so we were looking at the various effects there and the evaluation there is not quite concluded.",
                    "label": 1
                },
                {
                    "sent": "We will again using like in Lyon, a telematics platform to do determine the excess of regulated area and then because of the.",
                    "label": 0
                },
                {
                    "sent": "Some issues with the ultimate with a full automation essentially inform the driver to switch into the low noise respectively lower.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mission mode.",
                    "label": 0
                },
                {
                    "sent": "Again, here you see some.",
                    "label": 0
                },
                {
                    "sent": "Impressions",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the trial in March.",
                    "label": 0
                },
                {
                    "sent": "So the findings, again very positive about the cooperation between the operator and the OEM.",
                    "label": 0
                },
                {
                    "sent": "We saw again a very considerable reduction of noise, but of course.",
                    "label": 0
                },
                {
                    "sent": "So this also carries some some interesting positive side effects, but the point especially for the night deliveries, and this was something that confirms similar findings from the peak program in the Netherlands was in fact it's not just the vehicle you have to have the balance between the vehicle, noise, equipment, noise and the driver behavior.",
                    "label": 0
                },
                {
                    "sent": "Noisy old roll cages that clatter on a ramp shut their doors going up and down, drivers banging doors up.",
                    "label": 0
                },
                {
                    "sent": "Being indoors or turning up the radio, this does not really add to sound operations, so we can waste a lot of money on a very silent truck if you don't educate the driver.",
                    "label": 0
                },
                {
                    "sent": "If you work with shoddy equipment then you won't go anywhere far.",
                    "label": 0
                },
                {
                    "sent": "You will still be a nuisance to people around you.",
                    "label": 0
                },
                {
                    "sent": "But on the whole, in fact, especially for the night delivery, Barcelona was seeing a confirmation that in fact efficiency can be substantially increased by using off peak deliveries at least to certain specialized.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Actors.",
                    "label": 0
                },
                {
                    "sent": "One thing that was in common to all the three sites was a very very good public perception.",
                    "label": 1
                },
                {
                    "sent": "So we really got an enormously will enormously good feedback from century all parties that were confronted with the with the trials, residents, retailers, the press, politicians.",
                    "label": 0
                },
                {
                    "sent": "Once we went out in the street, there were TV crews and press crews all over the place.",
                    "label": 0
                },
                {
                    "sent": "Our driver in Hanover was spending about.",
                    "label": 0
                },
                {
                    "sent": "As much time explaining the the trials as he did, delivering the partials and you see we had a number of TV and press coverage is, I think this one actually was the most important one Evening News on TF1, the French Premier first channel, and that, I believe, was seen by something like 10 or 11 million people.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in fact, the stakeholder cooperation that made for those possible.",
                    "label": 0
                },
                {
                    "sent": "I think that was the thing that has to be considered the biggest asset.",
                    "label": 0
                },
                {
                    "sent": "And the biggest challenge, because it takes a lot of lead time.",
                    "label": 0
                },
                {
                    "sent": "Each of the scenarios, at least of one year of intensive preparation between stakeholders first to warm up to the subject.",
                    "label": 0
                },
                {
                    "sent": "Secondly, to concert the interest and bring those together and then in the end arrive at a working solution.",
                    "label": 0
                },
                {
                    "sent": "And it's not the solution in its own right, but it's a start towards.",
                    "label": 0
                },
                {
                    "sent": "Local solutions for globalizing business and I thank you for your attention.",
                    "label": 1
                },
                {
                    "sent": "If there's any questions back to you, Mike.",
                    "label": 0
                }
            ]
        }
    }
}