{
    "id": "dy7zv5jh6iv4752mv2mtcrsmftsb7o3y",
    "title": "The Semantic Web: Suppliers and Customers",
    "info": {
        "author": [
            "Rudi Studer, Institute of Applied Informatics and Formal Description Methods (AIFB), Karlsruhe Institute of Technology (KIT)"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "November 2006",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc06_studer_sc/",
    "segmentation": [
        [
            "OK, thank you Stephen for that nice introduction.",
            "It's really a pleasure for me to give that invited talk this morning here, and I appreciate that all of you are already here in spite of all these nice dinners, drinks and whatever was offered last evening.",
            "So the basic idea behind my talk is semantic web customers and suppliers to investigate the kind of interdisciplinary work that is going on in the semantic web community.",
            "And when I talk about customers, I refer to disciplines that might take profit from some of the developments that are going on in the semantic web community.",
            "And when I talk about suppliers, I refer to disciplines that might provide valuable input for our community.",
            "So that is the basic idea of by refering to that notion of customers and suppliers and also rather at the end of my talk.",
            "I will also move a little bit into the business area.",
            "And there again, you talk about custom."
        ],
        [
            "Suppliers, well, let's have a prefer look back into the history of our conference.",
            "Here is maybe some of you had been involved in the discussions we had in 2001 during the Stanford Symposium to establish that series of international semantic web conferences.",
            "And when we now look back here in 2006, in essence, what had happened during the last five years?",
            "I think that initial idea of building up a large community, establishing that community on an international basis to test really been achieved in a very convincing way.",
            "So we now have our international segment Web conference with a stable number of submissions higher than 200 submissions.",
            "We get every year.",
            "Attendance is more or less stabilizing around 500 people, independent in which part of the world we meet.",
            "Meeting the end and also the structure of the program with workshop tutorials.",
            "Top Dollar Symposium is now well established.",
            "Kind of structural conference, so I think we have really made a big step in the last five years to build up that kind of."
        ],
        [
            "Community, so when we start about that notion of connecting communities and we start from the basic point of view, then the question is, well, what kind of activities had been going on in our community to establish somehow connections to other communities?",
            "Well, in 2002 we had that tutorial on Description logic that was our first conference.",
            "Then we had workshops addressing database aspects like scalable semantic systems or.",
            "We had workshops about human language technology.",
            "We had sessions about our web mining, so that's the reference to the machine learning community and for example, last year we started that workshop establishing that connection to the software engineering community.",
            "And when you look into the communities that are referenced here that also then define the scope of my talk.",
            "So I will talk about the knowledge representation Community database, people, natural language processing, machine learning and also the software engineering community."
        ],
        [
            "Well, that is then the trend of my talk to them.",
            "I will start by having a brief look into the other communities in the top events they are organizing to which extend to their show up.",
            "Some semantic web topics in the end and then the main part of my talk will discuss that customer and supplier relationship between the semantic web community on the one hand and these other communities, knowledge, representation databases, software engineering.",
            "Natural language processing and machine learning.",
            "At the end of my talk, I will briefly at ran some business aspects from my point of view and then I will conclude with some tickle messages and some statements about trains.",
            "I currently see going on in our in our area.",
            "OK, so let's have a brief look at what's going on in other commune."
        ],
        [
            "It is when we start with the knowledge representation community.",
            "While I have chosen here 20 events from that community that I take as representative for the knowledge representation Community, each conference in KR conference and then you see a lot of activities going on in these conferences that are closely related to what's going on in our community.",
            "That's really no surprise given that tight relationship between some KR aspects and some semantic web community aspects.",
            "So you find all kind of activities, workshops invited talks to toilets.",
            "For example, at KR this year, you'll find the talk by Alan Halevi about data spaces, and I will come back to it onto that notion of data spaces in the end.",
            "So what I would say is a very brief characteristic.",
            "There's some synergetic cooperation going on between these two."
        ],
        [
            "Yeah it is.",
            "When we move into the database area then it's clear to which conferences you make reference.",
            "In the end, VLDB, SIGMOD pods that are these three events you really talk about in the database community, and again you see when you talk about workshops, invited talk tutorials that they are.",
            "Several events showing up that relate these database community to aspects of semantics, structuring principles, semantic weapon, databases in that kind of stuff.",
            "So there had been rather large series of workshops and events going on in these communities, and therefore we could say, well, somehow the database community is knowledgeable about what's going on in our community.",
            "However, when you really go into the technical program.",
            "He lets it model.",
            "It will be you will not find too many technical presentations that are really addressing these notions of semantics in the end."
        ],
        [
            "When we take here as a 1 shared community and machine learning natural language processing represented by these conferences like computational linguistics.",
            "Then you see that again.",
            "Some of these ontology knows and show up in workshops and tutorials that have been organized rather recently.",
            "So there is a rather new development both in the computational linguistic area and in the machine learning area.",
            "So we could say about somehow the natural language processing community and the machine learning communities are informed about what's going on in our in our community."
        ],
        [
            "Here.",
            "And finally, when we move on to the software engineering community, while there is clear one top conference there, the International Conference in software engineering, there you'll find very few elements that really relate our community to the cement to the software engineering community.",
            "So there was the tutorial two years ago and that kind of stuff.",
            "But when you then look into the technical program of Excel, you really do not find any semantics there.",
            "There's the other conference.",
            "Software engineering and knowledge engineering.",
            "Obviously they talk a lot about ontologies and related topics.",
            "But when you talk to software engineering people they would not qualify.",
            "Seeking is a top level event, so one has to be aware of what's the impact of these kind of conferences in the overall community in the end.",
            "So we could say about they are somehow aware of what's going on there, but there is not too much interaction currently going on in these technical events."
        ],
        [
            "OK, when I then come to that notion of customers and suppliers, when I will address the notion of customers, I will talk about what our semantic web research contributes to other communities.",
            "And as you see, these notions of Asterix and operates to illustrate that somehow with me, then talk about suppliers we will address the question well.",
            "What are other communities delivering to our semantic web community?",
            "And refering to aswegen obelisks should somehow illustrate that there are two characters that cooperate in a very nice way with each other that have each their own strengths and weaknesses.",
            "But in the end they cooperate to come up with innovative solutions to solve the problems they have attended.",
            "And that is the kind of topic I want.",
            "Like I would like to address today.",
            "What kind of synergy is be able to be generated by having these different kind of communities?"
        ],
        [
            "Operating with each other.",
            "OK, let's come to the main part of my talk.",
            "That is the discussion about that customer supplier relationship with respect to these different kind of communities.",
            "So I will start with the knowledge representation community and then move on to databases, software engineering, natural language processing and machine learning.",
            "So that will be the sequence of topics I will address in the end."
        ],
        [
            "But I always will do in the very beginning.",
            "Is making some kind of elevator pitch, so Asterix and Obelisk's meet in the elevator, and they talk about what they can contribute with respect to the other community in the end.",
            "Really, this kind of statements are always somehow simplifying with respect to all the different aspects that are really relevant when you talk about that kind of cooperation.",
            "But the idea is to make some very clear statement about the strength of the different communities and what they might contribute to the other community.",
            "So, but Astrex might say when he meets Oblix in the elevator is well we establish ontology language.",
            "He is for knowledge, for presentation on the web.",
            "There are two issues are involved in that kind of statement.",
            "We talk about large scale applications because we talk about applications based on the Web and 2nd we refer to the website we addressed that web notion that has to be included in these kind of representation languages.",
            "When we talk about ontologies.",
            "In the end, on the other hand, when we refer to the knowledge representation community well objects could say well we have a very long history in defining.",
            "A well defined knowledge, presentation paradigms and also come up with specific and hopefully efficient deduction algorithms in order to support the kind of influencing that is then being enabled by these kind of knowledge representation paradigms."
        ],
        [
            "Keeping me now go into some more detail with respect to the customer and later on with respect to that supplier relationship that start first with that customer relationship.",
            "But we could see what is an added value that the semantic web community is currently playing to the knowledge representation community.",
            "Well, I would say that is the kind of challenges that are defined in our semantic web communities by these real life applications that are really somehow different to the kind of illustrating examples that had for a long time being used in the knowledge representation community.",
            "Buy used somehow.",
            "Treaty examples and similar examples to show the the edit value of a new formalism or of a new detection algorithms, but you did not really address very often real life challenges in order to show the edit value of your of your approach.",
            "So I think that is really a strong impact.",
            "The semantic web community could make to the knowledge representation community.",
            "Maybe some of you attended last year's conference in Galway.",
            "Other nice talk of Carol talking about E science application so that are the kind of real life applications I have in mind that deliver new problems to the KR community and we are then the ad community can also show how they solve these real life problems by their knives.",
            "New approaches in that context."
        ],
        [
            "Second aspect I would like to mention is related to all these standardization processes that are initiated from the semantic web community.",
            "Are the F out currently the referrer working group again, that is, from my point of view.",
            "Speak step compared to what we have done in the past, so some of you had maybe already involved 20 years ago in all these expert systems developments building up expert systems by exploiting specific kind of formalisms that have then been used to build up one specific kind of application.",
            "And they both know was no chance to talk about later about integrating these applications, exchanging part of knowledge bases between these different kind of our expert systems.",
            "So that is for me also a big step forward in order to compare the situation we have currently with respect to the situation we had 20 years ago when we talked about these expert systems environment."
        ],
        [
            "When we switch to view and I'll talk about knowledge representation as some kind of supplier.",
            "Well then you'll see that in the knowledge representation community there is a lot of interesting work going on.",
            "For example, suspect to defining tractable language fragments that covers precisely defined formal properties, but you really know how to implement efficient algorithms to do reasoning in that context.",
            "We also see were going on other suspect to handling uncertainty and inconsistency and these kind of aspects really and these kind of areas like uncertainty, handling or inconsistency handling.",
            "They still the open issue of scalability.",
            "So can we really come up with approaches that scale up to the kind of applications we are currently talking about in the in the semantic web community?",
            "When we.",
            "Specifically, refer to representation formalisms and reasoning algorithms, where currently you all know we have these two main knowledge presentation paradigms being discussed in our community.",
            "On the one hand, description logic paradigm represented by these family of our language, he is where we have these different kind of systems like factories, appellate Kian, tool that are all well known in our community in order to.",
            "I support reasoning in a description logic context.",
            "Then we have that second paradigm coming from the logic programming area where you also have systems like for example under programs supporting that kind of reasoning, and you all know that we had rather political discussions in the last years about what might be the best knowledge representation paradigm.",
            "That discussion was unfortunately somehow to some extent more political than really technically based, so that you make claims, well, my own.",
            "Homeless Mr Best one and the other one is not really that suitable an what I'm really happy about is to see rather recent developments that get rid of that more political discussion.",
            "Really come back to the more technical investigations and research related to that in order to really investigate how can we bring together these two knowledge representation paradigms and maybe take profit of the strength on the one hand, what we have available.",
            "By relying on description logic and on the other hand, what we have available by relying on that notion of logic programming tries to illustrate one aspect of how to improve the situation with respect to integrating description, logic and logic program."
        ],
        [
            "I would like to refer to one recent work done by Boris and his colleagues about how to integrate Description logic and logic programming so we all know description logic is rather strong at representing taxonomical knowledge, but strong with respect to handling some notions of incomplete knowledge.",
            "By exploiting these existentially quantified formula in the end.",
            "But we also know that they are these obvious limits.",
            "What you can do in the context of a description logics.",
            "So there are this limit.",
            "What kind of relationships are you able to really represent there?",
            "That famous Uncle relationship is always used to illustrate these kind of limitations or you would also like to be able to somehow represent constraints that are well known from our database community area.",
            "And when you then look into some strains that are provided by the logic programming area, as you can see, some of these problems are rather nicely handled by that kind of knowledge representation program and therefore there is that ongoing.",
            "Development going on on how to better combine to some extent.",
            "Clearly with some limitations.",
            "These two worlds and one proposal there is talking about these hybrid minimal knowledge negation as failure knowledge bases where you have some parts being represented as a DL knowledge base.",
            "Some parts represented as a logic program.",
            "But you still be compatible with both the notions that have been defined for suspected semantics with a DL and a logic programming world, but well, you then can in the end and take profit of the strength of the DL world for some aspects and take profit of the strength of the logic programming world.",
            "On the other hand, and I think that is really the kind of development we need in our community that we really bring together the strength of different kinds of approaches.",
            "And see to which extent we can integrate them in order to come up with better solutions in the end.",
            "So hopefully we will make further progress in that kind of integration activities."
        ],
        [
            "OK, let's move to the second aspect.",
            "I would like to address the interaction between the database community and our semantic web community.",
            "My butt could ask Trixie when he meets Abatix in the elevator and wants to talk about the interactions and strength of databases and semantic web community.",
            "Well, not one statement Asterix might make is, well, we are very.",
            "We are very well able to deliver models for query answering and very answering in context where we have open environments and we have rather heterogeneous environment, so that could be the statement or let us trick is making.",
            "And clearly about objects will talk about his efficiency, so there's a very long history of coming up with efficient solutions for managing very large datasets."
        ],
        [
            "Let me file to go into some more details and see what kind of interactions we might identify when we talk about databases.",
            "On the one hand and semantic web on the other hand.",
            "Probably look into the database area.",
            "Clearly the most prominent issue, at least, would be to that kind of comparison and he is scalability.",
            "And at least the people that are little bit as old as I am now, Bruce Lindsey and one of the key players are in the database community for many years.",
            "When you talked with him about what are the issues in the database community, he said scaleability, and he's very famous.",
            "Statement statement then was well, we just talk about performance, performance, performance of the Quasi's famous statement are many years ago.",
            "But that really indicates what are the issues that.",
            "At the database, people are really interested in the end.",
            "When we, on the other hand, look into the semantic web community around, there has been strong interest in coming up with a rather expressive knowledge representation language.",
            "He is that are then able to handle all these notions of uncertainty and heterogeneity.",
            "When we compare these two communities for suspect to the kind of settings that are investigated well, then we can see in the database community we typically rely on.",
            "What I called your control setting so when you build up a database application, you typically know what are the databases you want to integrate an for, what kind of application you want to integrate.",
            "These kind of databases, so that is a lot of well defined setting you are handling in the end.",
            "In opposite, when we moved to the Semantic web area, we rather talk about these very dental, decentralized settings.",
            "We talk about our talk integration of different kind of sources where the people having developed these kind of sources did not imagine before hand what kind of combinations are the people would like to build on top of these resources in the end.",
            "So there are really two different kinds of settings that are currently investigated.",
            "And clearly we have then these notions of closed world assumption.",
            "On the one hand, and open world assumption on the on the other hand."
        ],
        [
            "We then move into some trends in the database area.",
            "I would like to refer to some very recent development that has been very prominently pushed by Ellen Halevy and some of his colleagues.",
            "The development being that the pointed notion of data spaces.",
            "And compare them to what we typically assumed to be valid assumptions about databases in the end.",
            "So what what's new with?",
            "Respect to the notion of data spaces?",
            "So instead of assuming that tight and well defined integration setting that I just characterized rather move to scenarios where you have a collection of databases that have to be.",
            "Have to interact with each other in order to support specific kind of applications, but they preserve some kind of autonomy so you rather talk about coexistence of databases that interact in some vaguely defined way with each other in order to build up these new kind of data space applications.",
            "When you have that general notion in mind, then you can identify more specific characteristics that are then relevant when you talk about these data space kind of applications.",
            "One slogan used there is PS.",
            "You go data management.",
            "What does that mean?",
            "But in traditional database settings, who talked about rather significant upset upfront investments, we have to make in order to come up with your database applications so you spend.",
            "Sometimes months or even years, in order to build up your database applications to spend a lot of resources there and rather at the end when you finish your upfront investment.",
            "Then you move into the exploitation area where you deploy your application, then really take profit of the kind of investment you have made from the very beginning.",
            "In contrast to that, pay as you go, data management takes up that notion that you start with a very small amount of initial upfront investment and very soon after you have started into that kind of project you will get the 1st that benefit from having invested resources into these kind of applications.",
            "So that fits very well to the kind of discussion we had last evening in the Web 2.0 Semantic Web panel.",
            "We also discussed about how can we deliver technology that provides added value from the very beginning so that you do not have to invest half a year of a lot of money in a lot of people before you start to get your initial return of investment, but that you really want to have approaches.",
            "Value investor only, small amount of resources, and then you immediately get in.",
            "Edit value and that is the same kind of notion that is discussed in that data space context, and then specifically address typical questions that have to be addressed in the database community about query answering is clearly one prominent example in that area.",
            "Then when you talk about query answering in these data space contexts.",
            "You do not really talk about anymore about correct or false answers.",
            "You rather talk about good or appropriate answers.",
            "So if you want to talk about ranking of answer so you have all these big notions of very answering around that is very familiar with our for our semantic web community.",
            "So when you talk about evolution in that context, we have to address the problem when you have that collection of data bases.",
            "Being part of that data space available.",
            "And one of these resources is modified to some extent.",
            "How can you manage that evolution processes in that data space context?",
            "Again, notions that are discussed in our semantic web community and clear then that asks for services that are more or less at the core of some of the developments that are currently going on in our community of how to handle inconsistency in the context of query answering and these kind of notions.",
            "When you think about what are typically Ixia application scenarios where these notions of data spaces show up well, you can go into personal information management.",
            "You can go into enterprise information integration, or you can go to these scenarios where your post queries to the World Wide Web."
        ],
        [
            "I take one example from Ellen and that Contacts are in that area of personal information management that easily shows that you have all kind of information.",
            "Being Excel sheets, PDF, documents, webpages, all these kind of resources databases in the background and they do have to handle all kinds of relationships between these different kind of resources and these kind of relationships are in no way predefined, so they are generated, are talk depending on the kind of application scenario you are currently investigating, so that are the kind of scenarios we are really discussing there."
        ],
        [
            "When we then move a little bit further into more details and first start was that notion of in the database community as a customer?",
            "Then we can address different kind of.",
            "Challenges that are relevant in the database community and where the semantic web community might provide some input in order to address these kind of challenges, I refer here to what has been called the lower database.",
            "Reach out self assessment.",
            "Uh, that was published last year in the communications.",
            "Those of you familiar with the database community.",
            "Now that typically every four to five years to key players in the database community meet somewhere in the world and define more or less a road map.",
            "What are promising or interesting challenges to be addressed are in the database community and at lower database Research article is more or less the outcome of the last meeting.",
            "With respect to that road map definition.",
            "So when we.",
            "Look into integration aspects that are then related to these notions of data spaces.",
            "I have just mentioned, but one aspect really is how to come up with models for query answering.",
            "Indent.",
            "In that context there you see it, you see the quote here from that article that there is made a reference to the semantic Web community offering two main benefits in order to address these kind of integration challenges one is providing useful formalisms for representing ontologies.",
            "And as you see, also that specific aspect they talk about simple but useful, and I think that's a very interesting and very relevant statement.",
            "They are to talk about simplicity, but still usefulness in that context.",
            "And the second aspect they are referring to is that concept of your eyes.",
            "That is well known in our community, so therefore I think all the kind of work that we are currently doing with respect to semantic integration of data sources.",
            "Being able to integrate structured as well as unstructured sources, being more flexible with respect to query answering, having these more.",
            "Generic notions like good or bad answers, ranking of answers available.",
            "They are all interesting and relevant for these notions of data spaces, and these integration aspects."
        ],
        [
            "Second aspect I would like to mention this related to semantic mappings.",
            "So in these data spaces, you cannot assume anymore that you have about defying collection of mappings available that relates these different sources to each other.",
            "But you really have to assume that you have some vaguely defined mappings available that are certain to some extend, and there are.",
            "These are notions that are there relevant in that context.",
            "And again, he ideas made a nice statement, at least from my point of view, that they think there would be a good and it would be a very good idea to establish collaboration between groups.",
            "Working on these and other related problems and the semantic web community is explicitly mentioned there and clearly when you look into the technical program of that conference or of some of the last conferences where we talk about mappings in various kind of settings, approximate more mappings.",
            "We talk about accuracy of mappings.",
            "We talk about how to.",
            "Bottom up, generate mappings in some kind of emergent notion or B.",
            "Talk about how we can we exploit reasoning to.",
            "Detect inconsistency with respect to mappings, or derive subsumption relationship between different kind of mapping, so there's a lot of methods being developed in our community that are then immediately relevant for."
        ],
        [
            "What kind of activities?",
            "And finally, a third aspect?",
            "I would like to address are these notions of uncertainty and inconsistency.",
            "That will be very prominent in these data space scenarios because you cannot assume anymore that the kind of resources who will integrate in these scenarios will be consistent.",
            "So everything related to handling of inconsistency and certainly in that kind of aspects will be relevant there as well.",
            "And clearly there are activities going on in our community.",
            "I just refer to that workshop that has been organized last year and this year about uncertainty reasoning for the semantic Web.",
            "OK, so I think they are promising topics where the semantic web community can easily cooperate with the database community in order to come up with better solutions for some of these challenges in the end."
        ],
        [
            "When we switch to a point of view and talk about databases and suppliers, then clearly we look first into what kind of scalability approaches are available in database area that might be fruitful for our community as well.",
            "So I talk about all these optimization techniques that have been developed in the database community in order to optimize query answering in relational or also in deductive databases.",
            "And when we compare that with these.",
            "Classical approaches we had available in our systems for handling tee boxes in a boxes, and especially finding large boxes.",
            "There was a clear inside that one could take profit from approaches that are available in the database community to come up with more efficient reasoners that are especially able to handle large boxes.",
            "And as soon as you go into commercial settings, large boxes are there anyway.",
            "'cause then you refer to larger databases that are part that are around in your company anyway and you have to be able to handle these large databases when you talk about our semantic based applications in the end.",
            "Here I refer to that key and two development that shows as one example how you can bring together strains on the database community.",
            "On the one hand, with approaches in our community, on the other hand.",
            "So the basic idea was to come up with new kind of approach for developing efficient reasoners in a way that you take your DL knowledge base.",
            "Then you apply some, I would say rather sophisticated transformation steps.",
            "In order to generate in the end disjunctive Datalog program out of that DL knowledge base.",
            "And that approach is somehow meaningful.",
            "In the end Becausw you can prove that former property that if and only if a crowd fact is a logical consequence of your initial DL knowledge base.",
            "It is also a logical consequence of your disjunctive Datalog program.",
            "So you are on the safe side with respect to these kind of formal properties, and that enables through in the end instead of answering the query based on the error reasoning your answer your query based on these.",
            "Optimization techniques that are known in the Datalog world, and then you come up with more efficient solution, specially with respect to handling large boxes Indian, so that's again for me.",
            "A nice example of how you can pick up specific approaches in other communities here in the database community and combine them with techniques we are investigating in our community in order to deliver some more promising results."
        ],
        [
            "OK, let's move on to the next community.",
            "The software engineering community.",
            "Now, what could be the conversation?",
            "Our elevator?",
            "Well, from the semantic web community point of view, we could strengthen our notion of formal models that then in the end support reasoning about these models and support reasoning about the resources that are described by these kind of models.",
            "And when we think of the strength of the software engineering community, but they have a long history in their delivering architectures in delivering tool support and coming up with visual techniques for modeling and that kind of stuff.",
            "So there's again scenarios where the strength of these communities are rather complementary, and therefore you can think about how to bring together the strength of these communities."
        ],
        [
            "But let's again make a rather simplified comparison of ontologies.",
            "On the one hand, and the notion of models as it is known from model to architectures in the software engineering community.",
            "When we talk in our community about ontologies, we talk about structuring knowledge.",
            "In the end, using them as a basis for deriving new knowledge based on some kind of inference techniques, and we ought to talk about languages like our debt really conversa I said defined formal semantics, at least in the basis for doing all that influencing in the end.",
            "On the other hand, when we look into the notion of models in the MDA community, but the basic idea to come up with these models was related to the aspect of coming up with models that abstract to some extent from the platforms we will use in the end for implementing your system.",
            "So these models abstract from platform specific aspects, so that is 1 notion of abstraction that is very prominent in the MDA community.",
            "Second aspect is there you really do not talk about inferencing.",
            "Derive menu knowledge in the end.",
            "So therefore when you talk about these models who have to completely specify all relevant information in these kind of models because they are then used in the end to try the construction of your final software system in the end so.",
            "These models are characterized by being prescriptive in the end.",
            "For the system you want to implement later on, and clearly when you talk about models and formalisms in the software engineering community, you malley's teachers to talk about.",
            "Then the question is, is there any chance of praying on the one hand on teologi's and on the other hand these notions of MDA models together in order to see what could be a profit by?"
        ],
        [
            "Bringing these two notions together.",
            "Maybe some of you attended a presentation yesterday by such a problem and then colleagues about current activities going on in the OMT context about how to build up a bridge between our ontology world on the one hand and the UML world on the other hand.",
            "And the basic idea is to come up with what is called an ontology definition mental model that is based on that three layer approach that is associated with that approach called metaobject facilities.",
            "So you have your model layer where you're in our context would talk about the ontologies.",
            "Then you have the metalia value.",
            "Define your meta model for your ontology and that is then based on that meta meta model that is.",
            "Defined as the starting point being represented by Dead Metaobject facility.",
            "So that is that well known.",
            "Three layer notion.",
            "It is available from the software engineering community, so how can you then think about building up a bridge between the Umm Albert on the one hand and our ontology world on the other hand.",
            "But you rely on that meta object facility providing these meta meta notions to define meta model space on morph in the end.",
            "And those of you are familiar with your Mail now that we are able to define their design UML profiles, but then also able to come up with some kind of visual syntax.",
            "Then on that meter model level you can't define precisely the relationships between your UML profiles.",
            "On the one hand and your ontology meta model on the other hand, and by having mappings in both directions, there's a clearly defined path of going from the ontology world to do UML world and vice versa.",
            "And then on the bottom level you have on the one hand your ontologies, or you have in the UML world you're human model, and since the mappings on the metal layer are precisely defined, you have also clearly defined relationship on that model level between ontologies and."
        ],
        [
            "The two male models probably then look into again that supplier and customer relationship.",
            "What is software engineering providing as a supplier?",
            "Well, all these MDA notions.",
            "These model driven architecture notions provide valuable input for our community.",
            "You talk about interoperability in that context across platforms.",
            "That is something that is also relevant for our community.",
            "Here you talk about modeling tools that are there any way that then might be exploited in our ontology world in the same way.",
            "You come up with that approach that you are able to specify your models in your in a way that is abstracting from your specific ontology formalism so you come up with an abstract specification of your ontology model.",
            "Then in a second step you grounded abstract model by providing transformations into specific languages like our for example, all transformations into F logic to mention as a second possibility.",
            "So we have a clear separation between the abstract model.",
            "Fatal define the basic ingredients of your ontology model and then you can map that to specific formulas that are then well known from the KR community.",
            "And by having these mappings to UML profiles, are you also buy in?",
            "In the end, the visual modeling techniques that are associated with your Mail.",
            "So that is, for example one approach we are currently investigating in our European funded neon project where we define an abstract model for network ontologies and that is exactly based on that approach."
        ],
        [
            "I'm currently outlined when we switch their point of view and discuss software engineering as a customer.",
            "Well then clearly that initial statement Astrik made that we come up with very formally defined models that support reasoning.",
            "That is the kind of added value we provide to the software engineering community.",
            "So when you have models where you have to align vocabularies for example to each other, you can exploit these semantic alignment approaches that are discussed in our community.",
            "We can better support by having these former models available, consistency checking and model validation.",
            "We are to some extent better able to integrate information from different kind of resources to support the query.",
            "Answering in these heterogeneous environments, not just when you think of applications where some kind of policies are rather relevant thing.",
            "For example of all these notions of compliance management that are more and more important for for industry, in or all kind of sectors.",
            "By providing these formal specifications of these policies.",
            "It is again an edit value that we might provide to these software engineer into that software engineering community based on all these model based approaches in the end and he will see just one of several possible references to work and it has been done in our community in order to show how you can formally define reasoning in the UML context.",
            "And here I have one reference tool.",
            "That lens or any paper 2002."
        ],
        [
            "OK, there was a discussion of the software engineering community.",
            "And what about the natural language processing community?",
            "Well again, but we think our supply of you.",
            "We could say, well we have all these ontology and reasoning mechanisms available that might then improve the handling of some specific challenges that are well known in the Inipi community.",
            "Like for example, all these disambiguation problems that are well known there.",
            "On the other hand, when you see what are the strengths of the NLP community while they have a long history in providing very solid techniques for information.",
            "Extraction and also associated tools in order to support these info."
        ],
        [
            "Mission extension processes.",
            "So when we first look into NLP as a customer, one prominent notion of support for the inner peak community is to better support these disambiguation processes in various kind of settings.",
            "So when you think of posting queries to some kind of resources by you, some compounds, like for example, you might have medicine and headache, and then the question is, do you talk about?",
            "A query that asks for documents, for example talking about medicine that causes headaches or that curse headache.",
            "So there are different semantic interpretation of these compound interpretations and ontologies might provide added value to handle these different kind of notions.",
            "When you talk about lexical ambiguities again window move into specific application domains and come up with specific models for that application domain.",
            "There is a good chance that you might reduce the number of.",
            "Ambiguities have to handle in the end.",
            "Here my example when you talk about corner and go to bed at night, you find of different kind of 11 different kind of meetings being defined there.",
            "But when you move then for example into the soccer domain, what we did in our smart web project in Germany, then only two of these readings are really available.",
            "In the end, either corner is a location on the playing ground or it's some action of a player, but all other possible notions are not available.",
            "Anymore when you have modeled your soccer domain in the right way, and here you could also talk about supporting the handling of syntactic ambiguities like prepositional phrases."
        ],
        [
            "That kind of stuff.",
            "When we talk about deploying ontologies in order to support these in our peer process is 1 current discussion going on is whether to rather use domain specific ontologies, or rather to use foundational ontologies.",
            "Why might foundational ontologies being relevant in that context?",
            "But when you think about defining meaning across application domains, foundational ontologies like culture, for example, might provide the.",
            "Right support in order to support these definitions of meanings across domains, whereas in other settings it might be more appropriate to refer to these domain specific ontologies.",
            "And clearly when you talk about natural language construct that refer to some spatial or refer to some temporal notions.",
            "Again these ontologies might provide."
        ],
        [
            "Later, additional value.",
            "Change the view to another PS supplier.",
            "Well clearly there's a long history and well established test settings and test beds available in order to talk about information extraction that area, the message understanding conference.",
            "A very prominent example for these kind of activities.",
            "So that is clearly an area of of the NLP community where we can just take profit in our community of.",
            "A new development that has been established in rather recent year is to combine some inner P processing techniques with information sources you find on the web so that you use web sources as some kind of corpus to support evidence for specific aspects.",
            "So when we think about generating facts for a box, for example where you talk about facts being associated with some kind of specific classes, you can go.",
            "Out into the web and see if do you find support for that kind of fact you want to include into your a box by investigating a large corpus you find on the web in the end, so that have been recent developments that had been showing that exploiting that web resources combined versa.",
            "Linguistic processing is rather promising.",
            "In order to come up with better results in that AM."
        ],
        [
            "It might also apply when you talk about ontology evaluation.",
            "I will go into some detail with respect to that specific topic.",
            "I assume at least some of you are well aware that onto clean a methodology that provides some meter taking for the concepts you define in your ontology so that you talk about.",
            "Concept being rich it or talking about identity and these kind of notions and those of you that already have looked into these kind of papers by Nikolai and his colleagues.",
            "Well, they know it's not that easy to really apply that onto clean techniques in real life settings and therefore the question is is there chance to provide some support in order to be better able to handle these kind of?",
            "Notions in order to support this ontology.",
            "Evaluation processes, and again, one idea is to take some linguistic patterns and then diploid them to the web and see whether the web supports.",
            "Are these patterns you have defined in the very beginning.",
            "So here's an example.",
            "When you find a statement like or a sentence like, he is no longer a student.",
            "And just think about taking a concept like student with.",
            "Former property like being rich, it or not.",
            "Then clearly when you find these kind of statements you know about student might not be a concept that you would like to take as being rich.",
            "It becausw that statement say well at some point of time a person might be a student, but then he might lose that role.",
            "Maybe later on become an employee or whatever the next role that might be.",
            "So when you find these kind of linguistic evidence is on the web then that is a clear indication that are taking.",
            "Based on that, onto clean approach has to reflect that a person might change that kind of role.",
            "So student is a temporary Rd.",
            "You might play it, but not for all of your life.",
            "Second example, connecting more than two computers requires a hub.",
            "Again, that is an indication that you.",
            "Can talk about a concept like computers being countable and therefore you may assume that the computers have to carry some kind of identity, otherwise we are not able to count 1, two or three computers in the end.",
            "And therefore the basic idea was to exploit these kind of patterns.",
            "So pattern might be he or she is no longer A and then it depends on the specific scenario better than you asked for student or employee or professor whatever and then to post these kind of queries to the web and see whether the web resources provide positive or negative evidences for these kind of metal properties and a nice feature of that development also is.",
            "That by refering to web resources to somehow overcome your data.",
            "Sparseness problem in."
        ],
        [
            "So that is somehow briefly reflected in that in that architecture here, so that you take that pattern library.",
            "You then post these queries to the web.",
            "You analyze linguistically the answers you get back, you do some evaluation and based on that evaluation and classifier makes a decision in the end whether are taking with plus R saying that that is a Richard concept or for example is a valid meta tag, you would.",
            "Like to associate with."
        ],
        [
            "Your concept or not OK, so that was a nice example where you combine web resources, natural language processing and also what you have seen by referring to classifier.",
            "Some machine learning aspects.",
            "That is the final topic.",
            "I would like to address.",
            "What might be the interaction between machine learning and semantic web community?",
            "Well by prominent example, when you talk about text classification, text clustering is that they are the bag of words model is rather.",
            "Prominent, but that is a completely syntactic notion, and we might improve that notion with some more semantics in the end and the machine learning people.",
            "Well, they might say, well, we are well established in order to apply learning algorithms in order to generate at least some parts of your epoxies and Tipo."
        ],
        [
            "Since in the end.",
            "So when you look into recent work in that kind of area, you might see work that improves that bag of word model with some kind of semantics.",
            "In order to come up with better results, respect or text clustering or text classification.",
            "Do you have to be aware that you have to plug in these kind of semantic enhancements in a very careful way?",
            "Becausw evaluation show that if you do that in approved for sway, the results might even become worse compared to the simple syntactic approach.",
            "So you really need some know how how to do that in the right way.",
            "Also, when you go to for example notions like semantics with Spectra image recognition so that you are really interested.",
            "What people do in the media project, for example to come up versa.",
            "Semantic interpretation of specific pictures or when you see that nice beach picture here you want to be able to identify that you that you find a person here you might not see that in the at the end of the debate over that seminar Hall here.",
            "So here you find the person he'll find some rocks in the background so that are the kind of elements you want to identify in the end in order to get a semantic description what you can see on that.",
            "Picture and again in the background you need or different kind of classifiers to come up with these kind of solutions in the end."
        ],
        [
            "Also, when we talk about machine learning as a supplier value, find all kind of machine learning techniques that are relevant in that context.",
            "You might refer to.",
            "I'll P. Inductive logic programming for induction of concept definitions.",
            "You might refer to Association rule techniques in order to derive new Association between concepts.",
            "Or you might refer to clustering techniques in order to learn some taxonomical structures in the end.",
            "That is, for example currently being investigated in the second project, most prominently by ARCO hired by our colleagues at the Chairs Eye Institute in Slovenia.",
            "And that's again a very nice example of for that interdisciplinary bird that is going on in the second project, where you'll find people from the natural language processing error, the machine learning area, and the ontology management area.",
            "And these people really work closely together in order to come up with new solutions for supporting the generation of meta data or the generation of these ontologies in the end."
        ],
        [
            "OK, that was the overview about some relevant communities where the semantic community is closely interacting with really, there's a much longer list available of communities.",
            "I might have discussed today, but there is no chance to really address."
        ],
        [
            "These topics today.",
            "OK, let's briefly look into some business aspects.",
            "In the third part of my."
        ],
        [
            "Talk so when I talk about business aspects, please be aware that I here refer to the notion of semantic technologies.",
            "I do not talk about semantic web technologies because the kind of application scenarios you're currently see that are mainly exploited in the commercial setting.",
            "They are more related to these enterprise settings of you talk about enterprise information integration, enterprise content management, ERP systems, enterprise resource planning systems, or you talk about product lifecycle management.",
            "There when you look into market estimates of what fraction of the market might be covered in the end by semantic technology based solutions.",
            "While you find statements like up to 20% of these markets, might Indian be covered by semantic technology based approaches you find also kind of strategic development to identify what some people call a semantic middleware layer.",
            "Why you cluster all these semantic technology related functionalities in order to support the Indies end user applications?",
            "You see here the example of that neon reference architecture that is currently being developed as a reference architecture to support these semantic technology based applications.",
            "And then you find here in that layer services like reasoning services, annotation, services, evolution services.",
            "That then might be accessed via some web service interfaces by these end user components, so that is also one development going on."
        ],
        [
            "When we more specifically look into these application areas, you see here, for example, some estimates for 2010 movie.",
            "Just take the first one enterprise content management.",
            "While the estimate is that maybe 20% of that market will be covered by semantic approaches, then you talk about a market size of about 1100 million euros on.",
            "That is some significant amount of market there.",
            "And to see similar numbers in these other areas like information integration or for example enterprise resource planning.",
            "So I think there is a.",
            "Clear market available for these kind of semantic technologies.",
            "From my point of view, Countly rather in the enterprise context and not in the web context.",
            "But there is a clear market for these kind of tech."
        ],
        [
            "Cheese and just to show you one example, that product from Software AG that is based on semantic technology.",
            "In the end, some technology provided by Enterprise in the background that addresses these notions of information integration where you start by lifting.",
            "In the end all your different kind of heterogeneous sources being that databases, HTML repositories, whatever you have on that ontology level.",
            "So that you have done a semantic description of these sources available, you have.",
            "On the other hand, what is called here, a business ontologies and views defined on top of it that define the application scenario you want to support the in the end and then to connect these business ontologies with these source description.",
            "Paula.",
            "Geez, you come up with these articulated mappings and that is the kind of added value you have available here becauses these kind of approaches.",
            "So a better understandable for the application people maintenance is more easy because you specify these mappings on a more abstract layer and also by having that semantic description of these sources available, we are also in a better shape to later on move into the second and third kind of application scenario by exploiting these semantic description of these.",
            "So that is 1 example where a big company is already redeploying that kind of technology in there.",
            "Products and making some money on the market with that kind of."
        ],
        [
            "Technology.",
            "To conclude that business notion, I refer to a slide.",
            "Richard Benjamin showed this at this year's World Wide Web Conference, and it's hard to maintain.",
            "And also it's not that easy to really make good cost estimates.",
            "So how costly will it be to come up with all these are kind of ontologies Indian and therefore in order to really convince customers that we come up with really meaningful technology in the end we have to show that we can do all these ontology engineering activities in a controlled way.",
            "Well managed and that we come up with approaches that are also affordable for these kind of customers and we also have to show what is really the edit value by using that kind of technology compared to using the more conventional technology.",
            "And I think one of the nice work in that area in order to make progress with respect to these kind of aspect was a paper presented at that conference by Ilana and colleagues about that onto come approach.",
            "That provides first solutions for coming up with estimations of how costly will it be to engineer specific ontology in specific settings for specific application domains.",
            "Really, we still need much more experimental data in order to really fine tune these kind of models.",
            "In the end we are in a match.",
            "The software engineering community is in much better shape in that context because they have a lot of experimental data available to support these kind of cost estimations.",
            "So I can just make a statement here that we all have to contribute in order to collect these kind of experimental and empirical data in order to be better able to fine tune these kind of models Indian and we really need these kind of models in order to be able to talk to."
        ],
        [
            "Our customers.",
            "OK, let's come to the end of my presentation.",
            "What are some take home messages?"
        ],
        [
            "And some final trans I see, but when we look into the different communities I saying well with respect to key.",
            "Are there is a rather nice Corporation already going on?",
            "We may talk about the database community and let's look into this road map definitions.",
            "They are very similar challenges being defined, but we still have to see whether the mainstream activities in a database community really pick up these kind of challenges.",
            "We talk about NLP and machine learning.",
            "We I see a huge potential in that cooperation, but it is not really be for yet exploited.",
            "In that context, Spectra software engineering or I have shown that example in that own G context, but that is 1 island of.",
            "Cooperation, and I think there would be much more opportunities to really improve that kind of cooperation.",
            "I mean, I talked about business aspects are really seeing that we are currently in the state where we can clearly talk about corporate semantic web applications.",
            "Are you really see markets for these kind of technologies in the end?"
        ],
        [
            "OK, but what are some trends?"
        ],
        [
            "I see in the end and that will be the conclusion of my talk today, while we see all kind of developments going on in order to investigate the relevant notions.",
            "When we talk about our web community about our semantic web community and that initiative of defining our websites, most prominently pushed by team and some colleagues, but that clearly identifies that we have to address more aspects than only the technical ones in order to really be.",
            "Able to address all relevant parts when we talk about web applications in the end and I still and I think well and semantic web is clearly one important building block.",
            "When we talked about that website stuff in the end.",
            "When you think of the invited talk given by Tom on the first day, the panel yesterday, I think there was a clear agreement that the Web 2.0 Community on the one hand and the semantic web community, on the other hand, have rather complementary strains and challenges.",
            "How to combine the strengths of both communities and what I see is contribution that we might make from our semantic web community.",
            "Is this well defined notions of structuring based on ontologies?",
            "The re usability of Meta data, you could say the usability of tags based on that more formal notions in the end and also having that formal basis available and make our representation formalisms like RDF available.",
            "I think that on the fly combination of applications is a rather promising method that is provided by the semantic web community in the end."
        ],
        [
            "Along these lines, I would just like in the end I refer to 1 project.",
            "We currently carry out in class with the Semantic Mediawiki that is for my example very good example of how to combine the strength of these.",
            "Two communities in the end, the basic idea is just take the Mediawiki as in all the meter wiki.",
            "Up plug in some small semantic ingredients.",
            "And one in creating these that you plug in type cling so that you can really talk about location in a well defined way.",
            "When you relate this week with essence that you type attributes in a well defined way so that you really know what you are talking about when you talk about the starting date of this week, November 7th this year.",
            "And by having these kind of notes available, you can immediately provide any value becausw you are then able to support a query answering like for example querying for some kind of conferences in the autumn over 2006.",
            "So that's again."
        ],
        [
            "Scenario where you have instant rewards by providing some kind of semantic techniques on top of what is already available and you have to clearly keep in mind usability and simplicity, because people that use on that Mediawiki stuff they are not willing to go in four weeks of training in order to be able to specify ontologies, that kind of stuff we really have to be careful how much of additional technology you want to deploy in that.",
            "Mediawiki environment and I think that's a good example of how synergy between these different notions might be achieved in the end.",
            "And also yesterday there was a discussion about.",
            "Bringing semantics to the web or to the people and Semantic, Mediawiki is a good example of bringing semantics."
        ],
        [
            "People OK, thanks for your attention and clearly what I presented is based on a lot of peoples work either in cards or somewhere else.",
            "Thank you.",
            "Thank you and since it offered in my interesting talk you mentioned, image recognition in your talk, I'm very much interested in your opinions about the relations between the semantic web community and the multimedia community in general.",
            "It seems to me that the connection between the two communities are getting stronger these days and W 3C recently set up a multimedia semantics incubator group and three out of five.",
            "And Semantic Web challenge of this conference mean three out of five finalists of the Semantic Web Challenge in this conference from members of this incubator groups.",
            "So an actor in general applications in this domain and not necessarily restricted to machine learning.",
            "So I'm just wondering if you would like to comments on relations between.",
            "And this to research community.",
            "Well, I completely agree with your statement that there is a fruitful cooperation evolving between the multimedia community on the one hand in our community that would also have been a good candidate to be part of my talk today to talk about these.",
            "These kind of relationships.",
            "When does talk about the challenges there?",
            "Well, you have some tradition of doing analysis in the multimedia community.",
            "That is, I would say more pixel based to make that kind of statement and we come with.",
            "These are semantic notions, armor from a top down point of view and one of the challenges I see here and some of the recent development show how you can bring these two words together is how to really build up a bridge from these more very low level notions that are provided by the.",
            "Multimedia people by talking about all that pixel stuff and then coming up with these semantic interpretations.",
            "When you do not talk about anymore blue area are a red area on your picture, but where you rather talk about the see in your picture and that is the kind of things and then you see that you need all kind of methods and approaches and clearly some kind of machine learning techniques are one prominent example you exploit in that context.",
            "So I think that is an area where we hopefully will make.",
            "A lot of progress in the upcoming future.",
            "OK thanks.",
            "Community and my own observation was that actually the uptake, especially in the conference.",
            "We could convert if you look at actual paper trying to come up with scalable data management solution for our community.",
            "It's actually not that big, so there not that many, many, many.",
            "Any ideas really inside how we can.",
            "Improve.",
            "What I need to do to get them more interested?",
            "You see, that's a topic I was interested from the very beginning when I moved somehow into the semantic web community to have a close interaction with the database community.",
            "So some of you might remember that we had turn monopolist as a PC chair some year ago in order to somehow by in the database community when you go to the website of our Web semantics Journal, you find 1 prominent area being defined there.",
            "The database area in that context.",
            "Because I really think that the kind of solutions that are available or being developed in the database community are really relevant for our community as well.",
            "For me, that's a typical problem of how to build up a bridge between different kind of communities.",
            "When a little bit look into my history, we've started as a database person, then moved into software engineering, then moved into AI, and now in the semantic Web community.",
            "It's not that easy to really be present in a lot of different communities.",
            "Show up at all these events being connected with other peoples being the key players in one or in the other community.",
            "So I think that is an effort a lot of people have to invest into in order to really better build up these kind of preachy is with respect to the database community in our community, for example, one question one could raise is how many of us are submitting papers to reveal DB conference or to a SIGMOD conference.",
            "The unit had to do some hard work in order to reach that kind of level, but then that would be one way of at least making our.",
            "Achievements in our methods are more available in the database community and therefore also get some feedback from the database community.",
            "What's going on in our community, but that needs real effort by individuals to really invest into that kind of cooperation.",
            "Adding to that debate though.",
            "I mean, we have submitted for example to database community, but we really have to write the papers very, very differently.",
            "So you can't really write about RDF, you have to write as a graph.",
            "And recently you know they have warmed up to graph for example and they would like things related to graph computation.",
            "Or you can go to data mining conferences and publish about graph.",
            "But you're asleep.",
            "All these ur eyes and RDF and other things, and the name relationship to do that.",
            "So I think there are a lot of compromises your to make if you want to.",
            "Kind of.",
            "Force and publishing to another community.",
            "So why not publishing semantic web conferences?",
            "Now?",
            "There are things, so these are the challenges that we have as to think somebody's committee has been very slow for very long time.",
            "SIGMOD never accepted much into the modeling issues.",
            "We are limited.",
            "It was one of the more forward looking.",
            "And even now, today there is always difficulty in conceptual aspects in modeling as we saw that while I think some of our you know, our communities probably more open to that.",
            "So while each committee finds enough of the things in their thing, they're going to continue that way.",
            "On the other hand, if they think that they are threatened in the existence, maybe they'll be more open to a more open to that.",
            "Maybe database is not too far from there, but we'll see.",
            "I still practice from the University of Tokyo.",
            "I was wondering about your opinions about other communities, particularly applied science communities, and whether how much awareness they have of the activities in this community.",
            "We heard a little bit about how the human Genome Community leveraged effectively ontologies.",
            "Do you have any feeling for how this is being perceived in other applied science communities?",
            "Well, I did not.",
            "Address these kind of topics today because for example, Spectra Life Sciences.",
            "That was a very prominent presentation color gave last year about all these kind of interactions between our community and the Life science community.",
            "I completely agree that there are other communities around that are really good customers, so to speak, for for the kind of technology we have available.",
            "Therefore not mentioning here as one prominent part of my talk doesn't mean that I do not think that it is.",
            "Relevant community interested to see what fits into a one hour presentation, indeed.",
            "But I completely agree with your observation.",
            "I'm interested when it comes to the relationship between this semantic web technology and software engineering.",
            "Software engineering has gone through a few phase changes, for example, when.",
            "We moved from's structures to objects.",
            "Then the philosophy changed the whole way of thinking about the software changed, and as a result we had to we.",
            "Although you can write in C in a in a sort of object oriented paradigm, you actually had to move to a new languages.",
            "Now with Semantic Web data we have very different philosophy.",
            "With this openness.",
            "The fact that you can load data for land and get piece of information which you have not programmed for but which you may still be able to use.",
            "The fact that you have to be able to have.",
            "The same object may have data may have the same sort of data about it, but from different sources.",
            "You have to be able to be aware of those things.",
            "Do you think?",
            "In fact, we won't really have the semantic web philosophy, the true understanding and ability to use semantic web really in software engineering until we have new programming languages which are specifically built around the semantic web.",
            "But what I've indicated in my presentation is with me talk about all these model based approaches.",
            "I see a clear synergy between what we are doing here and what's going on in the software engineering community.",
            "So that is 1 initial step.",
            "But clearly there is a lot of stuff to do on top of that.",
            "What I did not address it is are all these new notions like component based architectures, flexibly.",
            "Configuring applications based on these kind of components where I also would see benefits by using some of the semantic techniques we have available in order to support that notion of how to come up with the application software.",
            "In the end, not having one monolithic block but configuring on the fly different kind of components, and I think in the long term there is no way to do that without.",
            "While exploiting some kind of semantics in Denton because just relying on these syntactic features that it is currently done will not be sufficient in the end.",
            "So that is also one trend I see when you see these recent developments based on component based architectures or other people then talk about these service based architectures and then I think there is a promising area where we can provide added value to that community.",
            "Josh Lieberman.",
            "I appreciate the perspective of looking at these different communities and developments in terms of a.",
            "Provider and consumer paradigm.",
            "But I have to wonder in cases where there are communities that show up on both sides, whether that paradigm kind of breaks down and you have to look at is that really a throughput?",
            "Is it an iteration or is it a more serious and challenging interaction?",
            "Are you see when you design talks like this one?",
            "You always have to abstract from some of the details in the end and you are describe some black and white pictures.",
            "In order to really make the point in the end, I completely agree that when you then go into the details and technical interaction between the different kind of communities, somehow the notion of supplier and somehow the notion of consumer is not that clearly separated anymore.",
            "But in order to deliver some kind of message, I have used that.",
            "I'm a tougher of customers suppliers to make clear what other strong points different communities might bring in into that kind of interaction.",
            "But I agree, when you really do half a year research in a specific area, there is more interaction going on than just that.",
            "Customer and supplier relationship in the end.",
            "On the database kind of idea and possibly getting.",
            "That community to to work and take seriously the problem of getting you know, fast triple stores so I don't know.",
            "I know that there are people working on building fast triplestores commercial companies etc.",
            "But are there any people in what you might call the mainstream database research community who think this is an interesting problem?",
            "And are they working on and if not, how can we entice them?",
            "Well, I cannot refer to specific persons are working in the database community in that context.",
            "Maybe?",
            "Some of you would have a better reference available in that context.",
            "What what we already discussed that based on the discussion of Steven Anomid is how can we?",
            "I'll make the two communities better aware of the challenges that are investigated in both of these communities and in the kind of solutions that are available or being investigated in different kind of communities and as long as the database community is not really in with all these triple aspects, triplestores reasoning on top of that there will not be too many activities going on in that area to really address that specific.",
            "Kind of problem, so I think we first have to raise the level of awareness among these communities, and then we might see developments of how to apply or further develop database techniques in order to support these kind of or solve these kind of challenges in the end.",
            "So that's for my point you with some.",
            "Mid range investment we have to do on both sides in order to come up with these kind of solutions.",
            "Thanks a lot."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, thank you Stephen for that nice introduction.",
                    "label": 0
                },
                {
                    "sent": "It's really a pleasure for me to give that invited talk this morning here, and I appreciate that all of you are already here in spite of all these nice dinners, drinks and whatever was offered last evening.",
                    "label": 0
                },
                {
                    "sent": "So the basic idea behind my talk is semantic web customers and suppliers to investigate the kind of interdisciplinary work that is going on in the semantic web community.",
                    "label": 0
                },
                {
                    "sent": "And when I talk about customers, I refer to disciplines that might take profit from some of the developments that are going on in the semantic web community.",
                    "label": 1
                },
                {
                    "sent": "And when I talk about suppliers, I refer to disciplines that might provide valuable input for our community.",
                    "label": 1
                },
                {
                    "sent": "So that is the basic idea of by refering to that notion of customers and suppliers and also rather at the end of my talk.",
                    "label": 0
                },
                {
                    "sent": "I will also move a little bit into the business area.",
                    "label": 0
                },
                {
                    "sent": "And there again, you talk about custom.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Suppliers, well, let's have a prefer look back into the history of our conference.",
                    "label": 0
                },
                {
                    "sent": "Here is maybe some of you had been involved in the discussions we had in 2001 during the Stanford Symposium to establish that series of international semantic web conferences.",
                    "label": 1
                },
                {
                    "sent": "And when we now look back here in 2006, in essence, what had happened during the last five years?",
                    "label": 0
                },
                {
                    "sent": "I think that initial idea of building up a large community, establishing that community on an international basis to test really been achieved in a very convincing way.",
                    "label": 0
                },
                {
                    "sent": "So we now have our international segment Web conference with a stable number of submissions higher than 200 submissions.",
                    "label": 0
                },
                {
                    "sent": "We get every year.",
                    "label": 1
                },
                {
                    "sent": "Attendance is more or less stabilizing around 500 people, independent in which part of the world we meet.",
                    "label": 1
                },
                {
                    "sent": "Meeting the end and also the structure of the program with workshop tutorials.",
                    "label": 0
                },
                {
                    "sent": "Top Dollar Symposium is now well established.",
                    "label": 0
                },
                {
                    "sent": "Kind of structural conference, so I think we have really made a big step in the last five years to build up that kind of.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Community, so when we start about that notion of connecting communities and we start from the basic point of view, then the question is, well, what kind of activities had been going on in our community to establish somehow connections to other communities?",
                    "label": 0
                },
                {
                    "sent": "Well, in 2002 we had that tutorial on Description logic that was our first conference.",
                    "label": 0
                },
                {
                    "sent": "Then we had workshops addressing database aspects like scalable semantic systems or.",
                    "label": 0
                },
                {
                    "sent": "We had workshops about human language technology.",
                    "label": 0
                },
                {
                    "sent": "We had sessions about our web mining, so that's the reference to the machine learning community and for example, last year we started that workshop establishing that connection to the software engineering community.",
                    "label": 0
                },
                {
                    "sent": "And when you look into the communities that are referenced here that also then define the scope of my talk.",
                    "label": 0
                },
                {
                    "sent": "So I will talk about the knowledge representation Community database, people, natural language processing, machine learning and also the software engineering community.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, that is then the trend of my talk to them.",
                    "label": 0
                },
                {
                    "sent": "I will start by having a brief look into the other communities in the top events they are organizing to which extend to their show up.",
                    "label": 0
                },
                {
                    "sent": "Some semantic web topics in the end and then the main part of my talk will discuss that customer and supplier relationship between the semantic web community on the one hand and these other communities, knowledge, representation databases, software engineering.",
                    "label": 0
                },
                {
                    "sent": "Natural language processing and machine learning.",
                    "label": 0
                },
                {
                    "sent": "At the end of my talk, I will briefly at ran some business aspects from my point of view and then I will conclude with some tickle messages and some statements about trains.",
                    "label": 0
                },
                {
                    "sent": "I currently see going on in our in our area.",
                    "label": 0
                },
                {
                    "sent": "OK, so let's have a brief look at what's going on in other commune.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is when we start with the knowledge representation community.",
                    "label": 0
                },
                {
                    "sent": "While I have chosen here 20 events from that community that I take as representative for the knowledge representation Community, each conference in KR conference and then you see a lot of activities going on in these conferences that are closely related to what's going on in our community.",
                    "label": 0
                },
                {
                    "sent": "That's really no surprise given that tight relationship between some KR aspects and some semantic web community aspects.",
                    "label": 0
                },
                {
                    "sent": "So you find all kind of activities, workshops invited talks to toilets.",
                    "label": 0
                },
                {
                    "sent": "For example, at KR this year, you'll find the talk by Alan Halevi about data spaces, and I will come back to it onto that notion of data spaces in the end.",
                    "label": 0
                },
                {
                    "sent": "So what I would say is a very brief characteristic.",
                    "label": 0
                },
                {
                    "sent": "There's some synergetic cooperation going on between these two.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah it is.",
                    "label": 0
                },
                {
                    "sent": "When we move into the database area then it's clear to which conferences you make reference.",
                    "label": 0
                },
                {
                    "sent": "In the end, VLDB, SIGMOD pods that are these three events you really talk about in the database community, and again you see when you talk about workshops, invited talk tutorials that they are.",
                    "label": 0
                },
                {
                    "sent": "Several events showing up that relate these database community to aspects of semantics, structuring principles, semantic weapon, databases in that kind of stuff.",
                    "label": 0
                },
                {
                    "sent": "So there had been rather large series of workshops and events going on in these communities, and therefore we could say, well, somehow the database community is knowledgeable about what's going on in our community.",
                    "label": 0
                },
                {
                    "sent": "However, when you really go into the technical program.",
                    "label": 0
                },
                {
                    "sent": "He lets it model.",
                    "label": 0
                },
                {
                    "sent": "It will be you will not find too many technical presentations that are really addressing these notions of semantics in the end.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When we take here as a 1 shared community and machine learning natural language processing represented by these conferences like computational linguistics.",
                    "label": 0
                },
                {
                    "sent": "Then you see that again.",
                    "label": 0
                },
                {
                    "sent": "Some of these ontology knows and show up in workshops and tutorials that have been organized rather recently.",
                    "label": 0
                },
                {
                    "sent": "So there is a rather new development both in the computational linguistic area and in the machine learning area.",
                    "label": 0
                },
                {
                    "sent": "So we could say about somehow the natural language processing community and the machine learning communities are informed about what's going on in our in our community.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "And finally, when we move on to the software engineering community, while there is clear one top conference there, the International Conference in software engineering, there you'll find very few elements that really relate our community to the cement to the software engineering community.",
                    "label": 0
                },
                {
                    "sent": "So there was the tutorial two years ago and that kind of stuff.",
                    "label": 0
                },
                {
                    "sent": "But when you then look into the technical program of Excel, you really do not find any semantics there.",
                    "label": 0
                },
                {
                    "sent": "There's the other conference.",
                    "label": 0
                },
                {
                    "sent": "Software engineering and knowledge engineering.",
                    "label": 0
                },
                {
                    "sent": "Obviously they talk a lot about ontologies and related topics.",
                    "label": 0
                },
                {
                    "sent": "But when you talk to software engineering people they would not qualify.",
                    "label": 0
                },
                {
                    "sent": "Seeking is a top level event, so one has to be aware of what's the impact of these kind of conferences in the overall community in the end.",
                    "label": 0
                },
                {
                    "sent": "So we could say about they are somehow aware of what's going on there, but there is not too much interaction currently going on in these technical events.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, when I then come to that notion of customers and suppliers, when I will address the notion of customers, I will talk about what our semantic web research contributes to other communities.",
                    "label": 0
                },
                {
                    "sent": "And as you see, these notions of Asterix and operates to illustrate that somehow with me, then talk about suppliers we will address the question well.",
                    "label": 0
                },
                {
                    "sent": "What are other communities delivering to our semantic web community?",
                    "label": 0
                },
                {
                    "sent": "And refering to aswegen obelisks should somehow illustrate that there are two characters that cooperate in a very nice way with each other that have each their own strengths and weaknesses.",
                    "label": 0
                },
                {
                    "sent": "But in the end they cooperate to come up with innovative solutions to solve the problems they have attended.",
                    "label": 0
                },
                {
                    "sent": "And that is the kind of topic I want.",
                    "label": 0
                },
                {
                    "sent": "Like I would like to address today.",
                    "label": 0
                },
                {
                    "sent": "What kind of synergy is be able to be generated by having these different kind of communities?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Operating with each other.",
                    "label": 0
                },
                {
                    "sent": "OK, let's come to the main part of my talk.",
                    "label": 0
                },
                {
                    "sent": "That is the discussion about that customer supplier relationship with respect to these different kind of communities.",
                    "label": 0
                },
                {
                    "sent": "So I will start with the knowledge representation community and then move on to databases, software engineering, natural language processing and machine learning.",
                    "label": 0
                },
                {
                    "sent": "So that will be the sequence of topics I will address in the end.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But I always will do in the very beginning.",
                    "label": 0
                },
                {
                    "sent": "Is making some kind of elevator pitch, so Asterix and Obelisk's meet in the elevator, and they talk about what they can contribute with respect to the other community in the end.",
                    "label": 0
                },
                {
                    "sent": "Really, this kind of statements are always somehow simplifying with respect to all the different aspects that are really relevant when you talk about that kind of cooperation.",
                    "label": 0
                },
                {
                    "sent": "But the idea is to make some very clear statement about the strength of the different communities and what they might contribute to the other community.",
                    "label": 0
                },
                {
                    "sent": "So, but Astrex might say when he meets Oblix in the elevator is well we establish ontology language.",
                    "label": 0
                },
                {
                    "sent": "He is for knowledge, for presentation on the web.",
                    "label": 0
                },
                {
                    "sent": "There are two issues are involved in that kind of statement.",
                    "label": 0
                },
                {
                    "sent": "We talk about large scale applications because we talk about applications based on the Web and 2nd we refer to the website we addressed that web notion that has to be included in these kind of representation languages.",
                    "label": 0
                },
                {
                    "sent": "When we talk about ontologies.",
                    "label": 0
                },
                {
                    "sent": "In the end, on the other hand, when we refer to the knowledge representation community well objects could say well we have a very long history in defining.",
                    "label": 0
                },
                {
                    "sent": "A well defined knowledge, presentation paradigms and also come up with specific and hopefully efficient deduction algorithms in order to support the kind of influencing that is then being enabled by these kind of knowledge representation paradigms.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Keeping me now go into some more detail with respect to the customer and later on with respect to that supplier relationship that start first with that customer relationship.",
                    "label": 0
                },
                {
                    "sent": "But we could see what is an added value that the semantic web community is currently playing to the knowledge representation community.",
                    "label": 0
                },
                {
                    "sent": "Well, I would say that is the kind of challenges that are defined in our semantic web communities by these real life applications that are really somehow different to the kind of illustrating examples that had for a long time being used in the knowledge representation community.",
                    "label": 0
                },
                {
                    "sent": "Buy used somehow.",
                    "label": 0
                },
                {
                    "sent": "Treaty examples and similar examples to show the the edit value of a new formalism or of a new detection algorithms, but you did not really address very often real life challenges in order to show the edit value of your of your approach.",
                    "label": 0
                },
                {
                    "sent": "So I think that is really a strong impact.",
                    "label": 0
                },
                {
                    "sent": "The semantic web community could make to the knowledge representation community.",
                    "label": 0
                },
                {
                    "sent": "Maybe some of you attended last year's conference in Galway.",
                    "label": 0
                },
                {
                    "sent": "Other nice talk of Carol talking about E science application so that are the kind of real life applications I have in mind that deliver new problems to the KR community and we are then the ad community can also show how they solve these real life problems by their knives.",
                    "label": 0
                },
                {
                    "sent": "New approaches in that context.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Second aspect I would like to mention is related to all these standardization processes that are initiated from the semantic web community.",
                    "label": 0
                },
                {
                    "sent": "Are the F out currently the referrer working group again, that is, from my point of view.",
                    "label": 0
                },
                {
                    "sent": "Speak step compared to what we have done in the past, so some of you had maybe already involved 20 years ago in all these expert systems developments building up expert systems by exploiting specific kind of formalisms that have then been used to build up one specific kind of application.",
                    "label": 0
                },
                {
                    "sent": "And they both know was no chance to talk about later about integrating these applications, exchanging part of knowledge bases between these different kind of our expert systems.",
                    "label": 0
                },
                {
                    "sent": "So that is for me also a big step forward in order to compare the situation we have currently with respect to the situation we had 20 years ago when we talked about these expert systems environment.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "When we switch to view and I'll talk about knowledge representation as some kind of supplier.",
                    "label": 0
                },
                {
                    "sent": "Well then you'll see that in the knowledge representation community there is a lot of interesting work going on.",
                    "label": 0
                },
                {
                    "sent": "For example, suspect to defining tractable language fragments that covers precisely defined formal properties, but you really know how to implement efficient algorithms to do reasoning in that context.",
                    "label": 0
                },
                {
                    "sent": "We also see were going on other suspect to handling uncertainty and inconsistency and these kind of aspects really and these kind of areas like uncertainty, handling or inconsistency handling.",
                    "label": 0
                },
                {
                    "sent": "They still the open issue of scalability.",
                    "label": 0
                },
                {
                    "sent": "So can we really come up with approaches that scale up to the kind of applications we are currently talking about in the in the semantic web community?",
                    "label": 1
                },
                {
                    "sent": "When we.",
                    "label": 0
                },
                {
                    "sent": "Specifically, refer to representation formalisms and reasoning algorithms, where currently you all know we have these two main knowledge presentation paradigms being discussed in our community.",
                    "label": 0
                },
                {
                    "sent": "On the one hand, description logic paradigm represented by these family of our language, he is where we have these different kind of systems like factories, appellate Kian, tool that are all well known in our community in order to.",
                    "label": 1
                },
                {
                    "sent": "I support reasoning in a description logic context.",
                    "label": 0
                },
                {
                    "sent": "Then we have that second paradigm coming from the logic programming area where you also have systems like for example under programs supporting that kind of reasoning, and you all know that we had rather political discussions in the last years about what might be the best knowledge representation paradigm.",
                    "label": 0
                },
                {
                    "sent": "That discussion was unfortunately somehow to some extent more political than really technically based, so that you make claims, well, my own.",
                    "label": 0
                },
                {
                    "sent": "Homeless Mr Best one and the other one is not really that suitable an what I'm really happy about is to see rather recent developments that get rid of that more political discussion.",
                    "label": 1
                },
                {
                    "sent": "Really come back to the more technical investigations and research related to that in order to really investigate how can we bring together these two knowledge representation paradigms and maybe take profit of the strength on the one hand, what we have available.",
                    "label": 1
                },
                {
                    "sent": "By relying on description logic and on the other hand, what we have available by relying on that notion of logic programming tries to illustrate one aspect of how to improve the situation with respect to integrating description, logic and logic program.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would like to refer to one recent work done by Boris and his colleagues about how to integrate Description logic and logic programming so we all know description logic is rather strong at representing taxonomical knowledge, but strong with respect to handling some notions of incomplete knowledge.",
                    "label": 0
                },
                {
                    "sent": "By exploiting these existentially quantified formula in the end.",
                    "label": 0
                },
                {
                    "sent": "But we also know that they are these obvious limits.",
                    "label": 0
                },
                {
                    "sent": "What you can do in the context of a description logics.",
                    "label": 0
                },
                {
                    "sent": "So there are this limit.",
                    "label": 0
                },
                {
                    "sent": "What kind of relationships are you able to really represent there?",
                    "label": 0
                },
                {
                    "sent": "That famous Uncle relationship is always used to illustrate these kind of limitations or you would also like to be able to somehow represent constraints that are well known from our database community area.",
                    "label": 0
                },
                {
                    "sent": "And when you then look into some strains that are provided by the logic programming area, as you can see, some of these problems are rather nicely handled by that kind of knowledge representation program and therefore there is that ongoing.",
                    "label": 0
                },
                {
                    "sent": "Development going on on how to better combine to some extent.",
                    "label": 0
                },
                {
                    "sent": "Clearly with some limitations.",
                    "label": 0
                },
                {
                    "sent": "These two worlds and one proposal there is talking about these hybrid minimal knowledge negation as failure knowledge bases where you have some parts being represented as a DL knowledge base.",
                    "label": 0
                },
                {
                    "sent": "Some parts represented as a logic program.",
                    "label": 0
                },
                {
                    "sent": "But you still be compatible with both the notions that have been defined for suspected semantics with a DL and a logic programming world, but well, you then can in the end and take profit of the strength of the DL world for some aspects and take profit of the strength of the logic programming world.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, and I think that is really the kind of development we need in our community that we really bring together the strength of different kinds of approaches.",
                    "label": 0
                },
                {
                    "sent": "And see to which extent we can integrate them in order to come up with better solutions in the end.",
                    "label": 0
                },
                {
                    "sent": "So hopefully we will make further progress in that kind of integration activities.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, let's move to the second aspect.",
                    "label": 0
                },
                {
                    "sent": "I would like to address the interaction between the database community and our semantic web community.",
                    "label": 0
                },
                {
                    "sent": "My butt could ask Trixie when he meets Abatix in the elevator and wants to talk about the interactions and strength of databases and semantic web community.",
                    "label": 0
                },
                {
                    "sent": "Well, not one statement Asterix might make is, well, we are very.",
                    "label": 0
                },
                {
                    "sent": "We are very well able to deliver models for query answering and very answering in context where we have open environments and we have rather heterogeneous environment, so that could be the statement or let us trick is making.",
                    "label": 0
                },
                {
                    "sent": "And clearly about objects will talk about his efficiency, so there's a very long history of coming up with efficient solutions for managing very large datasets.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let me file to go into some more details and see what kind of interactions we might identify when we talk about databases.",
                    "label": 0
                },
                {
                    "sent": "On the one hand and semantic web on the other hand.",
                    "label": 0
                },
                {
                    "sent": "Probably look into the database area.",
                    "label": 0
                },
                {
                    "sent": "Clearly the most prominent issue, at least, would be to that kind of comparison and he is scalability.",
                    "label": 0
                },
                {
                    "sent": "And at least the people that are little bit as old as I am now, Bruce Lindsey and one of the key players are in the database community for many years.",
                    "label": 0
                },
                {
                    "sent": "When you talked with him about what are the issues in the database community, he said scaleability, and he's very famous.",
                    "label": 0
                },
                {
                    "sent": "Statement statement then was well, we just talk about performance, performance, performance of the Quasi's famous statement are many years ago.",
                    "label": 0
                },
                {
                    "sent": "But that really indicates what are the issues that.",
                    "label": 0
                },
                {
                    "sent": "At the database, people are really interested in the end.",
                    "label": 0
                },
                {
                    "sent": "When we, on the other hand, look into the semantic web community around, there has been strong interest in coming up with a rather expressive knowledge representation language.",
                    "label": 1
                },
                {
                    "sent": "He is that are then able to handle all these notions of uncertainty and heterogeneity.",
                    "label": 1
                },
                {
                    "sent": "When we compare these two communities for suspect to the kind of settings that are investigated well, then we can see in the database community we typically rely on.",
                    "label": 0
                },
                {
                    "sent": "What I called your control setting so when you build up a database application, you typically know what are the databases you want to integrate an for, what kind of application you want to integrate.",
                    "label": 1
                },
                {
                    "sent": "These kind of databases, so that is a lot of well defined setting you are handling in the end.",
                    "label": 0
                },
                {
                    "sent": "In opposite, when we moved to the Semantic web area, we rather talk about these very dental, decentralized settings.",
                    "label": 0
                },
                {
                    "sent": "We talk about our talk integration of different kind of sources where the people having developed these kind of sources did not imagine before hand what kind of combinations are the people would like to build on top of these resources in the end.",
                    "label": 0
                },
                {
                    "sent": "So there are really two different kinds of settings that are currently investigated.",
                    "label": 0
                },
                {
                    "sent": "And clearly we have then these notions of closed world assumption.",
                    "label": 0
                },
                {
                    "sent": "On the one hand, and open world assumption on the on the other hand.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We then move into some trends in the database area.",
                    "label": 0
                },
                {
                    "sent": "I would like to refer to some very recent development that has been very prominently pushed by Ellen Halevy and some of his colleagues.",
                    "label": 0
                },
                {
                    "sent": "The development being that the pointed notion of data spaces.",
                    "label": 0
                },
                {
                    "sent": "And compare them to what we typically assumed to be valid assumptions about databases in the end.",
                    "label": 0
                },
                {
                    "sent": "So what what's new with?",
                    "label": 0
                },
                {
                    "sent": "Respect to the notion of data spaces?",
                    "label": 0
                },
                {
                    "sent": "So instead of assuming that tight and well defined integration setting that I just characterized rather move to scenarios where you have a collection of databases that have to be.",
                    "label": 0
                },
                {
                    "sent": "Have to interact with each other in order to support specific kind of applications, but they preserve some kind of autonomy so you rather talk about coexistence of databases that interact in some vaguely defined way with each other in order to build up these new kind of data space applications.",
                    "label": 0
                },
                {
                    "sent": "When you have that general notion in mind, then you can identify more specific characteristics that are then relevant when you talk about these data space kind of applications.",
                    "label": 0
                },
                {
                    "sent": "One slogan used there is PS.",
                    "label": 0
                },
                {
                    "sent": "You go data management.",
                    "label": 0
                },
                {
                    "sent": "What does that mean?",
                    "label": 0
                },
                {
                    "sent": "But in traditional database settings, who talked about rather significant upset upfront investments, we have to make in order to come up with your database applications so you spend.",
                    "label": 0
                },
                {
                    "sent": "Sometimes months or even years, in order to build up your database applications to spend a lot of resources there and rather at the end when you finish your upfront investment.",
                    "label": 0
                },
                {
                    "sent": "Then you move into the exploitation area where you deploy your application, then really take profit of the kind of investment you have made from the very beginning.",
                    "label": 0
                },
                {
                    "sent": "In contrast to that, pay as you go, data management takes up that notion that you start with a very small amount of initial upfront investment and very soon after you have started into that kind of project you will get the 1st that benefit from having invested resources into these kind of applications.",
                    "label": 0
                },
                {
                    "sent": "So that fits very well to the kind of discussion we had last evening in the Web 2.0 Semantic Web panel.",
                    "label": 0
                },
                {
                    "sent": "We also discussed about how can we deliver technology that provides added value from the very beginning so that you do not have to invest half a year of a lot of money in a lot of people before you start to get your initial return of investment, but that you really want to have approaches.",
                    "label": 0
                },
                {
                    "sent": "Value investor only, small amount of resources, and then you immediately get in.",
                    "label": 0
                },
                {
                    "sent": "Edit value and that is the same kind of notion that is discussed in that data space context, and then specifically address typical questions that have to be addressed in the database community about query answering is clearly one prominent example in that area.",
                    "label": 0
                },
                {
                    "sent": "Then when you talk about query answering in these data space contexts.",
                    "label": 0
                },
                {
                    "sent": "You do not really talk about anymore about correct or false answers.",
                    "label": 0
                },
                {
                    "sent": "You rather talk about good or appropriate answers.",
                    "label": 0
                },
                {
                    "sent": "So if you want to talk about ranking of answer so you have all these big notions of very answering around that is very familiar with our for our semantic web community.",
                    "label": 0
                },
                {
                    "sent": "So when you talk about evolution in that context, we have to address the problem when you have that collection of data bases.",
                    "label": 0
                },
                {
                    "sent": "Being part of that data space available.",
                    "label": 0
                },
                {
                    "sent": "And one of these resources is modified to some extent.",
                    "label": 0
                },
                {
                    "sent": "How can you manage that evolution processes in that data space context?",
                    "label": 0
                },
                {
                    "sent": "Again, notions that are discussed in our semantic web community and clear then that asks for services that are more or less at the core of some of the developments that are currently going on in our community of how to handle inconsistency in the context of query answering and these kind of notions.",
                    "label": 0
                },
                {
                    "sent": "When you think about what are typically Ixia application scenarios where these notions of data spaces show up well, you can go into personal information management.",
                    "label": 0
                },
                {
                    "sent": "You can go into enterprise information integration, or you can go to these scenarios where your post queries to the World Wide Web.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I take one example from Ellen and that Contacts are in that area of personal information management that easily shows that you have all kind of information.",
                    "label": 0
                },
                {
                    "sent": "Being Excel sheets, PDF, documents, webpages, all these kind of resources databases in the background and they do have to handle all kinds of relationships between these different kind of resources and these kind of relationships are in no way predefined, so they are generated, are talk depending on the kind of application scenario you are currently investigating, so that are the kind of scenarios we are really discussing there.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "When we then move a little bit further into more details and first start was that notion of in the database community as a customer?",
                    "label": 1
                },
                {
                    "sent": "Then we can address different kind of.",
                    "label": 0
                },
                {
                    "sent": "Challenges that are relevant in the database community and where the semantic web community might provide some input in order to address these kind of challenges, I refer here to what has been called the lower database.",
                    "label": 1
                },
                {
                    "sent": "Reach out self assessment.",
                    "label": 0
                },
                {
                    "sent": "Uh, that was published last year in the communications.",
                    "label": 0
                },
                {
                    "sent": "Those of you familiar with the database community.",
                    "label": 1
                },
                {
                    "sent": "Now that typically every four to five years to key players in the database community meet somewhere in the world and define more or less a road map.",
                    "label": 0
                },
                {
                    "sent": "What are promising or interesting challenges to be addressed are in the database community and at lower database Research article is more or less the outcome of the last meeting.",
                    "label": 0
                },
                {
                    "sent": "With respect to that road map definition.",
                    "label": 1
                },
                {
                    "sent": "So when we.",
                    "label": 1
                },
                {
                    "sent": "Look into integration aspects that are then related to these notions of data spaces.",
                    "label": 0
                },
                {
                    "sent": "I have just mentioned, but one aspect really is how to come up with models for query answering.",
                    "label": 0
                },
                {
                    "sent": "Indent.",
                    "label": 1
                },
                {
                    "sent": "In that context there you see it, you see the quote here from that article that there is made a reference to the semantic Web community offering two main benefits in order to address these kind of integration challenges one is providing useful formalisms for representing ontologies.",
                    "label": 0
                },
                {
                    "sent": "And as you see, also that specific aspect they talk about simple but useful, and I think that's a very interesting and very relevant statement.",
                    "label": 0
                },
                {
                    "sent": "They are to talk about simplicity, but still usefulness in that context.",
                    "label": 0
                },
                {
                    "sent": "And the second aspect they are referring to is that concept of your eyes.",
                    "label": 0
                },
                {
                    "sent": "That is well known in our community, so therefore I think all the kind of work that we are currently doing with respect to semantic integration of data sources.",
                    "label": 0
                },
                {
                    "sent": "Being able to integrate structured as well as unstructured sources, being more flexible with respect to query answering, having these more.",
                    "label": 0
                },
                {
                    "sent": "Generic notions like good or bad answers, ranking of answers available.",
                    "label": 0
                },
                {
                    "sent": "They are all interesting and relevant for these notions of data spaces, and these integration aspects.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Second aspect I would like to mention this related to semantic mappings.",
                    "label": 0
                },
                {
                    "sent": "So in these data spaces, you cannot assume anymore that you have about defying collection of mappings available that relates these different sources to each other.",
                    "label": 0
                },
                {
                    "sent": "But you really have to assume that you have some vaguely defined mappings available that are certain to some extend, and there are.",
                    "label": 0
                },
                {
                    "sent": "These are notions that are there relevant in that context.",
                    "label": 0
                },
                {
                    "sent": "And again, he ideas made a nice statement, at least from my point of view, that they think there would be a good and it would be a very good idea to establish collaboration between groups.",
                    "label": 0
                },
                {
                    "sent": "Working on these and other related problems and the semantic web community is explicitly mentioned there and clearly when you look into the technical program of that conference or of some of the last conferences where we talk about mappings in various kind of settings, approximate more mappings.",
                    "label": 0
                },
                {
                    "sent": "We talk about accuracy of mappings.",
                    "label": 0
                },
                {
                    "sent": "We talk about how to.",
                    "label": 0
                },
                {
                    "sent": "Bottom up, generate mappings in some kind of emergent notion or B.",
                    "label": 0
                },
                {
                    "sent": "Talk about how we can we exploit reasoning to.",
                    "label": 0
                },
                {
                    "sent": "Detect inconsistency with respect to mappings, or derive subsumption relationship between different kind of mapping, so there's a lot of methods being developed in our community that are then immediately relevant for.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What kind of activities?",
                    "label": 0
                },
                {
                    "sent": "And finally, a third aspect?",
                    "label": 0
                },
                {
                    "sent": "I would like to address are these notions of uncertainty and inconsistency.",
                    "label": 0
                },
                {
                    "sent": "That will be very prominent in these data space scenarios because you cannot assume anymore that the kind of resources who will integrate in these scenarios will be consistent.",
                    "label": 0
                },
                {
                    "sent": "So everything related to handling of inconsistency and certainly in that kind of aspects will be relevant there as well.",
                    "label": 0
                },
                {
                    "sent": "And clearly there are activities going on in our community.",
                    "label": 0
                },
                {
                    "sent": "I just refer to that workshop that has been organized last year and this year about uncertainty reasoning for the semantic Web.",
                    "label": 0
                },
                {
                    "sent": "OK, so I think they are promising topics where the semantic web community can easily cooperate with the database community in order to come up with better solutions for some of these challenges in the end.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When we switch to a point of view and talk about databases and suppliers, then clearly we look first into what kind of scalability approaches are available in database area that might be fruitful for our community as well.",
                    "label": 0
                },
                {
                    "sent": "So I talk about all these optimization techniques that have been developed in the database community in order to optimize query answering in relational or also in deductive databases.",
                    "label": 0
                },
                {
                    "sent": "And when we compare that with these.",
                    "label": 0
                },
                {
                    "sent": "Classical approaches we had available in our systems for handling tee boxes in a boxes, and especially finding large boxes.",
                    "label": 0
                },
                {
                    "sent": "There was a clear inside that one could take profit from approaches that are available in the database community to come up with more efficient reasoners that are especially able to handle large boxes.",
                    "label": 0
                },
                {
                    "sent": "And as soon as you go into commercial settings, large boxes are there anyway.",
                    "label": 0
                },
                {
                    "sent": "'cause then you refer to larger databases that are part that are around in your company anyway and you have to be able to handle these large databases when you talk about our semantic based applications in the end.",
                    "label": 0
                },
                {
                    "sent": "Here I refer to that key and two development that shows as one example how you can bring together strains on the database community.",
                    "label": 0
                },
                {
                    "sent": "On the one hand, with approaches in our community, on the other hand.",
                    "label": 0
                },
                {
                    "sent": "So the basic idea was to come up with new kind of approach for developing efficient reasoners in a way that you take your DL knowledge base.",
                    "label": 0
                },
                {
                    "sent": "Then you apply some, I would say rather sophisticated transformation steps.",
                    "label": 0
                },
                {
                    "sent": "In order to generate in the end disjunctive Datalog program out of that DL knowledge base.",
                    "label": 0
                },
                {
                    "sent": "And that approach is somehow meaningful.",
                    "label": 0
                },
                {
                    "sent": "In the end Becausw you can prove that former property that if and only if a crowd fact is a logical consequence of your initial DL knowledge base.",
                    "label": 0
                },
                {
                    "sent": "It is also a logical consequence of your disjunctive Datalog program.",
                    "label": 0
                },
                {
                    "sent": "So you are on the safe side with respect to these kind of formal properties, and that enables through in the end instead of answering the query based on the error reasoning your answer your query based on these.",
                    "label": 0
                },
                {
                    "sent": "Optimization techniques that are known in the Datalog world, and then you come up with more efficient solution, specially with respect to handling large boxes Indian, so that's again for me.",
                    "label": 0
                },
                {
                    "sent": "A nice example of how you can pick up specific approaches in other communities here in the database community and combine them with techniques we are investigating in our community in order to deliver some more promising results.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, let's move on to the next community.",
                    "label": 0
                },
                {
                    "sent": "The software engineering community.",
                    "label": 0
                },
                {
                    "sent": "Now, what could be the conversation?",
                    "label": 0
                },
                {
                    "sent": "Our elevator?",
                    "label": 0
                },
                {
                    "sent": "Well, from the semantic web community point of view, we could strengthen our notion of formal models that then in the end support reasoning about these models and support reasoning about the resources that are described by these kind of models.",
                    "label": 1
                },
                {
                    "sent": "And when we think of the strength of the software engineering community, but they have a long history in their delivering architectures in delivering tool support and coming up with visual techniques for modeling and that kind of stuff.",
                    "label": 0
                },
                {
                    "sent": "So there's again scenarios where the strength of these communities are rather complementary, and therefore you can think about how to bring together the strength of these communities.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But let's again make a rather simplified comparison of ontologies.",
                    "label": 0
                },
                {
                    "sent": "On the one hand, and the notion of models as it is known from model to architectures in the software engineering community.",
                    "label": 0
                },
                {
                    "sent": "When we talk in our community about ontologies, we talk about structuring knowledge.",
                    "label": 0
                },
                {
                    "sent": "In the end, using them as a basis for deriving new knowledge based on some kind of inference techniques, and we ought to talk about languages like our debt really conversa I said defined formal semantics, at least in the basis for doing all that influencing in the end.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, when we look into the notion of models in the MDA community, but the basic idea to come up with these models was related to the aspect of coming up with models that abstract to some extent from the platforms we will use in the end for implementing your system.",
                    "label": 0
                },
                {
                    "sent": "So these models abstract from platform specific aspects, so that is 1 notion of abstraction that is very prominent in the MDA community.",
                    "label": 0
                },
                {
                    "sent": "Second aspect is there you really do not talk about inferencing.",
                    "label": 0
                },
                {
                    "sent": "Derive menu knowledge in the end.",
                    "label": 0
                },
                {
                    "sent": "So therefore when you talk about these models who have to completely specify all relevant information in these kind of models because they are then used in the end to try the construction of your final software system in the end so.",
                    "label": 0
                },
                {
                    "sent": "These models are characterized by being prescriptive in the end.",
                    "label": 0
                },
                {
                    "sent": "For the system you want to implement later on, and clearly when you talk about models and formalisms in the software engineering community, you malley's teachers to talk about.",
                    "label": 0
                },
                {
                    "sent": "Then the question is, is there any chance of praying on the one hand on teologi's and on the other hand these notions of MDA models together in order to see what could be a profit by?",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Bringing these two notions together.",
                    "label": 0
                },
                {
                    "sent": "Maybe some of you attended a presentation yesterday by such a problem and then colleagues about current activities going on in the OMT context about how to build up a bridge between our ontology world on the one hand and the UML world on the other hand.",
                    "label": 0
                },
                {
                    "sent": "And the basic idea is to come up with what is called an ontology definition mental model that is based on that three layer approach that is associated with that approach called metaobject facilities.",
                    "label": 0
                },
                {
                    "sent": "So you have your model layer where you're in our context would talk about the ontologies.",
                    "label": 0
                },
                {
                    "sent": "Then you have the metalia value.",
                    "label": 0
                },
                {
                    "sent": "Define your meta model for your ontology and that is then based on that meta meta model that is.",
                    "label": 0
                },
                {
                    "sent": "Defined as the starting point being represented by Dead Metaobject facility.",
                    "label": 0
                },
                {
                    "sent": "So that is that well known.",
                    "label": 0
                },
                {
                    "sent": "Three layer notion.",
                    "label": 0
                },
                {
                    "sent": "It is available from the software engineering community, so how can you then think about building up a bridge between the Umm Albert on the one hand and our ontology world on the other hand.",
                    "label": 0
                },
                {
                    "sent": "But you rely on that meta object facility providing these meta meta notions to define meta model space on morph in the end.",
                    "label": 0
                },
                {
                    "sent": "And those of you are familiar with your Mail now that we are able to define their design UML profiles, but then also able to come up with some kind of visual syntax.",
                    "label": 0
                },
                {
                    "sent": "Then on that meter model level you can't define precisely the relationships between your UML profiles.",
                    "label": 0
                },
                {
                    "sent": "On the one hand and your ontology meta model on the other hand, and by having mappings in both directions, there's a clearly defined path of going from the ontology world to do UML world and vice versa.",
                    "label": 0
                },
                {
                    "sent": "And then on the bottom level you have on the one hand your ontologies, or you have in the UML world you're human model, and since the mappings on the metal layer are precisely defined, you have also clearly defined relationship on that model level between ontologies and.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The two male models probably then look into again that supplier and customer relationship.",
                    "label": 0
                },
                {
                    "sent": "What is software engineering providing as a supplier?",
                    "label": 0
                },
                {
                    "sent": "Well, all these MDA notions.",
                    "label": 0
                },
                {
                    "sent": "These model driven architecture notions provide valuable input for our community.",
                    "label": 0
                },
                {
                    "sent": "You talk about interoperability in that context across platforms.",
                    "label": 0
                },
                {
                    "sent": "That is something that is also relevant for our community.",
                    "label": 0
                },
                {
                    "sent": "Here you talk about modeling tools that are there any way that then might be exploited in our ontology world in the same way.",
                    "label": 0
                },
                {
                    "sent": "You come up with that approach that you are able to specify your models in your in a way that is abstracting from your specific ontology formalism so you come up with an abstract specification of your ontology model.",
                    "label": 0
                },
                {
                    "sent": "Then in a second step you grounded abstract model by providing transformations into specific languages like our for example, all transformations into F logic to mention as a second possibility.",
                    "label": 0
                },
                {
                    "sent": "So we have a clear separation between the abstract model.",
                    "label": 0
                },
                {
                    "sent": "Fatal define the basic ingredients of your ontology model and then you can map that to specific formulas that are then well known from the KR community.",
                    "label": 0
                },
                {
                    "sent": "And by having these mappings to UML profiles, are you also buy in?",
                    "label": 0
                },
                {
                    "sent": "In the end, the visual modeling techniques that are associated with your Mail.",
                    "label": 0
                },
                {
                    "sent": "So that is, for example one approach we are currently investigating in our European funded neon project where we define an abstract model for network ontologies and that is exactly based on that approach.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm currently outlined when we switch their point of view and discuss software engineering as a customer.",
                    "label": 0
                },
                {
                    "sent": "Well then clearly that initial statement Astrik made that we come up with very formally defined models that support reasoning.",
                    "label": 0
                },
                {
                    "sent": "That is the kind of added value we provide to the software engineering community.",
                    "label": 0
                },
                {
                    "sent": "So when you have models where you have to align vocabularies for example to each other, you can exploit these semantic alignment approaches that are discussed in our community.",
                    "label": 0
                },
                {
                    "sent": "We can better support by having these former models available, consistency checking and model validation.",
                    "label": 0
                },
                {
                    "sent": "We are to some extent better able to integrate information from different kind of resources to support the query.",
                    "label": 0
                },
                {
                    "sent": "Answering in these heterogeneous environments, not just when you think of applications where some kind of policies are rather relevant thing.",
                    "label": 0
                },
                {
                    "sent": "For example of all these notions of compliance management that are more and more important for for industry, in or all kind of sectors.",
                    "label": 0
                },
                {
                    "sent": "By providing these formal specifications of these policies.",
                    "label": 0
                },
                {
                    "sent": "It is again an edit value that we might provide to these software engineer into that software engineering community based on all these model based approaches in the end and he will see just one of several possible references to work and it has been done in our community in order to show how you can formally define reasoning in the UML context.",
                    "label": 0
                },
                {
                    "sent": "And here I have one reference tool.",
                    "label": 0
                },
                {
                    "sent": "That lens or any paper 2002.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, there was a discussion of the software engineering community.",
                    "label": 0
                },
                {
                    "sent": "And what about the natural language processing community?",
                    "label": 0
                },
                {
                    "sent": "Well again, but we think our supply of you.",
                    "label": 0
                },
                {
                    "sent": "We could say, well we have all these ontology and reasoning mechanisms available that might then improve the handling of some specific challenges that are well known in the Inipi community.",
                    "label": 0
                },
                {
                    "sent": "Like for example, all these disambiguation problems that are well known there.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, when you see what are the strengths of the NLP community while they have a long history in providing very solid techniques for information.",
                    "label": 0
                },
                {
                    "sent": "Extraction and also associated tools in order to support these info.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mission extension processes.",
                    "label": 0
                },
                {
                    "sent": "So when we first look into NLP as a customer, one prominent notion of support for the inner peak community is to better support these disambiguation processes in various kind of settings.",
                    "label": 0
                },
                {
                    "sent": "So when you think of posting queries to some kind of resources by you, some compounds, like for example, you might have medicine and headache, and then the question is, do you talk about?",
                    "label": 0
                },
                {
                    "sent": "A query that asks for documents, for example talking about medicine that causes headaches or that curse headache.",
                    "label": 0
                },
                {
                    "sent": "So there are different semantic interpretation of these compound interpretations and ontologies might provide added value to handle these different kind of notions.",
                    "label": 0
                },
                {
                    "sent": "When you talk about lexical ambiguities again window move into specific application domains and come up with specific models for that application domain.",
                    "label": 0
                },
                {
                    "sent": "There is a good chance that you might reduce the number of.",
                    "label": 0
                },
                {
                    "sent": "Ambiguities have to handle in the end.",
                    "label": 0
                },
                {
                    "sent": "Here my example when you talk about corner and go to bed at night, you find of different kind of 11 different kind of meetings being defined there.",
                    "label": 0
                },
                {
                    "sent": "But when you move then for example into the soccer domain, what we did in our smart web project in Germany, then only two of these readings are really available.",
                    "label": 0
                },
                {
                    "sent": "In the end, either corner is a location on the playing ground or it's some action of a player, but all other possible notions are not available.",
                    "label": 0
                },
                {
                    "sent": "Anymore when you have modeled your soccer domain in the right way, and here you could also talk about supporting the handling of syntactic ambiguities like prepositional phrases.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That kind of stuff.",
                    "label": 0
                },
                {
                    "sent": "When we talk about deploying ontologies in order to support these in our peer process is 1 current discussion going on is whether to rather use domain specific ontologies, or rather to use foundational ontologies.",
                    "label": 0
                },
                {
                    "sent": "Why might foundational ontologies being relevant in that context?",
                    "label": 0
                },
                {
                    "sent": "But when you think about defining meaning across application domains, foundational ontologies like culture, for example, might provide the.",
                    "label": 0
                },
                {
                    "sent": "Right support in order to support these definitions of meanings across domains, whereas in other settings it might be more appropriate to refer to these domain specific ontologies.",
                    "label": 0
                },
                {
                    "sent": "And clearly when you talk about natural language construct that refer to some spatial or refer to some temporal notions.",
                    "label": 0
                },
                {
                    "sent": "Again these ontologies might provide.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Later, additional value.",
                    "label": 0
                },
                {
                    "sent": "Change the view to another PS supplier.",
                    "label": 0
                },
                {
                    "sent": "Well clearly there's a long history and well established test settings and test beds available in order to talk about information extraction that area, the message understanding conference.",
                    "label": 0
                },
                {
                    "sent": "A very prominent example for these kind of activities.",
                    "label": 0
                },
                {
                    "sent": "So that is clearly an area of of the NLP community where we can just take profit in our community of.",
                    "label": 0
                },
                {
                    "sent": "A new development that has been established in rather recent year is to combine some inner P processing techniques with information sources you find on the web so that you use web sources as some kind of corpus to support evidence for specific aspects.",
                    "label": 0
                },
                {
                    "sent": "So when we think about generating facts for a box, for example where you talk about facts being associated with some kind of specific classes, you can go.",
                    "label": 0
                },
                {
                    "sent": "Out into the web and see if do you find support for that kind of fact you want to include into your a box by investigating a large corpus you find on the web in the end, so that have been recent developments that had been showing that exploiting that web resources combined versa.",
                    "label": 0
                },
                {
                    "sent": "Linguistic processing is rather promising.",
                    "label": 0
                },
                {
                    "sent": "In order to come up with better results in that AM.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It might also apply when you talk about ontology evaluation.",
                    "label": 0
                },
                {
                    "sent": "I will go into some detail with respect to that specific topic.",
                    "label": 0
                },
                {
                    "sent": "I assume at least some of you are well aware that onto clean a methodology that provides some meter taking for the concepts you define in your ontology so that you talk about.",
                    "label": 0
                },
                {
                    "sent": "Concept being rich it or talking about identity and these kind of notions and those of you that already have looked into these kind of papers by Nikolai and his colleagues.",
                    "label": 0
                },
                {
                    "sent": "Well, they know it's not that easy to really apply that onto clean techniques in real life settings and therefore the question is is there chance to provide some support in order to be better able to handle these kind of?",
                    "label": 0
                },
                {
                    "sent": "Notions in order to support this ontology.",
                    "label": 0
                },
                {
                    "sent": "Evaluation processes, and again, one idea is to take some linguistic patterns and then diploid them to the web and see whether the web supports.",
                    "label": 0
                },
                {
                    "sent": "Are these patterns you have defined in the very beginning.",
                    "label": 0
                },
                {
                    "sent": "So here's an example.",
                    "label": 0
                },
                {
                    "sent": "When you find a statement like or a sentence like, he is no longer a student.",
                    "label": 0
                },
                {
                    "sent": "And just think about taking a concept like student with.",
                    "label": 0
                },
                {
                    "sent": "Former property like being rich, it or not.",
                    "label": 0
                },
                {
                    "sent": "Then clearly when you find these kind of statements you know about student might not be a concept that you would like to take as being rich.",
                    "label": 0
                },
                {
                    "sent": "It becausw that statement say well at some point of time a person might be a student, but then he might lose that role.",
                    "label": 0
                },
                {
                    "sent": "Maybe later on become an employee or whatever the next role that might be.",
                    "label": 0
                },
                {
                    "sent": "So when you find these kind of linguistic evidence is on the web then that is a clear indication that are taking.",
                    "label": 0
                },
                {
                    "sent": "Based on that, onto clean approach has to reflect that a person might change that kind of role.",
                    "label": 0
                },
                {
                    "sent": "So student is a temporary Rd.",
                    "label": 0
                },
                {
                    "sent": "You might play it, but not for all of your life.",
                    "label": 0
                },
                {
                    "sent": "Second example, connecting more than two computers requires a hub.",
                    "label": 0
                },
                {
                    "sent": "Again, that is an indication that you.",
                    "label": 0
                },
                {
                    "sent": "Can talk about a concept like computers being countable and therefore you may assume that the computers have to carry some kind of identity, otherwise we are not able to count 1, two or three computers in the end.",
                    "label": 0
                },
                {
                    "sent": "And therefore the basic idea was to exploit these kind of patterns.",
                    "label": 0
                },
                {
                    "sent": "So pattern might be he or she is no longer A and then it depends on the specific scenario better than you asked for student or employee or professor whatever and then to post these kind of queries to the web and see whether the web resources provide positive or negative evidences for these kind of metal properties and a nice feature of that development also is.",
                    "label": 0
                },
                {
                    "sent": "That by refering to web resources to somehow overcome your data.",
                    "label": 0
                },
                {
                    "sent": "Sparseness problem in.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that is somehow briefly reflected in that in that architecture here, so that you take that pattern library.",
                    "label": 0
                },
                {
                    "sent": "You then post these queries to the web.",
                    "label": 0
                },
                {
                    "sent": "You analyze linguistically the answers you get back, you do some evaluation and based on that evaluation and classifier makes a decision in the end whether are taking with plus R saying that that is a Richard concept or for example is a valid meta tag, you would.",
                    "label": 0
                },
                {
                    "sent": "Like to associate with.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Your concept or not OK, so that was a nice example where you combine web resources, natural language processing and also what you have seen by referring to classifier.",
                    "label": 0
                },
                {
                    "sent": "Some machine learning aspects.",
                    "label": 0
                },
                {
                    "sent": "That is the final topic.",
                    "label": 0
                },
                {
                    "sent": "I would like to address.",
                    "label": 0
                },
                {
                    "sent": "What might be the interaction between machine learning and semantic web community?",
                    "label": 0
                },
                {
                    "sent": "Well by prominent example, when you talk about text classification, text clustering is that they are the bag of words model is rather.",
                    "label": 0
                },
                {
                    "sent": "Prominent, but that is a completely syntactic notion, and we might improve that notion with some more semantics in the end and the machine learning people.",
                    "label": 0
                },
                {
                    "sent": "Well, they might say, well, we are well established in order to apply learning algorithms in order to generate at least some parts of your epoxies and Tipo.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Since in the end.",
                    "label": 0
                },
                {
                    "sent": "So when you look into recent work in that kind of area, you might see work that improves that bag of word model with some kind of semantics.",
                    "label": 0
                },
                {
                    "sent": "In order to come up with better results, respect or text clustering or text classification.",
                    "label": 0
                },
                {
                    "sent": "Do you have to be aware that you have to plug in these kind of semantic enhancements in a very careful way?",
                    "label": 0
                },
                {
                    "sent": "Becausw evaluation show that if you do that in approved for sway, the results might even become worse compared to the simple syntactic approach.",
                    "label": 0
                },
                {
                    "sent": "So you really need some know how how to do that in the right way.",
                    "label": 0
                },
                {
                    "sent": "Also, when you go to for example notions like semantics with Spectra image recognition so that you are really interested.",
                    "label": 0
                },
                {
                    "sent": "What people do in the media project, for example to come up versa.",
                    "label": 0
                },
                {
                    "sent": "Semantic interpretation of specific pictures or when you see that nice beach picture here you want to be able to identify that you that you find a person here you might not see that in the at the end of the debate over that seminar Hall here.",
                    "label": 0
                },
                {
                    "sent": "So here you find the person he'll find some rocks in the background so that are the kind of elements you want to identify in the end in order to get a semantic description what you can see on that.",
                    "label": 0
                },
                {
                    "sent": "Picture and again in the background you need or different kind of classifiers to come up with these kind of solutions in the end.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, when we talk about machine learning as a supplier value, find all kind of machine learning techniques that are relevant in that context.",
                    "label": 0
                },
                {
                    "sent": "You might refer to.",
                    "label": 0
                },
                {
                    "sent": "I'll P. Inductive logic programming for induction of concept definitions.",
                    "label": 0
                },
                {
                    "sent": "You might refer to Association rule techniques in order to derive new Association between concepts.",
                    "label": 0
                },
                {
                    "sent": "Or you might refer to clustering techniques in order to learn some taxonomical structures in the end.",
                    "label": 0
                },
                {
                    "sent": "That is, for example currently being investigated in the second project, most prominently by ARCO hired by our colleagues at the Chairs Eye Institute in Slovenia.",
                    "label": 0
                },
                {
                    "sent": "And that's again a very nice example of for that interdisciplinary bird that is going on in the second project, where you'll find people from the natural language processing error, the machine learning area, and the ontology management area.",
                    "label": 0
                },
                {
                    "sent": "And these people really work closely together in order to come up with new solutions for supporting the generation of meta data or the generation of these ontologies in the end.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, that was the overview about some relevant communities where the semantic community is closely interacting with really, there's a much longer list available of communities.",
                    "label": 0
                },
                {
                    "sent": "I might have discussed today, but there is no chance to really address.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These topics today.",
                    "label": 0
                },
                {
                    "sent": "OK, let's briefly look into some business aspects.",
                    "label": 0
                },
                {
                    "sent": "In the third part of my.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Talk so when I talk about business aspects, please be aware that I here refer to the notion of semantic technologies.",
                    "label": 0
                },
                {
                    "sent": "I do not talk about semantic web technologies because the kind of application scenarios you're currently see that are mainly exploited in the commercial setting.",
                    "label": 0
                },
                {
                    "sent": "They are more related to these enterprise settings of you talk about enterprise information integration, enterprise content management, ERP systems, enterprise resource planning systems, or you talk about product lifecycle management.",
                    "label": 0
                },
                {
                    "sent": "There when you look into market estimates of what fraction of the market might be covered in the end by semantic technology based solutions.",
                    "label": 0
                },
                {
                    "sent": "While you find statements like up to 20% of these markets, might Indian be covered by semantic technology based approaches you find also kind of strategic development to identify what some people call a semantic middleware layer.",
                    "label": 0
                },
                {
                    "sent": "Why you cluster all these semantic technology related functionalities in order to support the Indies end user applications?",
                    "label": 0
                },
                {
                    "sent": "You see here the example of that neon reference architecture that is currently being developed as a reference architecture to support these semantic technology based applications.",
                    "label": 0
                },
                {
                    "sent": "And then you find here in that layer services like reasoning services, annotation, services, evolution services.",
                    "label": 0
                },
                {
                    "sent": "That then might be accessed via some web service interfaces by these end user components, so that is also one development going on.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When we more specifically look into these application areas, you see here, for example, some estimates for 2010 movie.",
                    "label": 0
                },
                {
                    "sent": "Just take the first one enterprise content management.",
                    "label": 0
                },
                {
                    "sent": "While the estimate is that maybe 20% of that market will be covered by semantic approaches, then you talk about a market size of about 1100 million euros on.",
                    "label": 0
                },
                {
                    "sent": "That is some significant amount of market there.",
                    "label": 0
                },
                {
                    "sent": "And to see similar numbers in these other areas like information integration or for example enterprise resource planning.",
                    "label": 0
                },
                {
                    "sent": "So I think there is a.",
                    "label": 0
                },
                {
                    "sent": "Clear market available for these kind of semantic technologies.",
                    "label": 0
                },
                {
                    "sent": "From my point of view, Countly rather in the enterprise context and not in the web context.",
                    "label": 0
                },
                {
                    "sent": "But there is a clear market for these kind of tech.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cheese and just to show you one example, that product from Software AG that is based on semantic technology.",
                    "label": 0
                },
                {
                    "sent": "In the end, some technology provided by Enterprise in the background that addresses these notions of information integration where you start by lifting.",
                    "label": 0
                },
                {
                    "sent": "In the end all your different kind of heterogeneous sources being that databases, HTML repositories, whatever you have on that ontology level.",
                    "label": 0
                },
                {
                    "sent": "So that you have done a semantic description of these sources available, you have.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, what is called here, a business ontologies and views defined on top of it that define the application scenario you want to support the in the end and then to connect these business ontologies with these source description.",
                    "label": 0
                },
                {
                    "sent": "Paula.",
                    "label": 0
                },
                {
                    "sent": "Geez, you come up with these articulated mappings and that is the kind of added value you have available here becauses these kind of approaches.",
                    "label": 0
                },
                {
                    "sent": "So a better understandable for the application people maintenance is more easy because you specify these mappings on a more abstract layer and also by having that semantic description of these sources available, we are also in a better shape to later on move into the second and third kind of application scenario by exploiting these semantic description of these.",
                    "label": 0
                },
                {
                    "sent": "So that is 1 example where a big company is already redeploying that kind of technology in there.",
                    "label": 0
                },
                {
                    "sent": "Products and making some money on the market with that kind of.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Technology.",
                    "label": 0
                },
                {
                    "sent": "To conclude that business notion, I refer to a slide.",
                    "label": 0
                },
                {
                    "sent": "Richard Benjamin showed this at this year's World Wide Web Conference, and it's hard to maintain.",
                    "label": 0
                },
                {
                    "sent": "And also it's not that easy to really make good cost estimates.",
                    "label": 0
                },
                {
                    "sent": "So how costly will it be to come up with all these are kind of ontologies Indian and therefore in order to really convince customers that we come up with really meaningful technology in the end we have to show that we can do all these ontology engineering activities in a controlled way.",
                    "label": 0
                },
                {
                    "sent": "Well managed and that we come up with approaches that are also affordable for these kind of customers and we also have to show what is really the edit value by using that kind of technology compared to using the more conventional technology.",
                    "label": 0
                },
                {
                    "sent": "And I think one of the nice work in that area in order to make progress with respect to these kind of aspect was a paper presented at that conference by Ilana and colleagues about that onto come approach.",
                    "label": 0
                },
                {
                    "sent": "That provides first solutions for coming up with estimations of how costly will it be to engineer specific ontology in specific settings for specific application domains.",
                    "label": 0
                },
                {
                    "sent": "Really, we still need much more experimental data in order to really fine tune these kind of models.",
                    "label": 0
                },
                {
                    "sent": "In the end we are in a match.",
                    "label": 0
                },
                {
                    "sent": "The software engineering community is in much better shape in that context because they have a lot of experimental data available to support these kind of cost estimations.",
                    "label": 0
                },
                {
                    "sent": "So I can just make a statement here that we all have to contribute in order to collect these kind of experimental and empirical data in order to be better able to fine tune these kind of models Indian and we really need these kind of models in order to be able to talk to.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our customers.",
                    "label": 0
                },
                {
                    "sent": "OK, let's come to the end of my presentation.",
                    "label": 0
                },
                {
                    "sent": "What are some take home messages?",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And some final trans I see, but when we look into the different communities I saying well with respect to key.",
                    "label": 0
                },
                {
                    "sent": "Are there is a rather nice Corporation already going on?",
                    "label": 0
                },
                {
                    "sent": "We may talk about the database community and let's look into this road map definitions.",
                    "label": 0
                },
                {
                    "sent": "They are very similar challenges being defined, but we still have to see whether the mainstream activities in a database community really pick up these kind of challenges.",
                    "label": 0
                },
                {
                    "sent": "We talk about NLP and machine learning.",
                    "label": 0
                },
                {
                    "sent": "We I see a huge potential in that cooperation, but it is not really be for yet exploited.",
                    "label": 0
                },
                {
                    "sent": "In that context, Spectra software engineering or I have shown that example in that own G context, but that is 1 island of.",
                    "label": 0
                },
                {
                    "sent": "Cooperation, and I think there would be much more opportunities to really improve that kind of cooperation.",
                    "label": 0
                },
                {
                    "sent": "I mean, I talked about business aspects are really seeing that we are currently in the state where we can clearly talk about corporate semantic web applications.",
                    "label": 0
                },
                {
                    "sent": "Are you really see markets for these kind of technologies in the end?",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, but what are some trends?",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I see in the end and that will be the conclusion of my talk today, while we see all kind of developments going on in order to investigate the relevant notions.",
                    "label": 0
                },
                {
                    "sent": "When we talk about our web community about our semantic web community and that initiative of defining our websites, most prominently pushed by team and some colleagues, but that clearly identifies that we have to address more aspects than only the technical ones in order to really be.",
                    "label": 0
                },
                {
                    "sent": "Able to address all relevant parts when we talk about web applications in the end and I still and I think well and semantic web is clearly one important building block.",
                    "label": 1
                },
                {
                    "sent": "When we talked about that website stuff in the end.",
                    "label": 1
                },
                {
                    "sent": "When you think of the invited talk given by Tom on the first day, the panel yesterday, I think there was a clear agreement that the Web 2.0 Community on the one hand and the semantic web community, on the other hand, have rather complementary strains and challenges.",
                    "label": 1
                },
                {
                    "sent": "How to combine the strengths of both communities and what I see is contribution that we might make from our semantic web community.",
                    "label": 0
                },
                {
                    "sent": "Is this well defined notions of structuring based on ontologies?",
                    "label": 0
                },
                {
                    "sent": "The re usability of Meta data, you could say the usability of tags based on that more formal notions in the end and also having that formal basis available and make our representation formalisms like RDF available.",
                    "label": 1
                },
                {
                    "sent": "I think that on the fly combination of applications is a rather promising method that is provided by the semantic web community in the end.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Along these lines, I would just like in the end I refer to 1 project.",
                    "label": 0
                },
                {
                    "sent": "We currently carry out in class with the Semantic Mediawiki that is for my example very good example of how to combine the strength of these.",
                    "label": 0
                },
                {
                    "sent": "Two communities in the end, the basic idea is just take the Mediawiki as in all the meter wiki.",
                    "label": 0
                },
                {
                    "sent": "Up plug in some small semantic ingredients.",
                    "label": 0
                },
                {
                    "sent": "And one in creating these that you plug in type cling so that you can really talk about location in a well defined way.",
                    "label": 0
                },
                {
                    "sent": "When you relate this week with essence that you type attributes in a well defined way so that you really know what you are talking about when you talk about the starting date of this week, November 7th this year.",
                    "label": 0
                },
                {
                    "sent": "And by having these kind of notes available, you can immediately provide any value becausw you are then able to support a query answering like for example querying for some kind of conferences in the autumn over 2006.",
                    "label": 0
                },
                {
                    "sent": "So that's again.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Scenario where you have instant rewards by providing some kind of semantic techniques on top of what is already available and you have to clearly keep in mind usability and simplicity, because people that use on that Mediawiki stuff they are not willing to go in four weeks of training in order to be able to specify ontologies, that kind of stuff we really have to be careful how much of additional technology you want to deploy in that.",
                    "label": 0
                },
                {
                    "sent": "Mediawiki environment and I think that's a good example of how synergy between these different notions might be achieved in the end.",
                    "label": 0
                },
                {
                    "sent": "And also yesterday there was a discussion about.",
                    "label": 0
                },
                {
                    "sent": "Bringing semantics to the web or to the people and Semantic, Mediawiki is a good example of bringing semantics.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "People OK, thanks for your attention and clearly what I presented is based on a lot of peoples work either in cards or somewhere else.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you and since it offered in my interesting talk you mentioned, image recognition in your talk, I'm very much interested in your opinions about the relations between the semantic web community and the multimedia community in general.",
                    "label": 0
                },
                {
                    "sent": "It seems to me that the connection between the two communities are getting stronger these days and W 3C recently set up a multimedia semantics incubator group and three out of five.",
                    "label": 0
                },
                {
                    "sent": "And Semantic Web challenge of this conference mean three out of five finalists of the Semantic Web Challenge in this conference from members of this incubator groups.",
                    "label": 1
                },
                {
                    "sent": "So an actor in general applications in this domain and not necessarily restricted to machine learning.",
                    "label": 0
                },
                {
                    "sent": "So I'm just wondering if you would like to comments on relations between.",
                    "label": 0
                },
                {
                    "sent": "And this to research community.",
                    "label": 0
                },
                {
                    "sent": "Well, I completely agree with your statement that there is a fruitful cooperation evolving between the multimedia community on the one hand in our community that would also have been a good candidate to be part of my talk today to talk about these.",
                    "label": 0
                },
                {
                    "sent": "These kind of relationships.",
                    "label": 0
                },
                {
                    "sent": "When does talk about the challenges there?",
                    "label": 0
                },
                {
                    "sent": "Well, you have some tradition of doing analysis in the multimedia community.",
                    "label": 0
                },
                {
                    "sent": "That is, I would say more pixel based to make that kind of statement and we come with.",
                    "label": 0
                },
                {
                    "sent": "These are semantic notions, armor from a top down point of view and one of the challenges I see here and some of the recent development show how you can bring these two words together is how to really build up a bridge from these more very low level notions that are provided by the.",
                    "label": 1
                },
                {
                    "sent": "Multimedia people by talking about all that pixel stuff and then coming up with these semantic interpretations.",
                    "label": 0
                },
                {
                    "sent": "When you do not talk about anymore blue area are a red area on your picture, but where you rather talk about the see in your picture and that is the kind of things and then you see that you need all kind of methods and approaches and clearly some kind of machine learning techniques are one prominent example you exploit in that context.",
                    "label": 0
                },
                {
                    "sent": "So I think that is an area where we hopefully will make.",
                    "label": 0
                },
                {
                    "sent": "A lot of progress in the upcoming future.",
                    "label": 0
                },
                {
                    "sent": "OK thanks.",
                    "label": 0
                },
                {
                    "sent": "Community and my own observation was that actually the uptake, especially in the conference.",
                    "label": 0
                },
                {
                    "sent": "We could convert if you look at actual paper trying to come up with scalable data management solution for our community.",
                    "label": 0
                },
                {
                    "sent": "It's actually not that big, so there not that many, many, many.",
                    "label": 0
                },
                {
                    "sent": "Any ideas really inside how we can.",
                    "label": 0
                },
                {
                    "sent": "Improve.",
                    "label": 0
                },
                {
                    "sent": "What I need to do to get them more interested?",
                    "label": 0
                },
                {
                    "sent": "You see, that's a topic I was interested from the very beginning when I moved somehow into the semantic web community to have a close interaction with the database community.",
                    "label": 0
                },
                {
                    "sent": "So some of you might remember that we had turn monopolist as a PC chair some year ago in order to somehow by in the database community when you go to the website of our Web semantics Journal, you find 1 prominent area being defined there.",
                    "label": 0
                },
                {
                    "sent": "The database area in that context.",
                    "label": 0
                },
                {
                    "sent": "Because I really think that the kind of solutions that are available or being developed in the database community are really relevant for our community as well.",
                    "label": 0
                },
                {
                    "sent": "For me, that's a typical problem of how to build up a bridge between different kind of communities.",
                    "label": 0
                },
                {
                    "sent": "When a little bit look into my history, we've started as a database person, then moved into software engineering, then moved into AI, and now in the semantic Web community.",
                    "label": 0
                },
                {
                    "sent": "It's not that easy to really be present in a lot of different communities.",
                    "label": 0
                },
                {
                    "sent": "Show up at all these events being connected with other peoples being the key players in one or in the other community.",
                    "label": 0
                },
                {
                    "sent": "So I think that is an effort a lot of people have to invest into in order to really better build up these kind of preachy is with respect to the database community in our community, for example, one question one could raise is how many of us are submitting papers to reveal DB conference or to a SIGMOD conference.",
                    "label": 0
                },
                {
                    "sent": "The unit had to do some hard work in order to reach that kind of level, but then that would be one way of at least making our.",
                    "label": 0
                },
                {
                    "sent": "Achievements in our methods are more available in the database community and therefore also get some feedback from the database community.",
                    "label": 0
                },
                {
                    "sent": "What's going on in our community, but that needs real effort by individuals to really invest into that kind of cooperation.",
                    "label": 0
                },
                {
                    "sent": "Adding to that debate though.",
                    "label": 0
                },
                {
                    "sent": "I mean, we have submitted for example to database community, but we really have to write the papers very, very differently.",
                    "label": 0
                },
                {
                    "sent": "So you can't really write about RDF, you have to write as a graph.",
                    "label": 0
                },
                {
                    "sent": "And recently you know they have warmed up to graph for example and they would like things related to graph computation.",
                    "label": 0
                },
                {
                    "sent": "Or you can go to data mining conferences and publish about graph.",
                    "label": 0
                },
                {
                    "sent": "But you're asleep.",
                    "label": 0
                },
                {
                    "sent": "All these ur eyes and RDF and other things, and the name relationship to do that.",
                    "label": 0
                },
                {
                    "sent": "So I think there are a lot of compromises your to make if you want to.",
                    "label": 0
                },
                {
                    "sent": "Kind of.",
                    "label": 0
                },
                {
                    "sent": "Force and publishing to another community.",
                    "label": 0
                },
                {
                    "sent": "So why not publishing semantic web conferences?",
                    "label": 0
                },
                {
                    "sent": "Now?",
                    "label": 0
                },
                {
                    "sent": "There are things, so these are the challenges that we have as to think somebody's committee has been very slow for very long time.",
                    "label": 0
                },
                {
                    "sent": "SIGMOD never accepted much into the modeling issues.",
                    "label": 0
                },
                {
                    "sent": "We are limited.",
                    "label": 0
                },
                {
                    "sent": "It was one of the more forward looking.",
                    "label": 0
                },
                {
                    "sent": "And even now, today there is always difficulty in conceptual aspects in modeling as we saw that while I think some of our you know, our communities probably more open to that.",
                    "label": 0
                },
                {
                    "sent": "So while each committee finds enough of the things in their thing, they're going to continue that way.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, if they think that they are threatened in the existence, maybe they'll be more open to a more open to that.",
                    "label": 0
                },
                {
                    "sent": "Maybe database is not too far from there, but we'll see.",
                    "label": 0
                },
                {
                    "sent": "I still practice from the University of Tokyo.",
                    "label": 0
                },
                {
                    "sent": "I was wondering about your opinions about other communities, particularly applied science communities, and whether how much awareness they have of the activities in this community.",
                    "label": 0
                },
                {
                    "sent": "We heard a little bit about how the human Genome Community leveraged effectively ontologies.",
                    "label": 0
                },
                {
                    "sent": "Do you have any feeling for how this is being perceived in other applied science communities?",
                    "label": 0
                },
                {
                    "sent": "Well, I did not.",
                    "label": 0
                },
                {
                    "sent": "Address these kind of topics today because for example, Spectra Life Sciences.",
                    "label": 0
                },
                {
                    "sent": "That was a very prominent presentation color gave last year about all these kind of interactions between our community and the Life science community.",
                    "label": 0
                },
                {
                    "sent": "I completely agree that there are other communities around that are really good customers, so to speak, for for the kind of technology we have available.",
                    "label": 0
                },
                {
                    "sent": "Therefore not mentioning here as one prominent part of my talk doesn't mean that I do not think that it is.",
                    "label": 0
                },
                {
                    "sent": "Relevant community interested to see what fits into a one hour presentation, indeed.",
                    "label": 0
                },
                {
                    "sent": "But I completely agree with your observation.",
                    "label": 0
                },
                {
                    "sent": "I'm interested when it comes to the relationship between this semantic web technology and software engineering.",
                    "label": 0
                },
                {
                    "sent": "Software engineering has gone through a few phase changes, for example, when.",
                    "label": 0
                },
                {
                    "sent": "We moved from's structures to objects.",
                    "label": 0
                },
                {
                    "sent": "Then the philosophy changed the whole way of thinking about the software changed, and as a result we had to we.",
                    "label": 0
                },
                {
                    "sent": "Although you can write in C in a in a sort of object oriented paradigm, you actually had to move to a new languages.",
                    "label": 0
                },
                {
                    "sent": "Now with Semantic Web data we have very different philosophy.",
                    "label": 0
                },
                {
                    "sent": "With this openness.",
                    "label": 0
                },
                {
                    "sent": "The fact that you can load data for land and get piece of information which you have not programmed for but which you may still be able to use.",
                    "label": 0
                },
                {
                    "sent": "The fact that you have to be able to have.",
                    "label": 0
                },
                {
                    "sent": "The same object may have data may have the same sort of data about it, but from different sources.",
                    "label": 0
                },
                {
                    "sent": "You have to be able to be aware of those things.",
                    "label": 0
                },
                {
                    "sent": "Do you think?",
                    "label": 0
                },
                {
                    "sent": "In fact, we won't really have the semantic web philosophy, the true understanding and ability to use semantic web really in software engineering until we have new programming languages which are specifically built around the semantic web.",
                    "label": 0
                },
                {
                    "sent": "But what I've indicated in my presentation is with me talk about all these model based approaches.",
                    "label": 0
                },
                {
                    "sent": "I see a clear synergy between what we are doing here and what's going on in the software engineering community.",
                    "label": 0
                },
                {
                    "sent": "So that is 1 initial step.",
                    "label": 0
                },
                {
                    "sent": "But clearly there is a lot of stuff to do on top of that.",
                    "label": 0
                },
                {
                    "sent": "What I did not address it is are all these new notions like component based architectures, flexibly.",
                    "label": 0
                },
                {
                    "sent": "Configuring applications based on these kind of components where I also would see benefits by using some of the semantic techniques we have available in order to support that notion of how to come up with the application software.",
                    "label": 0
                },
                {
                    "sent": "In the end, not having one monolithic block but configuring on the fly different kind of components, and I think in the long term there is no way to do that without.",
                    "label": 0
                },
                {
                    "sent": "While exploiting some kind of semantics in Denton because just relying on these syntactic features that it is currently done will not be sufficient in the end.",
                    "label": 0
                },
                {
                    "sent": "So that is also one trend I see when you see these recent developments based on component based architectures or other people then talk about these service based architectures and then I think there is a promising area where we can provide added value to that community.",
                    "label": 0
                },
                {
                    "sent": "Josh Lieberman.",
                    "label": 0
                },
                {
                    "sent": "I appreciate the perspective of looking at these different communities and developments in terms of a.",
                    "label": 0
                },
                {
                    "sent": "Provider and consumer paradigm.",
                    "label": 0
                },
                {
                    "sent": "But I have to wonder in cases where there are communities that show up on both sides, whether that paradigm kind of breaks down and you have to look at is that really a throughput?",
                    "label": 0
                },
                {
                    "sent": "Is it an iteration or is it a more serious and challenging interaction?",
                    "label": 0
                },
                {
                    "sent": "Are you see when you design talks like this one?",
                    "label": 0
                },
                {
                    "sent": "You always have to abstract from some of the details in the end and you are describe some black and white pictures.",
                    "label": 0
                },
                {
                    "sent": "In order to really make the point in the end, I completely agree that when you then go into the details and technical interaction between the different kind of communities, somehow the notion of supplier and somehow the notion of consumer is not that clearly separated anymore.",
                    "label": 0
                },
                {
                    "sent": "But in order to deliver some kind of message, I have used that.",
                    "label": 0
                },
                {
                    "sent": "I'm a tougher of customers suppliers to make clear what other strong points different communities might bring in into that kind of interaction.",
                    "label": 0
                },
                {
                    "sent": "But I agree, when you really do half a year research in a specific area, there is more interaction going on than just that.",
                    "label": 0
                },
                {
                    "sent": "Customer and supplier relationship in the end.",
                    "label": 0
                },
                {
                    "sent": "On the database kind of idea and possibly getting.",
                    "label": 0
                },
                {
                    "sent": "That community to to work and take seriously the problem of getting you know, fast triple stores so I don't know.",
                    "label": 0
                },
                {
                    "sent": "I know that there are people working on building fast triplestores commercial companies etc.",
                    "label": 0
                },
                {
                    "sent": "But are there any people in what you might call the mainstream database research community who think this is an interesting problem?",
                    "label": 0
                },
                {
                    "sent": "And are they working on and if not, how can we entice them?",
                    "label": 0
                },
                {
                    "sent": "Well, I cannot refer to specific persons are working in the database community in that context.",
                    "label": 0
                },
                {
                    "sent": "Maybe?",
                    "label": 0
                },
                {
                    "sent": "Some of you would have a better reference available in that context.",
                    "label": 0
                },
                {
                    "sent": "What what we already discussed that based on the discussion of Steven Anomid is how can we?",
                    "label": 0
                },
                {
                    "sent": "I'll make the two communities better aware of the challenges that are investigated in both of these communities and in the kind of solutions that are available or being investigated in different kind of communities and as long as the database community is not really in with all these triple aspects, triplestores reasoning on top of that there will not be too many activities going on in that area to really address that specific.",
                    "label": 0
                },
                {
                    "sent": "Kind of problem, so I think we first have to raise the level of awareness among these communities, and then we might see developments of how to apply or further develop database techniques in order to support these kind of or solve these kind of challenges in the end.",
                    "label": 0
                },
                {
                    "sent": "So that's for my point you with some.",
                    "label": 0
                },
                {
                    "sent": "Mid range investment we have to do on both sides in order to come up with these kind of solutions.",
                    "label": 0
                },
                {
                    "sent": "Thanks a lot.",
                    "label": 0
                }
            ]
        }
    }
}