{
    "id": "e6tgpjiifahoitrozxsqzlo3s4vf2rar",
    "title": "Hands on Semantic Web",
    "info": {
        "author": [
            "Denny Vrandečić, Institute of Applied Informatics and Formal Description Methods (AIFB), Karlsruhe Institute of Technology (KIT)"
        ],
        "published": "Oct. 20, 2009",
        "recorded": "September 2009",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/active09_vrandecic_hsw/",
    "segmentation": [
        [
            "So we're going through the three different topics."
        ],
        [
            "The first semantic web I've seen it a few of, you know, already the semantic Web basic technologies, but if you don't, so I'm trying to bring you up to speed altogether and I hope it won't be too boring for those who already know it.",
            "I will talk a little bit about Owl, which is one part of the semantic Web technology stack.",
            "And then finally I will introduce Semantic Mediawiki, how it's used and what is it used for.",
            "For example in this project.",
            "So this is the model."
        ],
        [
            "Goal of the Semantic Web universal access to all knowledge out there.",
            "How are we going?",
            "How is the semantic web going to achieve that?",
            "So the semantic web is basically a stack of technology."
        ],
        [
            "Yes, so if you look at his stack."
        ],
        [
            "Is the famous Semantic Web layer cake.",
            "It has been changing a lot during the last few years and this is the current version of it.",
            "I expected to further change in the future, so in order to introduce the semantic web and actually go through those technologies and say what they are used for and then in the end you will hopefully get a more complete picture of how they interact with each other and how to work with each other.",
            "If you have any questions at anytime.",
            "Since it's a rough a long talk, please raise your hand immediately and ask.",
            "Or if I'm going to fast.",
            "So if we can team over whatever, OK so?",
            "I start with the most basic of those technology, which is actually our DF.",
            "This is useful data interchange."
        ],
        [
            "So what is RDF first thing, RDF is really simple."
        ],
        [
            "In IDF you have basically entities like for example an entity named Angola and you can introduce anytime new entities.",
            "So I introduce another entity called Africa.",
            "Now the interesting thing in RDF is that you can connect those entities that you can say OK, let's say Angola is located in Africa.",
            "What you see here is a triple.",
            "This is the basic building element of the semantic web to basic building element of RDF Angola located in Africa have a subject property object thing and and this is how you build the graph of the semantic web.",
            "So we can now introduce further elements.",
            "Further entities like Sambia and say, well Sambiase also located in Africa, reusing the same Africa that we have before.",
            "We can introduce new properties, for example borders and we can say Angola, border Zambia.",
            "So now the graph is growing.",
            "At this we can introduce an entities new properties at anytime.",
            "And that's basically it.",
            "About the semantic web.",
            "The next thing we can."
        ],
        [
            "Introduces sets of things.",
            "For example, we can introduce a set called countries to include both Angolan Sambia and they can include a can introduce a set of continents that in this case would include Africa and modern sets, entities and properties is actually not more than that to it now.",
            "The proper is it this idea that we see here we have somehow to translator technology, so we have some how to make it understandable not only by humans who can easily understand the ideas of sets of entities of properties.",
            "But we also have to make it understandable computers.",
            "So the first thing that we have to do is to find identifiers for all of those things.",
            "Um?",
            "Sorry, one step if the first thing you have to do is we can send around sets of things like this.",
            "So we introduced new entities to actually represent those sets.",
            "So we have a new entity country in your entity."
        ],
        [
            "Continent and we have to make connections between the items of the type type.",
            "So we say that Angola has type country.",
            "Africa is the type continent, so we have the same very same meaning as which has had the second ago.",
            "So we do have sets of countries.",
            "You do have sets of continents, but we only represent them in a different way and this is a pattern that you will keep on seeing during this presentation.",
            "So basically.",
            "One hand, we have the meaning that's there for the humans really to understand, and on the other hand we have to representation that in on the different abstraction layer we have representation that's closer to computer.",
            "So in this time we turned the set meaning again to triples.",
            "So and this is one of the major things said everything on the semantic web is a triple."
        ],
        [
            "So the semantics of this thread and this is really the same.",
            "So the next thing is that we."
        ],
        [
            "So this is just a view of idea.",
            "The next thing is that we need to identify the."
        ],
        [
            "Thanks so for identification.",
            "The web offers the URIRI technology."
        ],
        [
            "Um?",
            "Your eyes are uniform resource identifiers and I are eyes are internationalized, resource identifiers meanings today actually the same thing, but they're using Unicode, so we can use all those Unicode letters inside of you.",
            "I what you see down here is your eye.",
            "For example for myself, so it says HTTP Semantic web autoguide, any random church.",
            "And how are those your eyes built?",
            "So first ever your identification and identifies exactly 1 entity.",
            "This is important.",
            "We don't have the same.",
            "You're identifying several entities is always clear what it identifies.",
            "And most semantic web.",
            "Your eyes usually use HTTPS protocol.",
            "The protocol is the first part of the UI.",
            "HTP is a well known protocol for the hypertext Transfer and support of using it on the web everyday.",
            "And the nice thing about is that on the semantic web, we can use it to resolve more data.",
            "Once you use an HTTP UI.",
            "So this means that if you have your eye like this, identifying myself an agent could go to this year.",
            "I resolve it and get more data about this.",
            "Entity figuring out what is what is supposed to mean, and this is what we call link data.",
            "If it is set up like this.",
            "So using your eyes on the semantic Web means that you have identifiers that are globally unique for for identifying entities and that have data on them described on the web that the agent could automatically look up and figure out what this entity is supposed to mean.",
            "So looking at the architecture of your eye, you first have the protocol.",
            "This is in this case HTP, which is in most cases actually HTTP, and but it could be also different protocol.",
            "For example FTP or HTTPS or whatever you want here.",
            "The second one is the domain.",
            "I'm giving ownership to a legal entity to keep over this domain.",
            "Then the first part completed is called.",
            "The namespace is going to the to the last slash or a hash inside the UI.",
            "And then you have to local name at the end so the namespace is usually a way to collect the number of similar entities and the local name actually gives you the actual edited you're referring to.",
            "Most of the time, what you will see in many semantic web related works as that namespace actually shortened by Q name, which means that we are replacing the namespace with prefix, so the local name stays the same, but there is a prefix that actually refers to the namespace.",
            "So in this case you have much more readable your eye because your eyes tend to be a bit cumbersome and writing down when using, but this is really just.",
            "An abstraction an another layer that helps us keep picking things sample.",
            "So."
        ],
        [
            "Looking at the graph again, we had a second ago.",
            "This means that all those entities that we see here, that all those properties are actually not named Africa Angola, but drafted are your eyes representing them so."
        ],
        [
            "This means all of those entities can be looked up on the on the on the web and find more information about them, so that wherever I used the ID for Angola, I mean the same thing.",
            "I mean the same entity Representative and I can look up what kind of information is already there.",
            "So far, since humans are not that good at dealing with your eyes and becomes kind of cumbersome to read, there is another property that's called label, or there's actually your eye for that as well, and the label connects basically any entity on the web on semantic Web with a human readable label in a specific language.",
            "So this htpunderworld.org ID Angola, for example, would be connected to a label in English called Angola.",
            "Just just name and the same thing for all the other entities here.",
            "So we have that for the effort.",
            "The actual instances like Africa, Zambia, we have to properties we have said also for the for the categories for the classes so and not a nice thing is well those I have to be in a specific language like for example English.",
            "I could easily add labels in other languages like for example tie.",
            "So in this case the structure of."
        ],
        [
            "The knowledge base completely the same, but they have another human readable interpretation of different language.",
            "I can just add it to the to the previous graph so we have both representations in the same graph.",
            "So in this case the system."
        ],
        [
            "The human really looks like this if it would be able to reach tier so.",
            "More like this."
        ],
        [
            "Get in English, but the meaning is very same thing as."
        ],
        [
            "Yes and graph you.",
            "So to sum up until now, subjects and predicates are all your eyes objects at your eyes, so literals literal is concrete data value.",
            "For example, a number like 27 or a date still number there about 2526 different data types defined in this specification."
        ],
        [
            "OK, so.",
            "Um, this is very hot right now, so this is our the FUI.",
            "In reality we can send around pictures like this in the web so."
        ],
        [
            "We do have to send around this XML, for example, or any other kind of machine readable thing that can understand.",
            "But really this graph here."
        ],
        [
            "And XML are basically the same thing we see here."
        ],
        [
            "That we have things called Angola, for example, and then they have borders to things like Zambia in this case or to have located in Africa and so So what we see here and what we see here as are just different represent."
        ],
        [
            "Nations of the same thing, and it's just that computers are much better than this."
        ],
        [
            "Bending angle brackets in graphs.",
            "But in the end."
        ],
        [
            "Then several civilization formats like this XML format is an free, which is a bit easier to read on humans and so on, but it doesn't really matter what kind of format you really use.",
            "The major thing on the web is actually the meaning of what you're sending around, and this is what is standardized by the technology.",
            "So do you have a number of different formats and do represent same thing in the end?",
            "So this is how XML fits and uh-huh."
        ],
        [
            "Picture it's not completed two completely between your eyes and Rs because you do have non XML ways to represent RDF.",
            "For example an free.",
            "But this is a minor detail.",
            "So now we have covered the basis of what semantic web is, which is basically RDF using for example XML a serialization format and building on top of your eyes."
        ],
        [
            "On top of RDF we have a number of technologies that help us extend the meaning of things.",
            "For example, as a query language Sparkle sparkle is language and protocol for querying RDF."
        ],
        [
            "And this is an example for us public very language.",
            "So the first thing that you see here, which is written a bit smaller, is defining a few prefixes that we have seen earlier that can be used to for easier writing of the rest of the sparkle query to shorten.",
            "the UI is basically.",
            "So, but we are looking.",
            "Here is a variable called label.",
            "You see variables.",
            "You can recognize them by the question mark and the variable label asks for something that is connected with the ADFS label property to that label.",
            "And there's something to see is the one thing that the Angola thing.",
            "It's related in located in relationship too.",
            "So basically what we're doing here is we're building a pattern and then we're matching the graph against this pattern.",
            "So look at this pattern.",
            "We are looking for a C that has a label.",
            "And see is the one thing that Angola is located in.",
            "So if you look at the graph again."
        ],
        [
            "The triple we have.",
            "Finding OK Darius lingo laughing.",
            "There's only one and other things because, well, they're all unique and there is 1 located in relationship in the graph as sweet as far as we know as far as this graph is concerned.",
            "So I'm going to locate it."
        ],
        [
            "In variable C, leads to one bind."
        ],
        [
            "Sing for the variable C, which is the Africa."
        ],
        [
            "The underworld alcaide AFFO."
        ],
        [
            "Your eye so C will be bound to the UI."
        ],
        [
            "The upper right corner."
        ],
        [
            "And now that C is bound, we can."
        ],
        [
            "For well labeled leads to."
        ],
        [
            "There's only one label going out from Africa, so we see that it's the same UI for the label as the rail line up there, and this table goes to Africa, so the result of the sparkle query in this case."
        ],
        [
            "Will just be the the word F."
        ],
        [
            "So this is how we can very RDF.",
            "Satisfy the F using sparkle."
        ],
        [
            "I'm there.",
            "Sure.",
            "This is.",
            "Supposed to be some kind of great optimizer sites there supposed to be a query optimizer to do that so the order is completely irrelevant as this is for RDF, so it's a completely declarative meaning that the order of the statements doesn't matter at all.",
            "Anything like the languages, so we're supposed to multiple Labor Relations to get this working laborers.",
            "No.",
            "Actually, the relations always the same.",
            "In this case you could filter label by language actually, so in.",
            "Right so so big.",
            "But for the sake of this, we will actually want the English label or we actually wanted tileable most of the ontologies out.",
            "They actually don't have labeling multiple languages, so in this case, but if it would have, we would just get the different tables and it was set up.",
            "This is a table.",
            "This is the English label, so if we had both of them instead we just would have get both results back.",
            "But you can filter them if you want to.",
            "Use.",
            "It's it's.",
            "Literal type with language, so it's it's in RDF.",
            "Make a little difference between what a string is and what the literal language is.",
            "So literal language is actually not a string according to RDF, which is a bit weird, but that's the way the standard defines it.",
            "So you can filter the result by language, but it wouldn't be a string.",
            "Not officially, even though you'll it's it is a string of characters, but that's not what it's called.",
            "OK.",
            "So."
        ],
        [
            "So with Sparkle we have one way to get information out of the semantic Web is one way to integrate information out of an RDF graph.",
            "To get more information."
        ],
        [
            "Into the system to get more semantics into the system.",
            "Are there there further standards, like, for example RDF S which defines the schema on top of RDF?",
            "So in RDF S. We have a number of further."
        ],
        [
            "Sure.",
            "Terms that we can use that this is, for example, set class offset property of the main range and so on.",
            "This this number of those.",
            "So we go for one example, which is that we say that country is a subclass of location and it continent is also subclassification.",
            "Looking at the previous graph."
        ],
        [
            "Picture is actually means that both country and continent are subsets of location, so we will just draw a big circle around can encompassing both country and continent.",
            "It means there can be more things inside locations.",
            "For example City would be another example for a circle inside it.",
            "So what it really says is that everything is in country is also location.",
            "Everything is in continent is awesome location.",
            "So this is the meaning of subclass off and.",
            "Um?",
            "Now in RDF, since we have to base it on triples, just again, looks a bit more complicated.",
            "What we're really doing is it we're introducing a new entity."
        ],
        [
            "Location entity, so we give you the label location and that we have a new property to subclass of property and to connecting to continent and a country to this to this new entity.",
            "So now it's getting a bit confusing here.",
            "It will get a little more confusing even because now what we can do is that we say that country is location and Angola is a country.",
            "We can infer that Angola is also location.",
            "So we don't put that triple in explicitly, but our about reasoner can actually infer that triple.",
            "So, based on the rest of the knowledge that we have based on the fact that Angola is a country, an countries a subclass of location.",
            "This also means that Angola is also location, so this is the inference that we make.",
            "So I said we won't put that triple into into the into graph explicitly, but sparkle query engine that actually.",
            "Has a reason in the background.",
            "It's aware of the semantics of the IDF.",
            "Statement can still return this answer, so if I ask for all the locations, I will also get back Angola."
        ],
        [
            "The same thing for Africa and Sambia, since they are country respectively a continent.",
            "So that's all inflatables.",
            "This is again written down at bottom.",
            "So this is the basic inference that we do here.",
            "For the subclass of property, and we have all these kind of properties.",
            "All of this kind of inference for the rest of the IDF's language.",
            "So bad again."
        ],
        [
            "Even though this looks a bit complicated, this is just closer to the computer representation in reality."
        ],
        [
            "It is as simple as this one.",
            "Sure.",
            "This one."
        ],
        [
            "OK.",
            "Right?",
            "So other facets of has only very limited support for this kind of constraints, but we will get to our, which is a much more richer language for describing those classes.",
            "And there you will have a number of constructs to describe.",
            "Your class is very detailed, so we will.",
            "We will come to this the answer discussion a second, OK?"
        ],
        [
            "Good.",
            "So, but the major summary of this first part should be that in the end it all boils down to the simplicity simplicity of this.",
            "You have individuals you have properties within individuals, and you have classes of individuals.",
            "How it's really represented.",
            "You know that you have."
        ],
        [
            "All those triplets that you have always your eyes that you're sending around XML files, which is basically one level beneath.",
            "It's just the same thing As for the normal Web user today.",
            "They don't care about HTML and CSS and all those things they have the tools on top of that and what they really want to."
        ],
        [
            "She is a simple picture like this and that they understand them at the meaning of that they can share the meaning of what is important is that.",
            "Once we have those standards in place, I mean the standards are not defining something terrifically new.",
            "I like set theory, is well known already, but but they're standards that's important thing and that's why we can exchange data from one system to the next.",
            "That's why we can exchange data over this over the web, so it's the same thing As for the web have mean when the web was introduced in 91, it wasn't anything terrifically new insight.",
            "I mean, HTML HTML was.",
            "Very basic, very simple hypertext language.",
            "Compared to the things that have been developed the years before, HTP was also a very naive protocol for exchanging data, but those were opens standard that everyone could use, and it actually people started reusing.",
            "So once HTP your eyes and HTML was set up, we suddenly had.",
            "Base for everyone to use the same technologist, use the same standards and that's why the web has started.",
            "It didn't start because of any new inventions that have come along, and it's the same thing for the semantic web.",
            "Basically, show there's a number of research around semantic web, basic fundamental issues, But the major contribution of the semantic Web adult standards, and they're boring there.",
            "Simple, but it's OK there there in order to be used in reuse, and.",
            "And so as soon as you have your date and at the office, unless you have today to put up on semantic Web, other people can link to it.",
            "So the basic version."
        ],
        [
            "The semantic web is really looking, so I put my little Africa ontology out there.",
            "I put a little graph out on the semantic web, So what someone else could come along and put their biology ontology under web.",
            "So if if example containing what animals are there, how they are related to each other, whatever plans are on sort of taxonomy from biology but so, but so we have two graphs on the semantic web.",
            "What's the point?",
            "Not a nice thing is I said since all those entities identify it.",
            "Why your eyes?",
            "Someone third person could actually come along and say, OK, you know your African elephant from your biology ontology and the Africa, an entity from the geography ontology.",
            "But actually I can relate them.",
            "I can say that the African elephant lives in Africa.",
            "So I can just grab one entity from an arbitrary graph and connected to an entity from another arbitrary graph, and therefore creating a much bigger graph so everyone can come along and add their own information to the semantic web about whatever they know.",
            "Maybe tourism, maybe history.",
            "Maybe topics like economy or whatever, and this is how the graph grows, how to semantic becomes a giant global graph as Tim Berners Lee called it recently.",
            "And they and all those entities can be interconnected, can be queried and the information becomes to universally accessible by machines and can therefore be.",
            "Connected and mushed together.",
            "It's basically the ultimate measure of data.",
            "Could we have questions about the semantic Web at this point?",
            "It's fine so."
        ],
        [
            "All those bubbles here actually represent.",
            "Usually huge graphs of RDF data, so these are not entities.",
            "Now these are datasets, so for example we have here.",
            "The DB PEDIA data set in the middle.",
            "There's geonames having a lot of geographical data.",
            "Our Daisy RDF book mashup.",
            "We has a lot of a ISBN numbers and stuff like this, so all these bubbles here datasets an they are interconnected with each other.",
            "That's what arrows represent and this is 1 view of the semantic web.",
            "That was done in March this year.",
            "Currently has more than five or 6 billion triples out there, and it's all data that can be used by in standard waste.",
            "Can be used by your applications.",
            "Sure.",
            "So link in this picture is defined by.",
            "They are entities that are mapped to each other and between the datasets.",
            "So in this case for example, DB pedia in Geo names.",
            "For example, the PEDIA has terms for everything that is happening.",
            "Wikipedia Artikel Geonames has terms for Arifin geographical, so there are a lot of overlap between those two datasets.",
            "So for example the blade has both Wikipedia article and an entry in Geonames, so there would be a triple actually saying that displayed in.",
            "The Pedia and Bled and Geo.",
            "Names are actually the same thing.",
            "And since this happens, if you have 10,000 times, for example, there's a strong connection between GMC PEDIA and the more connections they add more.",
            "The more mappings there are in the datasets, stronger the edit stronger the error in this picture.",
            "OK.",
            "So in fact this is the goal and this is what we're trying."
        ],
        [
            "The Chief of Staff Technologies and the idea is that everyone joins in and puts the data up in RDF.",
            "So this is how far we."
        ],
        [
            "Come with the semantic web layers to stack.",
            "We're taking another look at all in a second, but the first one to go."
        ],
        [
            "For the rest of the layer cake, because I'm not going to detail in the end in those parts.",
            "So on top of it all, is it you that user interface and application line?",
            "This was introduced pretty late, which is surprising because it's actually kind of important to have some applications to have user interface to all this data because humans don't tend to send out get request themselves.",
            "They need some agent to actually do that.",
            "They need some agent to render the data for them to allow them to add data system and so on.",
            "So these are all the tools that are actually using the semantic web.",
            "It doesn't have to be a browser.",
            "It could also be, for example your media player that whenever it plays a song it goes to the DB Tunes.",
            "Database for example.",
            "Or it goes to BBC website and connects to data for the for the artist that is being played or connects to data for the song that is being played and put it into the media player and displace it.",
            "So this is 1 example.",
            "So all kinds of applications can actually be using the semantic web.",
            "It doesn't have to be the browser.",
            "Next to our in at the F There's something going on.",
            "It's called riff to rule interchange format.",
            "It defines a.",
            "Additional semantics to what is already in our and in RDF S by allowing you to specify rules it's currently in last call an expected to be standardized.",
            "And during this year, maybe beginning of next year will see so on top, since we have those different semantics now we have sparkle on the one hand for querying the information we have our for.",
            "For defining ontologies we have riffer defining rules.",
            "It's actually a bit unclear how to really interrelate with each other.",
            "There's a bit of trouble, so one.",
            "Next step is to have unifying logic above them.",
            "It's not even completely clear if this is possible.",
            "This definitely recent questions for all of those who are in universities.",
            "There's alot of things to be research in the next few years I guess.",
            "And to figure out how unifying logic are these free.",
            "Stacks could look like.",
            "Once we have the unifying logic or even before that actually.",
            "What will be needed is a credit is a language for proofs, so we have seen that influencer possible does inferences can become pretty complicated, so we have seen a very simple example of influence where countries also location, but especially with our special with Rif, we can have actually very complicated proofs, very complicated inferences.",
            "We feed that in a second, but.",
            "Some of our agents may be too small, for example, to make those complicated influences.",
            "So, for example, if mobile agents to phone you don't want to have a full fledge, our two reason are running on it and like figuring out over a few million triples what it adds to your question is you want to delegate it to the cloud, but you want to have a way that your mobile phone checks this information.",
            "So coming up with a solution is much harder than checking a proof.",
            "That's what we know from mathematics.",
            "So the idea is to whenever you make an inference that you can actually formalize the proof for it so that the system can check if the information is correct.",
            "And therefore.",
            "Even a small scale system like your own computer like you're like a mobile phone can check the information that the cloud has.",
            "For example produced easily based on the on the formalized proof.",
            "Why we need that?",
            "As because it's one step that's needed in order to find trust on the semantic web.",
            "So we want to be able to figure out if a day if specific triple is correct.",
            "If a specific inference is correct.",
            "If it can be trusted or not.",
            "So the one hand we need those proof mechanisms in order to check out the infer trippers.",
            "But we also need crypto layer in order to sign triples in order to figure out where did it come from to understand prominence, to understand to really.",
            "Um and see.",
            "OK, those triples are coming from the CIA, so I taking it for greater salt dough strips that come from Wikipedia and believing them or whatever the way around you want to do it.",
            "You can, you can see OK, this information is coming from BBC, so I more trustworthy than that information that's coming from some.",
            "Depending network or whatever, so um.",
            "But you want to have the way to express those things you want to have, and that's what those upper layers are all about, so that we don't get a lot of semantic spam in the future.",
            "Then you can't sift through the information anymore.",
            "OK so far to the complete semantic Web layer cake I've been running through the last few things a bit.",
            "Any questions so far?",
            "OK. OK, just to repeat the questions because I think that was hard to hear.",
            "The question is, can I trust only complete ontology?",
            "So can I trust also specific statements or specific parts of the statement?",
            "There is no trust layer, yet it doesn't exist yet, so I can't answer this question.",
            "I suppose that in the end the standard will allow also to state that I trust a subset of it or somewhere.",
            "But really this is future work to be done, so there is no answer to this question.",
            "Face.",
            "I sure hope so.",
            "I mean, it's still research going on and so I can't answer you really.",
            "Anything of those questions, but I'm pretty sure I noted people that are working in this field are definitely knowledgeable about things, right?",
            "Reputation systems about things like.",
            "Asymmetric signatures and stuff like that.",
            "So, so I assume that they will pull in together a lot of those knowledge in order to come up with a standard, but I said it's future work to be done.",
            "So if you're interested in this area, there's a few PhD will be written there.",
            "And in one standard to be written there, which is actually much harder than writing a PhD OK.",
            "But about all this layer up there, that's really something that is going to happen.",
            "It's not there yet, so I can't answer you.",
            "Any questions about it, obviously.",
            "OK, so.",
            "I want to talk."
        ],
        [
            "Little bit about a few features of Owl.",
            "So.",
            "In our we had."
        ],
        [
            "All is short for Web Ontology language so.",
            "They turned around the letters in an intentional joke to be inconsistent at this point because the rest of the language is so consistent, but.",
            "In an hour you have ontologies, classes, properties, individuals.",
            "Well you have seen most of those already in RDF S, so an ontology is a farmer."
        ],
        [
            "Fication of a shared conceptualization.",
            "That's the usual definition of mythology.",
            "What does this actually mean?",
            "Formal specification means?",
            "That formally, it is that it's readable by computer, that it can be understood by computer and that it can be executed by computer.",
            "Shared conceptualization means that we're not talking.",
            "About reality Anna Direct sense, but rather about our conceptualization of reality.",
            "So we are talking here, about conceptualization.",
            "Parts of a domain.",
            "It is shared by several people.",
            "And we are specifying this conceptualization, which means we're translating it to inform a system.",
            "In this case, Owl, in order to specify.",
            "But we conceptualize about the world in order to give it formal, represented in order to give it away to their computer, can access it and execute it.",
            "An easier way to see that and ontology defines terms and the formulations to each other.",
            "So in order to describe a domain mini to use any do some terms.",
            "And so we need to define those terms.",
            "We need to define the relationship between these terms in a formal way.",
            "OK, and notorious find using our culture language and in this case we will."
        ],
        [
            "Is our all his number of various varieties, so the first hour had our light, our DLL full, the second hour has even more of those veterans.",
            "I'm not going to detail here.",
            "What is actually what you have to remember is the more that was different, our varients actually are.",
            "Using a different set of our terms.",
            "That means we've seen a number of terms in the next few slides that are used to define ontologies.",
            "And basically by using a different set of Trump's, you're using a different subset of our and you only have to worry about it if you worry about how complicated is actually for a reason, or to figure out answers to your questions once you are using those terms.",
            "So, um."
        ],
        [
            "I'm trying not to get a dealer so on this OK so I will.",
            "So we have set with their classes, properties and individuals.",
            "All classes are set of things just as in RDF as we have seen that, but our classes can also be described using description logics, so that's what the L comes from in our DL.",
            "This means that a class can be described in terms of for the class means not just giving explicitly the list of all the entities inside this class.",
            "But actually giving a description of what his class is supposed to be an intentional and description of the class, and this is done by using other terms with your ontology.",
            "So with referring to the other words in ontology.",
            "In order to relate to class descriptions, we have three different operators.",
            "The first one is a subclass of operator.",
            "You've seen it before, which means that the one classes of world class descriptions, subclass of the 2nd subclass description.",
            "We have the equivalent class operator, which means the two class descriptions are completely equivalent.",
            "This means that every.",
            "Instances in one class description is also in the other, and the other way around.",
            "And we actually disjoint with operators.",
            "Basically the other, just the opposite, which means that those two classes scriptions have no common instances.",
            "OK. No class descriptions can be."
        ],
        [
            "Built using Boolean operators.",
            "You know those arms intersection union complement are just given a few examples.",
            "Sister would be defined as the intersection of woman and sibling.",
            "So this means that everything.",
            "It is both a woman and a sibling.",
            "It's also sister and everything that is a sister is both a woman and a sibling, so the so the two classes scriptions on the one side we have a simple class name sister and on the other side within the second of two class names I quiver lipped.",
            "Questions at this point.",
            "Then this is a different different than.",
            "This is a different meaning of the term Sister.",
            "So in this case well OK I I'm simplifying here because I'm just using the word sister, but actually there would be a Euro I and your eyes are supposed to only .1 entity, so in this case you have a different meaning and this would be another UI.",
            "But it's a good question yet, but we really try to avoid those cases by introducing new arise for all different meanings.",
            "For union off, this is an example of the parent's union of Mother and Father.",
            "Men is subclass of compliment of woman.",
            "Why is it subclass?",
            "Why is it a subclass?",
            "Why is not equivalent?",
            "Yeah, but no.",
            "There's no advice do I was using equivalent offered Sister was using a current offer or should we parent not patent?",
            "Sorry this is a type of.",
            "And why don't I use this quarrel off here?",
            "Sorry.",
            "I didn't send it.",
            "Other.",
            "Exactly.",
            "Right, Davidson, I did not get it.",
            "Yes exactly so.",
            "If, um.",
            "Some some so.",
            "Man is not everything that is not a woman in example a table and a camera for example.",
            "They are not women, so they would be complement of women.",
            "'cause this means not woman.",
            "But they're not men.",
            "So I know that man is a subclass of everything that is complemented woman.",
            "So it's subset of the biggest set.",
            "That is called not woman OK.",
            "Since this is a common error, that's why I'm.",
            "Standing around it, so if you're unsure if it's really equivalent.",
            "If you're unsure if this is complete definition going, use a subclass of relationship instead off and because it is much weaker and its meaning.",
            "But if you can redefine the term exist or parent, it is much better to use equivalent off 'cause my in this case you carry a lot more meaning of that you can, and you can really have more influence is out of the system.",
            "You can describe classes using properties.",
            "So this was."
        ],
        [
            "Also, quit the question that was before so you can use terms like all values from some values from cardinality.",
            "So in one often has value going given examples for those so sold daughter, which means a daughter that is the.",
            "Only daughter is subclass of all values from sibling man.",
            "So what does this mean?",
            "Sibling is a property that connects me to my siblings.",
            "If all my siblings.",
            "A man.",
            "Then I can be assault daughter.",
            "Again, we have a subclass of relation.",
            "It's not definition of the term soul Daughter, it's just a necessary condition.",
            "So subclass off hasn't writes it always the necessary condition because it is a it's super set of what can be assault daughter.",
            "Obviously it's lacking a few facts.",
            "For example, they have to be a daughter, which means that it has to be a woman and so on.",
            "But we have the condition that all my siblings have to be men.",
            "So this is 1 condition for assault daughter.",
            "Child is defined as having some values from parent woman, so.",
            "Um?",
            "The parent property.",
            "Has a value that is a woman.",
            "In this case, the entity is a child and the other way around.",
            "As soon as we're here for chat, we will have a parent property pointing to a woman.",
            "In other terms, or in human readable, Alice would be that every child has at least has at least one woman's apparent that Batista's statement says.",
            "And as soon as something has a woman's, apparently this is child.",
            "You could also add another axiom, saying some errors from Parent man, in this case, just.",
            "This would be perfectly fine, but it still holds.",
            "This axiom is correct.",
            "China is also defined as having cardinality on parent too.",
            "So every child has two parents.",
            "This is what it says here.",
            "Person finally defining this ontology as having a gender which has to be male or female.",
            "Now we starting to getting into an example of if this is culturally OK, I mean.",
            "Is there really only those two genders?",
            "Male and female?",
            "Are there several other genders than that?",
            "This skin actually does gender questions can get quite complicated.",
            "And this is just to exemplify that.",
            "Well, in this ontology we define it like this, because this is the definition of the conceptualization that we want to capture.",
            "In many cases this is fine, but in other cases, for example, if actually dealing an.",
            "In researching this areas, this is definitely not enough.",
            "Then you need more terms to describe agenda.",
            "Then you need more relationships.",
            "Describe this kind of things.",
            "So.",
            "I but nice thing is, once you make a statement like this.",
            "Well, you don't have to use it.",
            "I mean if someone states well there are two genders, male and female, but you can just ignore this ontology.",
            "I mean, the semantic web will have a lot of statements and not all of those will be true or will be useful for you.",
            "And at a given case.",
            "Just like the web, you know, just because someone put something on the website doesn't mean that you will do that.",
            "It doesn't mean that you will believe that it's what it said there.",
            "Just because Fox publishers that the war in Iraq is over there, the mission is accomplished.",
            "Doesn't mean that you have to believe that.",
            "Same thing for the semantic web.",
            "Just because there's an axiom saying it.",
            "Well, So what?",
            "You can choose to trust it or not.",
            "To trust it, you can choose if this.",
            "If this separation of gender in the male and female is useful for you.",
            "If you want to subscribe.",
            "If you want to use it ontology.",
            "That sounds.",
            "Choose to trust.",
            "It's not the point.",
            "Yeah.",
            "Yeah, that's completely true.",
            "So did you hear that comment?",
            "Because it's important.",
            "I know.",
            "OK, I tried to capture.",
            "Under, under, under Web as we know it, if you read Fox where you know that you're reading Fox and you're human, you can, and you can figure out if you want to trust it or not on the semantic web, we have agents dealing with those data, so it's the agent.",
            "It has to decide if they want to trust it or not, and agents are not as clever.",
            "Assume it's not OK.",
            "Humans are also ages, but not, you know, it's the computer agents are not as clever as humans usually, and they have to figure out if the if an axiom like this is to be trusted or not, so it's not dead.",
            "But I fully agree with that statement, but I think that the upper layers that are still research like the trust and provenance layer, the proof layer hopefully provide will someday provide a way to deal with that much easier so that we can have at least mechanisms to define and exchange information about this.",
            "But yes, this is still definitely further research.",
            "We have to figure out how to do that.",
            "Equipment.",
            "Equals one.",
            "Something.",
            "Or in this case, I can always say it's just because this is a term of person that we use in this term of male female reason, but you're right.",
            "Not everything that has a gender male should be a person.",
            "Yeah, it should be a subclass of, yeah?",
            "Oh, and has value was wondered for missing Woman is something that has value in general female.",
            "So this is just the way to connect the term female with the term woman.",
            "Um?"
        ],
        [
            "Other properties, so we have seen a lot of description for classes, but the properties in our can also be described in several ways.",
            "Um, so the we have.",
            "Terms like sub property off this joint property, domain and range to describe properties.",
            "We go for them again examples.",
            "So the father of property would be a sub property of parent off, which means everything that has the property father after something also says property parent off to that same something.",
            "Child Off is a disjoint property to parent off.",
            "Now this doesn't mean that everything that it has the child of property cannot have a parent of property, because this is obviously false mouse.",
            "Most people did.",
            "Have children have also parents, but this means that you can't have this property to the same entity at the same time.",
            "So.",
            "If you have children, your children cannot be your parents.",
            "Setting aside some.",
            "It time travel stories, but otherwise your children cannot be a parent, so this two properties are disjoint.",
            "You cannot have some of the same entities at the same time.",
            "Domain defines where a property can start, so Father has a domain man, which means that everything that has the father property going out has to be a man.",
            "Range is what it points to, so the range of father of would be child.",
            "So everything that.",
            "Has the father of relation pointing to has to be a child.",
            "They refer to."
        ],
        [
            "Things you can do with properties, you can say their symmetric or asymmetric sibling off.",
            "For example symmetric, which means that everything that.",
            "If A&B are siblings then also be an heir siblings.",
            "Eh, symmetric Sam parent off.",
            "If you have a parent they can't.",
            "You can't be their parent.",
            "We have terms for reflexive, irreflexive.",
            "Reflexive is common genes, for example, everything that has a common genes property has also common genes to itself property.",
            "Now I learned recently that is actually a simplification.",
            "You don't have only common genes with yourself.",
            "So, but otherwise it means that you always have a property to yourself that is called common genes.",
            "Irreflexive means that you cannot have this property.",
            "Pointing yourself child off would be an example from the reflexive property.",
            "Finally, transitive.",
            "I'm so anxious to office example transitive property, which means that a answer stuff B&B and sister of C. Also A is an stuff see, so this is just ways to further define properties in our.",
            "Functional means that there can only be."
        ],
        [
            "One so has matter is a functional property.",
            "Um?",
            "And in verse, gifted Inversive property parent, often child off by inverse properties.",
            "Which means that if you have a parent then the parent has you as a child.",
            "Inverse functional is a combination of those two, which means that you are.",
            "The only wanted her to do the only entity passes but also invest functional father off means that everything that has a father can only have actually defined by its father.",
            "So you can capture someone by the federal relationship and keys that are very similar to it.",
            "You can have a number of properties that together define as a specific person.",
            "For example, if you have a child off and birth order, then you know which person it is.",
            "So you need to have both information.",
            "Whose child is it Ant which birth already answered?",
            "It can identify this person, so you have a key over those two properties.",
            "Those things are.",
            "Becoming sometimes they're not useful by themselves, so it really you wonder why you should define those things.",
            "We should define keys and also, but as soon as we have two different datasets that have a lot of data that describe in very different ways.",
            "It will help you a lot with actually aligning those datasets.",
            "For example, if you have books and you define that the ISBN number is a key for those books and now we have two different datasets both defended at the ISBN number, you can easily find entities and those datasets that are actually the same entity because ISBN numbers are pretty good keys for books.",
            "Um?"
        ],
        [
            "For individuals, you also have a few terms to define them, but not as rich As for properties and for classes.",
            "You can say the two individuals are the same.",
            "For example, says John and Jack are the same.",
            "In my ontology you can suicide.",
            "Two individuals are different from each other.",
            "John and Sue, for example, would be two different persons amount aladji.",
            "And finally you can make property assertions, which means that you can use all those properties that you have defined before and to connect the.",
            "Individuals with each other so extent I can say joins the Father of Mary or I can also make negative assertions of new.",
            "In our two I can say that Mary is not the matter of drawn.",
            "OK, so this is what we have in our part number of concepts you have all of them in your slides."
        ],
        [
            "Doubt is so to look it up, but sure.",
            "I would like it's actually quite misnamed.",
            "It's not dead light as it sounds, so most of the things that we have seen are part of our light.",
            "This doesn't hold true for the property things because most of the property things is actually only introducing our tour and our light is a term from the first hour, but our light does most of the things that we've seen here.",
            "What does that say?",
            "For example, the one off thing that has value thing is not their cardinality constraints with coordinates bigger than one actually not part of our light.",
            "So different things like this are not part of our life, but um.",
            "Really, most of the time you don't have to concern yourself with what our frequent urine is, it only if you have an implementation.",
            "It really brings you more speed.",
            "Because of that you should try to be concerned about that, but most of the cases.",
            "It's not that big a difference.",
            "How?",
            "Most of the time it will just actually tell you that it doesn't support it, so you probably should run a cleaner or done things like that so, but it depends on the implementation.",
            "It would be nice if implementations actually does that and gives you a warning instead, but the most implementations I've seen they actually just say, oh, I can't believe that it's not our life so, but actually I don't know a single reason that only does our light and doesn't do already also.",
            "Most of them are actually running on our DL.",
            "It's getting more interesting with the hour tool fragments because some of those fragments are actually defined in such a way that they can be easily implemented on top of databases for example, so they have.",
            "Different constraints, but then you have to nice case you can just take a usual database like my SQL or Oracle and on top of that implementing our reasonable just basically ask well queries.",
            "So.",
            "And this case of our two, it will become again more interesting than knowing what fragment you are in our one.",
            "It really didn't matter much this this was actually the difference between our light and our DL is an error.",
            "It shouldn't have been away, it was.",
            "But for our this is not true anymore for our two.",
            "Where there.",
            "Better, but fragments actually have a much better defined meaning and.",
            "You know that, OK, you can if you use this one, you can use it for rule system.",
            "If you use this one, it's competitive databases.",
            "We use that one you really need to have an hour to reason affects update.",
            "So there it becomes much more interesting what you actually using.",
            "So take home again.",
            "Um?",
            "It should not matter what syntax you're using.",
            "The structure owl.",
            "You can use RDF XML functional measures to contrast used tools.",
            "It should not matter which tools you are using for describing your hour if you if you use Prodigy.",
            "If you use neon if you use any other tool, all of them should be compatible to each other because they're using the standardized.",
            "Semantics, they're using.",
            "The standardized syntax is.",
            "This is the one finger semantic web rings standards for your semantics, so you can express all those things that we have seen before and every other tool that uses the same standards were able to understand what you have sent them will be able to deal with that when you send them.",
            "How obvious the systems that are more expressive than ours that are stronger than our that are maybe better suited for your for your use case and so on.",
            "And maybe you should use them in for giving you a space, but if you want to be part of the semantic web.",
            "But you should see a use finger.",
            "This is such the same thing as I said before, with hypertext should have been a hypertext, it's more powerful than HTML.",
            "Def in Hypertext Systems that can allow you much more than your browser does.",
            "But you know, it's not a web, so if you want to play on the web, you have to play by the rules.",
            "Study.",
            "You say that you don't really expect people crashing, right?",
            "Expect.",
            "Yes, definitely.",
            "Just don't expect people to write HTML.",
            "There will be tools between that and that's the user interface application layer that will hide the complexity and this is a good question for the next part because semantic mean."
        ],
        [
            "Arabic is exactly such a tool.",
            "Semantic Mediawiki is based on the Mediawiki wiki engine and it allows to add information to the wiki that allows to export part of the knowledge in semantic web standards.",
            "So.",
            "Who of you doesn't know?"
        ],
        [
            "Let's ask the other way around because otherwise no one.",
            "So who knows what the wiki is.",
            "OK, great, well if you has used the wiki.",
            "So the rest has been beyond Wikipedia, yet are OK.",
            "So wikis are known to be great web to tools for collaboration.",
            "Everyone can read and everyone can write them.",
            "Everyone can edit.",
            "It's like this, and everyone is accountable for everything because we have complete history of what's going on.",
            "But still, you know some things are better left to machines.",
            "Something shouldn't be really done for Wiki, so this is the example of the wiki Clock."
        ],
        [
            "It's a great wiki based Clock, so it's a cloud based on wiki technology.",
            "Everyone can edit it.",
            "You can just go there and enter and enter the current time and whenever you need it you can just look it up and see what's the time right now.",
            "Well obviously a bad idea.",
            "And most of the time it was pretty out of that.",
            "Actually, most of the time it was just spammed to be honest.",
            "So wiki clocks are a bad idea.",
            "Wikipedia, on the other hand, seems to be."
        ],
        [
            "Good idea so we can size.",
            "Seems to be good to write and slow pedias.",
            "Why is it a good idea for advisory good idea for an encyclopedia but a bad idea for Clock?",
            "Well, because some things are left better, the machines and some are not writing interpedia seems something that machines are not yet that good at, but we learn about it more.",
            "Today is in this direction.",
            "So Wikipedia had to go, that is."
        ],
        [
            "You will probably recognize universal access to all knowledge in this case, not just for a machine set, mostly for humans, so.",
            "How well does it fare?"
        ],
        [
            "Based on this question, Wikipedia's articles about all the cities of the world, it has information over to populations of those cities.",
            "Anna mayors of those cities, great.",
            "So can I go and just ask Wikipedia to give me a list of the world's 10 largest cities with her female mayor?",
            "I mean, it has the information inside, so we should be able to do that, right?",
            "Let's try it.",
            "I go to Wikipedia search engine and type in the question."
        ],
        [
            "What are the 10 largest cities or female mayor?",
            "I make a search.",
            "And I get back Manhattan, Chicago, Washington DC and St Louis, Mo.",
            "Now the good news is they're all cities, which is always surprising.",
            "The bad news is, none of them has a female mayor.",
            "But it's unfair.",
            "We're doing a full text search, so I can't really give you an answer to that.",
            "Wikipedia is usually answer to this problem."
        ],
        [
            "Lists, so someone goes ahead creating your article and creates a list with the answer this question, so they would.",
            "For example, someone created an list of the 10 biggest cities of human mayor.",
            "Now it hasn't been done on Wikipedia yet.",
            "But someone could do it, so we could just go ahead, collect information and write it, and then maintain information.",
            "Wikipedia as a whole bunch of those lists.",
            "This is the list of countries by GDP."
        ],
        [
            "About the nominal GDP is a country GDP per capita.",
            "Apparitor"
        ],
        [
            "Aperitive capita."
        ],
        [
            "You have lists of."
        ],
        [
            "Aster, it's named after people.",
            "We have that on the English."
        ],
        [
            "The pedia.",
            "On the Norwegian Wikipedia, the Portuguese with."
        ],
        [
            "The Korean Wikipedia all of."
        ],
        [
            "Is this a non manually maintained manual?"
        ],
        [
            "Here's the list of problems for me given my favorite list."
        ],
        [
            "Wikipedia.",
            "The Germans, being as organized as they are.",
            "They have a list of list of list."
        ],
        [
            "So what you see here?",
            "As the list is, by the way hierarchical, it's a hierarchical list of lists and if in this list of lists, and in this list of list of lists we actually find the list of lists of mayors, so this is the list of list of mayors in."
        ],
        [
            "The German Wikipedia.",
            "So there are 86 lists of mayors and the German Wikipedia and we find, for example, the list of mayors of grants, the list of mayors of Arc, and a list of mayors of Boston of New York and so on.",
            "But no list of female mayors, so the original answer, a question Gozan answered.",
            "So we have to concede, Wikipedia doesn't have all the answers."
        ],
        [
            "Um?",
            "That's because computers are stupid."
        ],
        [
            "Computers don't make the connection between those articles.",
            "They don't understand what's going on, but humans seem."
        ],
        [
            "Steph, we read an article District summary, article and culture.",
            "So we read the article and we figure out OK. How soon as a population of 285?"
        ],
        [
            "Located in Germany, it has a mayor France and it's because we can read the article.",
            "But a computer we disease is something like this."
        ],
        [
            "He doesn't understand anything.",
            "He maybe figure out all this looks like a square, so this is maybe the the area because small looks like an area with square meters.",
            "There's a number 285 thousand, but it doesn't understand anything.",
            "Does anyone recognize the language?",
            "No, it's not Iranian.",
            "Is not Philippine.",
            "No, it's not made up.",
            "It's it's great, it's Georgian.",
            "Wow, you're the first one in all the talks that affected my head.",
            "That's Georgian.",
            "So if you think about it does look like the Coca Cola logo.",
            "Now I'm seriously, I'm so this is the language this is descriptor.",
            "Using an former Soviet Republic Republic of Georgia.",
            "And it actually looks quite pretty, but I'm using it.",
            "It used to use Chinese here, but in my audience they usually Chinese people sitting and they understand that, so it doesn't really carry the point, but no one was ever able to read George.",
            "And I were the first one who actually recognizes the script.",
            "I would have been surprised, but not that many Georgians in the world, OK?",
            "I'm so as I see we don't understand anything here we see, OK, there's a link to something that's called Germany.",
            "There's a number 75, seven 1715, and so on."
        ],
        [
            "You don't really understand what's going on here.",
            "That's because computers don't make connections."
        ],
        [
            "Computers need our help with those connections, and that's exactly what."
        ],
        [
            "Antique Mediawiki offers.",
            "We offer a way to help the computer to make connect."
        ],
        [
            "In between the given article and a link to article so in Wikitext.",
            "It would be a normal sentence.",
            "Castle City in Germany in Germany, being in double square bracket means it's a link to the article name.",
            "Germany non semantic Mediawiki.",
            "We add the possibility to type that link.",
            "So we say the connection with the customer in Germany is country.",
            "Once we do that.",
            "We take all this information and put it in a big table.",
            "We say OK, the subject is the topic of the page.",
            "The object is what we link to Germany in this case, and the property is a type of the link that we just entered.",
            "So we get in this table Catholic country Germany.",
            "You can go on take more information like Catherine Maya Hansen Rich and and then on the hand Spanish page would find information like height centers, gender, male.",
            "Subject predicate object is the same.",
            "Structure that we've seen for RDF.",
            "This is no coincidence.",
            "This is basically idea for PC here, so this is creating a graph out of the wiki articles connecting the wiki articles with type properties.",
            "So we make the wiki being a proper part of semantic Web, it exports all this information that it has inside.",
            "It can be also used inside the wiki."
        ],
        [
            "We can query the wiki so an example to for the previous question we ask for everything that's in Category City.",
            "That has a mayor whose gender is female.",
            "And we want this list to be sorted by population.",
            "So now this would give us the biggest cities in the wiki with a female mayor.",
            "I can't run this query against Wikipedia because Wikipedia is not yet semantic, so I don't actually know the answer to this question.",
            "There are a number of."
        ],
        [
            "Mediawiki is already up and running and decide exam for such Aquarius.",
            "So this is querying all the countries of.",
            "America with the population, you can have this as a table.",
            "You can have this nice."
        ],
        [
            "Rendered as a pie chart or some bar chart and this information is taken."
        ],
        [
            "Driving out of the wiki.",
            "So as soon as someone changes the population of the USA of Mexico, the charts would be adjusted on them automatically.",
            "This is a."
        ],
        [
            "A list of all the Oscar winners.",
            "And the movies.",
            "I have put on a timeline by the date of birth, so this is actually data that is taken from DB pedia put into a semantic Mediawiki and then compare it again.",
            "OK, so we can have those nice visualizations from overtime."
        ],
        [
            "This is also very nice visualizations actually on the when is City wiki which is using Semantic Mediawiki in the Venice City Wiki, they have annotated all the restaurants or the bakeries or the museums in downtown death annotated the Geo location when they are open and so on.",
            "And this is actually the query.",
            "Give me all the bakeries, so that's still open at 4:00 AM in the morning, and when it's downtown and it's based on a map and you can just see upgrade, the next one starts around the corner if you have.",
            "By formation checking it out.",
            "Creative Commons is used."
        ],
        [
            "Bing Semantic Mediawiki for their task management.",
            "So they have written number of extensions to allow them to be informed when a task being done when task has certain conditions.",
            "When those conditions are preferred and so on.",
            "This is 1 example."
        ],
        [
            "From about doing active by representing process within within the wiki.",
            "So all this process steps are described within the wiki, it says OK for this process step we need a tester, then after that we have a step that can be wrong or false cost another process step and so on.",
            "And this is again just a query based on the Knowledge Insider Wiki.",
            "So all this information is machine readable.",
            "There can be accessed.",
            "Um, this is a."
        ],
        [
            "Example of our internationalization effort.",
            "There are more than 40 languages being supported by Semantic Mediawiki panel.",
            "Also right to left languages like Hebrew and what you see here is does anyone read Hebrew?",
            "So what you see here is a wiki about hiking trails in Israel, so you can say OK, I'm in Tel Aviv.",
            "I have three hours of time.",
            "I want an easy hike.",
            "What's close by?",
            "Where does it start?",
            "How long does it take me?",
            "And so on so you can get this information out of this weekend.",
            "This is the Yu-gi-oh."
        ],
        [
            "Semantic mediawiki.",
            "It's about the yugioh trading card game, and it shows that even kids can use the system.",
            "It's that easy.",
            "This is chickipedia.",
            "I'm not saying too much of it, it's just."
        ],
        [
            "Google it.",
            "Wiki tablet is."
        ],
        [
            "A very nice example.",
            "It's done by a French group, but who else?",
            "It says we care about recipes, so you can say I have oranges.",
            "I want a pie.",
            "And then it will look for all the recipes that have oranges inside and it can make you a pie out of it.",
            "Now the interesting thing is that you can also say.",
            "But oh wait, I don't have this ingredient or I'm allergic to."
        ],
        [
            "Ingredients and this is an example of such a recipe, and when you do that and it doesn't have."
        ],
        [
            "Fitting.",
            "Recipe directly, it has a case based reasoning system in the back end that actually looks for substitutions that are defined inside the wicked way.",
            "It says OK."
        ],
        [
            "Institute disk kind of food with that ingredient and then it offers you an alternative recipe to add to the one that's already there, replacing some of the ingredients and then in the end it ask you after you cook that food."
        ],
        [
            "I like that or I didn't like that.",
            "And remember, if you like it or not and the next time it makes some substitution, it will tend to things that I like, but people and will not show again examples of people edit others didn't like.",
            "So it's connecting the semantic Mediawiki on the one side to capture the recipes in a formalized way with the CBR system to do more stuff in it.",
            "And this is a nice pattern that we hope to achieve more often with Semantic Mediawiki, since the information is machine readable, machine understandable.",
            "We can directly use the information that is added to the wiki in a Raptor or way by machines.",
            "Do more of it.",
            "Tablet has entered the computer."
        ],
        [
            "Cooking contest this year didn't notice thing exists and it has.",
            "It's become one of the finalists actually.",
            "Don't know if they won.",
            "We tried to figure out because it was in and out of July, but the website didn't update and no ones answering my email from team so.",
            "I guess he didn't win, otherwise he would know.",
            "Who knows?",
            "I would really like to know if they actually want or not.",
            "Um?",
            "So this is one thing that I wanted to point out for big tablet."
        ],
        [
            "You can take the information out of the wiki and reuse it externally.",
            "There are number of export farmers starting with RDF XML, but you can also have sparkle on that.",
            "You can have a DFA.",
            "We have Jason export so you don't have to use all those heavyweight Semantic Web toolkit.",
            "You can just use the usual Jason thing with iCal, export vCard, Bibtex, whatever.",
            "You mean there are APIs for accessing RDF and basically every programming language in the world.",
            "And it's all based on standards for the communicator information.",
            "As we have seen in the first part of this talk.",
            "Um?"
        ],
        [
            "So this is just one example of a knowledge based computer program and giving you the complete program.",
            "So this is Python.",
            "I hope you will still be able to read it if you even if you don't speak perfect.",
            "OK, so we're first importing a semantic Mediawiki library and then we're loading a wiki, reloading the active project, Semantic Mediawiki, and from this one I'm law allowing the pool entities.",
            "So I'm just loading Paul Warren into my system.",
            "And now I have a variable about Paul and I can just print out pause affiliation.",
            "So this is the complete program.",
            "This is based on the knowledge is entered into the wiki and it will print you out.",
            "Affiliation of Paul not money than that.",
            "Um assistant."
        ],
        [
            "Actually using such a Python script is SN pedia or snip pedia.",
            "An snip is a path of the human genome or action of any genome that defines a specific feature.",
            "So if you have you snip being present in your DNA, you will have that feature.",
            "If you don't have to snap, you probably won't have that feature.",
            "Actually doesn't say anything about it.",
            "So here list of such as Snips.",
            "So the first step defines if your sprinter on enduro or enduring the fleet.",
            "There's a snipped.",
            "It actually says that you are resistant to HIV.",
            "There's a slip that prevents baldness, several slips for the eye color and so on and so on.",
            "So those snips.",
            "It's the stuff that genome research try to figure out, because, well, that's the one thing that helps them with understanding the Na and those nips then have been put into sleep Pedia wiki.",
            "It has a list of snaps."
        ],
        [
            "Has lots of features connecting with them.",
            "It says in which publication was this link between the slip and his features Tab Lish so that you can say I'm only interested in things that have been published in nature.",
            "I'm only interested in things that have been published on any workshop.",
            "It's OK.",
            "I want to know I have it or want to have it all.",
            "And then there is a set of Python scripts that actually take information out of sleep pedia.",
            "And once you have your DNA in machine readable form for example, there are number of companies in the US that we can send in spit where you can send in the money and you get back a DVD with your DNA in digital form and then you can go to a site like Slip pedia, take the slips there and try to find the snips inside your DNA and figure out what the snips tell you about yourself.",
            "Um, does this work so the startup company 23 andme that offers such a service of giving you a DVD if your DNA has made.",
            "Has made a competition we have published.",
            "Anonymous persons DNA and they told the figure out as much as you can about this person and there will be three categories and we will give prices to all the people who figure out as much as they can about it.",
            "And the PDS ended the challenge.",
            "And I figured out that the person is a female Caucasian with dark hair, blue eyes that she's modern, average intelligent, that she has a tendency towards dyslexia and alcoholism that there are certain under perceive it.",
            "It won't work on here other city will work stronger and so on so on.",
            "So they cut a whole list.",
            "Stuff is kind of scary about this person.",
            "And due to the fact that they have been most correctly actually wanting all the free categories based on information inside the collectively edited wiki.",
            "So I'm still.",
            "Pedia has won a challenge.",
            "It has been."
        ],
        [
            "By now, by nature, by science have been numbers of papers around it, and it's all based on the same technology.",
            "That representing here and that you can download and use as well for your.",
            "Yes."
        ],
        [
            "That's fine, I wonder last night so.",
            "Sure.",
            "This was in this bracket syntax.",
            "This is 1 example how you can do it.",
            "So you say OK, we're linking to something like in.",
            "In this example, we prob."
        ],
        [
            "I would say that this snip here links to specific feature, so we would link to the feature just like in normal Vicky double brackets, but it will also say that the type of this link is.",
            "Has this feature or that you can introduce any type you want?",
            "At this point, it's a weekend, and so we can just create new properties.",
            "If you want to, but it's usually more clear to use property that already there.",
            "So in the Castle example, we've seen that we have connected Castle with Germany.",
            "Is the country property for example.",
            "So this is saying customer has country Germany.",
            "But I said you can introduce new properties anytime you like.",
            "If the syntax actually you don't have to use the syntax, there are ways to just use forms.",
            "For example, there's an extension on top of Semantic Mediawiki that allows you to have completely form based editing of the system so that people don't have to see the syntax at all.",
            "They just add enter the information forms, which makes sense if you know in advance what kind of information you want to have, for example.",
            "OK. My questions yet.",
            "Closest.",
            "Yep.",
            "So the question is, what about things like probability?",
            "What about things like accuracy, reliability, fuzziness, Ann and Ann in the semantic web.",
            "So basically the standards disregards that completely.",
            "But on the other hand, you can use RDF as well to represent this kind of information, and then you need some way to actually agree on So what we need at this number or this number of research actually going on in probabilistic howlan fuzziness in the semantic reference on what would be needed in the end is again a standard to define Franzi terms, defined probabilities or whatever.",
            "It doesn't exist yet.",
            "But it can be built on top of RDF obviously, but just because it can build doesn't mean that you can just go ahead and use it.",
            "Standard is still missing in this area.",
            "Actually, I'm not seeing.",
            "Any Brooke?",
            "Being done in standard US, standardizing it right now, but I hope this will change.",
            "OK.",
            "So to summarize, some up about semantic media."
        ],
        [
            "It's an extension of the Mediawiki engine that's quite popular for wikis, and it's for example used on Wikipedia.",
            "And it extends Mediawiki, pineapple and by neighboring Tipling Spain.",
            "Properties and values on on properties you get those queries that you can ask Insider wiki.",
            "You get information out of the wiki.",
            "You can use it outside of the wiki.",
            "The whole system is open source, freely available.",
            "You can just go ahead and download it.",
            "Stephen active user community around it.",
            "It's pretty well documented and as I reset there more than 40 languages.",
            "Supporting semantic media.",
            "Air supporting Semantic Mediawiki their modern 12 extensions already written on top of Semantic Mediawiki, extending it with more formats to display.",
            "Extending it with more exports, and so on.",
            "Several 100 installations using the system.",
            "I saw a number of those examples I could go on for hours with those examples.",
            "Summarizing this complete."
        ],
        [
            "Mark Semantic Web is really a set of standards.",
            "It's nothing magical about is there is no.",
            "It won't understand text because of the semantic web.",
            "Just standard to express formal semantics to exchange from a semantics and to make tools into operate on that.",
            "You have your eyes for identifying things.",
            "You've IDF.",
            "Describe graphs, refiled escape, ontologies.",
            "That's basically it is no more magic in that semantic.",
            "Mediawiki is a tool that uses those standards and it allows for the soft introduction to semantics.",
            "We've seen Mickey Stack uwyo.",
            "There's an Indian guru who uses Semantic Mediawiki too.",
            "Organize his holy text so he says this takes our if you have sent in this area this text if you want to pray for he could help with some things is completely inside to so many in in Semantic Mediawiki this doesn't mean that those people who are using you go how using chickipedia know anything about RDF or owl know anything about description logics.",
            "It's just the the using the system they're using it with.",
            "Again, they're using your benefit because it helps them organizing the information.",
            "That's exactly where we want to come true.",
            "We want to make those standards.",
            "An easy to use and actually helpful and beneficial for everyone.",
            "OK, so thanks for your."
        ],
        [
            "Lots of it.",
            "Thanks for your attention.",
            "Sorry, I'm not native English speaker.",
            "Thanks for attention and do you have any questions before we can go to the coffee break?",
            "So if I confused you enough, OK, that's a question.",
            "Questions, so there's a number of such search engines that are specifically built on top of the semantic web.",
            "There is Falcon S by group in Shanghai.",
            "This cindychair.com that's done by Dairygold.",
            "Wait, it's pretty.",
            "It's pretty comprehensive with regards to so many great data.",
            "There's Watson by the Open University there's swoogle done by the group around time finding at the University of Maryland you want to add.",
            "Up OK. That's true, that's true.",
            "I think that I should just collect semantic web data to just pull RDF from all the sources added.",
            "Just put together to really answer questions.",
            "On top of that, I actually know only of 1 system that's done by the University of Cats were sorry Katie.",
            "There they have they're putting together.",
            "Web semantic web corpus, and then they're trying to match keyword queries to make a structured queries out of that and then answer your question so you can, for example, type in.",
            "AIP members ICE WC 2008 and will try to create us, so it's not really natural language that it's going to be answered here, but it's but it's using keyword queries, translating them to structured queries basically sparkle queries and then executing them on the semantic web corpus.",
            "That is there which has been collected before that summarize.",
            "Before that, there's actually there's also.",
            "So there are number of question answering systems that have popped up in the last time, and some of them are using.",
            "A little bit of semantic web data, for example, the true knowledge system is actually using Freebase, which is also available in RDF, so this is a kind of a stretch to really say it's using the semantic web through knowledge is basically a natural language answering natural language question answering system, but you can just type in a question and it tries to answer that, but I said it's kind of a stretch to say today using the semantic Web ready because they're actually just using Freebase, which also has similar web export Bing is.",
            "Also using Freebase and but it doesn't have the natural language, it's just trying to enhance it.",
            "There's the search monkey project which is also not using natural language questions again, but it's enhancing display of query results inside of the Yahoo question.",
            "So actually started taking RDF data that is connected with your web resources and they are enriching the snipers with this data.",
            "For example giving you the review of a hotel or.",
            "Movie Google has started something similar with.",
            "Specific data sources around reviews and.",
            "Persons so they take.",
            "Stated it's describing a person, for example, from LinkedIn and displaying it in a rich snippet.",
            "So this is enhancing keyword query results through knowledge.",
            "Probably the closest to natural language would add something.",
            "Show me something great.",
            "And so it is not.",
            "We do need an order.",
            "OK. Not yet at 0 cost.",
            "OK, great, so we see even more in the next talk.",
            "OK, one more question.",
            "So what from Alpha isn't using any semantic web data as of now, they said they would be using somebody.",
            "The differences is Wolfram Alpha is using a highly curated knowledge base and I think they are shunning away from using just some data from the web.",
            "So maybe one day just getting so I really don't know anything about the back end.",
            "Actually I think some other people are more knowledgeable about what's going on in.",
            "But from our find out here, so you probably should direct this question maybe 2.",
            "Yes.",
            "Yeah, I would agree because there kind of data is kind of different local final semantic web.",
            "OK, my time so well."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we're going through the three different topics.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The first semantic web I've seen it a few of, you know, already the semantic Web basic technologies, but if you don't, so I'm trying to bring you up to speed altogether and I hope it won't be too boring for those who already know it.",
                    "label": 0
                },
                {
                    "sent": "I will talk a little bit about Owl, which is one part of the semantic Web technology stack.",
                    "label": 0
                },
                {
                    "sent": "And then finally I will introduce Semantic Mediawiki, how it's used and what is it used for.",
                    "label": 1
                },
                {
                    "sent": "For example in this project.",
                    "label": 0
                },
                {
                    "sent": "So this is the model.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Goal of the Semantic Web universal access to all knowledge out there.",
                    "label": 1
                },
                {
                    "sent": "How are we going?",
                    "label": 0
                },
                {
                    "sent": "How is the semantic web going to achieve that?",
                    "label": 0
                },
                {
                    "sent": "So the semantic web is basically a stack of technology.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yes, so if you look at his stack.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is the famous Semantic Web layer cake.",
                    "label": 0
                },
                {
                    "sent": "It has been changing a lot during the last few years and this is the current version of it.",
                    "label": 0
                },
                {
                    "sent": "I expected to further change in the future, so in order to introduce the semantic web and actually go through those technologies and say what they are used for and then in the end you will hopefully get a more complete picture of how they interact with each other and how to work with each other.",
                    "label": 0
                },
                {
                    "sent": "If you have any questions at anytime.",
                    "label": 0
                },
                {
                    "sent": "Since it's a rough a long talk, please raise your hand immediately and ask.",
                    "label": 0
                },
                {
                    "sent": "Or if I'm going to fast.",
                    "label": 0
                },
                {
                    "sent": "So if we can team over whatever, OK so?",
                    "label": 0
                },
                {
                    "sent": "I start with the most basic of those technology, which is actually our DF.",
                    "label": 0
                },
                {
                    "sent": "This is useful data interchange.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what is RDF first thing, RDF is really simple.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In IDF you have basically entities like for example an entity named Angola and you can introduce anytime new entities.",
                    "label": 0
                },
                {
                    "sent": "So I introduce another entity called Africa.",
                    "label": 0
                },
                {
                    "sent": "Now the interesting thing in RDF is that you can connect those entities that you can say OK, let's say Angola is located in Africa.",
                    "label": 0
                },
                {
                    "sent": "What you see here is a triple.",
                    "label": 0
                },
                {
                    "sent": "This is the basic building element of the semantic web to basic building element of RDF Angola located in Africa have a subject property object thing and and this is how you build the graph of the semantic web.",
                    "label": 0
                },
                {
                    "sent": "So we can now introduce further elements.",
                    "label": 0
                },
                {
                    "sent": "Further entities like Sambia and say, well Sambiase also located in Africa, reusing the same Africa that we have before.",
                    "label": 0
                },
                {
                    "sent": "We can introduce new properties, for example borders and we can say Angola, border Zambia.",
                    "label": 0
                },
                {
                    "sent": "So now the graph is growing.",
                    "label": 0
                },
                {
                    "sent": "At this we can introduce an entities new properties at anytime.",
                    "label": 0
                },
                {
                    "sent": "And that's basically it.",
                    "label": 0
                },
                {
                    "sent": "About the semantic web.",
                    "label": 0
                },
                {
                    "sent": "The next thing we can.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Introduces sets of things.",
                    "label": 0
                },
                {
                    "sent": "For example, we can introduce a set called countries to include both Angolan Sambia and they can include a can introduce a set of continents that in this case would include Africa and modern sets, entities and properties is actually not more than that to it now.",
                    "label": 0
                },
                {
                    "sent": "The proper is it this idea that we see here we have somehow to translator technology, so we have some how to make it understandable not only by humans who can easily understand the ideas of sets of entities of properties.",
                    "label": 0
                },
                {
                    "sent": "But we also have to make it understandable computers.",
                    "label": 0
                },
                {
                    "sent": "So the first thing that we have to do is to find identifiers for all of those things.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Sorry, one step if the first thing you have to do is we can send around sets of things like this.",
                    "label": 0
                },
                {
                    "sent": "So we introduced new entities to actually represent those sets.",
                    "label": 0
                },
                {
                    "sent": "So we have a new entity country in your entity.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Continent and we have to make connections between the items of the type type.",
                    "label": 0
                },
                {
                    "sent": "So we say that Angola has type country.",
                    "label": 0
                },
                {
                    "sent": "Africa is the type continent, so we have the same very same meaning as which has had the second ago.",
                    "label": 0
                },
                {
                    "sent": "So we do have sets of countries.",
                    "label": 0
                },
                {
                    "sent": "You do have sets of continents, but we only represent them in a different way and this is a pattern that you will keep on seeing during this presentation.",
                    "label": 0
                },
                {
                    "sent": "So basically.",
                    "label": 0
                },
                {
                    "sent": "One hand, we have the meaning that's there for the humans really to understand, and on the other hand we have to representation that in on the different abstraction layer we have representation that's closer to computer.",
                    "label": 0
                },
                {
                    "sent": "So in this time we turned the set meaning again to triples.",
                    "label": 0
                },
                {
                    "sent": "So and this is one of the major things said everything on the semantic web is a triple.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the semantics of this thread and this is really the same.",
                    "label": 0
                },
                {
                    "sent": "So the next thing is that we.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is just a view of idea.",
                    "label": 0
                },
                {
                    "sent": "The next thing is that we need to identify the.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thanks so for identification.",
                    "label": 0
                },
                {
                    "sent": "The web offers the URIRI technology.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Your eyes are uniform resource identifiers and I are eyes are internationalized, resource identifiers meanings today actually the same thing, but they're using Unicode, so we can use all those Unicode letters inside of you.",
                    "label": 1
                },
                {
                    "sent": "I what you see down here is your eye.",
                    "label": 0
                },
                {
                    "sent": "For example for myself, so it says HTTP Semantic web autoguide, any random church.",
                    "label": 0
                },
                {
                    "sent": "And how are those your eyes built?",
                    "label": 0
                },
                {
                    "sent": "So first ever your identification and identifies exactly 1 entity.",
                    "label": 0
                },
                {
                    "sent": "This is important.",
                    "label": 0
                },
                {
                    "sent": "We don't have the same.",
                    "label": 0
                },
                {
                    "sent": "You're identifying several entities is always clear what it identifies.",
                    "label": 0
                },
                {
                    "sent": "And most semantic web.",
                    "label": 1
                },
                {
                    "sent": "Your eyes usually use HTTPS protocol.",
                    "label": 0
                },
                {
                    "sent": "The protocol is the first part of the UI.",
                    "label": 0
                },
                {
                    "sent": "HTP is a well known protocol for the hypertext Transfer and support of using it on the web everyday.",
                    "label": 0
                },
                {
                    "sent": "And the nice thing about is that on the semantic web, we can use it to resolve more data.",
                    "label": 0
                },
                {
                    "sent": "Once you use an HTTP UI.",
                    "label": 0
                },
                {
                    "sent": "So this means that if you have your eye like this, identifying myself an agent could go to this year.",
                    "label": 1
                },
                {
                    "sent": "I resolve it and get more data about this.",
                    "label": 0
                },
                {
                    "sent": "Entity figuring out what is what is supposed to mean, and this is what we call link data.",
                    "label": 0
                },
                {
                    "sent": "If it is set up like this.",
                    "label": 0
                },
                {
                    "sent": "So using your eyes on the semantic Web means that you have identifiers that are globally unique for for identifying entities and that have data on them described on the web that the agent could automatically look up and figure out what this entity is supposed to mean.",
                    "label": 0
                },
                {
                    "sent": "So looking at the architecture of your eye, you first have the protocol.",
                    "label": 0
                },
                {
                    "sent": "This is in this case HTP, which is in most cases actually HTTP, and but it could be also different protocol.",
                    "label": 0
                },
                {
                    "sent": "For example FTP or HTTPS or whatever you want here.",
                    "label": 0
                },
                {
                    "sent": "The second one is the domain.",
                    "label": 0
                },
                {
                    "sent": "I'm giving ownership to a legal entity to keep over this domain.",
                    "label": 0
                },
                {
                    "sent": "Then the first part completed is called.",
                    "label": 0
                },
                {
                    "sent": "The namespace is going to the to the last slash or a hash inside the UI.",
                    "label": 0
                },
                {
                    "sent": "And then you have to local name at the end so the namespace is usually a way to collect the number of similar entities and the local name actually gives you the actual edited you're referring to.",
                    "label": 0
                },
                {
                    "sent": "Most of the time, what you will see in many semantic web related works as that namespace actually shortened by Q name, which means that we are replacing the namespace with prefix, so the local name stays the same, but there is a prefix that actually refers to the namespace.",
                    "label": 0
                },
                {
                    "sent": "So in this case you have much more readable your eye because your eyes tend to be a bit cumbersome and writing down when using, but this is really just.",
                    "label": 0
                },
                {
                    "sent": "An abstraction an another layer that helps us keep picking things sample.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Looking at the graph again, we had a second ago.",
                    "label": 0
                },
                {
                    "sent": "This means that all those entities that we see here, that all those properties are actually not named Africa Angola, but drafted are your eyes representing them so.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This means all of those entities can be looked up on the on the on the web and find more information about them, so that wherever I used the ID for Angola, I mean the same thing.",
                    "label": 0
                },
                {
                    "sent": "I mean the same entity Representative and I can look up what kind of information is already there.",
                    "label": 0
                },
                {
                    "sent": "So far, since humans are not that good at dealing with your eyes and becomes kind of cumbersome to read, there is another property that's called label, or there's actually your eye for that as well, and the label connects basically any entity on the web on semantic Web with a human readable label in a specific language.",
                    "label": 0
                },
                {
                    "sent": "So this htpunderworld.org ID Angola, for example, would be connected to a label in English called Angola.",
                    "label": 0
                },
                {
                    "sent": "Just just name and the same thing for all the other entities here.",
                    "label": 0
                },
                {
                    "sent": "So we have that for the effort.",
                    "label": 0
                },
                {
                    "sent": "The actual instances like Africa, Zambia, we have to properties we have said also for the for the categories for the classes so and not a nice thing is well those I have to be in a specific language like for example English.",
                    "label": 0
                },
                {
                    "sent": "I could easily add labels in other languages like for example tie.",
                    "label": 0
                },
                {
                    "sent": "So in this case the structure of.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The knowledge base completely the same, but they have another human readable interpretation of different language.",
                    "label": 0
                },
                {
                    "sent": "I can just add it to the to the previous graph so we have both representations in the same graph.",
                    "label": 0
                },
                {
                    "sent": "So in this case the system.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The human really looks like this if it would be able to reach tier so.",
                    "label": 0
                },
                {
                    "sent": "More like this.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Get in English, but the meaning is very same thing as.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yes and graph you.",
                    "label": 0
                },
                {
                    "sent": "So to sum up until now, subjects and predicates are all your eyes objects at your eyes, so literals literal is concrete data value.",
                    "label": 1
                },
                {
                    "sent": "For example, a number like 27 or a date still number there about 2526 different data types defined in this specification.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "Um, this is very hot right now, so this is our the FUI.",
                    "label": 0
                },
                {
                    "sent": "In reality we can send around pictures like this in the web so.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We do have to send around this XML, for example, or any other kind of machine readable thing that can understand.",
                    "label": 0
                },
                {
                    "sent": "But really this graph here.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And XML are basically the same thing we see here.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That we have things called Angola, for example, and then they have borders to things like Zambia in this case or to have located in Africa and so So what we see here and what we see here as are just different represent.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nations of the same thing, and it's just that computers are much better than this.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Bending angle brackets in graphs.",
                    "label": 0
                },
                {
                    "sent": "But in the end.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then several civilization formats like this XML format is an free, which is a bit easier to read on humans and so on, but it doesn't really matter what kind of format you really use.",
                    "label": 0
                },
                {
                    "sent": "The major thing on the web is actually the meaning of what you're sending around, and this is what is standardized by the technology.",
                    "label": 0
                },
                {
                    "sent": "So do you have a number of different formats and do represent same thing in the end?",
                    "label": 0
                },
                {
                    "sent": "So this is how XML fits and uh-huh.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Picture it's not completed two completely between your eyes and Rs because you do have non XML ways to represent RDF.",
                    "label": 0
                },
                {
                    "sent": "For example an free.",
                    "label": 0
                },
                {
                    "sent": "But this is a minor detail.",
                    "label": 0
                },
                {
                    "sent": "So now we have covered the basis of what semantic web is, which is basically RDF using for example XML a serialization format and building on top of your eyes.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On top of RDF we have a number of technologies that help us extend the meaning of things.",
                    "label": 0
                },
                {
                    "sent": "For example, as a query language Sparkle sparkle is language and protocol for querying RDF.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is an example for us public very language.",
                    "label": 0
                },
                {
                    "sent": "So the first thing that you see here, which is written a bit smaller, is defining a few prefixes that we have seen earlier that can be used to for easier writing of the rest of the sparkle query to shorten.",
                    "label": 0
                },
                {
                    "sent": "the UI is basically.",
                    "label": 0
                },
                {
                    "sent": "So, but we are looking.",
                    "label": 0
                },
                {
                    "sent": "Here is a variable called label.",
                    "label": 0
                },
                {
                    "sent": "You see variables.",
                    "label": 0
                },
                {
                    "sent": "You can recognize them by the question mark and the variable label asks for something that is connected with the ADFS label property to that label.",
                    "label": 0
                },
                {
                    "sent": "And there's something to see is the one thing that the Angola thing.",
                    "label": 0
                },
                {
                    "sent": "It's related in located in relationship too.",
                    "label": 1
                },
                {
                    "sent": "So basically what we're doing here is we're building a pattern and then we're matching the graph against this pattern.",
                    "label": 0
                },
                {
                    "sent": "So look at this pattern.",
                    "label": 0
                },
                {
                    "sent": "We are looking for a C that has a label.",
                    "label": 0
                },
                {
                    "sent": "And see is the one thing that Angola is located in.",
                    "label": 0
                },
                {
                    "sent": "So if you look at the graph again.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The triple we have.",
                    "label": 0
                },
                {
                    "sent": "Finding OK Darius lingo laughing.",
                    "label": 0
                },
                {
                    "sent": "There's only one and other things because, well, they're all unique and there is 1 located in relationship in the graph as sweet as far as we know as far as this graph is concerned.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to locate it.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In variable C, leads to one bind.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sing for the variable C, which is the Africa.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The underworld alcaide AFFO.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Your eye so C will be bound to the UI.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The upper right corner.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And now that C is bound, we can.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For well labeled leads to.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's only one label going out from Africa, so we see that it's the same UI for the label as the rail line up there, and this table goes to Africa, so the result of the sparkle query in this case.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Will just be the the word F.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is how we can very RDF.",
                    "label": 0
                },
                {
                    "sent": "Satisfy the F using sparkle.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm there.",
                    "label": 0
                },
                {
                    "sent": "Sure.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "Supposed to be some kind of great optimizer sites there supposed to be a query optimizer to do that so the order is completely irrelevant as this is for RDF, so it's a completely declarative meaning that the order of the statements doesn't matter at all.",
                    "label": 0
                },
                {
                    "sent": "Anything like the languages, so we're supposed to multiple Labor Relations to get this working laborers.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Actually, the relations always the same.",
                    "label": 0
                },
                {
                    "sent": "In this case you could filter label by language actually, so in.",
                    "label": 0
                },
                {
                    "sent": "Right so so big.",
                    "label": 0
                },
                {
                    "sent": "But for the sake of this, we will actually want the English label or we actually wanted tileable most of the ontologies out.",
                    "label": 0
                },
                {
                    "sent": "They actually don't have labeling multiple languages, so in this case, but if it would have, we would just get the different tables and it was set up.",
                    "label": 0
                },
                {
                    "sent": "This is a table.",
                    "label": 0
                },
                {
                    "sent": "This is the English label, so if we had both of them instead we just would have get both results back.",
                    "label": 0
                },
                {
                    "sent": "But you can filter them if you want to.",
                    "label": 0
                },
                {
                    "sent": "Use.",
                    "label": 0
                },
                {
                    "sent": "It's it's.",
                    "label": 0
                },
                {
                    "sent": "Literal type with language, so it's it's in RDF.",
                    "label": 0
                },
                {
                    "sent": "Make a little difference between what a string is and what the literal language is.",
                    "label": 0
                },
                {
                    "sent": "So literal language is actually not a string according to RDF, which is a bit weird, but that's the way the standard defines it.",
                    "label": 0
                },
                {
                    "sent": "So you can filter the result by language, but it wouldn't be a string.",
                    "label": 0
                },
                {
                    "sent": "Not officially, even though you'll it's it is a string of characters, but that's not what it's called.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So with Sparkle we have one way to get information out of the semantic Web is one way to integrate information out of an RDF graph.",
                    "label": 0
                },
                {
                    "sent": "To get more information.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Into the system to get more semantics into the system.",
                    "label": 0
                },
                {
                    "sent": "Are there there further standards, like, for example RDF S which defines the schema on top of RDF?",
                    "label": 0
                },
                {
                    "sent": "So in RDF S. We have a number of further.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sure.",
                    "label": 0
                },
                {
                    "sent": "Terms that we can use that this is, for example, set class offset property of the main range and so on.",
                    "label": 0
                },
                {
                    "sent": "This this number of those.",
                    "label": 0
                },
                {
                    "sent": "So we go for one example, which is that we say that country is a subclass of location and it continent is also subclassification.",
                    "label": 0
                },
                {
                    "sent": "Looking at the previous graph.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Picture is actually means that both country and continent are subsets of location, so we will just draw a big circle around can encompassing both country and continent.",
                    "label": 0
                },
                {
                    "sent": "It means there can be more things inside locations.",
                    "label": 0
                },
                {
                    "sent": "For example City would be another example for a circle inside it.",
                    "label": 0
                },
                {
                    "sent": "So what it really says is that everything is in country is also location.",
                    "label": 0
                },
                {
                    "sent": "Everything is in continent is awesome location.",
                    "label": 0
                },
                {
                    "sent": "So this is the meaning of subclass off and.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Now in RDF, since we have to base it on triples, just again, looks a bit more complicated.",
                    "label": 0
                },
                {
                    "sent": "What we're really doing is it we're introducing a new entity.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Location entity, so we give you the label location and that we have a new property to subclass of property and to connecting to continent and a country to this to this new entity.",
                    "label": 0
                },
                {
                    "sent": "So now it's getting a bit confusing here.",
                    "label": 0
                },
                {
                    "sent": "It will get a little more confusing even because now what we can do is that we say that country is location and Angola is a country.",
                    "label": 0
                },
                {
                    "sent": "We can infer that Angola is also location.",
                    "label": 0
                },
                {
                    "sent": "So we don't put that triple in explicitly, but our about reasoner can actually infer that triple.",
                    "label": 0
                },
                {
                    "sent": "So, based on the rest of the knowledge that we have based on the fact that Angola is a country, an countries a subclass of location.",
                    "label": 0
                },
                {
                    "sent": "This also means that Angola is also location, so this is the inference that we make.",
                    "label": 0
                },
                {
                    "sent": "So I said we won't put that triple into into the into graph explicitly, but sparkle query engine that actually.",
                    "label": 0
                },
                {
                    "sent": "Has a reason in the background.",
                    "label": 0
                },
                {
                    "sent": "It's aware of the semantics of the IDF.",
                    "label": 0
                },
                {
                    "sent": "Statement can still return this answer, so if I ask for all the locations, I will also get back Angola.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The same thing for Africa and Sambia, since they are country respectively a continent.",
                    "label": 0
                },
                {
                    "sent": "So that's all inflatables.",
                    "label": 0
                },
                {
                    "sent": "This is again written down at bottom.",
                    "label": 0
                },
                {
                    "sent": "So this is the basic inference that we do here.",
                    "label": 0
                },
                {
                    "sent": "For the subclass of property, and we have all these kind of properties.",
                    "label": 0
                },
                {
                    "sent": "All of this kind of inference for the rest of the IDF's language.",
                    "label": 0
                },
                {
                    "sent": "So bad again.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Even though this looks a bit complicated, this is just closer to the computer representation in reality.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is as simple as this one.",
                    "label": 0
                },
                {
                    "sent": "Sure.",
                    "label": 0
                },
                {
                    "sent": "This one.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "So other facets of has only very limited support for this kind of constraints, but we will get to our, which is a much more richer language for describing those classes.",
                    "label": 0
                },
                {
                    "sent": "And there you will have a number of constructs to describe.",
                    "label": 0
                },
                {
                    "sent": "Your class is very detailed, so we will.",
                    "label": 0
                },
                {
                    "sent": "We will come to this the answer discussion a second, OK?",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good.",
                    "label": 0
                },
                {
                    "sent": "So, but the major summary of this first part should be that in the end it all boils down to the simplicity simplicity of this.",
                    "label": 0
                },
                {
                    "sent": "You have individuals you have properties within individuals, and you have classes of individuals.",
                    "label": 0
                },
                {
                    "sent": "How it's really represented.",
                    "label": 0
                },
                {
                    "sent": "You know that you have.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All those triplets that you have always your eyes that you're sending around XML files, which is basically one level beneath.",
                    "label": 0
                },
                {
                    "sent": "It's just the same thing As for the normal Web user today.",
                    "label": 0
                },
                {
                    "sent": "They don't care about HTML and CSS and all those things they have the tools on top of that and what they really want to.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "She is a simple picture like this and that they understand them at the meaning of that they can share the meaning of what is important is that.",
                    "label": 0
                },
                {
                    "sent": "Once we have those standards in place, I mean the standards are not defining something terrifically new.",
                    "label": 0
                },
                {
                    "sent": "I like set theory, is well known already, but but they're standards that's important thing and that's why we can exchange data from one system to the next.",
                    "label": 0
                },
                {
                    "sent": "That's why we can exchange data over this over the web, so it's the same thing As for the web have mean when the web was introduced in 91, it wasn't anything terrifically new insight.",
                    "label": 0
                },
                {
                    "sent": "I mean, HTML HTML was.",
                    "label": 0
                },
                {
                    "sent": "Very basic, very simple hypertext language.",
                    "label": 0
                },
                {
                    "sent": "Compared to the things that have been developed the years before, HTP was also a very naive protocol for exchanging data, but those were opens standard that everyone could use, and it actually people started reusing.",
                    "label": 0
                },
                {
                    "sent": "So once HTP your eyes and HTML was set up, we suddenly had.",
                    "label": 0
                },
                {
                    "sent": "Base for everyone to use the same technologist, use the same standards and that's why the web has started.",
                    "label": 0
                },
                {
                    "sent": "It didn't start because of any new inventions that have come along, and it's the same thing for the semantic web.",
                    "label": 0
                },
                {
                    "sent": "Basically, show there's a number of research around semantic web, basic fundamental issues, But the major contribution of the semantic Web adult standards, and they're boring there.",
                    "label": 0
                },
                {
                    "sent": "Simple, but it's OK there there in order to be used in reuse, and.",
                    "label": 0
                },
                {
                    "sent": "And so as soon as you have your date and at the office, unless you have today to put up on semantic Web, other people can link to it.",
                    "label": 0
                },
                {
                    "sent": "So the basic version.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The semantic web is really looking, so I put my little Africa ontology out there.",
                    "label": 0
                },
                {
                    "sent": "I put a little graph out on the semantic web, So what someone else could come along and put their biology ontology under web.",
                    "label": 0
                },
                {
                    "sent": "So if if example containing what animals are there, how they are related to each other, whatever plans are on sort of taxonomy from biology but so, but so we have two graphs on the semantic web.",
                    "label": 0
                },
                {
                    "sent": "What's the point?",
                    "label": 0
                },
                {
                    "sent": "Not a nice thing is I said since all those entities identify it.",
                    "label": 0
                },
                {
                    "sent": "Why your eyes?",
                    "label": 0
                },
                {
                    "sent": "Someone third person could actually come along and say, OK, you know your African elephant from your biology ontology and the Africa, an entity from the geography ontology.",
                    "label": 0
                },
                {
                    "sent": "But actually I can relate them.",
                    "label": 0
                },
                {
                    "sent": "I can say that the African elephant lives in Africa.",
                    "label": 0
                },
                {
                    "sent": "So I can just grab one entity from an arbitrary graph and connected to an entity from another arbitrary graph, and therefore creating a much bigger graph so everyone can come along and add their own information to the semantic web about whatever they know.",
                    "label": 0
                },
                {
                    "sent": "Maybe tourism, maybe history.",
                    "label": 0
                },
                {
                    "sent": "Maybe topics like economy or whatever, and this is how the graph grows, how to semantic becomes a giant global graph as Tim Berners Lee called it recently.",
                    "label": 0
                },
                {
                    "sent": "And they and all those entities can be interconnected, can be queried and the information becomes to universally accessible by machines and can therefore be.",
                    "label": 0
                },
                {
                    "sent": "Connected and mushed together.",
                    "label": 0
                },
                {
                    "sent": "It's basically the ultimate measure of data.",
                    "label": 0
                },
                {
                    "sent": "Could we have questions about the semantic Web at this point?",
                    "label": 0
                },
                {
                    "sent": "It's fine so.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All those bubbles here actually represent.",
                    "label": 0
                },
                {
                    "sent": "Usually huge graphs of RDF data, so these are not entities.",
                    "label": 0
                },
                {
                    "sent": "Now these are datasets, so for example we have here.",
                    "label": 0
                },
                {
                    "sent": "The DB PEDIA data set in the middle.",
                    "label": 0
                },
                {
                    "sent": "There's geonames having a lot of geographical data.",
                    "label": 0
                },
                {
                    "sent": "Our Daisy RDF book mashup.",
                    "label": 0
                },
                {
                    "sent": "We has a lot of a ISBN numbers and stuff like this, so all these bubbles here datasets an they are interconnected with each other.",
                    "label": 0
                },
                {
                    "sent": "That's what arrows represent and this is 1 view of the semantic web.",
                    "label": 0
                },
                {
                    "sent": "That was done in March this year.",
                    "label": 0
                },
                {
                    "sent": "Currently has more than five or 6 billion triples out there, and it's all data that can be used by in standard waste.",
                    "label": 0
                },
                {
                    "sent": "Can be used by your applications.",
                    "label": 0
                },
                {
                    "sent": "Sure.",
                    "label": 0
                },
                {
                    "sent": "So link in this picture is defined by.",
                    "label": 0
                },
                {
                    "sent": "They are entities that are mapped to each other and between the datasets.",
                    "label": 0
                },
                {
                    "sent": "So in this case for example, DB pedia in Geo names.",
                    "label": 0
                },
                {
                    "sent": "For example, the PEDIA has terms for everything that is happening.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia Artikel Geonames has terms for Arifin geographical, so there are a lot of overlap between those two datasets.",
                    "label": 0
                },
                {
                    "sent": "So for example the blade has both Wikipedia article and an entry in Geonames, so there would be a triple actually saying that displayed in.",
                    "label": 0
                },
                {
                    "sent": "The Pedia and Bled and Geo.",
                    "label": 0
                },
                {
                    "sent": "Names are actually the same thing.",
                    "label": 0
                },
                {
                    "sent": "And since this happens, if you have 10,000 times, for example, there's a strong connection between GMC PEDIA and the more connections they add more.",
                    "label": 0
                },
                {
                    "sent": "The more mappings there are in the datasets, stronger the edit stronger the error in this picture.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So in fact this is the goal and this is what we're trying.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The Chief of Staff Technologies and the idea is that everyone joins in and puts the data up in RDF.",
                    "label": 0
                },
                {
                    "sent": "So this is how far we.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Come with the semantic web layers to stack.",
                    "label": 0
                },
                {
                    "sent": "We're taking another look at all in a second, but the first one to go.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For the rest of the layer cake, because I'm not going to detail in the end in those parts.",
                    "label": 0
                },
                {
                    "sent": "So on top of it all, is it you that user interface and application line?",
                    "label": 0
                },
                {
                    "sent": "This was introduced pretty late, which is surprising because it's actually kind of important to have some applications to have user interface to all this data because humans don't tend to send out get request themselves.",
                    "label": 0
                },
                {
                    "sent": "They need some agent to actually do that.",
                    "label": 0
                },
                {
                    "sent": "They need some agent to render the data for them to allow them to add data system and so on.",
                    "label": 0
                },
                {
                    "sent": "So these are all the tools that are actually using the semantic web.",
                    "label": 0
                },
                {
                    "sent": "It doesn't have to be a browser.",
                    "label": 0
                },
                {
                    "sent": "It could also be, for example your media player that whenever it plays a song it goes to the DB Tunes.",
                    "label": 0
                },
                {
                    "sent": "Database for example.",
                    "label": 0
                },
                {
                    "sent": "Or it goes to BBC website and connects to data for the for the artist that is being played or connects to data for the song that is being played and put it into the media player and displace it.",
                    "label": 0
                },
                {
                    "sent": "So this is 1 example.",
                    "label": 0
                },
                {
                    "sent": "So all kinds of applications can actually be using the semantic web.",
                    "label": 0
                },
                {
                    "sent": "It doesn't have to be the browser.",
                    "label": 0
                },
                {
                    "sent": "Next to our in at the F There's something going on.",
                    "label": 0
                },
                {
                    "sent": "It's called riff to rule interchange format.",
                    "label": 0
                },
                {
                    "sent": "It defines a.",
                    "label": 0
                },
                {
                    "sent": "Additional semantics to what is already in our and in RDF S by allowing you to specify rules it's currently in last call an expected to be standardized.",
                    "label": 0
                },
                {
                    "sent": "And during this year, maybe beginning of next year will see so on top, since we have those different semantics now we have sparkle on the one hand for querying the information we have our for.",
                    "label": 0
                },
                {
                    "sent": "For defining ontologies we have riffer defining rules.",
                    "label": 0
                },
                {
                    "sent": "It's actually a bit unclear how to really interrelate with each other.",
                    "label": 0
                },
                {
                    "sent": "There's a bit of trouble, so one.",
                    "label": 0
                },
                {
                    "sent": "Next step is to have unifying logic above them.",
                    "label": 0
                },
                {
                    "sent": "It's not even completely clear if this is possible.",
                    "label": 0
                },
                {
                    "sent": "This definitely recent questions for all of those who are in universities.",
                    "label": 0
                },
                {
                    "sent": "There's alot of things to be research in the next few years I guess.",
                    "label": 0
                },
                {
                    "sent": "And to figure out how unifying logic are these free.",
                    "label": 0
                },
                {
                    "sent": "Stacks could look like.",
                    "label": 0
                },
                {
                    "sent": "Once we have the unifying logic or even before that actually.",
                    "label": 0
                },
                {
                    "sent": "What will be needed is a credit is a language for proofs, so we have seen that influencer possible does inferences can become pretty complicated, so we have seen a very simple example of influence where countries also location, but especially with our special with Rif, we can have actually very complicated proofs, very complicated inferences.",
                    "label": 0
                },
                {
                    "sent": "We feed that in a second, but.",
                    "label": 0
                },
                {
                    "sent": "Some of our agents may be too small, for example, to make those complicated influences.",
                    "label": 0
                },
                {
                    "sent": "So, for example, if mobile agents to phone you don't want to have a full fledge, our two reason are running on it and like figuring out over a few million triples what it adds to your question is you want to delegate it to the cloud, but you want to have a way that your mobile phone checks this information.",
                    "label": 0
                },
                {
                    "sent": "So coming up with a solution is much harder than checking a proof.",
                    "label": 0
                },
                {
                    "sent": "That's what we know from mathematics.",
                    "label": 0
                },
                {
                    "sent": "So the idea is to whenever you make an inference that you can actually formalize the proof for it so that the system can check if the information is correct.",
                    "label": 0
                },
                {
                    "sent": "And therefore.",
                    "label": 0
                },
                {
                    "sent": "Even a small scale system like your own computer like you're like a mobile phone can check the information that the cloud has.",
                    "label": 0
                },
                {
                    "sent": "For example produced easily based on the on the formalized proof.",
                    "label": 0
                },
                {
                    "sent": "Why we need that?",
                    "label": 0
                },
                {
                    "sent": "As because it's one step that's needed in order to find trust on the semantic web.",
                    "label": 0
                },
                {
                    "sent": "So we want to be able to figure out if a day if specific triple is correct.",
                    "label": 0
                },
                {
                    "sent": "If a specific inference is correct.",
                    "label": 0
                },
                {
                    "sent": "If it can be trusted or not.",
                    "label": 0
                },
                {
                    "sent": "So the one hand we need those proof mechanisms in order to check out the infer trippers.",
                    "label": 0
                },
                {
                    "sent": "But we also need crypto layer in order to sign triples in order to figure out where did it come from to understand prominence, to understand to really.",
                    "label": 0
                },
                {
                    "sent": "Um and see.",
                    "label": 0
                },
                {
                    "sent": "OK, those triples are coming from the CIA, so I taking it for greater salt dough strips that come from Wikipedia and believing them or whatever the way around you want to do it.",
                    "label": 0
                },
                {
                    "sent": "You can, you can see OK, this information is coming from BBC, so I more trustworthy than that information that's coming from some.",
                    "label": 0
                },
                {
                    "sent": "Depending network or whatever, so um.",
                    "label": 0
                },
                {
                    "sent": "But you want to have the way to express those things you want to have, and that's what those upper layers are all about, so that we don't get a lot of semantic spam in the future.",
                    "label": 0
                },
                {
                    "sent": "Then you can't sift through the information anymore.",
                    "label": 0
                },
                {
                    "sent": "OK so far to the complete semantic Web layer cake I've been running through the last few things a bit.",
                    "label": 0
                },
                {
                    "sent": "Any questions so far?",
                    "label": 0
                },
                {
                    "sent": "OK. OK, just to repeat the questions because I think that was hard to hear.",
                    "label": 0
                },
                {
                    "sent": "The question is, can I trust only complete ontology?",
                    "label": 0
                },
                {
                    "sent": "So can I trust also specific statements or specific parts of the statement?",
                    "label": 0
                },
                {
                    "sent": "There is no trust layer, yet it doesn't exist yet, so I can't answer this question.",
                    "label": 0
                },
                {
                    "sent": "I suppose that in the end the standard will allow also to state that I trust a subset of it or somewhere.",
                    "label": 0
                },
                {
                    "sent": "But really this is future work to be done, so there is no answer to this question.",
                    "label": 0
                },
                {
                    "sent": "Face.",
                    "label": 0
                },
                {
                    "sent": "I sure hope so.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's still research going on and so I can't answer you really.",
                    "label": 0
                },
                {
                    "sent": "Anything of those questions, but I'm pretty sure I noted people that are working in this field are definitely knowledgeable about things, right?",
                    "label": 0
                },
                {
                    "sent": "Reputation systems about things like.",
                    "label": 0
                },
                {
                    "sent": "Asymmetric signatures and stuff like that.",
                    "label": 0
                },
                {
                    "sent": "So, so I assume that they will pull in together a lot of those knowledge in order to come up with a standard, but I said it's future work to be done.",
                    "label": 0
                },
                {
                    "sent": "So if you're interested in this area, there's a few PhD will be written there.",
                    "label": 0
                },
                {
                    "sent": "And in one standard to be written there, which is actually much harder than writing a PhD OK.",
                    "label": 0
                },
                {
                    "sent": "But about all this layer up there, that's really something that is going to happen.",
                    "label": 0
                },
                {
                    "sent": "It's not there yet, so I can't answer you.",
                    "label": 0
                },
                {
                    "sent": "Any questions about it, obviously.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "I want to talk.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Little bit about a few features of Owl.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "In our we had.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "All is short for Web Ontology language so.",
                    "label": 1
                },
                {
                    "sent": "They turned around the letters in an intentional joke to be inconsistent at this point because the rest of the language is so consistent, but.",
                    "label": 0
                },
                {
                    "sent": "In an hour you have ontologies, classes, properties, individuals.",
                    "label": 0
                },
                {
                    "sent": "Well you have seen most of those already in RDF S, so an ontology is a farmer.",
                    "label": 1
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Fication of a shared conceptualization.",
                    "label": 0
                },
                {
                    "sent": "That's the usual definition of mythology.",
                    "label": 0
                },
                {
                    "sent": "What does this actually mean?",
                    "label": 0
                },
                {
                    "sent": "Formal specification means?",
                    "label": 0
                },
                {
                    "sent": "That formally, it is that it's readable by computer, that it can be understood by computer and that it can be executed by computer.",
                    "label": 0
                },
                {
                    "sent": "Shared conceptualization means that we're not talking.",
                    "label": 0
                },
                {
                    "sent": "About reality Anna Direct sense, but rather about our conceptualization of reality.",
                    "label": 0
                },
                {
                    "sent": "So we are talking here, about conceptualization.",
                    "label": 0
                },
                {
                    "sent": "Parts of a domain.",
                    "label": 0
                },
                {
                    "sent": "It is shared by several people.",
                    "label": 0
                },
                {
                    "sent": "And we are specifying this conceptualization, which means we're translating it to inform a system.",
                    "label": 0
                },
                {
                    "sent": "In this case, Owl, in order to specify.",
                    "label": 0
                },
                {
                    "sent": "But we conceptualize about the world in order to give it formal, represented in order to give it away to their computer, can access it and execute it.",
                    "label": 0
                },
                {
                    "sent": "An easier way to see that and ontology defines terms and the formulations to each other.",
                    "label": 0
                },
                {
                    "sent": "So in order to describe a domain mini to use any do some terms.",
                    "label": 0
                },
                {
                    "sent": "And so we need to define those terms.",
                    "label": 0
                },
                {
                    "sent": "We need to define the relationship between these terms in a formal way.",
                    "label": 0
                },
                {
                    "sent": "OK, and notorious find using our culture language and in this case we will.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is our all his number of various varieties, so the first hour had our light, our DLL full, the second hour has even more of those veterans.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to detail here.",
                    "label": 0
                },
                {
                    "sent": "What is actually what you have to remember is the more that was different, our varients actually are.",
                    "label": 0
                },
                {
                    "sent": "Using a different set of our terms.",
                    "label": 1
                },
                {
                    "sent": "That means we've seen a number of terms in the next few slides that are used to define ontologies.",
                    "label": 1
                },
                {
                    "sent": "And basically by using a different set of Trump's, you're using a different subset of our and you only have to worry about it if you worry about how complicated is actually for a reason, or to figure out answers to your questions once you are using those terms.",
                    "label": 0
                },
                {
                    "sent": "So, um.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm trying not to get a dealer so on this OK so I will.",
                    "label": 0
                },
                {
                    "sent": "So we have set with their classes, properties and individuals.",
                    "label": 0
                },
                {
                    "sent": "All classes are set of things just as in RDF as we have seen that, but our classes can also be described using description logics, so that's what the L comes from in our DL.",
                    "label": 0
                },
                {
                    "sent": "This means that a class can be described in terms of for the class means not just giving explicitly the list of all the entities inside this class.",
                    "label": 0
                },
                {
                    "sent": "But actually giving a description of what his class is supposed to be an intentional and description of the class, and this is done by using other terms with your ontology.",
                    "label": 0
                },
                {
                    "sent": "So with referring to the other words in ontology.",
                    "label": 0
                },
                {
                    "sent": "In order to relate to class descriptions, we have three different operators.",
                    "label": 0
                },
                {
                    "sent": "The first one is a subclass of operator.",
                    "label": 0
                },
                {
                    "sent": "You've seen it before, which means that the one classes of world class descriptions, subclass of the 2nd subclass description.",
                    "label": 0
                },
                {
                    "sent": "We have the equivalent class operator, which means the two class descriptions are completely equivalent.",
                    "label": 0
                },
                {
                    "sent": "This means that every.",
                    "label": 0
                },
                {
                    "sent": "Instances in one class description is also in the other, and the other way around.",
                    "label": 0
                },
                {
                    "sent": "And we actually disjoint with operators.",
                    "label": 0
                },
                {
                    "sent": "Basically the other, just the opposite, which means that those two classes scriptions have no common instances.",
                    "label": 0
                },
                {
                    "sent": "OK. No class descriptions can be.",
                    "label": 1
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Built using Boolean operators.",
                    "label": 0
                },
                {
                    "sent": "You know those arms intersection union complement are just given a few examples.",
                    "label": 0
                },
                {
                    "sent": "Sister would be defined as the intersection of woman and sibling.",
                    "label": 0
                },
                {
                    "sent": "So this means that everything.",
                    "label": 0
                },
                {
                    "sent": "It is both a woman and a sibling.",
                    "label": 0
                },
                {
                    "sent": "It's also sister and everything that is a sister is both a woman and a sibling, so the so the two classes scriptions on the one side we have a simple class name sister and on the other side within the second of two class names I quiver lipped.",
                    "label": 0
                },
                {
                    "sent": "Questions at this point.",
                    "label": 0
                },
                {
                    "sent": "Then this is a different different than.",
                    "label": 0
                },
                {
                    "sent": "This is a different meaning of the term Sister.",
                    "label": 0
                },
                {
                    "sent": "So in this case well OK I I'm simplifying here because I'm just using the word sister, but actually there would be a Euro I and your eyes are supposed to only .1 entity, so in this case you have a different meaning and this would be another UI.",
                    "label": 0
                },
                {
                    "sent": "But it's a good question yet, but we really try to avoid those cases by introducing new arise for all different meanings.",
                    "label": 0
                },
                {
                    "sent": "For union off, this is an example of the parent's union of Mother and Father.",
                    "label": 0
                },
                {
                    "sent": "Men is subclass of compliment of woman.",
                    "label": 0
                },
                {
                    "sent": "Why is it subclass?",
                    "label": 0
                },
                {
                    "sent": "Why is it a subclass?",
                    "label": 0
                },
                {
                    "sent": "Why is not equivalent?",
                    "label": 0
                },
                {
                    "sent": "Yeah, but no.",
                    "label": 0
                },
                {
                    "sent": "There's no advice do I was using equivalent offered Sister was using a current offer or should we parent not patent?",
                    "label": 0
                },
                {
                    "sent": "Sorry this is a type of.",
                    "label": 0
                },
                {
                    "sent": "And why don't I use this quarrel off here?",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "I didn't send it.",
                    "label": 0
                },
                {
                    "sent": "Other.",
                    "label": 0
                },
                {
                    "sent": "Exactly.",
                    "label": 0
                },
                {
                    "sent": "Right, Davidson, I did not get it.",
                    "label": 0
                },
                {
                    "sent": "Yes exactly so.",
                    "label": 0
                },
                {
                    "sent": "If, um.",
                    "label": 0
                },
                {
                    "sent": "Some some so.",
                    "label": 0
                },
                {
                    "sent": "Man is not everything that is not a woman in example a table and a camera for example.",
                    "label": 0
                },
                {
                    "sent": "They are not women, so they would be complement of women.",
                    "label": 0
                },
                {
                    "sent": "'cause this means not woman.",
                    "label": 0
                },
                {
                    "sent": "But they're not men.",
                    "label": 0
                },
                {
                    "sent": "So I know that man is a subclass of everything that is complemented woman.",
                    "label": 0
                },
                {
                    "sent": "So it's subset of the biggest set.",
                    "label": 0
                },
                {
                    "sent": "That is called not woman OK.",
                    "label": 0
                },
                {
                    "sent": "Since this is a common error, that's why I'm.",
                    "label": 0
                },
                {
                    "sent": "Standing around it, so if you're unsure if it's really equivalent.",
                    "label": 0
                },
                {
                    "sent": "If you're unsure if this is complete definition going, use a subclass of relationship instead off and because it is much weaker and its meaning.",
                    "label": 0
                },
                {
                    "sent": "But if you can redefine the term exist or parent, it is much better to use equivalent off 'cause my in this case you carry a lot more meaning of that you can, and you can really have more influence is out of the system.",
                    "label": 0
                },
                {
                    "sent": "You can describe classes using properties.",
                    "label": 0
                },
                {
                    "sent": "So this was.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, quit the question that was before so you can use terms like all values from some values from cardinality.",
                    "label": 0
                },
                {
                    "sent": "So in one often has value going given examples for those so sold daughter, which means a daughter that is the.",
                    "label": 0
                },
                {
                    "sent": "Only daughter is subclass of all values from sibling man.",
                    "label": 0
                },
                {
                    "sent": "So what does this mean?",
                    "label": 0
                },
                {
                    "sent": "Sibling is a property that connects me to my siblings.",
                    "label": 0
                },
                {
                    "sent": "If all my siblings.",
                    "label": 0
                },
                {
                    "sent": "A man.",
                    "label": 0
                },
                {
                    "sent": "Then I can be assault daughter.",
                    "label": 0
                },
                {
                    "sent": "Again, we have a subclass of relation.",
                    "label": 0
                },
                {
                    "sent": "It's not definition of the term soul Daughter, it's just a necessary condition.",
                    "label": 0
                },
                {
                    "sent": "So subclass off hasn't writes it always the necessary condition because it is a it's super set of what can be assault daughter.",
                    "label": 0
                },
                {
                    "sent": "Obviously it's lacking a few facts.",
                    "label": 0
                },
                {
                    "sent": "For example, they have to be a daughter, which means that it has to be a woman and so on.",
                    "label": 0
                },
                {
                    "sent": "But we have the condition that all my siblings have to be men.",
                    "label": 0
                },
                {
                    "sent": "So this is 1 condition for assault daughter.",
                    "label": 0
                },
                {
                    "sent": "Child is defined as having some values from parent woman, so.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "The parent property.",
                    "label": 0
                },
                {
                    "sent": "Has a value that is a woman.",
                    "label": 0
                },
                {
                    "sent": "In this case, the entity is a child and the other way around.",
                    "label": 0
                },
                {
                    "sent": "As soon as we're here for chat, we will have a parent property pointing to a woman.",
                    "label": 0
                },
                {
                    "sent": "In other terms, or in human readable, Alice would be that every child has at least has at least one woman's apparent that Batista's statement says.",
                    "label": 0
                },
                {
                    "sent": "And as soon as something has a woman's, apparently this is child.",
                    "label": 0
                },
                {
                    "sent": "You could also add another axiom, saying some errors from Parent man, in this case, just.",
                    "label": 0
                },
                {
                    "sent": "This would be perfectly fine, but it still holds.",
                    "label": 0
                },
                {
                    "sent": "This axiom is correct.",
                    "label": 0
                },
                {
                    "sent": "China is also defined as having cardinality on parent too.",
                    "label": 0
                },
                {
                    "sent": "So every child has two parents.",
                    "label": 0
                },
                {
                    "sent": "This is what it says here.",
                    "label": 0
                },
                {
                    "sent": "Person finally defining this ontology as having a gender which has to be male or female.",
                    "label": 0
                },
                {
                    "sent": "Now we starting to getting into an example of if this is culturally OK, I mean.",
                    "label": 0
                },
                {
                    "sent": "Is there really only those two genders?",
                    "label": 0
                },
                {
                    "sent": "Male and female?",
                    "label": 0
                },
                {
                    "sent": "Are there several other genders than that?",
                    "label": 0
                },
                {
                    "sent": "This skin actually does gender questions can get quite complicated.",
                    "label": 0
                },
                {
                    "sent": "And this is just to exemplify that.",
                    "label": 0
                },
                {
                    "sent": "Well, in this ontology we define it like this, because this is the definition of the conceptualization that we want to capture.",
                    "label": 0
                },
                {
                    "sent": "In many cases this is fine, but in other cases, for example, if actually dealing an.",
                    "label": 0
                },
                {
                    "sent": "In researching this areas, this is definitely not enough.",
                    "label": 0
                },
                {
                    "sent": "Then you need more terms to describe agenda.",
                    "label": 0
                },
                {
                    "sent": "Then you need more relationships.",
                    "label": 0
                },
                {
                    "sent": "Describe this kind of things.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I but nice thing is, once you make a statement like this.",
                    "label": 0
                },
                {
                    "sent": "Well, you don't have to use it.",
                    "label": 0
                },
                {
                    "sent": "I mean if someone states well there are two genders, male and female, but you can just ignore this ontology.",
                    "label": 0
                },
                {
                    "sent": "I mean, the semantic web will have a lot of statements and not all of those will be true or will be useful for you.",
                    "label": 0
                },
                {
                    "sent": "And at a given case.",
                    "label": 0
                },
                {
                    "sent": "Just like the web, you know, just because someone put something on the website doesn't mean that you will do that.",
                    "label": 0
                },
                {
                    "sent": "It doesn't mean that you will believe that it's what it said there.",
                    "label": 0
                },
                {
                    "sent": "Just because Fox publishers that the war in Iraq is over there, the mission is accomplished.",
                    "label": 0
                },
                {
                    "sent": "Doesn't mean that you have to believe that.",
                    "label": 0
                },
                {
                    "sent": "Same thing for the semantic web.",
                    "label": 0
                },
                {
                    "sent": "Just because there's an axiom saying it.",
                    "label": 0
                },
                {
                    "sent": "Well, So what?",
                    "label": 0
                },
                {
                    "sent": "You can choose to trust it or not.",
                    "label": 0
                },
                {
                    "sent": "To trust it, you can choose if this.",
                    "label": 0
                },
                {
                    "sent": "If this separation of gender in the male and female is useful for you.",
                    "label": 0
                },
                {
                    "sent": "If you want to subscribe.",
                    "label": 0
                },
                {
                    "sent": "If you want to use it ontology.",
                    "label": 0
                },
                {
                    "sent": "That sounds.",
                    "label": 0
                },
                {
                    "sent": "Choose to trust.",
                    "label": 0
                },
                {
                    "sent": "It's not the point.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's completely true.",
                    "label": 0
                },
                {
                    "sent": "So did you hear that comment?",
                    "label": 0
                },
                {
                    "sent": "Because it's important.",
                    "label": 0
                },
                {
                    "sent": "I know.",
                    "label": 0
                },
                {
                    "sent": "OK, I tried to capture.",
                    "label": 0
                },
                {
                    "sent": "Under, under, under Web as we know it, if you read Fox where you know that you're reading Fox and you're human, you can, and you can figure out if you want to trust it or not on the semantic web, we have agents dealing with those data, so it's the agent.",
                    "label": 0
                },
                {
                    "sent": "It has to decide if they want to trust it or not, and agents are not as clever.",
                    "label": 0
                },
                {
                    "sent": "Assume it's not OK.",
                    "label": 0
                },
                {
                    "sent": "Humans are also ages, but not, you know, it's the computer agents are not as clever as humans usually, and they have to figure out if the if an axiom like this is to be trusted or not, so it's not dead.",
                    "label": 0
                },
                {
                    "sent": "But I fully agree with that statement, but I think that the upper layers that are still research like the trust and provenance layer, the proof layer hopefully provide will someday provide a way to deal with that much easier so that we can have at least mechanisms to define and exchange information about this.",
                    "label": 0
                },
                {
                    "sent": "But yes, this is still definitely further research.",
                    "label": 0
                },
                {
                    "sent": "We have to figure out how to do that.",
                    "label": 0
                },
                {
                    "sent": "Equipment.",
                    "label": 0
                },
                {
                    "sent": "Equals one.",
                    "label": 0
                },
                {
                    "sent": "Something.",
                    "label": 0
                },
                {
                    "sent": "Or in this case, I can always say it's just because this is a term of person that we use in this term of male female reason, but you're right.",
                    "label": 0
                },
                {
                    "sent": "Not everything that has a gender male should be a person.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it should be a subclass of, yeah?",
                    "label": 0
                },
                {
                    "sent": "Oh, and has value was wondered for missing Woman is something that has value in general female.",
                    "label": 0
                },
                {
                    "sent": "So this is just the way to connect the term female with the term woman.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other properties, so we have seen a lot of description for classes, but the properties in our can also be described in several ways.",
                    "label": 0
                },
                {
                    "sent": "Um, so the we have.",
                    "label": 0
                },
                {
                    "sent": "Terms like sub property off this joint property, domain and range to describe properties.",
                    "label": 0
                },
                {
                    "sent": "We go for them again examples.",
                    "label": 0
                },
                {
                    "sent": "So the father of property would be a sub property of parent off, which means everything that has the property father after something also says property parent off to that same something.",
                    "label": 0
                },
                {
                    "sent": "Child Off is a disjoint property to parent off.",
                    "label": 0
                },
                {
                    "sent": "Now this doesn't mean that everything that it has the child of property cannot have a parent of property, because this is obviously false mouse.",
                    "label": 0
                },
                {
                    "sent": "Most people did.",
                    "label": 0
                },
                {
                    "sent": "Have children have also parents, but this means that you can't have this property to the same entity at the same time.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "If you have children, your children cannot be your parents.",
                    "label": 0
                },
                {
                    "sent": "Setting aside some.",
                    "label": 0
                },
                {
                    "sent": "It time travel stories, but otherwise your children cannot be a parent, so this two properties are disjoint.",
                    "label": 0
                },
                {
                    "sent": "You cannot have some of the same entities at the same time.",
                    "label": 0
                },
                {
                    "sent": "Domain defines where a property can start, so Father has a domain man, which means that everything that has the father property going out has to be a man.",
                    "label": 0
                },
                {
                    "sent": "Range is what it points to, so the range of father of would be child.",
                    "label": 0
                },
                {
                    "sent": "So everything that.",
                    "label": 0
                },
                {
                    "sent": "Has the father of relation pointing to has to be a child.",
                    "label": 0
                },
                {
                    "sent": "They refer to.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Things you can do with properties, you can say their symmetric or asymmetric sibling off.",
                    "label": 0
                },
                {
                    "sent": "For example symmetric, which means that everything that.",
                    "label": 0
                },
                {
                    "sent": "If A&B are siblings then also be an heir siblings.",
                    "label": 0
                },
                {
                    "sent": "Eh, symmetric Sam parent off.",
                    "label": 0
                },
                {
                    "sent": "If you have a parent they can't.",
                    "label": 0
                },
                {
                    "sent": "You can't be their parent.",
                    "label": 0
                },
                {
                    "sent": "We have terms for reflexive, irreflexive.",
                    "label": 0
                },
                {
                    "sent": "Reflexive is common genes, for example, everything that has a common genes property has also common genes to itself property.",
                    "label": 0
                },
                {
                    "sent": "Now I learned recently that is actually a simplification.",
                    "label": 0
                },
                {
                    "sent": "You don't have only common genes with yourself.",
                    "label": 0
                },
                {
                    "sent": "So, but otherwise it means that you always have a property to yourself that is called common genes.",
                    "label": 0
                },
                {
                    "sent": "Irreflexive means that you cannot have this property.",
                    "label": 0
                },
                {
                    "sent": "Pointing yourself child off would be an example from the reflexive property.",
                    "label": 0
                },
                {
                    "sent": "Finally, transitive.",
                    "label": 0
                },
                {
                    "sent": "I'm so anxious to office example transitive property, which means that a answer stuff B&B and sister of C. Also A is an stuff see, so this is just ways to further define properties in our.",
                    "label": 0
                },
                {
                    "sent": "Functional means that there can only be.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One so has matter is a functional property.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And in verse, gifted Inversive property parent, often child off by inverse properties.",
                    "label": 0
                },
                {
                    "sent": "Which means that if you have a parent then the parent has you as a child.",
                    "label": 0
                },
                {
                    "sent": "Inverse functional is a combination of those two, which means that you are.",
                    "label": 0
                },
                {
                    "sent": "The only wanted her to do the only entity passes but also invest functional father off means that everything that has a father can only have actually defined by its father.",
                    "label": 0
                },
                {
                    "sent": "So you can capture someone by the federal relationship and keys that are very similar to it.",
                    "label": 0
                },
                {
                    "sent": "You can have a number of properties that together define as a specific person.",
                    "label": 0
                },
                {
                    "sent": "For example, if you have a child off and birth order, then you know which person it is.",
                    "label": 0
                },
                {
                    "sent": "So you need to have both information.",
                    "label": 0
                },
                {
                    "sent": "Whose child is it Ant which birth already answered?",
                    "label": 0
                },
                {
                    "sent": "It can identify this person, so you have a key over those two properties.",
                    "label": 0
                },
                {
                    "sent": "Those things are.",
                    "label": 0
                },
                {
                    "sent": "Becoming sometimes they're not useful by themselves, so it really you wonder why you should define those things.",
                    "label": 0
                },
                {
                    "sent": "We should define keys and also, but as soon as we have two different datasets that have a lot of data that describe in very different ways.",
                    "label": 0
                },
                {
                    "sent": "It will help you a lot with actually aligning those datasets.",
                    "label": 0
                },
                {
                    "sent": "For example, if you have books and you define that the ISBN number is a key for those books and now we have two different datasets both defended at the ISBN number, you can easily find entities and those datasets that are actually the same entity because ISBN numbers are pretty good keys for books.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For individuals, you also have a few terms to define them, but not as rich As for properties and for classes.",
                    "label": 0
                },
                {
                    "sent": "You can say the two individuals are the same.",
                    "label": 0
                },
                {
                    "sent": "For example, says John and Jack are the same.",
                    "label": 0
                },
                {
                    "sent": "In my ontology you can suicide.",
                    "label": 0
                },
                {
                    "sent": "Two individuals are different from each other.",
                    "label": 0
                },
                {
                    "sent": "John and Sue, for example, would be two different persons amount aladji.",
                    "label": 0
                },
                {
                    "sent": "And finally you can make property assertions, which means that you can use all those properties that you have defined before and to connect the.",
                    "label": 0
                },
                {
                    "sent": "Individuals with each other so extent I can say joins the Father of Mary or I can also make negative assertions of new.",
                    "label": 0
                },
                {
                    "sent": "In our two I can say that Mary is not the matter of drawn.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is what we have in our part number of concepts you have all of them in your slides.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Doubt is so to look it up, but sure.",
                    "label": 0
                },
                {
                    "sent": "I would like it's actually quite misnamed.",
                    "label": 0
                },
                {
                    "sent": "It's not dead light as it sounds, so most of the things that we have seen are part of our light.",
                    "label": 0
                },
                {
                    "sent": "This doesn't hold true for the property things because most of the property things is actually only introducing our tour and our light is a term from the first hour, but our light does most of the things that we've seen here.",
                    "label": 0
                },
                {
                    "sent": "What does that say?",
                    "label": 0
                },
                {
                    "sent": "For example, the one off thing that has value thing is not their cardinality constraints with coordinates bigger than one actually not part of our light.",
                    "label": 0
                },
                {
                    "sent": "So different things like this are not part of our life, but um.",
                    "label": 0
                },
                {
                    "sent": "Really, most of the time you don't have to concern yourself with what our frequent urine is, it only if you have an implementation.",
                    "label": 0
                },
                {
                    "sent": "It really brings you more speed.",
                    "label": 0
                },
                {
                    "sent": "Because of that you should try to be concerned about that, but most of the cases.",
                    "label": 0
                },
                {
                    "sent": "It's not that big a difference.",
                    "label": 0
                },
                {
                    "sent": "How?",
                    "label": 0
                },
                {
                    "sent": "Most of the time it will just actually tell you that it doesn't support it, so you probably should run a cleaner or done things like that so, but it depends on the implementation.",
                    "label": 0
                },
                {
                    "sent": "It would be nice if implementations actually does that and gives you a warning instead, but the most implementations I've seen they actually just say, oh, I can't believe that it's not our life so, but actually I don't know a single reason that only does our light and doesn't do already also.",
                    "label": 0
                },
                {
                    "sent": "Most of them are actually running on our DL.",
                    "label": 0
                },
                {
                    "sent": "It's getting more interesting with the hour tool fragments because some of those fragments are actually defined in such a way that they can be easily implemented on top of databases for example, so they have.",
                    "label": 0
                },
                {
                    "sent": "Different constraints, but then you have to nice case you can just take a usual database like my SQL or Oracle and on top of that implementing our reasonable just basically ask well queries.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "And this case of our two, it will become again more interesting than knowing what fragment you are in our one.",
                    "label": 0
                },
                {
                    "sent": "It really didn't matter much this this was actually the difference between our light and our DL is an error.",
                    "label": 0
                },
                {
                    "sent": "It shouldn't have been away, it was.",
                    "label": 0
                },
                {
                    "sent": "But for our this is not true anymore for our two.",
                    "label": 0
                },
                {
                    "sent": "Where there.",
                    "label": 0
                },
                {
                    "sent": "Better, but fragments actually have a much better defined meaning and.",
                    "label": 0
                },
                {
                    "sent": "You know that, OK, you can if you use this one, you can use it for rule system.",
                    "label": 0
                },
                {
                    "sent": "If you use this one, it's competitive databases.",
                    "label": 0
                },
                {
                    "sent": "We use that one you really need to have an hour to reason affects update.",
                    "label": 0
                },
                {
                    "sent": "So there it becomes much more interesting what you actually using.",
                    "label": 0
                },
                {
                    "sent": "So take home again.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "It should not matter what syntax you're using.",
                    "label": 0
                },
                {
                    "sent": "The structure owl.",
                    "label": 0
                },
                {
                    "sent": "You can use RDF XML functional measures to contrast used tools.",
                    "label": 0
                },
                {
                    "sent": "It should not matter which tools you are using for describing your hour if you if you use Prodigy.",
                    "label": 0
                },
                {
                    "sent": "If you use neon if you use any other tool, all of them should be compatible to each other because they're using the standardized.",
                    "label": 0
                },
                {
                    "sent": "Semantics, they're using.",
                    "label": 0
                },
                {
                    "sent": "The standardized syntax is.",
                    "label": 0
                },
                {
                    "sent": "This is the one finger semantic web rings standards for your semantics, so you can express all those things that we have seen before and every other tool that uses the same standards were able to understand what you have sent them will be able to deal with that when you send them.",
                    "label": 0
                },
                {
                    "sent": "How obvious the systems that are more expressive than ours that are stronger than our that are maybe better suited for your for your use case and so on.",
                    "label": 0
                },
                {
                    "sent": "And maybe you should use them in for giving you a space, but if you want to be part of the semantic web.",
                    "label": 0
                },
                {
                    "sent": "But you should see a use finger.",
                    "label": 0
                },
                {
                    "sent": "This is such the same thing as I said before, with hypertext should have been a hypertext, it's more powerful than HTML.",
                    "label": 0
                },
                {
                    "sent": "Def in Hypertext Systems that can allow you much more than your browser does.",
                    "label": 0
                },
                {
                    "sent": "But you know, it's not a web, so if you want to play on the web, you have to play by the rules.",
                    "label": 0
                },
                {
                    "sent": "Study.",
                    "label": 0
                },
                {
                    "sent": "You say that you don't really expect people crashing, right?",
                    "label": 0
                },
                {
                    "sent": "Expect.",
                    "label": 0
                },
                {
                    "sent": "Yes, definitely.",
                    "label": 0
                },
                {
                    "sent": "Just don't expect people to write HTML.",
                    "label": 0
                },
                {
                    "sent": "There will be tools between that and that's the user interface application layer that will hide the complexity and this is a good question for the next part because semantic mean.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Arabic is exactly such a tool.",
                    "label": 0
                },
                {
                    "sent": "Semantic Mediawiki is based on the Mediawiki wiki engine and it allows to add information to the wiki that allows to export part of the knowledge in semantic web standards.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Who of you doesn't know?",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's ask the other way around because otherwise no one.",
                    "label": 0
                },
                {
                    "sent": "So who knows what the wiki is.",
                    "label": 0
                },
                {
                    "sent": "OK, great, well if you has used the wiki.",
                    "label": 0
                },
                {
                    "sent": "So the rest has been beyond Wikipedia, yet are OK.",
                    "label": 0
                },
                {
                    "sent": "So wikis are known to be great web to tools for collaboration.",
                    "label": 0
                },
                {
                    "sent": "Everyone can read and everyone can write them.",
                    "label": 0
                },
                {
                    "sent": "Everyone can edit.",
                    "label": 0
                },
                {
                    "sent": "It's like this, and everyone is accountable for everything because we have complete history of what's going on.",
                    "label": 0
                },
                {
                    "sent": "But still, you know some things are better left to machines.",
                    "label": 0
                },
                {
                    "sent": "Something shouldn't be really done for Wiki, so this is the example of the wiki Clock.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's a great wiki based Clock, so it's a cloud based on wiki technology.",
                    "label": 0
                },
                {
                    "sent": "Everyone can edit it.",
                    "label": 0
                },
                {
                    "sent": "You can just go there and enter and enter the current time and whenever you need it you can just look it up and see what's the time right now.",
                    "label": 0
                },
                {
                    "sent": "Well obviously a bad idea.",
                    "label": 0
                },
                {
                    "sent": "And most of the time it was pretty out of that.",
                    "label": 0
                },
                {
                    "sent": "Actually, most of the time it was just spammed to be honest.",
                    "label": 0
                },
                {
                    "sent": "So wiki clocks are a bad idea.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia, on the other hand, seems to be.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good idea so we can size.",
                    "label": 0
                },
                {
                    "sent": "Seems to be good to write and slow pedias.",
                    "label": 0
                },
                {
                    "sent": "Why is it a good idea for advisory good idea for an encyclopedia but a bad idea for Clock?",
                    "label": 0
                },
                {
                    "sent": "Well, because some things are left better, the machines and some are not writing interpedia seems something that machines are not yet that good at, but we learn about it more.",
                    "label": 1
                },
                {
                    "sent": "Today is in this direction.",
                    "label": 0
                },
                {
                    "sent": "So Wikipedia had to go, that is.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You will probably recognize universal access to all knowledge in this case, not just for a machine set, mostly for humans, so.",
                    "label": 0
                },
                {
                    "sent": "How well does it fare?",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Based on this question, Wikipedia's articles about all the cities of the world, it has information over to populations of those cities.",
                    "label": 0
                },
                {
                    "sent": "Anna mayors of those cities, great.",
                    "label": 0
                },
                {
                    "sent": "So can I go and just ask Wikipedia to give me a list of the world's 10 largest cities with her female mayor?",
                    "label": 0
                },
                {
                    "sent": "I mean, it has the information inside, so we should be able to do that, right?",
                    "label": 0
                },
                {
                    "sent": "Let's try it.",
                    "label": 0
                },
                {
                    "sent": "I go to Wikipedia search engine and type in the question.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What are the 10 largest cities or female mayor?",
                    "label": 0
                },
                {
                    "sent": "I make a search.",
                    "label": 0
                },
                {
                    "sent": "And I get back Manhattan, Chicago, Washington DC and St Louis, Mo.",
                    "label": 0
                },
                {
                    "sent": "Now the good news is they're all cities, which is always surprising.",
                    "label": 0
                },
                {
                    "sent": "The bad news is, none of them has a female mayor.",
                    "label": 0
                },
                {
                    "sent": "But it's unfair.",
                    "label": 0
                },
                {
                    "sent": "We're doing a full text search, so I can't really give you an answer to that.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia is usually answer to this problem.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Lists, so someone goes ahead creating your article and creates a list with the answer this question, so they would.",
                    "label": 1
                },
                {
                    "sent": "For example, someone created an list of the 10 biggest cities of human mayor.",
                    "label": 1
                },
                {
                    "sent": "Now it hasn't been done on Wikipedia yet.",
                    "label": 0
                },
                {
                    "sent": "But someone could do it, so we could just go ahead, collect information and write it, and then maintain information.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia as a whole bunch of those lists.",
                    "label": 0
                },
                {
                    "sent": "This is the list of countries by GDP.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About the nominal GDP is a country GDP per capita.",
                    "label": 0
                },
                {
                    "sent": "Apparitor",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Aperitive capita.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You have lists of.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Aster, it's named after people.",
                    "label": 0
                },
                {
                    "sent": "We have that on the English.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The pedia.",
                    "label": 0
                },
                {
                    "sent": "On the Norwegian Wikipedia, the Portuguese with.",
                    "label": 0
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The Korean Wikipedia all of.",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is this a non manually maintained manual?",
                    "label": 0
                }
            ]
        },
        "clip_85": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's the list of problems for me given my favorite list.",
                    "label": 0
                }
            ]
        },
        "clip_86": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "The Germans, being as organized as they are.",
                    "label": 0
                },
                {
                    "sent": "They have a list of list of list.",
                    "label": 0
                }
            ]
        },
        "clip_87": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what you see here?",
                    "label": 0
                },
                {
                    "sent": "As the list is, by the way hierarchical, it's a hierarchical list of lists and if in this list of lists, and in this list of list of lists we actually find the list of lists of mayors, so this is the list of list of mayors in.",
                    "label": 0
                }
            ]
        },
        "clip_88": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The German Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "So there are 86 lists of mayors and the German Wikipedia and we find, for example, the list of mayors of grants, the list of mayors of Arc, and a list of mayors of Boston of New York and so on.",
                    "label": 0
                },
                {
                    "sent": "But no list of female mayors, so the original answer, a question Gozan answered.",
                    "label": 0
                },
                {
                    "sent": "So we have to concede, Wikipedia doesn't have all the answers.",
                    "label": 0
                }
            ]
        },
        "clip_89": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "That's because computers are stupid.",
                    "label": 0
                }
            ]
        },
        "clip_90": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Computers don't make the connection between those articles.",
                    "label": 0
                },
                {
                    "sent": "They don't understand what's going on, but humans seem.",
                    "label": 0
                }
            ]
        },
        "clip_91": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Steph, we read an article District summary, article and culture.",
                    "label": 0
                },
                {
                    "sent": "So we read the article and we figure out OK. How soon as a population of 285?",
                    "label": 0
                }
            ]
        },
        "clip_92": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Located in Germany, it has a mayor France and it's because we can read the article.",
                    "label": 0
                },
                {
                    "sent": "But a computer we disease is something like this.",
                    "label": 0
                }
            ]
        },
        "clip_93": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "He doesn't understand anything.",
                    "label": 0
                },
                {
                    "sent": "He maybe figure out all this looks like a square, so this is maybe the the area because small looks like an area with square meters.",
                    "label": 0
                },
                {
                    "sent": "There's a number 285 thousand, but it doesn't understand anything.",
                    "label": 0
                },
                {
                    "sent": "Does anyone recognize the language?",
                    "label": 0
                },
                {
                    "sent": "No, it's not Iranian.",
                    "label": 0
                },
                {
                    "sent": "Is not Philippine.",
                    "label": 0
                },
                {
                    "sent": "No, it's not made up.",
                    "label": 0
                },
                {
                    "sent": "It's it's great, it's Georgian.",
                    "label": 0
                },
                {
                    "sent": "Wow, you're the first one in all the talks that affected my head.",
                    "label": 0
                },
                {
                    "sent": "That's Georgian.",
                    "label": 0
                },
                {
                    "sent": "So if you think about it does look like the Coca Cola logo.",
                    "label": 0
                },
                {
                    "sent": "Now I'm seriously, I'm so this is the language this is descriptor.",
                    "label": 0
                },
                {
                    "sent": "Using an former Soviet Republic Republic of Georgia.",
                    "label": 0
                },
                {
                    "sent": "And it actually looks quite pretty, but I'm using it.",
                    "label": 0
                },
                {
                    "sent": "It used to use Chinese here, but in my audience they usually Chinese people sitting and they understand that, so it doesn't really carry the point, but no one was ever able to read George.",
                    "label": 0
                },
                {
                    "sent": "And I were the first one who actually recognizes the script.",
                    "label": 0
                },
                {
                    "sent": "I would have been surprised, but not that many Georgians in the world, OK?",
                    "label": 0
                },
                {
                    "sent": "I'm so as I see we don't understand anything here we see, OK, there's a link to something that's called Germany.",
                    "label": 0
                },
                {
                    "sent": "There's a number 75, seven 1715, and so on.",
                    "label": 0
                }
            ]
        },
        "clip_94": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You don't really understand what's going on here.",
                    "label": 0
                },
                {
                    "sent": "That's because computers don't make connections.",
                    "label": 0
                }
            ]
        },
        "clip_95": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Computers need our help with those connections, and that's exactly what.",
                    "label": 0
                }
            ]
        },
        "clip_96": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Antique Mediawiki offers.",
                    "label": 0
                },
                {
                    "sent": "We offer a way to help the computer to make connect.",
                    "label": 0
                }
            ]
        },
        "clip_97": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In between the given article and a link to article so in Wikitext.",
                    "label": 0
                },
                {
                    "sent": "It would be a normal sentence.",
                    "label": 0
                },
                {
                    "sent": "Castle City in Germany in Germany, being in double square bracket means it's a link to the article name.",
                    "label": 0
                },
                {
                    "sent": "Germany non semantic Mediawiki.",
                    "label": 0
                },
                {
                    "sent": "We add the possibility to type that link.",
                    "label": 0
                },
                {
                    "sent": "So we say the connection with the customer in Germany is country.",
                    "label": 0
                },
                {
                    "sent": "Once we do that.",
                    "label": 0
                },
                {
                    "sent": "We take all this information and put it in a big table.",
                    "label": 0
                },
                {
                    "sent": "We say OK, the subject is the topic of the page.",
                    "label": 0
                },
                {
                    "sent": "The object is what we link to Germany in this case, and the property is a type of the link that we just entered.",
                    "label": 0
                },
                {
                    "sent": "So we get in this table Catholic country Germany.",
                    "label": 0
                },
                {
                    "sent": "You can go on take more information like Catherine Maya Hansen Rich and and then on the hand Spanish page would find information like height centers, gender, male.",
                    "label": 0
                },
                {
                    "sent": "Subject predicate object is the same.",
                    "label": 0
                },
                {
                    "sent": "Structure that we've seen for RDF.",
                    "label": 0
                },
                {
                    "sent": "This is no coincidence.",
                    "label": 0
                },
                {
                    "sent": "This is basically idea for PC here, so this is creating a graph out of the wiki articles connecting the wiki articles with type properties.",
                    "label": 0
                },
                {
                    "sent": "So we make the wiki being a proper part of semantic Web, it exports all this information that it has inside.",
                    "label": 0
                },
                {
                    "sent": "It can be also used inside the wiki.",
                    "label": 0
                }
            ]
        },
        "clip_98": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can query the wiki so an example to for the previous question we ask for everything that's in Category City.",
                    "label": 0
                },
                {
                    "sent": "That has a mayor whose gender is female.",
                    "label": 0
                },
                {
                    "sent": "And we want this list to be sorted by population.",
                    "label": 0
                },
                {
                    "sent": "So now this would give us the biggest cities in the wiki with a female mayor.",
                    "label": 0
                },
                {
                    "sent": "I can't run this query against Wikipedia because Wikipedia is not yet semantic, so I don't actually know the answer to this question.",
                    "label": 0
                },
                {
                    "sent": "There are a number of.",
                    "label": 0
                }
            ]
        },
        "clip_99": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mediawiki is already up and running and decide exam for such Aquarius.",
                    "label": 0
                },
                {
                    "sent": "So this is querying all the countries of.",
                    "label": 0
                },
                {
                    "sent": "America with the population, you can have this as a table.",
                    "label": 0
                },
                {
                    "sent": "You can have this nice.",
                    "label": 0
                }
            ]
        },
        "clip_100": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rendered as a pie chart or some bar chart and this information is taken.",
                    "label": 0
                }
            ]
        },
        "clip_101": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Driving out of the wiki.",
                    "label": 0
                },
                {
                    "sent": "So as soon as someone changes the population of the USA of Mexico, the charts would be adjusted on them automatically.",
                    "label": 0
                },
                {
                    "sent": "This is a.",
                    "label": 0
                }
            ]
        },
        "clip_102": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A list of all the Oscar winners.",
                    "label": 0
                },
                {
                    "sent": "And the movies.",
                    "label": 0
                },
                {
                    "sent": "I have put on a timeline by the date of birth, so this is actually data that is taken from DB pedia put into a semantic Mediawiki and then compare it again.",
                    "label": 0
                },
                {
                    "sent": "OK, so we can have those nice visualizations from overtime.",
                    "label": 0
                }
            ]
        },
        "clip_103": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is also very nice visualizations actually on the when is City wiki which is using Semantic Mediawiki in the Venice City Wiki, they have annotated all the restaurants or the bakeries or the museums in downtown death annotated the Geo location when they are open and so on.",
                    "label": 0
                },
                {
                    "sent": "And this is actually the query.",
                    "label": 0
                },
                {
                    "sent": "Give me all the bakeries, so that's still open at 4:00 AM in the morning, and when it's downtown and it's based on a map and you can just see upgrade, the next one starts around the corner if you have.",
                    "label": 0
                },
                {
                    "sent": "By formation checking it out.",
                    "label": 0
                },
                {
                    "sent": "Creative Commons is used.",
                    "label": 0
                }
            ]
        },
        "clip_104": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Bing Semantic Mediawiki for their task management.",
                    "label": 1
                },
                {
                    "sent": "So they have written number of extensions to allow them to be informed when a task being done when task has certain conditions.",
                    "label": 0
                },
                {
                    "sent": "When those conditions are preferred and so on.",
                    "label": 0
                },
                {
                    "sent": "This is 1 example.",
                    "label": 0
                }
            ]
        },
        "clip_105": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From about doing active by representing process within within the wiki.",
                    "label": 0
                },
                {
                    "sent": "So all this process steps are described within the wiki, it says OK for this process step we need a tester, then after that we have a step that can be wrong or false cost another process step and so on.",
                    "label": 0
                },
                {
                    "sent": "And this is again just a query based on the Knowledge Insider Wiki.",
                    "label": 0
                },
                {
                    "sent": "So all this information is machine readable.",
                    "label": 0
                },
                {
                    "sent": "There can be accessed.",
                    "label": 0
                },
                {
                    "sent": "Um, this is a.",
                    "label": 0
                }
            ]
        },
        "clip_106": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Example of our internationalization effort.",
                    "label": 0
                },
                {
                    "sent": "There are more than 40 languages being supported by Semantic Mediawiki panel.",
                    "label": 0
                },
                {
                    "sent": "Also right to left languages like Hebrew and what you see here is does anyone read Hebrew?",
                    "label": 0
                },
                {
                    "sent": "So what you see here is a wiki about hiking trails in Israel, so you can say OK, I'm in Tel Aviv.",
                    "label": 0
                },
                {
                    "sent": "I have three hours of time.",
                    "label": 0
                },
                {
                    "sent": "I want an easy hike.",
                    "label": 0
                },
                {
                    "sent": "What's close by?",
                    "label": 0
                },
                {
                    "sent": "Where does it start?",
                    "label": 0
                },
                {
                    "sent": "How long does it take me?",
                    "label": 0
                },
                {
                    "sent": "And so on so you can get this information out of this weekend.",
                    "label": 0
                },
                {
                    "sent": "This is the Yu-gi-oh.",
                    "label": 0
                }
            ]
        },
        "clip_107": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Semantic mediawiki.",
                    "label": 0
                },
                {
                    "sent": "It's about the yugioh trading card game, and it shows that even kids can use the system.",
                    "label": 0
                },
                {
                    "sent": "It's that easy.",
                    "label": 0
                },
                {
                    "sent": "This is chickipedia.",
                    "label": 0
                },
                {
                    "sent": "I'm not saying too much of it, it's just.",
                    "label": 0
                }
            ]
        },
        "clip_108": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Google it.",
                    "label": 0
                },
                {
                    "sent": "Wiki tablet is.",
                    "label": 0
                }
            ]
        },
        "clip_109": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A very nice example.",
                    "label": 0
                },
                {
                    "sent": "It's done by a French group, but who else?",
                    "label": 0
                },
                {
                    "sent": "It says we care about recipes, so you can say I have oranges.",
                    "label": 0
                },
                {
                    "sent": "I want a pie.",
                    "label": 0
                },
                {
                    "sent": "And then it will look for all the recipes that have oranges inside and it can make you a pie out of it.",
                    "label": 0
                },
                {
                    "sent": "Now the interesting thing is that you can also say.",
                    "label": 0
                },
                {
                    "sent": "But oh wait, I don't have this ingredient or I'm allergic to.",
                    "label": 0
                }
            ]
        },
        "clip_110": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ingredients and this is an example of such a recipe, and when you do that and it doesn't have.",
                    "label": 0
                }
            ]
        },
        "clip_111": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Fitting.",
                    "label": 0
                },
                {
                    "sent": "Recipe directly, it has a case based reasoning system in the back end that actually looks for substitutions that are defined inside the wicked way.",
                    "label": 0
                },
                {
                    "sent": "It says OK.",
                    "label": 0
                }
            ]
        },
        "clip_112": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Institute disk kind of food with that ingredient and then it offers you an alternative recipe to add to the one that's already there, replacing some of the ingredients and then in the end it ask you after you cook that food.",
                    "label": 0
                }
            ]
        },
        "clip_113": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I like that or I didn't like that.",
                    "label": 0
                },
                {
                    "sent": "And remember, if you like it or not and the next time it makes some substitution, it will tend to things that I like, but people and will not show again examples of people edit others didn't like.",
                    "label": 0
                },
                {
                    "sent": "So it's connecting the semantic Mediawiki on the one side to capture the recipes in a formalized way with the CBR system to do more stuff in it.",
                    "label": 0
                },
                {
                    "sent": "And this is a nice pattern that we hope to achieve more often with Semantic Mediawiki, since the information is machine readable, machine understandable.",
                    "label": 0
                },
                {
                    "sent": "We can directly use the information that is added to the wiki in a Raptor or way by machines.",
                    "label": 0
                },
                {
                    "sent": "Do more of it.",
                    "label": 0
                },
                {
                    "sent": "Tablet has entered the computer.",
                    "label": 0
                }
            ]
        },
        "clip_114": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cooking contest this year didn't notice thing exists and it has.",
                    "label": 0
                },
                {
                    "sent": "It's become one of the finalists actually.",
                    "label": 0
                },
                {
                    "sent": "Don't know if they won.",
                    "label": 0
                },
                {
                    "sent": "We tried to figure out because it was in and out of July, but the website didn't update and no ones answering my email from team so.",
                    "label": 0
                },
                {
                    "sent": "I guess he didn't win, otherwise he would know.",
                    "label": 0
                },
                {
                    "sent": "Who knows?",
                    "label": 0
                },
                {
                    "sent": "I would really like to know if they actually want or not.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So this is one thing that I wanted to point out for big tablet.",
                    "label": 0
                }
            ]
        },
        "clip_115": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can take the information out of the wiki and reuse it externally.",
                    "label": 0
                },
                {
                    "sent": "There are number of export farmers starting with RDF XML, but you can also have sparkle on that.",
                    "label": 0
                },
                {
                    "sent": "You can have a DFA.",
                    "label": 0
                },
                {
                    "sent": "We have Jason export so you don't have to use all those heavyweight Semantic Web toolkit.",
                    "label": 0
                },
                {
                    "sent": "You can just use the usual Jason thing with iCal, export vCard, Bibtex, whatever.",
                    "label": 0
                },
                {
                    "sent": "You mean there are APIs for accessing RDF and basically every programming language in the world.",
                    "label": 0
                },
                {
                    "sent": "And it's all based on standards for the communicator information.",
                    "label": 0
                },
                {
                    "sent": "As we have seen in the first part of this talk.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_116": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is just one example of a knowledge based computer program and giving you the complete program.",
                    "label": 0
                },
                {
                    "sent": "So this is Python.",
                    "label": 0
                },
                {
                    "sent": "I hope you will still be able to read it if you even if you don't speak perfect.",
                    "label": 0
                },
                {
                    "sent": "OK, so we're first importing a semantic Mediawiki library and then we're loading a wiki, reloading the active project, Semantic Mediawiki, and from this one I'm law allowing the pool entities.",
                    "label": 0
                },
                {
                    "sent": "So I'm just loading Paul Warren into my system.",
                    "label": 0
                },
                {
                    "sent": "And now I have a variable about Paul and I can just print out pause affiliation.",
                    "label": 0
                },
                {
                    "sent": "So this is the complete program.",
                    "label": 0
                },
                {
                    "sent": "This is based on the knowledge is entered into the wiki and it will print you out.",
                    "label": 0
                },
                {
                    "sent": "Affiliation of Paul not money than that.",
                    "label": 0
                },
                {
                    "sent": "Um assistant.",
                    "label": 0
                }
            ]
        },
        "clip_117": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually using such a Python script is SN pedia or snip pedia.",
                    "label": 0
                },
                {
                    "sent": "An snip is a path of the human genome or action of any genome that defines a specific feature.",
                    "label": 0
                },
                {
                    "sent": "So if you have you snip being present in your DNA, you will have that feature.",
                    "label": 0
                },
                {
                    "sent": "If you don't have to snap, you probably won't have that feature.",
                    "label": 0
                },
                {
                    "sent": "Actually doesn't say anything about it.",
                    "label": 0
                },
                {
                    "sent": "So here list of such as Snips.",
                    "label": 0
                },
                {
                    "sent": "So the first step defines if your sprinter on enduro or enduring the fleet.",
                    "label": 0
                },
                {
                    "sent": "There's a snipped.",
                    "label": 0
                },
                {
                    "sent": "It actually says that you are resistant to HIV.",
                    "label": 0
                },
                {
                    "sent": "There's a slip that prevents baldness, several slips for the eye color and so on and so on.",
                    "label": 0
                },
                {
                    "sent": "So those snips.",
                    "label": 0
                },
                {
                    "sent": "It's the stuff that genome research try to figure out, because, well, that's the one thing that helps them with understanding the Na and those nips then have been put into sleep Pedia wiki.",
                    "label": 0
                },
                {
                    "sent": "It has a list of snaps.",
                    "label": 0
                }
            ]
        },
        "clip_118": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Has lots of features connecting with them.",
                    "label": 0
                },
                {
                    "sent": "It says in which publication was this link between the slip and his features Tab Lish so that you can say I'm only interested in things that have been published in nature.",
                    "label": 0
                },
                {
                    "sent": "I'm only interested in things that have been published on any workshop.",
                    "label": 0
                },
                {
                    "sent": "It's OK.",
                    "label": 0
                },
                {
                    "sent": "I want to know I have it or want to have it all.",
                    "label": 0
                },
                {
                    "sent": "And then there is a set of Python scripts that actually take information out of sleep pedia.",
                    "label": 0
                },
                {
                    "sent": "And once you have your DNA in machine readable form for example, there are number of companies in the US that we can send in spit where you can send in the money and you get back a DVD with your DNA in digital form and then you can go to a site like Slip pedia, take the slips there and try to find the snips inside your DNA and figure out what the snips tell you about yourself.",
                    "label": 0
                },
                {
                    "sent": "Um, does this work so the startup company 23 andme that offers such a service of giving you a DVD if your DNA has made.",
                    "label": 0
                },
                {
                    "sent": "Has made a competition we have published.",
                    "label": 0
                },
                {
                    "sent": "Anonymous persons DNA and they told the figure out as much as you can about this person and there will be three categories and we will give prices to all the people who figure out as much as they can about it.",
                    "label": 0
                },
                {
                    "sent": "And the PDS ended the challenge.",
                    "label": 0
                },
                {
                    "sent": "And I figured out that the person is a female Caucasian with dark hair, blue eyes that she's modern, average intelligent, that she has a tendency towards dyslexia and alcoholism that there are certain under perceive it.",
                    "label": 0
                },
                {
                    "sent": "It won't work on here other city will work stronger and so on so on.",
                    "label": 0
                },
                {
                    "sent": "So they cut a whole list.",
                    "label": 0
                },
                {
                    "sent": "Stuff is kind of scary about this person.",
                    "label": 0
                },
                {
                    "sent": "And due to the fact that they have been most correctly actually wanting all the free categories based on information inside the collectively edited wiki.",
                    "label": 0
                },
                {
                    "sent": "So I'm still.",
                    "label": 0
                },
                {
                    "sent": "Pedia has won a challenge.",
                    "label": 0
                },
                {
                    "sent": "It has been.",
                    "label": 0
                }
            ]
        },
        "clip_119": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "By now, by nature, by science have been numbers of papers around it, and it's all based on the same technology.",
                    "label": 0
                },
                {
                    "sent": "That representing here and that you can download and use as well for your.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                }
            ]
        },
        "clip_120": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's fine, I wonder last night so.",
                    "label": 0
                },
                {
                    "sent": "Sure.",
                    "label": 0
                },
                {
                    "sent": "This was in this bracket syntax.",
                    "label": 0
                },
                {
                    "sent": "This is 1 example how you can do it.",
                    "label": 0
                },
                {
                    "sent": "So you say OK, we're linking to something like in.",
                    "label": 0
                },
                {
                    "sent": "In this example, we prob.",
                    "label": 0
                }
            ]
        },
        "clip_121": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would say that this snip here links to specific feature, so we would link to the feature just like in normal Vicky double brackets, but it will also say that the type of this link is.",
                    "label": 0
                },
                {
                    "sent": "Has this feature or that you can introduce any type you want?",
                    "label": 0
                },
                {
                    "sent": "At this point, it's a weekend, and so we can just create new properties.",
                    "label": 0
                },
                {
                    "sent": "If you want to, but it's usually more clear to use property that already there.",
                    "label": 0
                },
                {
                    "sent": "So in the Castle example, we've seen that we have connected Castle with Germany.",
                    "label": 0
                },
                {
                    "sent": "Is the country property for example.",
                    "label": 0
                },
                {
                    "sent": "So this is saying customer has country Germany.",
                    "label": 0
                },
                {
                    "sent": "But I said you can introduce new properties anytime you like.",
                    "label": 0
                },
                {
                    "sent": "If the syntax actually you don't have to use the syntax, there are ways to just use forms.",
                    "label": 0
                },
                {
                    "sent": "For example, there's an extension on top of Semantic Mediawiki that allows you to have completely form based editing of the system so that people don't have to see the syntax at all.",
                    "label": 0
                },
                {
                    "sent": "They just add enter the information forms, which makes sense if you know in advance what kind of information you want to have, for example.",
                    "label": 0
                },
                {
                    "sent": "OK. My questions yet.",
                    "label": 0
                },
                {
                    "sent": "Closest.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "So the question is, what about things like probability?",
                    "label": 0
                },
                {
                    "sent": "What about things like accuracy, reliability, fuzziness, Ann and Ann in the semantic web.",
                    "label": 0
                },
                {
                    "sent": "So basically the standards disregards that completely.",
                    "label": 0
                },
                {
                    "sent": "But on the other hand, you can use RDF as well to represent this kind of information, and then you need some way to actually agree on So what we need at this number or this number of research actually going on in probabilistic howlan fuzziness in the semantic reference on what would be needed in the end is again a standard to define Franzi terms, defined probabilities or whatever.",
                    "label": 0
                },
                {
                    "sent": "It doesn't exist yet.",
                    "label": 0
                },
                {
                    "sent": "But it can be built on top of RDF obviously, but just because it can build doesn't mean that you can just go ahead and use it.",
                    "label": 0
                },
                {
                    "sent": "Standard is still missing in this area.",
                    "label": 0
                },
                {
                    "sent": "Actually, I'm not seeing.",
                    "label": 0
                },
                {
                    "sent": "Any Brooke?",
                    "label": 0
                },
                {
                    "sent": "Being done in standard US, standardizing it right now, but I hope this will change.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So to summarize, some up about semantic media.",
                    "label": 0
                }
            ]
        },
        "clip_122": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's an extension of the Mediawiki engine that's quite popular for wikis, and it's for example used on Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "And it extends Mediawiki, pineapple and by neighboring Tipling Spain.",
                    "label": 0
                },
                {
                    "sent": "Properties and values on on properties you get those queries that you can ask Insider wiki.",
                    "label": 0
                },
                {
                    "sent": "You get information out of the wiki.",
                    "label": 0
                },
                {
                    "sent": "You can use it outside of the wiki.",
                    "label": 0
                },
                {
                    "sent": "The whole system is open source, freely available.",
                    "label": 0
                },
                {
                    "sent": "You can just go ahead and download it.",
                    "label": 0
                },
                {
                    "sent": "Stephen active user community around it.",
                    "label": 1
                },
                {
                    "sent": "It's pretty well documented and as I reset there more than 40 languages.",
                    "label": 1
                },
                {
                    "sent": "Supporting semantic media.",
                    "label": 0
                },
                {
                    "sent": "Air supporting Semantic Mediawiki their modern 12 extensions already written on top of Semantic Mediawiki, extending it with more formats to display.",
                    "label": 0
                },
                {
                    "sent": "Extending it with more exports, and so on.",
                    "label": 0
                },
                {
                    "sent": "Several 100 installations using the system.",
                    "label": 0
                },
                {
                    "sent": "I saw a number of those examples I could go on for hours with those examples.",
                    "label": 0
                },
                {
                    "sent": "Summarizing this complete.",
                    "label": 0
                }
            ]
        },
        "clip_123": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Mark Semantic Web is really a set of standards.",
                    "label": 1
                },
                {
                    "sent": "It's nothing magical about is there is no.",
                    "label": 1
                },
                {
                    "sent": "It won't understand text because of the semantic web.",
                    "label": 0
                },
                {
                    "sent": "Just standard to express formal semantics to exchange from a semantics and to make tools into operate on that.",
                    "label": 1
                },
                {
                    "sent": "You have your eyes for identifying things.",
                    "label": 0
                },
                {
                    "sent": "You've IDF.",
                    "label": 0
                },
                {
                    "sent": "Describe graphs, refiled escape, ontologies.",
                    "label": 1
                },
                {
                    "sent": "That's basically it is no more magic in that semantic.",
                    "label": 1
                },
                {
                    "sent": "Mediawiki is a tool that uses those standards and it allows for the soft introduction to semantics.",
                    "label": 0
                },
                {
                    "sent": "We've seen Mickey Stack uwyo.",
                    "label": 0
                },
                {
                    "sent": "There's an Indian guru who uses Semantic Mediawiki too.",
                    "label": 0
                },
                {
                    "sent": "Organize his holy text so he says this takes our if you have sent in this area this text if you want to pray for he could help with some things is completely inside to so many in in Semantic Mediawiki this doesn't mean that those people who are using you go how using chickipedia know anything about RDF or owl know anything about description logics.",
                    "label": 0
                },
                {
                    "sent": "It's just the the using the system they're using it with.",
                    "label": 0
                },
                {
                    "sent": "Again, they're using your benefit because it helps them organizing the information.",
                    "label": 0
                },
                {
                    "sent": "That's exactly where we want to come true.",
                    "label": 0
                },
                {
                    "sent": "We want to make those standards.",
                    "label": 0
                },
                {
                    "sent": "An easy to use and actually helpful and beneficial for everyone.",
                    "label": 0
                },
                {
                    "sent": "OK, so thanks for your.",
                    "label": 0
                }
            ]
        },
        "clip_124": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Lots of it.",
                    "label": 0
                },
                {
                    "sent": "Thanks for your attention.",
                    "label": 0
                },
                {
                    "sent": "Sorry, I'm not native English speaker.",
                    "label": 0
                },
                {
                    "sent": "Thanks for attention and do you have any questions before we can go to the coffee break?",
                    "label": 0
                },
                {
                    "sent": "So if I confused you enough, OK, that's a question.",
                    "label": 0
                },
                {
                    "sent": "Questions, so there's a number of such search engines that are specifically built on top of the semantic web.",
                    "label": 0
                },
                {
                    "sent": "There is Falcon S by group in Shanghai.",
                    "label": 0
                },
                {
                    "sent": "This cindychair.com that's done by Dairygold.",
                    "label": 0
                },
                {
                    "sent": "Wait, it's pretty.",
                    "label": 0
                },
                {
                    "sent": "It's pretty comprehensive with regards to so many great data.",
                    "label": 0
                },
                {
                    "sent": "There's Watson by the Open University there's swoogle done by the group around time finding at the University of Maryland you want to add.",
                    "label": 0
                },
                {
                    "sent": "Up OK. That's true, that's true.",
                    "label": 0
                },
                {
                    "sent": "I think that I should just collect semantic web data to just pull RDF from all the sources added.",
                    "label": 0
                },
                {
                    "sent": "Just put together to really answer questions.",
                    "label": 0
                },
                {
                    "sent": "On top of that, I actually know only of 1 system that's done by the University of Cats were sorry Katie.",
                    "label": 0
                },
                {
                    "sent": "There they have they're putting together.",
                    "label": 0
                },
                {
                    "sent": "Web semantic web corpus, and then they're trying to match keyword queries to make a structured queries out of that and then answer your question so you can, for example, type in.",
                    "label": 0
                },
                {
                    "sent": "AIP members ICE WC 2008 and will try to create us, so it's not really natural language that it's going to be answered here, but it's but it's using keyword queries, translating them to structured queries basically sparkle queries and then executing them on the semantic web corpus.",
                    "label": 0
                },
                {
                    "sent": "That is there which has been collected before that summarize.",
                    "label": 0
                },
                {
                    "sent": "Before that, there's actually there's also.",
                    "label": 0
                },
                {
                    "sent": "So there are number of question answering systems that have popped up in the last time, and some of them are using.",
                    "label": 0
                },
                {
                    "sent": "A little bit of semantic web data, for example, the true knowledge system is actually using Freebase, which is also available in RDF, so this is a kind of a stretch to really say it's using the semantic web through knowledge is basically a natural language answering natural language question answering system, but you can just type in a question and it tries to answer that, but I said it's kind of a stretch to say today using the semantic Web ready because they're actually just using Freebase, which also has similar web export Bing is.",
                    "label": 0
                },
                {
                    "sent": "Also using Freebase and but it doesn't have the natural language, it's just trying to enhance it.",
                    "label": 0
                },
                {
                    "sent": "There's the search monkey project which is also not using natural language questions again, but it's enhancing display of query results inside of the Yahoo question.",
                    "label": 0
                },
                {
                    "sent": "So actually started taking RDF data that is connected with your web resources and they are enriching the snipers with this data.",
                    "label": 0
                },
                {
                    "sent": "For example giving you the review of a hotel or.",
                    "label": 0
                },
                {
                    "sent": "Movie Google has started something similar with.",
                    "label": 0
                },
                {
                    "sent": "Specific data sources around reviews and.",
                    "label": 0
                },
                {
                    "sent": "Persons so they take.",
                    "label": 0
                },
                {
                    "sent": "Stated it's describing a person, for example, from LinkedIn and displaying it in a rich snippet.",
                    "label": 0
                },
                {
                    "sent": "So this is enhancing keyword query results through knowledge.",
                    "label": 0
                },
                {
                    "sent": "Probably the closest to natural language would add something.",
                    "label": 0
                },
                {
                    "sent": "Show me something great.",
                    "label": 0
                },
                {
                    "sent": "And so it is not.",
                    "label": 0
                },
                {
                    "sent": "We do need an order.",
                    "label": 0
                },
                {
                    "sent": "OK. Not yet at 0 cost.",
                    "label": 0
                },
                {
                    "sent": "OK, great, so we see even more in the next talk.",
                    "label": 0
                },
                {
                    "sent": "OK, one more question.",
                    "label": 0
                },
                {
                    "sent": "So what from Alpha isn't using any semantic web data as of now, they said they would be using somebody.",
                    "label": 0
                },
                {
                    "sent": "The differences is Wolfram Alpha is using a highly curated knowledge base and I think they are shunning away from using just some data from the web.",
                    "label": 0
                },
                {
                    "sent": "So maybe one day just getting so I really don't know anything about the back end.",
                    "label": 0
                },
                {
                    "sent": "Actually I think some other people are more knowledgeable about what's going on in.",
                    "label": 0
                },
                {
                    "sent": "But from our find out here, so you probably should direct this question maybe 2.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I would agree because there kind of data is kind of different local final semantic web.",
                    "label": 0
                },
                {
                    "sent": "OK, my time so well.",
                    "label": 0
                }
            ]
        }
    }
}