{
    "id": "e7n5pqvlaa3e57dsbzrovkrrdtm23y57",
    "title": "Chaudron: Extending DBpedia with measurements",
    "info": {
        "author": [
            "Julien Subercaze, University Jean Monnet, St Etienne"
        ],
        "published": "July 10, 2017",
        "recorded": "May 2017",
        "category": [
            "Top->Computer Science->Big Data",
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2017_subercaze_chaudron/",
    "segmentation": [
        [
            "Hello everybody, so my name is Jennifer because I'm associate professor in the University of South Beach in the laboratory bacteria and today I will present.",
            "You should on paper but extending the PDR with measurement."
        ],
        [
            "So what I'm going to talk about today is first, what's measurement, how it's done in DDR?",
            "What are the issues we're trying to solve in this paper?",
            "The second part is how these issues are solved, or the ideas behind this solution, and then short description of the data set and finally conclude on the future work as usual so."
        ],
        [
            "First, what measurement?",
            "What we're going to talk about in this paper is measurement is a.",
            "Is the assignment of a number to a characteristic of an object or event last?",
            "Wikipedia says basically what is it is, for instance, you measure something you want to wait an object, then some measurement your.",
            "I don't know 1 meter 80 tool you wait that much kilo, that's measurement.",
            "And here this is the topic of this project.",
            "Is the extraction of measurement and how to extend the deal with that.",
            "So."
        ],
        [
            "So first, how it works.",
            "Basing on DBPR out extracts and some issues we encountered and the motivation of this project so."
        ],
        [
            "1st, for those who don't know, oh, it's worked in Wikipedia.",
            "Wikipedia as something called infoboxes.",
            "This are these like small part that summarize an article in Wikipedia.",
            "An as usual in Wikipedia, the text as a source code, which is called the wiki markup and which is the way.",
            "It's like programming language.",
            "In fact, that's where you define don't have mouse or there here.",
            "OK, let's say for instance for what interesting for us the measurement.",
            "Let's say you have this info box that starts here with the double braces, and then you have some properties that are assigned to a value.",
            "Here you have the damn links that you will.",
            "So here it's like three 3800 centimeters and you find it here converted in HTML.",
            "That's what you see when you open the page.",
            "So how it's done this magic?",
            "It's going to Mediawiki framework that provides Wikipedia and it transforms this wiki markup using also several languages, templates and sounds quite quite complete.",
            "Complex beast.",
            "And then in the end you get some HTML that used in your web page."
        ],
        [
            "So how it's done in DB PEDIA and EVP of something called the DBPR extraction framework that converts the same sources?",
            "This wiki markup into RDF how it's done.",
            "It's not using the Mediawiki angina, its own, enjoying this cold extraction framework an the template to transform the data from this wiki markup to the two RDF was done in scholar to be technical.",
            "But it's the same idea that we extract data from here to structure them into RDF.",
            "OK, that's how it works.",
            "So here just the view.",
            "If you open the Aswan Dam you will see more things than just restricted to the measurement value because it's what's of interest here."
        ],
        [
            "So now start with the problems that you encounter dealing with measurement in DB pedia for instance.",
            "Take this as one dumb as an example.",
            "You have some measurement to see hate ANX.",
            "And your generation about chubbins that you found in both places say.",
            "In Wikipedia and in DB pedia.",
            "But as you see, there's lots of measurements missing here.",
            "OK, that data that could have been in a database that are not in the database, so.",
            "How come is that I said previously DPD works with template extraction.",
            "This template are manually written by the DPL source, and I mean it's quite status.",
            "Walken Infoboxes are complex and I guess it's hard to have 100% cover of the templates and that's why you have missing values in DP."
        ],
        [
            "So sometimes it gets bit more complicated.",
            "For instance, you take all the chemical elements in Wikipedia.",
            "You will find modest, in fact on measurement.",
            "Nothing in the pedia.",
            "It's completely missing.",
            "Why is it completely missing?",
            "It's because of the way data is transformed.",
            "I'll go to a web browser, see how it works so.",
            "Fun, OK, that's the Wikipedia webpage on medium.",
            "So as you see, there's quite a lot of measurement.",
            "Boiling point, the heat of Fusion lots.",
            "Lots of things that we expect to find in DPS that are not here.",
            "What's not here?",
            "Let's check the source of the aluminium.",
            "How it works.",
            "In fact, the infobox is, why is it?",
            "Here.",
            "So it's different from the one we've seen before.",
            "Before we have seen Infoblox and then some key and values associated, and here just infobox.",
            "Aluminium knows.",
            "No values in here, so in fact where the data question it's somewhere and in fact.",
            "It's in a page code.",
            "Don't plate infobox aluminium.",
            "That defines just the box.",
            "OK, let's welcome to Wikipedia.",
            "Here is the data, so that means you have one page that includes one page that includes another one.",
            "And that DVD is not able to enter that.",
            "It's not made for, and that's that's why the information is missing.",
            "OK, back to the presentation.",
            "So here yeah, lots of data missing's typical from the chemical elements and also what's related to drugs, chemistry and so on.",
            "No, quite lot of missing data."
        ],
        [
            "So there was a problem.",
            "There was a problem like sometimes we are like missing units.",
            "Let's go back to the Aswan Dam's.",
            "OK, this Aswan Dam is a annual generation of.",
            "10,042.",
            "What you do what?",
            "Now if I start what is giga Watt power?",
            "So that's what we expected, but there's nothing so.",
            "Without unit measurement is nothing.",
            "You cannot work something out if you don't have the units, so you absolutely need that.",
            "It's mandatory, so that means here.",
            "I mean, if we have nothing, it's more less the same.",
            "We cannot use it for anything.",
            "So that's missing units.",
            "Second problem we have."
        ],
        [
            "Annoying, sometimes we have like I don't know some inquiry runs or missing units.",
            "You don't know.",
            "You know that, for instance.",
            "General Macy's 1 meter 70 centimeter high.",
            "You see that in two versions.",
            "DVD of the person, hate property and the hate.",
            "Here this one as arrange a centimeter and the correct label.",
            "But here the label is.",
            "I don't know strange.",
            "An that is, the range is just double, so here we don't know what it is.",
            "OK so when you have two information like this, which ones should you trust?",
            "So that's also a problem.",
            "So here this."
        ],
        [
            "I guess you get the motivation of the project so.",
            "Why I'm trying to solve this problem is I have missing units missing from the data types we are missing measurement and sometimes we have some inquiry.",
            "Once in the data so."
        ],
        [
            "How to do it?",
            "So the idea was to go back from the source we extract from Wikipedia using another technique to get more precision or maybe more.",
            "Recall on the data."
        ],
        [
            "So.",
            "How can we do that?",
            "So for the measurements that are missing, we must find a new way to extract.",
            "I don't want to manually write the templates for everything if I'm too lazy, sorry.",
            "Manual template, so I don't want to do that, so I want it to be automatical.",
            "The more the must automatically as possible, and some data are incoherent in the description of the ontology.",
            "That's I would say maybe something like internal description.",
            "I don't want to deal with that and.",
            "Try to find a solution.",
            "And for what's missing complete measurement, we've seen it's the problem of inclusion of inclusion of inclusion.",
            "So the DBPR Mediawiki framework is like PHP, you a lot of languages very complex, so you don't want to implement that in like, Java, Scala, whatever the language the best is in fact to use directly was generated as the output.",
            "So the idea is to work with the HTML.",
            "As input instead of the wiki markup so it's bit more slower, but in fact you extract once, then you get the data.",
            "Doesn't mind if it takes 2 hours or three days in the data is here and job is done, so that's what the the idea of a."
        ],
        [
            "Also using HTML when possible.",
            "So.",
            "How to extract the measurement measurement so as I said a structured in infobox jaza about the current article it as a property an.",
            "Value for get a unit so.",
            "Fact seems quite simple to extract.",
            "OK, just look for everything like pattern matching number and unit OK, say 1000 meters.",
            "The kilogram OK look simple, but it's not enough to deal with complex units.",
            "When you have something like gram per square centimeters about cubic centimeter, then.",
            "It's not only one unit, so combination of unit, so we need something.",
            "An approach that is more robust that only pattern matching.",
            "So the idea of the solution."
        ],
        [
            "Is to go over all the info boxes, that's for sure.",
            "An first to try the pattern matching number and a list of units.",
            "OK, an when with this solution you can extract simple things like meters for example, that fits in the list of units.",
            "But this solution doesn't work for like Grandpa or more or grandparent cubic centimeter and so on.",
            "So here the idea is to use a formal grammar, so I will talk more in detail later about that.",
            "That's the outline of the solution.",
            "So let's start with the first one with the pattern matching one."
        ],
        [
            "Is we need a list of unit.",
            "To do that we cannot check everything.",
            "I mean it has to be valid so it has to be units.",
            "So first, how it works units.",
            "Most of the.",
            "The world uses metric and international system of units, but the US and Commonwealth and in the UK have a so Imperial in US.",
            "Customer is so like bits of yeah.",
            "Different units that are slowly, slowly, slowly being metric aged in different countries at different speeds.",
            "Plus we find also customary and strange units were called strange units is like for instance, know if you're familiar with installing servers, but when you buy a several shelf, then it's measured in U when U for you and when you is some height of a server and that's unit will find some info box.",
            "Say this is.",
            "It's a unit you won't find that in the metric system units.",
            "But you want to extract the data.",
            "I mean, it's also something that is a measurement with units that are not standard.",
            "So OK, let's workout to get the list of your needs.",
            "Oh no, sorry, sorry sorry forgot.",
            "Important point is how is it in Wikipedia?",
            "Because we're working with Wikipedia.",
            "So how the unit units in Wikipedia?",
            "In fact, nobody agrees that has been a debate.",
            "The measurements debate there is a wikiproject measurement, whose goal is to make things more clean, to have some guidelines, but still still not stand out so.",
            "So we have to find a solution.",
            "This."
        ],
        [
            "So to get the list of units what I did I started from the category units of measurement.",
            "That order articles within these categories contain units of measurement that's sure, so that's a first set that is very precise.",
            "And then what I did is I scanned all.",
            "The pages in Wikipedia only the first sentence of the abstract.",
            "Looking for this article is a link to unit or two AC unit or some to a set of pages that describe what is a unit OK and that gives quite a quite good lot of units and the last one was the templates as we've seen in the first slide.",
            "If you recall there was this convert for the Aswan Dam length that converts the meters into feet for the.",
            "HTML and these templates in the Mediawiki they have list of units so also took the units from there an merge everything and in the end end up with 600 units.",
            "So that's rose to the extraction in the pattern matching, but doesn't solve the solution for complex units, so complex units."
        ],
        [
            "I use a formal grammar, formal grammar nufarm familiar with compilers and so on, but it's basically how you define a programming language, is using a formal grammar using what's called prediction rules.",
            "And that is to say finally, what's a unit complex unit?",
            "It's an expression that follows a strict grammar.",
            "That means we will combine prefixes like kilo, mega with units.",
            "Then we will combine these together using operators.",
            "Operators can be like multiply, divide and here, so we combine expression that can have after one expression one operator like multiply or divide maybe 0 or North of these photos.",
            "And then we're also defined prefix.",
            "Design can be minus 1 + 1.",
            "And then we have for that we need then a list of units and here I use the derived SI units plus the Imperial ones because from the other I would say customer Ian Strange units.",
            "They never appear as a in combination with other one, so you never see like kilo U for several shelf or something like that.",
            "So only one U.",
            "That's how it goes with the formal grammar.",
            "What we do is we give an expression as an input an if the expression is valid, we obtain a path tree.",
            "Like this for here."
        ],
        [
            "Example like kilogram Times Square meters divided by.",
            "Cubic second time zone pair, which is the definition of the vault in fact.",
            "Quite complex one.",
            "Then what we get is that K is the prefix kilo, G Instagram is the unit, so it's combined with the operator multiply that you see here in the past three and then you have the square meters power here and then we divide so the product of empire an cubic second.",
            "So here we have a valid expression and that means OK.",
            "Here we identified we have a unit.",
            "Then we validate that we have numbers plus.",
            "An expression that validates all units.",
            "And then there's."
        ],
        [
            "It is run on all Wikipedia.",
            "All info box of Wikipedia and in the end we got 900,000 measurements for 300 properties with 600 units.",
            "So this data resulting data set.",
            "Is available as the data hub.",
            "Dot IO does also dedicated web page and like 2 representations in RDF, one using an every relation like a blank node with different properties.",
            "Like the units, the value if it links the properties is defined in Wikipedia on DBPR.",
            "It's linked to this place and another one is a custom data types, something that's been defined by Maxim within the room.",
            "Over there and it's also very handy too.",
            "To have custom treatment for this data type, you can define how to manage the data type with your own code in a sparkle query, so that's the resulting of this project.",
            "So maybe what's interesting to know is in fact how good is it.",
            "If it's good or not, the results so."
        ],
        [
            "Did a manual evaluation on 40 pages for two Wikipedia pages on really different.",
            "Different types of particles could be like cars, chemical elements, weapons, building cities, powerplant, everything that other asteroids.",
            "And so I'm like manually labeled if the data.",
            "Was correctly found.",
            "So if the data there was a measurement, and if it was correct for sure on DDR and weak data.",
            "So The thing is, uh.",
            "A weekday to quite a high precision means manually made.",
            "Data, not template like DBD up at like as we completely crowdsourced.",
            "But it has very low recall that's for sure.",
            "I mean it's quite complicated.",
            "It will take some time before we create as a complete coverage of Wikipedia.",
            "An for DB pedia.",
            "Precision is not that good.",
            "Why?",
            "Because lots of missing units like sort of the plant generation, lots of units, but lots of measurement without units.",
            "And this one gives about precision and so the record is also insights on the complete coverage of the PDF.",
            "So we also have social noise also not perfect.",
            "Also missing some things because they are they said, some free writing in Wikipedia.",
            "So some expression I'm not like standardized don't follow the formal grammar.",
            "And sometimes we also like due to ambiguity between the prefix in the units.",
            "There are some things that are recognized and measurements that are not in fact quite a few, but still some error.",
            "So it's not like completely perfect, but it give some good results in your fund.",
            "0.88 is quite good results so.",
            "That's encouraging for the future of this project.",
            "Future of the project."
        ],
        [
            "Is to integrate directly DPS and talking with you guys to find a way to integrate more tightly the data set mostly to align the units to the existing data types and certain properties or to extend properties are not present.",
            "Um, something that could be interesting is the machining wall extraction becausw.",
            "Depending on the country, you will have no.",
            "What example I today was like a plane built in France.",
            "There is lots of information on the French web page like lots of detail on the plane, the wing size that you're being the power and so on, and that you don't find an English page so and so it goes for.",
            "I mean Germany's, around and so on.",
            "You find lots of data only in one language, but you can align them in the.",
            "Age are interlinked and also quite job to run the properties between between countries and there is also quite lots of data in a free text.",
            "So interesting to see how to write extractors.",
            "Too much measurement in Wikipedia text.",
            "The concept of the articles.",
            "So that's it for the presentation.",
            "Thank you if you have some questions."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello everybody, so my name is Jennifer because I'm associate professor in the University of South Beach in the laboratory bacteria and today I will present.",
                    "label": 0
                },
                {
                    "sent": "You should on paper but extending the PDR with measurement.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what I'm going to talk about today is first, what's measurement, how it's done in DDR?",
                    "label": 0
                },
                {
                    "sent": "What are the issues we're trying to solve in this paper?",
                    "label": 0
                },
                {
                    "sent": "The second part is how these issues are solved, or the ideas behind this solution, and then short description of the data set and finally conclude on the future work as usual so.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First, what measurement?",
                    "label": 0
                },
                {
                    "sent": "What we're going to talk about in this paper is measurement is a.",
                    "label": 0
                },
                {
                    "sent": "Is the assignment of a number to a characteristic of an object or event last?",
                    "label": 1
                },
                {
                    "sent": "Wikipedia says basically what is it is, for instance, you measure something you want to wait an object, then some measurement your.",
                    "label": 0
                },
                {
                    "sent": "I don't know 1 meter 80 tool you wait that much kilo, that's measurement.",
                    "label": 0
                },
                {
                    "sent": "And here this is the topic of this project.",
                    "label": 0
                },
                {
                    "sent": "Is the extraction of measurement and how to extend the deal with that.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So first, how it works.",
                    "label": 0
                },
                {
                    "sent": "Basing on DBPR out extracts and some issues we encountered and the motivation of this project so.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "1st, for those who don't know, oh, it's worked in Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia as something called infoboxes.",
                    "label": 0
                },
                {
                    "sent": "This are these like small part that summarize an article in Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "An as usual in Wikipedia, the text as a source code, which is called the wiki markup and which is the way.",
                    "label": 1
                },
                {
                    "sent": "It's like programming language.",
                    "label": 0
                },
                {
                    "sent": "In fact, that's where you define don't have mouse or there here.",
                    "label": 0
                },
                {
                    "sent": "OK, let's say for instance for what interesting for us the measurement.",
                    "label": 0
                },
                {
                    "sent": "Let's say you have this info box that starts here with the double braces, and then you have some properties that are assigned to a value.",
                    "label": 0
                },
                {
                    "sent": "Here you have the damn links that you will.",
                    "label": 0
                },
                {
                    "sent": "So here it's like three 3800 centimeters and you find it here converted in HTML.",
                    "label": 0
                },
                {
                    "sent": "That's what you see when you open the page.",
                    "label": 0
                },
                {
                    "sent": "So how it's done this magic?",
                    "label": 0
                },
                {
                    "sent": "It's going to Mediawiki framework that provides Wikipedia and it transforms this wiki markup using also several languages, templates and sounds quite quite complete.",
                    "label": 0
                },
                {
                    "sent": "Complex beast.",
                    "label": 0
                },
                {
                    "sent": "And then in the end you get some HTML that used in your web page.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So how it's done in DB PEDIA and EVP of something called the DBPR extraction framework that converts the same sources?",
                    "label": 0
                },
                {
                    "sent": "This wiki markup into RDF how it's done.",
                    "label": 0
                },
                {
                    "sent": "It's not using the Mediawiki angina, its own, enjoying this cold extraction framework an the template to transform the data from this wiki markup to the two RDF was done in scholar to be technical.",
                    "label": 1
                },
                {
                    "sent": "But it's the same idea that we extract data from here to structure them into RDF.",
                    "label": 0
                },
                {
                    "sent": "OK, that's how it works.",
                    "label": 0
                },
                {
                    "sent": "So here just the view.",
                    "label": 1
                },
                {
                    "sent": "If you open the Aswan Dam you will see more things than just restricted to the measurement value because it's what's of interest here.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now start with the problems that you encounter dealing with measurement in DB pedia for instance.",
                    "label": 0
                },
                {
                    "sent": "Take this as one dumb as an example.",
                    "label": 0
                },
                {
                    "sent": "You have some measurement to see hate ANX.",
                    "label": 0
                },
                {
                    "sent": "And your generation about chubbins that you found in both places say.",
                    "label": 0
                },
                {
                    "sent": "In Wikipedia and in DB pedia.",
                    "label": 0
                },
                {
                    "sent": "But as you see, there's lots of measurements missing here.",
                    "label": 0
                },
                {
                    "sent": "OK, that data that could have been in a database that are not in the database, so.",
                    "label": 0
                },
                {
                    "sent": "How come is that I said previously DPD works with template extraction.",
                    "label": 0
                },
                {
                    "sent": "This template are manually written by the DPL source, and I mean it's quite status.",
                    "label": 0
                },
                {
                    "sent": "Walken Infoboxes are complex and I guess it's hard to have 100% cover of the templates and that's why you have missing values in DP.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So sometimes it gets bit more complicated.",
                    "label": 0
                },
                {
                    "sent": "For instance, you take all the chemical elements in Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "You will find modest, in fact on measurement.",
                    "label": 0
                },
                {
                    "sent": "Nothing in the pedia.",
                    "label": 0
                },
                {
                    "sent": "It's completely missing.",
                    "label": 0
                },
                {
                    "sent": "Why is it completely missing?",
                    "label": 0
                },
                {
                    "sent": "It's because of the way data is transformed.",
                    "label": 0
                },
                {
                    "sent": "I'll go to a web browser, see how it works so.",
                    "label": 0
                },
                {
                    "sent": "Fun, OK, that's the Wikipedia webpage on medium.",
                    "label": 0
                },
                {
                    "sent": "So as you see, there's quite a lot of measurement.",
                    "label": 0
                },
                {
                    "sent": "Boiling point, the heat of Fusion lots.",
                    "label": 0
                },
                {
                    "sent": "Lots of things that we expect to find in DPS that are not here.",
                    "label": 0
                },
                {
                    "sent": "What's not here?",
                    "label": 0
                },
                {
                    "sent": "Let's check the source of the aluminium.",
                    "label": 0
                },
                {
                    "sent": "How it works.",
                    "label": 0
                },
                {
                    "sent": "In fact, the infobox is, why is it?",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "So it's different from the one we've seen before.",
                    "label": 0
                },
                {
                    "sent": "Before we have seen Infoblox and then some key and values associated, and here just infobox.",
                    "label": 0
                },
                {
                    "sent": "Aluminium knows.",
                    "label": 0
                },
                {
                    "sent": "No values in here, so in fact where the data question it's somewhere and in fact.",
                    "label": 0
                },
                {
                    "sent": "It's in a page code.",
                    "label": 0
                },
                {
                    "sent": "Don't plate infobox aluminium.",
                    "label": 0
                },
                {
                    "sent": "That defines just the box.",
                    "label": 0
                },
                {
                    "sent": "OK, let's welcome to Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "Here is the data, so that means you have one page that includes one page that includes another one.",
                    "label": 0
                },
                {
                    "sent": "And that DVD is not able to enter that.",
                    "label": 0
                },
                {
                    "sent": "It's not made for, and that's that's why the information is missing.",
                    "label": 0
                },
                {
                    "sent": "OK, back to the presentation.",
                    "label": 0
                },
                {
                    "sent": "So here yeah, lots of data missing's typical from the chemical elements and also what's related to drugs, chemistry and so on.",
                    "label": 0
                },
                {
                    "sent": "No, quite lot of missing data.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So there was a problem.",
                    "label": 0
                },
                {
                    "sent": "There was a problem like sometimes we are like missing units.",
                    "label": 1
                },
                {
                    "sent": "Let's go back to the Aswan Dam's.",
                    "label": 0
                },
                {
                    "sent": "OK, this Aswan Dam is a annual generation of.",
                    "label": 0
                },
                {
                    "sent": "10,042.",
                    "label": 0
                },
                {
                    "sent": "What you do what?",
                    "label": 0
                },
                {
                    "sent": "Now if I start what is giga Watt power?",
                    "label": 0
                },
                {
                    "sent": "So that's what we expected, but there's nothing so.",
                    "label": 1
                },
                {
                    "sent": "Without unit measurement is nothing.",
                    "label": 0
                },
                {
                    "sent": "You cannot work something out if you don't have the units, so you absolutely need that.",
                    "label": 0
                },
                {
                    "sent": "It's mandatory, so that means here.",
                    "label": 0
                },
                {
                    "sent": "I mean, if we have nothing, it's more less the same.",
                    "label": 0
                },
                {
                    "sent": "We cannot use it for anything.",
                    "label": 0
                },
                {
                    "sent": "So that's missing units.",
                    "label": 0
                },
                {
                    "sent": "Second problem we have.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Annoying, sometimes we have like I don't know some inquiry runs or missing units.",
                    "label": 0
                },
                {
                    "sent": "You don't know.",
                    "label": 0
                },
                {
                    "sent": "You know that, for instance.",
                    "label": 0
                },
                {
                    "sent": "General Macy's 1 meter 70 centimeter high.",
                    "label": 0
                },
                {
                    "sent": "You see that in two versions.",
                    "label": 0
                },
                {
                    "sent": "DVD of the person, hate property and the hate.",
                    "label": 0
                },
                {
                    "sent": "Here this one as arrange a centimeter and the correct label.",
                    "label": 0
                },
                {
                    "sent": "But here the label is.",
                    "label": 0
                },
                {
                    "sent": "I don't know strange.",
                    "label": 0
                },
                {
                    "sent": "An that is, the range is just double, so here we don't know what it is.",
                    "label": 0
                },
                {
                    "sent": "OK so when you have two information like this, which ones should you trust?",
                    "label": 0
                },
                {
                    "sent": "So that's also a problem.",
                    "label": 0
                },
                {
                    "sent": "So here this.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I guess you get the motivation of the project so.",
                    "label": 0
                },
                {
                    "sent": "Why I'm trying to solve this problem is I have missing units missing from the data types we are missing measurement and sometimes we have some inquiry.",
                    "label": 1
                },
                {
                    "sent": "Once in the data so.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How to do it?",
                    "label": 0
                },
                {
                    "sent": "So the idea was to go back from the source we extract from Wikipedia using another technique to get more precision or maybe more.",
                    "label": 1
                },
                {
                    "sent": "Recall on the data.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "How can we do that?",
                    "label": 0
                },
                {
                    "sent": "So for the measurements that are missing, we must find a new way to extract.",
                    "label": 1
                },
                {
                    "sent": "I don't want to manually write the templates for everything if I'm too lazy, sorry.",
                    "label": 0
                },
                {
                    "sent": "Manual template, so I don't want to do that, so I want it to be automatical.",
                    "label": 0
                },
                {
                    "sent": "The more the must automatically as possible, and some data are incoherent in the description of the ontology.",
                    "label": 0
                },
                {
                    "sent": "That's I would say maybe something like internal description.",
                    "label": 0
                },
                {
                    "sent": "I don't want to deal with that and.",
                    "label": 0
                },
                {
                    "sent": "Try to find a solution.",
                    "label": 1
                },
                {
                    "sent": "And for what's missing complete measurement, we've seen it's the problem of inclusion of inclusion of inclusion.",
                    "label": 0
                },
                {
                    "sent": "So the DBPR Mediawiki framework is like PHP, you a lot of languages very complex, so you don't want to implement that in like, Java, Scala, whatever the language the best is in fact to use directly was generated as the output.",
                    "label": 0
                },
                {
                    "sent": "So the idea is to work with the HTML.",
                    "label": 0
                },
                {
                    "sent": "As input instead of the wiki markup so it's bit more slower, but in fact you extract once, then you get the data.",
                    "label": 0
                },
                {
                    "sent": "Doesn't mind if it takes 2 hours or three days in the data is here and job is done, so that's what the the idea of a.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also using HTML when possible.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "How to extract the measurement measurement so as I said a structured in infobox jaza about the current article it as a property an.",
                    "label": 1
                },
                {
                    "sent": "Value for get a unit so.",
                    "label": 0
                },
                {
                    "sent": "Fact seems quite simple to extract.",
                    "label": 0
                },
                {
                    "sent": "OK, just look for everything like pattern matching number and unit OK, say 1000 meters.",
                    "label": 0
                },
                {
                    "sent": "The kilogram OK look simple, but it's not enough to deal with complex units.",
                    "label": 1
                },
                {
                    "sent": "When you have something like gram per square centimeters about cubic centimeter, then.",
                    "label": 0
                },
                {
                    "sent": "It's not only one unit, so combination of unit, so we need something.",
                    "label": 0
                },
                {
                    "sent": "An approach that is more robust that only pattern matching.",
                    "label": 0
                },
                {
                    "sent": "So the idea of the solution.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is to go over all the info boxes, that's for sure.",
                    "label": 0
                },
                {
                    "sent": "An first to try the pattern matching number and a list of units.",
                    "label": 0
                },
                {
                    "sent": "OK, an when with this solution you can extract simple things like meters for example, that fits in the list of units.",
                    "label": 0
                },
                {
                    "sent": "But this solution doesn't work for like Grandpa or more or grandparent cubic centimeter and so on.",
                    "label": 0
                },
                {
                    "sent": "So here the idea is to use a formal grammar, so I will talk more in detail later about that.",
                    "label": 1
                },
                {
                    "sent": "That's the outline of the solution.",
                    "label": 0
                },
                {
                    "sent": "So let's start with the first one with the pattern matching one.",
                    "label": 1
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is we need a list of unit.",
                    "label": 0
                },
                {
                    "sent": "To do that we cannot check everything.",
                    "label": 0
                },
                {
                    "sent": "I mean it has to be valid so it has to be units.",
                    "label": 0
                },
                {
                    "sent": "So first, how it works units.",
                    "label": 0
                },
                {
                    "sent": "Most of the.",
                    "label": 0
                },
                {
                    "sent": "The world uses metric and international system of units, but the US and Commonwealth and in the UK have a so Imperial in US.",
                    "label": 0
                },
                {
                    "sent": "Customer is so like bits of yeah.",
                    "label": 0
                },
                {
                    "sent": "Different units that are slowly, slowly, slowly being metric aged in different countries at different speeds.",
                    "label": 0
                },
                {
                    "sent": "Plus we find also customary and strange units were called strange units is like for instance, know if you're familiar with installing servers, but when you buy a several shelf, then it's measured in U when U for you and when you is some height of a server and that's unit will find some info box.",
                    "label": 0
                },
                {
                    "sent": "Say this is.",
                    "label": 0
                },
                {
                    "sent": "It's a unit you won't find that in the metric system units.",
                    "label": 0
                },
                {
                    "sent": "But you want to extract the data.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's also something that is a measurement with units that are not standard.",
                    "label": 0
                },
                {
                    "sent": "So OK, let's workout to get the list of your needs.",
                    "label": 0
                },
                {
                    "sent": "Oh no, sorry, sorry sorry forgot.",
                    "label": 0
                },
                {
                    "sent": "Important point is how is it in Wikipedia?",
                    "label": 0
                },
                {
                    "sent": "Because we're working with Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "So how the unit units in Wikipedia?",
                    "label": 1
                },
                {
                    "sent": "In fact, nobody agrees that has been a debate.",
                    "label": 0
                },
                {
                    "sent": "The measurements debate there is a wikiproject measurement, whose goal is to make things more clean, to have some guidelines, but still still not stand out so.",
                    "label": 0
                },
                {
                    "sent": "So we have to find a solution.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to get the list of units what I did I started from the category units of measurement.",
                    "label": 1
                },
                {
                    "sent": "That order articles within these categories contain units of measurement that's sure, so that's a first set that is very precise.",
                    "label": 0
                },
                {
                    "sent": "And then what I did is I scanned all.",
                    "label": 0
                },
                {
                    "sent": "The pages in Wikipedia only the first sentence of the abstract.",
                    "label": 0
                },
                {
                    "sent": "Looking for this article is a link to unit or two AC unit or some to a set of pages that describe what is a unit OK and that gives quite a quite good lot of units and the last one was the templates as we've seen in the first slide.",
                    "label": 0
                },
                {
                    "sent": "If you recall there was this convert for the Aswan Dam length that converts the meters into feet for the.",
                    "label": 0
                },
                {
                    "sent": "HTML and these templates in the Mediawiki they have list of units so also took the units from there an merge everything and in the end end up with 600 units.",
                    "label": 0
                },
                {
                    "sent": "So that's rose to the extraction in the pattern matching, but doesn't solve the solution for complex units, so complex units.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I use a formal grammar, formal grammar nufarm familiar with compilers and so on, but it's basically how you define a programming language, is using a formal grammar using what's called prediction rules.",
                    "label": 0
                },
                {
                    "sent": "And that is to say finally, what's a unit complex unit?",
                    "label": 0
                },
                {
                    "sent": "It's an expression that follows a strict grammar.",
                    "label": 0
                },
                {
                    "sent": "That means we will combine prefixes like kilo, mega with units.",
                    "label": 0
                },
                {
                    "sent": "Then we will combine these together using operators.",
                    "label": 0
                },
                {
                    "sent": "Operators can be like multiply, divide and here, so we combine expression that can have after one expression one operator like multiply or divide maybe 0 or North of these photos.",
                    "label": 0
                },
                {
                    "sent": "And then we're also defined prefix.",
                    "label": 0
                },
                {
                    "sent": "Design can be minus 1 + 1.",
                    "label": 0
                },
                {
                    "sent": "And then we have for that we need then a list of units and here I use the derived SI units plus the Imperial ones because from the other I would say customer Ian Strange units.",
                    "label": 0
                },
                {
                    "sent": "They never appear as a in combination with other one, so you never see like kilo U for several shelf or something like that.",
                    "label": 0
                },
                {
                    "sent": "So only one U.",
                    "label": 0
                },
                {
                    "sent": "That's how it goes with the formal grammar.",
                    "label": 1
                },
                {
                    "sent": "What we do is we give an expression as an input an if the expression is valid, we obtain a path tree.",
                    "label": 0
                },
                {
                    "sent": "Like this for here.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Example like kilogram Times Square meters divided by.",
                    "label": 0
                },
                {
                    "sent": "Cubic second time zone pair, which is the definition of the vault in fact.",
                    "label": 0
                },
                {
                    "sent": "Quite complex one.",
                    "label": 0
                },
                {
                    "sent": "Then what we get is that K is the prefix kilo, G Instagram is the unit, so it's combined with the operator multiply that you see here in the past three and then you have the square meters power here and then we divide so the product of empire an cubic second.",
                    "label": 0
                },
                {
                    "sent": "So here we have a valid expression and that means OK.",
                    "label": 0
                },
                {
                    "sent": "Here we identified we have a unit.",
                    "label": 0
                },
                {
                    "sent": "Then we validate that we have numbers plus.",
                    "label": 0
                },
                {
                    "sent": "An expression that validates all units.",
                    "label": 0
                },
                {
                    "sent": "And then there's.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It is run on all Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "All info box of Wikipedia and in the end we got 900,000 measurements for 300 properties with 600 units.",
                    "label": 1
                },
                {
                    "sent": "So this data resulting data set.",
                    "label": 0
                },
                {
                    "sent": "Is available as the data hub.",
                    "label": 0
                },
                {
                    "sent": "Dot IO does also dedicated web page and like 2 representations in RDF, one using an every relation like a blank node with different properties.",
                    "label": 0
                },
                {
                    "sent": "Like the units, the value if it links the properties is defined in Wikipedia on DBPR.",
                    "label": 0
                },
                {
                    "sent": "It's linked to this place and another one is a custom data types, something that's been defined by Maxim within the room.",
                    "label": 0
                },
                {
                    "sent": "Over there and it's also very handy too.",
                    "label": 0
                },
                {
                    "sent": "To have custom treatment for this data type, you can define how to manage the data type with your own code in a sparkle query, so that's the resulting of this project.",
                    "label": 0
                },
                {
                    "sent": "So maybe what's interesting to know is in fact how good is it.",
                    "label": 0
                },
                {
                    "sent": "If it's good or not, the results so.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Did a manual evaluation on 40 pages for two Wikipedia pages on really different.",
                    "label": 1
                },
                {
                    "sent": "Different types of particles could be like cars, chemical elements, weapons, building cities, powerplant, everything that other asteroids.",
                    "label": 0
                },
                {
                    "sent": "And so I'm like manually labeled if the data.",
                    "label": 0
                },
                {
                    "sent": "Was correctly found.",
                    "label": 0
                },
                {
                    "sent": "So if the data there was a measurement, and if it was correct for sure on DDR and weak data.",
                    "label": 0
                },
                {
                    "sent": "So The thing is, uh.",
                    "label": 0
                },
                {
                    "sent": "A weekday to quite a high precision means manually made.",
                    "label": 0
                },
                {
                    "sent": "Data, not template like DBD up at like as we completely crowdsourced.",
                    "label": 0
                },
                {
                    "sent": "But it has very low recall that's for sure.",
                    "label": 0
                },
                {
                    "sent": "I mean it's quite complicated.",
                    "label": 0
                },
                {
                    "sent": "It will take some time before we create as a complete coverage of Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "An for DB pedia.",
                    "label": 0
                },
                {
                    "sent": "Precision is not that good.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because lots of missing units like sort of the plant generation, lots of units, but lots of measurement without units.",
                    "label": 0
                },
                {
                    "sent": "And this one gives about precision and so the record is also insights on the complete coverage of the PDF.",
                    "label": 0
                },
                {
                    "sent": "So we also have social noise also not perfect.",
                    "label": 0
                },
                {
                    "sent": "Also missing some things because they are they said, some free writing in Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "So some expression I'm not like standardized don't follow the formal grammar.",
                    "label": 0
                },
                {
                    "sent": "And sometimes we also like due to ambiguity between the prefix in the units.",
                    "label": 0
                },
                {
                    "sent": "There are some things that are recognized and measurements that are not in fact quite a few, but still some error.",
                    "label": 0
                },
                {
                    "sent": "So it's not like completely perfect, but it give some good results in your fund.",
                    "label": 0
                },
                {
                    "sent": "0.88 is quite good results so.",
                    "label": 0
                },
                {
                    "sent": "That's encouraging for the future of this project.",
                    "label": 0
                },
                {
                    "sent": "Future of the project.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is to integrate directly DPS and talking with you guys to find a way to integrate more tightly the data set mostly to align the units to the existing data types and certain properties or to extend properties are not present.",
                    "label": 0
                },
                {
                    "sent": "Um, something that could be interesting is the machining wall extraction becausw.",
                    "label": 0
                },
                {
                    "sent": "Depending on the country, you will have no.",
                    "label": 0
                },
                {
                    "sent": "What example I today was like a plane built in France.",
                    "label": 0
                },
                {
                    "sent": "There is lots of information on the French web page like lots of detail on the plane, the wing size that you're being the power and so on, and that you don't find an English page so and so it goes for.",
                    "label": 0
                },
                {
                    "sent": "I mean Germany's, around and so on.",
                    "label": 0
                },
                {
                    "sent": "You find lots of data only in one language, but you can align them in the.",
                    "label": 0
                },
                {
                    "sent": "Age are interlinked and also quite job to run the properties between between countries and there is also quite lots of data in a free text.",
                    "label": 0
                },
                {
                    "sent": "So interesting to see how to write extractors.",
                    "label": 0
                },
                {
                    "sent": "Too much measurement in Wikipedia text.",
                    "label": 0
                },
                {
                    "sent": "The concept of the articles.",
                    "label": 0
                },
                {
                    "sent": "So that's it for the presentation.",
                    "label": 0
                },
                {
                    "sent": "Thank you if you have some questions.",
                    "label": 0
                }
            ]
        }
    }
}