{
    "id": "eabpsspw5ioian5jdud6bm6hb7ldfedn",
    "title": "Professional Development through Collaborative Learning and Open Education Practices for Language Education",
    "info": {
        "presenter": [
            "Naomi Wahls, University of Colorado Denver",
            "Alisher Abidjanov, National University of Uzbekistan"
        ],
        "published": "July 13, 2018",
        "recorded": "July 2018",
        "category": [
            "Top->Social Sciences->Education",
            "Top->Computers->Digital Media",
            "Top->Technology"
        ]
    },
    "url": "http://videolectures.net/educationdesign2018_abidjanov_language_education/",
    "segmentation": [
        [
            "Before, as this is the project.",
            "This is participants.",
            "This is my mentor now.",
            "I mean also you can see and right now.",
            "That said, there is.",
            "There is no clear."
        ],
        [
            "OK, this is a win over.",
            "How about works?",
            "Is it?",
            "Video.",
            "Sure we do.",
            "We recorded the greeting from our second.",
            "Will get there.",
            "And sound.",
            "Dragon.",
            "You have to put it up.",
            "She was not able to come, but she recorded nice greeting which I really liked.",
            "Yeah, yeah.",
            "From the beginning.",
            "No, no sound.",
            "Yeah you can.",
            "Looking around 7 academic development Center for excellence in learning and teaching a bunch of Metropolitan University in the United Kingdom.",
            "Now only Aleshire and I have been working together since January 2018 to improve the current provision of reaccreditation for foreign language teachers in higher education in Uzbekistan.",
            "The result of our collaboration is a proposal we have put together and put in our forwards to colleagues.",
            "It was really fun to consider for implementation.",
            "We have found that features of open education such as extended, collaborative, open learning but also authentic learning that will help colleagues in affect them connect.",
            "In practice, the foreign language with native speakers elsewhere would be beneficial for the program, but also for their practitioners after and now only are there to explain.",
            "This in more detail, I hope you enjoy and find the presentation and the work we have done and useful and we are looking for for feedback and comments that will have a chronic sinus exam to take some of their ideas forward.",
            "I am in the UK.",
            "I couldn't unfortunately join them, but we have fantastic weather which is very unusual for me.",
            "OK so I am going out into the subject.",
            "I like the last part.",
            "He is crazy.",
            "Can you go to the slide?",
            "Yeah, before describing the project I would just would like to give you the brief background."
        ],
        [
            "It's going on.",
            "In Uzbek higher education system is very centralized.",
            "It's all our universities.",
            "There's they state universities.",
            "We don't have any kind of private universities and we are managed by the Ministry of High Education and Ministry of Education defines everything.",
            "So in general high location system in our country is very very bureaucratic.",
            "It's very difficult to implement something very knew, that's why.",
            "Practically, we don't have any kind of distance learning.",
            "We don't have any kind of the our traditional way is like just chockablock blackboard and just lecturing and we try to implement new elements which you have to coordinate with the Ministry of Education just for understanding how is centralized, I have to tell when we go for evaluation at schools, for example to secondary school to evaluate them.",
            "You can be sure that at the same day the students at the same class they will open in holes, countries the same page of the textbook.",
            "Sort of like all syllabus.",
            "It's exactly the same, not probably at the same hour, but it will be the same week, the same topic.",
            "So it's sort of like very brief description and another important part three or four years ago the government realises that teaching foreign language is not in the good level because we taught foreign languages, specially mostly English from 4th grade of secondary school up to the 12th grade and then four."
        ],
        [
            "Four years in Bachelor degree and two years in Masters degree and you teach for I don't know more than for 10 years and in the end of the day no one can speak English.",
            "It's sort of like percentage is very, very low.",
            "That's why the government was not was not very happy and established three or four years ago.",
            "National Practical Research Center for Innovative teaching methods and I am Deputy Director there and working to implement that kind of.",
            "Things this is was short introduction which explain a lot of things.",
            "I was center is relatively big big, it's 50 or 60 people work there.",
            "Centralized issue in our country.",
            "Every teacher we have we can go to the first one.",
            "Yeah, second one.",
            "It's worked every three years, is mandatory for all teachers in the country to go to for professional development, and spent two months in University and take a course in the end of the in the end of the course they have to defense their paper which they are writing during the two months and they have to pass exams.",
            "It's relatively stressful because if you fall down.",
            "You will be given another year for self preparation and if you fall again you will be fired.",
            "Sort of like that's why it's very big and important issue.",
            "Professional development in our in our country.",
            "So.",
            "Because it's sort of like very contract, it's life defining issues.",
            "Sometimes that's why it's a lot of a lot of claims from the teachers, because about the content of the course, what's going on, and so on.",
            "And so on.",
            "And biggest complaint was OK, how we should make our self development when we failed and we have one year and.",
            "Government said it's very difficult to bring to the capital again all these teachers and government said, OK, we have to organize for them distance learning courses.",
            "But nobody knows what it what is it?",
            "Nobody can do it, but we got the order from the ministry and we have to implement and it work in the.",
            "I think the way how all of you know all our teachers, they put their electronic lectures to the model platform and said this is distance learning education.",
            "It's it happened like that and.",
            "No one, of course, was happy because the the teachers they start to continue to complain that it's not satisfied for us.",
            "We need better system and now it's sort of like life itself.",
            "Push us to that area actually.",
            "No one wants to be there, but all of us.",
            "We are slowly going there because it's requirement of the government.",
            "At.",
            "Yeah.",
            "About 10 or 20% of teachers there.",
            "They cannot pass that exam, but at the same time, it helps.",
            "It helps to the government take out the teachers whose knowledge of foreign languages is relatively low.",
            "And then.",
            "We decided OK. We have to develop proper online tools for distance learning and create open electronic resources which doesn't exist in our country because it was a regular textbook.",
            "So text of the lectures and so on and so this is very short description and background what's going on and how I end up to Slovenia.",
            "Yeah, because it's a beginning.",
            "It was not that kind of such plan.",
            "I had a lot of other things to do.",
            "So it's now, I guess, and then I was lucky we found to this project I found."
        ],
        [
            "They know me as a color other and we start to collaborate in different ways with our students and so on and so on and now.",
            "And only Christy, they help to our center to develop that kind of materials.",
            "So it's.",
            "Similar things that we notice were that the program currently is some part on the self study and some of it is practical and some of it is theoretical.",
            "What we were looking at is what their current online pilot had and then we were proposing what could be."
        ],
        [
            "We added or altered or improved ippon, so our main three goals for this particular phase, from January to July was to review their current teaching plan for that online course and then plan some sort of initiative to connect the students in Uzbekistan with students in another country to practice English through virtual exchange, and currently, unit collaboration has some information.",
            "For partnering, and so we were looking at connecting with unit collaboration to find partners for Uzbekistan.",
            "And then our third part was actually that we are text or open book for the professional development of the English educators there."
        ],
        [
            "And part of that that that text and part of that content was.",
            "We realized the theory and practice of virtual exchange was not there, and so that's one of the pieces that we're looking at adding for a future into that online program is they can do those virtual exchanges to connect with other instructors an have that real practice of English.",
            "So we're focusing mainly on the English instructors, but that can be added in the future in other languages, so it just gives him that opportunity to start off.",
            "In one, so some of the suggestions that we've made is 1 becoming more collaborative in education.",
            "'cause as of right now, there's a lot of self study an as Alycia had mentioned, it's a lot of on the chalk and kind of on your own, and so we're looking at kind of implementing some more of that collaborative online learning and being open in that collaboration, and we provided a template, but it is in canvas.",
            "Just it was just a template so that it could see options for a course in the future, and we're looking at possibly something like Moodle net to be more open.",
            "But we also are looking at doing a virtual exchange for this fall.",
            "I'll be actually teaching a course in Colorado, so will be at least connecting that course with a course in Uzbekistan and then our next phase that starts actually after this week is going to be the Rebus ovr book project, and we have been accepted as a project with that Rebus, and so you will eventually see an open book or an open honoraire textbook.",
            "I'm professional development for English English instructors.",
            "In that first portion will be talking about or later on we're talking about what that will kind of look like."
        ],
        [
            "But before I continue, I'm going to pass it back to Alisher so he can talk about the agreement, which is mainly for this project.",
            "We are, although I know many people were producing a full course, are as we realize we're looking more at the policy and the implementation of open education practices.",
            "Kind of.",
            "Improving upon the current pilot and moving into more of an open education environment for Uzbekistan.",
            "So again, we're more focused on the policy, which is why our production at this point is more focused on that agreement.",
            "And then we also have created a mentor proposal outlining the steps that we feel that Uzbekistan could implement overtime.",
            "So I'm going to pass back to Alishar.",
            "Yeah, I just would like to mention that.",
            "The very interesting things in Twitch.",
            "Sort of like inspired me.",
            "This project has huge big leverage because we are National Center and actually because system is very centralized, the things which we are issuing and which we are telling it will work for whole country.",
            "Sort of like we had that kind of authority.",
            "And also if you open the link.",
            "Yeah, and.",
            "Our our ministry.",
            "It says that the all our universities they must implement that online teaching courses.",
            "Unfortunately doesn't.",
            "It doesn't work.",
            "Oh, OK. We don't have enough resources for doing all these things, but at least we have that kind of intention from the government to do this kind of thing we have.",
            "We have that kind of administrative support, but we don't have enough the human resources, the qualification, and this is web page of our Ministry of Higher education that put put the that kind of goals that we should implement and.",
            "Another second link and another good.",
            "Think it just last months it was.",
            "Signed agreement between President of Uzbekistan in United States.",
            "About about is it this year, the second, the second MOU expense funding for English language programs that crosses biggest an include instruction, University student journalists, and so on and so on.",
            "So it looks like United States is going to support it now, supporting.",
            "And I hope that project will develop in something big because it has everything to develop to something big and will effect two whole country.",
            "Do you want to hear something?"
        ],
        [
            "Yeah, it's about course itself.",
            "Yeah, I actually will skip a lot of this and will share this so you can see it, but I know on time I just want to make sure that we hit some of the very end, but we actually have our theory of the collaborative open learning in our.",
            "Our slides, so again you can see more of that information of what we're sharing for the virtual mobility.",
            "The main concept there is that."
        ],
        [
            "Becca Stan will be looking at using Ovr resources, either textbook or Moocs, and then having those virtual exchanges and providing credit to their students.",
            "For those interactions, there's a program out of tudelft that has some of that right now, where there's a mook and students are getting credit so that something similar of what we're going to be looking at as well."
        ],
        [
            "And then for the textbook itself, we will be sending out a call for theory like on the book chapters for teaching, specifically looking at virtual exchange, virtual mobility and bilingual Education, collaborative open learning, and then we will be doing two different editions, one for Mexico.",
            "Just because I have Contacts there and I've done some work there and then a second one for is Becca.",
            "Stan will be doing case studies based on that.",
            "First, we are either textbook or open book and they'll be doing case studies using those practices of virtual exchange in collaborative open learning, and they can produce those in the target language in their local languages.",
            "So that's going to be a future portion of what this what happens afterwards."
        ],
        [
            "And then this is just some of the output that we've done so far, and again, we'll be sharing these slides.",
            "And I think that's I don't know if you wanted to say anything else, but does anyone have any questions?",
            "Any questions yeah?",
            "Tyra very good success teaching German language.",
            "Contractor connection with how they're doing.",
            "I actually I just met them.",
            "I just met one of the Contacts in the Netherlands in April and we're just starting to exchange some of the information and meets, but it's something I want to explore more for this particular project I myself in also doing some training for Erasmus plus virtual exchanges, although I've done more in the USI wanted to expand and kind of get some more of the training there and then see what could be done as well with connection with Europe.",
            "And possibly to include Slovenia through that.",
            "So that's why I'm doing that Erasmus plus and then kind of introducing Uzbekistan with that as well.",
            "So."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Before, as this is the project.",
                    "label": 0
                },
                {
                    "sent": "This is participants.",
                    "label": 0
                },
                {
                    "sent": "This is my mentor now.",
                    "label": 0
                },
                {
                    "sent": "I mean also you can see and right now.",
                    "label": 0
                },
                {
                    "sent": "That said, there is.",
                    "label": 0
                },
                {
                    "sent": "There is no clear.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, this is a win over.",
                    "label": 0
                },
                {
                    "sent": "How about works?",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "Video.",
                    "label": 0
                },
                {
                    "sent": "Sure we do.",
                    "label": 0
                },
                {
                    "sent": "We recorded the greeting from our second.",
                    "label": 0
                },
                {
                    "sent": "Will get there.",
                    "label": 0
                },
                {
                    "sent": "And sound.",
                    "label": 0
                },
                {
                    "sent": "Dragon.",
                    "label": 0
                },
                {
                    "sent": "You have to put it up.",
                    "label": 0
                },
                {
                    "sent": "She was not able to come, but she recorded nice greeting which I really liked.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah.",
                    "label": 0
                },
                {
                    "sent": "From the beginning.",
                    "label": 0
                },
                {
                    "sent": "No, no sound.",
                    "label": 0
                },
                {
                    "sent": "Yeah you can.",
                    "label": 0
                },
                {
                    "sent": "Looking around 7 academic development Center for excellence in learning and teaching a bunch of Metropolitan University in the United Kingdom.",
                    "label": 0
                },
                {
                    "sent": "Now only Aleshire and I have been working together since January 2018 to improve the current provision of reaccreditation for foreign language teachers in higher education in Uzbekistan.",
                    "label": 0
                },
                {
                    "sent": "The result of our collaboration is a proposal we have put together and put in our forwards to colleagues.",
                    "label": 0
                },
                {
                    "sent": "It was really fun to consider for implementation.",
                    "label": 0
                },
                {
                    "sent": "We have found that features of open education such as extended, collaborative, open learning but also authentic learning that will help colleagues in affect them connect.",
                    "label": 0
                },
                {
                    "sent": "In practice, the foreign language with native speakers elsewhere would be beneficial for the program, but also for their practitioners after and now only are there to explain.",
                    "label": 0
                },
                {
                    "sent": "This in more detail, I hope you enjoy and find the presentation and the work we have done and useful and we are looking for for feedback and comments that will have a chronic sinus exam to take some of their ideas forward.",
                    "label": 0
                },
                {
                    "sent": "I am in the UK.",
                    "label": 0
                },
                {
                    "sent": "I couldn't unfortunately join them, but we have fantastic weather which is very unusual for me.",
                    "label": 0
                },
                {
                    "sent": "OK so I am going out into the subject.",
                    "label": 0
                },
                {
                    "sent": "I like the last part.",
                    "label": 0
                },
                {
                    "sent": "He is crazy.",
                    "label": 0
                },
                {
                    "sent": "Can you go to the slide?",
                    "label": 0
                },
                {
                    "sent": "Yeah, before describing the project I would just would like to give you the brief background.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's going on.",
                    "label": 0
                },
                {
                    "sent": "In Uzbek higher education system is very centralized.",
                    "label": 0
                },
                {
                    "sent": "It's all our universities.",
                    "label": 0
                },
                {
                    "sent": "There's they state universities.",
                    "label": 0
                },
                {
                    "sent": "We don't have any kind of private universities and we are managed by the Ministry of High Education and Ministry of Education defines everything.",
                    "label": 0
                },
                {
                    "sent": "So in general high location system in our country is very very bureaucratic.",
                    "label": 0
                },
                {
                    "sent": "It's very difficult to implement something very knew, that's why.",
                    "label": 0
                },
                {
                    "sent": "Practically, we don't have any kind of distance learning.",
                    "label": 0
                },
                {
                    "sent": "We don't have any kind of the our traditional way is like just chockablock blackboard and just lecturing and we try to implement new elements which you have to coordinate with the Ministry of Education just for understanding how is centralized, I have to tell when we go for evaluation at schools, for example to secondary school to evaluate them.",
                    "label": 0
                },
                {
                    "sent": "You can be sure that at the same day the students at the same class they will open in holes, countries the same page of the textbook.",
                    "label": 0
                },
                {
                    "sent": "Sort of like all syllabus.",
                    "label": 0
                },
                {
                    "sent": "It's exactly the same, not probably at the same hour, but it will be the same week, the same topic.",
                    "label": 0
                },
                {
                    "sent": "So it's sort of like very brief description and another important part three or four years ago the government realises that teaching foreign language is not in the good level because we taught foreign languages, specially mostly English from 4th grade of secondary school up to the 12th grade and then four.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Four years in Bachelor degree and two years in Masters degree and you teach for I don't know more than for 10 years and in the end of the day no one can speak English.",
                    "label": 0
                },
                {
                    "sent": "It's sort of like percentage is very, very low.",
                    "label": 0
                },
                {
                    "sent": "That's why the government was not was not very happy and established three or four years ago.",
                    "label": 0
                },
                {
                    "sent": "National Practical Research Center for Innovative teaching methods and I am Deputy Director there and working to implement that kind of.",
                    "label": 0
                },
                {
                    "sent": "Things this is was short introduction which explain a lot of things.",
                    "label": 0
                },
                {
                    "sent": "I was center is relatively big big, it's 50 or 60 people work there.",
                    "label": 0
                },
                {
                    "sent": "Centralized issue in our country.",
                    "label": 0
                },
                {
                    "sent": "Every teacher we have we can go to the first one.",
                    "label": 0
                },
                {
                    "sent": "Yeah, second one.",
                    "label": 0
                },
                {
                    "sent": "It's worked every three years, is mandatory for all teachers in the country to go to for professional development, and spent two months in University and take a course in the end of the in the end of the course they have to defense their paper which they are writing during the two months and they have to pass exams.",
                    "label": 0
                },
                {
                    "sent": "It's relatively stressful because if you fall down.",
                    "label": 0
                },
                {
                    "sent": "You will be given another year for self preparation and if you fall again you will be fired.",
                    "label": 0
                },
                {
                    "sent": "Sort of like that's why it's very big and important issue.",
                    "label": 0
                },
                {
                    "sent": "Professional development in our in our country.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Because it's sort of like very contract, it's life defining issues.",
                    "label": 0
                },
                {
                    "sent": "Sometimes that's why it's a lot of a lot of claims from the teachers, because about the content of the course, what's going on, and so on.",
                    "label": 0
                },
                {
                    "sent": "And so on.",
                    "label": 0
                },
                {
                    "sent": "And biggest complaint was OK, how we should make our self development when we failed and we have one year and.",
                    "label": 0
                },
                {
                    "sent": "Government said it's very difficult to bring to the capital again all these teachers and government said, OK, we have to organize for them distance learning courses.",
                    "label": 0
                },
                {
                    "sent": "But nobody knows what it what is it?",
                    "label": 0
                },
                {
                    "sent": "Nobody can do it, but we got the order from the ministry and we have to implement and it work in the.",
                    "label": 0
                },
                {
                    "sent": "I think the way how all of you know all our teachers, they put their electronic lectures to the model platform and said this is distance learning education.",
                    "label": 0
                },
                {
                    "sent": "It's it happened like that and.",
                    "label": 0
                },
                {
                    "sent": "No one, of course, was happy because the the teachers they start to continue to complain that it's not satisfied for us.",
                    "label": 0
                },
                {
                    "sent": "We need better system and now it's sort of like life itself.",
                    "label": 0
                },
                {
                    "sent": "Push us to that area actually.",
                    "label": 0
                },
                {
                    "sent": "No one wants to be there, but all of us.",
                    "label": 0
                },
                {
                    "sent": "We are slowly going there because it's requirement of the government.",
                    "label": 0
                },
                {
                    "sent": "At.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "About 10 or 20% of teachers there.",
                    "label": 0
                },
                {
                    "sent": "They cannot pass that exam, but at the same time, it helps.",
                    "label": 0
                },
                {
                    "sent": "It helps to the government take out the teachers whose knowledge of foreign languages is relatively low.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "We decided OK. We have to develop proper online tools for distance learning and create open electronic resources which doesn't exist in our country because it was a regular textbook.",
                    "label": 0
                },
                {
                    "sent": "So text of the lectures and so on and so this is very short description and background what's going on and how I end up to Slovenia.",
                    "label": 0
                },
                {
                    "sent": "Yeah, because it's a beginning.",
                    "label": 0
                },
                {
                    "sent": "It was not that kind of such plan.",
                    "label": 0
                },
                {
                    "sent": "I had a lot of other things to do.",
                    "label": 0
                },
                {
                    "sent": "So it's now, I guess, and then I was lucky we found to this project I found.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They know me as a color other and we start to collaborate in different ways with our students and so on and so on and now.",
                    "label": 0
                },
                {
                    "sent": "And only Christy, they help to our center to develop that kind of materials.",
                    "label": 0
                },
                {
                    "sent": "So it's.",
                    "label": 0
                },
                {
                    "sent": "Similar things that we notice were that the program currently is some part on the self study and some of it is practical and some of it is theoretical.",
                    "label": 0
                },
                {
                    "sent": "What we were looking at is what their current online pilot had and then we were proposing what could be.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We added or altered or improved ippon, so our main three goals for this particular phase, from January to July was to review their current teaching plan for that online course and then plan some sort of initiative to connect the students in Uzbekistan with students in another country to practice English through virtual exchange, and currently, unit collaboration has some information.",
                    "label": 0
                },
                {
                    "sent": "For partnering, and so we were looking at connecting with unit collaboration to find partners for Uzbekistan.",
                    "label": 0
                },
                {
                    "sent": "And then our third part was actually that we are text or open book for the professional development of the English educators there.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And part of that that that text and part of that content was.",
                    "label": 0
                },
                {
                    "sent": "We realized the theory and practice of virtual exchange was not there, and so that's one of the pieces that we're looking at adding for a future into that online program is they can do those virtual exchanges to connect with other instructors an have that real practice of English.",
                    "label": 0
                },
                {
                    "sent": "So we're focusing mainly on the English instructors, but that can be added in the future in other languages, so it just gives him that opportunity to start off.",
                    "label": 0
                },
                {
                    "sent": "In one, so some of the suggestions that we've made is 1 becoming more collaborative in education.",
                    "label": 0
                },
                {
                    "sent": "'cause as of right now, there's a lot of self study an as Alycia had mentioned, it's a lot of on the chalk and kind of on your own, and so we're looking at kind of implementing some more of that collaborative online learning and being open in that collaboration, and we provided a template, but it is in canvas.",
                    "label": 0
                },
                {
                    "sent": "Just it was just a template so that it could see options for a course in the future, and we're looking at possibly something like Moodle net to be more open.",
                    "label": 0
                },
                {
                    "sent": "But we also are looking at doing a virtual exchange for this fall.",
                    "label": 1
                },
                {
                    "sent": "I'll be actually teaching a course in Colorado, so will be at least connecting that course with a course in Uzbekistan and then our next phase that starts actually after this week is going to be the Rebus ovr book project, and we have been accepted as a project with that Rebus, and so you will eventually see an open book or an open honoraire textbook.",
                    "label": 1
                },
                {
                    "sent": "I'm professional development for English English instructors.",
                    "label": 0
                },
                {
                    "sent": "In that first portion will be talking about or later on we're talking about what that will kind of look like.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But before I continue, I'm going to pass it back to Alisher so he can talk about the agreement, which is mainly for this project.",
                    "label": 0
                },
                {
                    "sent": "We are, although I know many people were producing a full course, are as we realize we're looking more at the policy and the implementation of open education practices.",
                    "label": 0
                },
                {
                    "sent": "Kind of.",
                    "label": 0
                },
                {
                    "sent": "Improving upon the current pilot and moving into more of an open education environment for Uzbekistan.",
                    "label": 0
                },
                {
                    "sent": "So again, we're more focused on the policy, which is why our production at this point is more focused on that agreement.",
                    "label": 0
                },
                {
                    "sent": "And then we also have created a mentor proposal outlining the steps that we feel that Uzbekistan could implement overtime.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to pass back to Alishar.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I just would like to mention that.",
                    "label": 0
                },
                {
                    "sent": "The very interesting things in Twitch.",
                    "label": 0
                },
                {
                    "sent": "Sort of like inspired me.",
                    "label": 0
                },
                {
                    "sent": "This project has huge big leverage because we are National Center and actually because system is very centralized, the things which we are issuing and which we are telling it will work for whole country.",
                    "label": 0
                },
                {
                    "sent": "Sort of like we had that kind of authority.",
                    "label": 0
                },
                {
                    "sent": "And also if you open the link.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and.",
                    "label": 0
                },
                {
                    "sent": "Our our ministry.",
                    "label": 0
                },
                {
                    "sent": "It says that the all our universities they must implement that online teaching courses.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately doesn't.",
                    "label": 0
                },
                {
                    "sent": "It doesn't work.",
                    "label": 0
                },
                {
                    "sent": "Oh, OK. We don't have enough resources for doing all these things, but at least we have that kind of intention from the government to do this kind of thing we have.",
                    "label": 0
                },
                {
                    "sent": "We have that kind of administrative support, but we don't have enough the human resources, the qualification, and this is web page of our Ministry of Higher education that put put the that kind of goals that we should implement and.",
                    "label": 0
                },
                {
                    "sent": "Another second link and another good.",
                    "label": 0
                },
                {
                    "sent": "Think it just last months it was.",
                    "label": 0
                },
                {
                    "sent": "Signed agreement between President of Uzbekistan in United States.",
                    "label": 0
                },
                {
                    "sent": "About about is it this year, the second, the second MOU expense funding for English language programs that crosses biggest an include instruction, University student journalists, and so on and so on.",
                    "label": 0
                },
                {
                    "sent": "So it looks like United States is going to support it now, supporting.",
                    "label": 0
                },
                {
                    "sent": "And I hope that project will develop in something big because it has everything to develop to something big and will effect two whole country.",
                    "label": 0
                },
                {
                    "sent": "Do you want to hear something?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, it's about course itself.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I actually will skip a lot of this and will share this so you can see it, but I know on time I just want to make sure that we hit some of the very end, but we actually have our theory of the collaborative open learning in our.",
                    "label": 0
                },
                {
                    "sent": "Our slides, so again you can see more of that information of what we're sharing for the virtual mobility.",
                    "label": 0
                },
                {
                    "sent": "The main concept there is that.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Becca Stan will be looking at using Ovr resources, either textbook or Moocs, and then having those virtual exchanges and providing credit to their students.",
                    "label": 0
                },
                {
                    "sent": "For those interactions, there's a program out of tudelft that has some of that right now, where there's a mook and students are getting credit so that something similar of what we're going to be looking at as well.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then for the textbook itself, we will be sending out a call for theory like on the book chapters for teaching, specifically looking at virtual exchange, virtual mobility and bilingual Education, collaborative open learning, and then we will be doing two different editions, one for Mexico.",
                    "label": 1
                },
                {
                    "sent": "Just because I have Contacts there and I've done some work there and then a second one for is Becca.",
                    "label": 0
                },
                {
                    "sent": "Stan will be doing case studies based on that.",
                    "label": 0
                },
                {
                    "sent": "First, we are either textbook or open book and they'll be doing case studies using those practices of virtual exchange in collaborative open learning, and they can produce those in the target language in their local languages.",
                    "label": 0
                },
                {
                    "sent": "So that's going to be a future portion of what this what happens afterwards.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then this is just some of the output that we've done so far, and again, we'll be sharing these slides.",
                    "label": 0
                },
                {
                    "sent": "And I think that's I don't know if you wanted to say anything else, but does anyone have any questions?",
                    "label": 0
                },
                {
                    "sent": "Any questions yeah?",
                    "label": 0
                },
                {
                    "sent": "Tyra very good success teaching German language.",
                    "label": 0
                },
                {
                    "sent": "Contractor connection with how they're doing.",
                    "label": 0
                },
                {
                    "sent": "I actually I just met them.",
                    "label": 0
                },
                {
                    "sent": "I just met one of the Contacts in the Netherlands in April and we're just starting to exchange some of the information and meets, but it's something I want to explore more for this particular project I myself in also doing some training for Erasmus plus virtual exchanges, although I've done more in the USI wanted to expand and kind of get some more of the training there and then see what could be done as well with connection with Europe.",
                    "label": 0
                },
                {
                    "sent": "And possibly to include Slovenia through that.",
                    "label": 0
                },
                {
                    "sent": "So that's why I'm doing that Erasmus plus and then kind of introducing Uzbekistan with that as well.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        }
    }
}