{
    "id": "eda56fcuw4gf7geu56jsibwe7pbpndj4",
    "title": "Language data for digital natives: old wine in a new bottle or...?",
    "info": {
        "author": [
            "Simon Krek, Artificial Intelligence Laboratory, Jožef Stefan Institute"
        ],
        "published": "Dec. 2, 2011",
        "recorded": "November 2011",
        "category": [
            "Top->Humanities->Linguistics->Lexicography"
        ]
    },
    "url": "http://videolectures.net/elex2011_krek_language/",
    "segmentation": [
        [
            "I think that's the topic of lexicography, and what will actually happen in the next decade with.",
            "With dictionaries with electronic diction is is not.",
            "The result is not very clear what will happen, so I'll just try to give a context with.",
            "Special reference to the field I'm also involved in language technology and where the basic questions will be how E lexicography and natural language processing and language technologies can come a bit more together than they are now.",
            "And then.",
            "I would like to continue with this."
        ],
        [
            "Image.",
            "Well, this was taken in 1970.",
            "The film by the movie by Monty Python came out in 1970 and this is a well known joke about.",
            "You know how Hungarians invaded England and well, John Cleese is the Hungarian trying to buy tobacco and he's using Hungarian English phrase book.",
            "Because the publisher was really didn't know anything about finger in language.",
            "He just put random sentences in it, and, well, John Cleese is saying sentences like your hovercraft is full of eels and things like that trying to buy the tobacco.",
            "The point here is this was 40 years ago and it was quite common situation so you would use a phrase book.",
            "Two well to buy tobacco or any kind of other kind of communication needs.",
            "What would you do today?",
            "You would probably use your phone and what would happen actually?",
            "Would you show it to the tobacconist, and this is what I would like to go into in my presentation."
        ],
        [
            "And what I'd like to use in the beginning is a paper which is called.",
            "Vision paper.",
            "Which was written within the project that the stock mentioned I'm involved in called Mintonette.",
            "Myth and its meta is well written.",
            "It is a network of excellence trying to.",
            "Well, what we are saying is to forge multilingual Europe Technology Alliance, which means that.",
            "We would like to bring together all day.",
            "Industry partners from academia from everybody from government, different governments to see if something can be.",
            "Done on European level.",
            "Regarding the development of language technologies for all European languages, for the next decade, let's say and these visions are going quite to the extreme, and this is what I would like to.",
            "Well, this is how I would like to us to think about for the next 45 minutes.",
            "What if we go push things to the extreme?",
            "In the field of language technologies and also.",
            "Lexicography, that's what we'll look into bit later.",
            "So visions are language, transparent web, and media.",
            "What does it mean?",
            "The first part of it is cross lingual information.",
            "Access to the web, web, and to media in all languages.",
            "So we would like to cover 200 to 1000 languages.",
            "OK, that's a lot, but what we would like to do with them?",
            "The.",
            "In which ever language you make a query, it doesn't matter, so you would get results from all other languages.",
            "Also.",
            "That's one thing, alternative question answering and natural language search.",
            "It means that if you ask a question like I don't know.",
            "When was?",
            "When did man land on the moon or something like that?",
            "He would get answers.",
            "In the language you asked, but also gathering information from all other languages too.",
            "Um?",
            "Conversational agents, automatic translation of chats, tweets and emails.",
            "The basic idea here is that.",
            "With the success of.",
            "Social networks and other new media.",
            "People interact alot over the globe so.",
            "Let's say that you want to contact a friend who doesn't speak.",
            "Slovene doesn't speak English.",
            "From Vietnam I don't know.",
            "You could chat with him with or without a problem using machine translation systems and things like that.",
            "Multimedia, multilanguage, subtitling this.",
            "This is a good one so.",
            "Subtitles for television programmes in real time.",
            "Audio and video translations.",
            "So let's say that I'm interested in.",
            "Dutch elections and I want to watch TV, well, the news and I don't understand that at all.",
            "So what I would do is just click and get subtitles in Slovene saying what the anchor is saying.",
            "World News Reporter.",
            "Science fiction, I know, but this is one of the visions.",
            "In this paper, making documents understandable re phrasing complicated documents, automatic summarization and language generation, what does it mean?",
            "It means that if you get.",
            "Some things you don't really understand, like.",
            "Legal papers you know when you read them and don't understand anything, so the computer would help you to say this contract is really bad for you, because this sentence is here and.",
            "Well, I'm joking, but you understand what I mean also with.",
            "Things like.",
            "Prescription package inserts which which are also difficult to understand.",
            "So this is.",
            "This part making documents understandable, not to mention automatic summarization, which is actually happening right now, it's it's not, let's say, science."
        ],
        [
            "Fiction.",
            "Vision two naturally inclusive interaction.",
            "So what you have here is self learning context aware personalized agents with speech language and multi modal input and output abilities.",
            "Well, what do you have to imagine?",
            "Here is a robot walking around after you and you just say well.",
            "I would really like to know.",
            "When did I last time?",
            "Check my email or something like that and.",
            "He would.",
            "She would well, he or she it would.",
            "So you mean what you did?",
            "No assistive applications, personalized speech technology systems for personal persons with reduced motor motor control sign, language recognition, synthesis, and translation.",
            "This would help people who can't hear.",
            "And so.",
            "You would be actually without knowing the the sign language, you would be able to communicate with them.",
            "This is the point here.",
            "Crossing will be learning.",
            "This is kind of known things like computer assisted language learning and things like that remote system for remote education.",
            "Cross lingual meet meeting assistant.",
            "This is also like this one.",
            "The instant speech to speech translation is transformed.",
            "Slides presentation handwritten notes into a preferred language mean it's automatically produced.",
            "Video recordings automatically indexed to support voice searching, transcription, and translation.",
            "Well, so I'm giving this talk and you could actually see what I'm talking in real time somewhere."
        ],
        [
            "Vision 3.",
            "Efficient information management.",
            "Federated Multilingual Audio visual search.",
            "Well, this is.",
            "Taking this point to one step further.",
            "Not only you could search for text, but also for audio and video materials so.",
            "Where in the system would identify objects, persons, actions, speech recognition of ordinary untrained voices.",
            "This is also not science fiction anymore, actually.",
            "Semantic analysis of audio and video content.",
            "Interesting for lexicography.",
            "Personalized information assistant.",
            "Filing documents, reformatting materials.",
            "Copying information from one document to another.",
            "Preparing standard letters and answering information requests.",
            "It means that the machine would take some of the, let's say, low level tasks from you, and when you have a friend writing to you and you just have to say yes, I agree and things like that the machine could do it instead of you.",
            "Not really, but.",
            "The last one is the scary one.",
            "Lifelogging capture every utterance in conversation during the day.",
            "Semantically, structuring the information into meaningful bits and pieces.",
            "So if you, let's say you forget something, what did I mean?",
            "What did I say?",
            "I don't know in the morning when we talked about this, so we could just track back and say.",
            "It would be really difficult to argue, you know with people around you.",
            "So this is it.",
            "This is the vision paper of Mintonette language technology in the next decade, let's say."
        ],
        [
            "There is another thing I want to.",
            "Point out here, the world of digitization, so this is changing or developing, evolving quite rapidly in my opinion, because if you just take a look at some announcements in the last year, let's say.",
            "In December, the 6th Google unveiled Google Books, the new service for buying reading digital books.",
            "Cloud based.",
            "What does that mean?",
            "Actually, it means that your library would.",
            "Transfer into.",
            "The digital world.",
            "So you could actually.",
            "Walk around the world with the whole library.",
            "Have on your bookshelves, in your pocket.",
            "Amazon announced the bed.",
            "It's now selling more Kindle E books than both hardcover and paperback book books combined.",
            "Well, it means that the printed book is actually.",
            "Going out in general, not just the dictionaries.",
            "This one is interesting for people in education.",
            "South Korea announced that it plans to replace textbooks and all paper in its schools with tablets by 2015.",
            "And I plan to invest.",
            "2 billion dollars in this.",
            "Well, it may be, you know it has something to do with the fact that Samsung is.",
            "Korean based.",
            "Company, but anyway, I think that in the long run this is actually this.",
            "This will actually happen.",
            "And will be lost.",
            "This last point is actually only two.",
            "To emphasize that in a certain period of time we will have all libraries available.",
            "In digital form, so all the all the books that were printed or written in previous centuries will be in digitized form sooner or later.",
            "Now this is in my opinion, well, sort of the world we're going into.",
            "Push the bit to the extreme, that's true, but."
        ],
        [
            "If we think about what we.",
            "What will happen with dictionaries in this kind of world?",
            "And I would like to go through?",
            "Three points here.",
            "The first point is, well, let's say that.",
            "Three thesis first is the text mining is a challenge in this world.",
            "In this kind of world.",
            "Content lexicographic content is a problem and presentation is even a bigger problem."
        ],
        [
            "No.",
            "If we imagine that we have.",
            "All incredible amounts of information available.",
            "So what is the current content of dictionaries, either in printed form or in electronic form?",
            "We have definitions, collocations, examples, synonyms, many, many, many different things.",
            "I don't.",
            "Let's imagine that we can detect, extract, retrieve, select with all these beautiful machine learning and data mining mechanisms.",
            "What the whole World Wide Web.",
            "All the digital fast and also the digitized present the one which is not on the Internet on the World Wide Web already.",
            "So this is what is available to us.",
            "Let's say that it is maybe in a few years or.",
            "Sometime."
        ],
        [
            "It's my opinion is that language causes a lively field, but narrow lexicographically relevant text mining activity is actually absent, at least on a large scale.",
            "We have a lot of research going on, but if we think about something like Google N Grams where you.",
            "Have the whole English web and you get N grams for the whole web.",
            "This is the kind of.",
            "Large scale activity I'm thinking about and not only for engrams, but for for on all the.",
            "Older, this kind of information we have on this slide.",
            "But apart from the investment required, which is, you know Google is very.",
            "Big company.",
            "I think that the reason maybe also the lack of consensus about the content and the presentation.",
            "So the two points I would like to get to after.",
            "I mentioned Wikipedia here because there is a really good consensus about the contents or the I mean the format of encyclopaedic.",
            "Kind of information at the moment.",
            "And there is also one other problem that.",
            "In this world, Digital world information as such is cheap because we can.",
            "Really, we have processing power we have.",
            "Really powerful computers.",
            "Meaning is actually expensive."
        ],
        [
            "And what does that mean?",
            "It is that dealing with meaning as such.",
            "Is still an incredibly difficult task for computers.",
            "This is the field of artificial intelligence.",
            "And.",
            "Whenever you know you deal with something that makes sense to a human, it's very difficult for computers.",
            "One of the basic tasks of lexicography has everything to do with meaning.",
            "So this is another problem for.",
            "Lexicography or data mining or text mining.",
            "For the purposes of lexicography.",
            "And there is another thing, what our task is to explain it to human users, not the computers.",
            "Because language, technology, community is more interested in how computers can actually deal with meaning, not for well in the end for human users but more or less to how can computers talk to each other?",
            "Let's say understand things they have stored.",
            "And the question is.",
            "If natural language person community is interested in meaning.",
            "Which it which it is.",
            "Is there a place for the lexicography in this massive effort?",
            "What I mean is, I would just like to mention here IBM Watson briefly, it's a digression, but.",
            "It's an interesting thing.",
            "IBM has these liquid and great challenges and one was.",
            "Producing the blue for chess.",
            "Cheating in chess.",
            "And this year.",
            "They.",
            "Arranged a competition in jeopardy where one of the competitors was on the computer they assembled, called Watson and the computer competed with two best players of Jeopardy.",
            "You know the game.",
            "Basically it's about question answering.",
            "And actually the computer one.",
            "Which is quite a scary thought.",
            "And there all of them will actually incredibly good like you couldn't believe what those two.",
            "People actually knew, and what the computer also could get from its system in so few seconds.",
            "And well, to go bit further in this digression, I have to say this because we're only Slovenia.",
            "All of them made a mistake in a question regarding Slovenia because the question was which of the former Yugoslav republics is now a member of EU European Union.",
            "It seems like a very simple question, you know the members of European Union, you know them by heart and the computer should know them.",
            "But.",
            "The computer didn't want to answer.",
            "Because it was not sure and one of the competitors answered wrongly.",
            "So he said that it was Serbia.",
            "Even the third one didn't want to answer.",
            "This is how small the idea."
        ],
        [
            "And if we move on with this question, so I would like to let's say present or invoke image of a jellyfish.",
            "And why would I would like to do that because?"
        ],
        [
            "Ordered in 2001.",
            "There's a paper by John Sinclair and, well, this this is really a lot of text and I'll just read it aloud so you can see you'll understand what my point will be.",
            "A few years ago and this was published in 2001, so it was, you know, in the 90s.",
            "I found that the time was ripe to plan and you kind of dictionary one that would never exist on paper, but will be automatically almost automatic in itself, updating.",
            "It would say to speak.",
            "Float on top of corpus rather like jellyfish.",
            "Standards come constantly sensing the state of the language, as well as reporting on the settled usage, meanings of the words and phrases of a language like normal dictionary, bus, the floating dictionary, when interrogated, dips into the corpus and checks this information, offering instances that match its criteria for the senses.",
            "Also it explores further to see if there are any instances that conflict with the criteria and may signify development of a sense.",
            "Or the emergence of a new usage altogether within the limits of its powers.",
            "It organizes this evidence as a comment on the existing dictionary entry, so in."
        ],
        [
            "2001 I have this idea which involves really difficult.",
            "Really difficult.",
            "Language technology like information extraction, reporting on the settled usage.",
            "Offering instances that matched its criteria, like large scale text mining.",
            "Tender is constantly sensing this state of the language which says disambiguation really difficult match its criteria for it senses, signify development of a sense and also on the other side.",
            "Text generation visualization.",
            "But the problem is that.",
            "All the technology used here is for a very, very specific purpose for a dictionary.",
            "And probably This is why it never happened.",
            "It's not the only reason, but."
        ],
        [
            "If we.",
            "Now we're talking about data mining, text mining, and things like that so.",
            "If you take definition as a part of his well crucial part of dictionaries as a showcase here.",
            "We can say that.",
            "Could we extract definitions from?",
            "If you have all these huge huge amounts of?",
            "Data available can we extract definitions from textbooks from Wikipedia from general digitized texts?",
            "And on the other hand.",
            "Could we actually generate them using language technology?",
            "With.",
            "Basically, a paradigm shift from educating with difficult definitions.",
            "Let's say that this is the.",
            "Lexicographic tradition to explain with simple ones.",
            "But the problem here is, in my opinion that we actually don't know what kind of definitions we want to show, how to present them, and I will talk about this also later in the presentation section, let's say.",
            "When you know so.",
            "Not all definitions are good for everybody, so maybe we should think about definitions.",
            "Which are different for.",
            "Language learners for native speakers and well."
        ],
        [
            "Classic.",
            "And the question is here, is it happening?",
            "Actually it is.",
            "I was in this workshop.",
            "At.",
            "Alright MLP recent advances in natural language processing.",
            "In 2009, bots Bulgaria.",
            "There is an international well.",
            "It was actually called the first International Workshop on definition extraction.",
            "And.",
            "I'm pretty sure I was the only lexicographer there in the room.",
            "And then I also ordered a.",
            "Experiments well, two of them are just randomly chosen here, so it is happening.",
            "Actually, definition extraction is.",
            "Starting to."
        ],
        [
            "But if we just take a look at this citation from one, well from an extract from one of the papers.",
            "The task has proven useful in many research areas, including ontology, learning, relation extraction and question answering.",
            "So when we're talking about.",
            "Definition extraction in would be the field of natural language processing.",
            "We are not talking about.",
            "Human users in the end.",
            "That's the problem here, I think."
        ],
        [
            "And this is I would like to compete with.",
            "Text mining issue.",
            "With this point I made before that he lexicography has not experienced it through truly large scale text mining effort to create the whole range starting with definitions.",
            "Of lexicographic content automatically or semi automatically.",
            "And this is just well, it came to my mind.",
            "So I just wrote it down.",
            "Text my wish list.",
            "So what was done will be there in the sense that we have all the digitized material available or will be available in time.",
            "What is there can be extracted, so let's say that we can actually extract all the lexicographic data.",
            "Let's say we can.",
            "We don't know if can, but let's say we can't.",
            "What is not there should be done.",
            "So this is.",
            "The hope for lexicographers, because some things you cannot do automatically.",
            "What changes is interesting, so in this in the sense of Johnson class.",
            "Paper.",
            "If something changes in language.",
            "We should be able to detect the changes.",
            "And what changes can be detected?",
            "Let's say that it can be now if we move."
        ],
        [
            "To the content.",
            "Do we know contents?",
            "Do we know what we like to do with the contents?",
            "No.",
            "One thing is that language technology fields actually started with.",
            "Really.",
            "With the hope that.",
            "The data.",
            "In in dictionaries could provide them with a lot of knowledge and it started to happen in the 80s and in the night as in now.",
            "So it's an old thing.",
            "So it starts at the other way around.",
            "Dictionaries providing information for language technologies.",
            "And you.",
            "These all kinds of different linguistic information where.",
            "Put into various formats which developed in time.",
            "Through different projects like but all and simple and many many many more.",
            "And now in 2008 let's say that we have some kind of standard lexical markup framework which includes information like more morphological information, syntactic semantics, multi word patterns, also machine readable dictionaries here.",
            "So at the moment we are."
        ],
        [
            "In this stage that we can say OK, the format in language technology looks.",
            "A bit like this, this is the.",
            "Peak will probably know this one.",
            "Diagram over the road net.",
            "Lexical Markup Framework format and you can see here dictionary like information definition, sense, Lemma, sense axis.",
            "I just wanted to show this.",
            "This.",
            "Picture to say that there is within language technologies.",
            "There are formats which include lexicographic information."
        ],
        [
            "And the other is.",
            "Text in code TI format.",
            "Which is quite an old thing, but.",
            "It also includes.",
            "Dictionaries.",
            "What is important here?",
            "For human oriented, monolingual and multilingual dictionaries, and also for computational lexicon, Lang language processing software.",
            "So TI tries to cover both parts, humans and computers."
        ],
        [
            "So the point I want to make here is that in my opinion, language technology, community now after all these years has a basic idea how to store verify various types of, let's say linguistic information.",
            "And also the semantic web community.",
            "A really huge community with.",
            "RDF format and, well, a lot of them.",
            "I won't go through that.",
            "But also, in my opinion, standardization in human oriented dictionary encoding was never really successful.",
            "XML, yes, definitely we all have dictionaries act in XML but not T or any other standard format.",
            "The question I would like to.",
            "Post here is without an answer.",
            "Actually, if different types of looks, graphic information intended for human users will have to know each other.",
            "Will the format be dictated by language technology standards?",
            "And my answer would be at the moment, probably yes, and this is, well, something to think about."
        ],
        [
            "Because when I was at Eric Conference, the language resources and evaluation conferences in conference in Malta in 2010, I just counted how many papers dealt with.",
            "Well, from the point of view of the format.",
            "And there were 16 papers.",
            "Data mining.",
            "Wikipedia Prove 17 papers.",
            "Doing something would will net and allow papers.",
            "Doing something with frame it.",
            "Which means that.",
            "Natural language processing community really likes these three formats.",
            "And well, my opinion is this is just.",
            "It's not really relevant that the NLP community thinks that what matters for now is informatics for verbs.",
            "They would like to bring them together in this way.",
            "And the point here is the important point is that Wikipedia in Word net.",
            "But actually used by both sides by human users and NLP community."
        ],
        [
            "Now this is the format.",
            "What about the information?",
            "How do you know that what we now know is E dictionaries are actually liked in the Facebook sense?",
            "Where are?",
            "A lot of excellent studies.",
            "Love dictionary use a lot of them really good.",
            "I really like that.",
            "Assessment of usability.",
            "Actually from taking editions from different different point of view.",
            "A paper about would hide and I tracking.",
            "Paper on our tracking by Yukio Tono in this year's first.",
            "Yeah, Journal and we could.",
            "Also I didn't find any.",
            "Studies, maybe I missed them somehow, but.",
            "How?",
            "Electronic dictionaries are used by tracking mouse movement keystroke and.",
            "Other things we could do?",
            "And also monitoring web log files.",
            "This is known, but in my opinion the problem is that these activities are performed on the existing type of links.",
            "Graphical information."
        ],
        [
            "And.",
            "To use them, Monty Python.",
            "Is there something else so our user users actually able to describe?",
            "What kind of information they need about language?",
            "When do we have the mechanisms to identify those these needs?",
            "How about new media, social networks, things like that and I would just like to ask."
        ],
        [
            "As an example, I would like to say a few words about.",
            "When part of the project Estok mentions at the beginning, so one of the things we have to develop is sort of Internet style guides portal where the user could just.",
            "Come to the portal and say I would like to.",
            "Know what this word means?",
            "Is it?",
            "Is it?",
            "Is it?",
            "Spelled correctly in this way or that way, and things like that, so it would be a kind of language information hotspot for Slovene, obviously.",
            "And then.",
            "We will try to explain more difficult parts of language for like public in so in in easy kind of.",
            "Wait?",
            "Then we would also provide links to corporate at the dictionaries to lexical databases.",
            "Lexicons, and all the things we have and to see what we might expect from the users.",
            "We web code forms on websites which are dedicated to living language issues analyzed about 1500 questions."
        ],
        [
            "Discussions.",
            "And this is what we found out at about 1/3.",
            "Will.",
            "Actually related to orthography.",
            "16% to morphology.",
            "It's only 1/4 two.",
            "The type of information that a dictionary would provide.",
            "It's true, that's living.",
            "Morphology and orthography is very difficult.",
            "You can bet this these figures would be different for different languages, but my main point here is that people just ask about things that they're bothered with.",
            "They don't.",
            "Think about, we will find this in the dictionary.",
            "Will I find this in a group somewhere?",
            "They just want to get the."
        ],
        [
            "And as quickly as possible.",
            "And this is my summary, can we expect that digital natures will have the patience to distinguish between different types of language information containers like dictionaries like?",
            "Textbooks and things like that, no, this is.",
            "My definite answer.",
            "Does that mean that this time to think about the more universal information database providing different kind of language data?",
            "Yes, and not just different kind but.",
            "All of them and how much time do you have to provide this information in the digital world?",
            "Not much measured in seconds.",
            "Some studies have shown that we have about 20 seconds maximum, but it also depends on the urgency of this need."
        ],
        [
            "Let's do the last point.",
            "What about presentation?",
            "So.",
            "We know that there is a really good good.",
            "Formats the codecs formats which was good for 1500 years and a lot of very very useful devices.",
            "Will invented in time like Alphabetization, Thumbin, Dixing sense numbering different kind of typography and layout menus and signposts so that people could get to the information they need as quickly as possible.",
            "And I remember when I started to.",
            "Well, I studied translation and it was really a success.",
            "You know when you just grab the dictionary and you opened it in exactly the right page, you remember that some of you do.",
            "So.",
            "But still.",
            "User is left to his or her book selection, so we first have to find the book you need.",
            "And browsing skills to find the information.",
            "And what about the dictionary?"
        ],
        [
            "We have a lot of very useful new devices like handling, search, fulltext search, advanced search, contextualized search, and.",
            "Multiple choice interfaces and things like that, but still.",
            "User is users are left to.",
            "They have to select the right database.",
            "And they depend on their searching skills because we know that a lot of people don't use.",
            "Like Fulltext search or advanstar trying anything like that."
        ],
        [
            "And.",
            "Again, now for something completely different.",
            "What if universe this situation and take all the burden on our shoulders and say that?",
            "The user just has to express the need for information about the language problem and we have to guess everything else, everything else.",
            "And this is what context.",
            "Awareness in the first in the first slides is.",
            "So the system the computer knows already knows things like.",
            "What am I doing?",
            "Am I traveling, studying, browsing web?",
            "What am I reading domain like sports history, finance, physics?",
            "Who am I actually?",
            "I'm slowly speaker learner French.",
            "So.",
            "You know?",
            "All true there.",
            "Now spend a lot of time on Facebook and Can you imagine in 20 years 10 years time for 20 years time.",
            "What kind of information will Facebook have on them or about them?",
            "Because they can track actually everything they do so.",
            "But we're probably entering that kind of world.",
            "And this, I think also reflects on lexicography.",
            "So we have to think about.",
            "The information you have about the user and use it."
        ],
        [
            "And how would the user expect Express delete?",
            "Bye.",
            "Question answering conversational agents mentioned indovision paper in the first slide and input mode would not be just mouse and keyboard but also voice recognition, OCR, which we've seen in every software.",
            "And the gesture gestures.",
            "Would Microsoft Connect programs and all?",
            "But we are not just limited to mouse and keyboard anymore and will not be."
        ],
        [
            "In the future.",
            "So the lead will be expressed.",
            "Like this?",
            "Somebody type.",
            "A question like what is the population of Canada?",
            "The computer gives the answer.",
            "Now this is 1 mode in my opinion.",
            "And I call it the question answering mode so.",
            "Somebody just expresses lexicographic kind of need, and the system knows everything about him her.",
            "And.",
            "Gives the exactly correct kind of information."
        ],
        [
            "And the other is.",
            "The browsing and visualization mode, because here we can also expect that.",
            "Will not have just the immediate need for some kind of lexicographic information, but people will have the need to to just browse.",
            "For that type of information and.",
            "My opinion is that what will happen in the future is a 3 dimensional model of related information about language.",
            "We've seen some of that with.",
            "Wordnet visualizations and it's.",
            "Quite well we see I think that is.",
            "Presentation also in this conference about that.",
            "But this could go much, much, much further.",
            "Not just work, but all kinds of renovation and also combined with all other kind of information.",
            "And well, if I just give a metaphor or image.",
            "What my opinion is that it should be something like Google Earth.",
            "You know we can just watch the Earth as such and now the.",
            "Well, Google has announced that they will also.",
            "Make available that you enter the building, not just streets, but you go along the street and then enter some building and probably watch.",
            "A movie.",
            "And go out from the cinema.",
            "So language information should be available in this kind of way.",
            "So where I can just go around the world of this in that language?"
        ],
        [
            "And my conclusions are.",
            "A new interesting language.",
            "Technology is emerging.",
            "I think related to the requirements of the Information Society and the other point is that.",
            "European Union seems to be preparing a coordinated action to get back on track after the success of North American companies.",
            "This mainly relates to machine translation, but all other things also.",
            "Hence the question for will the final question is that is it possible to jump on this bandwagon with the conceptual break with tradition in lexicography?",
            "Taking into account all the things that I emphasized in the talk, and that's all.",
            "I liked your presentation very much.",
            "Perhaps as you spoke about the future possibilities today and about the future possibilities to get data, perhaps you forgot the possibility to read the sorts, as in new experiments, But that's not my question.",
            "My question has to do with your.",
            "General proposal and discussion about E lexicography.",
            "I'm not so sure that when you use E lexicography in your paper that you mean it because you were in my impression speaking about a database, and what you can put in a database, and if you have a database, you can present your data in an E dictionary.",
            "You can set it up.",
            "Printed dictionary across only a part of the database.",
            "Or you can send it in another kind of information tool.",
            "Therefore perhaps you understand by E. Lexicography something else, as I do.",
            "I had the impression that they often, when you used electrical coffee, you mean lexicography.",
            "I agree that I used the lexicography in North in, let's say, not very consistent way.",
            "But probably the point my point here would be that I'm not sure.",
            "That I can say at this moment.",
            "What will lexicography, any kind of lexicography look like in 10 years time?",
            "So.",
            "I know that it will.",
            "Basically, deal with meaning and explaining meaning and related things to human users that I'm sure.",
            "But I'm sort of convinced that.",
            "Do the kind of lexicography we know now.",
            "Is based on.",
            "People were producing basically paper like dictionaries in.",
            "As I said, Codex format.",
            "And I think that future lexicography is still dealing with that thing.",
            "I I said before.",
            "We will have to break with that and it will be.",
            "Much more much closer to what?",
            "Computer science questions are.",
            "See what I mean?",
            "Um and I. I really can't give an answer.",
            "What I mean, this is what the conference is all about, I think.",
            "To to to think about as a group.",
            "What does that actually mean for lexicography, which is based on?",
            "Producing paper dictionaries.",
            "If I answered the question at all.",
            "Not really.",
            "We have another question.",
            "Very nice talk.",
            "Could you go back to the slide that had who am I at the bottom?",
            "Yeah, I'm."
        ],
        [
            "That one really reminded me of a talk.",
            "I was at the other day by Greg Griffin.",
            "Step, where the topic wasn't lexicography, but search.",
            "He works for search engine company because it the whole what he was telling us about what what's happening in search in what's becoming possible and what people are wanting to do was kind of the same list, but working as search engine cut 11 very interesting and critical addition to the bottom of the list would be where am I?",
            "Because now as often as not you know from GPS on mobile phones where the person is as well, which sort of makes it right.",
            "But then you know where you are to the nearest meter, so I can if I ask for restaurant it's going to tell me which restaurants are nearby and that seemed.",
            "So everyone says no, it isn't.",
            "That's also an answer to participants or response to that.",
            "Perhaps it's you know, lexicography dissolves and becomes less of a distinguisher less of a distinguishable subpart of search, because you know we, because we are asking all these quick, you know, search engine companies are asking all these questions and making quite a lot of leeway, have quite a lot of progress on them.",
            "We can do lots about what's in my reading.",
            "You know what we bought in Amazon, what we've what, we've, what webpages we've searched recently, and find the.",
            "Domain terms there.",
            "So yeah, so is is.",
            "Is lexicography anything in anything separate to general search or do the stuff that you know what you call the language database isn't that part of the general index at the search engine has to answer all these questions, yes?",
            "Well.",
            "Well, I was actually trying to make that that point, you know, because I think that if we don't, don't actually think about these questions.",
            "The language technology community will just.",
            "Use.",
            "Paper.",
            "Dictionaries and put them in their systems without thinking what if.",
            "The information they provide is OK.",
            "If something else could be done, and I think that this is actually the the future task of lexicographers how to.",
            "The last one."
        ],
        [
            "So.",
            "Can we be a small part of this big thing that will happen, but in the way that it's much smarter than at the moment?",
            "And I think that basically there are two questions which have to be answered in the future and one is the content and.",
            "Presentation.",
            "Because I think that if you offered a different kind of content to the language the college community, they would really accept it.",
            "They would like it, they would use it.",
            "But then just now using what they have.",
            "And.",
            "This is the point, I think that.",
            "No.",
            "This has to be done.",
            "I mean, it would be wise if we did that.",
            "OK, I think will there's one more OK last one.",
            "Simon, I just wanted to say that one of the views that I think is interesting for the future.",
            "The press in your presentation, something that a role that dictionaries have traditionally had, that E dictionaries presumably need to address is dictionaries as an authority in language.",
            "For centuries, dictionaries have been used as an authority in language, and although those of us trained in descriptive linguistics like to say that we really want to describe it.",
            "It's not very nice to prescribe because then you get all sorts of personal judgments, and that's not what we're trained to do as scientists.",
            "But the fact is, societies are organized.",
            "Societies use language in specific ways.",
            "An many of those specific ways or chart I to prescription.",
            "And so the way societies work, not necessarily correspond to just a description.",
            "If you base E dictionaries on the type of database in the huge amount of data that you would.",
            "Be able to have from social media.",
            "I mean, I have adolescent children.",
            "One has to see what they write to be horrified by use of language.",
            "In that context, the role of a dictionary is a language authority I think will change.",
            "That's something that I think we need to consider.",
            "And I didn't.",
            "I was wondering if you had any thoughts along those?",
            "Yes, yes, absolutely.",
            "I think that in the context that you're.",
            "You will you mentioned.",
            "For me, the really important.",
            "Um?",
            "Really important thing that happened to us when you know that.",
            "Wikipedia is basically banished from universities, or it was it still is.",
            "But there was this study probably you know about it.",
            "When Encyclopedia Britannica was compared to Wikipedia.",
            "In the sense that, let's see how many mistakes are in Wikipedia and how many mistakes are in Encyclopedia Britannica, and the judgment was, well, it's kind of the same so.",
            "What it means that the general public, which was actually.",
            "Relieved so I can actually use Wikipedia.",
            "It's the same as Britannica, but if the authority says you should not use it.",
            "OK, I'll just hide it.",
            "You know, I'll cite Britannica and use Wikipedia.",
            "And I think that we were looking at the same situation for dictionaries in the future and.",
            "But that's why I mentioned the filament problem because.",
            "The Wikipedia format is really successful.",
            "And dictionary is not good and all other formats or.",
            "Crowd sourced kind of dictionaries are actually not successful.",
            "And I think that.",
            "If you found.",
            "Um the right format so that.",
            "These kind of databases would get authority similar to Wikipedia.",
            "That would be enough.",
            "It it still means that maybe a dominent it would not be used as a.",
            "Big you know.",
            "Oxford Dictionary English Dictionary.",
            "But it would be used.",
            "Every day.",
            "And not as a dictionary aggregator, as dictionary.com and things, which basically I don't like.",
            "And maybe also other people.",
            "That is what my answer would be.",
            "OK, we will conclude at this point and I might have to go.",
            "We have a coffee break downstairs in the cafeteria and resume in half an hour.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think that's the topic of lexicography, and what will actually happen in the next decade with.",
                    "label": 0
                },
                {
                    "sent": "With dictionaries with electronic diction is is not.",
                    "label": 0
                },
                {
                    "sent": "The result is not very clear what will happen, so I'll just try to give a context with.",
                    "label": 0
                },
                {
                    "sent": "Special reference to the field I'm also involved in language technology and where the basic questions will be how E lexicography and natural language processing and language technologies can come a bit more together than they are now.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "I would like to continue with this.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Image.",
                    "label": 0
                },
                {
                    "sent": "Well, this was taken in 1970.",
                    "label": 0
                },
                {
                    "sent": "The film by the movie by Monty Python came out in 1970 and this is a well known joke about.",
                    "label": 0
                },
                {
                    "sent": "You know how Hungarians invaded England and well, John Cleese is the Hungarian trying to buy tobacco and he's using Hungarian English phrase book.",
                    "label": 0
                },
                {
                    "sent": "Because the publisher was really didn't know anything about finger in language.",
                    "label": 0
                },
                {
                    "sent": "He just put random sentences in it, and, well, John Cleese is saying sentences like your hovercraft is full of eels and things like that trying to buy the tobacco.",
                    "label": 0
                },
                {
                    "sent": "The point here is this was 40 years ago and it was quite common situation so you would use a phrase book.",
                    "label": 0
                },
                {
                    "sent": "Two well to buy tobacco or any kind of other kind of communication needs.",
                    "label": 0
                },
                {
                    "sent": "What would you do today?",
                    "label": 0
                },
                {
                    "sent": "You would probably use your phone and what would happen actually?",
                    "label": 0
                },
                {
                    "sent": "Would you show it to the tobacconist, and this is what I would like to go into in my presentation.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And what I'd like to use in the beginning is a paper which is called.",
                    "label": 0
                },
                {
                    "sent": "Vision paper.",
                    "label": 0
                },
                {
                    "sent": "Which was written within the project that the stock mentioned I'm involved in called Mintonette.",
                    "label": 0
                },
                {
                    "sent": "Myth and its meta is well written.",
                    "label": 0
                },
                {
                    "sent": "It is a network of excellence trying to.",
                    "label": 0
                },
                {
                    "sent": "Well, what we are saying is to forge multilingual Europe Technology Alliance, which means that.",
                    "label": 0
                },
                {
                    "sent": "We would like to bring together all day.",
                    "label": 0
                },
                {
                    "sent": "Industry partners from academia from everybody from government, different governments to see if something can be.",
                    "label": 0
                },
                {
                    "sent": "Done on European level.",
                    "label": 0
                },
                {
                    "sent": "Regarding the development of language technologies for all European languages, for the next decade, let's say and these visions are going quite to the extreme, and this is what I would like to.",
                    "label": 0
                },
                {
                    "sent": "Well, this is how I would like to us to think about for the next 45 minutes.",
                    "label": 0
                },
                {
                    "sent": "What if we go push things to the extreme?",
                    "label": 0
                },
                {
                    "sent": "In the field of language technologies and also.",
                    "label": 0
                },
                {
                    "sent": "Lexicography, that's what we'll look into bit later.",
                    "label": 0
                },
                {
                    "sent": "So visions are language, transparent web, and media.",
                    "label": 0
                },
                {
                    "sent": "What does it mean?",
                    "label": 0
                },
                {
                    "sent": "The first part of it is cross lingual information.",
                    "label": 0
                },
                {
                    "sent": "Access to the web, web, and to media in all languages.",
                    "label": 1
                },
                {
                    "sent": "So we would like to cover 200 to 1000 languages.",
                    "label": 0
                },
                {
                    "sent": "OK, that's a lot, but what we would like to do with them?",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "In which ever language you make a query, it doesn't matter, so you would get results from all other languages.",
                    "label": 0
                },
                {
                    "sent": "Also.",
                    "label": 0
                },
                {
                    "sent": "That's one thing, alternative question answering and natural language search.",
                    "label": 0
                },
                {
                    "sent": "It means that if you ask a question like I don't know.",
                    "label": 0
                },
                {
                    "sent": "When was?",
                    "label": 0
                },
                {
                    "sent": "When did man land on the moon or something like that?",
                    "label": 0
                },
                {
                    "sent": "He would get answers.",
                    "label": 0
                },
                {
                    "sent": "In the language you asked, but also gathering information from all other languages too.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 1
                },
                {
                    "sent": "Conversational agents, automatic translation of chats, tweets and emails.",
                    "label": 0
                },
                {
                    "sent": "The basic idea here is that.",
                    "label": 0
                },
                {
                    "sent": "With the success of.",
                    "label": 0
                },
                {
                    "sent": "Social networks and other new media.",
                    "label": 0
                },
                {
                    "sent": "People interact alot over the globe so.",
                    "label": 0
                },
                {
                    "sent": "Let's say that you want to contact a friend who doesn't speak.",
                    "label": 0
                },
                {
                    "sent": "Slovene doesn't speak English.",
                    "label": 0
                },
                {
                    "sent": "From Vietnam I don't know.",
                    "label": 0
                },
                {
                    "sent": "You could chat with him with or without a problem using machine translation systems and things like that.",
                    "label": 0
                },
                {
                    "sent": "Multimedia, multilanguage, subtitling this.",
                    "label": 1
                },
                {
                    "sent": "This is a good one so.",
                    "label": 0
                },
                {
                    "sent": "Subtitles for television programmes in real time.",
                    "label": 0
                },
                {
                    "sent": "Audio and video translations.",
                    "label": 0
                },
                {
                    "sent": "So let's say that I'm interested in.",
                    "label": 0
                },
                {
                    "sent": "Dutch elections and I want to watch TV, well, the news and I don't understand that at all.",
                    "label": 0
                },
                {
                    "sent": "So what I would do is just click and get subtitles in Slovene saying what the anchor is saying.",
                    "label": 0
                },
                {
                    "sent": "World News Reporter.",
                    "label": 0
                },
                {
                    "sent": "Science fiction, I know, but this is one of the visions.",
                    "label": 0
                },
                {
                    "sent": "In this paper, making documents understandable re phrasing complicated documents, automatic summarization and language generation, what does it mean?",
                    "label": 0
                },
                {
                    "sent": "It means that if you get.",
                    "label": 0
                },
                {
                    "sent": "Some things you don't really understand, like.",
                    "label": 0
                },
                {
                    "sent": "Legal papers you know when you read them and don't understand anything, so the computer would help you to say this contract is really bad for you, because this sentence is here and.",
                    "label": 0
                },
                {
                    "sent": "Well, I'm joking, but you understand what I mean also with.",
                    "label": 0
                },
                {
                    "sent": "Things like.",
                    "label": 0
                },
                {
                    "sent": "Prescription package inserts which which are also difficult to understand.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                },
                {
                    "sent": "This part making documents understandable, not to mention automatic summarization, which is actually happening right now, it's it's not, let's say, science.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fiction.",
                    "label": 0
                },
                {
                    "sent": "Vision two naturally inclusive interaction.",
                    "label": 0
                },
                {
                    "sent": "So what you have here is self learning context aware personalized agents with speech language and multi modal input and output abilities.",
                    "label": 1
                },
                {
                    "sent": "Well, what do you have to imagine?",
                    "label": 0
                },
                {
                    "sent": "Here is a robot walking around after you and you just say well.",
                    "label": 0
                },
                {
                    "sent": "I would really like to know.",
                    "label": 0
                },
                {
                    "sent": "When did I last time?",
                    "label": 0
                },
                {
                    "sent": "Check my email or something like that and.",
                    "label": 0
                },
                {
                    "sent": "He would.",
                    "label": 0
                },
                {
                    "sent": "She would well, he or she it would.",
                    "label": 0
                },
                {
                    "sent": "So you mean what you did?",
                    "label": 0
                },
                {
                    "sent": "No assistive applications, personalized speech technology systems for personal persons with reduced motor motor control sign, language recognition, synthesis, and translation.",
                    "label": 1
                },
                {
                    "sent": "This would help people who can't hear.",
                    "label": 0
                },
                {
                    "sent": "And so.",
                    "label": 0
                },
                {
                    "sent": "You would be actually without knowing the the sign language, you would be able to communicate with them.",
                    "label": 0
                },
                {
                    "sent": "This is the point here.",
                    "label": 0
                },
                {
                    "sent": "Crossing will be learning.",
                    "label": 0
                },
                {
                    "sent": "This is kind of known things like computer assisted language learning and things like that remote system for remote education.",
                    "label": 0
                },
                {
                    "sent": "Cross lingual meet meeting assistant.",
                    "label": 0
                },
                {
                    "sent": "This is also like this one.",
                    "label": 0
                },
                {
                    "sent": "The instant speech to speech translation is transformed.",
                    "label": 1
                },
                {
                    "sent": "Slides presentation handwritten notes into a preferred language mean it's automatically produced.",
                    "label": 1
                },
                {
                    "sent": "Video recordings automatically indexed to support voice searching, transcription, and translation.",
                    "label": 0
                },
                {
                    "sent": "Well, so I'm giving this talk and you could actually see what I'm talking in real time somewhere.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Vision 3.",
                    "label": 0
                },
                {
                    "sent": "Efficient information management.",
                    "label": 0
                },
                {
                    "sent": "Federated Multilingual Audio visual search.",
                    "label": 0
                },
                {
                    "sent": "Well, this is.",
                    "label": 0
                },
                {
                    "sent": "Taking this point to one step further.",
                    "label": 0
                },
                {
                    "sent": "Not only you could search for text, but also for audio and video materials so.",
                    "label": 0
                },
                {
                    "sent": "Where in the system would identify objects, persons, actions, speech recognition of ordinary untrained voices.",
                    "label": 1
                },
                {
                    "sent": "This is also not science fiction anymore, actually.",
                    "label": 0
                },
                {
                    "sent": "Semantic analysis of audio and video content.",
                    "label": 1
                },
                {
                    "sent": "Interesting for lexicography.",
                    "label": 0
                },
                {
                    "sent": "Personalized information assistant.",
                    "label": 0
                },
                {
                    "sent": "Filing documents, reformatting materials.",
                    "label": 1
                },
                {
                    "sent": "Copying information from one document to another.",
                    "label": 0
                },
                {
                    "sent": "Preparing standard letters and answering information requests.",
                    "label": 1
                },
                {
                    "sent": "It means that the machine would take some of the, let's say, low level tasks from you, and when you have a friend writing to you and you just have to say yes, I agree and things like that the machine could do it instead of you.",
                    "label": 0
                },
                {
                    "sent": "Not really, but.",
                    "label": 0
                },
                {
                    "sent": "The last one is the scary one.",
                    "label": 0
                },
                {
                    "sent": "Lifelogging capture every utterance in conversation during the day.",
                    "label": 0
                },
                {
                    "sent": "Semantically, structuring the information into meaningful bits and pieces.",
                    "label": 1
                },
                {
                    "sent": "So if you, let's say you forget something, what did I mean?",
                    "label": 0
                },
                {
                    "sent": "What did I say?",
                    "label": 0
                },
                {
                    "sent": "I don't know in the morning when we talked about this, so we could just track back and say.",
                    "label": 0
                },
                {
                    "sent": "It would be really difficult to argue, you know with people around you.",
                    "label": 0
                },
                {
                    "sent": "So this is it.",
                    "label": 0
                },
                {
                    "sent": "This is the vision paper of Mintonette language technology in the next decade, let's say.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There is another thing I want to.",
                    "label": 0
                },
                {
                    "sent": "Point out here, the world of digitization, so this is changing or developing, evolving quite rapidly in my opinion, because if you just take a look at some announcements in the last year, let's say.",
                    "label": 0
                },
                {
                    "sent": "In December, the 6th Google unveiled Google Books, the new service for buying reading digital books.",
                    "label": 1
                },
                {
                    "sent": "Cloud based.",
                    "label": 0
                },
                {
                    "sent": "What does that mean?",
                    "label": 0
                },
                {
                    "sent": "Actually, it means that your library would.",
                    "label": 0
                },
                {
                    "sent": "Transfer into.",
                    "label": 0
                },
                {
                    "sent": "The digital world.",
                    "label": 0
                },
                {
                    "sent": "So you could actually.",
                    "label": 0
                },
                {
                    "sent": "Walk around the world with the whole library.",
                    "label": 0
                },
                {
                    "sent": "Have on your bookshelves, in your pocket.",
                    "label": 0
                },
                {
                    "sent": "Amazon announced the bed.",
                    "label": 0
                },
                {
                    "sent": "It's now selling more Kindle E books than both hardcover and paperback book books combined.",
                    "label": 1
                },
                {
                    "sent": "Well, it means that the printed book is actually.",
                    "label": 0
                },
                {
                    "sent": "Going out in general, not just the dictionaries.",
                    "label": 0
                },
                {
                    "sent": "This one is interesting for people in education.",
                    "label": 0
                },
                {
                    "sent": "South Korea announced that it plans to replace textbooks and all paper in its schools with tablets by 2015.",
                    "label": 1
                },
                {
                    "sent": "And I plan to invest.",
                    "label": 0
                },
                {
                    "sent": "2 billion dollars in this.",
                    "label": 0
                },
                {
                    "sent": "Well, it may be, you know it has something to do with the fact that Samsung is.",
                    "label": 0
                },
                {
                    "sent": "Korean based.",
                    "label": 0
                },
                {
                    "sent": "Company, but anyway, I think that in the long run this is actually this.",
                    "label": 0
                },
                {
                    "sent": "This will actually happen.",
                    "label": 0
                },
                {
                    "sent": "And will be lost.",
                    "label": 0
                },
                {
                    "sent": "This last point is actually only two.",
                    "label": 0
                },
                {
                    "sent": "To emphasize that in a certain period of time we will have all libraries available.",
                    "label": 0
                },
                {
                    "sent": "In digital form, so all the all the books that were printed or written in previous centuries will be in digitized form sooner or later.",
                    "label": 0
                },
                {
                    "sent": "Now this is in my opinion, well, sort of the world we're going into.",
                    "label": 0
                },
                {
                    "sent": "Push the bit to the extreme, that's true, but.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If we think about what we.",
                    "label": 0
                },
                {
                    "sent": "What will happen with dictionaries in this kind of world?",
                    "label": 0
                },
                {
                    "sent": "And I would like to go through?",
                    "label": 0
                },
                {
                    "sent": "Three points here.",
                    "label": 0
                },
                {
                    "sent": "The first point is, well, let's say that.",
                    "label": 0
                },
                {
                    "sent": "Three thesis first is the text mining is a challenge in this world.",
                    "label": 1
                },
                {
                    "sent": "In this kind of world.",
                    "label": 0
                },
                {
                    "sent": "Content lexicographic content is a problem and presentation is even a bigger problem.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "If we imagine that we have.",
                    "label": 0
                },
                {
                    "sent": "All incredible amounts of information available.",
                    "label": 0
                },
                {
                    "sent": "So what is the current content of dictionaries, either in printed form or in electronic form?",
                    "label": 0
                },
                {
                    "sent": "We have definitions, collocations, examples, synonyms, many, many, many different things.",
                    "label": 1
                },
                {
                    "sent": "I don't.",
                    "label": 0
                },
                {
                    "sent": "Let's imagine that we can detect, extract, retrieve, select with all these beautiful machine learning and data mining mechanisms.",
                    "label": 1
                },
                {
                    "sent": "What the whole World Wide Web.",
                    "label": 0
                },
                {
                    "sent": "All the digital fast and also the digitized present the one which is not on the Internet on the World Wide Web already.",
                    "label": 0
                },
                {
                    "sent": "So this is what is available to us.",
                    "label": 0
                },
                {
                    "sent": "Let's say that it is maybe in a few years or.",
                    "label": 0
                },
                {
                    "sent": "Sometime.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's my opinion is that language causes a lively field, but narrow lexicographically relevant text mining activity is actually absent, at least on a large scale.",
                    "label": 1
                },
                {
                    "sent": "We have a lot of research going on, but if we think about something like Google N Grams where you.",
                    "label": 0
                },
                {
                    "sent": "Have the whole English web and you get N grams for the whole web.",
                    "label": 0
                },
                {
                    "sent": "This is the kind of.",
                    "label": 0
                },
                {
                    "sent": "Large scale activity I'm thinking about and not only for engrams, but for for on all the.",
                    "label": 0
                },
                {
                    "sent": "Older, this kind of information we have on this slide.",
                    "label": 1
                },
                {
                    "sent": "But apart from the investment required, which is, you know Google is very.",
                    "label": 0
                },
                {
                    "sent": "Big company.",
                    "label": 1
                },
                {
                    "sent": "I think that the reason maybe also the lack of consensus about the content and the presentation.",
                    "label": 0
                },
                {
                    "sent": "So the two points I would like to get to after.",
                    "label": 0
                },
                {
                    "sent": "I mentioned Wikipedia here because there is a really good consensus about the contents or the I mean the format of encyclopaedic.",
                    "label": 0
                },
                {
                    "sent": "Kind of information at the moment.",
                    "label": 0
                },
                {
                    "sent": "And there is also one other problem that.",
                    "label": 0
                },
                {
                    "sent": "In this world, Digital world information as such is cheap because we can.",
                    "label": 0
                },
                {
                    "sent": "Really, we have processing power we have.",
                    "label": 0
                },
                {
                    "sent": "Really powerful computers.",
                    "label": 0
                },
                {
                    "sent": "Meaning is actually expensive.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And what does that mean?",
                    "label": 0
                },
                {
                    "sent": "It is that dealing with meaning as such.",
                    "label": 0
                },
                {
                    "sent": "Is still an incredibly difficult task for computers.",
                    "label": 1
                },
                {
                    "sent": "This is the field of artificial intelligence.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Whenever you know you deal with something that makes sense to a human, it's very difficult for computers.",
                    "label": 0
                },
                {
                    "sent": "One of the basic tasks of lexicography has everything to do with meaning.",
                    "label": 1
                },
                {
                    "sent": "So this is another problem for.",
                    "label": 0
                },
                {
                    "sent": "Lexicography or data mining or text mining.",
                    "label": 0
                },
                {
                    "sent": "For the purposes of lexicography.",
                    "label": 0
                },
                {
                    "sent": "And there is another thing, what our task is to explain it to human users, not the computers.",
                    "label": 0
                },
                {
                    "sent": "Because language, technology, community is more interested in how computers can actually deal with meaning, not for well in the end for human users but more or less to how can computers talk to each other?",
                    "label": 0
                },
                {
                    "sent": "Let's say understand things they have stored.",
                    "label": 0
                },
                {
                    "sent": "And the question is.",
                    "label": 0
                },
                {
                    "sent": "If natural language person community is interested in meaning.",
                    "label": 0
                },
                {
                    "sent": "Which it which it is.",
                    "label": 0
                },
                {
                    "sent": "Is there a place for the lexicography in this massive effort?",
                    "label": 1
                },
                {
                    "sent": "What I mean is, I would just like to mention here IBM Watson briefly, it's a digression, but.",
                    "label": 0
                },
                {
                    "sent": "It's an interesting thing.",
                    "label": 0
                },
                {
                    "sent": "IBM has these liquid and great challenges and one was.",
                    "label": 0
                },
                {
                    "sent": "Producing the blue for chess.",
                    "label": 0
                },
                {
                    "sent": "Cheating in chess.",
                    "label": 0
                },
                {
                    "sent": "And this year.",
                    "label": 0
                },
                {
                    "sent": "They.",
                    "label": 0
                },
                {
                    "sent": "Arranged a competition in jeopardy where one of the competitors was on the computer they assembled, called Watson and the computer competed with two best players of Jeopardy.",
                    "label": 0
                },
                {
                    "sent": "You know the game.",
                    "label": 0
                },
                {
                    "sent": "Basically it's about question answering.",
                    "label": 0
                },
                {
                    "sent": "And actually the computer one.",
                    "label": 0
                },
                {
                    "sent": "Which is quite a scary thought.",
                    "label": 0
                },
                {
                    "sent": "And there all of them will actually incredibly good like you couldn't believe what those two.",
                    "label": 0
                },
                {
                    "sent": "People actually knew, and what the computer also could get from its system in so few seconds.",
                    "label": 0
                },
                {
                    "sent": "And well, to go bit further in this digression, I have to say this because we're only Slovenia.",
                    "label": 0
                },
                {
                    "sent": "All of them made a mistake in a question regarding Slovenia because the question was which of the former Yugoslav republics is now a member of EU European Union.",
                    "label": 0
                },
                {
                    "sent": "It seems like a very simple question, you know the members of European Union, you know them by heart and the computer should know them.",
                    "label": 0
                },
                {
                    "sent": "But.",
                    "label": 0
                },
                {
                    "sent": "The computer didn't want to answer.",
                    "label": 0
                },
                {
                    "sent": "Because it was not sure and one of the competitors answered wrongly.",
                    "label": 0
                },
                {
                    "sent": "So he said that it was Serbia.",
                    "label": 0
                },
                {
                    "sent": "Even the third one didn't want to answer.",
                    "label": 0
                },
                {
                    "sent": "This is how small the idea.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And if we move on with this question, so I would like to let's say present or invoke image of a jellyfish.",
                    "label": 0
                },
                {
                    "sent": "And why would I would like to do that because?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ordered in 2001.",
                    "label": 0
                },
                {
                    "sent": "There's a paper by John Sinclair and, well, this this is really a lot of text and I'll just read it aloud so you can see you'll understand what my point will be.",
                    "label": 0
                },
                {
                    "sent": "A few years ago and this was published in 2001, so it was, you know, in the 90s.",
                    "label": 0
                },
                {
                    "sent": "I found that the time was ripe to plan and you kind of dictionary one that would never exist on paper, but will be automatically almost automatic in itself, updating.",
                    "label": 1
                },
                {
                    "sent": "It would say to speak.",
                    "label": 1
                },
                {
                    "sent": "Float on top of corpus rather like jellyfish.",
                    "label": 1
                },
                {
                    "sent": "Standards come constantly sensing the state of the language, as well as reporting on the settled usage, meanings of the words and phrases of a language like normal dictionary, bus, the floating dictionary, when interrogated, dips into the corpus and checks this information, offering instances that match its criteria for the senses.",
                    "label": 1
                },
                {
                    "sent": "Also it explores further to see if there are any instances that conflict with the criteria and may signify development of a sense.",
                    "label": 0
                },
                {
                    "sent": "Or the emergence of a new usage altogether within the limits of its powers.",
                    "label": 0
                },
                {
                    "sent": "It organizes this evidence as a comment on the existing dictionary entry, so in.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "2001 I have this idea which involves really difficult.",
                    "label": 0
                },
                {
                    "sent": "Really difficult.",
                    "label": 0
                },
                {
                    "sent": "Language technology like information extraction, reporting on the settled usage.",
                    "label": 1
                },
                {
                    "sent": "Offering instances that matched its criteria, like large scale text mining.",
                    "label": 0
                },
                {
                    "sent": "Tender is constantly sensing this state of the language which says disambiguation really difficult match its criteria for it senses, signify development of a sense and also on the other side.",
                    "label": 1
                },
                {
                    "sent": "Text generation visualization.",
                    "label": 0
                },
                {
                    "sent": "But the problem is that.",
                    "label": 0
                },
                {
                    "sent": "All the technology used here is for a very, very specific purpose for a dictionary.",
                    "label": 0
                },
                {
                    "sent": "And probably This is why it never happened.",
                    "label": 0
                },
                {
                    "sent": "It's not the only reason, but.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If we.",
                    "label": 0
                },
                {
                    "sent": "Now we're talking about data mining, text mining, and things like that so.",
                    "label": 0
                },
                {
                    "sent": "If you take definition as a part of his well crucial part of dictionaries as a showcase here.",
                    "label": 1
                },
                {
                    "sent": "We can say that.",
                    "label": 0
                },
                {
                    "sent": "Could we extract definitions from?",
                    "label": 0
                },
                {
                    "sent": "If you have all these huge huge amounts of?",
                    "label": 1
                },
                {
                    "sent": "Data available can we extract definitions from textbooks from Wikipedia from general digitized texts?",
                    "label": 0
                },
                {
                    "sent": "And on the other hand.",
                    "label": 0
                },
                {
                    "sent": "Could we actually generate them using language technology?",
                    "label": 0
                },
                {
                    "sent": "With.",
                    "label": 0
                },
                {
                    "sent": "Basically, a paradigm shift from educating with difficult definitions.",
                    "label": 1
                },
                {
                    "sent": "Let's say that this is the.",
                    "label": 1
                },
                {
                    "sent": "Lexicographic tradition to explain with simple ones.",
                    "label": 0
                },
                {
                    "sent": "But the problem here is, in my opinion that we actually don't know what kind of definitions we want to show, how to present them, and I will talk about this also later in the presentation section, let's say.",
                    "label": 0
                },
                {
                    "sent": "When you know so.",
                    "label": 0
                },
                {
                    "sent": "Not all definitions are good for everybody, so maybe we should think about definitions.",
                    "label": 0
                },
                {
                    "sent": "Which are different for.",
                    "label": 0
                },
                {
                    "sent": "Language learners for native speakers and well.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Classic.",
                    "label": 0
                },
                {
                    "sent": "And the question is here, is it happening?",
                    "label": 0
                },
                {
                    "sent": "Actually it is.",
                    "label": 0
                },
                {
                    "sent": "I was in this workshop.",
                    "label": 0
                },
                {
                    "sent": "At.",
                    "label": 0
                },
                {
                    "sent": "Alright MLP recent advances in natural language processing.",
                    "label": 0
                },
                {
                    "sent": "In 2009, bots Bulgaria.",
                    "label": 0
                },
                {
                    "sent": "There is an international well.",
                    "label": 0
                },
                {
                    "sent": "It was actually called the first International Workshop on definition extraction.",
                    "label": 1
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "I'm pretty sure I was the only lexicographer there in the room.",
                    "label": 0
                },
                {
                    "sent": "And then I also ordered a.",
                    "label": 0
                },
                {
                    "sent": "Experiments well, two of them are just randomly chosen here, so it is happening.",
                    "label": 0
                },
                {
                    "sent": "Actually, definition extraction is.",
                    "label": 0
                },
                {
                    "sent": "Starting to.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But if we just take a look at this citation from one, well from an extract from one of the papers.",
                    "label": 0
                },
                {
                    "sent": "The task has proven useful in many research areas, including ontology, learning, relation extraction and question answering.",
                    "label": 1
                },
                {
                    "sent": "So when we're talking about.",
                    "label": 0
                },
                {
                    "sent": "Definition extraction in would be the field of natural language processing.",
                    "label": 0
                },
                {
                    "sent": "We are not talking about.",
                    "label": 0
                },
                {
                    "sent": "Human users in the end.",
                    "label": 0
                },
                {
                    "sent": "That's the problem here, I think.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is I would like to compete with.",
                    "label": 0
                },
                {
                    "sent": "Text mining issue.",
                    "label": 0
                },
                {
                    "sent": "With this point I made before that he lexicography has not experienced it through truly large scale text mining effort to create the whole range starting with definitions.",
                    "label": 1
                },
                {
                    "sent": "Of lexicographic content automatically or semi automatically.",
                    "label": 0
                },
                {
                    "sent": "And this is just well, it came to my mind.",
                    "label": 0
                },
                {
                    "sent": "So I just wrote it down.",
                    "label": 0
                },
                {
                    "sent": "Text my wish list.",
                    "label": 0
                },
                {
                    "sent": "So what was done will be there in the sense that we have all the digitized material available or will be available in time.",
                    "label": 1
                },
                {
                    "sent": "What is there can be extracted, so let's say that we can actually extract all the lexicographic data.",
                    "label": 0
                },
                {
                    "sent": "Let's say we can.",
                    "label": 0
                },
                {
                    "sent": "We don't know if can, but let's say we can't.",
                    "label": 1
                },
                {
                    "sent": "What is not there should be done.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                },
                {
                    "sent": "The hope for lexicographers, because some things you cannot do automatically.",
                    "label": 0
                },
                {
                    "sent": "What changes is interesting, so in this in the sense of Johnson class.",
                    "label": 0
                },
                {
                    "sent": "Paper.",
                    "label": 0
                },
                {
                    "sent": "If something changes in language.",
                    "label": 1
                },
                {
                    "sent": "We should be able to detect the changes.",
                    "label": 0
                },
                {
                    "sent": "And what changes can be detected?",
                    "label": 0
                },
                {
                    "sent": "Let's say that it can be now if we move.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To the content.",
                    "label": 0
                },
                {
                    "sent": "Do we know contents?",
                    "label": 0
                },
                {
                    "sent": "Do we know what we like to do with the contents?",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "One thing is that language technology fields actually started with.",
                    "label": 1
                },
                {
                    "sent": "Really.",
                    "label": 0
                },
                {
                    "sent": "With the hope that.",
                    "label": 0
                },
                {
                    "sent": "The data.",
                    "label": 0
                },
                {
                    "sent": "In in dictionaries could provide them with a lot of knowledge and it started to happen in the 80s and in the night as in now.",
                    "label": 0
                },
                {
                    "sent": "So it's an old thing.",
                    "label": 0
                },
                {
                    "sent": "So it starts at the other way around.",
                    "label": 0
                },
                {
                    "sent": "Dictionaries providing information for language technologies.",
                    "label": 1
                },
                {
                    "sent": "And you.",
                    "label": 0
                },
                {
                    "sent": "These all kinds of different linguistic information where.",
                    "label": 0
                },
                {
                    "sent": "Put into various formats which developed in time.",
                    "label": 0
                },
                {
                    "sent": "Through different projects like but all and simple and many many many more.",
                    "label": 0
                },
                {
                    "sent": "And now in 2008 let's say that we have some kind of standard lexical markup framework which includes information like more morphological information, syntactic semantics, multi word patterns, also machine readable dictionaries here.",
                    "label": 1
                },
                {
                    "sent": "So at the moment we are.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this stage that we can say OK, the format in language technology looks.",
                    "label": 0
                },
                {
                    "sent": "A bit like this, this is the.",
                    "label": 0
                },
                {
                    "sent": "Peak will probably know this one.",
                    "label": 0
                },
                {
                    "sent": "Diagram over the road net.",
                    "label": 0
                },
                {
                    "sent": "Lexical Markup Framework format and you can see here dictionary like information definition, sense, Lemma, sense axis.",
                    "label": 0
                },
                {
                    "sent": "I just wanted to show this.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "Picture to say that there is within language technologies.",
                    "label": 0
                },
                {
                    "sent": "There are formats which include lexicographic information.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the other is.",
                    "label": 0
                },
                {
                    "sent": "Text in code TI format.",
                    "label": 0
                },
                {
                    "sent": "Which is quite an old thing, but.",
                    "label": 0
                },
                {
                    "sent": "It also includes.",
                    "label": 0
                },
                {
                    "sent": "Dictionaries.",
                    "label": 0
                },
                {
                    "sent": "What is important here?",
                    "label": 0
                },
                {
                    "sent": "For human oriented, monolingual and multilingual dictionaries, and also for computational lexicon, Lang language processing software.",
                    "label": 1
                },
                {
                    "sent": "So TI tries to cover both parts, humans and computers.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the point I want to make here is that in my opinion, language technology, community now after all these years has a basic idea how to store verify various types of, let's say linguistic information.",
                    "label": 1
                },
                {
                    "sent": "And also the semantic web community.",
                    "label": 0
                },
                {
                    "sent": "A really huge community with.",
                    "label": 0
                },
                {
                    "sent": "RDF format and, well, a lot of them.",
                    "label": 0
                },
                {
                    "sent": "I won't go through that.",
                    "label": 0
                },
                {
                    "sent": "But also, in my opinion, standardization in human oriented dictionary encoding was never really successful.",
                    "label": 1
                },
                {
                    "sent": "XML, yes, definitely we all have dictionaries act in XML but not T or any other standard format.",
                    "label": 0
                },
                {
                    "sent": "The question I would like to.",
                    "label": 0
                },
                {
                    "sent": "Post here is without an answer.",
                    "label": 0
                },
                {
                    "sent": "Actually, if different types of looks, graphic information intended for human users will have to know each other.",
                    "label": 1
                },
                {
                    "sent": "Will the format be dictated by language technology standards?",
                    "label": 0
                },
                {
                    "sent": "And my answer would be at the moment, probably yes, and this is, well, something to think about.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Because when I was at Eric Conference, the language resources and evaluation conferences in conference in Malta in 2010, I just counted how many papers dealt with.",
                    "label": 0
                },
                {
                    "sent": "Well, from the point of view of the format.",
                    "label": 0
                },
                {
                    "sent": "And there were 16 papers.",
                    "label": 0
                },
                {
                    "sent": "Data mining.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia Prove 17 papers.",
                    "label": 0
                },
                {
                    "sent": "Doing something would will net and allow papers.",
                    "label": 0
                },
                {
                    "sent": "Doing something with frame it.",
                    "label": 0
                },
                {
                    "sent": "Which means that.",
                    "label": 0
                },
                {
                    "sent": "Natural language processing community really likes these three formats.",
                    "label": 0
                },
                {
                    "sent": "And well, my opinion is this is just.",
                    "label": 0
                },
                {
                    "sent": "It's not really relevant that the NLP community thinks that what matters for now is informatics for verbs.",
                    "label": 0
                },
                {
                    "sent": "They would like to bring them together in this way.",
                    "label": 0
                },
                {
                    "sent": "And the point here is the important point is that Wikipedia in Word net.",
                    "label": 0
                },
                {
                    "sent": "But actually used by both sides by human users and NLP community.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now this is the format.",
                    "label": 0
                },
                {
                    "sent": "What about the information?",
                    "label": 0
                },
                {
                    "sent": "How do you know that what we now know is E dictionaries are actually liked in the Facebook sense?",
                    "label": 0
                },
                {
                    "sent": "Where are?",
                    "label": 0
                },
                {
                    "sent": "A lot of excellent studies.",
                    "label": 0
                },
                {
                    "sent": "Love dictionary use a lot of them really good.",
                    "label": 0
                },
                {
                    "sent": "I really like that.",
                    "label": 0
                },
                {
                    "sent": "Assessment of usability.",
                    "label": 0
                },
                {
                    "sent": "Actually from taking editions from different different point of view.",
                    "label": 0
                },
                {
                    "sent": "A paper about would hide and I tracking.",
                    "label": 0
                },
                {
                    "sent": "Paper on our tracking by Yukio Tono in this year's first.",
                    "label": 0
                },
                {
                    "sent": "Yeah, Journal and we could.",
                    "label": 0
                },
                {
                    "sent": "Also I didn't find any.",
                    "label": 0
                },
                {
                    "sent": "Studies, maybe I missed them somehow, but.",
                    "label": 0
                },
                {
                    "sent": "How?",
                    "label": 0
                },
                {
                    "sent": "Electronic dictionaries are used by tracking mouse movement keystroke and.",
                    "label": 1
                },
                {
                    "sent": "Other things we could do?",
                    "label": 0
                },
                {
                    "sent": "And also monitoring web log files.",
                    "label": 1
                },
                {
                    "sent": "This is known, but in my opinion the problem is that these activities are performed on the existing type of links.",
                    "label": 1
                },
                {
                    "sent": "Graphical information.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "To use them, Monty Python.",
                    "label": 0
                },
                {
                    "sent": "Is there something else so our user users actually able to describe?",
                    "label": 0
                },
                {
                    "sent": "What kind of information they need about language?",
                    "label": 0
                },
                {
                    "sent": "When do we have the mechanisms to identify those these needs?",
                    "label": 0
                },
                {
                    "sent": "How about new media, social networks, things like that and I would just like to ask.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As an example, I would like to say a few words about.",
                    "label": 0
                },
                {
                    "sent": "When part of the project Estok mentions at the beginning, so one of the things we have to develop is sort of Internet style guides portal where the user could just.",
                    "label": 0
                },
                {
                    "sent": "Come to the portal and say I would like to.",
                    "label": 0
                },
                {
                    "sent": "Know what this word means?",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "Spelled correctly in this way or that way, and things like that, so it would be a kind of language information hotspot for Slovene, obviously.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "We will try to explain more difficult parts of language for like public in so in in easy kind of.",
                    "label": 1
                },
                {
                    "sent": "Wait?",
                    "label": 1
                },
                {
                    "sent": "Then we would also provide links to corporate at the dictionaries to lexical databases.",
                    "label": 0
                },
                {
                    "sent": "Lexicons, and all the things we have and to see what we might expect from the users.",
                    "label": 0
                },
                {
                    "sent": "We web code forms on websites which are dedicated to living language issues analyzed about 1500 questions.",
                    "label": 1
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Discussions.",
                    "label": 0
                },
                {
                    "sent": "And this is what we found out at about 1/3.",
                    "label": 0
                },
                {
                    "sent": "Will.",
                    "label": 0
                },
                {
                    "sent": "Actually related to orthography.",
                    "label": 0
                },
                {
                    "sent": "16% to morphology.",
                    "label": 0
                },
                {
                    "sent": "It's only 1/4 two.",
                    "label": 0
                },
                {
                    "sent": "The type of information that a dictionary would provide.",
                    "label": 1
                },
                {
                    "sent": "It's true, that's living.",
                    "label": 0
                },
                {
                    "sent": "Morphology and orthography is very difficult.",
                    "label": 0
                },
                {
                    "sent": "You can bet this these figures would be different for different languages, but my main point here is that people just ask about things that they're bothered with.",
                    "label": 0
                },
                {
                    "sent": "They don't.",
                    "label": 0
                },
                {
                    "sent": "Think about, we will find this in the dictionary.",
                    "label": 0
                },
                {
                    "sent": "Will I find this in a group somewhere?",
                    "label": 0
                },
                {
                    "sent": "They just want to get the.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And as quickly as possible.",
                    "label": 0
                },
                {
                    "sent": "And this is my summary, can we expect that digital natures will have the patience to distinguish between different types of language information containers like dictionaries like?",
                    "label": 1
                },
                {
                    "sent": "Textbooks and things like that, no, this is.",
                    "label": 0
                },
                {
                    "sent": "My definite answer.",
                    "label": 1
                },
                {
                    "sent": "Does that mean that this time to think about the more universal information database providing different kind of language data?",
                    "label": 1
                },
                {
                    "sent": "Yes, and not just different kind but.",
                    "label": 0
                },
                {
                    "sent": "All of them and how much time do you have to provide this information in the digital world?",
                    "label": 0
                },
                {
                    "sent": "Not much measured in seconds.",
                    "label": 0
                },
                {
                    "sent": "Some studies have shown that we have about 20 seconds maximum, but it also depends on the urgency of this need.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's do the last point.",
                    "label": 0
                },
                {
                    "sent": "What about presentation?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We know that there is a really good good.",
                    "label": 0
                },
                {
                    "sent": "Formats the codecs formats which was good for 1500 years and a lot of very very useful devices.",
                    "label": 0
                },
                {
                    "sent": "Will invented in time like Alphabetization, Thumbin, Dixing sense numbering different kind of typography and layout menus and signposts so that people could get to the information they need as quickly as possible.",
                    "label": 0
                },
                {
                    "sent": "And I remember when I started to.",
                    "label": 0
                },
                {
                    "sent": "Well, I studied translation and it was really a success.",
                    "label": 0
                },
                {
                    "sent": "You know when you just grab the dictionary and you opened it in exactly the right page, you remember that some of you do.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "But still.",
                    "label": 0
                },
                {
                    "sent": "User is left to his or her book selection, so we first have to find the book you need.",
                    "label": 1
                },
                {
                    "sent": "And browsing skills to find the information.",
                    "label": 1
                },
                {
                    "sent": "And what about the dictionary?",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have a lot of very useful new devices like handling, search, fulltext search, advanced search, contextualized search, and.",
                    "label": 1
                },
                {
                    "sent": "Multiple choice interfaces and things like that, but still.",
                    "label": 1
                },
                {
                    "sent": "User is users are left to.",
                    "label": 0
                },
                {
                    "sent": "They have to select the right database.",
                    "label": 0
                },
                {
                    "sent": "And they depend on their searching skills because we know that a lot of people don't use.",
                    "label": 0
                },
                {
                    "sent": "Like Fulltext search or advanstar trying anything like that.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Again, now for something completely different.",
                    "label": 0
                },
                {
                    "sent": "What if universe this situation and take all the burden on our shoulders and say that?",
                    "label": 0
                },
                {
                    "sent": "The user just has to express the need for information about the language problem and we have to guess everything else, everything else.",
                    "label": 1
                },
                {
                    "sent": "And this is what context.",
                    "label": 0
                },
                {
                    "sent": "Awareness in the first in the first slides is.",
                    "label": 0
                },
                {
                    "sent": "So the system the computer knows already knows things like.",
                    "label": 0
                },
                {
                    "sent": "What am I doing?",
                    "label": 0
                },
                {
                    "sent": "Am I traveling, studying, browsing web?",
                    "label": 1
                },
                {
                    "sent": "What am I reading domain like sports history, finance, physics?",
                    "label": 0
                },
                {
                    "sent": "Who am I actually?",
                    "label": 0
                },
                {
                    "sent": "I'm slowly speaker learner French.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "You know?",
                    "label": 0
                },
                {
                    "sent": "All true there.",
                    "label": 0
                },
                {
                    "sent": "Now spend a lot of time on Facebook and Can you imagine in 20 years 10 years time for 20 years time.",
                    "label": 0
                },
                {
                    "sent": "What kind of information will Facebook have on them or about them?",
                    "label": 0
                },
                {
                    "sent": "Because they can track actually everything they do so.",
                    "label": 0
                },
                {
                    "sent": "But we're probably entering that kind of world.",
                    "label": 0
                },
                {
                    "sent": "And this, I think also reflects on lexicography.",
                    "label": 0
                },
                {
                    "sent": "So we have to think about.",
                    "label": 0
                },
                {
                    "sent": "The information you have about the user and use it.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And how would the user expect Express delete?",
                    "label": 0
                },
                {
                    "sent": "Bye.",
                    "label": 0
                },
                {
                    "sent": "Question answering conversational agents mentioned indovision paper in the first slide and input mode would not be just mouse and keyboard but also voice recognition, OCR, which we've seen in every software.",
                    "label": 1
                },
                {
                    "sent": "And the gesture gestures.",
                    "label": 0
                },
                {
                    "sent": "Would Microsoft Connect programs and all?",
                    "label": 0
                },
                {
                    "sent": "But we are not just limited to mouse and keyboard anymore and will not be.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the future.",
                    "label": 0
                },
                {
                    "sent": "So the lead will be expressed.",
                    "label": 0
                },
                {
                    "sent": "Like this?",
                    "label": 0
                },
                {
                    "sent": "Somebody type.",
                    "label": 0
                },
                {
                    "sent": "A question like what is the population of Canada?",
                    "label": 0
                },
                {
                    "sent": "The computer gives the answer.",
                    "label": 0
                },
                {
                    "sent": "Now this is 1 mode in my opinion.",
                    "label": 0
                },
                {
                    "sent": "And I call it the question answering mode so.",
                    "label": 0
                },
                {
                    "sent": "Somebody just expresses lexicographic kind of need, and the system knows everything about him her.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Gives the exactly correct kind of information.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the other is.",
                    "label": 0
                },
                {
                    "sent": "The browsing and visualization mode, because here we can also expect that.",
                    "label": 0
                },
                {
                    "sent": "Will not have just the immediate need for some kind of lexicographic information, but people will have the need to to just browse.",
                    "label": 0
                },
                {
                    "sent": "For that type of information and.",
                    "label": 0
                },
                {
                    "sent": "My opinion is that what will happen in the future is a 3 dimensional model of related information about language.",
                    "label": 1
                },
                {
                    "sent": "We've seen some of that with.",
                    "label": 0
                },
                {
                    "sent": "Wordnet visualizations and it's.",
                    "label": 0
                },
                {
                    "sent": "Quite well we see I think that is.",
                    "label": 0
                },
                {
                    "sent": "Presentation also in this conference about that.",
                    "label": 0
                },
                {
                    "sent": "But this could go much, much, much further.",
                    "label": 0
                },
                {
                    "sent": "Not just work, but all kinds of renovation and also combined with all other kind of information.",
                    "label": 1
                },
                {
                    "sent": "And well, if I just give a metaphor or image.",
                    "label": 0
                },
                {
                    "sent": "What my opinion is that it should be something like Google Earth.",
                    "label": 0
                },
                {
                    "sent": "You know we can just watch the Earth as such and now the.",
                    "label": 0
                },
                {
                    "sent": "Well, Google has announced that they will also.",
                    "label": 0
                },
                {
                    "sent": "Make available that you enter the building, not just streets, but you go along the street and then enter some building and probably watch.",
                    "label": 0
                },
                {
                    "sent": "A movie.",
                    "label": 0
                },
                {
                    "sent": "And go out from the cinema.",
                    "label": 0
                },
                {
                    "sent": "So language information should be available in this kind of way.",
                    "label": 0
                },
                {
                    "sent": "So where I can just go around the world of this in that language?",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And my conclusions are.",
                    "label": 0
                },
                {
                    "sent": "A new interesting language.",
                    "label": 0
                },
                {
                    "sent": "Technology is emerging.",
                    "label": 0
                },
                {
                    "sent": "I think related to the requirements of the Information Society and the other point is that.",
                    "label": 1
                },
                {
                    "sent": "European Union seems to be preparing a coordinated action to get back on track after the success of North American companies.",
                    "label": 1
                },
                {
                    "sent": "This mainly relates to machine translation, but all other things also.",
                    "label": 1
                },
                {
                    "sent": "Hence the question for will the final question is that is it possible to jump on this bandwagon with the conceptual break with tradition in lexicography?",
                    "label": 0
                },
                {
                    "sent": "Taking into account all the things that I emphasized in the talk, and that's all.",
                    "label": 0
                },
                {
                    "sent": "I liked your presentation very much.",
                    "label": 0
                },
                {
                    "sent": "Perhaps as you spoke about the future possibilities today and about the future possibilities to get data, perhaps you forgot the possibility to read the sorts, as in new experiments, But that's not my question.",
                    "label": 0
                },
                {
                    "sent": "My question has to do with your.",
                    "label": 0
                },
                {
                    "sent": "General proposal and discussion about E lexicography.",
                    "label": 0
                },
                {
                    "sent": "I'm not so sure that when you use E lexicography in your paper that you mean it because you were in my impression speaking about a database, and what you can put in a database, and if you have a database, you can present your data in an E dictionary.",
                    "label": 0
                },
                {
                    "sent": "You can set it up.",
                    "label": 0
                },
                {
                    "sent": "Printed dictionary across only a part of the database.",
                    "label": 0
                },
                {
                    "sent": "Or you can send it in another kind of information tool.",
                    "label": 0
                },
                {
                    "sent": "Therefore perhaps you understand by E. Lexicography something else, as I do.",
                    "label": 0
                },
                {
                    "sent": "I had the impression that they often, when you used electrical coffee, you mean lexicography.",
                    "label": 0
                },
                {
                    "sent": "I agree that I used the lexicography in North in, let's say, not very consistent way.",
                    "label": 0
                },
                {
                    "sent": "But probably the point my point here would be that I'm not sure.",
                    "label": 0
                },
                {
                    "sent": "That I can say at this moment.",
                    "label": 0
                },
                {
                    "sent": "What will lexicography, any kind of lexicography look like in 10 years time?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I know that it will.",
                    "label": 0
                },
                {
                    "sent": "Basically, deal with meaning and explaining meaning and related things to human users that I'm sure.",
                    "label": 0
                },
                {
                    "sent": "But I'm sort of convinced that.",
                    "label": 0
                },
                {
                    "sent": "Do the kind of lexicography we know now.",
                    "label": 0
                },
                {
                    "sent": "Is based on.",
                    "label": 0
                },
                {
                    "sent": "People were producing basically paper like dictionaries in.",
                    "label": 0
                },
                {
                    "sent": "As I said, Codex format.",
                    "label": 0
                },
                {
                    "sent": "And I think that future lexicography is still dealing with that thing.",
                    "label": 0
                },
                {
                    "sent": "I I said before.",
                    "label": 0
                },
                {
                    "sent": "We will have to break with that and it will be.",
                    "label": 0
                },
                {
                    "sent": "Much more much closer to what?",
                    "label": 0
                },
                {
                    "sent": "Computer science questions are.",
                    "label": 0
                },
                {
                    "sent": "See what I mean?",
                    "label": 0
                },
                {
                    "sent": "Um and I. I really can't give an answer.",
                    "label": 0
                },
                {
                    "sent": "What I mean, this is what the conference is all about, I think.",
                    "label": 0
                },
                {
                    "sent": "To to to think about as a group.",
                    "label": 0
                },
                {
                    "sent": "What does that actually mean for lexicography, which is based on?",
                    "label": 0
                },
                {
                    "sent": "Producing paper dictionaries.",
                    "label": 0
                },
                {
                    "sent": "If I answered the question at all.",
                    "label": 0
                },
                {
                    "sent": "Not really.",
                    "label": 0
                },
                {
                    "sent": "We have another question.",
                    "label": 0
                },
                {
                    "sent": "Very nice talk.",
                    "label": 0
                },
                {
                    "sent": "Could you go back to the slide that had who am I at the bottom?",
                    "label": 0
                },
                {
                    "sent": "Yeah, I'm.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That one really reminded me of a talk.",
                    "label": 0
                },
                {
                    "sent": "I was at the other day by Greg Griffin.",
                    "label": 0
                },
                {
                    "sent": "Step, where the topic wasn't lexicography, but search.",
                    "label": 0
                },
                {
                    "sent": "He works for search engine company because it the whole what he was telling us about what what's happening in search in what's becoming possible and what people are wanting to do was kind of the same list, but working as search engine cut 11 very interesting and critical addition to the bottom of the list would be where am I?",
                    "label": 0
                },
                {
                    "sent": "Because now as often as not you know from GPS on mobile phones where the person is as well, which sort of makes it right.",
                    "label": 0
                },
                {
                    "sent": "But then you know where you are to the nearest meter, so I can if I ask for restaurant it's going to tell me which restaurants are nearby and that seemed.",
                    "label": 0
                },
                {
                    "sent": "So everyone says no, it isn't.",
                    "label": 0
                },
                {
                    "sent": "That's also an answer to participants or response to that.",
                    "label": 0
                },
                {
                    "sent": "Perhaps it's you know, lexicography dissolves and becomes less of a distinguisher less of a distinguishable subpart of search, because you know we, because we are asking all these quick, you know, search engine companies are asking all these questions and making quite a lot of leeway, have quite a lot of progress on them.",
                    "label": 0
                },
                {
                    "sent": "We can do lots about what's in my reading.",
                    "label": 1
                },
                {
                    "sent": "You know what we bought in Amazon, what we've what, we've, what webpages we've searched recently, and find the.",
                    "label": 0
                },
                {
                    "sent": "Domain terms there.",
                    "label": 0
                },
                {
                    "sent": "So yeah, so is is.",
                    "label": 0
                },
                {
                    "sent": "Is lexicography anything in anything separate to general search or do the stuff that you know what you call the language database isn't that part of the general index at the search engine has to answer all these questions, yes?",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "Well, I was actually trying to make that that point, you know, because I think that if we don't, don't actually think about these questions.",
                    "label": 0
                },
                {
                    "sent": "The language technology community will just.",
                    "label": 0
                },
                {
                    "sent": "Use.",
                    "label": 0
                },
                {
                    "sent": "Paper.",
                    "label": 0
                },
                {
                    "sent": "Dictionaries and put them in their systems without thinking what if.",
                    "label": 1
                },
                {
                    "sent": "The information they provide is OK.",
                    "label": 0
                },
                {
                    "sent": "If something else could be done, and I think that this is actually the the future task of lexicographers how to.",
                    "label": 0
                },
                {
                    "sent": "The last one.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Can we be a small part of this big thing that will happen, but in the way that it's much smarter than at the moment?",
                    "label": 0
                },
                {
                    "sent": "And I think that basically there are two questions which have to be answered in the future and one is the content and.",
                    "label": 0
                },
                {
                    "sent": "Presentation.",
                    "label": 0
                },
                {
                    "sent": "Because I think that if you offered a different kind of content to the language the college community, they would really accept it.",
                    "label": 1
                },
                {
                    "sent": "They would like it, they would use it.",
                    "label": 0
                },
                {
                    "sent": "But then just now using what they have.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "This is the point, I think that.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "This has to be done.",
                    "label": 1
                },
                {
                    "sent": "I mean, it would be wise if we did that.",
                    "label": 1
                },
                {
                    "sent": "OK, I think will there's one more OK last one.",
                    "label": 1
                },
                {
                    "sent": "Simon, I just wanted to say that one of the views that I think is interesting for the future.",
                    "label": 0
                },
                {
                    "sent": "The press in your presentation, something that a role that dictionaries have traditionally had, that E dictionaries presumably need to address is dictionaries as an authority in language.",
                    "label": 0
                },
                {
                    "sent": "For centuries, dictionaries have been used as an authority in language, and although those of us trained in descriptive linguistics like to say that we really want to describe it.",
                    "label": 0
                },
                {
                    "sent": "It's not very nice to prescribe because then you get all sorts of personal judgments, and that's not what we're trained to do as scientists.",
                    "label": 0
                },
                {
                    "sent": "But the fact is, societies are organized.",
                    "label": 0
                },
                {
                    "sent": "Societies use language in specific ways.",
                    "label": 0
                },
                {
                    "sent": "An many of those specific ways or chart I to prescription.",
                    "label": 1
                },
                {
                    "sent": "And so the way societies work, not necessarily correspond to just a description.",
                    "label": 0
                },
                {
                    "sent": "If you base E dictionaries on the type of database in the huge amount of data that you would.",
                    "label": 0
                },
                {
                    "sent": "Be able to have from social media.",
                    "label": 0
                },
                {
                    "sent": "I mean, I have adolescent children.",
                    "label": 0
                },
                {
                    "sent": "One has to see what they write to be horrified by use of language.",
                    "label": 0
                },
                {
                    "sent": "In that context, the role of a dictionary is a language authority I think will change.",
                    "label": 0
                },
                {
                    "sent": "That's something that I think we need to consider.",
                    "label": 0
                },
                {
                    "sent": "And I didn't.",
                    "label": 0
                },
                {
                    "sent": "I was wondering if you had any thoughts along those?",
                    "label": 0
                },
                {
                    "sent": "Yes, yes, absolutely.",
                    "label": 0
                },
                {
                    "sent": "I think that in the context that you're.",
                    "label": 0
                },
                {
                    "sent": "You will you mentioned.",
                    "label": 0
                },
                {
                    "sent": "For me, the really important.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Really important thing that happened to us when you know that.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia is basically banished from universities, or it was it still is.",
                    "label": 0
                },
                {
                    "sent": "But there was this study probably you know about it.",
                    "label": 0
                },
                {
                    "sent": "When Encyclopedia Britannica was compared to Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "In the sense that, let's see how many mistakes are in Wikipedia and how many mistakes are in Encyclopedia Britannica, and the judgment was, well, it's kind of the same so.",
                    "label": 0
                },
                {
                    "sent": "What it means that the general public, which was actually.",
                    "label": 0
                },
                {
                    "sent": "Relieved so I can actually use Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "It's the same as Britannica, but if the authority says you should not use it.",
                    "label": 0
                },
                {
                    "sent": "OK, I'll just hide it.",
                    "label": 0
                },
                {
                    "sent": "You know, I'll cite Britannica and use Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "And I think that we were looking at the same situation for dictionaries in the future and.",
                    "label": 0
                },
                {
                    "sent": "But that's why I mentioned the filament problem because.",
                    "label": 0
                },
                {
                    "sent": "The Wikipedia format is really successful.",
                    "label": 0
                },
                {
                    "sent": "And dictionary is not good and all other formats or.",
                    "label": 0
                },
                {
                    "sent": "Crowd sourced kind of dictionaries are actually not successful.",
                    "label": 0
                },
                {
                    "sent": "And I think that.",
                    "label": 0
                },
                {
                    "sent": "If you found.",
                    "label": 0
                },
                {
                    "sent": "Um the right format so that.",
                    "label": 0
                },
                {
                    "sent": "These kind of databases would get authority similar to Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "That would be enough.",
                    "label": 0
                },
                {
                    "sent": "It it still means that maybe a dominent it would not be used as a.",
                    "label": 0
                },
                {
                    "sent": "Big you know.",
                    "label": 0
                },
                {
                    "sent": "Oxford Dictionary English Dictionary.",
                    "label": 0
                },
                {
                    "sent": "But it would be used.",
                    "label": 0
                },
                {
                    "sent": "Every day.",
                    "label": 0
                },
                {
                    "sent": "And not as a dictionary aggregator, as dictionary.com and things, which basically I don't like.",
                    "label": 0
                },
                {
                    "sent": "And maybe also other people.",
                    "label": 0
                },
                {
                    "sent": "That is what my answer would be.",
                    "label": 0
                },
                {
                    "sent": "OK, we will conclude at this point and I might have to go.",
                    "label": 0
                },
                {
                    "sent": "We have a coffee break downstairs in the cafeteria and resume in half an hour.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}