{
    "id": "edgve3ob2pyy5dhluy6h5uplpnvogqu3",
    "title": "Suggesting Friends Using the Implicit Social Graph",
    "info": {
        "author": [
            "Maayan Roth, Google, Inc."
        ],
        "published": "Oct. 1, 2010",
        "recorded": "July 2010",
        "category": [
            "Top->Computer Science->Machine Learning->Pattern Recognition",
            "Top->Computer Science->Machine Learning->Clustering"
        ]
    },
    "url": "http://videolectures.net/kdd2010_roth_sfui/",
    "segmentation": [
        [
            "So this is work that was done in collaboration with my colleagues at the Googles Israel already center, but motivation."
        ],
        [
            "My work is based on some research that was done by Paul Adams, whose user experience researcher at Google and what he did was he took a bunch of users in The Cave, them a list of all of our Contacts and the aspect to point each contact into a group, and he let the users creating groups and labels of however they wanted, and they created groups like Family in college friends, but we found is that by and large every single person created between three and five groups, and these groups didn't really have a lot of interest of overlaps.",
            "The kryptonite affected.",
            "And this is true across cultures with Alex very, very compelling.",
            "But now if you're in the business of creating tools for electronic communication like we are in, this is not surprising for you because we know that user is interacting groups.",
            "So if you're sharing photo album or planning parties, you probably have a very specific group of people in mind that you have hard data that is in communication here and now.",
            "Obviously we want to create tools that can help users create persistent contact groups so that they can make this interaction, because here for them.",
            "So the next time you're sharing the photo album with your family, you can just click on family instead of going in and doing all the people one after the other.",
            "But the problem is that even though we've created these tools and other people have created these tools, by and large, nobody uses them.",
            "And when we ask for using, why not?",
            "They say things like creating groups, video service, time consuming on something that they don't usually point out that this is actually the case is that the group change overtime so the work that you've done to create your family group today next week when you want to share your photo album.",
            "That report necessarily contain everyone that you wanted to contain all of the wrinkles and wasted."
        ],
        [
            "So this is like researchers to become interested in the problem of automatically detecting leader Contacts on.",
            "So instead of asking the users to go and create all these groups manually, we can help them by identifying who the groups are in their social network.",
            "Now the previous approaches that people have taken to solving this problem is one of them.",
            "Is graph clustering on the global social graph.",
            "So looking at the graph with everyone is interacting with everyone else and saying that users are likely come along the same group if they have many friends in common.",
            "Um, another approach that has has been done in the past is looking at content analysis.",
            "So if you're exchanging a lot of emails with some people and you talk about your soccer team, that is likely that you belong to the same software team and we can say this is a group that exists in any social network."
        ],
        [
            "The wait time is slightly different approach which is looking at identifying groups from communication patterns, so the insight that led us to this was noticing that email is inherently a group communication medium.",
            "So people often send email to more than once again and the recipient list with their email isn't very carefully curated, so in fact the users are doing a lot of work of identifying groups of people when they send an email and Contacts from different groups are unlikely to appear as recipients in the same you know.",
            "So for example, if I was to take my inbox and on one side and try to categorize all the messages and then once I put.",
            "All emails from my coworkers on the other side put all the emails from my family.",
            "I would end up with a lot of messages in the middle that contain met Mail that was to both my coworkers and my family, because in fact users interactions are implicitly doing the work with clustering their Contacts into groups."
        ],
        [
            "Given this insight, we built the implicit social graph and Mrs Social Graph.",
            "It's formed by users interactions with their Contacts so different from explicit social graphs in which user says this person is my friend.",
            "This person is my friend.",
            "This person is my friend, but instead anytime the two users are interacting with each other, in our case by sending an email so that forms an edge between the two of them.",
            "So we extract this graph from email headers.",
            "We don't look at contents at all, and what forms is a weighted directed hypergraph?",
            "The reason if the hypergraph is exactly because of this group nature?",
            "Of the communication.",
            "So each email forms a hyper edge in the graph.",
            "We call this implicit group.",
            "In our work, we've looked at the egocentric graph, so this is the graph that for each user is centered on that user.",
            "It only takes into account interactions in which he was a direct participants.",
            "So people who he's actually sent and received emails from the primary business.",
            "We did those things to address privacy concerns, so that for each user we're analyzing only his inbox.",
            "We're only showing him information that is based on an interaction that he said part of.",
            "And we don't run the risk of exploding.",
            "Kind of friend of friend information, telling people things that they're not supposed to know."
        ],
        [
            "Now each user can interact with hundreds of groups or possibly thousands of Contacts, but many of these attractions are sporadic when they happen once, and they don't really carry a lot of weight and tell you very much about who is important to the user, and so when we're analyzing the you guys graph that it's very important to identify the context in groups that are most important to the user, and we do this by noticing 3 features that we can we can extract from users, email interactions that influence group importance.",
            "So first of all, certain portions depends on the frequency and interaction, and this one is fairly obvious.",
            "The more emails that you send and receive two person or figure people, the more likely they are to be important deal.",
            "We also point out that recency is a big factor in importance, so interactions that you have today indicate a greater deal of importance or stronger relationship than emails that happened a few weeks ago.",
            "A few months ago.",
            "And finally, we think that the direction of the interaction is very important.",
            "And this is because if you actively going to send an email to someone, then you're making up that you're taking an action, and that shows that they are important to you as opposed to passively receiving emails.",
            "Windows could be spam, where they you haven't actually done anything in order to to contact this group.",
            "So so, given these three insights, we can summarize all of the interactions the user has with the contact or with a group of Contacts into a single score.",
            "We call this score of the interactions right?",
            "And once we've computed this war, we can break every user's Contacts and groups, basically linear with an older scale and say.",
            "These are the most important people to the user and these are people that are the least important to email."
        ],
        [
            "So the way we can give us is that basically we take all of the email interactions between interactive Group and we separate them.",
            "We divided up into outgoing and incoming.",
            "We can put them on a timeline from $0.03 to the least recent and then each interaction has a timestamp which we can compare to the current timestamp and we decay the importance of the interaction exponentially in time.",
            "So we have parameter which is the half life like the interaction that we can't determine the speed with, which is important in the case.",
            "I finally have another parameter which is the weight or the relative weight of outgoing versus incoming interactions, and then we just add them up."
        ],
        [
            "So for example, if this is the timeline with my interactions with my coworkers, Bob and Alex, or two weeks ago, I sent them an email and then today I sent him another email and I received one email from Bob.",
            "It's to both me and Alice.",
            "Then if my half life is 2 weeks and the relative weight of an outgoing person coming attractions for by the way they serve the real parameters that we use in our work, then the interaction from now may have a weight of 1 and the one in two weeks ago is half as important and the point is basically that I could take all of these interactions and summarize them into a single score and that is.",
            "This we assume that that's the strength of my relationship with this group.",
            "Bob and Alice and I can then compare it to other groups."
        ],
        [
            "So now, given that each user has this weighted directed hypergraph which is his egocentric network, we can go back to our original problem which is identifying groups of related content.",
            "So like I said, we don't want to be here to have to go and do any kind of labeling beholder, but we thought you know what?",
            "If the user just labels a few Contacts then we can take those few Contacts as our speed group and do the rest of the work for him.",
            "So so we define this notion of a seed group, which is no small set of context of the user is labeled and given the SEAT group we try to expand it out into a larger semantically meaningful Groupon users network.",
            "So for example, if I were labeled Bob is one of my coworkers.",
            "Then given my email attractions, we should be able to identify the Carol Dallas are also likely my coworkers."
        ],
        [
            "We didn't start with an algorithm that we call the expanded the algorithm.",
            "So given a user and some seed group of Contacts that he's labeled, we want to return a set of friends suggestions.",
            "We who are Contacts that we believe are related to the contact center in the C Group.",
            "We do this by fetching all of the groups in the users eccentric network along with their interactions rank, and then for each group we go over each context in that group.",
            "Obviously we skip over the ones that the user is already labeled as belonging to see and then we compute a suggestions for for the contact and.",
            "We do this by taking into account the group that it comes from, so the both the interactions rank of that group and that group similarity due to see that these of the user is labeled and we aggregate this and then we return subset of Contacts that we think have the highest suggestion scores over all of the groups that users network."
        ],
        [
            "Now what does it mean to say to?",
            "How do we compute the suggestions for well, for each contact that he wants to group?",
            "We know two things, so we know.",
            "First of all, we know the rank of that group, how important it is to the user, and we can also try to measure how similar is that inclusive group to the same group of the user is labeled.",
            "There's a lot of ways to determine group similarity, and we started with very simple baseline, which is we just looked at the intersection of the numbers of each group, so we have to see group.",
            "We have to impose a group.",
            "We see how many members they have in common if we stay in the best dissimilarity.",
            "And now we want to know well how much of this similarity actually not like does this impact the quality of the suggestion of the rain was generated?",
            "And also what about this interactions, right?",
            "'cause this is something that's really important and maybe this whole thing that we're doing is trying to find meaning in the groups of the user is interacting with.",
            "This is actually very good, and maybe in every context we should just be suggesting the users most important Contacts or people who has the most.",
            "So we decided to experiment."
        ],
        [
            "I don't do this to me.",
            "I don't need to find 4 different metrics for computing context similarity.",
            "The first one is basically a straw man is the top contact and what it says is that for each contact we will get all the groups that it belongs to.",
            "We saw in the interactions right of those groups.",
            "We don't look at this.",
            "The seed group at all and we return this as the Scorpion contact.",
            "Now, on the other side, we need to find another strongman which says what if interactions rank doesn't matter all, so instead we just look at the intersection with between.",
            "The C group and the implicit proof of the contact belongs to and if there's some intersection, then we just get that contact with plus one, and now we don't count all the groups in the content belongs to that are similar to the scene."
        ],
        [
            "And then obviously we can do something much smarter which is taking into account both similarity and the interactions, right?",
            "So for every group that has a muscle relaxer, we saw the interactions right of that group.",
            "And finally we can go even a little bit further and say what if we take into account the amount of similarity.",
            "So now we look at the size of the intersection and we multiply it by the interactions right of the curriculum based on that for all of the groups of the content belongs to."
        ],
        [
            "We did our allocation by looking at some real email data, but I want to point out that all the analysis that we do is done in aggregate so we never look at the contents of emails.",
            "We never look at one person's data and we're very careful to protect user privacy.",
            "But what we did is for each user we built his egocentric network up to some time T, so that's including all of his his email interactions up until that time and then going forward from time T plus one, we sample some new interactions.",
            "We looked at messages that have between 3 and 25 recipients and we did some filtering on this to try to pick out messages that we believe to consent by real people, and the reason this is important is because we think that box and automatic mailers have very different behavioral characteristics and real users, and we wanted to look at what actual people are doing.",
            "So now please email.",
            "We complete the first K recipients of this message as a seed set and that's the complete user has manually added these recipients to an email he said like these people, former group.",
            "And now we can try to use our expansive algorithm to generate the rest of the recipients.",
            "And we did this with all four of metrics."
        ],
        [
            "Unsurprisingly, you do the best if you take into account both interactions, rank and group similarity, but I want to point out that actually what you're seeing here is the position on the X axis and the big hole on the Y axis, and the performance is very well separated, so you actually are gaining a significant amount of information or predictive power by each piece of information that you take into account.",
            "The best performance takes into account, of course.",
            "Also, the degree of similarity."
        ],
        [
            "Now, one thing that I want to point out quickly is the previous graph that I showed you was for speed size of five.",
            "So we looked at holding interactions that have more than five seconds and we took the first five as the seed and try to predict the rest of them.",
            "But in fact, for our best metric which is looking at taking into account both the size of the similarity and the interactions rank, the seat size is very little impact on performance.",
            "So once you get more than two users as you see basically the performance the predicted power is the same and what this tells us is that the groups are actually very well separated from each other, so you don't need very much.",
            "The user doesn't need to label very many people in order for you to be able to move forward from there, and I don't have a lot of very defensive close, but I think it's an interesting over question for major research."
        ],
        [
            "So we actually do it.",
            "That's why we built two applications.",
            "The first one is that called the.",
            "Don't forget Bob in this launched as a Gmail lab about a year and a half ago.",
            "You can turn it on in your Gmail and what it is is that as the user starts adding recipients to an email.",
            "So here I've added the three Dwarves to be grumpy and dog, then that the levels is just moving him.",
            "Maybe I want to include Happy's museum sleeping.",
            "This is very straightforward implementation of expenses algorithms that I developed, but we thought actually we could probably do something smarter than."
        ],
        [
            "We can do this website so once the user is entering a whole complete recipients, we could probably identify someone who doesn't fit very well into that group.",
            "System was bad match and this is the second last that we launched a little while ago called got the wrong Bob and here we can enter a people.",
            "We identify whether one of them doesn't fit.",
            "Then we suggest someone else from your contact list who is likely bigger replacement for them."
        ],
        [
            "So the way this works is basically we look at the list of recipients of an email, and for each contact in that list we try to remove it and we use the remaining Contacts as a seed.",
            "That and then we run our expanded algorithm to try to expand that feed, and if the contact that we removed his return to suggestions, then great.",
            "Probably that contact is not a mistake 'cause that means it is a good fit for the rest of the seeds.",
            "If, on the other hand, the contact does not return, then we look at.",
            "Read the people who are suggested as replacements for him, and if there's both similar to the contact and they have high score and then we keep him as a candidate and finally returned the candidate pair with the highest suggestion score."
        ],
        [
            "So what's that mean for it to have that speed considered similar?",
            "Well, we think that the most likely way that people make mistake is with autocomplete, so they start typing a prefix and without looking they hit enter, and maybe that that wasn't who they really intended.",
            "So we think that the similarity in the prefix of the contact names or contact email addresses is an indication that one of these Contacts was likely the same.",
            "So, for example, if I send an email to Bob and Carol, then this algorithm I suggest that I'm.",
            "Meant to send to Alice instead of talent, and this is a good.",
            "This is a good replacement because on the one hand Alice is a good expansion of this group on Carol and on the other hand Allison Allen share prefix.",
            "So it means that I type AL and then hit enter without looking.",
            "And overall both of these labs have gotten very positive feedback.",
            "We've had a lot of user adoption, hundreds of thousands of people have turns on and you can try to do in less than what you think."
        ],
        [
            "So just to sum up, what we've built and looked at the implicit social graph, which is the graphics formed by user interactions with his Contacts and implicit group.",
            "This is a weighted directed ecocentric hypergraph, and we've given a metric for computing weights for implicit groups based on recency, frequency and direction of interactions.",
            "We give an algorithm that, given a seed that the user has labeled with a small set of groups that belongs here, was that we can expand that to find other semantically meaningful groups in the user SQL centric network.",
            "And then based on this algorithm, we've built two successful Gmail app switches.",
            "Don't forget about the platform from, so that's what I had to say and I will have later questions."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is work that was done in collaboration with my colleagues at the Googles Israel already center, but motivation.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "My work is based on some research that was done by Paul Adams, whose user experience researcher at Google and what he did was he took a bunch of users in The Cave, them a list of all of our Contacts and the aspect to point each contact into a group, and he let the users creating groups and labels of however they wanted, and they created groups like Family in college friends, but we found is that by and large every single person created between three and five groups, and these groups didn't really have a lot of interest of overlaps.",
                    "label": 0
                },
                {
                    "sent": "The kryptonite affected.",
                    "label": 0
                },
                {
                    "sent": "And this is true across cultures with Alex very, very compelling.",
                    "label": 0
                },
                {
                    "sent": "But now if you're in the business of creating tools for electronic communication like we are in, this is not surprising for you because we know that user is interacting groups.",
                    "label": 0
                },
                {
                    "sent": "So if you're sharing photo album or planning parties, you probably have a very specific group of people in mind that you have hard data that is in communication here and now.",
                    "label": 0
                },
                {
                    "sent": "Obviously we want to create tools that can help users create persistent contact groups so that they can make this interaction, because here for them.",
                    "label": 1
                },
                {
                    "sent": "So the next time you're sharing the photo album with your family, you can just click on family instead of going in and doing all the people one after the other.",
                    "label": 1
                },
                {
                    "sent": "But the problem is that even though we've created these tools and other people have created these tools, by and large, nobody uses them.",
                    "label": 0
                },
                {
                    "sent": "And when we ask for using, why not?",
                    "label": 0
                },
                {
                    "sent": "They say things like creating groups, video service, time consuming on something that they don't usually point out that this is actually the case is that the group change overtime so the work that you've done to create your family group today next week when you want to share your photo album.",
                    "label": 0
                },
                {
                    "sent": "That report necessarily contain everyone that you wanted to contain all of the wrinkles and wasted.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is like researchers to become interested in the problem of automatically detecting leader Contacts on.",
                    "label": 0
                },
                {
                    "sent": "So instead of asking the users to go and create all these groups manually, we can help them by identifying who the groups are in their social network.",
                    "label": 0
                },
                {
                    "sent": "Now the previous approaches that people have taken to solving this problem is one of them.",
                    "label": 0
                },
                {
                    "sent": "Is graph clustering on the global social graph.",
                    "label": 1
                },
                {
                    "sent": "So looking at the graph with everyone is interacting with everyone else and saying that users are likely come along the same group if they have many friends in common.",
                    "label": 1
                },
                {
                    "sent": "Um, another approach that has has been done in the past is looking at content analysis.",
                    "label": 0
                },
                {
                    "sent": "So if you're exchanging a lot of emails with some people and you talk about your soccer team, that is likely that you belong to the same software team and we can say this is a group that exists in any social network.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The wait time is slightly different approach which is looking at identifying groups from communication patterns, so the insight that led us to this was noticing that email is inherently a group communication medium.",
                    "label": 1
                },
                {
                    "sent": "So people often send email to more than once again and the recipient list with their email isn't very carefully curated, so in fact the users are doing a lot of work of identifying groups of people when they send an email and Contacts from different groups are unlikely to appear as recipients in the same you know.",
                    "label": 1
                },
                {
                    "sent": "So for example, if I was to take my inbox and on one side and try to categorize all the messages and then once I put.",
                    "label": 0
                },
                {
                    "sent": "All emails from my coworkers on the other side put all the emails from my family.",
                    "label": 0
                },
                {
                    "sent": "I would end up with a lot of messages in the middle that contain met Mail that was to both my coworkers and my family, because in fact users interactions are implicitly doing the work with clustering their Contacts into groups.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Given this insight, we built the implicit social graph and Mrs Social Graph.",
                    "label": 1
                },
                {
                    "sent": "It's formed by users interactions with their Contacts so different from explicit social graphs in which user says this person is my friend.",
                    "label": 1
                },
                {
                    "sent": "This person is my friend.",
                    "label": 0
                },
                {
                    "sent": "This person is my friend, but instead anytime the two users are interacting with each other, in our case by sending an email so that forms an edge between the two of them.",
                    "label": 1
                },
                {
                    "sent": "So we extract this graph from email headers.",
                    "label": 0
                },
                {
                    "sent": "We don't look at contents at all, and what forms is a weighted directed hypergraph?",
                    "label": 0
                },
                {
                    "sent": "The reason if the hypergraph is exactly because of this group nature?",
                    "label": 1
                },
                {
                    "sent": "Of the communication.",
                    "label": 1
                },
                {
                    "sent": "So each email forms a hyper edge in the graph.",
                    "label": 0
                },
                {
                    "sent": "We call this implicit group.",
                    "label": 0
                },
                {
                    "sent": "In our work, we've looked at the egocentric graph, so this is the graph that for each user is centered on that user.",
                    "label": 0
                },
                {
                    "sent": "It only takes into account interactions in which he was a direct participants.",
                    "label": 0
                },
                {
                    "sent": "So people who he's actually sent and received emails from the primary business.",
                    "label": 1
                },
                {
                    "sent": "We did those things to address privacy concerns, so that for each user we're analyzing only his inbox.",
                    "label": 0
                },
                {
                    "sent": "We're only showing him information that is based on an interaction that he said part of.",
                    "label": 0
                },
                {
                    "sent": "And we don't run the risk of exploding.",
                    "label": 0
                },
                {
                    "sent": "Kind of friend of friend information, telling people things that they're not supposed to know.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now each user can interact with hundreds of groups or possibly thousands of Contacts, but many of these attractions are sporadic when they happen once, and they don't really carry a lot of weight and tell you very much about who is important to the user, and so when we're analyzing the you guys graph that it's very important to identify the context in groups that are most important to the user, and we do this by noticing 3 features that we can we can extract from users, email interactions that influence group importance.",
                    "label": 1
                },
                {
                    "sent": "So first of all, certain portions depends on the frequency and interaction, and this one is fairly obvious.",
                    "label": 0
                },
                {
                    "sent": "The more emails that you send and receive two person or figure people, the more likely they are to be important deal.",
                    "label": 0
                },
                {
                    "sent": "We also point out that recency is a big factor in importance, so interactions that you have today indicate a greater deal of importance or stronger relationship than emails that happened a few weeks ago.",
                    "label": 0
                },
                {
                    "sent": "A few months ago.",
                    "label": 0
                },
                {
                    "sent": "And finally, we think that the direction of the interaction is very important.",
                    "label": 0
                },
                {
                    "sent": "And this is because if you actively going to send an email to someone, then you're making up that you're taking an action, and that shows that they are important to you as opposed to passively receiving emails.",
                    "label": 0
                },
                {
                    "sent": "Windows could be spam, where they you haven't actually done anything in order to to contact this group.",
                    "label": 1
                },
                {
                    "sent": "So so, given these three insights, we can summarize all of the interactions the user has with the contact or with a group of Contacts into a single score.",
                    "label": 0
                },
                {
                    "sent": "We call this score of the interactions right?",
                    "label": 0
                },
                {
                    "sent": "And once we've computed this war, we can break every user's Contacts and groups, basically linear with an older scale and say.",
                    "label": 0
                },
                {
                    "sent": "These are the most important people to the user and these are people that are the least important to email.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the way we can give us is that basically we take all of the email interactions between interactive Group and we separate them.",
                    "label": 1
                },
                {
                    "sent": "We divided up into outgoing and incoming.",
                    "label": 0
                },
                {
                    "sent": "We can put them on a timeline from $0.03 to the least recent and then each interaction has a timestamp which we can compare to the current timestamp and we decay the importance of the interaction exponentially in time.",
                    "label": 0
                },
                {
                    "sent": "So we have parameter which is the half life like the interaction that we can't determine the speed with, which is important in the case.",
                    "label": 1
                },
                {
                    "sent": "I finally have another parameter which is the weight or the relative weight of outgoing versus incoming interactions, and then we just add them up.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for example, if this is the timeline with my interactions with my coworkers, Bob and Alex, or two weeks ago, I sent them an email and then today I sent him another email and I received one email from Bob.",
                    "label": 0
                },
                {
                    "sent": "It's to both me and Alice.",
                    "label": 0
                },
                {
                    "sent": "Then if my half life is 2 weeks and the relative weight of an outgoing person coming attractions for by the way they serve the real parameters that we use in our work, then the interaction from now may have a weight of 1 and the one in two weeks ago is half as important and the point is basically that I could take all of these interactions and summarize them into a single score and that is.",
                    "label": 1
                },
                {
                    "sent": "This we assume that that's the strength of my relationship with this group.",
                    "label": 0
                },
                {
                    "sent": "Bob and Alice and I can then compare it to other groups.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now, given that each user has this weighted directed hypergraph which is his egocentric network, we can go back to our original problem which is identifying groups of related content.",
                    "label": 0
                },
                {
                    "sent": "So like I said, we don't want to be here to have to go and do any kind of labeling beholder, but we thought you know what?",
                    "label": 0
                },
                {
                    "sent": "If the user just labels a few Contacts then we can take those few Contacts as our speed group and do the rest of the work for him.",
                    "label": 1
                },
                {
                    "sent": "So so we define this notion of a seed group, which is no small set of context of the user is labeled and given the SEAT group we try to expand it out into a larger semantically meaningful Groupon users network.",
                    "label": 0
                },
                {
                    "sent": "So for example, if I were labeled Bob is one of my coworkers.",
                    "label": 0
                },
                {
                    "sent": "Then given my email attractions, we should be able to identify the Carol Dallas are also likely my coworkers.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We didn't start with an algorithm that we call the expanded the algorithm.",
                    "label": 0
                },
                {
                    "sent": "So given a user and some seed group of Contacts that he's labeled, we want to return a set of friends suggestions.",
                    "label": 1
                },
                {
                    "sent": "We who are Contacts that we believe are related to the contact center in the C Group.",
                    "label": 0
                },
                {
                    "sent": "We do this by fetching all of the groups in the users eccentric network along with their interactions rank, and then for each group we go over each context in that group.",
                    "label": 0
                },
                {
                    "sent": "Obviously we skip over the ones that the user is already labeled as belonging to see and then we compute a suggestions for for the contact and.",
                    "label": 0
                },
                {
                    "sent": "We do this by taking into account the group that it comes from, so the both the interactions rank of that group and that group similarity due to see that these of the user is labeled and we aggregate this and then we return subset of Contacts that we think have the highest suggestion scores over all of the groups that users network.",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now what does it mean to say to?",
                    "label": 0
                },
                {
                    "sent": "How do we compute the suggestions for well, for each contact that he wants to group?",
                    "label": 1
                },
                {
                    "sent": "We know two things, so we know.",
                    "label": 1
                },
                {
                    "sent": "First of all, we know the rank of that group, how important it is to the user, and we can also try to measure how similar is that inclusive group to the same group of the user is labeled.",
                    "label": 1
                },
                {
                    "sent": "There's a lot of ways to determine group similarity, and we started with very simple baseline, which is we just looked at the intersection of the numbers of each group, so we have to see group.",
                    "label": 0
                },
                {
                    "sent": "We have to impose a group.",
                    "label": 0
                },
                {
                    "sent": "We see how many members they have in common if we stay in the best dissimilarity.",
                    "label": 1
                },
                {
                    "sent": "And now we want to know well how much of this similarity actually not like does this impact the quality of the suggestion of the rain was generated?",
                    "label": 0
                },
                {
                    "sent": "And also what about this interactions, right?",
                    "label": 0
                },
                {
                    "sent": "'cause this is something that's really important and maybe this whole thing that we're doing is trying to find meaning in the groups of the user is interacting with.",
                    "label": 1
                },
                {
                    "sent": "This is actually very good, and maybe in every context we should just be suggesting the users most important Contacts or people who has the most.",
                    "label": 0
                },
                {
                    "sent": "So we decided to experiment.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I don't do this to me.",
                    "label": 0
                },
                {
                    "sent": "I don't need to find 4 different metrics for computing context similarity.",
                    "label": 0
                },
                {
                    "sent": "The first one is basically a straw man is the top contact and what it says is that for each contact we will get all the groups that it belongs to.",
                    "label": 0
                },
                {
                    "sent": "We saw in the interactions right of those groups.",
                    "label": 0
                },
                {
                    "sent": "We don't look at this.",
                    "label": 0
                },
                {
                    "sent": "The seed group at all and we return this as the Scorpion contact.",
                    "label": 0
                },
                {
                    "sent": "Now, on the other side, we need to find another strongman which says what if interactions rank doesn't matter all, so instead we just look at the intersection with between.",
                    "label": 0
                },
                {
                    "sent": "The C group and the implicit proof of the contact belongs to and if there's some intersection, then we just get that contact with plus one, and now we don't count all the groups in the content belongs to that are similar to the scene.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then obviously we can do something much smarter which is taking into account both similarity and the interactions, right?",
                    "label": 1
                },
                {
                    "sent": "So for every group that has a muscle relaxer, we saw the interactions right of that group.",
                    "label": 1
                },
                {
                    "sent": "And finally we can go even a little bit further and say what if we take into account the amount of similarity.",
                    "label": 0
                },
                {
                    "sent": "So now we look at the size of the intersection and we multiply it by the interactions right of the curriculum based on that for all of the groups of the content belongs to.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We did our allocation by looking at some real email data, but I want to point out that all the analysis that we do is done in aggregate so we never look at the contents of emails.",
                    "label": 1
                },
                {
                    "sent": "We never look at one person's data and we're very careful to protect user privacy.",
                    "label": 1
                },
                {
                    "sent": "But what we did is for each user we built his egocentric network up to some time T, so that's including all of his his email interactions up until that time and then going forward from time T plus one, we sample some new interactions.",
                    "label": 0
                },
                {
                    "sent": "We looked at messages that have between 3 and 25 recipients and we did some filtering on this to try to pick out messages that we believe to consent by real people, and the reason this is important is because we think that box and automatic mailers have very different behavioral characteristics and real users, and we wanted to look at what actual people are doing.",
                    "label": 1
                },
                {
                    "sent": "So now please email.",
                    "label": 0
                },
                {
                    "sent": "We complete the first K recipients of this message as a seed set and that's the complete user has manually added these recipients to an email he said like these people, former group.",
                    "label": 0
                },
                {
                    "sent": "And now we can try to use our expansive algorithm to generate the rest of the recipients.",
                    "label": 0
                },
                {
                    "sent": "And we did this with all four of metrics.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Unsurprisingly, you do the best if you take into account both interactions, rank and group similarity, but I want to point out that actually what you're seeing here is the position on the X axis and the big hole on the Y axis, and the performance is very well separated, so you actually are gaining a significant amount of information or predictive power by each piece of information that you take into account.",
                    "label": 0
                },
                {
                    "sent": "The best performance takes into account, of course.",
                    "label": 1
                },
                {
                    "sent": "Also, the degree of similarity.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, one thing that I want to point out quickly is the previous graph that I showed you was for speed size of five.",
                    "label": 0
                },
                {
                    "sent": "So we looked at holding interactions that have more than five seconds and we took the first five as the seed and try to predict the rest of them.",
                    "label": 0
                },
                {
                    "sent": "But in fact, for our best metric which is looking at taking into account both the size of the similarity and the interactions rank, the seat size is very little impact on performance.",
                    "label": 0
                },
                {
                    "sent": "So once you get more than two users as you see basically the performance the predicted power is the same and what this tells us is that the groups are actually very well separated from each other, so you don't need very much.",
                    "label": 0
                },
                {
                    "sent": "The user doesn't need to label very many people in order for you to be able to move forward from there, and I don't have a lot of very defensive close, but I think it's an interesting over question for major research.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we actually do it.",
                    "label": 0
                },
                {
                    "sent": "That's why we built two applications.",
                    "label": 0
                },
                {
                    "sent": "The first one is that called the.",
                    "label": 0
                },
                {
                    "sent": "Don't forget Bob in this launched as a Gmail lab about a year and a half ago.",
                    "label": 1
                },
                {
                    "sent": "You can turn it on in your Gmail and what it is is that as the user starts adding recipients to an email.",
                    "label": 0
                },
                {
                    "sent": "So here I've added the three Dwarves to be grumpy and dog, then that the levels is just moving him.",
                    "label": 0
                },
                {
                    "sent": "Maybe I want to include Happy's museum sleeping.",
                    "label": 0
                },
                {
                    "sent": "This is very straightforward implementation of expenses algorithms that I developed, but we thought actually we could probably do something smarter than.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We can do this website so once the user is entering a whole complete recipients, we could probably identify someone who doesn't fit very well into that group.",
                    "label": 0
                },
                {
                    "sent": "System was bad match and this is the second last that we launched a little while ago called got the wrong Bob and here we can enter a people.",
                    "label": 1
                },
                {
                    "sent": "We identify whether one of them doesn't fit.",
                    "label": 0
                },
                {
                    "sent": "Then we suggest someone else from your contact list who is likely bigger replacement for them.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the way this works is basically we look at the list of recipients of an email, and for each contact in that list we try to remove it and we use the remaining Contacts as a seed.",
                    "label": 1
                },
                {
                    "sent": "That and then we run our expanded algorithm to try to expand that feed, and if the contact that we removed his return to suggestions, then great.",
                    "label": 1
                },
                {
                    "sent": "Probably that contact is not a mistake 'cause that means it is a good fit for the rest of the seeds.",
                    "label": 0
                },
                {
                    "sent": "If, on the other hand, the contact does not return, then we look at.",
                    "label": 1
                },
                {
                    "sent": "Read the people who are suggested as replacements for him, and if there's both similar to the contact and they have high score and then we keep him as a candidate and finally returned the candidate pair with the highest suggestion score.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what's that mean for it to have that speed considered similar?",
                    "label": 0
                },
                {
                    "sent": "Well, we think that the most likely way that people make mistake is with autocomplete, so they start typing a prefix and without looking they hit enter, and maybe that that wasn't who they really intended.",
                    "label": 0
                },
                {
                    "sent": "So we think that the similarity in the prefix of the contact names or contact email addresses is an indication that one of these Contacts was likely the same.",
                    "label": 0
                },
                {
                    "sent": "So, for example, if I send an email to Bob and Carol, then this algorithm I suggest that I'm.",
                    "label": 1
                },
                {
                    "sent": "Meant to send to Alice instead of talent, and this is a good.",
                    "label": 0
                },
                {
                    "sent": "This is a good replacement because on the one hand Alice is a good expansion of this group on Carol and on the other hand Allison Allen share prefix.",
                    "label": 0
                },
                {
                    "sent": "So it means that I type AL and then hit enter without looking.",
                    "label": 0
                },
                {
                    "sent": "And overall both of these labs have gotten very positive feedback.",
                    "label": 0
                },
                {
                    "sent": "We've had a lot of user adoption, hundreds of thousands of people have turns on and you can try to do in less than what you think.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So just to sum up, what we've built and looked at the implicit social graph, which is the graphics formed by user interactions with his Contacts and implicit group.",
                    "label": 1
                },
                {
                    "sent": "This is a weighted directed ecocentric hypergraph, and we've given a metric for computing weights for implicit groups based on recency, frequency and direction of interactions.",
                    "label": 1
                },
                {
                    "sent": "We give an algorithm that, given a seed that the user has labeled with a small set of groups that belongs here, was that we can expand that to find other semantically meaningful groups in the user SQL centric network.",
                    "label": 0
                },
                {
                    "sent": "And then based on this algorithm, we've built two successful Gmail app switches.",
                    "label": 0
                },
                {
                    "sent": "Don't forget about the platform from, so that's what I had to say and I will have later questions.",
                    "label": 0
                }
            ]
        }
    }
}