{
    "id": "ef7jr3o7wc6nmupwtikiivp2tjlaqlg7",
    "title": "SaaS-U within a Service and Application Intermediary Business Model in Regional Healthcare",
    "info": {
        "author": [
            "Andrew Faughy, VEN Group"
        ],
        "published": "Nov. 22, 2010",
        "recorded": "October 2010",
        "category": [
            "Top->Business"
        ]
    },
    "url": "http://videolectures.net/echallenges2010_faughy_sws/",
    "segmentation": [
        [
            "Graph realizing gentlemen, thank you for the time for the presentation.",
            "Quick, brief about who I am and the business I represent.",
            "I'm Andrew Foy.",
            "My background is an engineer, so I tend to be very much hands-on.",
            "So traditional I struggle sometimes with research.",
            "My company van started in 2002 as part of a government program in the UK, particularly region called Yorkshire.",
            "It was focused on collaboration, so the target is a business was to get communities of business engaged in large scale projects.",
            "Where we could actually generate some benefits for the community in terms of money, social income and outputs for the region.",
            "So it's about competitiveness program.",
            "We're currently going through a phase now, just changing the name to reflect some of our other activities."
        ],
        [
            "OK, so what's the motivation for doing the paper for doing the business model is, well, it's quite simple really.",
            "It's personal is some respect in the region shown in the diagram, that's Yorkshire.",
            "Each one of those little arrows is a County, and they put the relevance of the coloring of that diagram.",
            "If you live in a red area, which is typically a city compared to someone living in blue area, which is rural, you'll live on average 15 years less.",
            "So it's quite a substantial difference in terms of your life expectancy, but where you live.",
            "So I've seen some previous work and documents that talk about aging gracefully.",
            "Actually, I would contend it's where you live is the biggest factor in your health.",
            "And but we typically see in these big cities.",
            "Sheffield, Barnsley Leeds is younger people pull on healthcare services earlier for longer and I younger so actually that tends to be the conclusion that we found with our initial research.",
            "So in terms of motivation we were looking at basically how can we exploit their purchasing power?",
            "the UK Health Service and invest in more deprived areas to increase the wealth which is known to increase well being and that subsequently leads to a.",
            "Decrease in healthcare demand and again I would make two points if it was purely about spending money.",
            "United States of America would be the most healthiest country in the world.",
            "It's not on the second point in an ideal healthcare system where everything was perfect, we have no patience, but we do.",
            "So consequently we need to look at demand move away from treatment and move more to preventative measures.",
            "And also this other issue which is part of the challenge is moving away from treatment cost.",
            "Total system costs to connect well being with delivery of services because again that can be counterproductive if you only look at the current services.",
            "So the utility model starts to look at this more social economic aspects in terms of healthcare, particularly with reference to myself into people.",
            "Particularly SMEs, businesses that act as intermediaries in terms of service and applications."
        ],
        [
            "So some of the challenges that we're seeing in the region is becoming very, very complex in terms of number of applications that are being created in the web finding service.",
            "Joining our services up to make an intern services is a very big task.",
            "Typically in an ecosystem in Yorkshire we have a big mix of maturity between the user and the provider.",
            "So when you talk to map out the value chain or the OR the treatment pathway, you get some very immature people in terms of technology working with some very high tech companies.",
            "And again that's an issue when it comes to integration.",
            "Jenna problem we can see isn't becoming aggregation.",
            "Healthcare can fall into a trap in terms of reducing operational costs by going down this lean approach, let's source bigger contracts.",
            "Let's turn the contracts over faster.",
            "Actually, that can be counterproductive because you can take money away from local businesses and you can put it into the hands of larger players who typically win the contracts.",
            "And if you were to look at the average size of an HS contract in UK which is growing and you look at the criteria for selecting an SMB.",
            "For winning that contract, you'll find average contract size in relation to the turnover is widening.",
            "So is it no surprise that we suddenly find the only people who bid for this worker blue chip companies?",
            "So this is strategy unnecessarily.",
            "I think it's only intended in terms of driving this challenge into the region.",
            "There is also a couple of new markets which are now grown in UK, so times are changing.",
            "One is this idea of community commissioning.",
            "The idea that you go from center let commissioning actually Commission at a local level.",
            "That's an ideal opportunity for a statue model because you started to talk about distributed buying and moving the bind away from centralized catalogs.",
            "The second point is we see a lot more in the growth of personalized care in terms of in the home telling medicine, end of life conditions.",
            "Again very important.",
            "And also this is where the patient becomes the customer.",
            "A traditional model would be that patient would go to the hospital and effectively be treated put through the system as quick as they can.",
            "What you're going to see in terms of a trend going forward is patient is going to actually source, and by the services, maybe through the Community commissioning process so their entire attitude of the service delivering healthcare has to change."
        ],
        [
            "So some objectives of the paper under the model one was actually to develop the model in terms of Sasha approach for an SMB as an intermediary.",
            "Highlight some of the potential challenges and difficulties in implementing that model and also to look if the model could actually be implemented and by doing so, producer business plan for the model in terms of the method manzese talk very well about the detailed method.",
            "Only make three remarks.",
            "When I looked at the method for this business model, I looked at market context, which includes both the policy and political debates, not just document spends and the technology.",
            "The second point I'd make it definition modeling process was defined in terms of a group consensus and a third, which I would say is as a research.",
            "I do her bias so these models are biased by the research in the ecosystem."
        ],
        [
            "OK, So what have we done?",
            "Well, today we've got an initial model.",
            "These are part of the public divorce.",
            "I'm not going to show this spreadsheet today.",
            "We will make them available through the coin, profitable.",
            "We've also got a value proposition for an intermediary using the shoe model and we also did a draft business plan.",
            "One of the things I will say is if I go with my shopping list to surge in terms of technical architecture, there are six services that we typically see as being important in healthcare reader for this.",
            "The first thing it's some sort of generic service platform.",
            "Where you can do search and discovery negotiation services, that is a major advantage to SM ES who want to construct services end to end who want to have some form of interoperability and then compile those services to the end user.",
            "For the one that's come out of the research recently, human interaction, part of our trials today in the work we've done today, highlighted the importance of human interaction, both in terms of people interacting with the web, but also the web and gaming interacting with people.",
            "So we've done quite a bit of a push around social networking.",
            "We don't think in the future people are going to log onto a website and do an Amazon type shopping exercise.",
            "We think people are going through more social media and social interaction.",
            "We also think that maybe augmented reality, you may play an important part of this go forward.",
            "Federer things very important is have a service which can do collaborative product development, semantic sporting services, the big weak spot in the offer at the moment is the ability to reconcile semantically documents treatment pathways between different institutions and between the core and HS system which still would do the hospitalization of the patient.",
            "Fundamental service needed another one which is just as important as Co developed the skills issue just recently in UK I think yesterday or day before those reports about a nurse.",
            "And see Nurse who switched off a ventilator by mistake.",
            "A patient in home.",
            "The patient went into a coma and she wasn't trained to actually state the patient.",
            "And that's one of the big issues when we start looking at primary care, we start looking about putting Karen.",
            "Home is ensuring that the skills based on the currency base is in place, is sure that competent care is given at the point of use, which is one advantage to hospitals have over primary care.",
            "So there are six services that we would like to see."
        ],
        [
            "It terms of a high level model.",
            "We basically got 8 boxes.",
            "The ones are particularly interesting for sales of the provider box to show the dynamic between brothers.",
            "So rather than writing one big spreadsheet, one big model, we've subdivided the model into these boxes so we can actually do easier management issue.",
            "I think couple of points to make would be the roles of people involved.",
            "The commissioning role is pivotal and the role between the provider and the regulator in terms of price.",
            "Market equilibrium.",
            "And as part of the scenarios have included the commissioning role in a scenario that commissioning role I think is the key to this business model.",
            "If that commissioning role goes into a large corporate private or USA United Health then they will drive the sourcing the treatment.",
            "If I commissioning roll goes into local locality it would drive more distributed delivery and we will see more distributed services and hence a shoe.",
            "Such fundamental the other thing is important is the role between the Commission of the Regulator in terms of pricing at the moment that tends to be a lot of fixed prices and tariffs.",
            "What needs to be done in terms of the future is looking at more outcomes and outputs and start to look at the idea that you give a business alone to do treatments, and then if they hit the outcomes that becomes a grant.",
            "So we need to start subtly changing how is financed in terms of the model."
        ],
        [
            "Some variables just to go through some of the basic variables on the input side.",
            "We're starting to check some utility investment costs.",
            "There's a big debated question, almost an unknown question at the moment.",
            "Who will pay for the utility power?",
            "Utilities start our view is we will see islands of Utility will see Federation of businesses that start to utilizing gain critical mass.",
            "In terms of generic service platform, there will need to be an operator of that platform who can provide this search and discovery.",
            "If you're like a Google for service is very important are very key role, one which would have to be regulated in the marketplace.",
            "Healthcare dividend so moving away from price to prevention, you actually have to invest a bit more in terms of the price for treatment to get more back in terms of reduction in healthcare demand overall so it has to be a cost on.",
            "So my case would be that this model might state that she's going to cost on not cost off all the time.",
            "Office Lee startup costs intermediary and then the operating cost intermediary on the revenue side.",
            "We've started to look at some income streams.",
            "Subscription Classic One where people sign on to the site to subscribe to services others supplier as a customer transaction would be bourbon per event.",
            "Applications of it, like the App Store.",
            "If you have a platform in healthcare and somebody wishes to add honest service, they can effectively give you an application on top and would pay for that another.",
            "We found successful invent hasbeen success fees and incentive fees.",
            "If you can do something better than the quoted price then you split the difference between yourself and the Commissioner has been very successful.",
            "It drives efficiency, it drives effectiveness, and that's been quite a good incentive.",
            "On further investigation is dynamic pricing.",
            "And we look at those six areas inventory.",
            "Look at how in the tree in stocks are used data.",
            "This is most widely used in people like Google, Facebook with analyze the data start to use it for marketing purposes.",
            "A gaming look at gaming scenarios where people compete against each other.",
            "Another cluster example, this will be the stock market machine learning machines that can learn behavior bias and preferences of buyers and how that can be fed into the revenue stream simulations.",
            "Basically an aggregation the ones above.",
            "In terms of how we look at an auction, actually functions get a bad rap, but actually auctions can be a very good place to start if you're a new start up in your new market.",
            "The reason I say that is because your implementation strategy will initially be one of cost and economies of scale so auctions can actually very good place.",
            "The other thing auctions do is they all should produce what we call market equilibrium between the price and supply and demand, so that's that's the one not to discount it."
        ],
        [
            "On the output side, what we're modeling for the for the intermediate is the obvious one of financials.",
            "One.",
            "Would you invest in this intermediary in terms of net present value or internal rate of return to look at the intermediate in terms of cash flow, profit and loss and also its market share from an economic point, we're looking at gross value add, not GDP.",
            "We're looking at how much value that is created within the region.",
            "The reason being in the UK healthcare spend has a multiplier effect.",
            "For every pound you spend in that region, you will create 2 pounds of wealth.",
            "So where public spending has a multiplier effect, so very important factor theory we're looking at is social jobs created and also well being typical monitors in terms of social activity and the final area is looking at the consumer in terms of how much.",
            "How much is the consumer?",
            "Is self directing the budgets, traditionally budgets being directed by the hospitals they cofinance each other, but more and more we're going to see more self directed budgets.",
            "Where people will hold the money and it will be a market for people to support those people and making the right decision.",
            "The implementation strategy follows.",
            "Basically we look at economies of scale.",
            "Then we follow that by Connie is a scope.",
            "Once you've got your enterprise, now we're running.",
            "You can start to look at how you spread services and bring your services in end to end vertical vertical enterprise integration.",
            "We don't look at this as one stop shop.",
            "This is about enterprises working end to end in a virtual organization delivering services, and then finally core competence where we start to get knowledge based creation and value creation."
        ],
        [
            "In terms of scenarios that we've generated, we start to look at the axis for building scenarios and we decided on two axes.",
            "The first taxi was buying power and the other axis was actually the organizational size in that relationship.",
            "So this one we've got the large organisations dominate the market.",
            "SMB organizations dominate market, and across the top we've got centralized buying to distributed by now 1.5 makers.",
            "All these scenarios are in play.",
            "This isn't about choosing the scenario.",
            "This is slightly different in our model, these models are active, so we're actually starting to map our activity against the real life activity in the marketplace.",
            "So the as is condition is what we call corporate health, which is top left.",
            "We see three scenarios coming.",
            "Scenario One is an emerging one, and in the UK, Mr. Cameron calls that the big society where we start to see more and more communities taken on board more and more responsibility.",
            "And actually taking hold of budgets and spending those budgets, that is.",
            "That is actually in terms of positivity with little crosses is the best one for Sasha.",
            "If that comes around.",
            "That is actually a big opportunity for Sasho opportunity.",
            "There the other factories there legislating UK for 2015, that GPS will do the commissioning.",
            "So actually our time scales are more around 2015 rather than 2020.",
            "The other one is above is disruptive health.",
            "This has some opportunities for Sasho.",
            "But we think that would be more and around with a big player.",
            "This is more around the Amazon type shopping where you will have people going on buying health from big large providers over the web.",
            "The one we think probably negative from Sasha is adoption.",
            "By default health hubs.",
            "This is where we think that the corporate health existing MHS will try and defend its turf as taught to put some of the activities into health orbs which it controls in terms of a sachu.",
            "That's probably a negative we won't won't say Sasha emerge in that scenario."
        ],
        [
            "So some advantages that Sasha could drive from this, while diversity in an ecosystem.",
            "It is fact and a fundamental ecosystems are diverse by their very nature.",
            "We think that will be addressed by the search and discovery and ranking of services.",
            "In terms of the maturity of the mix of people in the ecosystem, we think that the search and discovery where you can have service creation which is aligned to the maturity of the market is very important and we've just one of our big lessons learned.",
            "In terms of investment for SMS barriers to entry, we think a provision by local intermediary who can then federate with their intermediaries is a very good way into the marketplace for new entrance.",
            "Look into new forms of collaboration.",
            "Open innovation.",
            "We see that the enterprise collaboration in both development and human interaction is a service which will address those, and then finally the procurement aggregation in terms of horizontal scale and vertical complexity, we see that being again innovative services such as trust, legal and commercial social platforms."
        ],
        [
            "And finally, who will benefit?",
            "While fundamentally, if you would still benefit, share the first personal benefits as a taxpayer.",
            "With adoption of the health dividend, more local sourcing using local businesses in the UK, 98.9% of business in UK recipes.",
            "So if I invest in SMB market ultimately and it's been shown over a number of reports that you can reduce the health care costs, the patient will actually benefit.",
            "I was talking to a friend of mine who is being treated for cancer and she had to smile because she said to me when everybody comes out of the treatment area, everybody has the same color hair because they've all been given the same colored wig with the same hairstyle.",
            "So that personalization will lack of personalization has to be present in the marketplace.",
            "People want to feel that they can customize their treatments, have the point of use more local, so that's going to be a big driver and Sasha could help with that.",
            "SMS.",
            "The small, medium, enterprise market the people have been traditionally pushed away, have an opportunity.",
            "Now the statute to get back into the marketplace.",
            "Not necessary to be a 50 or 60 provider, but they could be reasonably a second it first here provider.",
            "And then finally the local community.",
            "There's a fact in life because you're going to recession.",
            "The poor become poorer.",
            "That's a fact I'm afraid, as you have all the spend their cutting spends, they affect the pores of most.",
            "So if nothing is done in terms of tackling is, the situation will get worse.",
            "What will actually sees?",
            "An increase in demand for services in the middle of a recession?"
        ],
        [
            "I don't find it funny sufficient in terms of outlook.",
            "In conclusion, there's a number of factors which we think are coincident, which will mean that this is confident that this could happen.",
            "One is the EU policy on ICT health.",
            "the UK government is very clear on this.",
            "It's just issued a document called Liberating MHS which is driving this area.",
            "Again, UK public documents been directed more and more to estimate where things are greater awareness in terms of recession, about looking after people who may be more disadvantage because they are most at risk in the market.",
            "We see a personalized care bridges and long term conditions expanding as a market and we also need an increasing need to manage complexity which is between the patient Now the customer under providers.",
            "So rather than being one to one, we now seem to be many to many.",
            "And that."
        ],
        [
            "Donut shop."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Graph realizing gentlemen, thank you for the time for the presentation.",
                    "label": 0
                },
                {
                    "sent": "Quick, brief about who I am and the business I represent.",
                    "label": 0
                },
                {
                    "sent": "I'm Andrew Foy.",
                    "label": 0
                },
                {
                    "sent": "My background is an engineer, so I tend to be very much hands-on.",
                    "label": 0
                },
                {
                    "sent": "So traditional I struggle sometimes with research.",
                    "label": 0
                },
                {
                    "sent": "My company van started in 2002 as part of a government program in the UK, particularly region called Yorkshire.",
                    "label": 0
                },
                {
                    "sent": "It was focused on collaboration, so the target is a business was to get communities of business engaged in large scale projects.",
                    "label": 0
                },
                {
                    "sent": "Where we could actually generate some benefits for the community in terms of money, social income and outputs for the region.",
                    "label": 0
                },
                {
                    "sent": "So it's about competitiveness program.",
                    "label": 0
                },
                {
                    "sent": "We're currently going through a phase now, just changing the name to reflect some of our other activities.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so what's the motivation for doing the paper for doing the business model is, well, it's quite simple really.",
                    "label": 1
                },
                {
                    "sent": "It's personal is some respect in the region shown in the diagram, that's Yorkshire.",
                    "label": 0
                },
                {
                    "sent": "Each one of those little arrows is a County, and they put the relevance of the coloring of that diagram.",
                    "label": 0
                },
                {
                    "sent": "If you live in a red area, which is typically a city compared to someone living in blue area, which is rural, you'll live on average 15 years less.",
                    "label": 0
                },
                {
                    "sent": "So it's quite a substantial difference in terms of your life expectancy, but where you live.",
                    "label": 0
                },
                {
                    "sent": "So I've seen some previous work and documents that talk about aging gracefully.",
                    "label": 0
                },
                {
                    "sent": "Actually, I would contend it's where you live is the biggest factor in your health.",
                    "label": 0
                },
                {
                    "sent": "And but we typically see in these big cities.",
                    "label": 0
                },
                {
                    "sent": "Sheffield, Barnsley Leeds is younger people pull on healthcare services earlier for longer and I younger so actually that tends to be the conclusion that we found with our initial research.",
                    "label": 0
                },
                {
                    "sent": "So in terms of motivation we were looking at basically how can we exploit their purchasing power?",
                    "label": 1
                },
                {
                    "sent": "the UK Health Service and invest in more deprived areas to increase the wealth which is known to increase well being and that subsequently leads to a.",
                    "label": 1
                },
                {
                    "sent": "Decrease in healthcare demand and again I would make two points if it was purely about spending money.",
                    "label": 1
                },
                {
                    "sent": "United States of America would be the most healthiest country in the world.",
                    "label": 0
                },
                {
                    "sent": "It's not on the second point in an ideal healthcare system where everything was perfect, we have no patience, but we do.",
                    "label": 0
                },
                {
                    "sent": "So consequently we need to look at demand move away from treatment and move more to preventative measures.",
                    "label": 0
                },
                {
                    "sent": "And also this other issue which is part of the challenge is moving away from treatment cost.",
                    "label": 1
                },
                {
                    "sent": "Total system costs to connect well being with delivery of services because again that can be counterproductive if you only look at the current services.",
                    "label": 0
                },
                {
                    "sent": "So the utility model starts to look at this more social economic aspects in terms of healthcare, particularly with reference to myself into people.",
                    "label": 1
                },
                {
                    "sent": "Particularly SMEs, businesses that act as intermediaries in terms of service and applications.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So some of the challenges that we're seeing in the region is becoming very, very complex in terms of number of applications that are being created in the web finding service.",
                    "label": 1
                },
                {
                    "sent": "Joining our services up to make an intern services is a very big task.",
                    "label": 0
                },
                {
                    "sent": "Typically in an ecosystem in Yorkshire we have a big mix of maturity between the user and the provider.",
                    "label": 1
                },
                {
                    "sent": "So when you talk to map out the value chain or the OR the treatment pathway, you get some very immature people in terms of technology working with some very high tech companies.",
                    "label": 0
                },
                {
                    "sent": "And again that's an issue when it comes to integration.",
                    "label": 0
                },
                {
                    "sent": "Jenna problem we can see isn't becoming aggregation.",
                    "label": 0
                },
                {
                    "sent": "Healthcare can fall into a trap in terms of reducing operational costs by going down this lean approach, let's source bigger contracts.",
                    "label": 0
                },
                {
                    "sent": "Let's turn the contracts over faster.",
                    "label": 0
                },
                {
                    "sent": "Actually, that can be counterproductive because you can take money away from local businesses and you can put it into the hands of larger players who typically win the contracts.",
                    "label": 1
                },
                {
                    "sent": "And if you were to look at the average size of an HS contract in UK which is growing and you look at the criteria for selecting an SMB.",
                    "label": 0
                },
                {
                    "sent": "For winning that contract, you'll find average contract size in relation to the turnover is widening.",
                    "label": 1
                },
                {
                    "sent": "So is it no surprise that we suddenly find the only people who bid for this worker blue chip companies?",
                    "label": 0
                },
                {
                    "sent": "So this is strategy unnecessarily.",
                    "label": 0
                },
                {
                    "sent": "I think it's only intended in terms of driving this challenge into the region.",
                    "label": 0
                },
                {
                    "sent": "There is also a couple of new markets which are now grown in UK, so times are changing.",
                    "label": 1
                },
                {
                    "sent": "One is this idea of community commissioning.",
                    "label": 0
                },
                {
                    "sent": "The idea that you go from center let commissioning actually Commission at a local level.",
                    "label": 0
                },
                {
                    "sent": "That's an ideal opportunity for a statue model because you started to talk about distributed buying and moving the bind away from centralized catalogs.",
                    "label": 1
                },
                {
                    "sent": "The second point is we see a lot more in the growth of personalized care in terms of in the home telling medicine, end of life conditions.",
                    "label": 0
                },
                {
                    "sent": "Again very important.",
                    "label": 0
                },
                {
                    "sent": "And also this is where the patient becomes the customer.",
                    "label": 0
                },
                {
                    "sent": "A traditional model would be that patient would go to the hospital and effectively be treated put through the system as quick as they can.",
                    "label": 0
                },
                {
                    "sent": "What you're going to see in terms of a trend going forward is patient is going to actually source, and by the services, maybe through the Community commissioning process so their entire attitude of the service delivering healthcare has to change.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So some objectives of the paper under the model one was actually to develop the model in terms of Sasha approach for an SMB as an intermediary.",
                    "label": 1
                },
                {
                    "sent": "Highlight some of the potential challenges and difficulties in implementing that model and also to look if the model could actually be implemented and by doing so, producer business plan for the model in terms of the method manzese talk very well about the detailed method.",
                    "label": 1
                },
                {
                    "sent": "Only make three remarks.",
                    "label": 0
                },
                {
                    "sent": "When I looked at the method for this business model, I looked at market context, which includes both the policy and political debates, not just document spends and the technology.",
                    "label": 0
                },
                {
                    "sent": "The second point I'd make it definition modeling process was defined in terms of a group consensus and a third, which I would say is as a research.",
                    "label": 0
                },
                {
                    "sent": "I do her bias so these models are biased by the research in the ecosystem.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, So what have we done?",
                    "label": 0
                },
                {
                    "sent": "Well, today we've got an initial model.",
                    "label": 1
                },
                {
                    "sent": "These are part of the public divorce.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to show this spreadsheet today.",
                    "label": 0
                },
                {
                    "sent": "We will make them available through the coin, profitable.",
                    "label": 0
                },
                {
                    "sent": "We've also got a value proposition for an intermediary using the shoe model and we also did a draft business plan.",
                    "label": 1
                },
                {
                    "sent": "One of the things I will say is if I go with my shopping list to surge in terms of technical architecture, there are six services that we typically see as being important in healthcare reader for this.",
                    "label": 1
                },
                {
                    "sent": "The first thing it's some sort of generic service platform.",
                    "label": 0
                },
                {
                    "sent": "Where you can do search and discovery negotiation services, that is a major advantage to SM ES who want to construct services end to end who want to have some form of interoperability and then compile those services to the end user.",
                    "label": 0
                },
                {
                    "sent": "For the one that's come out of the research recently, human interaction, part of our trials today in the work we've done today, highlighted the importance of human interaction, both in terms of people interacting with the web, but also the web and gaming interacting with people.",
                    "label": 0
                },
                {
                    "sent": "So we've done quite a bit of a push around social networking.",
                    "label": 0
                },
                {
                    "sent": "We don't think in the future people are going to log onto a website and do an Amazon type shopping exercise.",
                    "label": 0
                },
                {
                    "sent": "We think people are going through more social media and social interaction.",
                    "label": 0
                },
                {
                    "sent": "We also think that maybe augmented reality, you may play an important part of this go forward.",
                    "label": 0
                },
                {
                    "sent": "Federer things very important is have a service which can do collaborative product development, semantic sporting services, the big weak spot in the offer at the moment is the ability to reconcile semantically documents treatment pathways between different institutions and between the core and HS system which still would do the hospitalization of the patient.",
                    "label": 0
                },
                {
                    "sent": "Fundamental service needed another one which is just as important as Co developed the skills issue just recently in UK I think yesterday or day before those reports about a nurse.",
                    "label": 0
                },
                {
                    "sent": "And see Nurse who switched off a ventilator by mistake.",
                    "label": 0
                },
                {
                    "sent": "A patient in home.",
                    "label": 0
                },
                {
                    "sent": "The patient went into a coma and she wasn't trained to actually state the patient.",
                    "label": 0
                },
                {
                    "sent": "And that's one of the big issues when we start looking at primary care, we start looking about putting Karen.",
                    "label": 0
                },
                {
                    "sent": "Home is ensuring that the skills based on the currency base is in place, is sure that competent care is given at the point of use, which is one advantage to hospitals have over primary care.",
                    "label": 0
                },
                {
                    "sent": "So there are six services that we would like to see.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It terms of a high level model.",
                    "label": 0
                },
                {
                    "sent": "We basically got 8 boxes.",
                    "label": 0
                },
                {
                    "sent": "The ones are particularly interesting for sales of the provider box to show the dynamic between brothers.",
                    "label": 0
                },
                {
                    "sent": "So rather than writing one big spreadsheet, one big model, we've subdivided the model into these boxes so we can actually do easier management issue.",
                    "label": 0
                },
                {
                    "sent": "I think couple of points to make would be the roles of people involved.",
                    "label": 0
                },
                {
                    "sent": "The commissioning role is pivotal and the role between the provider and the regulator in terms of price.",
                    "label": 0
                },
                {
                    "sent": "Market equilibrium.",
                    "label": 0
                },
                {
                    "sent": "And as part of the scenarios have included the commissioning role in a scenario that commissioning role I think is the key to this business model.",
                    "label": 0
                },
                {
                    "sent": "If that commissioning role goes into a large corporate private or USA United Health then they will drive the sourcing the treatment.",
                    "label": 0
                },
                {
                    "sent": "If I commissioning roll goes into local locality it would drive more distributed delivery and we will see more distributed services and hence a shoe.",
                    "label": 0
                },
                {
                    "sent": "Such fundamental the other thing is important is the role between the Commission of the Regulator in terms of pricing at the moment that tends to be a lot of fixed prices and tariffs.",
                    "label": 0
                },
                {
                    "sent": "What needs to be done in terms of the future is looking at more outcomes and outputs and start to look at the idea that you give a business alone to do treatments, and then if they hit the outcomes that becomes a grant.",
                    "label": 0
                },
                {
                    "sent": "So we need to start subtly changing how is financed in terms of the model.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some variables just to go through some of the basic variables on the input side.",
                    "label": 0
                },
                {
                    "sent": "We're starting to check some utility investment costs.",
                    "label": 1
                },
                {
                    "sent": "There's a big debated question, almost an unknown question at the moment.",
                    "label": 0
                },
                {
                    "sent": "Who will pay for the utility power?",
                    "label": 0
                },
                {
                    "sent": "Utilities start our view is we will see islands of Utility will see Federation of businesses that start to utilizing gain critical mass.",
                    "label": 1
                },
                {
                    "sent": "In terms of generic service platform, there will need to be an operator of that platform who can provide this search and discovery.",
                    "label": 0
                },
                {
                    "sent": "If you're like a Google for service is very important are very key role, one which would have to be regulated in the marketplace.",
                    "label": 0
                },
                {
                    "sent": "Healthcare dividend so moving away from price to prevention, you actually have to invest a bit more in terms of the price for treatment to get more back in terms of reduction in healthcare demand overall so it has to be a cost on.",
                    "label": 0
                },
                {
                    "sent": "So my case would be that this model might state that she's going to cost on not cost off all the time.",
                    "label": 0
                },
                {
                    "sent": "Office Lee startup costs intermediary and then the operating cost intermediary on the revenue side.",
                    "label": 1
                },
                {
                    "sent": "We've started to look at some income streams.",
                    "label": 0
                },
                {
                    "sent": "Subscription Classic One where people sign on to the site to subscribe to services others supplier as a customer transaction would be bourbon per event.",
                    "label": 0
                },
                {
                    "sent": "Applications of it, like the App Store.",
                    "label": 0
                },
                {
                    "sent": "If you have a platform in healthcare and somebody wishes to add honest service, they can effectively give you an application on top and would pay for that another.",
                    "label": 0
                },
                {
                    "sent": "We found successful invent hasbeen success fees and incentive fees.",
                    "label": 1
                },
                {
                    "sent": "If you can do something better than the quoted price then you split the difference between yourself and the Commissioner has been very successful.",
                    "label": 0
                },
                {
                    "sent": "It drives efficiency, it drives effectiveness, and that's been quite a good incentive.",
                    "label": 0
                },
                {
                    "sent": "On further investigation is dynamic pricing.",
                    "label": 0
                },
                {
                    "sent": "And we look at those six areas inventory.",
                    "label": 0
                },
                {
                    "sent": "Look at how in the tree in stocks are used data.",
                    "label": 0
                },
                {
                    "sent": "This is most widely used in people like Google, Facebook with analyze the data start to use it for marketing purposes.",
                    "label": 0
                },
                {
                    "sent": "A gaming look at gaming scenarios where people compete against each other.",
                    "label": 0
                },
                {
                    "sent": "Another cluster example, this will be the stock market machine learning machines that can learn behavior bias and preferences of buyers and how that can be fed into the revenue stream simulations.",
                    "label": 0
                },
                {
                    "sent": "Basically an aggregation the ones above.",
                    "label": 0
                },
                {
                    "sent": "In terms of how we look at an auction, actually functions get a bad rap, but actually auctions can be a very good place to start if you're a new start up in your new market.",
                    "label": 0
                },
                {
                    "sent": "The reason I say that is because your implementation strategy will initially be one of cost and economies of scale so auctions can actually very good place.",
                    "label": 0
                },
                {
                    "sent": "The other thing auctions do is they all should produce what we call market equilibrium between the price and supply and demand, so that's that's the one not to discount it.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On the output side, what we're modeling for the for the intermediate is the obvious one of financials.",
                    "label": 0
                },
                {
                    "sent": "One.",
                    "label": 0
                },
                {
                    "sent": "Would you invest in this intermediary in terms of net present value or internal rate of return to look at the intermediate in terms of cash flow, profit and loss and also its market share from an economic point, we're looking at gross value add, not GDP.",
                    "label": 0
                },
                {
                    "sent": "We're looking at how much value that is created within the region.",
                    "label": 0
                },
                {
                    "sent": "The reason being in the UK healthcare spend has a multiplier effect.",
                    "label": 0
                },
                {
                    "sent": "For every pound you spend in that region, you will create 2 pounds of wealth.",
                    "label": 0
                },
                {
                    "sent": "So where public spending has a multiplier effect, so very important factor theory we're looking at is social jobs created and also well being typical monitors in terms of social activity and the final area is looking at the consumer in terms of how much.",
                    "label": 0
                },
                {
                    "sent": "How much is the consumer?",
                    "label": 0
                },
                {
                    "sent": "Is self directing the budgets, traditionally budgets being directed by the hospitals they cofinance each other, but more and more we're going to see more self directed budgets.",
                    "label": 1
                },
                {
                    "sent": "Where people will hold the money and it will be a market for people to support those people and making the right decision.",
                    "label": 0
                },
                {
                    "sent": "The implementation strategy follows.",
                    "label": 0
                },
                {
                    "sent": "Basically we look at economies of scale.",
                    "label": 1
                },
                {
                    "sent": "Then we follow that by Connie is a scope.",
                    "label": 0
                },
                {
                    "sent": "Once you've got your enterprise, now we're running.",
                    "label": 1
                },
                {
                    "sent": "You can start to look at how you spread services and bring your services in end to end vertical vertical enterprise integration.",
                    "label": 0
                },
                {
                    "sent": "We don't look at this as one stop shop.",
                    "label": 0
                },
                {
                    "sent": "This is about enterprises working end to end in a virtual organization delivering services, and then finally core competence where we start to get knowledge based creation and value creation.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In terms of scenarios that we've generated, we start to look at the axis for building scenarios and we decided on two axes.",
                    "label": 0
                },
                {
                    "sent": "The first taxi was buying power and the other axis was actually the organizational size in that relationship.",
                    "label": 0
                },
                {
                    "sent": "So this one we've got the large organisations dominate the market.",
                    "label": 0
                },
                {
                    "sent": "SMB organizations dominate market, and across the top we've got centralized buying to distributed by now 1.5 makers.",
                    "label": 0
                },
                {
                    "sent": "All these scenarios are in play.",
                    "label": 0
                },
                {
                    "sent": "This isn't about choosing the scenario.",
                    "label": 0
                },
                {
                    "sent": "This is slightly different in our model, these models are active, so we're actually starting to map our activity against the real life activity in the marketplace.",
                    "label": 0
                },
                {
                    "sent": "So the as is condition is what we call corporate health, which is top left.",
                    "label": 0
                },
                {
                    "sent": "We see three scenarios coming.",
                    "label": 0
                },
                {
                    "sent": "Scenario One is an emerging one, and in the UK, Mr. Cameron calls that the big society where we start to see more and more communities taken on board more and more responsibility.",
                    "label": 0
                },
                {
                    "sent": "And actually taking hold of budgets and spending those budgets, that is.",
                    "label": 0
                },
                {
                    "sent": "That is actually in terms of positivity with little crosses is the best one for Sasha.",
                    "label": 0
                },
                {
                    "sent": "If that comes around.",
                    "label": 0
                },
                {
                    "sent": "That is actually a big opportunity for Sasho opportunity.",
                    "label": 0
                },
                {
                    "sent": "There the other factories there legislating UK for 2015, that GPS will do the commissioning.",
                    "label": 0
                },
                {
                    "sent": "So actually our time scales are more around 2015 rather than 2020.",
                    "label": 0
                },
                {
                    "sent": "The other one is above is disruptive health.",
                    "label": 0
                },
                {
                    "sent": "This has some opportunities for Sasho.",
                    "label": 0
                },
                {
                    "sent": "But we think that would be more and around with a big player.",
                    "label": 0
                },
                {
                    "sent": "This is more around the Amazon type shopping where you will have people going on buying health from big large providers over the web.",
                    "label": 0
                },
                {
                    "sent": "The one we think probably negative from Sasha is adoption.",
                    "label": 0
                },
                {
                    "sent": "By default health hubs.",
                    "label": 0
                },
                {
                    "sent": "This is where we think that the corporate health existing MHS will try and defend its turf as taught to put some of the activities into health orbs which it controls in terms of a sachu.",
                    "label": 0
                },
                {
                    "sent": "That's probably a negative we won't won't say Sasha emerge in that scenario.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So some advantages that Sasha could drive from this, while diversity in an ecosystem.",
                    "label": 0
                },
                {
                    "sent": "It is fact and a fundamental ecosystems are diverse by their very nature.",
                    "label": 0
                },
                {
                    "sent": "We think that will be addressed by the search and discovery and ranking of services.",
                    "label": 1
                },
                {
                    "sent": "In terms of the maturity of the mix of people in the ecosystem, we think that the search and discovery where you can have service creation which is aligned to the maturity of the market is very important and we've just one of our big lessons learned.",
                    "label": 0
                },
                {
                    "sent": "In terms of investment for SMS barriers to entry, we think a provision by local intermediary who can then federate with their intermediaries is a very good way into the marketplace for new entrance.",
                    "label": 1
                },
                {
                    "sent": "Look into new forms of collaboration.",
                    "label": 0
                },
                {
                    "sent": "Open innovation.",
                    "label": 0
                },
                {
                    "sent": "We see that the enterprise collaboration in both development and human interaction is a service which will address those, and then finally the procurement aggregation in terms of horizontal scale and vertical complexity, we see that being again innovative services such as trust, legal and commercial social platforms.",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And finally, who will benefit?",
                    "label": 0
                },
                {
                    "sent": "While fundamentally, if you would still benefit, share the first personal benefits as a taxpayer.",
                    "label": 0
                },
                {
                    "sent": "With adoption of the health dividend, more local sourcing using local businesses in the UK, 98.9% of business in UK recipes.",
                    "label": 1
                },
                {
                    "sent": "So if I invest in SMB market ultimately and it's been shown over a number of reports that you can reduce the health care costs, the patient will actually benefit.",
                    "label": 0
                },
                {
                    "sent": "I was talking to a friend of mine who is being treated for cancer and she had to smile because she said to me when everybody comes out of the treatment area, everybody has the same color hair because they've all been given the same colored wig with the same hairstyle.",
                    "label": 0
                },
                {
                    "sent": "So that personalization will lack of personalization has to be present in the marketplace.",
                    "label": 0
                },
                {
                    "sent": "People want to feel that they can customize their treatments, have the point of use more local, so that's going to be a big driver and Sasha could help with that.",
                    "label": 0
                },
                {
                    "sent": "SMS.",
                    "label": 0
                },
                {
                    "sent": "The small, medium, enterprise market the people have been traditionally pushed away, have an opportunity.",
                    "label": 0
                },
                {
                    "sent": "Now the statute to get back into the marketplace.",
                    "label": 0
                },
                {
                    "sent": "Not necessary to be a 50 or 60 provider, but they could be reasonably a second it first here provider.",
                    "label": 1
                },
                {
                    "sent": "And then finally the local community.",
                    "label": 0
                },
                {
                    "sent": "There's a fact in life because you're going to recession.",
                    "label": 0
                },
                {
                    "sent": "The poor become poorer.",
                    "label": 0
                },
                {
                    "sent": "That's a fact I'm afraid, as you have all the spend their cutting spends, they affect the pores of most.",
                    "label": 0
                },
                {
                    "sent": "So if nothing is done in terms of tackling is, the situation will get worse.",
                    "label": 0
                },
                {
                    "sent": "What will actually sees?",
                    "label": 0
                },
                {
                    "sent": "An increase in demand for services in the middle of a recession?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I don't find it funny sufficient in terms of outlook.",
                    "label": 0
                },
                {
                    "sent": "In conclusion, there's a number of factors which we think are coincident, which will mean that this is confident that this could happen.",
                    "label": 0
                },
                {
                    "sent": "One is the EU policy on ICT health.",
                    "label": 0
                },
                {
                    "sent": "the UK government is very clear on this.",
                    "label": 1
                },
                {
                    "sent": "It's just issued a document called Liberating MHS which is driving this area.",
                    "label": 0
                },
                {
                    "sent": "Again, UK public documents been directed more and more to estimate where things are greater awareness in terms of recession, about looking after people who may be more disadvantage because they are most at risk in the market.",
                    "label": 1
                },
                {
                    "sent": "We see a personalized care bridges and long term conditions expanding as a market and we also need an increasing need to manage complexity which is between the patient Now the customer under providers.",
                    "label": 1
                },
                {
                    "sent": "So rather than being one to one, we now seem to be many to many.",
                    "label": 0
                },
                {
                    "sent": "And that.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Donut shop.",
                    "label": 0
                }
            ]
        }
    }
}