{
    "id": "ehsocye7npmsfappkfjcwk4bk7adkuud",
    "title": "Collaborative Learning of Preferences for Recommending Games and Media",
    "info": {
        "author": [
            "Thore Graepel, Microsoft Research, Cambridge, Microsoft Research"
        ],
        "published": "Jan. 24, 2012",
        "recorded": "December 2011",
        "category": [
            "Top->Astronomy->Cosmology"
        ]
    },
    "url": "http://videolectures.net/nipsworkshops2011_graepel_collaborative/",
    "segmentation": [
        [
            "Thank you very much, Martin.",
            "I'd like to point out that this is joint work with Orange Pakaian Tim Solomon's who was an intern with us and also a collaboration with folks at Microsoft R&D in Israel who are currently building a recommendation system for the Xbox Live marketplace.",
            "And I'll take that as my motivation for the talk.",
            "And."
        ],
        [
            "Talk a little bit about what's special about recommendation.",
            "What's actually different from the Netflix kind of problem.",
            "If you have to construct the real recommendation system and then with that motivation, I'll then dive into some modeling and I'll quickly remind you of how inference infecta graphs works, and then use the whole thing as an excuse to present to earlier models for you.",
            "One is the Matchbox model, which is now actually operational.",
            "On that marketplace as a recommender system and the second one is the true skill model and it will turn out that we can combine an idea from this model and an idea from this true skill model in a fruitful way in order to arrive at a collaborative preference learning model and I'll then put that together and present some experiments."
        ],
        [
            "Results so let's start with that."
        ],
        [
            "Motivation so you may be familiar with this device, it's the Xbox 360 and there's an associated online gaming service called Xbox Live which has roughly 35 million users now.",
            "There's also the Kinect here, but that would be a whole other story to tell.",
            "And on this marketplace we are currently selling games and movies were planning to sell music as well and you can see that if you view this as a recommendation system, there's kind of this matrix of users and items and there's going to be a pretty big matrix that we have to deal with, and we're kind of developing this incrementally.",
            "A first step has been published.",
            "There's for the holiday.",
            "You always have to bring out something to please the customers, and we've done that.",
            "And now we're thinking maybe a little deeper into what we want to accomplish.",
            "With such a recommendation system."
        ],
        [
            "So here are just a few games because I will mostly focus on the game recommendation task of world music and videos will be of importance as well.",
            "So you see on Xbox there's a great number of different games.",
            "There's games for children, there's games for me.",
            "There's games for sports fans and you know, Kinect games and so on and so from.",
            "This great variety of games, we'd like to make good recommendations to our custom."
        ],
        [
            "And now I've been talking to various people about this and often they said, alright, yeah, it's like the Netflix problem, isn't it?",
            "You know, we kind of solved it.",
            "It's you know the matrix user item we want to fill in missing values.",
            "And you might argue that two degree.",
            "If that is true, we have that large user item matrix of observations.",
            "And yes, we need to infer for a given user and to give my item how much that user would like that item.",
            "So in that sense there are similarities.",
            "However, there are also differences and you can see from the number of bullet points here that I think there are more differences than their commonalities here, so let me quickly go through those differences.",
            "We actually have very rich user data because the users typically have been on our service for awhile.",
            "They register this additional information.",
            "We also have very rich item metadata because the game is not just an ID, right?",
            "We have stuff in our database about those games.",
            "Furthermore, we have rich user item interaction data.",
            "It's not really that, we just have a rating.",
            "Mostly we don't have a rating actually, but we have all kinds of data about how users have interacted previously with differ."
        ],
        [
            "Games and for the user.",
            "Let's just quickly go through what we have from their registration.",
            "We may have Geo information, maybe language, age, modes of payment, and so on.",
            "We have information about their friends network because on Xbox Live they actually play with other people and so we know with whom they play games.",
            "We may have their skills.",
            "For example, you know people very good at shooters are typically interested in buying the latest shooter.",
            "We have playing habits to the.",
            "Do they play through the day or do they play in evenings and so on?",
            "So there's a lot of user information there, and similarly we also have a lot of item information.",
            "This genre of the game.",
            "There may be a textural description or maybe even reviews that we could use.",
            "We know who the publisher or game developer is the H rating, the price, the release date.",
            "Is it part of a serious?",
            "You know Halo 123?",
            "What are you going to recommend to this guy next?",
            "And so on.",
            "Very rich context here.",
            "And maybe more."
        ],
        [
            "Importantly, even or more difficult to deal with in some sense is that we also have very rich user item interaction data.",
            "You know, in the Netflix challenge, you have this five star system and the users gave that explicit feedback.",
            "But in the context of such a service as Xbox Live, things are a little trickier.",
            "So there's a spectrum of available interaction data.",
            "We do have explicit ratings people can go to a website and write a game if they like to do that, we have clicks or views on the web or on the Xbox if they navigate to an item.",
            "We have purchase and ownership information.",
            "If they buy it on the Xbox then we know that if they buy it in the store and they put it into the Xbox, we can know if they play that game.",
            "If they play it online for example, there's also information like how often they play it, how long they play it, what achievements they have.",
            "These games often have achievements that if you go through various stages of the game you can succeed in acquiring further points.",
            "You know when you kind of score the first goal.",
            "Or you've scored 100 goals in the row or stuff like that.",
            "Only we can also know with whom these things were played, because it's a matchmaking service that creates these multipliers at player settings.",
            "Now an important distinction is that between explicit versus implicit feedback, and I think you heard about this this morning already.",
            "And it's not quite clear how to assign these here.",
            "I think it's pretty clear that five Star ratings is an explicit form of writing.",
            "You know, someone went and wanted to make their opinion known to the service if you like.",
            "And then these clicks or views and even purchase information is probably more like an implicit signal.",
            "These things like play count and play time and so on.",
            "There somewhere in between.",
            "And the reason is that one way you can view this is that on explicit data you can basically do regression or classification directly.",
            "Because you know that they gave her, given that they gave her rating.",
            "What was that rating?",
            "So that's a clearly defined kind of regression problem on implicit rating data.",
            "This is trickier.",
            "For example, someone clicked on something I don't really know what else they've seen that they could have clicked on, but maybe didn't click on.",
            "So it's in that sense, less well defined.",
            "And for this play count and playtime information that we have about users, we actually have an idea of how long they could have played, right?",
            "We know maybe when they bought the item so we have an idea how much time they could have spent on it and if they decided to spend that time on a different item, then clearly there is almost kind of a semi explicit signal there that we can work with and later on I will focus on the display count and play time in."
        ],
        [
            "Formation and that's why I would like to give you just some some data sketches from from the life service.",
            "What you see here is.",
            "The play count how often they actually kind of entered the game, if you like.",
            "And here the play duration.",
            "Each dot.",
            "Here is a game.",
            "Now this is in fact for one single player and this is a pretty prolific guy who spends a lot of time on the service.",
            "So you can see that there is a correlation between how often you play something and how much time you spend in total, but it's not totally clear.",
            "In particular, if you don't play it that often, then there's still a huge variance here as to how long you play it.",
            "Think of this as roughly four to five hours 16,000 seconds.",
            "And the reason for this variability might be the taste of the user, but it can also be the nature of the game.",
            "For example, there are these, you know, RPG titles that people spend ages on playing.",
            "There might be a shooter where you can spend a shorter time.",
            "Maybe it's an arcade game where you can just have a 5 minute interaction with the game.",
            "So that's an interesting plot.",
            "And then here's another one where we have the percent time spent playing each game.",
            "Sorted by that time, so this red user for example, spend maybe 16 to 20% of their time on this one game, and then only 10% of their time on this second game, and so on.",
            "And what we find is that users spend 99% of their playtime off monice small fraction of the games that they own, so it's not clear that owning a game.",
            "That's the message we take, your actually means that that would be a good recommendation for that user, because they might just never play it.",
            "I have one game at home which I actually never played quite a waste.",
            "I should give back.",
            "Um?"
        ],
        [
            "OK, another aspect is that in fact we're not just dealing with a an inference problem, but we're dealing with a decision problem.",
            "We actually need to make a recommendation at the end of the day, and that recommendation might be driven by the preferences of the user, but there might also be other aspects, and if we just take the framework of Bayesian decision theory, then there certainly is an inference aspect there, because we would like to infer the users preferences.",
            "But then there's also a decision.",
            "Which then might be driven by maximizing the expected utility under the beliefs that we've inferred here in the inference step, and then one might ask what those utility's could be.",
            "And for a company, of course, one possible choice would be long term profit, and that is actually also a pretty good choice for the overall ecosystem, because when we say long term profit, that means we need happy users and gamers and give a great experience to them, because otherwise they will leave the service.",
            "We need to make sure that we have good content providers and that they could get good conditions to be on the service and have a profitable life so that they can create great content.",
            "And finally, as the market maker, of course Microsoft would also like to make a profit so the market itself is a complex ecosystem and it's important to see all of these aspects where inference of the user preferences is really only one aspect, but certainly an."
        ],
        [
            "Portant one finally, there's the large scale systems challenge.",
            "I'm not going to talk about it in detail, but just imagine if you have 35 million users as kind of the rows of your matrix and then you have maybe thousands in the area of games to millions in the order of music tracks.",
            "Kind of columns that certainly difficult beast to do inference and to make decisions over, yeah?",
            "I figured it's at least 10 times bigger than that.",
            "Saying why only 35 million users?",
            "Xbox.",
            "Yeah, so these are people who are part of the online service.",
            "So they they are signed up.",
            "You know you can think of basically us having their credit card info.",
            "They could go and immediately make a purchase on the service.",
            "That's roughly what the yeah, more X boxes have been sold, but it's not necessarily more people on the service.",
            "Is the word gender the?",
            "The data you append from gender these at a third dimension in the Matrix, which I see behavior.",
            "I see behavior and I see user vizarro give gender you have you know page.",
            "Well, the way I view it is that instead of having an ID that indexes each row in the sense we have a feature vector that indexes the Rose and also a feature vector that indexes the columns.",
            "But you'll see that from the form of the model.",
            "Yep, that's a good point.",
            "So one issue is learning we want to do training based on user item feedback triples in some sense and need to large scale parallel training algorithms to do that.",
            "But maybe more severe in some sense is that once you want to make your actual recommendation, you need to do that in the split second because the user expects that recommendation here and now and it doesn't only involve making an inference, but for a fixed user you need to basically do a Max over all of your items.",
            "And in order to do that, you know you want to find the best item across all of your items.",
            "And in order to do that, you need clever indexing strategies in order to be able to do that in constant time, ideally.",
            "OK, so that's the large scale challenge, but I'm not."
        ],
        [
            "Going to go into it, but I'm more interested in the preferences here and so the question really is we have all this interaction data of the users with the games or whatever items we're selling them.",
            "How do we infer preferences from that?",
            "And I think that's a very difficult problem in itself, but let me tell you what's currently the case in the system currently.",
            "the Xbox Live Marketplace system that we built uses as input the games owned by each user.",
            "A bit like Amazon would take the books that you've bought, so similar idea here.",
            "It would then predict the probability that a user owns or buys a game based on that fill in the missing piece of the matrix if you like and then.",
            "Make a prediction based on that and make a recommendation based on that.",
            "Now the problem is we can only recommend games to the user that they are in some sense likely to buy anyway right?",
            "Because we use all the games they bought and we can then predict here that this is a typical game that you would buy right?",
            "That's maybe different from what we actually want to do, which is you would like this game if you bought it and it would be a good purchase and that's the problem that we're going to address in this.",
            "New iteration and the question then really is assuming that two games a. NBR available can we really somehow infer that the user likes one better and the idea is we want to use the play time and the play count in account info to infer that?"
        ],
        [
            "So one question would be, can we infer absolute ratings from an interaction?",
            "You might think OK for a given user we know how often they played this game, how long they played it, how often they played that game, how long they played it for.",
            "Does this translate into something like a four star rating for a particular game?",
            "That would be neat right?",
            "Because then instead of asking people to rate stuff, we just observe them and be able to derive the star rating from their behavior.",
            "The problem is that users have different habits and resource is just think of a high school student versus a professional.",
            "They have different resource is in terms of money, but they have different resource is also in terms of time so their behavior will be very different.",
            "The professional playing a game for one hour per week might be might mean that he really likes it.",
            "While for high school student to play a game for one hour probably means that they hate it right?",
            "So in that sense it's hard to come up with an absolute scale.",
            "Now games also have different characteristics and here think again about the complex role playing game versus the shooting game versus the arcade game.",
            "Also, depending on different audiences that they are targeted for, and so the question is, can we infer the preferences for each user, and the hypothesis would be working here with is if two games A&B are available for a user and the user plays a longer or more frequently than B, then they would prefer that game A over that Game B.",
            "Now that at least takes the difference between users out of the equation, right?",
            "Because we're really just saying that user prefers that game to that other game.",
            "It's still problematic with respect to the different types of characteristics that games can have.",
            "And there's also some normalization that you need to think about here.",
            "For example, if a user has owned a game only for 24 hours and has hence gay played the game only for maybe 12 hours if it's Halo or something, then that might be a very strong signal.",
            "But you need to take into account that they only they could have played it only from the time of purchase and they couldn't have played it earlier.",
            "So you could conclude from that that maybe that game is preferred to a game they've owned for a longer time.",
            "Even if they overall played that other game for a longer period of time as well."
        ],
        [
            "So let's come to the inference part, because now that we have a way of deriving preferences for these users, we can now think about how we can build a collaborative recommendation system that would actually predict those those preferences and the modeling framework that I'm going to use here is factor."
        ],
        [
            "Models and just to remind you, factor graphs are a graphical representation of the product structure of functions.",
            "There are these square nodes which are factors, and the circle nodes that are variables, and if there's an edge between a factor and a variable, that means that this factor is a function of that variable and the graph structure will tell us the factorization structure and the inference question that is most frequently asked here is what are the marginals of the function?",
            "That is, what are the?",
            "What's the the value of the function if you sum out all but for example, one variable and that will correspond to the Bayesian posterior.",
            "So here's my one slide kind of factor graph tutorial.",
            "If you like, just in case you're not familiar with this, so here's the well known based law, the probability.",
            "Off they say your parameters given the observations is proportional to the probability of the observations given the parameters times your prior over the parameters you can see here that the factor graph gives us a nice graphical representation of this.",
            "There's two variables X&Y.",
            "And the likelihood connects two of these variables, namely the parameters and the observation, and the prior is only connected to one of these variables, namely the parameters.",
            "So that's kind of the simplest nontrivial fact."
        ],
        [
            "The graph in some sense, and you can now think of more complex ones.",
            "Here you would assume a factorizing prior for example.",
            "And factorizing likelihood.",
            "You can introduce some latent variables here and don't pay any attention to the particular structure of this model.",
            "I just want to quickly explain that you might then be interested in summing out these latent variables.",
            "There's three groups of variables.",
            "Essentially, there are the parameters of interest.",
            "There are these latent variables that you would like to some out, and there's the observation, say, game outcome, or a preference and.",
            "You observe this.",
            "You wanted some out those and you were to obtain, obtain the posteriors over those.",
            "Variables and the way that we like to do this is by message passing.",
            "So for example, if you wanted to calculate the marginal distribution for this variable here, that would mean you want to sum out all of these variables and that gives this nasty some and what this message passing algorithm does is essentially.",
            "Breaks this long computation down into small local computations, which you can see here in the form of these arrows, and so there would be messages coming down from this variable.",
            "Messages coming up from the observation, and then they would reach the target variable, and then we would calculate the posterior is the product of all the incoming messages to this variable, so that's kind of the inference framework with which we're playing.",
            "And it's it's called message passing and can often make inference that is otherwise intractable, tractable.",
            "If the graph structure makes that possible, in particular if it's a tree, like in this case."
        ],
        [
            "Now one problem is that you need compact messages to send around, and a common choice that we're also using here are Gaussian messages, so we would all these little reason results that we send around the graph to be Gaussian and.",
            "The problem is that the exact calculation often doesn't yield a Gaussian.",
            "An example here being that your prior might be Gaussian, but your likelihood would be a step function, and in that case the product of those two, the posterior would be a truncated Gaussian, so would fall outside of the family of the Gaussian distributions that you want to deal with, and I'm in particularly mentioning this because for preference learning this is a very important factor to understand.",
            "Because it basically says that one thing is greater than another, and that's exactly the kind of thing we would like to do if we assume latent utility's to express preferences.",
            "Now the trick is that you can do approximate message passing and the idea is basically that you approximate this posterior by a Gaussian in terms of moment matching.",
            "And then you basically given the prior you solve for the unknown message."
        ],
        [
            "Which that or likelihood that you should have had, assuming that it was Gaussian."
        ],
        [
            "And it will then come out in a Gaussian form.",
            "If this is Gaussian and you'll get a Gaussian approximation to your step function such that your posterior is as close as possible to the desired posterior.",
            "And that's basically the idea between expectation propagation and and approximate message passing.",
            "So this is a bit we'll need, and it's also kind of I'm presenting it because it's a relatively universal building block that you might need if you want to deal with latent utility models for preferences."
        ],
        [
            "OK, so now let me move on to the first of these two component models, the Matchbox model.",
            "And remember, this is basically the model that's currently in operation since we last week launched the service on Xbox Live and it's a collaborative filtering model that takes into account the metadata because it uses not indices of, but feature vectors too.",
            "To identify the users in the items in the collaborative filtering."
        ],
        [
            "Problem so this is joint work with David Stern and Ralf Herbrich."
        ],
        [
            "And the idea is to map users and items into a common trait space.",
            "In this case, for visualization purposes, 2 dimensional and the idea is to have a linear mapping, and that's this.",
            "Mapping will be the parameters to be learned from a feature representation of the user.",
            "For example, in terms of their user ID in terms of their gender in terms of their country or in terms of their height or whatever other things you have to describe a user.",
            "Into this feature space and on the other side we would have descriptors of the item, and again there would be a linear mapping into this trade space.",
            "Say you have the item ID and the movie genre.",
            "If these were movies and the idea here of the generative process that I'm describing is now that the inner product between this vector here and that vector there one representing the user, the other representing the item that that inner product.",
            "Would yield the rating, so if they were orthogonal that would be a kind of average rating.",
            "If they were aligned, that would be a positive rating.",
            "If they were pointing in opposite directions, that would be a negative rating, so that's the generative process.",
            "Then in fact we observe if this user likes that item, and then we invert that process in order to learn what these mappings of the features of users and items into this space are.",
            "AM."
        ],
        [
            "Let me quickly show you the factor graph, so we have these weights for different features that map into the user traits.",
            "Here another user, trait, item trait, another item trait.",
            "Now we have this 2 dimensional vector that represents the user.",
            "The two dimensional vector that represents the item.",
            "We take the inner product of those and that gives us a rating.",
            "And now you might ask, how do you do the message pass?"
        ],
        [
            "And here are let me algebraically.",
            "Maybe that's also a good thing to say is that basically we have this linear transformation of the feature vector for the user into the latent space.",
            "The feature vector of the item into the latent space U&V will be learned and the rating potential is then Gaussian.",
            "Weather mean is the inner product of these trade vectors.",
            "Yep, do you have a?",
            "Observation dependent transformation.",
            "I don't quite understand what.",
            "I.",
            "An observation dependent inquiry.",
            "What do you do when you have partial data?",
            "Oh, OK, no, it's not taken into account here, so it's a conditional model.",
            "It conditions on those observations and we're in trouble if we don't have them.",
            "We need to fudge it.",
            "Observation dependent transformation.",
            "Yeah, I guess I guess you could do that.",
            "I mean the the real way to deal with that would be a generative model.",
            "Also of those properties I think.",
            "But yeah, we have to do a trick here, so to speak."
        ],
        [
            "Now let me quickly show.",
            "Suppose we have some priors on these weights that do the transformation into that space.",
            "Then we would pass these messages down here.",
            "That would be a prediction that comes out of it.",
            "In fact, if we observe a rating, then that message would come up here and be processed through this inner product and lead to an update of these independent Gaussian.",
            "Prior slash posteriors that we're using for these weights, so that's roughly how the inference works."
        ],
        [
            "And we're using infer.net.",
            "This is a framework that's developed at MSR Cambridge for inference in this type of model.",
            "It's available on the web if you're."
        ],
        [
            "Interested now, here's a visualization of what things look like in this straight space, so again, there's a 2 dimensional trade space.",
            "In practice, think 1020 maybe up to 50 dimensional trade space and what we have here is that these little dots are users and the red dots are movies and they get by the algorithm they get somehow distributed in this space.",
            "And then if I have a particular user like this one, then you can think of this.",
            "Preference cone here.",
            "As the movies that that user would like because they are close in inner product right and stuff that's opposite in the opposite direction there.",
            "That's a movie that that guy wouldn't like, so this seems like a fairly mainstream user.",
            "Somewhere between a nights tale and Cinderella Cinderella story.",
            "And what you can also see here is that the same embedding of course allows us to do user, user and item item similarities as a byproduct because they're all embedded in the same space.",
            "Yep."
        ],
        [
            "Good, that's ingredient number one.",
            "That's how we would like to handle the collaborative aspect and.",
            "Really, and the second ingredient is that."
        ],
        [
            "True Skill model joint work with Ralph Herbrich to Minke and."
        ],
        [
            "Others, and this is a model that was originally device for ranking and matchmaking on Xbox Live and it is in fact this skill estimates and it is a development from the eloe system which was a similar system for chess using approximate maximum likelihood for a two player game, and we've generalized that to a Bayesian system which can take into account teams and more than two."
        ],
        [
            "Parties, so the idea here is basically that we have these match outcomes and their orderings among K teams of a different number of players, and we would like to estimate the underlying skills of players from this.",
            "From such data, to get a global ranking of players and to create fair matches among players.",
            "Because if we estimate their skills, we can then bring players together who have similar skills and they'll have fun matches."
        ],
        [
            "So this is kind of here.",
            "You see a team game Red versus blue with individual players, Red wins, and that's would be one data point from which we can then update the skills of these user."
        ],
        [
            "See 'em.",
            "You can also."
        ],
        [
            "Evan, that might be more relevant here.",
            "A game of eight individual players and we would then update the skills of these eight players from this data point.",
            "Now note the similarity.",
            "Now think of these these as the preferences of a user and you have the analogy between the two systems, because the user might have said that this game is better than that game is better than that game, and so on.",
            "And it's the same ranking structure that we're going to use in the."
        ],
        [
            "Likelihood, let me be quick here."
        ],
        [
            "And just get to the model the."
        ],
        [
            "Model that we want to use here and it's going to be the bottom part of the preference model I'm talking about is that we have three teams.",
            "This has one player.",
            "This is two players.",
            "This is one player again and we think of a generative model where these teams have noisy performances, so to speak.",
            "In there in a particular game, and we then observe a game outcome between them.",
            "For example, team one wins over team two wins over Team 3.",
            "Now one."
        ],
        [
            "We know that we can encode it in a chain down here because we just need to say that the apparently the performance of team one was greater than that of team two and that of team two must have been greater than that of team three, and the idea is then to use message passing to infer what their underlying skills might have been."
        ],
        [
            "And here you see the factor graph encoding where this is a gauss dieser, Gaussian prior factors and this is the ranking likelihood in this model.",
            "And this is the same ranking likelihood that we will use in order to deal with preferences.",
            "Individual skills such as jumping across for you type out groups of skills and tokenization.",
            "Yeah, skill just in the sense that how well I can we predict that you do in playing this game.",
            "So it's really an aggregate skill of playing a particular game.",
            "Well, that's the meaning here.",
            "And that's how the message passing works.",
            "I won't go into the deep."
        ],
        [
            "Sales and in online gaming.",
            "What this allows you to do is to get a global ranking of players because you pretty much stitched together all of these individual game results into an integral."
        ],
        [
            "Mobile ranking and it allows you to do matchmaking and create matches that are both interesting for the players.",
            "Because there's a 5050 chance of winning or losing, which makes it interesting and there are also the most informative metrics.",
            "If you're still uncertain about players, so we are at the same time pleasing our audience and gaining more information from them."
        ],
        [
            "Just to show that the Bayesian system has much higher convergence rate than the original Elo system."
        ],
        [
            "And I won't go into the details here, but this may be it just one number I need to mention here is that may be partly due to our system an incredible number of hours in the billions has been, some people would say wasted on these games because it is so compelling to compete in well, matchmade games."
        ],
        [
            "OK, I won't go into this, although I like showing movies."
        ],
        [
            "And let."
        ],
        [
            "Me get into.",
            "You know you can infer different skill distributions for different games.",
            "This is a golf game, which is very difficult and there will be a broad skill distribution where, well, this is, you know, a pure chance game where there is really no way of making progress.",
            "If you are not law."
        ],
        [
            "Keep.",
            "So let's put it together, Matchbox."
        ],
        [
            "For preferences we want to combine the collaborative Matchbox model with the true skill preference model and the ideas that for each user we derive a chain of preferences based on how often or how long they've played the game, either by asking them or by using interaction data and the analogy to the true skill thing is that if a user has played a longer than B, then that's in.",
            "True skill would correspond to game a winning over a game be that's kind of the semantic correspondence that I'm talking about.",
            "And we would then like to learn those relative user preferences in a collaborative way by embedding users and items again in this."
        ],
        [
            "I'm in space and you can see here how this would work.",
            "There would be 1 user and in this case two games embedded in this space and there would be an implicit rating that Matchbox gives to game one and an implicit rating.",
            "That Matchbox gives to Game 2."
        ],
        [
            "And then with this."
        ],
        [
            "Data type, we would then say OK if writing.",
            "If the user prefers this game to that game, then that means that the difference between this rating and that rating must have been positive.",
            "That this rating is greater than that rating.",
            "So in that way you get this implicit preference data in and this is just for two games, but you can do this efficiently for an entire chain of games.",
            "So if someone owns 10 games and we have a ranking of 10 games, then we can deal."
        ],
        [
            "That in this setting, so some experimental."
        ],
        [
            "Results we came across this sushi preference data which is a nice kind of experimental playground by can be Shima and the sushi Eaters were asked to rank 10 sushis and to do that twice to to create 210 rankings of sushi so to speak.",
            "And the task is to take the first ranking and predict what the second ranking on some other sushi items for that user would be.",
            "And we can use this."
        ],
        [
            "Combined Matchbox true skill kind of preference model to do that.",
            "There are different inference methods that we use, but essentially we come out quite a bit ahead to their relatively simple model that they developed in the context of this sushi study.",
            "So the collaborative approach together with the principle treating of the preferences in the Bayesian framework does seem to help in terms of the rank correlation.",
            "The observed preference data."
        ],
        [
            "Now what you see here is how the trade dimension matters.",
            "So you have the usual effect that adding more trade dimensions helps, but that the effect somehow tails off at some point and that you know 20."
        ],
        [
            "5 dimensions are plenty.",
            "We've done preliminary tests on the Xbox data, so we did what I described earlier.",
            "We looked at how often or how long people played certain games created for each user.",
            "These craft preference chains and then test it on randomly selected pairs of games to figure out.",
            "You know if A is preferred to be or be preferred to a in the test set and we have an accuracy of 72% here.",
            "But I have to say that a lot of it is still driven by popularity, which is always a huge signal in these things, right?",
            "There is 1 popular game and everyone buys it.",
            "And what we're really interested in this kind of the individual taste that is orthogonal to that popular."
        ],
        [
            "Pretty.",
            "OK, let me."
        ],
        [
            "Skip that and just come to the conclusions I would like as one outcome.",
            "I would like you to believe now that real world recommendation is a much more complex task than the Netflix challenge might have made.",
            "Some people believe there's richer user, there's richer item data, there's richer user item interaction data.",
            "There's additional decision criteria.",
            "There's the issue of exploration versus exploitation.",
            "Their system challenges, and so on.",
            "And we try to make some progress by creating a system that carefully analyzes what the actual user preferences are, how we can tease them out of the signal, and how we can collaboratively model and predict."
        ],
        [
            "For future work, there's plenty to do.",
            "The first thing might be, how can we actually derive preferences in a more principled way from interaction data?",
            "Maybe we can learn it if we have supervised kind of rating data and interaction data, can we?",
            "Can we correlate that?",
            "Is that maybe a separate learning task we would like to use active learning to maybe just ask the users often we forget the simplest thing, right?",
            "Usually if someone comes to you, and once you might ask them, would you like this or would you like that maybe we should ask them?",
            "So we can learn better and there's an element of active learning.",
            "Then there's an interesting problem that often multiple users are hiding behind an account.",
            "Mother and child, for example, might have the same account, but the games would be very different that they would like.",
            "There's the exploration exploitation thing.",
            "And finally, we're also looking to find a good scalable architecture that doesn't only work for games, but also for music, videos and other things.",
            "Alright, thanks.",
            "Do you have any questions?",
            "Do you have any plan to incorporate some idea about the scale of preference?",
            "Like five stars, one stronger but feels too?",
            "Yeah, I mean these these are tricky because they kind of presume on an absolute scale, right?",
            "And that is difficult in this work.",
            "We were really trying to use pairwise different preferences because users seem to be better at saying I like this better than that, rather than saying this is a five star and this is a 3 star.",
            "And there are psychological studies who show this, but once we, if we have that kind of data, we would like to incorporate it.",
            "Visit, wait, I can play a game like you know, three days in a row wins without getting under pay for five minutes.",
            "It's a stronger indicator of reference.",
            "Maybe that now.",
            "Yeah, and that's where we take playtime as well, yeah.",
            "Play time is superior than people go wild and then try to compare this game.",
            "So yeah, see that the time, the time, how often someone plays is also a strong indicator because every time they picked up the game again right?",
            "So yeah, we think it's a learning problem.",
            "We want to learn from the data.",
            "What is the better indicator?",
            "But I'm just not clear what the supervision signal will be.",
            "What features did you have about the users animal sushi model?",
            "Yeah, there are some some relatively arcane features.",
            "I mean, they did fill in questionnaires answering some general preference questions before that, but it turns out in this case we didn't use those because they are actually very strong predictors already.",
            "Those preference data that they.",
            "Features that you have there and so in order to study the effect based on the actual rankings.",
            "We left them out of this study.",
            "Last question, bill.",
            "Skip it, skip in.",
            "Someone says things like this narrow coding preferences going to model this user.",
            "So no, then fun buying movies.",
            "I tend to buy the best and a certain number of different categories and I'm not interested in Europe, mediocre ones in those categories, but I certainly can't rank my preferences simply by one particular type of thing.",
            "Yeah it.",
            "Already then, yeah, yeah, I agree.",
            "But on the other hand, don't underestimate the difficulty of imagining what that cone looks like in 20 or 50 dimensions.",
            "It's not.",
            "So I mean here, it looks like you have made your choice for that part of the space rather than that, but now imagine you have 19 or 18 more dimensions to play with.",
            "That can be a richer cone, right?",
            "So the model capacity can be ramped up almost arbitrarily by increasing the dimension, so I wouldn't be too worried about that.",
            "But another problem that is highlighted here is again that popularity stuff as well.",
            "So certain things the user gets exposed to anyway through the top 10 list and you know through through global popularity and in some sense what we would like to do is model orthogonal to that and figure out what the specific things are that the user might not get exposed to through the usual means, but which might still be interesting.",
            "And yeah, it's more complex than a cone, I agree, it's just our first shot at it.",
            "OK, I think we have to stop, but thanks a lot for a great talk."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you very much, Martin.",
                    "label": 0
                },
                {
                    "sent": "I'd like to point out that this is joint work with Orange Pakaian Tim Solomon's who was an intern with us and also a collaboration with folks at Microsoft R&D in Israel who are currently building a recommendation system for the Xbox Live marketplace.",
                    "label": 1
                },
                {
                    "sent": "And I'll take that as my motivation for the talk.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Talk a little bit about what's special about recommendation.",
                    "label": 0
                },
                {
                    "sent": "What's actually different from the Netflix kind of problem.",
                    "label": 0
                },
                {
                    "sent": "If you have to construct the real recommendation system and then with that motivation, I'll then dive into some modeling and I'll quickly remind you of how inference infecta graphs works, and then use the whole thing as an excuse to present to earlier models for you.",
                    "label": 0
                },
                {
                    "sent": "One is the Matchbox model, which is now actually operational.",
                    "label": 1
                },
                {
                    "sent": "On that marketplace as a recommender system and the second one is the true skill model and it will turn out that we can combine an idea from this model and an idea from this true skill model in a fruitful way in order to arrive at a collaborative preference learning model and I'll then put that together and present some experiments.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Results so let's start with that.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Motivation so you may be familiar with this device, it's the Xbox 360 and there's an associated online gaming service called Xbox Live which has roughly 35 million users now.",
                    "label": 1
                },
                {
                    "sent": "There's also the Kinect here, but that would be a whole other story to tell.",
                    "label": 0
                },
                {
                    "sent": "And on this marketplace we are currently selling games and movies were planning to sell music as well and you can see that if you view this as a recommendation system, there's kind of this matrix of users and items and there's going to be a pretty big matrix that we have to deal with, and we're kind of developing this incrementally.",
                    "label": 0
                },
                {
                    "sent": "A first step has been published.",
                    "label": 0
                },
                {
                    "sent": "There's for the holiday.",
                    "label": 0
                },
                {
                    "sent": "You always have to bring out something to please the customers, and we've done that.",
                    "label": 0
                },
                {
                    "sent": "And now we're thinking maybe a little deeper into what we want to accomplish.",
                    "label": 0
                },
                {
                    "sent": "With such a recommendation system.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here are just a few games because I will mostly focus on the game recommendation task of world music and videos will be of importance as well.",
                    "label": 0
                },
                {
                    "sent": "So you see on Xbox there's a great number of different games.",
                    "label": 0
                },
                {
                    "sent": "There's games for children, there's games for me.",
                    "label": 0
                },
                {
                    "sent": "There's games for sports fans and you know, Kinect games and so on and so from.",
                    "label": 0
                },
                {
                    "sent": "This great variety of games, we'd like to make good recommendations to our custom.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And now I've been talking to various people about this and often they said, alright, yeah, it's like the Netflix problem, isn't it?",
                    "label": 1
                },
                {
                    "sent": "You know, we kind of solved it.",
                    "label": 0
                },
                {
                    "sent": "It's you know the matrix user item we want to fill in missing values.",
                    "label": 0
                },
                {
                    "sent": "And you might argue that two degree.",
                    "label": 0
                },
                {
                    "sent": "If that is true, we have that large user item matrix of observations.",
                    "label": 0
                },
                {
                    "sent": "And yes, we need to infer for a given user and to give my item how much that user would like that item.",
                    "label": 0
                },
                {
                    "sent": "So in that sense there are similarities.",
                    "label": 0
                },
                {
                    "sent": "However, there are also differences and you can see from the number of bullet points here that I think there are more differences than their commonalities here, so let me quickly go through those differences.",
                    "label": 0
                },
                {
                    "sent": "We actually have very rich user data because the users typically have been on our service for awhile.",
                    "label": 0
                },
                {
                    "sent": "They register this additional information.",
                    "label": 0
                },
                {
                    "sent": "We also have very rich item metadata because the game is not just an ID, right?",
                    "label": 0
                },
                {
                    "sent": "We have stuff in our database about those games.",
                    "label": 0
                },
                {
                    "sent": "Furthermore, we have rich user item interaction data.",
                    "label": 0
                },
                {
                    "sent": "It's not really that, we just have a rating.",
                    "label": 0
                },
                {
                    "sent": "Mostly we don't have a rating actually, but we have all kinds of data about how users have interacted previously with differ.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Games and for the user.",
                    "label": 0
                },
                {
                    "sent": "Let's just quickly go through what we have from their registration.",
                    "label": 0
                },
                {
                    "sent": "We may have Geo information, maybe language, age, modes of payment, and so on.",
                    "label": 0
                },
                {
                    "sent": "We have information about their friends network because on Xbox Live they actually play with other people and so we know with whom they play games.",
                    "label": 0
                },
                {
                    "sent": "We may have their skills.",
                    "label": 0
                },
                {
                    "sent": "For example, you know people very good at shooters are typically interested in buying the latest shooter.",
                    "label": 0
                },
                {
                    "sent": "We have playing habits to the.",
                    "label": 1
                },
                {
                    "sent": "Do they play through the day or do they play in evenings and so on?",
                    "label": 0
                },
                {
                    "sent": "So there's a lot of user information there, and similarly we also have a lot of item information.",
                    "label": 0
                },
                {
                    "sent": "This genre of the game.",
                    "label": 0
                },
                {
                    "sent": "There may be a textural description or maybe even reviews that we could use.",
                    "label": 0
                },
                {
                    "sent": "We know who the publisher or game developer is the H rating, the price, the release date.",
                    "label": 1
                },
                {
                    "sent": "Is it part of a serious?",
                    "label": 0
                },
                {
                    "sent": "You know Halo 123?",
                    "label": 0
                },
                {
                    "sent": "What are you going to recommend to this guy next?",
                    "label": 1
                },
                {
                    "sent": "And so on.",
                    "label": 0
                },
                {
                    "sent": "Very rich context here.",
                    "label": 0
                },
                {
                    "sent": "And maybe more.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Importantly, even or more difficult to deal with in some sense is that we also have very rich user item interaction data.",
                    "label": 0
                },
                {
                    "sent": "You know, in the Netflix challenge, you have this five star system and the users gave that explicit feedback.",
                    "label": 0
                },
                {
                    "sent": "But in the context of such a service as Xbox Live, things are a little trickier.",
                    "label": 0
                },
                {
                    "sent": "So there's a spectrum of available interaction data.",
                    "label": 1
                },
                {
                    "sent": "We do have explicit ratings people can go to a website and write a game if they like to do that, we have clicks or views on the web or on the Xbox if they navigate to an item.",
                    "label": 0
                },
                {
                    "sent": "We have purchase and ownership information.",
                    "label": 0
                },
                {
                    "sent": "If they buy it on the Xbox then we know that if they buy it in the store and they put it into the Xbox, we can know if they play that game.",
                    "label": 0
                },
                {
                    "sent": "If they play it online for example, there's also information like how often they play it, how long they play it, what achievements they have.",
                    "label": 0
                },
                {
                    "sent": "These games often have achievements that if you go through various stages of the game you can succeed in acquiring further points.",
                    "label": 0
                },
                {
                    "sent": "You know when you kind of score the first goal.",
                    "label": 0
                },
                {
                    "sent": "Or you've scored 100 goals in the row or stuff like that.",
                    "label": 0
                },
                {
                    "sent": "Only we can also know with whom these things were played, because it's a matchmaking service that creates these multipliers at player settings.",
                    "label": 0
                },
                {
                    "sent": "Now an important distinction is that between explicit versus implicit feedback, and I think you heard about this this morning already.",
                    "label": 0
                },
                {
                    "sent": "And it's not quite clear how to assign these here.",
                    "label": 0
                },
                {
                    "sent": "I think it's pretty clear that five Star ratings is an explicit form of writing.",
                    "label": 0
                },
                {
                    "sent": "You know, someone went and wanted to make their opinion known to the service if you like.",
                    "label": 1
                },
                {
                    "sent": "And then these clicks or views and even purchase information is probably more like an implicit signal.",
                    "label": 1
                },
                {
                    "sent": "These things like play count and play time and so on.",
                    "label": 0
                },
                {
                    "sent": "There somewhere in between.",
                    "label": 0
                },
                {
                    "sent": "And the reason is that one way you can view this is that on explicit data you can basically do regression or classification directly.",
                    "label": 0
                },
                {
                    "sent": "Because you know that they gave her, given that they gave her rating.",
                    "label": 0
                },
                {
                    "sent": "What was that rating?",
                    "label": 0
                },
                {
                    "sent": "So that's a clearly defined kind of regression problem on implicit rating data.",
                    "label": 0
                },
                {
                    "sent": "This is trickier.",
                    "label": 0
                },
                {
                    "sent": "For example, someone clicked on something I don't really know what else they've seen that they could have clicked on, but maybe didn't click on.",
                    "label": 0
                },
                {
                    "sent": "So it's in that sense, less well defined.",
                    "label": 0
                },
                {
                    "sent": "And for this play count and playtime information that we have about users, we actually have an idea of how long they could have played, right?",
                    "label": 0
                },
                {
                    "sent": "We know maybe when they bought the item so we have an idea how much time they could have spent on it and if they decided to spend that time on a different item, then clearly there is almost kind of a semi explicit signal there that we can work with and later on I will focus on the display count and play time in.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Formation and that's why I would like to give you just some some data sketches from from the life service.",
                    "label": 0
                },
                {
                    "sent": "What you see here is.",
                    "label": 0
                },
                {
                    "sent": "The play count how often they actually kind of entered the game, if you like.",
                    "label": 0
                },
                {
                    "sent": "And here the play duration.",
                    "label": 0
                },
                {
                    "sent": "Each dot.",
                    "label": 0
                },
                {
                    "sent": "Here is a game.",
                    "label": 0
                },
                {
                    "sent": "Now this is in fact for one single player and this is a pretty prolific guy who spends a lot of time on the service.",
                    "label": 0
                },
                {
                    "sent": "So you can see that there is a correlation between how often you play something and how much time you spend in total, but it's not totally clear.",
                    "label": 0
                },
                {
                    "sent": "In particular, if you don't play it that often, then there's still a huge variance here as to how long you play it.",
                    "label": 0
                },
                {
                    "sent": "Think of this as roughly four to five hours 16,000 seconds.",
                    "label": 0
                },
                {
                    "sent": "And the reason for this variability might be the taste of the user, but it can also be the nature of the game.",
                    "label": 0
                },
                {
                    "sent": "For example, there are these, you know, RPG titles that people spend ages on playing.",
                    "label": 0
                },
                {
                    "sent": "There might be a shooter where you can spend a shorter time.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's an arcade game where you can just have a 5 minute interaction with the game.",
                    "label": 0
                },
                {
                    "sent": "So that's an interesting plot.",
                    "label": 0
                },
                {
                    "sent": "And then here's another one where we have the percent time spent playing each game.",
                    "label": 1
                },
                {
                    "sent": "Sorted by that time, so this red user for example, spend maybe 16 to 20% of their time on this one game, and then only 10% of their time on this second game, and so on.",
                    "label": 0
                },
                {
                    "sent": "And what we find is that users spend 99% of their playtime off monice small fraction of the games that they own, so it's not clear that owning a game.",
                    "label": 0
                },
                {
                    "sent": "That's the message we take, your actually means that that would be a good recommendation for that user, because they might just never play it.",
                    "label": 0
                },
                {
                    "sent": "I have one game at home which I actually never played quite a waste.",
                    "label": 0
                },
                {
                    "sent": "I should give back.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, another aspect is that in fact we're not just dealing with a an inference problem, but we're dealing with a decision problem.",
                    "label": 1
                },
                {
                    "sent": "We actually need to make a recommendation at the end of the day, and that recommendation might be driven by the preferences of the user, but there might also be other aspects, and if we just take the framework of Bayesian decision theory, then there certainly is an inference aspect there, because we would like to infer the users preferences.",
                    "label": 0
                },
                {
                    "sent": "But then there's also a decision.",
                    "label": 0
                },
                {
                    "sent": "Which then might be driven by maximizing the expected utility under the beliefs that we've inferred here in the inference step, and then one might ask what those utility's could be.",
                    "label": 0
                },
                {
                    "sent": "And for a company, of course, one possible choice would be long term profit, and that is actually also a pretty good choice for the overall ecosystem, because when we say long term profit, that means we need happy users and gamers and give a great experience to them, because otherwise they will leave the service.",
                    "label": 0
                },
                {
                    "sent": "We need to make sure that we have good content providers and that they could get good conditions to be on the service and have a profitable life so that they can create great content.",
                    "label": 0
                },
                {
                    "sent": "And finally, as the market maker, of course Microsoft would also like to make a profit so the market itself is a complex ecosystem and it's important to see all of these aspects where inference of the user preferences is really only one aspect, but certainly an.",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Portant one finally, there's the large scale systems challenge.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to talk about it in detail, but just imagine if you have 35 million users as kind of the rows of your matrix and then you have maybe thousands in the area of games to millions in the order of music tracks.",
                    "label": 0
                },
                {
                    "sent": "Kind of columns that certainly difficult beast to do inference and to make decisions over, yeah?",
                    "label": 0
                },
                {
                    "sent": "I figured it's at least 10 times bigger than that.",
                    "label": 0
                },
                {
                    "sent": "Saying why only 35 million users?",
                    "label": 1
                },
                {
                    "sent": "Xbox.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so these are people who are part of the online service.",
                    "label": 0
                },
                {
                    "sent": "So they they are signed up.",
                    "label": 0
                },
                {
                    "sent": "You know you can think of basically us having their credit card info.",
                    "label": 0
                },
                {
                    "sent": "They could go and immediately make a purchase on the service.",
                    "label": 0
                },
                {
                    "sent": "That's roughly what the yeah, more X boxes have been sold, but it's not necessarily more people on the service.",
                    "label": 0
                },
                {
                    "sent": "Is the word gender the?",
                    "label": 0
                },
                {
                    "sent": "The data you append from gender these at a third dimension in the Matrix, which I see behavior.",
                    "label": 0
                },
                {
                    "sent": "I see behavior and I see user vizarro give gender you have you know page.",
                    "label": 0
                },
                {
                    "sent": "Well, the way I view it is that instead of having an ID that indexes each row in the sense we have a feature vector that indexes the Rose and also a feature vector that indexes the columns.",
                    "label": 0
                },
                {
                    "sent": "But you'll see that from the form of the model.",
                    "label": 0
                },
                {
                    "sent": "Yep, that's a good point.",
                    "label": 0
                },
                {
                    "sent": "So one issue is learning we want to do training based on user item feedback triples in some sense and need to large scale parallel training algorithms to do that.",
                    "label": 1
                },
                {
                    "sent": "But maybe more severe in some sense is that once you want to make your actual recommendation, you need to do that in the split second because the user expects that recommendation here and now and it doesn't only involve making an inference, but for a fixed user you need to basically do a Max over all of your items.",
                    "label": 1
                },
                {
                    "sent": "And in order to do that, you know you want to find the best item across all of your items.",
                    "label": 0
                },
                {
                    "sent": "And in order to do that, you need clever indexing strategies in order to be able to do that in constant time, ideally.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's the large scale challenge, but I'm not.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Going to go into it, but I'm more interested in the preferences here and so the question really is we have all this interaction data of the users with the games or whatever items we're selling them.",
                    "label": 0
                },
                {
                    "sent": "How do we infer preferences from that?",
                    "label": 1
                },
                {
                    "sent": "And I think that's a very difficult problem in itself, but let me tell you what's currently the case in the system currently.",
                    "label": 0
                },
                {
                    "sent": "the Xbox Live Marketplace system that we built uses as input the games owned by each user.",
                    "label": 1
                },
                {
                    "sent": "A bit like Amazon would take the books that you've bought, so similar idea here.",
                    "label": 0
                },
                {
                    "sent": "It would then predict the probability that a user owns or buys a game based on that fill in the missing piece of the matrix if you like and then.",
                    "label": 0
                },
                {
                    "sent": "Make a prediction based on that and make a recommendation based on that.",
                    "label": 0
                },
                {
                    "sent": "Now the problem is we can only recommend games to the user that they are in some sense likely to buy anyway right?",
                    "label": 1
                },
                {
                    "sent": "Because we use all the games they bought and we can then predict here that this is a typical game that you would buy right?",
                    "label": 0
                },
                {
                    "sent": "That's maybe different from what we actually want to do, which is you would like this game if you bought it and it would be a good purchase and that's the problem that we're going to address in this.",
                    "label": 0
                },
                {
                    "sent": "New iteration and the question then really is assuming that two games a. NBR available can we really somehow infer that the user likes one better and the idea is we want to use the play time and the play count in account info to infer that?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So one question would be, can we infer absolute ratings from an interaction?",
                    "label": 0
                },
                {
                    "sent": "You might think OK for a given user we know how often they played this game, how long they played it, how often they played that game, how long they played it for.",
                    "label": 0
                },
                {
                    "sent": "Does this translate into something like a four star rating for a particular game?",
                    "label": 0
                },
                {
                    "sent": "That would be neat right?",
                    "label": 0
                },
                {
                    "sent": "Because then instead of asking people to rate stuff, we just observe them and be able to derive the star rating from their behavior.",
                    "label": 0
                },
                {
                    "sent": "The problem is that users have different habits and resource is just think of a high school student versus a professional.",
                    "label": 0
                },
                {
                    "sent": "They have different resource is in terms of money, but they have different resource is also in terms of time so their behavior will be very different.",
                    "label": 0
                },
                {
                    "sent": "The professional playing a game for one hour per week might be might mean that he really likes it.",
                    "label": 0
                },
                {
                    "sent": "While for high school student to play a game for one hour probably means that they hate it right?",
                    "label": 0
                },
                {
                    "sent": "So in that sense it's hard to come up with an absolute scale.",
                    "label": 0
                },
                {
                    "sent": "Now games also have different characteristics and here think again about the complex role playing game versus the shooting game versus the arcade game.",
                    "label": 0
                },
                {
                    "sent": "Also, depending on different audiences that they are targeted for, and so the question is, can we infer the preferences for each user, and the hypothesis would be working here with is if two games A&B are available for a user and the user plays a longer or more frequently than B, then they would prefer that game A over that Game B.",
                    "label": 1
                },
                {
                    "sent": "Now that at least takes the difference between users out of the equation, right?",
                    "label": 0
                },
                {
                    "sent": "Because we're really just saying that user prefers that game to that other game.",
                    "label": 0
                },
                {
                    "sent": "It's still problematic with respect to the different types of characteristics that games can have.",
                    "label": 0
                },
                {
                    "sent": "And there's also some normalization that you need to think about here.",
                    "label": 0
                },
                {
                    "sent": "For example, if a user has owned a game only for 24 hours and has hence gay played the game only for maybe 12 hours if it's Halo or something, then that might be a very strong signal.",
                    "label": 0
                },
                {
                    "sent": "But you need to take into account that they only they could have played it only from the time of purchase and they couldn't have played it earlier.",
                    "label": 0
                },
                {
                    "sent": "So you could conclude from that that maybe that game is preferred to a game they've owned for a longer time.",
                    "label": 0
                },
                {
                    "sent": "Even if they overall played that other game for a longer period of time as well.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's come to the inference part, because now that we have a way of deriving preferences for these users, we can now think about how we can build a collaborative recommendation system that would actually predict those those preferences and the modeling framework that I'm going to use here is factor.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Models and just to remind you, factor graphs are a graphical representation of the product structure of functions.",
                    "label": 1
                },
                {
                    "sent": "There are these square nodes which are factors, and the circle nodes that are variables, and if there's an edge between a factor and a variable, that means that this factor is a function of that variable and the graph structure will tell us the factorization structure and the inference question that is most frequently asked here is what are the marginals of the function?",
                    "label": 1
                },
                {
                    "sent": "That is, what are the?",
                    "label": 0
                },
                {
                    "sent": "What's the the value of the function if you sum out all but for example, one variable and that will correspond to the Bayesian posterior.",
                    "label": 0
                },
                {
                    "sent": "So here's my one slide kind of factor graph tutorial.",
                    "label": 0
                },
                {
                    "sent": "If you like, just in case you're not familiar with this, so here's the well known based law, the probability.",
                    "label": 0
                },
                {
                    "sent": "Off they say your parameters given the observations is proportional to the probability of the observations given the parameters times your prior over the parameters you can see here that the factor graph gives us a nice graphical representation of this.",
                    "label": 0
                },
                {
                    "sent": "There's two variables X&Y.",
                    "label": 0
                },
                {
                    "sent": "And the likelihood connects two of these variables, namely the parameters and the observation, and the prior is only connected to one of these variables, namely the parameters.",
                    "label": 0
                },
                {
                    "sent": "So that's kind of the simplest nontrivial fact.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The graph in some sense, and you can now think of more complex ones.",
                    "label": 0
                },
                {
                    "sent": "Here you would assume a factorizing prior for example.",
                    "label": 0
                },
                {
                    "sent": "And factorizing likelihood.",
                    "label": 0
                },
                {
                    "sent": "You can introduce some latent variables here and don't pay any attention to the particular structure of this model.",
                    "label": 0
                },
                {
                    "sent": "I just want to quickly explain that you might then be interested in summing out these latent variables.",
                    "label": 1
                },
                {
                    "sent": "There's three groups of variables.",
                    "label": 0
                },
                {
                    "sent": "Essentially, there are the parameters of interest.",
                    "label": 0
                },
                {
                    "sent": "There are these latent variables that you would like to some out, and there's the observation, say, game outcome, or a preference and.",
                    "label": 0
                },
                {
                    "sent": "You observe this.",
                    "label": 0
                },
                {
                    "sent": "You wanted some out those and you were to obtain, obtain the posteriors over those.",
                    "label": 0
                },
                {
                    "sent": "Variables and the way that we like to do this is by message passing.",
                    "label": 0
                },
                {
                    "sent": "So for example, if you wanted to calculate the marginal distribution for this variable here, that would mean you want to sum out all of these variables and that gives this nasty some and what this message passing algorithm does is essentially.",
                    "label": 1
                },
                {
                    "sent": "Breaks this long computation down into small local computations, which you can see here in the form of these arrows, and so there would be messages coming down from this variable.",
                    "label": 0
                },
                {
                    "sent": "Messages coming up from the observation, and then they would reach the target variable, and then we would calculate the posterior is the product of all the incoming messages to this variable, so that's kind of the inference framework with which we're playing.",
                    "label": 0
                },
                {
                    "sent": "And it's it's called message passing and can often make inference that is otherwise intractable, tractable.",
                    "label": 0
                },
                {
                    "sent": "If the graph structure makes that possible, in particular if it's a tree, like in this case.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now one problem is that you need compact messages to send around, and a common choice that we're also using here are Gaussian messages, so we would all these little reason results that we send around the graph to be Gaussian and.",
                    "label": 0
                },
                {
                    "sent": "The problem is that the exact calculation often doesn't yield a Gaussian.",
                    "label": 0
                },
                {
                    "sent": "An example here being that your prior might be Gaussian, but your likelihood would be a step function, and in that case the product of those two, the posterior would be a truncated Gaussian, so would fall outside of the family of the Gaussian distributions that you want to deal with, and I'm in particularly mentioning this because for preference learning this is a very important factor to understand.",
                    "label": 0
                },
                {
                    "sent": "Because it basically says that one thing is greater than another, and that's exactly the kind of thing we would like to do if we assume latent utility's to express preferences.",
                    "label": 0
                },
                {
                    "sent": "Now the trick is that you can do approximate message passing and the idea is basically that you approximate this posterior by a Gaussian in terms of moment matching.",
                    "label": 1
                },
                {
                    "sent": "And then you basically given the prior you solve for the unknown message.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which that or likelihood that you should have had, assuming that it was Gaussian.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And it will then come out in a Gaussian form.",
                    "label": 0
                },
                {
                    "sent": "If this is Gaussian and you'll get a Gaussian approximation to your step function such that your posterior is as close as possible to the desired posterior.",
                    "label": 0
                },
                {
                    "sent": "And that's basically the idea between expectation propagation and and approximate message passing.",
                    "label": 1
                },
                {
                    "sent": "So this is a bit we'll need, and it's also kind of I'm presenting it because it's a relatively universal building block that you might need if you want to deal with latent utility models for preferences.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so now let me move on to the first of these two component models, the Matchbox model.",
                    "label": 1
                },
                {
                    "sent": "And remember, this is basically the model that's currently in operation since we last week launched the service on Xbox Live and it's a collaborative filtering model that takes into account the metadata because it uses not indices of, but feature vectors too.",
                    "label": 0
                },
                {
                    "sent": "To identify the users in the items in the collaborative filtering.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Problem so this is joint work with David Stern and Ralf Herbrich.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the idea is to map users and items into a common trait space.",
                    "label": 0
                },
                {
                    "sent": "In this case, for visualization purposes, 2 dimensional and the idea is to have a linear mapping, and that's this.",
                    "label": 0
                },
                {
                    "sent": "Mapping will be the parameters to be learned from a feature representation of the user.",
                    "label": 0
                },
                {
                    "sent": "For example, in terms of their user ID in terms of their gender in terms of their country or in terms of their height or whatever other things you have to describe a user.",
                    "label": 0
                },
                {
                    "sent": "Into this feature space and on the other side we would have descriptors of the item, and again there would be a linear mapping into this trade space.",
                    "label": 0
                },
                {
                    "sent": "Say you have the item ID and the movie genre.",
                    "label": 1
                },
                {
                    "sent": "If these were movies and the idea here of the generative process that I'm describing is now that the inner product between this vector here and that vector there one representing the user, the other representing the item that that inner product.",
                    "label": 0
                },
                {
                    "sent": "Would yield the rating, so if they were orthogonal that would be a kind of average rating.",
                    "label": 0
                },
                {
                    "sent": "If they were aligned, that would be a positive rating.",
                    "label": 0
                },
                {
                    "sent": "If they were pointing in opposite directions, that would be a negative rating, so that's the generative process.",
                    "label": 0
                },
                {
                    "sent": "Then in fact we observe if this user likes that item, and then we invert that process in order to learn what these mappings of the features of users and items into this space are.",
                    "label": 0
                },
                {
                    "sent": "AM.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let me quickly show you the factor graph, so we have these weights for different features that map into the user traits.",
                    "label": 0
                },
                {
                    "sent": "Here another user, trait, item trait, another item trait.",
                    "label": 0
                },
                {
                    "sent": "Now we have this 2 dimensional vector that represents the user.",
                    "label": 0
                },
                {
                    "sent": "The two dimensional vector that represents the item.",
                    "label": 0
                },
                {
                    "sent": "We take the inner product of those and that gives us a rating.",
                    "label": 0
                },
                {
                    "sent": "And now you might ask, how do you do the message pass?",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here are let me algebraically.",
                    "label": 0
                },
                {
                    "sent": "Maybe that's also a good thing to say is that basically we have this linear transformation of the feature vector for the user into the latent space.",
                    "label": 0
                },
                {
                    "sent": "The feature vector of the item into the latent space U&V will be learned and the rating potential is then Gaussian.",
                    "label": 0
                },
                {
                    "sent": "Weather mean is the inner product of these trade vectors.",
                    "label": 0
                },
                {
                    "sent": "Yep, do you have a?",
                    "label": 0
                },
                {
                    "sent": "Observation dependent transformation.",
                    "label": 0
                },
                {
                    "sent": "I don't quite understand what.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "An observation dependent inquiry.",
                    "label": 0
                },
                {
                    "sent": "What do you do when you have partial data?",
                    "label": 0
                },
                {
                    "sent": "Oh, OK, no, it's not taken into account here, so it's a conditional model.",
                    "label": 0
                },
                {
                    "sent": "It conditions on those observations and we're in trouble if we don't have them.",
                    "label": 0
                },
                {
                    "sent": "We need to fudge it.",
                    "label": 0
                },
                {
                    "sent": "Observation dependent transformation.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I guess I guess you could do that.",
                    "label": 0
                },
                {
                    "sent": "I mean the the real way to deal with that would be a generative model.",
                    "label": 0
                },
                {
                    "sent": "Also of those properties I think.",
                    "label": 0
                },
                {
                    "sent": "But yeah, we have to do a trick here, so to speak.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now let me quickly show.",
                    "label": 0
                },
                {
                    "sent": "Suppose we have some priors on these weights that do the transformation into that space.",
                    "label": 0
                },
                {
                    "sent": "Then we would pass these messages down here.",
                    "label": 0
                },
                {
                    "sent": "That would be a prediction that comes out of it.",
                    "label": 0
                },
                {
                    "sent": "In fact, if we observe a rating, then that message would come up here and be processed through this inner product and lead to an update of these independent Gaussian.",
                    "label": 0
                },
                {
                    "sent": "Prior slash posteriors that we're using for these weights, so that's roughly how the inference works.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we're using infer.net.",
                    "label": 0
                },
                {
                    "sent": "This is a framework that's developed at MSR Cambridge for inference in this type of model.",
                    "label": 0
                },
                {
                    "sent": "It's available on the web if you're.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Interested now, here's a visualization of what things look like in this straight space, so again, there's a 2 dimensional trade space.",
                    "label": 0
                },
                {
                    "sent": "In practice, think 1020 maybe up to 50 dimensional trade space and what we have here is that these little dots are users and the red dots are movies and they get by the algorithm they get somehow distributed in this space.",
                    "label": 0
                },
                {
                    "sent": "And then if I have a particular user like this one, then you can think of this.",
                    "label": 0
                },
                {
                    "sent": "Preference cone here.",
                    "label": 0
                },
                {
                    "sent": "As the movies that that user would like because they are close in inner product right and stuff that's opposite in the opposite direction there.",
                    "label": 0
                },
                {
                    "sent": "That's a movie that that guy wouldn't like, so this seems like a fairly mainstream user.",
                    "label": 0
                },
                {
                    "sent": "Somewhere between a nights tale and Cinderella Cinderella story.",
                    "label": 0
                },
                {
                    "sent": "And what you can also see here is that the same embedding of course allows us to do user, user and item item similarities as a byproduct because they're all embedded in the same space.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good, that's ingredient number one.",
                    "label": 0
                },
                {
                    "sent": "That's how we would like to handle the collaborative aspect and.",
                    "label": 0
                },
                {
                    "sent": "Really, and the second ingredient is that.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "True Skill model joint work with Ralph Herbrich to Minke and.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Others, and this is a model that was originally device for ranking and matchmaking on Xbox Live and it is in fact this skill estimates and it is a development from the eloe system which was a similar system for chess using approximate maximum likelihood for a two player game, and we've generalized that to a Bayesian system which can take into account teams and more than two.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Parties, so the idea here is basically that we have these match outcomes and their orderings among K teams of a different number of players, and we would like to estimate the underlying skills of players from this.",
                    "label": 0
                },
                {
                    "sent": "From such data, to get a global ranking of players and to create fair matches among players.",
                    "label": 0
                },
                {
                    "sent": "Because if we estimate their skills, we can then bring players together who have similar skills and they'll have fun matches.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is kind of here.",
                    "label": 0
                },
                {
                    "sent": "You see a team game Red versus blue with individual players, Red wins, and that's would be one data point from which we can then update the skills of these user.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "See 'em.",
                    "label": 0
                },
                {
                    "sent": "You can also.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Evan, that might be more relevant here.",
                    "label": 0
                },
                {
                    "sent": "A game of eight individual players and we would then update the skills of these eight players from this data point.",
                    "label": 0
                },
                {
                    "sent": "Now note the similarity.",
                    "label": 0
                },
                {
                    "sent": "Now think of these these as the preferences of a user and you have the analogy between the two systems, because the user might have said that this game is better than that game is better than that game, and so on.",
                    "label": 0
                },
                {
                    "sent": "And it's the same ranking structure that we're going to use in the.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Likelihood, let me be quick here.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And just get to the model the.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Model that we want to use here and it's going to be the bottom part of the preference model I'm talking about is that we have three teams.",
                    "label": 0
                },
                {
                    "sent": "This has one player.",
                    "label": 0
                },
                {
                    "sent": "This is two players.",
                    "label": 0
                },
                {
                    "sent": "This is one player again and we think of a generative model where these teams have noisy performances, so to speak.",
                    "label": 0
                },
                {
                    "sent": "In there in a particular game, and we then observe a game outcome between them.",
                    "label": 0
                },
                {
                    "sent": "For example, team one wins over team two wins over Team 3.",
                    "label": 0
                },
                {
                    "sent": "Now one.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We know that we can encode it in a chain down here because we just need to say that the apparently the performance of team one was greater than that of team two and that of team two must have been greater than that of team three, and the idea is then to use message passing to infer what their underlying skills might have been.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And here you see the factor graph encoding where this is a gauss dieser, Gaussian prior factors and this is the ranking likelihood in this model.",
                    "label": 1
                },
                {
                    "sent": "And this is the same ranking likelihood that we will use in order to deal with preferences.",
                    "label": 0
                },
                {
                    "sent": "Individual skills such as jumping across for you type out groups of skills and tokenization.",
                    "label": 0
                },
                {
                    "sent": "Yeah, skill just in the sense that how well I can we predict that you do in playing this game.",
                    "label": 0
                },
                {
                    "sent": "So it's really an aggregate skill of playing a particular game.",
                    "label": 0
                },
                {
                    "sent": "Well, that's the meaning here.",
                    "label": 0
                },
                {
                    "sent": "And that's how the message passing works.",
                    "label": 0
                },
                {
                    "sent": "I won't go into the deep.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sales and in online gaming.",
                    "label": 0
                },
                {
                    "sent": "What this allows you to do is to get a global ranking of players because you pretty much stitched together all of these individual game results into an integral.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Mobile ranking and it allows you to do matchmaking and create matches that are both interesting for the players.",
                    "label": 0
                },
                {
                    "sent": "Because there's a 5050 chance of winning or losing, which makes it interesting and there are also the most informative metrics.",
                    "label": 1
                },
                {
                    "sent": "If you're still uncertain about players, so we are at the same time pleasing our audience and gaining more information from them.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just to show that the Bayesian system has much higher convergence rate than the original Elo system.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I won't go into the details here, but this may be it just one number I need to mention here is that may be partly due to our system an incredible number of hours in the billions has been, some people would say wasted on these games because it is so compelling to compete in well, matchmade games.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I won't go into this, although I like showing movies.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And let.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Me get into.",
                    "label": 0
                },
                {
                    "sent": "You know you can infer different skill distributions for different games.",
                    "label": 1
                },
                {
                    "sent": "This is a golf game, which is very difficult and there will be a broad skill distribution where, well, this is, you know, a pure chance game where there is really no way of making progress.",
                    "label": 0
                },
                {
                    "sent": "If you are not law.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Keep.",
                    "label": 0
                },
                {
                    "sent": "So let's put it together, Matchbox.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For preferences we want to combine the collaborative Matchbox model with the true skill preference model and the ideas that for each user we derive a chain of preferences based on how often or how long they've played the game, either by asking them or by using interaction data and the analogy to the true skill thing is that if a user has played a longer than B, then that's in.",
                    "label": 1
                },
                {
                    "sent": "True skill would correspond to game a winning over a game be that's kind of the semantic correspondence that I'm talking about.",
                    "label": 1
                },
                {
                    "sent": "And we would then like to learn those relative user preferences in a collaborative way by embedding users and items again in this.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm in space and you can see here how this would work.",
                    "label": 0
                },
                {
                    "sent": "There would be 1 user and in this case two games embedded in this space and there would be an implicit rating that Matchbox gives to game one and an implicit rating.",
                    "label": 0
                },
                {
                    "sent": "That Matchbox gives to Game 2.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then with this.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Data type, we would then say OK if writing.",
                    "label": 0
                },
                {
                    "sent": "If the user prefers this game to that game, then that means that the difference between this rating and that rating must have been positive.",
                    "label": 0
                },
                {
                    "sent": "That this rating is greater than that rating.",
                    "label": 0
                },
                {
                    "sent": "So in that way you get this implicit preference data in and this is just for two games, but you can do this efficiently for an entire chain of games.",
                    "label": 0
                },
                {
                    "sent": "So if someone owns 10 games and we have a ranking of 10 games, then we can deal.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That in this setting, so some experimental.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Results we came across this sushi preference data which is a nice kind of experimental playground by can be Shima and the sushi Eaters were asked to rank 10 sushis and to do that twice to to create 210 rankings of sushi so to speak.",
                    "label": 0
                },
                {
                    "sent": "And the task is to take the first ranking and predict what the second ranking on some other sushi items for that user would be.",
                    "label": 0
                },
                {
                    "sent": "And we can use this.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Combined Matchbox true skill kind of preference model to do that.",
                    "label": 0
                },
                {
                    "sent": "There are different inference methods that we use, but essentially we come out quite a bit ahead to their relatively simple model that they developed in the context of this sushi study.",
                    "label": 0
                },
                {
                    "sent": "So the collaborative approach together with the principle treating of the preferences in the Bayesian framework does seem to help in terms of the rank correlation.",
                    "label": 0
                },
                {
                    "sent": "The observed preference data.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now what you see here is how the trade dimension matters.",
                    "label": 0
                },
                {
                    "sent": "So you have the usual effect that adding more trade dimensions helps, but that the effect somehow tails off at some point and that you know 20.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "5 dimensions are plenty.",
                    "label": 0
                },
                {
                    "sent": "We've done preliminary tests on the Xbox data, so we did what I described earlier.",
                    "label": 0
                },
                {
                    "sent": "We looked at how often or how long people played certain games created for each user.",
                    "label": 0
                },
                {
                    "sent": "These craft preference chains and then test it on randomly selected pairs of games to figure out.",
                    "label": 0
                },
                {
                    "sent": "You know if A is preferred to be or be preferred to a in the test set and we have an accuracy of 72% here.",
                    "label": 0
                },
                {
                    "sent": "But I have to say that a lot of it is still driven by popularity, which is always a huge signal in these things, right?",
                    "label": 0
                },
                {
                    "sent": "There is 1 popular game and everyone buys it.",
                    "label": 0
                },
                {
                    "sent": "And what we're really interested in this kind of the individual taste that is orthogonal to that popular.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pretty.",
                    "label": 0
                },
                {
                    "sent": "OK, let me.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Skip that and just come to the conclusions I would like as one outcome.",
                    "label": 0
                },
                {
                    "sent": "I would like you to believe now that real world recommendation is a much more complex task than the Netflix challenge might have made.",
                    "label": 1
                },
                {
                    "sent": "Some people believe there's richer user, there's richer item data, there's richer user item interaction data.",
                    "label": 1
                },
                {
                    "sent": "There's additional decision criteria.",
                    "label": 0
                },
                {
                    "sent": "There's the issue of exploration versus exploitation.",
                    "label": 0
                },
                {
                    "sent": "Their system challenges, and so on.",
                    "label": 0
                },
                {
                    "sent": "And we try to make some progress by creating a system that carefully analyzes what the actual user preferences are, how we can tease them out of the signal, and how we can collaboratively model and predict.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For future work, there's plenty to do.",
                    "label": 0
                },
                {
                    "sent": "The first thing might be, how can we actually derive preferences in a more principled way from interaction data?",
                    "label": 1
                },
                {
                    "sent": "Maybe we can learn it if we have supervised kind of rating data and interaction data, can we?",
                    "label": 0
                },
                {
                    "sent": "Can we correlate that?",
                    "label": 0
                },
                {
                    "sent": "Is that maybe a separate learning task we would like to use active learning to maybe just ask the users often we forget the simplest thing, right?",
                    "label": 0
                },
                {
                    "sent": "Usually if someone comes to you, and once you might ask them, would you like this or would you like that maybe we should ask them?",
                    "label": 0
                },
                {
                    "sent": "So we can learn better and there's an element of active learning.",
                    "label": 0
                },
                {
                    "sent": "Then there's an interesting problem that often multiple users are hiding behind an account.",
                    "label": 0
                },
                {
                    "sent": "Mother and child, for example, might have the same account, but the games would be very different that they would like.",
                    "label": 0
                },
                {
                    "sent": "There's the exploration exploitation thing.",
                    "label": 0
                },
                {
                    "sent": "And finally, we're also looking to find a good scalable architecture that doesn't only work for games, but also for music, videos and other things.",
                    "label": 0
                },
                {
                    "sent": "Alright, thanks.",
                    "label": 0
                },
                {
                    "sent": "Do you have any questions?",
                    "label": 0
                },
                {
                    "sent": "Do you have any plan to incorporate some idea about the scale of preference?",
                    "label": 0
                },
                {
                    "sent": "Like five stars, one stronger but feels too?",
                    "label": 0
                },
                {
                    "sent": "Yeah, I mean these these are tricky because they kind of presume on an absolute scale, right?",
                    "label": 0
                },
                {
                    "sent": "And that is difficult in this work.",
                    "label": 0
                },
                {
                    "sent": "We were really trying to use pairwise different preferences because users seem to be better at saying I like this better than that, rather than saying this is a five star and this is a 3 star.",
                    "label": 0
                },
                {
                    "sent": "And there are psychological studies who show this, but once we, if we have that kind of data, we would like to incorporate it.",
                    "label": 0
                },
                {
                    "sent": "Visit, wait, I can play a game like you know, three days in a row wins without getting under pay for five minutes.",
                    "label": 0
                },
                {
                    "sent": "It's a stronger indicator of reference.",
                    "label": 0
                },
                {
                    "sent": "Maybe that now.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and that's where we take playtime as well, yeah.",
                    "label": 0
                },
                {
                    "sent": "Play time is superior than people go wild and then try to compare this game.",
                    "label": 0
                },
                {
                    "sent": "So yeah, see that the time, the time, how often someone plays is also a strong indicator because every time they picked up the game again right?",
                    "label": 0
                },
                {
                    "sent": "So yeah, we think it's a learning problem.",
                    "label": 0
                },
                {
                    "sent": "We want to learn from the data.",
                    "label": 1
                },
                {
                    "sent": "What is the better indicator?",
                    "label": 0
                },
                {
                    "sent": "But I'm just not clear what the supervision signal will be.",
                    "label": 0
                },
                {
                    "sent": "What features did you have about the users animal sushi model?",
                    "label": 0
                },
                {
                    "sent": "Yeah, there are some some relatively arcane features.",
                    "label": 0
                },
                {
                    "sent": "I mean, they did fill in questionnaires answering some general preference questions before that, but it turns out in this case we didn't use those because they are actually very strong predictors already.",
                    "label": 0
                },
                {
                    "sent": "Those preference data that they.",
                    "label": 0
                },
                {
                    "sent": "Features that you have there and so in order to study the effect based on the actual rankings.",
                    "label": 0
                },
                {
                    "sent": "We left them out of this study.",
                    "label": 0
                },
                {
                    "sent": "Last question, bill.",
                    "label": 0
                },
                {
                    "sent": "Skip it, skip in.",
                    "label": 0
                },
                {
                    "sent": "Someone says things like this narrow coding preferences going to model this user.",
                    "label": 0
                },
                {
                    "sent": "So no, then fun buying movies.",
                    "label": 0
                },
                {
                    "sent": "I tend to buy the best and a certain number of different categories and I'm not interested in Europe, mediocre ones in those categories, but I certainly can't rank my preferences simply by one particular type of thing.",
                    "label": 0
                },
                {
                    "sent": "Yeah it.",
                    "label": 0
                },
                {
                    "sent": "Already then, yeah, yeah, I agree.",
                    "label": 0
                },
                {
                    "sent": "But on the other hand, don't underestimate the difficulty of imagining what that cone looks like in 20 or 50 dimensions.",
                    "label": 0
                },
                {
                    "sent": "It's not.",
                    "label": 0
                },
                {
                    "sent": "So I mean here, it looks like you have made your choice for that part of the space rather than that, but now imagine you have 19 or 18 more dimensions to play with.",
                    "label": 0
                },
                {
                    "sent": "That can be a richer cone, right?",
                    "label": 0
                },
                {
                    "sent": "So the model capacity can be ramped up almost arbitrarily by increasing the dimension, so I wouldn't be too worried about that.",
                    "label": 0
                },
                {
                    "sent": "But another problem that is highlighted here is again that popularity stuff as well.",
                    "label": 0
                },
                {
                    "sent": "So certain things the user gets exposed to anyway through the top 10 list and you know through through global popularity and in some sense what we would like to do is model orthogonal to that and figure out what the specific things are that the user might not get exposed to through the usual means, but which might still be interesting.",
                    "label": 0
                },
                {
                    "sent": "And yeah, it's more complex than a cone, I agree, it's just our first shot at it.",
                    "label": 0
                },
                {
                    "sent": "OK, I think we have to stop, but thanks a lot for a great talk.",
                    "label": 0
                }
            ]
        }
    }
}