{
    "id": "emryt4ooh5piclw732l5day7qhuiewvf",
    "title": "Searching for innovative biological drugs",
    "info": {
        "author": [
            "Serena Zacchigna, International Centre for Genetic Engineering and Biotechnology - ICGEB"
        ],
        "published": "June 28, 2019",
        "recorded": "May 2019",
        "category": [
            "Top->Computer Science",
            "Top->Data Science",
            "Top->Computer Science->Big Data"
        ]
    },
    "url": "http://videolectures.net/icgeb_zacchigna_innovative_biological_drugs/",
    "segmentation": [
        [
            "I'm a medical doctor so guess how difficult for me is to interact and understand the way you analyze the data, so I will try to challenge you.",
            "Try to understand some medical problems this afternoon.",
            "This will be very far from what you probably do, but I will try to make it as simple as possible and give you give you the perspective of the applicative science that we would like to do and why we need such a long way of basic research.",
            "Before having some knew biological tools to apply to our patients, I would like also to spend just a few words explaining what the ICD P is.",
            "Unfortunately, our institution has this unfortunate name that is not very easy to spell, not even to remember.",
            "But since I, by discussing with some of you, I understood that you probably not may not be aware of what we are and what we do.",
            "The International Center for Genetic Engineering and Biotechnology is an intergovernmental organization which is part of the UN system.",
            "United Nations system.",
            "An indeed.",
            "There are three main buildings of the IC GP.",
            "The headquarter.",
            "Is in interest, which is a very close to Slovenia, very close to where we are.",
            "I just drove here this morning.",
            "And the other main building is in India in New Delhi and then there is a third building in Cape Town in South Africa.",
            "And then there is a network of about 64 either member of affiliated countries which are part of the SGP and the main mandate of the institution is to promote the safe and control use of biotechnology worldwide.",
            "So what we do is to offer fellowships to either postdoctoral or predoctoral fellows.",
            "Who are welcome to join the main ICD be institutes?",
            "Be train at a high level and then we help them to go back to their respective countries an implement their own research there.",
            "These countries of course are what we're developing countries at the time the ICD was founded.",
            "So there is India, China which are far more developed than than Italy now.",
            "But they are still part of the community and then another action very important action is to organize meeting and courses.",
            "In all these countries, and this is also why we could contribute to this workshop, and this is a way to attract leaders in the various fields of biotechnology in these countries, and give the opportunity to local scientists to be in contact with big names in their field.",
            "Then we also offers a small grants for collaborative projects between a CTB Member States and we have an activity of technology transfer.",
            "So at the ICG be interested we are developing the protocols for the production of biosimilars, which means biological drugs that are out of patent and can be produced as.",
            "Now brand product.",
            "So we establish the procedure.",
            "The protocol to produce these drugs, for instance erythropoetin's grow hormones and other drugs like we're moving to monoclonal antibodies, and then we transfer the technology to our Member States.",
            "So this is just to show you who we are.",
            "We are located physically in this area, Science Park.",
            "It's a scientific park.",
            "Interesting, you're all welcome to visit whenever you pass by."
        ],
        [
            "So let's look at mentioned.",
            "Our laboratory is interested in developing novel biotherapeutics for cardiovascular disorders.",
            "You are well aware that the population worldwide is aging, and this means that all degenerative conditions are going to increase.",
            "During the future years, cardiovascular disorders represent.",
            "More than 30% of the causes of death and mortality worldwide, so this means that one people out of tree is going to die because of a cardiovascular disease.",
            "And one of the major problem in age people is heart failure, which means that the hard at a certain point because of different causative diseases cannot do.",
            "Its pump function cannot exert his pump function anymore and this leads to various problem of course in dealing with daily activities there is a short of breath Ness lacks become.",
            "Adamatic and of course this is a major problem for the profusion of all organs, so this is going to lead to the death of the person in in five years in most of the patients at the time of diagnosis."
        ],
        [
            "And as a medical doctor involved in research, I daily received requests from patients saying where do you have anything experimental?",
            "That is ongoing?",
            "Because I don't have any option anymore.",
            "My doctor saying that there is either heart transplantation, but there are very few donors, so people are really willing to be enrolled in any kind of experimental trials with new drugs, and there is a real need for new drugs, because as already Luca mentioned, if we look at the drugs that we are using to treat these kind of patients.",
            "Some of them are very, very old, like digitalis theoretics.",
            "They are in used for more than one century's ready and the last drugs that have been introduced into the markets are the sartans angiotensin two receptor blockers that have been introduced in 1990.",
            "This means that we are treating now heart failure patients more or less as we were doing 30 years ago.",
            "If you."
        ],
        [
            "Look at the global markets off drugs.",
            "We see that there is an explosion of biotherapeutics, so this means no chemical drugs but biological drugs, which are much more complex to produce.",
            "It's not a small molecule, a chemical that you can synthesize is something that you really have to invest a lot in order to have it ready and purify the clinical grade, but these these biotherapeutics are really revolutionizing many aspects many fields.",
            "Of medicine.",
            "One big example are monoclonal antibodies.",
            "Most of cancer patients now are treated effectively with monoclonal antibodies, some of some types of cancer that were untreatable until a few years ago are now and almost easy to treat disease.",
            "Because we have this potent drugs that can stops signals that drive cell proliferation, and this is a very effective way to stop the growth of cancer cells.",
            "And in this can be also done specifically for some types of cancer, because we know the receptors that are specifically expressed, but by some types of cancer cells.",
            "So if we look at the applications of monoclonal antibodies, they're very widely used in cancer.",
            "They are very widely used in remote allergic diseases.",
            "There is no single biotherapeutic, not single monoclonal antibody recombinant protein that is used to treat cardiovascular diseases.",
            "So there is a huge space to bring this.",
            "New drugs."
        ],
        [
            "Forward.",
            "And what kind of biotherapeutics we can think about?",
            "You know that.",
            "The easiest things to deliver our proteins.",
            "Recombinant proteins that can be produced in the lab and purified and then deliver to patients or monoclonal antibodies follow under this category.",
            "But we can even think of jeans as drugs, so proteins are encoded by our genomes.",
            "We have genes that encode for protein and we can think of delivering genes an between among genes.",
            "We can even consider micronized.",
            "We have heard about.",
            "So not only genes encodes for protein but also other stretches of nucleic acids that can.",
            "Exert a biological function of biological activity and can be used as drug to modulate the either onset or progression of diseases.",
            "And then we probably have heard about the possibility to yourself as a therapeutic tools.",
            "There is a large field of regenerative medicine which uses cells or stem cells, putative stem cells, other cell types as a way of interfering with the progression of diseases, and the goal in the cardiovascular filled.",
            "Is to promote these three important biological process that could be crucial to improve heart function, which is Neo under Genesis developing of new blood vessels or most of the.",
            "One of the major problem in cardiovascular diseases, myocardial infarction.",
            "You probably are all familiar because each of us has at least relative the head and myocardial infarction.",
            "Unfortunately, this happens why when when one of the vessels that profuse the heart get stopped blocked because of either Arthur sclerotic plaque or a thrombus and this means that part of the heart is not perfused anymore, it cannot receive oxygen it cannot receive.",
            "Nutrients and so this portion of the heart is going to die, and, as Luc already mentioned, and we will talk about the heart doesn't have regenerative capacity.",
            "So if you have a problem with your skin, you have a bleed and then you have a clot and then stem cells in your skin.",
            "Progressively replaced the scar an after a couple of months, days, years depending on your age.",
            "The skin is able to completely regenerate damage and get the damage completely repair the heart is not capable of doing so, so whenever you have a portion of your heart that dies, this will be replaced by a fibrotic scar.",
            "They will stay forever and won't be replaced by new contract tile tissue.",
            "This is why after a while you are going to have an heart failure because this fibrotic star is not able to contract and so the heart.",
            "It is not able to exert its pumping function anymore.",
            "So if the problem arises because a coronary vessel and arterial vessel is blocked, then one of the potential strategy to overcome this problem is to induce the formation of new blood vessels that can revascularized this chemick heart, the myocardial infarction.",
            "Then another important aim is to protect the cells that have survived the damage in order to minimize the number of cells that are going to die and not pump anymore.",
            "And 3rd very ambitious.",
            "Aim is to induce regeneration in the heart, so to do something similar that is going to happen in your skin where there are style cells that, in response to a damage, can proliferate and repair that issue.",
            "An form a tissue which is more or less identical to what has been lost during the damage.",
            "So let's start from.",
            "I won't talk about the angiogenesis, I will just provide you some overview of what we're doing in the field of myocardial protection and myocardial regeneration, which is more a follow up of Waterloo can.",
            "Also Miguel mentioned already because everything started with a screening.",
            "And then I will provide you something more about the collaborative approaches that we are undertaking together with institutions Steven again on fibrosis."
        ],
        [
            "So if you look at the literature and you search for biological molecules, so essentially proteins that can protect the heart can be beneficial after myocardial infarction.",
            "You can find the hundreds of hits that have been proven to be beneficial in animal models, so that can be of some benefit for the heart, and it is very difficult from such a literature trying to understand which one are the best one.",
            "Which one are those that have a chance to progress toward the clinical experimentation and being successful even in in in a disease condition?"
        ],
        [
            "In humans.",
            "And so This is why we decided a few years ago to undertake a different strategy, which is completely novel way.",
            "Thinking about how to select the best drugs to push forward to the clinic that we call Francel and is aimed to select the best cardio protective factors directly in in vivo models.",
            "So this is the kind of screening approach which doesn't need.",
            "Robots, but needs a disease model in vivo, so an animal model in which you can deliver pull.",
            "Offer biological drugs and then select those that exert the best therapeutic function."
        ],
        [
            "Miguel already mentioned the possibility to have a pooled SAJ libraries for in vitro screening, and in this case we wanted to.",
            "Invent, let's say a similar approach to apply these libraries directly in vivo in an animal model.",
            "In this case of myocardial infarction, but this could be applying principle to any kind of disease, and I will show you another view of what you can do with this.",
            "So the tool that we decided to use is something that also you have already heard about.",
            "That are adino associated vectors.",
            "So these are viruses that can be can be modified genetically modified using genetic engineering and transform viruses into vectors for gene delivery.",
            "They are called AV, which stands for adino associated viruses.",
            "You may have heard about Odino virus because this is a pathogen for humans.",
            "It causes very severe pneumonia, especially in kids and immuno compromised patients.",
            "And this virus has this unfortunate name because it's calladine associated, but it has never to do with odino virus.",
            "It's called like that because it has been firstly described as a contaminant of enedina viral preparation.",
            "So this is an electron microscopy showing these big rounds particle.",
            "These Arduino viral particles and these small circle arounds are AVEs.",
            "And they are together.",
            "Why?",
            "Because AV is a defective virus is not able to sustain its own replication in needs.",
            "Another virus, for instance Adino virus to replicate.",
            "And This is why it's called associated.",
            "And this is also why it is very safe because it's a virus that precise not able to replicate itself.",
            "So it's very good to use it as a tool to deliver therapeutic jinx because it's not pathogenic, it has never been associated to any human disease.",
            "80% of the population.",
            "Do have antibodies against AV, so this means that in this room we are about 50 people.",
            "Let's say that 3540 of us have encountered this virus an we never appreciate it were infected by it because it doesn't create any problem.",
            "And in addition, is not competent for replication, so it is really very safe an it has a very simple genome.",
            "This is the genome of the virus.",
            "It only has two genes which are called wrap that is needed for its replication and cap, which is needed to make the capsid proteins and these two genes can be completely replaced by genetic engineering technologies and replaced by a therapeutic gene.",
            "So you can use these kind of particles to put inside the gene of your choice and allow this to infect the target cells and deliver your favorite jeans to Targ."
        ],
        [
            "It says so the idea.",
            "Here is.",
            "To have a libraries of AAV vectors in which every particle unk chords for gin.",
            "And then inject pool of viral particles in a tissue.",
            "Let's say in a heart.",
            "And then recreate the disease such as myocardial infarction.",
            "What I told you before is after a myocardial infarction.",
            "Most of the cardiac tissue is going to die.",
            "And the idea behind this project is that in if inside one of these particles there is a gene that can confirm a protection to the cells it enters.",
            "This cell will have a higher chance to survive after the damage and so if after the damage we recover the cells that have survived an we search for the jeans that are present in the surviving cells, we should enrich our pool of actors of genes that confer.",
            "Cardioprotection so that are beneficial for the heart.",
            "And we build this library in order to have every gene with a bar code that we can easily identify using next generation sequencing and so in a very straightforward manner, we could screen multiple genes.",
            "In a disease model, an identify the genes that are the most effective in protecting cardiomyocytes from death after myocardial infarction and is."
        ],
        [
            "Is exactly what we did.",
            "So we built libraries of heavy vectors an initially we choose to focus, not on the whole genome.",
            "Because of course this will require that these pools are injected in vivo, so there is a lot of manual work that needs to be done.",
            "Is noted as show before that robots can do it for you so far.",
            "So we decided to focus on two kinds of libraries, either on libraries of actors producing secreted proteins, or libraries of vectors encoding for micro RNA's, and why we choose these two different categories, because these are therapeutics that could also be deliverd as recombinant molecule.",
            "So we run the screening using viral vectors, but as you might be aware of.",
            "Translating a gene therapy approach that required the use of modified viruses is not so easy.",
            "It has a lot of limitations, a lot of cost and preclinical work that is needed to bring any gene therapy from the bench to animal models and to the bedside.",
            "An whereas in this case we could select for proteins that could be delivered as recombinant proteins.",
            "Biotherapeutics, as mentioned before, or synthetic micronized, and This is why we decided initially to focus on this categories of jeans.",
            "So to start our screening and so."
        ],
        [
            "What we did was to clone about 1200 Gene into a vectors encoding for secreted proteins, and we run the screening exactly as I described to you and to make a quite a Long story short, we could identify about 80 factors that are cardioprotective.",
            "Among these factors are some jeans that are already known for their beneficial activity in the heart.",
            "But as you can see here there are.",
            "Most most of them actually the majority of them are not known, so they're completely either novel genes or genes for which.",
            "A different biological activity has been described, but they were never being associated to any activity in the heart, and so now we're working on three of them, and.",
            "We are trying to produce them also as a recombinant proteins."
        ],
        [
            "And assess their beneficial effect.",
            "So for the new one I don't have.",
            "Very a detailed characterization, but one of the factors that emerge from this screening was grilling, an actually Grayling.",
            "I don't know whether you have ever heard about the existence of this protein, but grilling is one of the hormones that mediate the food intake.",
            "This means that when you're hungry, this almost tells your brain that you should have some food in your body.",
            "And this is the way and the activity that was known at the time for Grayling.",
            "But this emerged as one of the jeans that were most important in protecting muscle cells and cardiac muscle cells from ischemic death.",
            "And so we try to deliver Grayling to this chemick heart.",
            "You are already familiar with this kind of staining because look already show you here in blue, you have a scar and you see that.",
            "Delivering greyling this car is very much.",
            "Smaller and if you look at parameters of cardiac function, this confers a very huge beneficial effect to infarcted hearts in terms of cardiac protection, so we could discover and you function."
        ],
        [
            "Offer Grayling as I mentioned.",
            "Grayling is one of the.",
            "Of the hormones that mediate the food intakes.",
            "And there are two main receptors known for grilling that are receptors that are present in our brain.",
            "Because the brain is the organ that has to be alerted when we need food in order to change our behavior and get to search for some food.",
            "But none of these receptors is expressed by cardiomyocytes.",
            "So another project that again we're approaching with a high throughput screening.",
            "Is to look for the relevant receptor that mediate the active."
        ],
        [
            "City of Grayling.",
            "In cardiac cells.",
            "And here are just some movies that show you a myocardial infarction in a normal heart that these are echocardiography again and I don't know how familiar you are, but this is a heart that is contracting and you see here in this portion that you so essentially the black part in the in the middle of the movie is the blood.",
            "Whatever is white here around is cardiac muscle, and you probably guess here that there is less contractile tissue.",
            "An instead when you deliver Grayling, you have more contractile tissue.",
            "This will become more evident in later pictures that I'm."
        ],
        [
            "Going to show you and we also describe the mechanism by which Grayling acts to protect cardiomyocyte, which is through the induction of autophagy.",
            "This is another very interesting biological process that you can even use for screening, so we also run screening for autophagy.",
            "I don't know whether you have never heard about autophagy.",
            "It's quite a hot topic in biological research.",
            "And it is a way by which cells.",
            "And in particular, cells that don't replicate such as cardiomyocytes neurons.",
            "Can renew parts of its content.",
            "So imagine that we.",
            "Were born with a certain number of neurons or cardiomyocytes.",
            "These cells are permanent.",
            "They're quiet and they don't replicate, so we were born with these cells and we have to keep these also working and active for all our life without replacing them.",
            "So they have to be functional for 80 years or more and there might there has there have to be mechanism by which these cells can renew.",
            "They organized a protein, the.",
            "Part of their structure to because all the cells are exposed to oxidative damage, a lot of insults can happen to a cell, so cells that have to live with us needs ways of replacing this functional part of the cells, and this is a way cells can renew part of its content.",
            "They can engulf dysfunctional organelles in these blobs that you can see here, colored in either grade or in.",
            "Green, dependent on the pH and on the way of this renewal cycle they are, and in this way they can destroy parts of the cells that are not functional anymore.",
            "They make new parts so the cells is not renewing itself is not regenerating, but it can renew parts of its content through this mechanism, which is called auto."
        ],
        [
            "Fady and this is.",
            "Very protective for the heart, of course, because cardiomyocytes as mentioned are cells that cannot regenerate.",
            "Then we also use a similar approach to screen for molecules that can promote the engraftment of stem cells.",
            "You have probably have heard, as I mentioned, also beef."
        ],
        [
            "Or that regenerative medicine is willing to regenerate tissue by delivering stem cells.",
            "The problem in various organs, and particularly in the heart, is that whatever kind of cells you try to inject to repair damage normally.",
            "The microenvironment of a tissue damage is quite hostile for Salon Grafman becausw.",
            "Again, you even have a deficiency of oxygen and nutrients.",
            "You have a very high pH because of the inflammation.",
            "And so most of the cells that you are going to inject to repair any tissue are going to die because they don't find an environment that supports the engraftment.",
            "They grow the proliferation, data generation, whatever they have to do to repair the damage.",
            "And so in this case, what we could do was to use the same libraries that we already have available and deliver the library tools themselves.",
            "In this guy we use amazing kimel stromal cells cells that derive from the bone marrow that I use in a different regenerative medicine approaches.",
            "And again, since these cells, when transplanted, we know that they're going to die because of the hostile Micron vironment those cells that survive will probably be on rich.",
            "For jeans that favor their engraftment, their survival, their proliferation, whatever is beneficial after their transplantation into into a damaged tissue and using exactly the same approach we could identify so."
        ],
        [
            "Factors I show you one of them, which is named cargo troughing that is."
        ],
        [
            "Very potent in.",
            "Enhancing the capacity of stem cell to engraft and recite and persist in the heart so we selected this factor using this invisible functional selection strategy, and then we validated the capacity.",
            "Of this factor to promote then graph modalities are in red.",
            "Here we labeled cells.",
            "Stem cells and then we show that after delivering of cardio troughing as a Navy, but also the recombinant protein, the number of red cells that survive into ischemic heart."
        ],
        [
            "Was much higher.",
            "And the way it works is becausw.",
            "It promotes the expression and the localization of these red structure which are called.",
            "Um addition molecules that the some proteins that localize do addition and immediatly additional cell to the straps to the substrate.",
            "So do the extracellular matrix.",
            "They promote the localization of these proteins to the cell membrane and this render the sell more stitchy more able to attach to the extracellular matrix and so it increases the days of properties of of the cells.",
            "So focal additions are increased and the cells has a higher chance to attach to the matrix and normally sell.",
            "So when they are attached they have.",
            "A higher capacity to survive."
        ],
        [
            "OK."
        ],
        [
            "This is just to show and then we can apply.",
            "As mentioned this strategy to any disease conditions in which you have a loss of cells.",
            "Because in this way you can select for jeans that promote the survival of these cells or the proliferation of these cells and that confer advantages.",
            "Another condition very common is diabetes.",
            "In diabetes, what happens that beta cells in your pancreas they normally produce insulin?",
            "Are getting lost because of degenerative condition or out immune condition but independent of the cause?",
            "Normally you have a reduction in the number of beta cells that produce insulin in your pancreas.",
            "So if you deliver this library to the pancreas and then you induce diabetes, then you can select for some factors that promote either the survival or the proliferation.",
            "The regeneration of beta cells in the pancreas and Luca has spent.",
            "Few years of his life.",
            "In searching for these genes and eventually identified a very few potent molecules that cure diabetes.",
            "So this is something else that hopefully will be brought to the clinic soon."
        ],
        [
            "But this is part of the problem as mentioned.",
            "So one aim is to protect the cells that survive after damage.",
            "The other big problem in the heart is to promote regeneration because after myocardial infarction this is a rough estimate.",
            "The heart loses billions of cardiomyocytes that cannot be replaced by."
        ],
        [
            "Endogenous regeneration and this is how cardiomyocytes look like in the embryonic heart.",
            "So one when the heart grows and develops, this is the aspect of cardiomyocytes after birth.",
            "In a few days, cardiomyocytes completely change their shape.",
            "They become round shape, they become multinucleated, and you can even guess even if you're not.",
            "Expert biologist that these cells are more prone to replicate the diesels.",
            "Because these cells, adult cardiomyocytes are characterized by a very complex.",
            "Architectural structure as look already mentioned, so one of the key issue to induce the proliferation of these cells is to destroy and is assembled.",
            "This very complex architecture that characterize adult cardiomyocytes.",
            "And this change occurs suddenly after birth."
        ],
        [
            "So.",
            "Over the last I would say 10 years in the lab we spent a lot of effort in trying to understand what happens at birth that completely change the phenotype of cardiomyocytes.",
            "And there are a lot of things actually that happens at birth that might be responsible for this sudden change that also translates into a different regenerative capacity.",
            "So before birth, cardiomyocyte can replicate because of course the heart has to grow after birthday, cannot replicate anymore, and they completely change their shape.",
            "They also completely change their metabolism, and this is another story.",
            "So what is driving this changes?",
            "And there might be.",
            "An intrinsic genetic control, so there might be a developmental process that is ongoing, but there might be also something extrinsic.",
            "Something environmental that happens to the heart that somehow modulate the phenotype.",
            "The biology of these cells.",
            "And what happens at birth is that there is a sudden mechanical stretch, so the heart.",
            "Suddenly is exposed to higher dynamic forces.",
            "The blood pressure increases the long expands, so suddenly the heart has to face more mechanical stress and this is something we are also exploring.",
            "For instance, a role is driven by the sudden increase in oxygen tension during embryonic development.",
            "The heart receives oxygenated blood blood by the mother, but this is not very purely oxygenated blood because the embryo is quite peripheral compared to the heart of the mother, whereas when they baby get born.",
            "The lung expands and there is much more oxygen coming to the blood."
        ],
        [
            "Today to the heart.",
            "And actually this drives the formation of oxygen free radicals.",
            "Rasa rasa reactive oxygen species and this is partially responsible for the exit of cardiomyocytes from the cell cycle.",
            "So, if you modulate the formation of reactive oxygen species, you can extend the window.",
            "The time window in which.",
            "Argue myocytes keep proliferating afterbirth.",
            "After awhile, they stop anyway, but for sure the generation of oxygen driven Ross is one of the components that contributes to the loss of proliferation of cardiomyocytes, and we contributed to this paper showing this."
        ],
        [
            "Another sudden change that happens at birth is that suddenly the heart is not exposed anymore to the maternal circulation because it is delivered out of the mother body and soul."
        ],
        [
            "Since during pregnancy the a lot of changes occurs in the in the mother body and one of these is the expansion of T. Rex.",
            "I don't know whether you know what are T Rex regulatory T cells.",
            "They are cells that are part of our immune system that needs to be expanded.",
            "Why?",
            "Because the pregnancy is a very unique situation in which a human body host another body that is not genetically identical to its own.",
            "Says and so the mother has to become tolerant toward the antigens that are driven by the father DNA.",
            "And this is.",
            "Perform because there are.",
            "This is specific immune cells that are called regulatory T cells that are cell that blunt the new response and allow the generation of tolerance so your immune systems become tolerant against new antigens to which it is exposed.",
            "And this allows the mother not to reject its own baby which is growing its body.",
            "So these cells are expanded urine pregnancy."
        ],
        [
            "And since over the last years.",
            "These cells were also being described to have not immune function, but also regenerative function.",
            "For instance, it has been shown that these cells contribute to muscle repair, skeletal muscle repair after injury, an also to the regulation of metabolism, and in in fact issue.",
            "We wonder whether the presence of this high level of T. Rex could have been something to do to the proliferation of cardiomyocytes during embryonic development.",
            "And they."
        ],
        [
            "Sudden loss of proliferative capacity after birth, when the heart is not exposed anymore to a blood containing this high level of T. Rex and again last year, we could show that then actually T. Rex produce protein that stimulates cardiomyocyte proliferation.",
            "These are cardiomyocytes that are exposed to factors produced by T regs, and they proliferate more you are again familiar with these kind of images where.",
            "Incorporating in U or being positive for other markers of cycle, so cell proliferation such as Ki 6750 E and phosphorus on H3 Aurora B, which is a protein that marks not just nuclear division.",
            "So when the cell has to divide first, the nuclei replicate, but then also the cytoplasm.",
            "The rest of the cell has to become to split into two parts.",
            "And they keep rotating that mediate this process.",
            "Is this kinase, which is called Aurora B.",
            "So having Aurora B?",
            "At this specific location.",
            "Means that the cells is actually dividing.",
            "And so this is a proof that directs not only news the duplication of nuclei, but actually force cytokinesis.",
            "So Cytoplast division, and so the one of the novelty of this paper was to clearly show that T. Rex induce the proliferation of cardiomyocytes in the embryo.",
            "And then these explain while after birth this proliferative stimulus is lost, but it also drives a bit.",
            "Of proliferation in the heart of the mother.",
            "We all know that during pregnancy the heart is getting larger in the mother and this has been called the physiological hypertrophy of the pregnancy.",
            "So pregnancy was so as a kind of physical exercise where you have to face again against the higher hemodynamic pressure and the heart becomes bigger like in an athlete because it has to work more because the volume of blood that he has to pump is is higher.",
            "But there might be also at all for proliferation instead of hypertrophy.",
            "So normally in the post Natal heart they own largement in heart size.",
            "Can be pathological, as in the course of hypertension can be physiological as in sports athlete.",
            "As in pregnancy, but in any case was told to be driven by hypertrophy, so cardiomyocytes cannot replicate.",
            "They can only own large.",
            "They can be car.",
            "They can become bigger as look I showed you in the screening that you showed you before this.",
            "Is an indication that maybe that might be at all for proliferation as well during during pregnancy and cardiomyocyte during pregnancy when they are exposed to high level of regulatory T cells can also proliferate.",
            "So this is the first indication that maybe the heart is not really post mitotic that some regeneration."
        ],
        [
            "Can occur spontaneously and this is not the only indication because during the last year there have been several.",
            "Partial hits to this dogma that cardiomyocytes afterbirth cannot replicate anymore, that they are completely exhausted, their proliferative potential.",
            "So functionally this is true because if we have a cardiac damage different from other tissues that can regenerate, the heart cannot regenerate, so functionally it is a post mitotic organ.",
            "But there are various evidence this one of the pregnancy data show you an also other elements that.",
            "Tend to say that maybe there might be some regenerative potentials also in the."
        ],
        [
            "Post Natal heart.",
            "One evidence comes from simpler Organism model organisms such as this one.",
            "This is the axolotl.",
            "Or Ambystoma mexicanum and is a very funny guy.",
            "I think he lubiana day they how's it for regenerative purposes, right?",
            "And it is extremely useful to study any kind of tissue regeneration we can, can regenerate everything.",
            "You can cut its tail as the lizard and it regenerates, but even his slim.",
            "So they produce.",
            "I think this movie was produced in Louisiana.",
            "You can cut this limb and it will regenerate.",
            "You can cut it again and they will regenerate at the war.",
            "In the worst scenario, it will regenerate two arms instead of 1 because something goes wrong with the regenerative potential, but it keeps regenerating.",
            "You can cut part of his brain and it will regenerate the part of its eye, and with Hillary generate and part of its heart and it will it regenerate.",
            "So there are animals."
        ],
        [
            "Another one is zebrafish.",
            "This is a fish that has been used a lot in developmental studies because as all fish is, its development occurs out of the muddy of out of the mother's body.",
            "So you can really see the development under the microscope.",
            "You can genetically manipulate, so it's very used in biological developmental studies."
        ],
        [
            "But almost 10 years ago, or more than 10 years ago, already more than most 20 years ago, kintos clearly demonstrated that.",
            "The Deborah Fish Heart is capable of full regeneration even in adult fish is.",
            "So what happens if you cut up to 1/3 of the fish heart?",
            "Is that initially a cloud forms as in our normal bleeding and then in seven days cardiomyocytes close to the respected portion start to differentiate partially proliferate to incorporate beard you with you.",
            "This nucleotide analog that triggered the.",
            "A reveal proliferation and then they re differentiate again to give rise to a contractile tissue which is indistinguishable from the previous one.",
            "So in the also the fish during the first 2 weeks when this cloth is there, fish doesn't move so much.",
            "But after 14 days, for instance, you cannot recognize it anymore, it start.",
            "Swimming and moving as all the other fish is because the heart is is getting normal again."
        ],
        [
            "And this is also true for mammals, at least for mice during the first week after birth.",
            "I told you that something changes in cardiomyocyte shape, function metabolism after birth, what what means after birth in the mouse.",
            "This means seven days after birth.",
            "During these seven days Windows, if you cut the apex of the heart, this completely regenerate.",
            "There is no scar as in our heart you can cut the apex.",
            "You can induce a myocardial infarction because now.",
            "Technologies allows with the very potent operation microscopes to ligate the coronary artery of a mouse embryo to induce myocardial infarction and the heart completely regenerates no problem."
        ],
        [
            "And indeed, the using these neonatal cardiomyocytes.",
            "You can see that they can proliferate.",
            "You can use the neonatal cardiomyocyte to produce these artificial tissue that we also produce a DIC DB that is Francesca Loffredo is using this technique, so you see we call this calamari ring because they look like a calamari, but actually this is contractile tissue derived from neonatal cardiomyocytes, so.",
            "There is a certain time window during which cardiomyocytes can actually proliferate and still keep their capacity to fully differentiate and produce a contract.",
            "Tyler cardiomyocyte issue."
        ],
        [
            "Myocardial tissue and, of course, we cannot do these experiments with human cardiomyocyte, so we don't know exactly the if this is true.",
            "Also, for a short prenatal windows in humans.",
            "But there are indirect indication that this might be true, because there are on a dock tickle evidence or very large myocardial infarction in neonates, sometimes for anatomical malformation, it happens that even kids after birth, they suddenly develop myocardial infarction.",
            "We were very extensive damage that can be now documented by MRI and other imaging techniques, and if you look at the function of these hearts.",
            "Some of them recover completely, so even big infects if they occur during the first weeks after birth, could recover without sign of fibrosis and.",
            "Not contractile tissue as a."
        ],
        [
            "Once in a in adult, and finally there is this.",
            "Additional indication that there might be some regeneration ongoing even in the human heart.",
            "Which has been possible thanks to the use of these techniques that is used to label the age of trees based on the detection of isotopic carbon atoms.",
            "And wow, and essentially what happens during the Second World War.",
            "During the explosions of the atomic bomb was that there was a peak in the concentration of carbon 14 in the atmosphere.",
            "Normally the carbon is present at carb as carbon 12 in our atmosphere, but because of the atomic explosion there was this speak and this amount of carbon 14 has been incorporated into all cells that were making their DNA in new clothes at that time.",
            "So if we now take a person that died today and was bored at the time of this speak, we can quite easily understand by measuring the ratio between camburn 14 air come carbon 12 weather is or air cells were born at the time the person was born because they keep the same high level of carbon 14 or were generated recently because it comes.",
            "As you can see here this peak.",
            "Has been progressively decreased with the normal exhaustion of isotope half life.",
            "And so currently there is no more carbon 14 in the atmosphere.",
            "So if a person died today an his hair cells were born few months ago, his.",
            "Cells have a level of carbon 14 which is almost zero as today.",
            "If instead the neurons, for instance of cardiomyocytes, were born with a person and kept for the entire life, they should have a very high amount of carbon 14 and this study has allowed to date the.",
            "Half life of most tissues in the human body.",
            "For instance, for the brand new study was firstly down for the brain, and it shows that not all our brain regions today it's the same time.",
            "So there are regions of the brain that can regenerate and renew themselves, other not and for the heart what for the heart it was shown that throughout our life let's say 85 years we renew half of our hearts.",
            "Also half of our cardiomyocytes were born with us and they keep.",
            "Staying there for 85 years, half of them are somehow renewed and most of these renewal occurs during the first month days of our life.",
            "And then we progressively lose our endogenous capacity of regenerating cardiomyocytes.",
            "But this still means that there is an endogenous regenerative potential."
        ],
        [
            "This is why.",
            "As Luca and Miguel mentioned a few years ago, we decided to run this screening, searching for micro RNA that can promote and enhance this endogenous.",
            "Existing regenerative potential.",
            "And so this is the way they were under screening.",
            "This Luca showed you already plating.",
            "Neonatal cardiomyocytes that still have some proliferative potential.",
            "Adding it you to label cell proliferation and then assess whether any of the micrornas encoded by our genome.",
            "So this, I'm not sure whether.",
            "We have already mentioned that we have about 2000 genes in our genome that unquote not for protein, but for micronase at the time we run this screening, we had a library that contain only half of them because they were not annotated yet.",
            "Now we have libraries which are more updated and then we could in this way assess the effect of."
        ],
        [
            "Each of these micro RNA in cardiomyocyte proliferation and again this is already something you are familiar with.",
            "These are primary cardiomyocytes labeled in green, cause they are positive for Alpha actinin, which is a protein that is necessary for cardiac contraction.",
            "An Edu positive nucleus, or nuclei that proliferate are red.",
            "And all the other nuclei Zara, staining blue, and this is the same image elaborated by the high content microscope in which all the cells are segmented.",
            "An nuclei that are red so they proliferate and belong to a cardiomyocyte are labeling yellow.",
            "So normally what they I high content microscope does is beside giving these images is also to quantify the percentage of cardiomyocyte nuclei that proliferate and normally known it'll cardiomyocyte proliferate a bit.",
            "12% of the cells normally proliferate.",
            "And then you can see here this is one of the most potent Mike Renee Shamel.",
            "These micro Denise can increase this proliferation rate up to almost 50%.",
            "You see here full of yellow nuclei.",
            "So again, to make a Long story short, we could identify about 40 micro RNA."
        ],
        [
            "That important increase the proliferation of cardiomyocytes.",
            "And as I showed you before, this is not just nuclear division, but it's also division of the cytoplasm.",
            "They increase the number of cells that are that have Arora be localized at the mid body.",
            "So they really divide.",
            "And it is perhaps the best evidence that they really proliferate if you leave them there, they feel that they they.",
            "They make the plate full of cells, whereas after awhile normal cardiomyocyte."
        ],
        [
            "Stop proliferating so we also deliver them.",
            "In the in vivo desire."
        ],
        [
            "Hearts of neonatal rats in which we injected the two more potent micro RNA which are 990 and 199.",
            "A an.",
            "I'm not sure whether you can see here, but there are a lot of proliferative."
        ],
        [
            "And these are confocal microscope images showing that these Edu positive, proliferating red nuclei actually belong to cardiomyocyte, so they stimulate the proliferation of cardiomyocytes even in vivo."
        ],
        [
            "And then of course the following step was to.",
            "Proof that they can improve her function, so that is proliferation of cardiomyocytes can induce heart regeneration in vivo.",
            "So what we did was to induce myocardial infarction by ligating.",
            "So closing one of the coronary arteries to mimic what happens in humans and then delivering the micro Renee again exploiting these viral vectors based on the add-in associated virus.",
            "Because this virus work very well in in the heart.",
            "And then we monitor cardiac function.",
            "I'm not going to tease you with these parameters, but just to mention the desired parameters of our function, this means less ventricular ejection fraction which measure the amount of the blood that is pumped out of the heart at every cardiac contraction.",
            "An as you can see here respect to the control that tends to decrease these pumping capacity.",
            "The micro Renee improve."
        ],
        [
            "The contract tile activity of the heart.",
            "They improve the.",
            "Amount of contractile tissue that is present overtime.",
            "Here again, this car in control hearts tend to be wider overtime, whereas with the micronase you have preserved contractile tissue."
        ],
        [
            "Ann howdy."
        ],
        [
            "Work, so This is why I I made this question to look at we again try to understand the relevant target of the micro RNA by delivering these two micro RNA to cardiomyocytes.",
            "And since my credit networks because.",
            "They downregulates hundreds of genes.",
            "We went for our and I seek an identify about 600 genes that."
        ],
        [
            "Were downregulated in the cardiomyocytes and among these genes, as you can see here there are genes.",
            "This is probably something that doesn't mean much to you but believe me the desired protein that mostly belong.",
            "Two that architectural structure that we were referring to, so either cytoskeletal or sarcomere structure, so the contract tile apparatus that needs to be disassembled.",
            "So you really have to stop the synthesis of this protein to allow the cell to divide."
        ],
        [
            "And then again we exploited the availability of the siren, a library to individually silence each of these gene and see whether any of them."
        ],
        [
            "Lee was able to induce cardiomyocyte proliferation, and these are the results.",
            "This is a control.",
            "You see that several genes when silence are able to increase the proliferation, but none of them is as efficient as the Mike Renee.",
            "Why?",
            "Because probably the mic Renee is able to simultaneously not down many relevant armor in a an silence throw things that somehow block product."
        ],
        [
            "Eration in cardiomyocytes.",
            "We also show recently that most of these micro Renee have a common mechanism by which they can trigger the proliferation of cardiomyocytes and this goes through the down regulation.",
            "The block of the so-called Hippo pathway.",
            "This is also in hot topic in science."
        ],
        [
            "Is very molecular.",
            "I will skip it.",
            "But this also tells you that probably what these micro RNA do.",
            "Is to mimic what happens in the Deborah Fish Heart where I also told you that in order to proliferate and regenerate the heart, cardiomyocytes have to partially dead.",
            "Differentiate, disassemble they structure, proliferate and then re differenti."
        ],
        [
            "8.",
            "And."
        ],
        [
            "And this is probably the same mechanism that happens in.",
            "That that that is triggered by this Mike Renee.",
            "Another relevant question for translational purposes is whether these micronized also works in human cardiomyocytes."
        ],
        [
            "And there are various approaches that one can undertake to study human cardiomyocytes.",
            "There are lines of.",
            "Cardiomyocytes derived from embryonic stem cells, so now also from induced pluripotent stem cells.",
            "And that are commercially available.",
            "You can just buy them and see whether Micronair works.",
            "But you see here that actually these cardiomyocytes don't look like.",
            "At that point, you might assign some armor similar to neonatal cardiomyocytes."
        ],
        [
            "And and so we.",
            "We try to isolate primary cardiomyocytes from human heart, either starting from aborted fetuses at the 3rd trimester of pregnancy and out of the 7 micro RNA that we can identify in embryonic stem cell derived cardiomyocytes, which we saw that some of them also work in primary human cardiomyocytes.",
            "Especially 30 three B302-D"
        ],
        [
            "199 and 1825.",
            "OK, these are other."
        ],
        [
            "Sample and say we made an effort to have a cultures of human adult cardiomyocytes that you can have access to from the cardio surgery room.",
            "So at the time of cardiac surgery that requires extra corporeal circulation.",
            "So when a doctor has under to make an intervention into the heart.",
            "Of course the blood cannot flow through it, so it is redirected through an extra corporeal line line for awhile, and this requires.",
            "The insertion of the canola in The Art Room and when they removed the canola, there is a part of the heart of the actual heart that sticks to the canola and in this trash with the canola.",
            "So we got the permission to use this small segments and fraction of heart issue that would have been other white rushed to harvest human cardiomyocytes, and the same can happen when they remove the human valve and they replaced with the mechanical artificial valve.",
            "Also there you might have some myocardium around.",
            "Around the world that can be used for experimental purposes and we could."
        ],
        [
            "How to set up these cultures of human cardiomyocytes and again prove that at least a few of them were also working on adult?"
        ],
        [
            "Two mile sites.",
            "But if you want to translate into a human therapy, you also have to prove that they work in a large animal model."
        ],
        [
            "And This is why we started collaborating with a group of with the group in Pisa and in Philadelphia Temple University.",
            "Um, to strive the efficacy of our micro RNA's in a model of ischaemia reperfusion in pics.",
            "Ice Creamery perfusion means that you inducing myocardial infarction in the pig and then you open the artery again and this better mimics what happens in humans because Luckily most of the persons now can reach the hospital in a reasonable amount of time and they get revascularized because.",
            "The surgeon can reopen the coronary arteries."
        ],
        [
            "And we choose to to test this, Mike Renee 199.",
            "Ay this was not the best micro Renee in any of the species that we tested, so we did the experiments in the initial screening in rats and mice.",
            "Then I show you the data in humans.",
            "We also tested peaks and dogs cardiomyocytes and this was not the best in any of the species, but it was the only one that works across the species.",
            "For instance 590, which was the best in rodents, actually stop the proliferation in human cardiomyocytes.",
            "This is something.",
            "Also, we need to take in mind when to keep in mind when we think of translational studies and micro RNA can be conserved.",
            "But the effect that they drive in different species can be very different.",
            "And these are again para meters of cardiac function like the ejection fraction capacity of the pumping of the blood.",
            "And you can see that overtime the pumping capacity is lost even in this model, whereas with micronair dizzy."
        ],
        [
            "Is very much preserved and this is much easy to understand compared to the Echo movies that I showed you before, so this I'm sure you will understand.",
            "So here you have an MRI in which the white signal is the blood an in Gray.",
            "Here around you can see the myocardial tissue.",
            "This is the septum.",
            "This is the left ventricle, the one that pumps more and this is the right ventricle, the one that comes through the lung.",
            "An you can see here in the posterior portion.",
            "This is the afternoon deliver, so this is the lower part of the domain of the animals at the animal.",
            "Is it like that?",
            "And you can see here that in this posterior part you have this great issue that pumps, whereas he ran the subtone interior part is very thin and it it contracts very, very poorly and these are two images of the same animals, not not the same.",
            "Sorry another animal at additional 2 animals that after the scheming reperfusion, received any infusions of a Navy vectors expressing the micro Renee.",
            "Why 99?",
            "You see here.",
            "Here it is still some contract tile deficiency, but most of the heart and its all round shape can."
        ],
        [
            "Recently contract an MRI gives you also the opportunity to follow the same animal overtime.",
            "To understand whether there was an initial protection.",
            "So the progression of the disease haven't occur, or there was a real regeneration, there was a damage, not contracted tissue that has been replaced by new contractile tissue.",
            "And if you look at this."
        ],
        [
            "The animal that has been treated with the micro Renee.",
            "You clearly see here that the dysfunctional portion that is highlighting red by the software was quite extended at 2 weeks and it was progressively.",
            "Replaced by normal black tissue.",
            "This of course is not real proof, but it's a strong indication of a regenerative process rather than protective."
        ],
        [
            "This is ongoing and then when we look at Histology somewhere we look what happens to the heart?",
            "You see that is full of green cardiomyocytes that have a red nucleus, so it means that they had."
        ],
        [
            "Proliferated, so we were very happy because we thought that to having our hands something very potent driving regeneration of hearts in pics.",
            "And this lasted for about two months.",
            "So the movie that I showed you was at about two months and then in one week suddenly seven out of eight weeks treated died.",
            "So initially we thought that some.",
            "Infectious ongoing in India.",
            "Animal House because they all died at the same day.",
            "Exact Model S but the controls were there so they were less performing because they had a larger in fact.",
            "But they were alive."
        ],
        [
            "And so when we we we we wanted to, we had to repeat the whole study, because we lost all the animals trying to understand what could be the cause of this of this sudden death.",
            "And we implanted some reveals kind of pacemaker.",
            "Nor the pacemaker implant into people.",
            "They also record the written and they start working.",
            "If there is an arhythmic event.",
            "If you don't have a rythme, the pacemaker doesn't work.",
            "So we implanted this pacemaker in revealing conditions.",
            "And we could identify a few fatal arrhythmias in a few of the treated animals, and none of them in untreated animals.",
            "So probably these micro RNA is somehow, when overexpressed for a long period of time, as can be possible using viral vectors that continue driving the expression overtime.",
            "Allow an induced degeneration."
        ],
        [
            "And offer important aritmija and when we look at the Histology of these long-term animals, we could appreciate the formation of these cell clusters.",
            "This is something that is very similar, reminiscent of a tumor where will start to proliferate."
        ],
        [
            "These cells are very proliferating, so if you stain for proliferative markers like high 67, they are very very positive, highly positive so these are."
        ],
        [
            "Highly proliferating cells as cancer cells are.",
            "They're not inflammatory cells.",
            "These are staining for immune markers.",
            "They are not immune cells, so we could rule out myocarditis infections event."
        ],
        [
            "So going on."
        ],
        [
            "And they are positive for markers of early cardiomyocyte differentiation.",
            "So what we think happened is that this micronase were so important in the differentiating these cardiomyocytes that these cells started to proliferate in an uncontrolled way, giving rise to this mass is in the heart.",
            "That could be the anatomical substrate for the."
        ],
        [
            "Arhythmic events that we could.",
            "We could."
        ],
        [
            "Record an So what what can be?"
        ],
        [
            "Down to avoid this problem that actually arose at a very long term.",
            "So after only after two months of overexpression of the Micro Renee, we could see this phenomenon, we can reconsider the way we're delivering micronair.",
            "This brings me back to the first initial concept to deliver the biotherapeutics as synthetic molecules, avoiding the use of."
        ],
        [
            "Therapy.",
            "Because if you deliver this micrornas as a synthetic micro Renee instead of using viral vectors so you can produce a short RNA stretch as in the screening, for instance the same, and you can deliver these micro RNAs directly to the cardiac muscle.",
            "And we thought that they would have been degraded immediately, whereas this was not the case, so they can persist there up to 12 days and 12 days could be a reasonable time to ellicit a regenerative response, avoiding the long term effect of uncontrolled and prolong."
        ],
        [
            "Expression of the Micronase an if a present for 12 days, they can recapitulate the therapeutic activities so they can protect the heart from the consequences of myocardial infarction.",
            "This is again rodents.",
            "We had to step back to prove that they work.",
            "As Mike Renee in in in rodents, because of course this is a very expensive approach and a very."
        ],
        [
            "Pensive way to deliver it?",
            "But still they work and they induce cardiomyocyte proliferation in in vivo in the heart.",
            "So next step will be to find the money and find a way to deliver this synthetic micronase 2 pics.",
            "Hoping to reproduce the beneficial effect."
        ],
        [
            "In terms of regeneration and avoided the long term consequences and then how how I am out with the time that I don't have my time here.",
            "OK so I will quickly show you what we could do together with the with session.",
            "For the development of new Therapeutics for fibrotic diseases, I won't spend an introduction on the on the relevance of eyebrows is because Miguel already mentioned you just to say that even in this case, fibrotic diseases are worldwide.",
            "Any organs undergo fibrosis, particularly during aging, and only two drugs are approved.",
            "For the trim, for the treatment of eyebrows is an even not very effective if I."
        ],
        [
            "I say.",
            "So in this case we decided to go for a drug repurposing approach which could short shoot could shorten the time needed to go to the clinic.",
            "So if you start from scratch from finding new targets, new compounds, new chemicals.",
            "Do the clinical application and the market can take up to 15 years at least.",
            "If you start with something that has been already approved to be used in the clinic, you can significantly shorten the time because all the safety and kinetics have been already.",
            "Characterized and approved and so we decided to go for a screening of FDA approved drugs that can modulate activation of fibroblasts."
        ],
        [
            "But in Miguel showed you already the relevance of Myofibroblast activation of fibroblasts in inducing fibrosis.",
            "But in this time we could exploit something.",
            "Some products of the genetic engineering which is the use of genetically engineered animals.",
            "I'm showing use various example of animals that have been genetically modified to express endogenously fluorescent proteins in the cells.",
            "And these proteins can be of various color.",
            "As you can see here, this is a brain of brainbow mice that have a stochastic representation of different fluorescent protein in every neuron.",
            "So they can really trace the projection of every single cell through how the body?"
        ],
        [
            "And we use these mice in which all fibroblasts are green because they express GFP under the control of the same promoter.",
            "The drive collagen expression.",
            "So all cells expressing collagen, arguing, and then when they start expressing Alpha SMA, they become myofibroblasts activated fibroblasts.",
            "They turn red and these are the cells, so we call them Christmas balls because they're very nice to see into image.",
            "Normally fibroblasts are green, but when they get activated.",
            "They become red, orange depending on the amount of Alpha SMA smooth muscle acting that they start expressing and this red cells are activated fibroblast, more prone to fibrosis so we could easily screen for drugs that can modulate number of green versus red orange cells and also have an idea of the effect efficacy of this drug.",
            "Because we have the intensity of the fluorescence that represents the amount of smarter they produce and so the amount of activation."
        ],
        [
            "Undergo.",
            "And again we ran the screening and."
        ],
        [
            "So we could identify a few drugs that can.",
            "Induce Alpha is my expression.",
            "They activate fibroblasts, becoming more fibrotic and some drugs that reduce.",
            "The activation of fibroblasts and then we decided to."
        ],
        [
            "Prove that their capacity to modulate alphas, my expression as you show here in vivo, and eventually we decided to proceed with alopecia."
        ],
        [
            "You might have heard about this molecule because it's a neuro psychiatric compound, very often used to treat delirium.",
            "The commercial name is Haldol serenades, so it's very known drugs and again, it is known to."
        ],
        [
            "Doctor Ann exert its antipsychotic compound because it binds this receptor dopamine receptor two in the in the brain, and these receptors is expressed in neuronal cells but not in fibroblasts.",
            "So we had to look for another receptor an.",
            "Eventually we found that the receptor that mediates the activity of all apparel in fiberglass is this receptor."
        ],
        [
            "Which is called Sigma one.",
            "These are all molecular details."
        ],
        [
            "And."
        ],
        [
            "I will skip to the end."
        ],
        [
            "If you were just to show you the how it."
        ],
        [
            "Works, but.",
            "We are late."
        ],
        [
            "So this is to show you that.",
            "It works in vivo in model of cardiac fibrosis.",
            "This is the amount of fibrous activation you have in the heart after myocardial infarction and it is in haloperidol, treated mice."
        ],
        [
            "It works in a mouse model of lung fibrosis.",
            "This is a fibrotic lung.",
            "Ideal pathic pulmonary fibrosis is another major health problem with no cures.",
            "And if you treat with allopurinol fibrosis is is much less."
        ],
        [
            "And then another."
        ],
        [
            "Sorry, another disease in which fibrosis is very relevant is cancer.",
            "There is a population of cells in every cancer which is called cancer.",
            "Associated fibroblasts and the role of these cells in either inhibiting or enhancing tumor grow is very debated, but it's more likely that these cells are selected to favor tomorrow by the tumor itself.",
            "If you block the activity of these cells in cancer, you see here these are lungs, and this small infiltrates are tumor cells.",
            "If you treat them with a low parried all your."
        ],
        [
            "Use the burning of these accounts."
        ],
        [
            "So starting from this data together with a group of social zurowski jsi?"
        ],
        [
            "We decided to start from the initial screening of compounds FDA approved compounds.",
            "We only screen for 700 compounds and so were they."
        ],
        [
            "Do was to go back to all compounds found in Pub camp an predict some new compounds that could exert similar or even better antifibrotic effect and starting from this list we can identify if you compound that were structurally similar to these new classes of drugs, dopamine topiramate and anomaly here and actually again we are now assessing the antifibrotic role of dopamine.",
            "This is another drug.",
            "Which is extremely used for various purposes, but never being characterized for this effect."
        ],
        [
            "On fibrosis and so we are demonstrated in this drug is efficacy in blocking fibroblast activation in vitro in both animal."
        ],
        [
            "And human fibroblast.",
            "And also we have some data off its efficiency in."
        ],
        [
            "In vivo, so with that I will stop.",
            "I will show I will thank the people that have contributed to this work, collaborators."
        ],
        [
            "Funding Agency, and particularly the people that daily work together with me interesting.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm a medical doctor so guess how difficult for me is to interact and understand the way you analyze the data, so I will try to challenge you.",
                    "label": 0
                },
                {
                    "sent": "Try to understand some medical problems this afternoon.",
                    "label": 0
                },
                {
                    "sent": "This will be very far from what you probably do, but I will try to make it as simple as possible and give you give you the perspective of the applicative science that we would like to do and why we need such a long way of basic research.",
                    "label": 0
                },
                {
                    "sent": "Before having some knew biological tools to apply to our patients, I would like also to spend just a few words explaining what the ICD P is.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, our institution has this unfortunate name that is not very easy to spell, not even to remember.",
                    "label": 0
                },
                {
                    "sent": "But since I, by discussing with some of you, I understood that you probably not may not be aware of what we are and what we do.",
                    "label": 0
                },
                {
                    "sent": "The International Center for Genetic Engineering and Biotechnology is an intergovernmental organization which is part of the UN system.",
                    "label": 1
                },
                {
                    "sent": "United Nations system.",
                    "label": 0
                },
                {
                    "sent": "An indeed.",
                    "label": 0
                },
                {
                    "sent": "There are three main buildings of the IC GP.",
                    "label": 0
                },
                {
                    "sent": "The headquarter.",
                    "label": 0
                },
                {
                    "sent": "Is in interest, which is a very close to Slovenia, very close to where we are.",
                    "label": 0
                },
                {
                    "sent": "I just drove here this morning.",
                    "label": 0
                },
                {
                    "sent": "And the other main building is in India in New Delhi and then there is a third building in Cape Town in South Africa.",
                    "label": 0
                },
                {
                    "sent": "And then there is a network of about 64 either member of affiliated countries which are part of the SGP and the main mandate of the institution is to promote the safe and control use of biotechnology worldwide.",
                    "label": 0
                },
                {
                    "sent": "So what we do is to offer fellowships to either postdoctoral or predoctoral fellows.",
                    "label": 0
                },
                {
                    "sent": "Who are welcome to join the main ICD be institutes?",
                    "label": 0
                },
                {
                    "sent": "Be train at a high level and then we help them to go back to their respective countries an implement their own research there.",
                    "label": 0
                },
                {
                    "sent": "These countries of course are what we're developing countries at the time the ICD was founded.",
                    "label": 0
                },
                {
                    "sent": "So there is India, China which are far more developed than than Italy now.",
                    "label": 0
                },
                {
                    "sent": "But they are still part of the community and then another action very important action is to organize meeting and courses.",
                    "label": 0
                },
                {
                    "sent": "In all these countries, and this is also why we could contribute to this workshop, and this is a way to attract leaders in the various fields of biotechnology in these countries, and give the opportunity to local scientists to be in contact with big names in their field.",
                    "label": 0
                },
                {
                    "sent": "Then we also offers a small grants for collaborative projects between a CTB Member States and we have an activity of technology transfer.",
                    "label": 0
                },
                {
                    "sent": "So at the ICG be interested we are developing the protocols for the production of biosimilars, which means biological drugs that are out of patent and can be produced as.",
                    "label": 0
                },
                {
                    "sent": "Now brand product.",
                    "label": 0
                },
                {
                    "sent": "So we establish the procedure.",
                    "label": 0
                },
                {
                    "sent": "The protocol to produce these drugs, for instance erythropoetin's grow hormones and other drugs like we're moving to monoclonal antibodies, and then we transfer the technology to our Member States.",
                    "label": 0
                },
                {
                    "sent": "So this is just to show you who we are.",
                    "label": 0
                },
                {
                    "sent": "We are located physically in this area, Science Park.",
                    "label": 0
                },
                {
                    "sent": "It's a scientific park.",
                    "label": 0
                },
                {
                    "sent": "Interesting, you're all welcome to visit whenever you pass by.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's look at mentioned.",
                    "label": 0
                },
                {
                    "sent": "Our laboratory is interested in developing novel biotherapeutics for cardiovascular disorders.",
                    "label": 0
                },
                {
                    "sent": "You are well aware that the population worldwide is aging, and this means that all degenerative conditions are going to increase.",
                    "label": 0
                },
                {
                    "sent": "During the future years, cardiovascular disorders represent.",
                    "label": 0
                },
                {
                    "sent": "More than 30% of the causes of death and mortality worldwide, so this means that one people out of tree is going to die because of a cardiovascular disease.",
                    "label": 1
                },
                {
                    "sent": "And one of the major problem in age people is heart failure, which means that the hard at a certain point because of different causative diseases cannot do.",
                    "label": 0
                },
                {
                    "sent": "Its pump function cannot exert his pump function anymore and this leads to various problem of course in dealing with daily activities there is a short of breath Ness lacks become.",
                    "label": 0
                },
                {
                    "sent": "Adamatic and of course this is a major problem for the profusion of all organs, so this is going to lead to the death of the person in in five years in most of the patients at the time of diagnosis.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And as a medical doctor involved in research, I daily received requests from patients saying where do you have anything experimental?",
                    "label": 0
                },
                {
                    "sent": "That is ongoing?",
                    "label": 0
                },
                {
                    "sent": "Because I don't have any option anymore.",
                    "label": 0
                },
                {
                    "sent": "My doctor saying that there is either heart transplantation, but there are very few donors, so people are really willing to be enrolled in any kind of experimental trials with new drugs, and there is a real need for new drugs, because as already Luca mentioned, if we look at the drugs that we are using to treat these kind of patients.",
                    "label": 0
                },
                {
                    "sent": "Some of them are very, very old, like digitalis theoretics.",
                    "label": 0
                },
                {
                    "sent": "They are in used for more than one century's ready and the last drugs that have been introduced into the markets are the sartans angiotensin two receptor blockers that have been introduced in 1990.",
                    "label": 0
                },
                {
                    "sent": "This means that we are treating now heart failure patients more or less as we were doing 30 years ago.",
                    "label": 0
                },
                {
                    "sent": "If you.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Look at the global markets off drugs.",
                    "label": 0
                },
                {
                    "sent": "We see that there is an explosion of biotherapeutics, so this means no chemical drugs but biological drugs, which are much more complex to produce.",
                    "label": 0
                },
                {
                    "sent": "It's not a small molecule, a chemical that you can synthesize is something that you really have to invest a lot in order to have it ready and purify the clinical grade, but these these biotherapeutics are really revolutionizing many aspects many fields.",
                    "label": 0
                },
                {
                    "sent": "Of medicine.",
                    "label": 0
                },
                {
                    "sent": "One big example are monoclonal antibodies.",
                    "label": 0
                },
                {
                    "sent": "Most of cancer patients now are treated effectively with monoclonal antibodies, some of some types of cancer that were untreatable until a few years ago are now and almost easy to treat disease.",
                    "label": 0
                },
                {
                    "sent": "Because we have this potent drugs that can stops signals that drive cell proliferation, and this is a very effective way to stop the growth of cancer cells.",
                    "label": 0
                },
                {
                    "sent": "And in this can be also done specifically for some types of cancer, because we know the receptors that are specifically expressed, but by some types of cancer cells.",
                    "label": 0
                },
                {
                    "sent": "So if we look at the applications of monoclonal antibodies, they're very widely used in cancer.",
                    "label": 0
                },
                {
                    "sent": "They are very widely used in remote allergic diseases.",
                    "label": 0
                },
                {
                    "sent": "There is no single biotherapeutic, not single monoclonal antibody recombinant protein that is used to treat cardiovascular diseases.",
                    "label": 1
                },
                {
                    "sent": "So there is a huge space to bring this.",
                    "label": 0
                },
                {
                    "sent": "New drugs.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Forward.",
                    "label": 0
                },
                {
                    "sent": "And what kind of biotherapeutics we can think about?",
                    "label": 0
                },
                {
                    "sent": "You know that.",
                    "label": 0
                },
                {
                    "sent": "The easiest things to deliver our proteins.",
                    "label": 0
                },
                {
                    "sent": "Recombinant proteins that can be produced in the lab and purified and then deliver to patients or monoclonal antibodies follow under this category.",
                    "label": 1
                },
                {
                    "sent": "But we can even think of jeans as drugs, so proteins are encoded by our genomes.",
                    "label": 0
                },
                {
                    "sent": "We have genes that encode for protein and we can think of delivering genes an between among genes.",
                    "label": 0
                },
                {
                    "sent": "We can even consider micronized.",
                    "label": 0
                },
                {
                    "sent": "We have heard about.",
                    "label": 0
                },
                {
                    "sent": "So not only genes encodes for protein but also other stretches of nucleic acids that can.",
                    "label": 0
                },
                {
                    "sent": "Exert a biological function of biological activity and can be used as drug to modulate the either onset or progression of diseases.",
                    "label": 0
                },
                {
                    "sent": "And then we probably have heard about the possibility to yourself as a therapeutic tools.",
                    "label": 0
                },
                {
                    "sent": "There is a large field of regenerative medicine which uses cells or stem cells, putative stem cells, other cell types as a way of interfering with the progression of diseases, and the goal in the cardiovascular filled.",
                    "label": 1
                },
                {
                    "sent": "Is to promote these three important biological process that could be crucial to improve heart function, which is Neo under Genesis developing of new blood vessels or most of the.",
                    "label": 0
                },
                {
                    "sent": "One of the major problem in cardiovascular diseases, myocardial infarction.",
                    "label": 0
                },
                {
                    "sent": "You probably are all familiar because each of us has at least relative the head and myocardial infarction.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, this happens why when when one of the vessels that profuse the heart get stopped blocked because of either Arthur sclerotic plaque or a thrombus and this means that part of the heart is not perfused anymore, it cannot receive oxygen it cannot receive.",
                    "label": 0
                },
                {
                    "sent": "Nutrients and so this portion of the heart is going to die, and, as Luc already mentioned, and we will talk about the heart doesn't have regenerative capacity.",
                    "label": 0
                },
                {
                    "sent": "So if you have a problem with your skin, you have a bleed and then you have a clot and then stem cells in your skin.",
                    "label": 0
                },
                {
                    "sent": "Progressively replaced the scar an after a couple of months, days, years depending on your age.",
                    "label": 0
                },
                {
                    "sent": "The skin is able to completely regenerate damage and get the damage completely repair the heart is not capable of doing so, so whenever you have a portion of your heart that dies, this will be replaced by a fibrotic scar.",
                    "label": 0
                },
                {
                    "sent": "They will stay forever and won't be replaced by new contract tile tissue.",
                    "label": 0
                },
                {
                    "sent": "This is why after a while you are going to have an heart failure because this fibrotic star is not able to contract and so the heart.",
                    "label": 0
                },
                {
                    "sent": "It is not able to exert its pumping function anymore.",
                    "label": 0
                },
                {
                    "sent": "So if the problem arises because a coronary vessel and arterial vessel is blocked, then one of the potential strategy to overcome this problem is to induce the formation of new blood vessels that can revascularized this chemick heart, the myocardial infarction.",
                    "label": 0
                },
                {
                    "sent": "Then another important aim is to protect the cells that have survived the damage in order to minimize the number of cells that are going to die and not pump anymore.",
                    "label": 0
                },
                {
                    "sent": "And 3rd very ambitious.",
                    "label": 0
                },
                {
                    "sent": "Aim is to induce regeneration in the heart, so to do something similar that is going to happen in your skin where there are style cells that, in response to a damage, can proliferate and repair that issue.",
                    "label": 0
                },
                {
                    "sent": "An form a tissue which is more or less identical to what has been lost during the damage.",
                    "label": 0
                },
                {
                    "sent": "So let's start from.",
                    "label": 0
                },
                {
                    "sent": "I won't talk about the angiogenesis, I will just provide you some overview of what we're doing in the field of myocardial protection and myocardial regeneration, which is more a follow up of Waterloo can.",
                    "label": 1
                },
                {
                    "sent": "Also Miguel mentioned already because everything started with a screening.",
                    "label": 0
                },
                {
                    "sent": "And then I will provide you something more about the collaborative approaches that we are undertaking together with institutions Steven again on fibrosis.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if you look at the literature and you search for biological molecules, so essentially proteins that can protect the heart can be beneficial after myocardial infarction.",
                    "label": 0
                },
                {
                    "sent": "You can find the hundreds of hits that have been proven to be beneficial in animal models, so that can be of some benefit for the heart, and it is very difficult from such a literature trying to understand which one are the best one.",
                    "label": 0
                },
                {
                    "sent": "Which one are those that have a chance to progress toward the clinical experimentation and being successful even in in in a disease condition?",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In humans.",
                    "label": 0
                },
                {
                    "sent": "And so This is why we decided a few years ago to undertake a different strategy, which is completely novel way.",
                    "label": 0
                },
                {
                    "sent": "Thinking about how to select the best drugs to push forward to the clinic that we call Francel and is aimed to select the best cardio protective factors directly in in vivo models.",
                    "label": 0
                },
                {
                    "sent": "So this is the kind of screening approach which doesn't need.",
                    "label": 0
                },
                {
                    "sent": "Robots, but needs a disease model in vivo, so an animal model in which you can deliver pull.",
                    "label": 1
                },
                {
                    "sent": "Offer biological drugs and then select those that exert the best therapeutic function.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Miguel already mentioned the possibility to have a pooled SAJ libraries for in vitro screening, and in this case we wanted to.",
                    "label": 0
                },
                {
                    "sent": "Invent, let's say a similar approach to apply these libraries directly in vivo in an animal model.",
                    "label": 1
                },
                {
                    "sent": "In this case of myocardial infarction, but this could be applying principle to any kind of disease, and I will show you another view of what you can do with this.",
                    "label": 0
                },
                {
                    "sent": "So the tool that we decided to use is something that also you have already heard about.",
                    "label": 0
                },
                {
                    "sent": "That are adino associated vectors.",
                    "label": 0
                },
                {
                    "sent": "So these are viruses that can be can be modified genetically modified using genetic engineering and transform viruses into vectors for gene delivery.",
                    "label": 1
                },
                {
                    "sent": "They are called AV, which stands for adino associated viruses.",
                    "label": 0
                },
                {
                    "sent": "You may have heard about Odino virus because this is a pathogen for humans.",
                    "label": 0
                },
                {
                    "sent": "It causes very severe pneumonia, especially in kids and immuno compromised patients.",
                    "label": 0
                },
                {
                    "sent": "And this virus has this unfortunate name because it's calladine associated, but it has never to do with odino virus.",
                    "label": 0
                },
                {
                    "sent": "It's called like that because it has been firstly described as a contaminant of enedina viral preparation.",
                    "label": 0
                },
                {
                    "sent": "So this is an electron microscopy showing these big rounds particle.",
                    "label": 0
                },
                {
                    "sent": "These Arduino viral particles and these small circle arounds are AVEs.",
                    "label": 0
                },
                {
                    "sent": "And they are together.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because AV is a defective virus is not able to sustain its own replication in needs.",
                    "label": 0
                },
                {
                    "sent": "Another virus, for instance Adino virus to replicate.",
                    "label": 0
                },
                {
                    "sent": "And This is why it's called associated.",
                    "label": 0
                },
                {
                    "sent": "And this is also why it is very safe because it's a virus that precise not able to replicate itself.",
                    "label": 0
                },
                {
                    "sent": "So it's very good to use it as a tool to deliver therapeutic jinx because it's not pathogenic, it has never been associated to any human disease.",
                    "label": 0
                },
                {
                    "sent": "80% of the population.",
                    "label": 0
                },
                {
                    "sent": "Do have antibodies against AV, so this means that in this room we are about 50 people.",
                    "label": 0
                },
                {
                    "sent": "Let's say that 3540 of us have encountered this virus an we never appreciate it were infected by it because it doesn't create any problem.",
                    "label": 0
                },
                {
                    "sent": "And in addition, is not competent for replication, so it is really very safe an it has a very simple genome.",
                    "label": 1
                },
                {
                    "sent": "This is the genome of the virus.",
                    "label": 0
                },
                {
                    "sent": "It only has two genes which are called wrap that is needed for its replication and cap, which is needed to make the capsid proteins and these two genes can be completely replaced by genetic engineering technologies and replaced by a therapeutic gene.",
                    "label": 0
                },
                {
                    "sent": "So you can use these kind of particles to put inside the gene of your choice and allow this to infect the target cells and deliver your favorite jeans to Targ.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It says so the idea.",
                    "label": 0
                },
                {
                    "sent": "Here is.",
                    "label": 0
                },
                {
                    "sent": "To have a libraries of AAV vectors in which every particle unk chords for gin.",
                    "label": 0
                },
                {
                    "sent": "And then inject pool of viral particles in a tissue.",
                    "label": 0
                },
                {
                    "sent": "Let's say in a heart.",
                    "label": 0
                },
                {
                    "sent": "And then recreate the disease such as myocardial infarction.",
                    "label": 1
                },
                {
                    "sent": "What I told you before is after a myocardial infarction.",
                    "label": 0
                },
                {
                    "sent": "Most of the cardiac tissue is going to die.",
                    "label": 0
                },
                {
                    "sent": "And the idea behind this project is that in if inside one of these particles there is a gene that can confirm a protection to the cells it enters.",
                    "label": 0
                },
                {
                    "sent": "This cell will have a higher chance to survive after the damage and so if after the damage we recover the cells that have survived an we search for the jeans that are present in the surviving cells, we should enrich our pool of actors of genes that confer.",
                    "label": 0
                },
                {
                    "sent": "Cardioprotection so that are beneficial for the heart.",
                    "label": 1
                },
                {
                    "sent": "And we build this library in order to have every gene with a bar code that we can easily identify using next generation sequencing and so in a very straightforward manner, we could screen multiple genes.",
                    "label": 0
                },
                {
                    "sent": "In a disease model, an identify the genes that are the most effective in protecting cardiomyocytes from death after myocardial infarction and is.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is exactly what we did.",
                    "label": 0
                },
                {
                    "sent": "So we built libraries of heavy vectors an initially we choose to focus, not on the whole genome.",
                    "label": 0
                },
                {
                    "sent": "Because of course this will require that these pools are injected in vivo, so there is a lot of manual work that needs to be done.",
                    "label": 0
                },
                {
                    "sent": "Is noted as show before that robots can do it for you so far.",
                    "label": 0
                },
                {
                    "sent": "So we decided to focus on two kinds of libraries, either on libraries of actors producing secreted proteins, or libraries of vectors encoding for micro RNA's, and why we choose these two different categories, because these are therapeutics that could also be deliverd as recombinant molecule.",
                    "label": 0
                },
                {
                    "sent": "So we run the screening using viral vectors, but as you might be aware of.",
                    "label": 0
                },
                {
                    "sent": "Translating a gene therapy approach that required the use of modified viruses is not so easy.",
                    "label": 0
                },
                {
                    "sent": "It has a lot of limitations, a lot of cost and preclinical work that is needed to bring any gene therapy from the bench to animal models and to the bedside.",
                    "label": 0
                },
                {
                    "sent": "An whereas in this case we could select for proteins that could be delivered as recombinant proteins.",
                    "label": 0
                },
                {
                    "sent": "Biotherapeutics, as mentioned before, or synthetic micronized, and This is why we decided initially to focus on this categories of jeans.",
                    "label": 0
                },
                {
                    "sent": "So to start our screening and so.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What we did was to clone about 1200 Gene into a vectors encoding for secreted proteins, and we run the screening exactly as I described to you and to make a quite a Long story short, we could identify about 80 factors that are cardioprotective.",
                    "label": 0
                },
                {
                    "sent": "Among these factors are some jeans that are already known for their beneficial activity in the heart.",
                    "label": 0
                },
                {
                    "sent": "But as you can see here there are.",
                    "label": 0
                },
                {
                    "sent": "Most most of them actually the majority of them are not known, so they're completely either novel genes or genes for which.",
                    "label": 0
                },
                {
                    "sent": "A different biological activity has been described, but they were never being associated to any activity in the heart, and so now we're working on three of them, and.",
                    "label": 0
                },
                {
                    "sent": "We are trying to produce them also as a recombinant proteins.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And assess their beneficial effect.",
                    "label": 0
                },
                {
                    "sent": "So for the new one I don't have.",
                    "label": 0
                },
                {
                    "sent": "Very a detailed characterization, but one of the factors that emerge from this screening was grilling, an actually Grayling.",
                    "label": 0
                },
                {
                    "sent": "I don't know whether you have ever heard about the existence of this protein, but grilling is one of the hormones that mediate the food intake.",
                    "label": 0
                },
                {
                    "sent": "This means that when you're hungry, this almost tells your brain that you should have some food in your body.",
                    "label": 0
                },
                {
                    "sent": "And this is the way and the activity that was known at the time for Grayling.",
                    "label": 0
                },
                {
                    "sent": "But this emerged as one of the jeans that were most important in protecting muscle cells and cardiac muscle cells from ischemic death.",
                    "label": 0
                },
                {
                    "sent": "And so we try to deliver Grayling to this chemick heart.",
                    "label": 0
                },
                {
                    "sent": "You are already familiar with this kind of staining because look already show you here in blue, you have a scar and you see that.",
                    "label": 0
                },
                {
                    "sent": "Delivering greyling this car is very much.",
                    "label": 0
                },
                {
                    "sent": "Smaller and if you look at parameters of cardiac function, this confers a very huge beneficial effect to infarcted hearts in terms of cardiac protection, so we could discover and you function.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Offer Grayling as I mentioned.",
                    "label": 0
                },
                {
                    "sent": "Grayling is one of the.",
                    "label": 0
                },
                {
                    "sent": "Of the hormones that mediate the food intakes.",
                    "label": 0
                },
                {
                    "sent": "And there are two main receptors known for grilling that are receptors that are present in our brain.",
                    "label": 0
                },
                {
                    "sent": "Because the brain is the organ that has to be alerted when we need food in order to change our behavior and get to search for some food.",
                    "label": 0
                },
                {
                    "sent": "But none of these receptors is expressed by cardiomyocytes.",
                    "label": 0
                },
                {
                    "sent": "So another project that again we're approaching with a high throughput screening.",
                    "label": 0
                },
                {
                    "sent": "Is to look for the relevant receptor that mediate the active.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "City of Grayling.",
                    "label": 0
                },
                {
                    "sent": "In cardiac cells.",
                    "label": 0
                },
                {
                    "sent": "And here are just some movies that show you a myocardial infarction in a normal heart that these are echocardiography again and I don't know how familiar you are, but this is a heart that is contracting and you see here in this portion that you so essentially the black part in the in the middle of the movie is the blood.",
                    "label": 0
                },
                {
                    "sent": "Whatever is white here around is cardiac muscle, and you probably guess here that there is less contractile tissue.",
                    "label": 0
                },
                {
                    "sent": "An instead when you deliver Grayling, you have more contractile tissue.",
                    "label": 0
                },
                {
                    "sent": "This will become more evident in later pictures that I'm.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Going to show you and we also describe the mechanism by which Grayling acts to protect cardiomyocyte, which is through the induction of autophagy.",
                    "label": 0
                },
                {
                    "sent": "This is another very interesting biological process that you can even use for screening, so we also run screening for autophagy.",
                    "label": 0
                },
                {
                    "sent": "I don't know whether you have never heard about autophagy.",
                    "label": 0
                },
                {
                    "sent": "It's quite a hot topic in biological research.",
                    "label": 0
                },
                {
                    "sent": "And it is a way by which cells.",
                    "label": 1
                },
                {
                    "sent": "And in particular, cells that don't replicate such as cardiomyocytes neurons.",
                    "label": 0
                },
                {
                    "sent": "Can renew parts of its content.",
                    "label": 0
                },
                {
                    "sent": "So imagine that we.",
                    "label": 0
                },
                {
                    "sent": "Were born with a certain number of neurons or cardiomyocytes.",
                    "label": 0
                },
                {
                    "sent": "These cells are permanent.",
                    "label": 0
                },
                {
                    "sent": "They're quiet and they don't replicate, so we were born with these cells and we have to keep these also working and active for all our life without replacing them.",
                    "label": 0
                },
                {
                    "sent": "So they have to be functional for 80 years or more and there might there has there have to be mechanism by which these cells can renew.",
                    "label": 0
                },
                {
                    "sent": "They organized a protein, the.",
                    "label": 0
                },
                {
                    "sent": "Part of their structure to because all the cells are exposed to oxidative damage, a lot of insults can happen to a cell, so cells that have to live with us needs ways of replacing this functional part of the cells, and this is a way cells can renew part of its content.",
                    "label": 0
                },
                {
                    "sent": "They can engulf dysfunctional organelles in these blobs that you can see here, colored in either grade or in.",
                    "label": 0
                },
                {
                    "sent": "Green, dependent on the pH and on the way of this renewal cycle they are, and in this way they can destroy parts of the cells that are not functional anymore.",
                    "label": 0
                },
                {
                    "sent": "They make new parts so the cells is not renewing itself is not regenerating, but it can renew parts of its content through this mechanism, which is called auto.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fady and this is.",
                    "label": 0
                },
                {
                    "sent": "Very protective for the heart, of course, because cardiomyocytes as mentioned are cells that cannot regenerate.",
                    "label": 0
                },
                {
                    "sent": "Then we also use a similar approach to screen for molecules that can promote the engraftment of stem cells.",
                    "label": 1
                },
                {
                    "sent": "You have probably have heard, as I mentioned, also beef.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or that regenerative medicine is willing to regenerate tissue by delivering stem cells.",
                    "label": 0
                },
                {
                    "sent": "The problem in various organs, and particularly in the heart, is that whatever kind of cells you try to inject to repair damage normally.",
                    "label": 0
                },
                {
                    "sent": "The microenvironment of a tissue damage is quite hostile for Salon Grafman becausw.",
                    "label": 0
                },
                {
                    "sent": "Again, you even have a deficiency of oxygen and nutrients.",
                    "label": 0
                },
                {
                    "sent": "You have a very high pH because of the inflammation.",
                    "label": 0
                },
                {
                    "sent": "And so most of the cells that you are going to inject to repair any tissue are going to die because they don't find an environment that supports the engraftment.",
                    "label": 0
                },
                {
                    "sent": "They grow the proliferation, data generation, whatever they have to do to repair the damage.",
                    "label": 0
                },
                {
                    "sent": "And so in this case, what we could do was to use the same libraries that we already have available and deliver the library tools themselves.",
                    "label": 0
                },
                {
                    "sent": "In this guy we use amazing kimel stromal cells cells that derive from the bone marrow that I use in a different regenerative medicine approaches.",
                    "label": 0
                },
                {
                    "sent": "And again, since these cells, when transplanted, we know that they're going to die because of the hostile Micron vironment those cells that survive will probably be on rich.",
                    "label": 0
                },
                {
                    "sent": "For jeans that favor their engraftment, their survival, their proliferation, whatever is beneficial after their transplantation into into a damaged tissue and using exactly the same approach we could identify so.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Factors I show you one of them, which is named cargo troughing that is.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Very potent in.",
                    "label": 0
                },
                {
                    "sent": "Enhancing the capacity of stem cell to engraft and recite and persist in the heart so we selected this factor using this invisible functional selection strategy, and then we validated the capacity.",
                    "label": 1
                },
                {
                    "sent": "Of this factor to promote then graph modalities are in red.",
                    "label": 0
                },
                {
                    "sent": "Here we labeled cells.",
                    "label": 1
                },
                {
                    "sent": "Stem cells and then we show that after delivering of cardio troughing as a Navy, but also the recombinant protein, the number of red cells that survive into ischemic heart.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Was much higher.",
                    "label": 0
                },
                {
                    "sent": "And the way it works is becausw.",
                    "label": 0
                },
                {
                    "sent": "It promotes the expression and the localization of these red structure which are called.",
                    "label": 0
                },
                {
                    "sent": "Um addition molecules that the some proteins that localize do addition and immediatly additional cell to the straps to the substrate.",
                    "label": 0
                },
                {
                    "sent": "So do the extracellular matrix.",
                    "label": 0
                },
                {
                    "sent": "They promote the localization of these proteins to the cell membrane and this render the sell more stitchy more able to attach to the extracellular matrix and so it increases the days of properties of of the cells.",
                    "label": 0
                },
                {
                    "sent": "So focal additions are increased and the cells has a higher chance to attach to the matrix and normally sell.",
                    "label": 0
                },
                {
                    "sent": "So when they are attached they have.",
                    "label": 0
                },
                {
                    "sent": "A higher capacity to survive.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is just to show and then we can apply.",
                    "label": 0
                },
                {
                    "sent": "As mentioned this strategy to any disease conditions in which you have a loss of cells.",
                    "label": 0
                },
                {
                    "sent": "Because in this way you can select for jeans that promote the survival of these cells or the proliferation of these cells and that confer advantages.",
                    "label": 0
                },
                {
                    "sent": "Another condition very common is diabetes.",
                    "label": 0
                },
                {
                    "sent": "In diabetes, what happens that beta cells in your pancreas they normally produce insulin?",
                    "label": 0
                },
                {
                    "sent": "Are getting lost because of degenerative condition or out immune condition but independent of the cause?",
                    "label": 0
                },
                {
                    "sent": "Normally you have a reduction in the number of beta cells that produce insulin in your pancreas.",
                    "label": 0
                },
                {
                    "sent": "So if you deliver this library to the pancreas and then you induce diabetes, then you can select for some factors that promote either the survival or the proliferation.",
                    "label": 0
                },
                {
                    "sent": "The regeneration of beta cells in the pancreas and Luca has spent.",
                    "label": 0
                },
                {
                    "sent": "Few years of his life.",
                    "label": 0
                },
                {
                    "sent": "In searching for these genes and eventually identified a very few potent molecules that cure diabetes.",
                    "label": 1
                },
                {
                    "sent": "So this is something else that hopefully will be brought to the clinic soon.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But this is part of the problem as mentioned.",
                    "label": 1
                },
                {
                    "sent": "So one aim is to protect the cells that survive after damage.",
                    "label": 1
                },
                {
                    "sent": "The other big problem in the heart is to promote regeneration because after myocardial infarction this is a rough estimate.",
                    "label": 0
                },
                {
                    "sent": "The heart loses billions of cardiomyocytes that cannot be replaced by.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Endogenous regeneration and this is how cardiomyocytes look like in the embryonic heart.",
                    "label": 0
                },
                {
                    "sent": "So one when the heart grows and develops, this is the aspect of cardiomyocytes after birth.",
                    "label": 0
                },
                {
                    "sent": "In a few days, cardiomyocytes completely change their shape.",
                    "label": 0
                },
                {
                    "sent": "They become round shape, they become multinucleated, and you can even guess even if you're not.",
                    "label": 0
                },
                {
                    "sent": "Expert biologist that these cells are more prone to replicate the diesels.",
                    "label": 0
                },
                {
                    "sent": "Because these cells, adult cardiomyocytes are characterized by a very complex.",
                    "label": 0
                },
                {
                    "sent": "Architectural structure as look already mentioned, so one of the key issue to induce the proliferation of these cells is to destroy and is assembled.",
                    "label": 0
                },
                {
                    "sent": "This very complex architecture that characterize adult cardiomyocytes.",
                    "label": 0
                },
                {
                    "sent": "And this change occurs suddenly after birth.",
                    "label": 1
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Over the last I would say 10 years in the lab we spent a lot of effort in trying to understand what happens at birth that completely change the phenotype of cardiomyocytes.",
                    "label": 0
                },
                {
                    "sent": "And there are a lot of things actually that happens at birth that might be responsible for this sudden change that also translates into a different regenerative capacity.",
                    "label": 0
                },
                {
                    "sent": "So before birth, cardiomyocyte can replicate because of course the heart has to grow after birthday, cannot replicate anymore, and they completely change their shape.",
                    "label": 0
                },
                {
                    "sent": "They also completely change their metabolism, and this is another story.",
                    "label": 0
                },
                {
                    "sent": "So what is driving this changes?",
                    "label": 0
                },
                {
                    "sent": "And there might be.",
                    "label": 0
                },
                {
                    "sent": "An intrinsic genetic control, so there might be a developmental process that is ongoing, but there might be also something extrinsic.",
                    "label": 1
                },
                {
                    "sent": "Something environmental that happens to the heart that somehow modulate the phenotype.",
                    "label": 0
                },
                {
                    "sent": "The biology of these cells.",
                    "label": 1
                },
                {
                    "sent": "And what happens at birth is that there is a sudden mechanical stretch, so the heart.",
                    "label": 1
                },
                {
                    "sent": "Suddenly is exposed to higher dynamic forces.",
                    "label": 0
                },
                {
                    "sent": "The blood pressure increases the long expands, so suddenly the heart has to face more mechanical stress and this is something we are also exploring.",
                    "label": 0
                },
                {
                    "sent": "For instance, a role is driven by the sudden increase in oxygen tension during embryonic development.",
                    "label": 0
                },
                {
                    "sent": "The heart receives oxygenated blood blood by the mother, but this is not very purely oxygenated blood because the embryo is quite peripheral compared to the heart of the mother, whereas when they baby get born.",
                    "label": 0
                },
                {
                    "sent": "The lung expands and there is much more oxygen coming to the blood.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Today to the heart.",
                    "label": 0
                },
                {
                    "sent": "And actually this drives the formation of oxygen free radicals.",
                    "label": 0
                },
                {
                    "sent": "Rasa rasa reactive oxygen species and this is partially responsible for the exit of cardiomyocytes from the cell cycle.",
                    "label": 0
                },
                {
                    "sent": "So, if you modulate the formation of reactive oxygen species, you can extend the window.",
                    "label": 0
                },
                {
                    "sent": "The time window in which.",
                    "label": 0
                },
                {
                    "sent": "Argue myocytes keep proliferating afterbirth.",
                    "label": 0
                },
                {
                    "sent": "After awhile, they stop anyway, but for sure the generation of oxygen driven Ross is one of the components that contributes to the loss of proliferation of cardiomyocytes, and we contributed to this paper showing this.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another sudden change that happens at birth is that suddenly the heart is not exposed anymore to the maternal circulation because it is delivered out of the mother body and soul.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Since during pregnancy the a lot of changes occurs in the in the mother body and one of these is the expansion of T. Rex.",
                    "label": 0
                },
                {
                    "sent": "I don't know whether you know what are T Rex regulatory T cells.",
                    "label": 1
                },
                {
                    "sent": "They are cells that are part of our immune system that needs to be expanded.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because the pregnancy is a very unique situation in which a human body host another body that is not genetically identical to its own.",
                    "label": 0
                },
                {
                    "sent": "Says and so the mother has to become tolerant toward the antigens that are driven by the father DNA.",
                    "label": 0
                },
                {
                    "sent": "And this is.",
                    "label": 0
                },
                {
                    "sent": "Perform because there are.",
                    "label": 0
                },
                {
                    "sent": "This is specific immune cells that are called regulatory T cells that are cell that blunt the new response and allow the generation of tolerance so your immune systems become tolerant against new antigens to which it is exposed.",
                    "label": 0
                },
                {
                    "sent": "And this allows the mother not to reject its own baby which is growing its body.",
                    "label": 0
                },
                {
                    "sent": "So these cells are expanded urine pregnancy.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And since over the last years.",
                    "label": 0
                },
                {
                    "sent": "These cells were also being described to have not immune function, but also regenerative function.",
                    "label": 0
                },
                {
                    "sent": "For instance, it has been shown that these cells contribute to muscle repair, skeletal muscle repair after injury, an also to the regulation of metabolism, and in in fact issue.",
                    "label": 0
                },
                {
                    "sent": "We wonder whether the presence of this high level of T. Rex could have been something to do to the proliferation of cardiomyocytes during embryonic development.",
                    "label": 0
                },
                {
                    "sent": "And they.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sudden loss of proliferative capacity after birth, when the heart is not exposed anymore to a blood containing this high level of T. Rex and again last year, we could show that then actually T. Rex produce protein that stimulates cardiomyocyte proliferation.",
                    "label": 0
                },
                {
                    "sent": "These are cardiomyocytes that are exposed to factors produced by T regs, and they proliferate more you are again familiar with these kind of images where.",
                    "label": 0
                },
                {
                    "sent": "Incorporating in U or being positive for other markers of cycle, so cell proliferation such as Ki 6750 E and phosphorus on H3 Aurora B, which is a protein that marks not just nuclear division.",
                    "label": 0
                },
                {
                    "sent": "So when the cell has to divide first, the nuclei replicate, but then also the cytoplasm.",
                    "label": 0
                },
                {
                    "sent": "The rest of the cell has to become to split into two parts.",
                    "label": 0
                },
                {
                    "sent": "And they keep rotating that mediate this process.",
                    "label": 0
                },
                {
                    "sent": "Is this kinase, which is called Aurora B.",
                    "label": 0
                },
                {
                    "sent": "So having Aurora B?",
                    "label": 0
                },
                {
                    "sent": "At this specific location.",
                    "label": 0
                },
                {
                    "sent": "Means that the cells is actually dividing.",
                    "label": 0
                },
                {
                    "sent": "And so this is a proof that directs not only news the duplication of nuclei, but actually force cytokinesis.",
                    "label": 0
                },
                {
                    "sent": "So Cytoplast division, and so the one of the novelty of this paper was to clearly show that T. Rex induce the proliferation of cardiomyocytes in the embryo.",
                    "label": 0
                },
                {
                    "sent": "And then these explain while after birth this proliferative stimulus is lost, but it also drives a bit.",
                    "label": 0
                },
                {
                    "sent": "Of proliferation in the heart of the mother.",
                    "label": 0
                },
                {
                    "sent": "We all know that during pregnancy the heart is getting larger in the mother and this has been called the physiological hypertrophy of the pregnancy.",
                    "label": 0
                },
                {
                    "sent": "So pregnancy was so as a kind of physical exercise where you have to face again against the higher hemodynamic pressure and the heart becomes bigger like in an athlete because it has to work more because the volume of blood that he has to pump is is higher.",
                    "label": 0
                },
                {
                    "sent": "But there might be also at all for proliferation instead of hypertrophy.",
                    "label": 0
                },
                {
                    "sent": "So normally in the post Natal heart they own largement in heart size.",
                    "label": 0
                },
                {
                    "sent": "Can be pathological, as in the course of hypertension can be physiological as in sports athlete.",
                    "label": 0
                },
                {
                    "sent": "As in pregnancy, but in any case was told to be driven by hypertrophy, so cardiomyocytes cannot replicate.",
                    "label": 0
                },
                {
                    "sent": "They can only own large.",
                    "label": 0
                },
                {
                    "sent": "They can be car.",
                    "label": 0
                },
                {
                    "sent": "They can become bigger as look I showed you in the screening that you showed you before this.",
                    "label": 0
                },
                {
                    "sent": "Is an indication that maybe that might be at all for proliferation as well during during pregnancy and cardiomyocyte during pregnancy when they are exposed to high level of regulatory T cells can also proliferate.",
                    "label": 0
                },
                {
                    "sent": "So this is the first indication that maybe the heart is not really post mitotic that some regeneration.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Can occur spontaneously and this is not the only indication because during the last year there have been several.",
                    "label": 0
                },
                {
                    "sent": "Partial hits to this dogma that cardiomyocytes afterbirth cannot replicate anymore, that they are completely exhausted, their proliferative potential.",
                    "label": 0
                },
                {
                    "sent": "So functionally this is true because if we have a cardiac damage different from other tissues that can regenerate, the heart cannot regenerate, so functionally it is a post mitotic organ.",
                    "label": 1
                },
                {
                    "sent": "But there are various evidence this one of the pregnancy data show you an also other elements that.",
                    "label": 1
                },
                {
                    "sent": "Tend to say that maybe there might be some regenerative potentials also in the.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Post Natal heart.",
                    "label": 0
                },
                {
                    "sent": "One evidence comes from simpler Organism model organisms such as this one.",
                    "label": 0
                },
                {
                    "sent": "This is the axolotl.",
                    "label": 0
                },
                {
                    "sent": "Or Ambystoma mexicanum and is a very funny guy.",
                    "label": 1
                },
                {
                    "sent": "I think he lubiana day they how's it for regenerative purposes, right?",
                    "label": 0
                },
                {
                    "sent": "And it is extremely useful to study any kind of tissue regeneration we can, can regenerate everything.",
                    "label": 0
                },
                {
                    "sent": "You can cut its tail as the lizard and it regenerates, but even his slim.",
                    "label": 0
                },
                {
                    "sent": "So they produce.",
                    "label": 0
                },
                {
                    "sent": "I think this movie was produced in Louisiana.",
                    "label": 0
                },
                {
                    "sent": "You can cut this limb and it will regenerate.",
                    "label": 0
                },
                {
                    "sent": "You can cut it again and they will regenerate at the war.",
                    "label": 0
                },
                {
                    "sent": "In the worst scenario, it will regenerate two arms instead of 1 because something goes wrong with the regenerative potential, but it keeps regenerating.",
                    "label": 0
                },
                {
                    "sent": "You can cut part of his brain and it will regenerate the part of its eye, and with Hillary generate and part of its heart and it will it regenerate.",
                    "label": 0
                },
                {
                    "sent": "So there are animals.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another one is zebrafish.",
                    "label": 0
                },
                {
                    "sent": "This is a fish that has been used a lot in developmental studies because as all fish is, its development occurs out of the muddy of out of the mother's body.",
                    "label": 0
                },
                {
                    "sent": "So you can really see the development under the microscope.",
                    "label": 0
                },
                {
                    "sent": "You can genetically manipulate, so it's very used in biological developmental studies.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But almost 10 years ago, or more than 10 years ago, already more than most 20 years ago, kintos clearly demonstrated that.",
                    "label": 0
                },
                {
                    "sent": "The Deborah Fish Heart is capable of full regeneration even in adult fish is.",
                    "label": 0
                },
                {
                    "sent": "So what happens if you cut up to 1/3 of the fish heart?",
                    "label": 0
                },
                {
                    "sent": "Is that initially a cloud forms as in our normal bleeding and then in seven days cardiomyocytes close to the respected portion start to differentiate partially proliferate to incorporate beard you with you.",
                    "label": 0
                },
                {
                    "sent": "This nucleotide analog that triggered the.",
                    "label": 0
                },
                {
                    "sent": "A reveal proliferation and then they re differentiate again to give rise to a contractile tissue which is indistinguishable from the previous one.",
                    "label": 0
                },
                {
                    "sent": "So in the also the fish during the first 2 weeks when this cloth is there, fish doesn't move so much.",
                    "label": 0
                },
                {
                    "sent": "But after 14 days, for instance, you cannot recognize it anymore, it start.",
                    "label": 0
                },
                {
                    "sent": "Swimming and moving as all the other fish is because the heart is is getting normal again.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is also true for mammals, at least for mice during the first week after birth.",
                    "label": 0
                },
                {
                    "sent": "I told you that something changes in cardiomyocyte shape, function metabolism after birth, what what means after birth in the mouse.",
                    "label": 0
                },
                {
                    "sent": "This means seven days after birth.",
                    "label": 0
                },
                {
                    "sent": "During these seven days Windows, if you cut the apex of the heart, this completely regenerate.",
                    "label": 0
                },
                {
                    "sent": "There is no scar as in our heart you can cut the apex.",
                    "label": 0
                },
                {
                    "sent": "You can induce a myocardial infarction because now.",
                    "label": 0
                },
                {
                    "sent": "Technologies allows with the very potent operation microscopes to ligate the coronary artery of a mouse embryo to induce myocardial infarction and the heart completely regenerates no problem.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And indeed, the using these neonatal cardiomyocytes.",
                    "label": 1
                },
                {
                    "sent": "You can see that they can proliferate.",
                    "label": 0
                },
                {
                    "sent": "You can use the neonatal cardiomyocyte to produce these artificial tissue that we also produce a DIC DB that is Francesca Loffredo is using this technique, so you see we call this calamari ring because they look like a calamari, but actually this is contractile tissue derived from neonatal cardiomyocytes, so.",
                    "label": 0
                },
                {
                    "sent": "There is a certain time window during which cardiomyocytes can actually proliferate and still keep their capacity to fully differentiate and produce a contract.",
                    "label": 0
                },
                {
                    "sent": "Tyler cardiomyocyte issue.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Myocardial tissue and, of course, we cannot do these experiments with human cardiomyocyte, so we don't know exactly the if this is true.",
                    "label": 0
                },
                {
                    "sent": "Also, for a short prenatal windows in humans.",
                    "label": 0
                },
                {
                    "sent": "But there are indirect indication that this might be true, because there are on a dock tickle evidence or very large myocardial infarction in neonates, sometimes for anatomical malformation, it happens that even kids after birth, they suddenly develop myocardial infarction.",
                    "label": 0
                },
                {
                    "sent": "We were very extensive damage that can be now documented by MRI and other imaging techniques, and if you look at the function of these hearts.",
                    "label": 0
                },
                {
                    "sent": "Some of them recover completely, so even big infects if they occur during the first weeks after birth, could recover without sign of fibrosis and.",
                    "label": 0
                },
                {
                    "sent": "Not contractile tissue as a.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Once in a in adult, and finally there is this.",
                    "label": 0
                },
                {
                    "sent": "Additional indication that there might be some regeneration ongoing even in the human heart.",
                    "label": 0
                },
                {
                    "sent": "Which has been possible thanks to the use of these techniques that is used to label the age of trees based on the detection of isotopic carbon atoms.",
                    "label": 0
                },
                {
                    "sent": "And wow, and essentially what happens during the Second World War.",
                    "label": 1
                },
                {
                    "sent": "During the explosions of the atomic bomb was that there was a peak in the concentration of carbon 14 in the atmosphere.",
                    "label": 0
                },
                {
                    "sent": "Normally the carbon is present at carb as carbon 12 in our atmosphere, but because of the atomic explosion there was this speak and this amount of carbon 14 has been incorporated into all cells that were making their DNA in new clothes at that time.",
                    "label": 1
                },
                {
                    "sent": "So if we now take a person that died today and was bored at the time of this speak, we can quite easily understand by measuring the ratio between camburn 14 air come carbon 12 weather is or air cells were born at the time the person was born because they keep the same high level of carbon 14 or were generated recently because it comes.",
                    "label": 0
                },
                {
                    "sent": "As you can see here this peak.",
                    "label": 0
                },
                {
                    "sent": "Has been progressively decreased with the normal exhaustion of isotope half life.",
                    "label": 0
                },
                {
                    "sent": "And so currently there is no more carbon 14 in the atmosphere.",
                    "label": 0
                },
                {
                    "sent": "So if a person died today an his hair cells were born few months ago, his.",
                    "label": 0
                },
                {
                    "sent": "Cells have a level of carbon 14 which is almost zero as today.",
                    "label": 0
                },
                {
                    "sent": "If instead the neurons, for instance of cardiomyocytes, were born with a person and kept for the entire life, they should have a very high amount of carbon 14 and this study has allowed to date the.",
                    "label": 0
                },
                {
                    "sent": "Half life of most tissues in the human body.",
                    "label": 0
                },
                {
                    "sent": "For instance, for the brand new study was firstly down for the brain, and it shows that not all our brain regions today it's the same time.",
                    "label": 0
                },
                {
                    "sent": "So there are regions of the brain that can regenerate and renew themselves, other not and for the heart what for the heart it was shown that throughout our life let's say 85 years we renew half of our hearts.",
                    "label": 0
                },
                {
                    "sent": "Also half of our cardiomyocytes were born with us and they keep.",
                    "label": 0
                },
                {
                    "sent": "Staying there for 85 years, half of them are somehow renewed and most of these renewal occurs during the first month days of our life.",
                    "label": 0
                },
                {
                    "sent": "And then we progressively lose our endogenous capacity of regenerating cardiomyocytes.",
                    "label": 0
                },
                {
                    "sent": "But this still means that there is an endogenous regenerative potential.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is why.",
                    "label": 0
                },
                {
                    "sent": "As Luca and Miguel mentioned a few years ago, we decided to run this screening, searching for micro RNA that can promote and enhance this endogenous.",
                    "label": 0
                },
                {
                    "sent": "Existing regenerative potential.",
                    "label": 0
                },
                {
                    "sent": "And so this is the way they were under screening.",
                    "label": 0
                },
                {
                    "sent": "This Luca showed you already plating.",
                    "label": 0
                },
                {
                    "sent": "Neonatal cardiomyocytes that still have some proliferative potential.",
                    "label": 0
                },
                {
                    "sent": "Adding it you to label cell proliferation and then assess whether any of the micrornas encoded by our genome.",
                    "label": 0
                },
                {
                    "sent": "So this, I'm not sure whether.",
                    "label": 0
                },
                {
                    "sent": "We have already mentioned that we have about 2000 genes in our genome that unquote not for protein, but for micronase at the time we run this screening, we had a library that contain only half of them because they were not annotated yet.",
                    "label": 0
                },
                {
                    "sent": "Now we have libraries which are more updated and then we could in this way assess the effect of.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Each of these micro RNA in cardiomyocyte proliferation and again this is already something you are familiar with.",
                    "label": 0
                },
                {
                    "sent": "These are primary cardiomyocytes labeled in green, cause they are positive for Alpha actinin, which is a protein that is necessary for cardiac contraction.",
                    "label": 0
                },
                {
                    "sent": "An Edu positive nucleus, or nuclei that proliferate are red.",
                    "label": 0
                },
                {
                    "sent": "And all the other nuclei Zara, staining blue, and this is the same image elaborated by the high content microscope in which all the cells are segmented.",
                    "label": 0
                },
                {
                    "sent": "An nuclei that are red so they proliferate and belong to a cardiomyocyte are labeling yellow.",
                    "label": 0
                },
                {
                    "sent": "So normally what they I high content microscope does is beside giving these images is also to quantify the percentage of cardiomyocyte nuclei that proliferate and normally known it'll cardiomyocyte proliferate a bit.",
                    "label": 0
                },
                {
                    "sent": "12% of the cells normally proliferate.",
                    "label": 0
                },
                {
                    "sent": "And then you can see here this is one of the most potent Mike Renee Shamel.",
                    "label": 0
                },
                {
                    "sent": "These micro Denise can increase this proliferation rate up to almost 50%.",
                    "label": 0
                },
                {
                    "sent": "You see here full of yellow nuclei.",
                    "label": 0
                },
                {
                    "sent": "So again, to make a Long story short, we could identify about 40 micro RNA.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That important increase the proliferation of cardiomyocytes.",
                    "label": 0
                },
                {
                    "sent": "And as I showed you before, this is not just nuclear division, but it's also division of the cytoplasm.",
                    "label": 0
                },
                {
                    "sent": "They increase the number of cells that are that have Arora be localized at the mid body.",
                    "label": 0
                },
                {
                    "sent": "So they really divide.",
                    "label": 0
                },
                {
                    "sent": "And it is perhaps the best evidence that they really proliferate if you leave them there, they feel that they they.",
                    "label": 0
                },
                {
                    "sent": "They make the plate full of cells, whereas after awhile normal cardiomyocyte.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Stop proliferating so we also deliver them.",
                    "label": 0
                },
                {
                    "sent": "In the in vivo desire.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hearts of neonatal rats in which we injected the two more potent micro RNA which are 990 and 199.",
                    "label": 0
                },
                {
                    "sent": "A an.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure whether you can see here, but there are a lot of proliferative.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And these are confocal microscope images showing that these Edu positive, proliferating red nuclei actually belong to cardiomyocyte, so they stimulate the proliferation of cardiomyocytes even in vivo.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then of course the following step was to.",
                    "label": 0
                },
                {
                    "sent": "Proof that they can improve her function, so that is proliferation of cardiomyocytes can induce heart regeneration in vivo.",
                    "label": 0
                },
                {
                    "sent": "So what we did was to induce myocardial infarction by ligating.",
                    "label": 0
                },
                {
                    "sent": "So closing one of the coronary arteries to mimic what happens in humans and then delivering the micro Renee again exploiting these viral vectors based on the add-in associated virus.",
                    "label": 0
                },
                {
                    "sent": "Because this virus work very well in in the heart.",
                    "label": 0
                },
                {
                    "sent": "And then we monitor cardiac function.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to tease you with these parameters, but just to mention the desired parameters of our function, this means less ventricular ejection fraction which measure the amount of the blood that is pumped out of the heart at every cardiac contraction.",
                    "label": 0
                },
                {
                    "sent": "An as you can see here respect to the control that tends to decrease these pumping capacity.",
                    "label": 0
                },
                {
                    "sent": "The micro Renee improve.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The contract tile activity of the heart.",
                    "label": 0
                },
                {
                    "sent": "They improve the.",
                    "label": 0
                },
                {
                    "sent": "Amount of contractile tissue that is present overtime.",
                    "label": 0
                },
                {
                    "sent": "Here again, this car in control hearts tend to be wider overtime, whereas with the micronase you have preserved contractile tissue.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ann howdy.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Work, so This is why I I made this question to look at we again try to understand the relevant target of the micro RNA by delivering these two micro RNA to cardiomyocytes.",
                    "label": 0
                },
                {
                    "sent": "And since my credit networks because.",
                    "label": 0
                },
                {
                    "sent": "They downregulates hundreds of genes.",
                    "label": 0
                },
                {
                    "sent": "We went for our and I seek an identify about 600 genes that.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Were downregulated in the cardiomyocytes and among these genes, as you can see here there are genes.",
                    "label": 0
                },
                {
                    "sent": "This is probably something that doesn't mean much to you but believe me the desired protein that mostly belong.",
                    "label": 0
                },
                {
                    "sent": "Two that architectural structure that we were referring to, so either cytoskeletal or sarcomere structure, so the contract tile apparatus that needs to be disassembled.",
                    "label": 0
                },
                {
                    "sent": "So you really have to stop the synthesis of this protein to allow the cell to divide.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then again we exploited the availability of the siren, a library to individually silence each of these gene and see whether any of them.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Lee was able to induce cardiomyocyte proliferation, and these are the results.",
                    "label": 0
                },
                {
                    "sent": "This is a control.",
                    "label": 0
                },
                {
                    "sent": "You see that several genes when silence are able to increase the proliferation, but none of them is as efficient as the Mike Renee.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because probably the mic Renee is able to simultaneously not down many relevant armor in a an silence throw things that somehow block product.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Eration in cardiomyocytes.",
                    "label": 0
                },
                {
                    "sent": "We also show recently that most of these micro Renee have a common mechanism by which they can trigger the proliferation of cardiomyocytes and this goes through the down regulation.",
                    "label": 0
                },
                {
                    "sent": "The block of the so-called Hippo pathway.",
                    "label": 0
                },
                {
                    "sent": "This is also in hot topic in science.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is very molecular.",
                    "label": 0
                },
                {
                    "sent": "I will skip it.",
                    "label": 0
                },
                {
                    "sent": "But this also tells you that probably what these micro RNA do.",
                    "label": 0
                },
                {
                    "sent": "Is to mimic what happens in the Deborah Fish Heart where I also told you that in order to proliferate and regenerate the heart, cardiomyocytes have to partially dead.",
                    "label": 0
                },
                {
                    "sent": "Differentiate, disassemble they structure, proliferate and then re differenti.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "8.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is probably the same mechanism that happens in.",
                    "label": 0
                },
                {
                    "sent": "That that that is triggered by this Mike Renee.",
                    "label": 0
                },
                {
                    "sent": "Another relevant question for translational purposes is whether these micronized also works in human cardiomyocytes.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there are various approaches that one can undertake to study human cardiomyocytes.",
                    "label": 0
                },
                {
                    "sent": "There are lines of.",
                    "label": 0
                },
                {
                    "sent": "Cardiomyocytes derived from embryonic stem cells, so now also from induced pluripotent stem cells.",
                    "label": 0
                },
                {
                    "sent": "And that are commercially available.",
                    "label": 0
                },
                {
                    "sent": "You can just buy them and see whether Micronair works.",
                    "label": 0
                },
                {
                    "sent": "But you see here that actually these cardiomyocytes don't look like.",
                    "label": 0
                },
                {
                    "sent": "At that point, you might assign some armor similar to neonatal cardiomyocytes.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And and so we.",
                    "label": 0
                },
                {
                    "sent": "We try to isolate primary cardiomyocytes from human heart, either starting from aborted fetuses at the 3rd trimester of pregnancy and out of the 7 micro RNA that we can identify in embryonic stem cell derived cardiomyocytes, which we saw that some of them also work in primary human cardiomyocytes.",
                    "label": 0
                },
                {
                    "sent": "Especially 30 three B302-D",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "199 and 1825.",
                    "label": 0
                },
                {
                    "sent": "OK, these are other.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sample and say we made an effort to have a cultures of human adult cardiomyocytes that you can have access to from the cardio surgery room.",
                    "label": 0
                },
                {
                    "sent": "So at the time of cardiac surgery that requires extra corporeal circulation.",
                    "label": 0
                },
                {
                    "sent": "So when a doctor has under to make an intervention into the heart.",
                    "label": 0
                },
                {
                    "sent": "Of course the blood cannot flow through it, so it is redirected through an extra corporeal line line for awhile, and this requires.",
                    "label": 0
                },
                {
                    "sent": "The insertion of the canola in The Art Room and when they removed the canola, there is a part of the heart of the actual heart that sticks to the canola and in this trash with the canola.",
                    "label": 0
                },
                {
                    "sent": "So we got the permission to use this small segments and fraction of heart issue that would have been other white rushed to harvest human cardiomyocytes, and the same can happen when they remove the human valve and they replaced with the mechanical artificial valve.",
                    "label": 0
                },
                {
                    "sent": "Also there you might have some myocardium around.",
                    "label": 0
                },
                {
                    "sent": "Around the world that can be used for experimental purposes and we could.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How to set up these cultures of human cardiomyocytes and again prove that at least a few of them were also working on adult?",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Two mile sites.",
                    "label": 0
                },
                {
                    "sent": "But if you want to translate into a human therapy, you also have to prove that they work in a large animal model.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And This is why we started collaborating with a group of with the group in Pisa and in Philadelphia Temple University.",
                    "label": 0
                },
                {
                    "sent": "Um, to strive the efficacy of our micro RNA's in a model of ischaemia reperfusion in pics.",
                    "label": 0
                },
                {
                    "sent": "Ice Creamery perfusion means that you inducing myocardial infarction in the pig and then you open the artery again and this better mimics what happens in humans because Luckily most of the persons now can reach the hospital in a reasonable amount of time and they get revascularized because.",
                    "label": 0
                },
                {
                    "sent": "The surgeon can reopen the coronary arteries.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we choose to to test this, Mike Renee 199.",
                    "label": 0
                },
                {
                    "sent": "Ay this was not the best micro Renee in any of the species that we tested, so we did the experiments in the initial screening in rats and mice.",
                    "label": 0
                },
                {
                    "sent": "Then I show you the data in humans.",
                    "label": 0
                },
                {
                    "sent": "We also tested peaks and dogs cardiomyocytes and this was not the best in any of the species, but it was the only one that works across the species.",
                    "label": 0
                },
                {
                    "sent": "For instance 590, which was the best in rodents, actually stop the proliferation in human cardiomyocytes.",
                    "label": 0
                },
                {
                    "sent": "This is something.",
                    "label": 0
                },
                {
                    "sent": "Also, we need to take in mind when to keep in mind when we think of translational studies and micro RNA can be conserved.",
                    "label": 0
                },
                {
                    "sent": "But the effect that they drive in different species can be very different.",
                    "label": 0
                },
                {
                    "sent": "And these are again para meters of cardiac function like the ejection fraction capacity of the pumping of the blood.",
                    "label": 0
                },
                {
                    "sent": "And you can see that overtime the pumping capacity is lost even in this model, whereas with micronair dizzy.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is very much preserved and this is much easy to understand compared to the Echo movies that I showed you before, so this I'm sure you will understand.",
                    "label": 0
                },
                {
                    "sent": "So here you have an MRI in which the white signal is the blood an in Gray.",
                    "label": 0
                },
                {
                    "sent": "Here around you can see the myocardial tissue.",
                    "label": 0
                },
                {
                    "sent": "This is the septum.",
                    "label": 0
                },
                {
                    "sent": "This is the left ventricle, the one that pumps more and this is the right ventricle, the one that comes through the lung.",
                    "label": 0
                },
                {
                    "sent": "An you can see here in the posterior portion.",
                    "label": 0
                },
                {
                    "sent": "This is the afternoon deliver, so this is the lower part of the domain of the animals at the animal.",
                    "label": 0
                },
                {
                    "sent": "Is it like that?",
                    "label": 0
                },
                {
                    "sent": "And you can see here that in this posterior part you have this great issue that pumps, whereas he ran the subtone interior part is very thin and it it contracts very, very poorly and these are two images of the same animals, not not the same.",
                    "label": 0
                },
                {
                    "sent": "Sorry another animal at additional 2 animals that after the scheming reperfusion, received any infusions of a Navy vectors expressing the micro Renee.",
                    "label": 0
                },
                {
                    "sent": "Why 99?",
                    "label": 0
                },
                {
                    "sent": "You see here.",
                    "label": 0
                },
                {
                    "sent": "Here it is still some contract tile deficiency, but most of the heart and its all round shape can.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Recently contract an MRI gives you also the opportunity to follow the same animal overtime.",
                    "label": 0
                },
                {
                    "sent": "To understand whether there was an initial protection.",
                    "label": 0
                },
                {
                    "sent": "So the progression of the disease haven't occur, or there was a real regeneration, there was a damage, not contracted tissue that has been replaced by new contractile tissue.",
                    "label": 0
                },
                {
                    "sent": "And if you look at this.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The animal that has been treated with the micro Renee.",
                    "label": 0
                },
                {
                    "sent": "You clearly see here that the dysfunctional portion that is highlighting red by the software was quite extended at 2 weeks and it was progressively.",
                    "label": 0
                },
                {
                    "sent": "Replaced by normal black tissue.",
                    "label": 0
                },
                {
                    "sent": "This of course is not real proof, but it's a strong indication of a regenerative process rather than protective.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is ongoing and then when we look at Histology somewhere we look what happens to the heart?",
                    "label": 0
                },
                {
                    "sent": "You see that is full of green cardiomyocytes that have a red nucleus, so it means that they had.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Proliferated, so we were very happy because we thought that to having our hands something very potent driving regeneration of hearts in pics.",
                    "label": 0
                },
                {
                    "sent": "And this lasted for about two months.",
                    "label": 0
                },
                {
                    "sent": "So the movie that I showed you was at about two months and then in one week suddenly seven out of eight weeks treated died.",
                    "label": 0
                },
                {
                    "sent": "So initially we thought that some.",
                    "label": 0
                },
                {
                    "sent": "Infectious ongoing in India.",
                    "label": 0
                },
                {
                    "sent": "Animal House because they all died at the same day.",
                    "label": 0
                },
                {
                    "sent": "Exact Model S but the controls were there so they were less performing because they had a larger in fact.",
                    "label": 0
                },
                {
                    "sent": "But they were alive.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so when we we we we wanted to, we had to repeat the whole study, because we lost all the animals trying to understand what could be the cause of this of this sudden death.",
                    "label": 0
                },
                {
                    "sent": "And we implanted some reveals kind of pacemaker.",
                    "label": 0
                },
                {
                    "sent": "Nor the pacemaker implant into people.",
                    "label": 0
                },
                {
                    "sent": "They also record the written and they start working.",
                    "label": 0
                },
                {
                    "sent": "If there is an arhythmic event.",
                    "label": 0
                },
                {
                    "sent": "If you don't have a rythme, the pacemaker doesn't work.",
                    "label": 0
                },
                {
                    "sent": "So we implanted this pacemaker in revealing conditions.",
                    "label": 0
                },
                {
                    "sent": "And we could identify a few fatal arrhythmias in a few of the treated animals, and none of them in untreated animals.",
                    "label": 0
                },
                {
                    "sent": "So probably these micro RNA is somehow, when overexpressed for a long period of time, as can be possible using viral vectors that continue driving the expression overtime.",
                    "label": 0
                },
                {
                    "sent": "Allow an induced degeneration.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And offer important aritmija and when we look at the Histology of these long-term animals, we could appreciate the formation of these cell clusters.",
                    "label": 0
                },
                {
                    "sent": "This is something that is very similar, reminiscent of a tumor where will start to proliferate.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These cells are very proliferating, so if you stain for proliferative markers like high 67, they are very very positive, highly positive so these are.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Highly proliferating cells as cancer cells are.",
                    "label": 0
                },
                {
                    "sent": "They're not inflammatory cells.",
                    "label": 0
                },
                {
                    "sent": "These are staining for immune markers.",
                    "label": 0
                },
                {
                    "sent": "They are not immune cells, so we could rule out myocarditis infections event.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So going on.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And they are positive for markers of early cardiomyocyte differentiation.",
                    "label": 0
                },
                {
                    "sent": "So what we think happened is that this micronase were so important in the differentiating these cardiomyocytes that these cells started to proliferate in an uncontrolled way, giving rise to this mass is in the heart.",
                    "label": 0
                },
                {
                    "sent": "That could be the anatomical substrate for the.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Arhythmic events that we could.",
                    "label": 0
                },
                {
                    "sent": "We could.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Record an So what what can be?",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Down to avoid this problem that actually arose at a very long term.",
                    "label": 0
                },
                {
                    "sent": "So after only after two months of overexpression of the Micro Renee, we could see this phenomenon, we can reconsider the way we're delivering micronair.",
                    "label": 0
                },
                {
                    "sent": "This brings me back to the first initial concept to deliver the biotherapeutics as synthetic molecules, avoiding the use of.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Therapy.",
                    "label": 0
                },
                {
                    "sent": "Because if you deliver this micrornas as a synthetic micro Renee instead of using viral vectors so you can produce a short RNA stretch as in the screening, for instance the same, and you can deliver these micro RNAs directly to the cardiac muscle.",
                    "label": 0
                },
                {
                    "sent": "And we thought that they would have been degraded immediately, whereas this was not the case, so they can persist there up to 12 days and 12 days could be a reasonable time to ellicit a regenerative response, avoiding the long term effect of uncontrolled and prolong.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Expression of the Micronase an if a present for 12 days, they can recapitulate the therapeutic activities so they can protect the heart from the consequences of myocardial infarction.",
                    "label": 0
                },
                {
                    "sent": "This is again rodents.",
                    "label": 0
                },
                {
                    "sent": "We had to step back to prove that they work.",
                    "label": 0
                },
                {
                    "sent": "As Mike Renee in in in rodents, because of course this is a very expensive approach and a very.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pensive way to deliver it?",
                    "label": 0
                },
                {
                    "sent": "But still they work and they induce cardiomyocyte proliferation in in vivo in the heart.",
                    "label": 0
                },
                {
                    "sent": "So next step will be to find the money and find a way to deliver this synthetic micronase 2 pics.",
                    "label": 0
                },
                {
                    "sent": "Hoping to reproduce the beneficial effect.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In terms of regeneration and avoided the long term consequences and then how how I am out with the time that I don't have my time here.",
                    "label": 0
                },
                {
                    "sent": "OK so I will quickly show you what we could do together with the with session.",
                    "label": 0
                },
                {
                    "sent": "For the development of new Therapeutics for fibrotic diseases, I won't spend an introduction on the on the relevance of eyebrows is because Miguel already mentioned you just to say that even in this case, fibrotic diseases are worldwide.",
                    "label": 0
                },
                {
                    "sent": "Any organs undergo fibrosis, particularly during aging, and only two drugs are approved.",
                    "label": 1
                },
                {
                    "sent": "For the trim, for the treatment of eyebrows is an even not very effective if I.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I say.",
                    "label": 0
                },
                {
                    "sent": "So in this case we decided to go for a drug repurposing approach which could short shoot could shorten the time needed to go to the clinic.",
                    "label": 0
                },
                {
                    "sent": "So if you start from scratch from finding new targets, new compounds, new chemicals.",
                    "label": 0
                },
                {
                    "sent": "Do the clinical application and the market can take up to 15 years at least.",
                    "label": 0
                },
                {
                    "sent": "If you start with something that has been already approved to be used in the clinic, you can significantly shorten the time because all the safety and kinetics have been already.",
                    "label": 0
                },
                {
                    "sent": "Characterized and approved and so we decided to go for a screening of FDA approved drugs that can modulate activation of fibroblasts.",
                    "label": 0
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But in Miguel showed you already the relevance of Myofibroblast activation of fibroblasts in inducing fibrosis.",
                    "label": 0
                },
                {
                    "sent": "But in this time we could exploit something.",
                    "label": 0
                },
                {
                    "sent": "Some products of the genetic engineering which is the use of genetically engineered animals.",
                    "label": 1
                },
                {
                    "sent": "I'm showing use various example of animals that have been genetically modified to express endogenously fluorescent proteins in the cells.",
                    "label": 0
                },
                {
                    "sent": "And these proteins can be of various color.",
                    "label": 0
                },
                {
                    "sent": "As you can see here, this is a brain of brainbow mice that have a stochastic representation of different fluorescent protein in every neuron.",
                    "label": 0
                },
                {
                    "sent": "So they can really trace the projection of every single cell through how the body?",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we use these mice in which all fibroblasts are green because they express GFP under the control of the same promoter.",
                    "label": 0
                },
                {
                    "sent": "The drive collagen expression.",
                    "label": 0
                },
                {
                    "sent": "So all cells expressing collagen, arguing, and then when they start expressing Alpha SMA, they become myofibroblasts activated fibroblasts.",
                    "label": 0
                },
                {
                    "sent": "They turn red and these are the cells, so we call them Christmas balls because they're very nice to see into image.",
                    "label": 0
                },
                {
                    "sent": "Normally fibroblasts are green, but when they get activated.",
                    "label": 0
                },
                {
                    "sent": "They become red, orange depending on the amount of Alpha SMA smooth muscle acting that they start expressing and this red cells are activated fibroblast, more prone to fibrosis so we could easily screen for drugs that can modulate number of green versus red orange cells and also have an idea of the effect efficacy of this drug.",
                    "label": 0
                },
                {
                    "sent": "Because we have the intensity of the fluorescence that represents the amount of smarter they produce and so the amount of activation.",
                    "label": 0
                }
            ]
        },
        "clip_85": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Undergo.",
                    "label": 0
                },
                {
                    "sent": "And again we ran the screening and.",
                    "label": 0
                }
            ]
        },
        "clip_86": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we could identify a few drugs that can.",
                    "label": 0
                },
                {
                    "sent": "Induce Alpha is my expression.",
                    "label": 0
                },
                {
                    "sent": "They activate fibroblasts, becoming more fibrotic and some drugs that reduce.",
                    "label": 0
                },
                {
                    "sent": "The activation of fibroblasts and then we decided to.",
                    "label": 0
                }
            ]
        },
        "clip_87": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Prove that their capacity to modulate alphas, my expression as you show here in vivo, and eventually we decided to proceed with alopecia.",
                    "label": 0
                }
            ]
        },
        "clip_88": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You might have heard about this molecule because it's a neuro psychiatric compound, very often used to treat delirium.",
                    "label": 0
                },
                {
                    "sent": "The commercial name is Haldol serenades, so it's very known drugs and again, it is known to.",
                    "label": 0
                }
            ]
        },
        "clip_89": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Doctor Ann exert its antipsychotic compound because it binds this receptor dopamine receptor two in the in the brain, and these receptors is expressed in neuronal cells but not in fibroblasts.",
                    "label": 0
                },
                {
                    "sent": "So we had to look for another receptor an.",
                    "label": 0
                },
                {
                    "sent": "Eventually we found that the receptor that mediates the activity of all apparel in fiberglass is this receptor.",
                    "label": 0
                }
            ]
        },
        "clip_90": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which is called Sigma one.",
                    "label": 0
                },
                {
                    "sent": "These are all molecular details.",
                    "label": 0
                }
            ]
        },
        "clip_91": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_92": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will skip to the end.",
                    "label": 0
                }
            ]
        },
        "clip_93": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you were just to show you the how it.",
                    "label": 0
                }
            ]
        },
        "clip_94": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Works, but.",
                    "label": 0
                },
                {
                    "sent": "We are late.",
                    "label": 0
                }
            ]
        },
        "clip_95": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is to show you that.",
                    "label": 0
                },
                {
                    "sent": "It works in vivo in model of cardiac fibrosis.",
                    "label": 0
                },
                {
                    "sent": "This is the amount of fibrous activation you have in the heart after myocardial infarction and it is in haloperidol, treated mice.",
                    "label": 1
                }
            ]
        },
        "clip_96": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It works in a mouse model of lung fibrosis.",
                    "label": 0
                },
                {
                    "sent": "This is a fibrotic lung.",
                    "label": 0
                },
                {
                    "sent": "Ideal pathic pulmonary fibrosis is another major health problem with no cures.",
                    "label": 0
                },
                {
                    "sent": "And if you treat with allopurinol fibrosis is is much less.",
                    "label": 0
                }
            ]
        },
        "clip_97": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then another.",
                    "label": 0
                }
            ]
        },
        "clip_98": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sorry, another disease in which fibrosis is very relevant is cancer.",
                    "label": 0
                },
                {
                    "sent": "There is a population of cells in every cancer which is called cancer.",
                    "label": 0
                },
                {
                    "sent": "Associated fibroblasts and the role of these cells in either inhibiting or enhancing tumor grow is very debated, but it's more likely that these cells are selected to favor tomorrow by the tumor itself.",
                    "label": 0
                },
                {
                    "sent": "If you block the activity of these cells in cancer, you see here these are lungs, and this small infiltrates are tumor cells.",
                    "label": 0
                },
                {
                    "sent": "If you treat them with a low parried all your.",
                    "label": 0
                }
            ]
        },
        "clip_99": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Use the burning of these accounts.",
                    "label": 0
                }
            ]
        },
        "clip_100": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So starting from this data together with a group of social zurowski jsi?",
                    "label": 0
                }
            ]
        },
        "clip_101": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We decided to start from the initial screening of compounds FDA approved compounds.",
                    "label": 0
                },
                {
                    "sent": "We only screen for 700 compounds and so were they.",
                    "label": 0
                }
            ]
        },
        "clip_102": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do was to go back to all compounds found in Pub camp an predict some new compounds that could exert similar or even better antifibrotic effect and starting from this list we can identify if you compound that were structurally similar to these new classes of drugs, dopamine topiramate and anomaly here and actually again we are now assessing the antifibrotic role of dopamine.",
                    "label": 0
                },
                {
                    "sent": "This is another drug.",
                    "label": 0
                },
                {
                    "sent": "Which is extremely used for various purposes, but never being characterized for this effect.",
                    "label": 0
                }
            ]
        },
        "clip_103": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On fibrosis and so we are demonstrated in this drug is efficacy in blocking fibroblast activation in vitro in both animal.",
                    "label": 0
                }
            ]
        },
        "clip_104": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And human fibroblast.",
                    "label": 0
                },
                {
                    "sent": "And also we have some data off its efficiency in.",
                    "label": 0
                }
            ]
        },
        "clip_105": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In vivo, so with that I will stop.",
                    "label": 0
                },
                {
                    "sent": "I will show I will thank the people that have contributed to this work, collaborators.",
                    "label": 0
                }
            ]
        },
        "clip_106": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Funding Agency, and particularly the people that daily work together with me interesting.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}