{
    "id": "enznti3zpxjxz56aoxdcdryxkhb3gwb7",
    "title": "Classification on Riemannian Manifolds",
    "info": {
        "author": [
            "Fatih M. Porikli, MERL - Mitsubishi Electric Research Laboratories"
        ],
        "published": "Sept. 13, 2010",
        "recorded": "August 2010",
        "category": [
            "Top->Computer Science->Pattern Recognition"
        ]
    },
    "url": "http://videolectures.net/ssspr2010_porikli_crm/",
    "segmentation": [
        [
            "Alright, let's start to talk.",
            "I should confess that I'm extremely sleepy now, so please bear with me.",
            "The title of the Talk is Learning on Manifolds My by many force because many false are."
        ],
        [
            "Delicious here is that many folk you can eat actually.",
            "Where is.",
            "The first half of the talk actually is gonna be gonna go.",
            "I will walk through until this green star, which might be boring and you may sleep.",
            "Please go ahead if you already know the Council thinks that I'm talking about, I'm going to discuss about the introduce you, the remaining manifold, and the second part of the talk is more kind of like entertainment purposes.",
            "Hopefully you will wake up at that time and then.",
            "I'm not, I didn't break it.",
            "Then you will see."
        ],
        [
            "Some interesting applications of the main force, alright?",
            "Immediate fault is that apology."
        ],
        [
            "The space in every point is a neighborhoods which resembles opinion space.",
            "For instance, fear is their manifold.",
            "If you kind of look at the angles on this, fear is not.",
            "It doesn't satisfy both within norms and but in the local scale.",
            "If you been rooming apart of the earth you will see it applies.",
            "So global structure may be complicated.",
            "In this case a 3D sphere, but local structure is OK. D and so this is what you need to remember actually.",
            "But it may be faulty by today for some of you who are expressing day in this area police kind of folded my long introduction of."
        ],
        [
            "The remaining manifold, these are some other examples of the manifolds.",
            "Here you see a donut and this is the same thing actually Carpenter net tours and this is a Mobius strip and client but but they are also same thing topologically speaking.",
            "Alright, the boy."
        ],
        [
            "In part started to group we will be talking about sets group.",
            "Is there said that and also with a binary operation and satisfy these four properties is close associated with it is an identity in the month and there are inverses of each number in the set.",
            "For instance set of integers under addition that identity is 0 is the close group.",
            "However, the set of integers under multiplication.",
            "Is not why?",
            "Because one over an integer is not an integer, so it's not a group.",
            "And two subsets are.",
            "Cold is subgroups.",
            "If they satisfy all the properties, for instance, set of positive rational numbers under multiplication is a subset is closest within itself.",
            "The identity is one in the set, however, set of negative rational numbers are not because I dent."
        ],
        [
            "It is not in the subset, so it's not a subgroup.",
            "We didn't tell him anything about commutativity.",
            "Noncommutative Group is the set of forces invertible, and Diane is quite matrices under matrix multiplication, and it's very famous is called this general linear group, GLN and subgroup of dating is Special Linear Group, which is the set of Ambien matrices.",
            "Unit determinant Coltrane so is this subgroup of that one.",
            "Political."
        ],
        [
            "Space is you may realize I'm moving concepts.",
            "Now let's go to topological spaces at topological spaces.",
            "This set, which is valid.",
            "Here, but inside this set itself, an empty set and you need an intersection of any family of sets in it.",
            "So if this how we define it, apology since in this T are called open sets of the topological space, any open set UNT which contents point X is called the neighborhood of the point X.",
            "So we can define a neighborhood around it.",
            "They are not disconnected.",
            "A hostile separated space is a topological space in which distinct points have disjoint neighborhoods.",
            "So if two points are separate their neighborhoods, we can define very small but still distinct neighborhoods.",
            "They sending part important property, which means that those two points on the manifold are not kind of coinciding on the same.",
            "Point it's kind of ambiguous today that I told it maybe I should be just reading this real numbers point.",
            "So is there a storage space?",
            "So now we know what the group is."
        ],
        [
            "So you may remember some other metric groups and able to topological spaces, and that's a host of spaces and.",
            "For the function defined on hostile species, we can introduce concept of continuity is going to be important for us.",
            "For instance, as we move towards a point in in that space, the value of the function gets closer to the value of the function at the point.",
            "So this kind of standard continuity definition here being close to particle report is determined to be determined by its neighborhood.",
            "Of course, this file in it is open spaces.",
            "And to continue to offer function that Maps open sets of the topology.",
            "So we know.",
            "This property you know.",
            "Now we can define continue to.",
            "So we have that intuition and mapping between two topological spaces is called continuous.",
            "How if the inverse image of an open set with respect to the mapping is again an open set?",
            "So I have an open set here, a neighborhood.",
            "I have another neighborhood, so I can define a mapping and then we say that is continuous."
        ],
        [
            "Bijective, which means one to one and onto nipping, continues in both direction.",
            "Is there Home Mail morphism?",
            "A lot of definitions to remember in this afternoon.",
            "Such mappings preserve the topological properties of a given space.",
            "Of course, true spaces with homeomorphism, which means I connect them onto each other.",
            "But feeling DeMarco called homeomorphic and from the top political point of view they are identical, identical, and there's a joke that mathematicians cannot differentiate an Apple form an orange, so I don't know how they eat."
        ],
        [
            "A meaningful now.",
            "Come to the mini force a meaningful and of dimension D is Hausdorff space.",
            "We know that a hostel spaces for which every point has a neighborhood that is homeomorphic to an open subset.",
            "In other words, and many fault correspond to the topological space which is locally similar, similar to an Acadian space, because these open spaces are continuous.",
            "So this how this sphere Earth.",
            "Then we go to kind of smaller scale is a manifold.",
            "For any point in our meaning fault, there exists an open neighborhood.",
            "And containing the point and a homeomorphism.",
            "Phi making the neighborhood to an open set such that.",
            "And this is the transition.",
            "The pair, this neighborhood and the mapping is called coordinate chart.",
            "For instance there is."
        ],
        [
            "Chart here there's another chart here, and they kind of map bought onto the manifold and actually by using old kind of union of those charts covering all the many faults, we can define an Atlas.",
            "So all these definitions were required required just to come to this point a differentiable manifold.",
            "CK is a topological manifold.",
            "Equipped with an equivalence class of Atlas so we know there are meetings exist.",
            "Whose transition Maps are key times continuously differentiable.",
            "If all partial derivatives exist than is actually a smooth manifold.",
            "And if we define some additional structure is going to become an analytical manifold, which means that I can write the Tyler service.",
            "So this how they are represented."
        ],
        [
            "Tin it's possible to define the derivatives of the curves on a differentiable manifold and attached to any point at this very important, a tangent space.",
            "Which innovative you vectors tangent space is a real vector space?",
            "You may not see it, but there is kind of like this planner illustration here.",
            "So it's a real vector space is an ugly in space because it's a vector space that intuitively contains the possible directions in which one can tangentially pass through the point on the manifold.",
            "So this capital X and capital YR two points on the manifold and this.",
            "Kind of simple, meaningful disfear and this is our tangent space and in tangent space we can define these directions."
        ],
        [
            "Biggest is actually the tangent space can be thought of as the set of Iraq velocities for a point constraint to move on the manifold.",
            "So not all.",
            "I mean for including spaces obviously can't move in any direction, but not all.",
            "Many force come with this structure points.",
            "If you have a boundary you cannot move behind the boundary, so.",
            "It's a generalization of the idea of a direction of derivative, including space, tangent space, the vector space.",
            "As I said, an is closed under addition and scalar multiplication is a nice."
        ],
        [
            "Spacing, so we have something to work on now, so this goes to the Romanian I this very impressed when I kind of realized it then art rimmon actually lift only 40 years and still people are trying to understand what he did, what he defined and remaining metaphors are just one of the things he investigated.",
            "He had a book and several papers.",
            "Of course no one size them anymore.",
            "But this is the guy.",
            "German guy.",
            "Canadian geometry so."
        ],
        [
            "Every every space where the manifold so we can talk about the German trees.",
            "It's further structure to an analytical manifold by defining and symmetric positive definite bilinear form.",
            "I'm going to talk about what it is.",
            "A bilinear form is not binding your interpolation by near form on a vector space is the mapping from kind of higher dimension to kind of real numbers, which is linear.",
            "Is positive definite if this.",
            "Meeting is always positive and the equality or currently fan only if the point is 0.",
            "So this what we mean by positive definite."
        ],
        [
            "And in it for that.",
            "For instance, the inner product on any liquid in space is an example of symmetric positive definite bilinear form symmetric, because if there's a competitiveness involved there.",
            "Alright, so you mean meaningful stated many manifold.",
            "Is it differentiable manifold in which each tangent space.",
            "Has an inner product, so this is important.",
            "We can define an inner product.",
            "G metric inducing a normal for the tangent vector.",
            "So now we know that which means that I can go compute distances in that space.",
            "It's possible to define different metrics, so we end up different with different remaining manifolds."
        ],
        [
            "Let's talk about the jail visit major diseases.",
            "It's moot.",
            "Curve that Locali joins their points along the shortest path on the manifold.",
            "The length of the geode esic is important because they will use it as the many in distance between two points on the manifold.",
            "So geodesic, for instance, the shortest flying pet from Boston to Istanbul is not kind of underneath the Direct Line, but it's kind of an open.",
            "It is curved esta jailed."
        ],
        [
            "Sick.",
            "The exponential map and this is not the exponential operator in the for the scalar numbers.",
            "This what we define now to the exponential map next to vector Y in the tangent space to the point on the manifold.",
            "So we have we are defining a mapping from tangent spaces to back onto the manifold and it is a property that geodesic.",
            "Rich is a after unit time, for instance.",
            "The value at that point point on vector on Y is equal to 1.",
            "Why do they vectors develops?",
            "These are constant for geodesics, but obviously I'm not going to dive into any more details.",
            "Under the exponential map, the image of the 00 tangent vector is the point itself.",
            "It means that we are defining these exponential map only for that specific point on the manifold, which means that if I move to another point or anything is going to change, the form may not change, but to kind of like the result is gonna change.",
            "So these operators are defined point specific since they both stay along to Gerald, is it is constant the length of the geodesic is given by the norm of the initial velocity and this is the norm as you see."
        ],
        [
            "All right, for each point on the manifold.",
            "Financial map is the film office system, which means one to one or ten differentiable mapping in both directions.",
            "However, indoors mapping log X is only defined around the neighborhood.",
            "For instance, think about negative.",
            "Only or complex numbers so.",
            "But it's kind of a mapping content.",
            "See the other one is only defined only around the neighborhood.",
            "This why only in small neighborhood our assumptions are going to be valid and this is kind of an illustration showing a geode esic between two points and a mapping from many fault too.",
            "Tangent space and just remember this thing after this talk if you want to talk about manifold learning, this is the way to go.",
            "From meaningful to tangent space, A complete complicated space trainer, greedy and space, which is just the logarithm operation and your applications.",
            "This what you need.",
            "Take the log.",
            "But this is special Logan.",
            "I'm going to kind of talk about dating and there is also a way of making to go back onto the manifold.",
            "Because you might be interested in the original descriptor, like let's say a structure of an object.",
            "So this these are the two things you may like to kind of keep in mind."
        ],
        [
            "At the couple of more slice before the green Stars, by the way, from the definition of Geode esic, enter exponential.",
            "Map the distance between two points on manifolds can be computed as the distance between the point on the manifold and kind of.",
            "Tangent space correspondence slept on the manifold, but as I mentioned they handle it.",
            "We can define a norm on the directly on the tangent space and this is make things from that point on the tangent space.",
            "And here is the same thing written because this is an inner product and that's the thing I showed you before.",
            "For many manifolds, and doing an inverse mapping we can directly right.",
            "This thing, which means that I'm going to multiply left multiply 1 of the points on the manifold inverse of the one of the point."
        ],
        [
            "It at that point this kind of how we define a distance.",
            "Alright, what about this log and exponential thing, right?",
            "Before explaining, they think we have to kind of now kind of talk about Lee groups.",
            "Me groups are very well known examples of remaining manifolds and they have structure of an analytical Manafort which means multiplication and inversion inversions are smooth Maps.",
            "Which means that I can approximate them with some Taylor series, most frequently including the groups are set of matrices for each element in the group is a metrics at the group operation is a matrix multiplication?",
            "Hey, then whatever you work is kind of done becomes silly group right?",
            "And you didn't know that's right.",
            "Special orthogonal group rotations in 3D is the main Romanian manifold which has a legal property.",
            "But to be in motion, if you are computing distance for a more motion of a moving object is also a regroup.",
            "Koreans itself is a legal why?",
            "Because convince metrics are positive.",
            "Usually semidefinite, but you can make them definite and they are symmetric Laplacian matrices and these are graph laplacians so this way for the ones who are interested in structural learning to kind of listing this talk very carefully and asking questions later."
        ],
        [
            "For symmetric matrices, the ordinary matrix exponential algorithm operators can be computed easily, and this is how we're going to define it.",
            "So here we are talking about an exponential of a matrix.",
            "If this is the eigenvalue decomposition of his semantic metrics, then exponential can be represented by this diagonal matrix of eigenvalues and same lines.",
            "The logarithm operation on the metrics and."
        ],
        [
            "So these are the things that we wanted to talk about, right?",
            "The meaningful to operations.",
            "And actually we can.",
            "I'm not showing the details, but it's possible to write them in this way.",
            "Inverse mapping of a point and the tangent space correspondence of the kind of whatever the distance that we are trying to map on the manifold.",
            "This is mapping on the manifold.",
            "This is kind of meaningful to tangent space if you remember, and the same expression can be represented.",
            "By the squares of these terms, and.",
            "Actually, if you work with the mathematics that what you end up is for symmetric positive definite matrices who has Lee Group structure?",
            "He this is matrix operations, which means that I induce a norm within two points, like to Laplacian matrices by just taking the inverse of one and multiplying with the other one taking to logarithm.",
            "So you can compute these sources between Koreans.",
            "Matrices are pushing matrices without kind of like vectorizing them.",
            "All right, so we came up to this point and we are."
        ],
        [
            "Making good use of time.",
            "Distance between two points is measured by the inner product and then from the previous definition is the trace of this application of the logarithm square.",
            "And if you weren't form in terms of joint eigenvalues can be also written, and these are two different definition, two different metrics and one of them actually kind of cited.",
            "In this I just see the publication.",
            "It's possible to define different metrics.",
            "Different distance norms, as long as they satisfy the properties that I showed you before.",
            "So these two green stars are important because this what we gonna use afterwards.",
            "So if we have a manifold which has a structure for matrices or conflict, anything like motion metrics is LA Place in Mexico.",
            "In sentences we can easily either apply this distance or the other one.",
            "In terms of eigenvalues, so just matrix multiplication inverse, so this is very straightforward."
        ],
        [
            "I hope and this part of the talk I'm going to introduce a region Descriptor V which has manifold structure automatically.",
            "It comes without any additional work and well, let's say this image or part of an image that we want to represent right the 1st order statistics.",
            "The most common one, and I'm not talking about Sift.",
            "It might be the histograms distribution function, however, his programs for instance think about this tree region images.",
            "They are blind to special arrangement of two intensities, right?",
            "If I take the histogram I will end up with the same histogram for all these three images.",
            "They require minimal samples to populate.",
            "I cannot have like 10 points and histogram populate the histogram of ecologist program of let's say 404 thousand.",
            "96 bins, they are sensitive to noise also because they are direct mappings.",
            "So these are histogram distribution function is first order statistics.",
            "This investigate what would happen if you have the 2nd order statistics and this has been published at ECC via couple of years ago.",
            "But we do.",
            "Let's say we have several features including coordinate itself XY.",
            "Here is the coordinates just the curve.",
            "Like the coordinates of the pixel, this simple thing.",
            "There's no computation right?",
            "And maybe intensity value or color values, and you can define gradients.",
            "You can define anything you can put histogram into this vector, So what you do then you take this vector and computed covariance matrix.",
            "Who is Susan?",
            "This illustration you see that I arrange these low level features.",
            "These are the coordinates.",
            "These are three color channels and the gradients.",
            "Then of course this is symmetric and the vertical axis is same.",
            "And each being each cell here represents, for instance, the covariance between X and blue channel or blue channel and X gradient.",
            "So this is different.",
            "They are."
        ],
        [
            "Symmetric positive semidefinite.",
            "So hey I have illegal so I can apply my all the stuff that I showed you before.",
            "They are all dimensional.",
            "They are symmetric Bell in the previous one I had on 7 features right?",
            "And I need only two and eight coefficients to represent a region like many many pixels to only 28 coefficients.",
            "If I use color histogram which is only 16, bin is a very rough histogram.",
            "By the way I will end up with much more coefficient, so this compact.",
            "Is the natural way off using different type of features?",
            "I don't care bonus coordinate.",
            "The other one is color or gradient.",
            "I can define anything I like and they are invariant to rotation and scale changes.",
            "And if I transformations and illumination variances.",
            "Anne."
        ],
        [
            "Again, like is an illustration, so these are my images and these are actually color coded covariance matrices corresponding to these images, cat pictures, pictures at you.",
            "See, they kind of look like this, so we are kind of representing these pictures with 28 coefficients in this example and."
        ],
        [
            "I know that we have at least structure Lee Group, so one example, first example, I want to show is the search on a manifold, which means that this is the points like the cat pictures or kind of like human pictures here and I compute covariance matrix, so that's why they're on the manifold and I want to kind of compute the distance between them and we know how to compute the distance those green star."
        ],
        [
            "And our application in this volatile picture find this bowl and I'm sure you already located.",
            "It is here.",
            "But to a computer to do this thing it has to window the whole thing and kind of compute everything and search it's time consuming and that's why you need a compact representations for distance is one thing."
        ],
        [
            "We did and I think it was also an easy publication.",
            "We constructed multiple occurrence matrices.",
            "We want to dating to be robust towards the conclusions.",
            "So we have the original thing and then like the current metrics for the whole thing and then portions of the image, for instance here we have for the left one right down the lower part.",
            "And this is how we defined our low level features.",
            "In this case we have nine.",
            "We search image for.",
            "A region having similar coins metrics, but we do we kind of window the image, compute colorings metrics and compute the distance between the thing that like these metrics that we had.",
            "Indifference case because we don't know the scale and I test this application.",
            "This just an application example.",
            "This is the kind of scaling factor based in those.",
            "We kept 2000 best match and in the second belt we do the first one just using the whole thing.",
            "The second one using all five of them to just kind of accomplish some speedup and robustness."
        ],
        [
            "These are the results, so here what you see manually in the given image.",
            "Someone mark these regions.",
            "There's a bottle here, a vase and a flower pot, and this is what you end up.",
            "And these are the best matches.",
            "I mean, I assume that the object is always going to be in the picture, but this is my example right?",
            "I can do anything and if we use kind of opinion directly, hidden space distribution distance, best result you get now two were detected.",
            "But kind of like this thing is missing.",
            "You see this intensity difference actually enter poses different.",
            "Here is another exam."
        ],
        [
            "This is not a face recognition algorithm, of course, but if you give faces, it's not the structure it remembers the structure at this kind of window level representation again.",
            "These are the results you get for history."
        ],
        [
            "Features here is another example.",
            "There is the valve here and in this picture this the region it found and if you use histogram this what you would get so.",
            "It is performing very well.",
            "It's a simple descriptor, but we are computing distances or main fault.",
            "That's why it works well.",
            "This kind of go to another search application is."
        ],
        [
            "K nearest neighbor classifier.",
            "Let's say on many faults.",
            "In this example, we use products data set of 112 classes and these are some sample images from that data set.",
            "What we did for each image we divided the image into four region and then we took two of them in training set and two in the testing.",
            "So there is no overlap for each of these.",
            "Classes then we did some digging so we randomly randomly actually did not know the locations or size of the regions we sampled some regions and then computed dear Koreans matrices and use the previous Descriptor 9 feature low level descriptive data showed and to kind of tender recognition algorithm just computed distance between the sample and those classes and assign the kind of minimal.",
            "Minimum distance well, these are some published results.",
            "This is our method, random covariance.",
            "This is the performance of the random covariance and hear what you see.",
            "A combination of 48 a nootropic and is nootropic filters, binding and magic.",
            "Is very heavy in computation.",
            "It takes hours that our method kind of is seconds.",
            "Or maybe faster landed and this is the best.",
            "Performing algorithm other than ours and we do maybe less than 1% of the computation."
        ],
        [
            "We show you very failed.",
            "We have only three theaters in this data set.",
            "This is the test sample that we wanted to kind of find the correct class and this is the supposed training sample.",
            "So algorithm thinks that all it should be similar to this, but it go find this other thing so this how broad that data is, how difficult that data set is, but this is in a different class.",
            "Actually these are completely different images, so is this perception we actually?",
            "This looks more similar than these two.",
            "What I mean by that?",
            "Even the errors are not that significant errors.",
            "Alright, so you know kind."
        ],
        [
            "Kind of understood that we can compute distances on the manifold, and it helps us for this kind of search operations.",
            "They are better than his programs because you can now impose some structure on the representation itself is available dimensional representation.",
            "Here I'm going to discuss about some clustering application, so clustering is just fine to balls in this in a given distribution manifold kind of find these.",
            "Kind of different types of images."
        ],
        [
            "First example is 3D motion estimation.",
            "In this example we only know feature points and then we have some correspondence is we don't know how many different motion exists here.",
            "There are three different motions.",
            "They move all differently, but we know they are rigid body, so it's 3D motion and because of that it has any group structure and the brick walls are the correct matches and.",
            "Red ones are outliers, so not all the correspondences are correct.",
            "There is significant amount of noise.",
            "In this example, our goal to estimate the number of different motions at the same time find the transformation itself.",
            "So it's double difficult problem.",
            "You don't know how many objects in the scene and you don't know the emotion you want to complete, both of them.",
            "And this NCC providing."
        ],
        [
            "And the standard approach is some form of robust ransack or something like that.",
            "So these notes seeking more seeking, but it does.",
            "Let's say this is our distribution in Acadian space.",
            "I'm going to start at this point.",
            "I'm going to compute a density.",
            "And then I will take the mean of the density and I will shift my kernel kernel means local neighborhood.",
            "Then I'm going to repeat myself until the kernel doesn't move anymore any longer.",
            "So for each point we do the same thing, then we end up with this different.",
            "Besen points at the combine those."
        ],
        [
            "And say those are the most and this is what we do for this application.",
            "The four since we want to compute homographies we take any 3 point correspondences and some of them are wrong by the way, because they are noisy, there is significant amount of outliers.",
            "We generate emotion hypothesis and Legion 8 M of those, and so they are either samples from multiple motion distribution or random noise.",
            "Because I mean we don't know those three points are on the same object even if they are correct, right?",
            "So number of Silicon malls are the number of motion groups, and the modes are the motion parameters and this is how it looks like.",
            "But we do OK.",
            "I'm on how I'm gonna do."
        ],
        [
            "It's on the manifold, so these are my points.",
            "The motion hypothesis.",
            "But we do believe multiply it a point.",
            "They say this point and that point.",
            "Trust forms transfers to identity and points on the manifold are mapped to the tangent space or all the other points.",
            "Identity Maps to zero and all the other points around the neighborhood of the identity, and X is mapped to zero since this how we obtained identity."
        ],
        [
            "1st place, so this is the first iteration I do.",
            "Now I'm in the Akkadian space in Athenian space I can go compute a mean.",
            "Then but it says that big project the mean on the manifold, and we know how to do it.",
            "Those green stars again and to kind of exponential logarithm operators that I mentioned a.",
            "So we will have some shift."
        ],
        [
            "This is the new motion and devil iterates ourselves until the ship doesn't become very small.",
            "Usually takes maybe 45 iterations in this example, and here are the results."
        ],
        [
            "So we have 83 points.",
            "Correspondence is an less than half of the half.",
            "There are more outliers than our objects this, but I'm trying to see an for each object.",
            "Maybe we have at most 20 correspondences, so these are two images, like this region moved like this and here it's rotated and distant can float it as well.",
            "So this is the original boundaries and I'm drawing by the way it's estimated three objects successfully and then then we draw the boundary as you see it very perfectly aligns with.",
            "Underlying object."
        ],
        [
            "Let's go to another application model update on manifold, but we mean by that like in the previous.",
            "Application we want to compute the mean of the points on the main fault.",
            "Why?",
            "Because?",
            "Let's say I have multiple observations of an object.",
            "I'm doing tracking object tracking and everything."
        ],
        [
            "I get kind of different results.",
            "Now I want to combine them, but the thing that they are in on manifold and I have to put them together I cannot just add matrices again.",
            "What we do we kind of compute mean as in the previous algorithm that I showed we go to.",
            "Tangent space and kind of go back to the manifold.",
            "Go back again and this how we do the thing that we can impose some weights here.",
            "Like kind of how far they are far away there from the."
        ],
        [
            "So there on the manifold.",
            "So this ovated mean computation and even we can impose this depending on the time.",
            "So OK, let's go to resource.",
            "Here are some sample frames.",
            "The initial frame manually kind of labels for the face and this would happen if you do exhaustive search using covariance again, but without computing the distance all the manifold.",
            "If you compute the distance all the main fault is this is this significant change and it kind of.",
            "Lower city and it learns it without any conflating of the manifold or charting or more dimensional representation.",
            "There is no PC here or any big classifiers.",
            "This simple algorithm here is the tracking video that you would.",
            "Find on the on on the Internet.",
            "This let him control here an."
        ],
        [
            "And this is real footage in from Los Angeles.",
            "I believe Los Angeles is in."
        ],
        [
            "Dangerous city.",
            "But we do the exhaustive research for all possible regions in an image, then assign the base image.",
            "So this is another example of tracking our object rotated and kind of size change.",
            "The mobile update keep track of that because it knows it remembers both structure and to kind of do."
        ],
        [
            "Solution at the same time.",
            "So here that I illustrate.",
            "Even if there is significant, I slow down the video.",
            "Significant lighting changes between the frames.",
            "I mean it can still find it by.",
            "Because it's in vain to DC changes its second order statistic histogram cannot do it anyway here."
        ],
        [
            "Some course comparison side by side and this is one of the best performing trackers which is based on mean shift again.",
            "And these are some performance numbers.",
            "Which means the whatever the color space that we are working.",
            "Hide the dimensions performs better by the way.",
            "So this is challenging because distribution is really kind of almost."
        ],
        [
            "Monochromatic.",
            "An Ant noise.",
            "95% of the pixels intensity values are distorted in this example.",
            "So was it, but we do it every frame.",
            "The optic model.",
            "If there is a drift is going to cause more drift?",
            "This could happen.",
            "What happens for the histogram representation?",
            "There is, and it cannot find it again here.",
            "Update on the manifolds is kind of robust to that."
        ],
        [
            "Alright, let's go to the classifiers on manifold.",
            "Our problem, binary classification you can extend it to multiclass classification as well."
        ],
        [
            "Our method of choice is the boosting algorithm.",
            "But first we have to be able to fit a classifier, a kind of decision stump to our data on many ports.",
            "This is a big class fire and we will learn it in the tangent space.",
            "This the more most intuitive thing to do right, but we do.",
            "We kind of complete the weights.",
            "As I mentioned this, bated mean computation enables us to impose waits while we are working in the tangent space in boosting.",
            "This is a boosted classifier based off the samples which are misclassified.",
            "Increases in the next iteration, so you concentrate more on the examples that your previous classifiers can make most likely make a mistake so difficult examples.",
            "Weighted mean most towards these points in producing more accurate classifier.",
            "This is again boosting.",
            "Well, I mean it's proven that it's."
        ],
        [
            "The minimizes the approximation error through averaging over several we classify.",
            "And two."
        ],
        [
            "In the right hand side, what you see we kind of trust map all the points on the tangent space and then the feature classifier and we do it for different regions and then we choose the best one and this.",
            "Well, in this situation it's moved right and and it's kind of stabilized.",
            "We do it for many different choice of selections and then we put them together.",
            "So we have these multiple classifiers in our booster tree.",
            "See like one of the figures are missing, so it may not be necessary."
        ],
        [
            "Clear what happens on the manifold.",
            "You will end up with many, many tangent spaces covering all most of the difficult parts of the meaningful.",
            "And you did this, you classify the combination of that thing and this is the boosting training algorithm.",
            "And, well, maybe you you may not like to read all the details and also let me kind of mention about to kiss keep it version.",
            "To make everything more.",
            "Much faster.",
            "It simply cascades the reject.",
            "Some of the negatives because mostly we have much more negatives than the positives.",
            "So for instance, in this example we reject.",
            "35% of the negatives, which means that 65 remains to the next cascate level, but we keep all my."
        ],
        [
            "All deposit this our target and this in this human detection applications we had 30 cascade players and it runs maybe 50 times faster than the original direct implementation and each of them are linear regression functions trained on the tangent space and this dimensionality of the vector space which is 9 features Third 6 and each soft window is actually a covariance matrix at the computer.",
            "Ryan Smith this is this five we had the lead group and two remaining manifold."
        ],
        [
            "Maybe somebody did, let's say these are my positive samples and negative samples.",
            "Then I I'm adding my vehicle as far into the strong classifier I have this margin, like I kind of rank all the positives and I want to keep all of this and I rank all the negatives.",
            "I want to kind of remove all of this attempt but we don't.",
            "Usually what happens.",
            "This level is very close to this one, which means that kind of is a very sensitive boundary.",
            "Introduce another margin is not kind of something that you may write a paper, but it makes everything more robust, OK?"
        ],
        [
            "This talk about this, did I skip any know these?",
            "Are the records here you see?",
            "First post this per window and this is 10 to minus five.",
            "This is Miss Reed and this is linear data set.",
            "At the time this these are permeant CPR papers.",
            "This resulted reported results was the land tricks and Zoo of Eden at all, and these are their performance curves is to see if you use manyfold covariance matrix.",
            "You almost end up an order of.",
            "Performance improvement, by the way, this blue one is.",
            "RBF kernel, which is computationally slow and speed updating our algorithm maybe 1000?"
        ],
        [
            "Time faster than that.",
            "He my manifold.",
            "I mean in this graph, but you should under see this.",
            "What happens if you directly use Hawk?",
            "Which door antique we're using?",
            "And if you compute the covariance but complete distances in vector space, I'm going to vectorize my metrics without any kind of distances that I was talking about and I will apply it well.",
            "There's some improvement, but this is not the right thing to do because there's not the right distance norm.",
            "And if you map everything onto identity without selecting the kind of pickle aspire mapping point, this further improvement and algorithm data short actually kind of this.",
            "The performance of.",
            "This algorithm.",
            "And these are the results.",
            "I mean, I think this is the fun part.",
            "Here is an image forming."
        ],
        [
            "Dataset there's the child here and there are you see occluded people, significant occlusions, and what you see.",
            "These are the detection regions, and blue dots are the centers, and algorithm finds the scale."
        ],
        [
            "At the same time, by searching in this scale and scale space.",
            "And here here is another result."
        ],
        [
            "Please quite.",
            "Accurate here is another one.",
            "While we didn't train with two kind of sitting people images, that's why they're not."
        ],
        [
            "Signis, obviously.",
            "And deviation as the last thing that I wanted to show.",
            "Revision means that I'm going to.",
            "I will try to fit a function on my data points.",
            "That's basically what regression is anyway.",
            "So here how I define my application.",
            "I have these image that points.",
            "I want to track.",
            "And it's an image coordinates.",
            "I make it to my object coordinates and this is kind of like the rigid transformation, rotation and translation.",
            "And this is a fine transformation.",
            "And armor level feature is just Hawke, but.",
            "Since because of this motion I end up working on a manifold again."
        ],
        [
            "So this is what I'm going to do.",
            "I will model the interframe motion incrementally from frame to frame and this how it's Delta.",
            "Mt is the incremental motion corresponding to motion of the target.",
            "And this offer is my feature hog descriptor and we we have.",
            "This appears in vector space corresponding to points on the manifold.",
            "So regression function is Max the vector space data on the manifold.",
            "So from the.",
            "This opinion space did mention to the manifold design, which is the motion vector matrices.",
            "We will define our objective function as the sum of the square geodesic distances between the estimations of our Phi Alpha RFID descriptor and the points on the manifold, and this how we define.",
            "And since there is the algebra as I mentioned, the objective function you can work on the mathematics to write it in this way up to the 1st order terms and regression function can be written in this way also.",
            "And this is what we are after the Omega."
        ],
        [
            "Um, in terms of Omega.",
            "Notation this are objective function and remember I can generate because.",
            "OK, I have the initial frame.",
            "I have the region that I want to trick, but I do.",
            "I apply several random transformations but I know those transformations because I generate them and every time around London proper transformations here maybe here.",
            "Here I met, pick them onto the.",
            "Kind of my object coordinates and I computed features so."
        ],
        [
            "But I haven't."
        ],
        [
            "Yeah."
        ],
        [
            "But I mean that I know all the descriptors and I know all the doors.",
            "Kind of like the motion vectors themselves and our goal to kind of, in this case a linear regression function.",
            "Find this thing at.",
            "The solution is very straightforward and the trace of this quadratic and."
        ],
        [
            "To make it more kind of robust, but we did, we introduce some additional coefficients to kind of balance the weight contribution of each descriptor coefficient, and that's the result.",
            "See the kind of actually taking examples."
        ],
        [
            "And here but you see, we are tracking the region, not just the center.",
            "We are a fine tracking and we're only and this is maybe the face tracker you may have.",
            "Why at the beginning you just compute these Omega relation function and in the following frames you compute the only for one region compute the descriptor at multiplied with a metrics so nothing can be faster than this.",
            "I think there's no search.",
            "And this is another."
        ],
        [
            "Example.",
            "By the way, we were working on the particle filter extensions of this idea, so that's how it works.",
            "But if it's too much motion, if it doesn't can fit into might wander training samples, it loses the trick, and then the kind of combined everything using a particle filter implementation or many fault again, but I'm not showing that, so this is how it works.",
            "Significant amount of motion.",
            "And.",
            "But"
        ],
        [
            "Is defined motion and find motion is perfect for planar surface is right?",
            "Well, if it's small enough, even if for a sphere, it works well.",
            "So.",
            "Like on the boat here."
        ],
        [
            "Even kind of there are two.",
            "If you anymore.",
            "But it's a kind of more complicated shape and human nose, and I in 3D you see it's kind of.",
            "There's nothing cultural tier, just initialize it and it's going to trick, and it's going to take very fast.",
            "And these are results are actually published at CPR."
        ],
        [
            "Now I'm going to do yet another thing I'm going to.",
            "What I'm going to do.",
            "I'm not going to do tracking, but I'm gonna do pose estimation using the same algorithm.",
            "How I'm going to do it now instead of training mind tracker for one image, I'm going to check with multiple images from the same object class.",
            "In this case faces so I don't initialize anything, but I do.",
            "I have this MIT face data set and I apply random transformations and then I obtain only one.",
            "Relation functional.",
            "And then what I do in the image?",
            "I have these blocks and I trick each block in the image.",
            "So I hope this is clear.",
            "This is not tracking between friends.",
            "I have this block by train.",
            "The black bit in the same frame.",
            "Again I if I initialize here and it moves here I initialize.",
            "Here it's more serious than I ask a kind of cheap face detector is interface or not because I didn't train a face detector right?",
            "When combined with this tracking algorithm."
        ],
        [
            "This is what you get.",
            "So initially they are started wrong and to face it's small, but the region automatically adapts itself towards the face.",
            "Even if it doesn't look like it face like in this example, very noisy.",
            "So these are image tracking examples.",
            "But it tries to do it, tries to make the region inside this border looks like a face."
        ],
        [
            "Amazing right?",
            "And we had only frontal faces, and now it's converted to example.",
            "And these small scale data is.",
            "You see there is no resolution.",
            "But this is not my end goal.",
            "Actually, the next slide I will show you why we want to do this type of tracking between the single image."
        ],
        [
            "Alright, so.",
            "Let's keep this thing.",
            "It basically says that this is better than a."
        ],
        [
            "Things, but here is the result.",
            "This is a kind of an advanced implementation of Viola Jones face vector with multiple rotations and kind of of so this is what you get.",
            "These are sample images and these are the detection results.",
            "With that combined with additional heuristics.",
            "And this is what you would end up if you apply divide the image into blocks and for each black apply this face tracking and tennis.",
            "Viola Jones, say actually, is it a face or not so?",
            "And you know that they find transformation into this, so you can actually kind of get an idea about the 3D rotation."
        ],
        [
            "Alright, it was my last night actually.",
            "So is the last word I want to just repeat myself.",
            "Several parameter spaces commonly occur in computer vision problems have remaining manifold structure and they provide major improvements.",
            "I think points of an application might be Glad, Flop lashing and you are the people to investigate it further.",
            "I believe so that concludes my talk."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, let's start to talk.",
                    "label": 0
                },
                {
                    "sent": "I should confess that I'm extremely sleepy now, so please bear with me.",
                    "label": 0
                },
                {
                    "sent": "The title of the Talk is Learning on Manifolds My by many force because many false are.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Delicious here is that many folk you can eat actually.",
                    "label": 0
                },
                {
                    "sent": "Where is.",
                    "label": 0
                },
                {
                    "sent": "The first half of the talk actually is gonna be gonna go.",
                    "label": 0
                },
                {
                    "sent": "I will walk through until this green star, which might be boring and you may sleep.",
                    "label": 0
                },
                {
                    "sent": "Please go ahead if you already know the Council thinks that I'm talking about, I'm going to discuss about the introduce you, the remaining manifold, and the second part of the talk is more kind of like entertainment purposes.",
                    "label": 0
                },
                {
                    "sent": "Hopefully you will wake up at that time and then.",
                    "label": 0
                },
                {
                    "sent": "I'm not, I didn't break it.",
                    "label": 0
                },
                {
                    "sent": "Then you will see.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some interesting applications of the main force, alright?",
                    "label": 0
                },
                {
                    "sent": "Immediate fault is that apology.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The space in every point is a neighborhoods which resembles opinion space.",
                    "label": 1
                },
                {
                    "sent": "For instance, fear is their manifold.",
                    "label": 0
                },
                {
                    "sent": "If you kind of look at the angles on this, fear is not.",
                    "label": 0
                },
                {
                    "sent": "It doesn't satisfy both within norms and but in the local scale.",
                    "label": 0
                },
                {
                    "sent": "If you been rooming apart of the earth you will see it applies.",
                    "label": 1
                },
                {
                    "sent": "So global structure may be complicated.",
                    "label": 0
                },
                {
                    "sent": "In this case a 3D sphere, but local structure is OK. D and so this is what you need to remember actually.",
                    "label": 0
                },
                {
                    "sent": "But it may be faulty by today for some of you who are expressing day in this area police kind of folded my long introduction of.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The remaining manifold, these are some other examples of the manifolds.",
                    "label": 0
                },
                {
                    "sent": "Here you see a donut and this is the same thing actually Carpenter net tours and this is a Mobius strip and client but but they are also same thing topologically speaking.",
                    "label": 0
                },
                {
                    "sent": "Alright, the boy.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In part started to group we will be talking about sets group.",
                    "label": 0
                },
                {
                    "sent": "Is there said that and also with a binary operation and satisfy these four properties is close associated with it is an identity in the month and there are inverses of each number in the set.",
                    "label": 0
                },
                {
                    "sent": "For instance set of integers under addition that identity is 0 is the close group.",
                    "label": 0
                },
                {
                    "sent": "However, the set of integers under multiplication.",
                    "label": 0
                },
                {
                    "sent": "Is not why?",
                    "label": 0
                },
                {
                    "sent": "Because one over an integer is not an integer, so it's not a group.",
                    "label": 0
                },
                {
                    "sent": "And two subsets are.",
                    "label": 0
                },
                {
                    "sent": "Cold is subgroups.",
                    "label": 0
                },
                {
                    "sent": "If they satisfy all the properties, for instance, set of positive rational numbers under multiplication is a subset is closest within itself.",
                    "label": 0
                },
                {
                    "sent": "The identity is one in the set, however, set of negative rational numbers are not because I dent.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is not in the subset, so it's not a subgroup.",
                    "label": 0
                },
                {
                    "sent": "We didn't tell him anything about commutativity.",
                    "label": 0
                },
                {
                    "sent": "Noncommutative Group is the set of forces invertible, and Diane is quite matrices under matrix multiplication, and it's very famous is called this general linear group, GLN and subgroup of dating is Special Linear Group, which is the set of Ambien matrices.",
                    "label": 0
                },
                {
                    "sent": "Unit determinant Coltrane so is this subgroup of that one.",
                    "label": 0
                },
                {
                    "sent": "Political.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Space is you may realize I'm moving concepts.",
                    "label": 0
                },
                {
                    "sent": "Now let's go to topological spaces at topological spaces.",
                    "label": 0
                },
                {
                    "sent": "This set, which is valid.",
                    "label": 0
                },
                {
                    "sent": "Here, but inside this set itself, an empty set and you need an intersection of any family of sets in it.",
                    "label": 0
                },
                {
                    "sent": "So if this how we define it, apology since in this T are called open sets of the topological space, any open set UNT which contents point X is called the neighborhood of the point X.",
                    "label": 0
                },
                {
                    "sent": "So we can define a neighborhood around it.",
                    "label": 0
                },
                {
                    "sent": "They are not disconnected.",
                    "label": 0
                },
                {
                    "sent": "A hostile separated space is a topological space in which distinct points have disjoint neighborhoods.",
                    "label": 0
                },
                {
                    "sent": "So if two points are separate their neighborhoods, we can define very small but still distinct neighborhoods.",
                    "label": 0
                },
                {
                    "sent": "They sending part important property, which means that those two points on the manifold are not kind of coinciding on the same.",
                    "label": 0
                },
                {
                    "sent": "Point it's kind of ambiguous today that I told it maybe I should be just reading this real numbers point.",
                    "label": 0
                },
                {
                    "sent": "So is there a storage space?",
                    "label": 0
                },
                {
                    "sent": "So now we know what the group is.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So you may remember some other metric groups and able to topological spaces, and that's a host of spaces and.",
                    "label": 0
                },
                {
                    "sent": "For the function defined on hostile species, we can introduce concept of continuity is going to be important for us.",
                    "label": 0
                },
                {
                    "sent": "For instance, as we move towards a point in in that space, the value of the function gets closer to the value of the function at the point.",
                    "label": 0
                },
                {
                    "sent": "So this kind of standard continuity definition here being close to particle report is determined to be determined by its neighborhood.",
                    "label": 0
                },
                {
                    "sent": "Of course, this file in it is open spaces.",
                    "label": 0
                },
                {
                    "sent": "And to continue to offer function that Maps open sets of the topology.",
                    "label": 0
                },
                {
                    "sent": "So we know.",
                    "label": 0
                },
                {
                    "sent": "This property you know.",
                    "label": 0
                },
                {
                    "sent": "Now we can define continue to.",
                    "label": 0
                },
                {
                    "sent": "So we have that intuition and mapping between two topological spaces is called continuous.",
                    "label": 0
                },
                {
                    "sent": "How if the inverse image of an open set with respect to the mapping is again an open set?",
                    "label": 0
                },
                {
                    "sent": "So I have an open set here, a neighborhood.",
                    "label": 0
                },
                {
                    "sent": "I have another neighborhood, so I can define a mapping and then we say that is continuous.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Bijective, which means one to one and onto nipping, continues in both direction.",
                    "label": 0
                },
                {
                    "sent": "Is there Home Mail morphism?",
                    "label": 0
                },
                {
                    "sent": "A lot of definitions to remember in this afternoon.",
                    "label": 0
                },
                {
                    "sent": "Such mappings preserve the topological properties of a given space.",
                    "label": 0
                },
                {
                    "sent": "Of course, true spaces with homeomorphism, which means I connect them onto each other.",
                    "label": 0
                },
                {
                    "sent": "But feeling DeMarco called homeomorphic and from the top political point of view they are identical, identical, and there's a joke that mathematicians cannot differentiate an Apple form an orange, so I don't know how they eat.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A meaningful now.",
                    "label": 0
                },
                {
                    "sent": "Come to the mini force a meaningful and of dimension D is Hausdorff space.",
                    "label": 0
                },
                {
                    "sent": "We know that a hostel spaces for which every point has a neighborhood that is homeomorphic to an open subset.",
                    "label": 0
                },
                {
                    "sent": "In other words, and many fault correspond to the topological space which is locally similar, similar to an Acadian space, because these open spaces are continuous.",
                    "label": 0
                },
                {
                    "sent": "So this how this sphere Earth.",
                    "label": 0
                },
                {
                    "sent": "Then we go to kind of smaller scale is a manifold.",
                    "label": 0
                },
                {
                    "sent": "For any point in our meaning fault, there exists an open neighborhood.",
                    "label": 0
                },
                {
                    "sent": "And containing the point and a homeomorphism.",
                    "label": 0
                },
                {
                    "sent": "Phi making the neighborhood to an open set such that.",
                    "label": 0
                },
                {
                    "sent": "And this is the transition.",
                    "label": 0
                },
                {
                    "sent": "The pair, this neighborhood and the mapping is called coordinate chart.",
                    "label": 0
                },
                {
                    "sent": "For instance there is.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Chart here there's another chart here, and they kind of map bought onto the manifold and actually by using old kind of union of those charts covering all the many faults, we can define an Atlas.",
                    "label": 0
                },
                {
                    "sent": "So all these definitions were required required just to come to this point a differentiable manifold.",
                    "label": 0
                },
                {
                    "sent": "CK is a topological manifold.",
                    "label": 0
                },
                {
                    "sent": "Equipped with an equivalence class of Atlas so we know there are meetings exist.",
                    "label": 0
                },
                {
                    "sent": "Whose transition Maps are key times continuously differentiable.",
                    "label": 0
                },
                {
                    "sent": "If all partial derivatives exist than is actually a smooth manifold.",
                    "label": 0
                },
                {
                    "sent": "And if we define some additional structure is going to become an analytical manifold, which means that I can write the Tyler service.",
                    "label": 0
                },
                {
                    "sent": "So this how they are represented.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tin it's possible to define the derivatives of the curves on a differentiable manifold and attached to any point at this very important, a tangent space.",
                    "label": 0
                },
                {
                    "sent": "Which innovative you vectors tangent space is a real vector space?",
                    "label": 0
                },
                {
                    "sent": "You may not see it, but there is kind of like this planner illustration here.",
                    "label": 0
                },
                {
                    "sent": "So it's a real vector space is an ugly in space because it's a vector space that intuitively contains the possible directions in which one can tangentially pass through the point on the manifold.",
                    "label": 0
                },
                {
                    "sent": "So this capital X and capital YR two points on the manifold and this.",
                    "label": 0
                },
                {
                    "sent": "Kind of simple, meaningful disfear and this is our tangent space and in tangent space we can define these directions.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Biggest is actually the tangent space can be thought of as the set of Iraq velocities for a point constraint to move on the manifold.",
                    "label": 0
                },
                {
                    "sent": "So not all.",
                    "label": 0
                },
                {
                    "sent": "I mean for including spaces obviously can't move in any direction, but not all.",
                    "label": 0
                },
                {
                    "sent": "Many force come with this structure points.",
                    "label": 0
                },
                {
                    "sent": "If you have a boundary you cannot move behind the boundary, so.",
                    "label": 0
                },
                {
                    "sent": "It's a generalization of the idea of a direction of derivative, including space, tangent space, the vector space.",
                    "label": 0
                },
                {
                    "sent": "As I said, an is closed under addition and scalar multiplication is a nice.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Spacing, so we have something to work on now, so this goes to the Romanian I this very impressed when I kind of realized it then art rimmon actually lift only 40 years and still people are trying to understand what he did, what he defined and remaining metaphors are just one of the things he investigated.",
                    "label": 0
                },
                {
                    "sent": "He had a book and several papers.",
                    "label": 0
                },
                {
                    "sent": "Of course no one size them anymore.",
                    "label": 0
                },
                {
                    "sent": "But this is the guy.",
                    "label": 0
                },
                {
                    "sent": "German guy.",
                    "label": 0
                },
                {
                    "sent": "Canadian geometry so.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Every every space where the manifold so we can talk about the German trees.",
                    "label": 0
                },
                {
                    "sent": "It's further structure to an analytical manifold by defining and symmetric positive definite bilinear form.",
                    "label": 0
                },
                {
                    "sent": "I'm going to talk about what it is.",
                    "label": 0
                },
                {
                    "sent": "A bilinear form is not binding your interpolation by near form on a vector space is the mapping from kind of higher dimension to kind of real numbers, which is linear.",
                    "label": 0
                },
                {
                    "sent": "Is positive definite if this.",
                    "label": 0
                },
                {
                    "sent": "Meeting is always positive and the equality or currently fan only if the point is 0.",
                    "label": 0
                },
                {
                    "sent": "So this what we mean by positive definite.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in it for that.",
                    "label": 0
                },
                {
                    "sent": "For instance, the inner product on any liquid in space is an example of symmetric positive definite bilinear form symmetric, because if there's a competitiveness involved there.",
                    "label": 0
                },
                {
                    "sent": "Alright, so you mean meaningful stated many manifold.",
                    "label": 0
                },
                {
                    "sent": "Is it differentiable manifold in which each tangent space.",
                    "label": 0
                },
                {
                    "sent": "Has an inner product, so this is important.",
                    "label": 0
                },
                {
                    "sent": "We can define an inner product.",
                    "label": 0
                },
                {
                    "sent": "G metric inducing a normal for the tangent vector.",
                    "label": 0
                },
                {
                    "sent": "So now we know that which means that I can go compute distances in that space.",
                    "label": 0
                },
                {
                    "sent": "It's possible to define different metrics, so we end up different with different remaining manifolds.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's talk about the jail visit major diseases.",
                    "label": 0
                },
                {
                    "sent": "It's moot.",
                    "label": 0
                },
                {
                    "sent": "Curve that Locali joins their points along the shortest path on the manifold.",
                    "label": 0
                },
                {
                    "sent": "The length of the geode esic is important because they will use it as the many in distance between two points on the manifold.",
                    "label": 0
                },
                {
                    "sent": "So geodesic, for instance, the shortest flying pet from Boston to Istanbul is not kind of underneath the Direct Line, but it's kind of an open.",
                    "label": 0
                },
                {
                    "sent": "It is curved esta jailed.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sick.",
                    "label": 0
                },
                {
                    "sent": "The exponential map and this is not the exponential operator in the for the scalar numbers.",
                    "label": 0
                },
                {
                    "sent": "This what we define now to the exponential map next to vector Y in the tangent space to the point on the manifold.",
                    "label": 0
                },
                {
                    "sent": "So we have we are defining a mapping from tangent spaces to back onto the manifold and it is a property that geodesic.",
                    "label": 0
                },
                {
                    "sent": "Rich is a after unit time, for instance.",
                    "label": 0
                },
                {
                    "sent": "The value at that point point on vector on Y is equal to 1.",
                    "label": 0
                },
                {
                    "sent": "Why do they vectors develops?",
                    "label": 0
                },
                {
                    "sent": "These are constant for geodesics, but obviously I'm not going to dive into any more details.",
                    "label": 0
                },
                {
                    "sent": "Under the exponential map, the image of the 00 tangent vector is the point itself.",
                    "label": 0
                },
                {
                    "sent": "It means that we are defining these exponential map only for that specific point on the manifold, which means that if I move to another point or anything is going to change, the form may not change, but to kind of like the result is gonna change.",
                    "label": 0
                },
                {
                    "sent": "So these operators are defined point specific since they both stay along to Gerald, is it is constant the length of the geodesic is given by the norm of the initial velocity and this is the norm as you see.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "All right, for each point on the manifold.",
                    "label": 0
                },
                {
                    "sent": "Financial map is the film office system, which means one to one or ten differentiable mapping in both directions.",
                    "label": 0
                },
                {
                    "sent": "However, indoors mapping log X is only defined around the neighborhood.",
                    "label": 0
                },
                {
                    "sent": "For instance, think about negative.",
                    "label": 0
                },
                {
                    "sent": "Only or complex numbers so.",
                    "label": 0
                },
                {
                    "sent": "But it's kind of a mapping content.",
                    "label": 0
                },
                {
                    "sent": "See the other one is only defined only around the neighborhood.",
                    "label": 0
                },
                {
                    "sent": "This why only in small neighborhood our assumptions are going to be valid and this is kind of an illustration showing a geode esic between two points and a mapping from many fault too.",
                    "label": 0
                },
                {
                    "sent": "Tangent space and just remember this thing after this talk if you want to talk about manifold learning, this is the way to go.",
                    "label": 0
                },
                {
                    "sent": "From meaningful to tangent space, A complete complicated space trainer, greedy and space, which is just the logarithm operation and your applications.",
                    "label": 1
                },
                {
                    "sent": "This what you need.",
                    "label": 0
                },
                {
                    "sent": "Take the log.",
                    "label": 0
                },
                {
                    "sent": "But this is special Logan.",
                    "label": 0
                },
                {
                    "sent": "I'm going to kind of talk about dating and there is also a way of making to go back onto the manifold.",
                    "label": 0
                },
                {
                    "sent": "Because you might be interested in the original descriptor, like let's say a structure of an object.",
                    "label": 0
                },
                {
                    "sent": "So this these are the two things you may like to kind of keep in mind.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At the couple of more slice before the green Stars, by the way, from the definition of Geode esic, enter exponential.",
                    "label": 0
                },
                {
                    "sent": "Map the distance between two points on manifolds can be computed as the distance between the point on the manifold and kind of.",
                    "label": 0
                },
                {
                    "sent": "Tangent space correspondence slept on the manifold, but as I mentioned they handle it.",
                    "label": 0
                },
                {
                    "sent": "We can define a norm on the directly on the tangent space and this is make things from that point on the tangent space.",
                    "label": 0
                },
                {
                    "sent": "And here is the same thing written because this is an inner product and that's the thing I showed you before.",
                    "label": 0
                },
                {
                    "sent": "For many manifolds, and doing an inverse mapping we can directly right.",
                    "label": 0
                },
                {
                    "sent": "This thing, which means that I'm going to multiply left multiply 1 of the points on the manifold inverse of the one of the point.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It at that point this kind of how we define a distance.",
                    "label": 0
                },
                {
                    "sent": "Alright, what about this log and exponential thing, right?",
                    "label": 0
                },
                {
                    "sent": "Before explaining, they think we have to kind of now kind of talk about Lee groups.",
                    "label": 0
                },
                {
                    "sent": "Me groups are very well known examples of remaining manifolds and they have structure of an analytical Manafort which means multiplication and inversion inversions are smooth Maps.",
                    "label": 0
                },
                {
                    "sent": "Which means that I can approximate them with some Taylor series, most frequently including the groups are set of matrices for each element in the group is a metrics at the group operation is a matrix multiplication?",
                    "label": 0
                },
                {
                    "sent": "Hey, then whatever you work is kind of done becomes silly group right?",
                    "label": 0
                },
                {
                    "sent": "And you didn't know that's right.",
                    "label": 0
                },
                {
                    "sent": "Special orthogonal group rotations in 3D is the main Romanian manifold which has a legal property.",
                    "label": 0
                },
                {
                    "sent": "But to be in motion, if you are computing distance for a more motion of a moving object is also a regroup.",
                    "label": 0
                },
                {
                    "sent": "Koreans itself is a legal why?",
                    "label": 0
                },
                {
                    "sent": "Because convince metrics are positive.",
                    "label": 0
                },
                {
                    "sent": "Usually semidefinite, but you can make them definite and they are symmetric Laplacian matrices and these are graph laplacians so this way for the ones who are interested in structural learning to kind of listing this talk very carefully and asking questions later.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For symmetric matrices, the ordinary matrix exponential algorithm operators can be computed easily, and this is how we're going to define it.",
                    "label": 0
                },
                {
                    "sent": "So here we are talking about an exponential of a matrix.",
                    "label": 0
                },
                {
                    "sent": "If this is the eigenvalue decomposition of his semantic metrics, then exponential can be represented by this diagonal matrix of eigenvalues and same lines.",
                    "label": 0
                },
                {
                    "sent": "The logarithm operation on the metrics and.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So these are the things that we wanted to talk about, right?",
                    "label": 0
                },
                {
                    "sent": "The meaningful to operations.",
                    "label": 0
                },
                {
                    "sent": "And actually we can.",
                    "label": 0
                },
                {
                    "sent": "I'm not showing the details, but it's possible to write them in this way.",
                    "label": 0
                },
                {
                    "sent": "Inverse mapping of a point and the tangent space correspondence of the kind of whatever the distance that we are trying to map on the manifold.",
                    "label": 0
                },
                {
                    "sent": "This is mapping on the manifold.",
                    "label": 0
                },
                {
                    "sent": "This is kind of meaningful to tangent space if you remember, and the same expression can be represented.",
                    "label": 0
                },
                {
                    "sent": "By the squares of these terms, and.",
                    "label": 0
                },
                {
                    "sent": "Actually, if you work with the mathematics that what you end up is for symmetric positive definite matrices who has Lee Group structure?",
                    "label": 0
                },
                {
                    "sent": "He this is matrix operations, which means that I induce a norm within two points, like to Laplacian matrices by just taking the inverse of one and multiplying with the other one taking to logarithm.",
                    "label": 0
                },
                {
                    "sent": "So you can compute these sources between Koreans.",
                    "label": 0
                },
                {
                    "sent": "Matrices are pushing matrices without kind of like vectorizing them.",
                    "label": 0
                },
                {
                    "sent": "All right, so we came up to this point and we are.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Making good use of time.",
                    "label": 0
                },
                {
                    "sent": "Distance between two points is measured by the inner product and then from the previous definition is the trace of this application of the logarithm square.",
                    "label": 0
                },
                {
                    "sent": "And if you weren't form in terms of joint eigenvalues can be also written, and these are two different definition, two different metrics and one of them actually kind of cited.",
                    "label": 0
                },
                {
                    "sent": "In this I just see the publication.",
                    "label": 0
                },
                {
                    "sent": "It's possible to define different metrics.",
                    "label": 0
                },
                {
                    "sent": "Different distance norms, as long as they satisfy the properties that I showed you before.",
                    "label": 0
                },
                {
                    "sent": "So these two green stars are important because this what we gonna use afterwards.",
                    "label": 0
                },
                {
                    "sent": "So if we have a manifold which has a structure for matrices or conflict, anything like motion metrics is LA Place in Mexico.",
                    "label": 0
                },
                {
                    "sent": "In sentences we can easily either apply this distance or the other one.",
                    "label": 0
                },
                {
                    "sent": "In terms of eigenvalues, so just matrix multiplication inverse, so this is very straightforward.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I hope and this part of the talk I'm going to introduce a region Descriptor V which has manifold structure automatically.",
                    "label": 0
                },
                {
                    "sent": "It comes without any additional work and well, let's say this image or part of an image that we want to represent right the 1st order statistics.",
                    "label": 0
                },
                {
                    "sent": "The most common one, and I'm not talking about Sift.",
                    "label": 0
                },
                {
                    "sent": "It might be the histograms distribution function, however, his programs for instance think about this tree region images.",
                    "label": 0
                },
                {
                    "sent": "They are blind to special arrangement of two intensities, right?",
                    "label": 1
                },
                {
                    "sent": "If I take the histogram I will end up with the same histogram for all these three images.",
                    "label": 0
                },
                {
                    "sent": "They require minimal samples to populate.",
                    "label": 1
                },
                {
                    "sent": "I cannot have like 10 points and histogram populate the histogram of ecologist program of let's say 404 thousand.",
                    "label": 0
                },
                {
                    "sent": "96 bins, they are sensitive to noise also because they are direct mappings.",
                    "label": 1
                },
                {
                    "sent": "So these are histogram distribution function is first order statistics.",
                    "label": 0
                },
                {
                    "sent": "This investigate what would happen if you have the 2nd order statistics and this has been published at ECC via couple of years ago.",
                    "label": 0
                },
                {
                    "sent": "But we do.",
                    "label": 0
                },
                {
                    "sent": "Let's say we have several features including coordinate itself XY.",
                    "label": 0
                },
                {
                    "sent": "Here is the coordinates just the curve.",
                    "label": 0
                },
                {
                    "sent": "Like the coordinates of the pixel, this simple thing.",
                    "label": 0
                },
                {
                    "sent": "There's no computation right?",
                    "label": 0
                },
                {
                    "sent": "And maybe intensity value or color values, and you can define gradients.",
                    "label": 0
                },
                {
                    "sent": "You can define anything you can put histogram into this vector, So what you do then you take this vector and computed covariance matrix.",
                    "label": 0
                },
                {
                    "sent": "Who is Susan?",
                    "label": 0
                },
                {
                    "sent": "This illustration you see that I arrange these low level features.",
                    "label": 0
                },
                {
                    "sent": "These are the coordinates.",
                    "label": 0
                },
                {
                    "sent": "These are three color channels and the gradients.",
                    "label": 0
                },
                {
                    "sent": "Then of course this is symmetric and the vertical axis is same.",
                    "label": 0
                },
                {
                    "sent": "And each being each cell here represents, for instance, the covariance between X and blue channel or blue channel and X gradient.",
                    "label": 0
                },
                {
                    "sent": "So this is different.",
                    "label": 0
                },
                {
                    "sent": "They are.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Symmetric positive semidefinite.",
                    "label": 0
                },
                {
                    "sent": "So hey I have illegal so I can apply my all the stuff that I showed you before.",
                    "label": 0
                },
                {
                    "sent": "They are all dimensional.",
                    "label": 0
                },
                {
                    "sent": "They are symmetric Bell in the previous one I had on 7 features right?",
                    "label": 0
                },
                {
                    "sent": "And I need only two and eight coefficients to represent a region like many many pixels to only 28 coefficients.",
                    "label": 0
                },
                {
                    "sent": "If I use color histogram which is only 16, bin is a very rough histogram.",
                    "label": 0
                },
                {
                    "sent": "By the way I will end up with much more coefficient, so this compact.",
                    "label": 0
                },
                {
                    "sent": "Is the natural way off using different type of features?",
                    "label": 1
                },
                {
                    "sent": "I don't care bonus coordinate.",
                    "label": 0
                },
                {
                    "sent": "The other one is color or gradient.",
                    "label": 0
                },
                {
                    "sent": "I can define anything I like and they are invariant to rotation and scale changes.",
                    "label": 1
                },
                {
                    "sent": "And if I transformations and illumination variances.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Again, like is an illustration, so these are my images and these are actually color coded covariance matrices corresponding to these images, cat pictures, pictures at you.",
                    "label": 0
                },
                {
                    "sent": "See, they kind of look like this, so we are kind of representing these pictures with 28 coefficients in this example and.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I know that we have at least structure Lee Group, so one example, first example, I want to show is the search on a manifold, which means that this is the points like the cat pictures or kind of like human pictures here and I compute covariance matrix, so that's why they're on the manifold and I want to kind of compute the distance between them and we know how to compute the distance those green star.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And our application in this volatile picture find this bowl and I'm sure you already located.",
                    "label": 0
                },
                {
                    "sent": "It is here.",
                    "label": 0
                },
                {
                    "sent": "But to a computer to do this thing it has to window the whole thing and kind of compute everything and search it's time consuming and that's why you need a compact representations for distance is one thing.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We did and I think it was also an easy publication.",
                    "label": 0
                },
                {
                    "sent": "We constructed multiple occurrence matrices.",
                    "label": 0
                },
                {
                    "sent": "We want to dating to be robust towards the conclusions.",
                    "label": 0
                },
                {
                    "sent": "So we have the original thing and then like the current metrics for the whole thing and then portions of the image, for instance here we have for the left one right down the lower part.",
                    "label": 0
                },
                {
                    "sent": "And this is how we defined our low level features.",
                    "label": 0
                },
                {
                    "sent": "In this case we have nine.",
                    "label": 0
                },
                {
                    "sent": "We search image for.",
                    "label": 0
                },
                {
                    "sent": "A region having similar coins metrics, but we do we kind of window the image, compute colorings metrics and compute the distance between the thing that like these metrics that we had.",
                    "label": 1
                },
                {
                    "sent": "Indifference case because we don't know the scale and I test this application.",
                    "label": 0
                },
                {
                    "sent": "This just an application example.",
                    "label": 0
                },
                {
                    "sent": "This is the kind of scaling factor based in those.",
                    "label": 0
                },
                {
                    "sent": "We kept 2000 best match and in the second belt we do the first one just using the whole thing.",
                    "label": 0
                },
                {
                    "sent": "The second one using all five of them to just kind of accomplish some speedup and robustness.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These are the results, so here what you see manually in the given image.",
                    "label": 0
                },
                {
                    "sent": "Someone mark these regions.",
                    "label": 0
                },
                {
                    "sent": "There's a bottle here, a vase and a flower pot, and this is what you end up.",
                    "label": 0
                },
                {
                    "sent": "And these are the best matches.",
                    "label": 0
                },
                {
                    "sent": "I mean, I assume that the object is always going to be in the picture, but this is my example right?",
                    "label": 0
                },
                {
                    "sent": "I can do anything and if we use kind of opinion directly, hidden space distribution distance, best result you get now two were detected.",
                    "label": 0
                },
                {
                    "sent": "But kind of like this thing is missing.",
                    "label": 0
                },
                {
                    "sent": "You see this intensity difference actually enter poses different.",
                    "label": 0
                },
                {
                    "sent": "Here is another exam.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is not a face recognition algorithm, of course, but if you give faces, it's not the structure it remembers the structure at this kind of window level representation again.",
                    "label": 0
                },
                {
                    "sent": "These are the results you get for history.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Features here is another example.",
                    "label": 0
                },
                {
                    "sent": "There is the valve here and in this picture this the region it found and if you use histogram this what you would get so.",
                    "label": 0
                },
                {
                    "sent": "It is performing very well.",
                    "label": 0
                },
                {
                    "sent": "It's a simple descriptor, but we are computing distances or main fault.",
                    "label": 0
                },
                {
                    "sent": "That's why it works well.",
                    "label": 0
                },
                {
                    "sent": "This kind of go to another search application is.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "K nearest neighbor classifier.",
                    "label": 0
                },
                {
                    "sent": "Let's say on many faults.",
                    "label": 0
                },
                {
                    "sent": "In this example, we use products data set of 112 classes and these are some sample images from that data set.",
                    "label": 1
                },
                {
                    "sent": "What we did for each image we divided the image into four region and then we took two of them in training set and two in the testing.",
                    "label": 0
                },
                {
                    "sent": "So there is no overlap for each of these.",
                    "label": 0
                },
                {
                    "sent": "Classes then we did some digging so we randomly randomly actually did not know the locations or size of the regions we sampled some regions and then computed dear Koreans matrices and use the previous Descriptor 9 feature low level descriptive data showed and to kind of tender recognition algorithm just computed distance between the sample and those classes and assign the kind of minimal.",
                    "label": 0
                },
                {
                    "sent": "Minimum distance well, these are some published results.",
                    "label": 0
                },
                {
                    "sent": "This is our method, random covariance.",
                    "label": 0
                },
                {
                    "sent": "This is the performance of the random covariance and hear what you see.",
                    "label": 1
                },
                {
                    "sent": "A combination of 48 a nootropic and is nootropic filters, binding and magic.",
                    "label": 1
                },
                {
                    "sent": "Is very heavy in computation.",
                    "label": 0
                },
                {
                    "sent": "It takes hours that our method kind of is seconds.",
                    "label": 0
                },
                {
                    "sent": "Or maybe faster landed and this is the best.",
                    "label": 1
                },
                {
                    "sent": "Performing algorithm other than ours and we do maybe less than 1% of the computation.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We show you very failed.",
                    "label": 0
                },
                {
                    "sent": "We have only three theaters in this data set.",
                    "label": 0
                },
                {
                    "sent": "This is the test sample that we wanted to kind of find the correct class and this is the supposed training sample.",
                    "label": 0
                },
                {
                    "sent": "So algorithm thinks that all it should be similar to this, but it go find this other thing so this how broad that data is, how difficult that data set is, but this is in a different class.",
                    "label": 0
                },
                {
                    "sent": "Actually these are completely different images, so is this perception we actually?",
                    "label": 0
                },
                {
                    "sent": "This looks more similar than these two.",
                    "label": 0
                },
                {
                    "sent": "What I mean by that?",
                    "label": 0
                },
                {
                    "sent": "Even the errors are not that significant errors.",
                    "label": 0
                },
                {
                    "sent": "Alright, so you know kind.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Kind of understood that we can compute distances on the manifold, and it helps us for this kind of search operations.",
                    "label": 0
                },
                {
                    "sent": "They are better than his programs because you can now impose some structure on the representation itself is available dimensional representation.",
                    "label": 0
                },
                {
                    "sent": "Here I'm going to discuss about some clustering application, so clustering is just fine to balls in this in a given distribution manifold kind of find these.",
                    "label": 0
                },
                {
                    "sent": "Kind of different types of images.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First example is 3D motion estimation.",
                    "label": 1
                },
                {
                    "sent": "In this example we only know feature points and then we have some correspondence is we don't know how many different motion exists here.",
                    "label": 0
                },
                {
                    "sent": "There are three different motions.",
                    "label": 0
                },
                {
                    "sent": "They move all differently, but we know they are rigid body, so it's 3D motion and because of that it has any group structure and the brick walls are the correct matches and.",
                    "label": 0
                },
                {
                    "sent": "Red ones are outliers, so not all the correspondences are correct.",
                    "label": 0
                },
                {
                    "sent": "There is significant amount of noise.",
                    "label": 0
                },
                {
                    "sent": "In this example, our goal to estimate the number of different motions at the same time find the transformation itself.",
                    "label": 1
                },
                {
                    "sent": "So it's double difficult problem.",
                    "label": 0
                },
                {
                    "sent": "You don't know how many objects in the scene and you don't know the emotion you want to complete, both of them.",
                    "label": 0
                },
                {
                    "sent": "And this NCC providing.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the standard approach is some form of robust ransack or something like that.",
                    "label": 0
                },
                {
                    "sent": "So these notes seeking more seeking, but it does.",
                    "label": 0
                },
                {
                    "sent": "Let's say this is our distribution in Acadian space.",
                    "label": 0
                },
                {
                    "sent": "I'm going to start at this point.",
                    "label": 1
                },
                {
                    "sent": "I'm going to compute a density.",
                    "label": 1
                },
                {
                    "sent": "And then I will take the mean of the density and I will shift my kernel kernel means local neighborhood.",
                    "label": 1
                },
                {
                    "sent": "Then I'm going to repeat myself until the kernel doesn't move anymore any longer.",
                    "label": 0
                },
                {
                    "sent": "So for each point we do the same thing, then we end up with this different.",
                    "label": 0
                },
                {
                    "sent": "Besen points at the combine those.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And say those are the most and this is what we do for this application.",
                    "label": 0
                },
                {
                    "sent": "The four since we want to compute homographies we take any 3 point correspondences and some of them are wrong by the way, because they are noisy, there is significant amount of outliers.",
                    "label": 0
                },
                {
                    "sent": "We generate emotion hypothesis and Legion 8 M of those, and so they are either samples from multiple motion distribution or random noise.",
                    "label": 1
                },
                {
                    "sent": "Because I mean we don't know those three points are on the same object even if they are correct, right?",
                    "label": 0
                },
                {
                    "sent": "So number of Silicon malls are the number of motion groups, and the modes are the motion parameters and this is how it looks like.",
                    "label": 1
                },
                {
                    "sent": "But we do OK.",
                    "label": 0
                },
                {
                    "sent": "I'm on how I'm gonna do.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's on the manifold, so these are my points.",
                    "label": 0
                },
                {
                    "sent": "The motion hypothesis.",
                    "label": 0
                },
                {
                    "sent": "But we do believe multiply it a point.",
                    "label": 0
                },
                {
                    "sent": "They say this point and that point.",
                    "label": 0
                },
                {
                    "sent": "Trust forms transfers to identity and points on the manifold are mapped to the tangent space or all the other points.",
                    "label": 1
                },
                {
                    "sent": "Identity Maps to zero and all the other points around the neighborhood of the identity, and X is mapped to zero since this how we obtained identity.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "1st place, so this is the first iteration I do.",
                    "label": 0
                },
                {
                    "sent": "Now I'm in the Akkadian space in Athenian space I can go compute a mean.",
                    "label": 0
                },
                {
                    "sent": "Then but it says that big project the mean on the manifold, and we know how to do it.",
                    "label": 0
                },
                {
                    "sent": "Those green stars again and to kind of exponential logarithm operators that I mentioned a.",
                    "label": 0
                },
                {
                    "sent": "So we will have some shift.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the new motion and devil iterates ourselves until the ship doesn't become very small.",
                    "label": 0
                },
                {
                    "sent": "Usually takes maybe 45 iterations in this example, and here are the results.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we have 83 points.",
                    "label": 1
                },
                {
                    "sent": "Correspondence is an less than half of the half.",
                    "label": 1
                },
                {
                    "sent": "There are more outliers than our objects this, but I'm trying to see an for each object.",
                    "label": 0
                },
                {
                    "sent": "Maybe we have at most 20 correspondences, so these are two images, like this region moved like this and here it's rotated and distant can float it as well.",
                    "label": 0
                },
                {
                    "sent": "So this is the original boundaries and I'm drawing by the way it's estimated three objects successfully and then then we draw the boundary as you see it very perfectly aligns with.",
                    "label": 0
                },
                {
                    "sent": "Underlying object.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's go to another application model update on manifold, but we mean by that like in the previous.",
                    "label": 1
                },
                {
                    "sent": "Application we want to compute the mean of the points on the main fault.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because?",
                    "label": 0
                },
                {
                    "sent": "Let's say I have multiple observations of an object.",
                    "label": 0
                },
                {
                    "sent": "I'm doing tracking object tracking and everything.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I get kind of different results.",
                    "label": 0
                },
                {
                    "sent": "Now I want to combine them, but the thing that they are in on manifold and I have to put them together I cannot just add matrices again.",
                    "label": 1
                },
                {
                    "sent": "What we do we kind of compute mean as in the previous algorithm that I showed we go to.",
                    "label": 0
                },
                {
                    "sent": "Tangent space and kind of go back to the manifold.",
                    "label": 1
                },
                {
                    "sent": "Go back again and this how we do the thing that we can impose some weights here.",
                    "label": 0
                },
                {
                    "sent": "Like kind of how far they are far away there from the.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So there on the manifold.",
                    "label": 0
                },
                {
                    "sent": "So this ovated mean computation and even we can impose this depending on the time.",
                    "label": 0
                },
                {
                    "sent": "So OK, let's go to resource.",
                    "label": 0
                },
                {
                    "sent": "Here are some sample frames.",
                    "label": 0
                },
                {
                    "sent": "The initial frame manually kind of labels for the face and this would happen if you do exhaustive search using covariance again, but without computing the distance all the manifold.",
                    "label": 0
                },
                {
                    "sent": "If you compute the distance all the main fault is this is this significant change and it kind of.",
                    "label": 0
                },
                {
                    "sent": "Lower city and it learns it without any conflating of the manifold or charting or more dimensional representation.",
                    "label": 0
                },
                {
                    "sent": "There is no PC here or any big classifiers.",
                    "label": 0
                },
                {
                    "sent": "This simple algorithm here is the tracking video that you would.",
                    "label": 0
                },
                {
                    "sent": "Find on the on on the Internet.",
                    "label": 0
                },
                {
                    "sent": "This let him control here an.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is real footage in from Los Angeles.",
                    "label": 0
                },
                {
                    "sent": "I believe Los Angeles is in.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Dangerous city.",
                    "label": 0
                },
                {
                    "sent": "But we do the exhaustive research for all possible regions in an image, then assign the base image.",
                    "label": 0
                },
                {
                    "sent": "So this is another example of tracking our object rotated and kind of size change.",
                    "label": 0
                },
                {
                    "sent": "The mobile update keep track of that because it knows it remembers both structure and to kind of do.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Solution at the same time.",
                    "label": 0
                },
                {
                    "sent": "So here that I illustrate.",
                    "label": 0
                },
                {
                    "sent": "Even if there is significant, I slow down the video.",
                    "label": 0
                },
                {
                    "sent": "Significant lighting changes between the frames.",
                    "label": 0
                },
                {
                    "sent": "I mean it can still find it by.",
                    "label": 0
                },
                {
                    "sent": "Because it's in vain to DC changes its second order statistic histogram cannot do it anyway here.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some course comparison side by side and this is one of the best performing trackers which is based on mean shift again.",
                    "label": 0
                },
                {
                    "sent": "And these are some performance numbers.",
                    "label": 0
                },
                {
                    "sent": "Which means the whatever the color space that we are working.",
                    "label": 0
                },
                {
                    "sent": "Hide the dimensions performs better by the way.",
                    "label": 0
                },
                {
                    "sent": "So this is challenging because distribution is really kind of almost.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Monochromatic.",
                    "label": 0
                },
                {
                    "sent": "An Ant noise.",
                    "label": 0
                },
                {
                    "sent": "95% of the pixels intensity values are distorted in this example.",
                    "label": 0
                },
                {
                    "sent": "So was it, but we do it every frame.",
                    "label": 0
                },
                {
                    "sent": "The optic model.",
                    "label": 0
                },
                {
                    "sent": "If there is a drift is going to cause more drift?",
                    "label": 0
                },
                {
                    "sent": "This could happen.",
                    "label": 0
                },
                {
                    "sent": "What happens for the histogram representation?",
                    "label": 0
                },
                {
                    "sent": "There is, and it cannot find it again here.",
                    "label": 0
                },
                {
                    "sent": "Update on the manifolds is kind of robust to that.",
                    "label": 1
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Alright, let's go to the classifiers on manifold.",
                    "label": 0
                },
                {
                    "sent": "Our problem, binary classification you can extend it to multiclass classification as well.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our method of choice is the boosting algorithm.",
                    "label": 0
                },
                {
                    "sent": "But first we have to be able to fit a classifier, a kind of decision stump to our data on many ports.",
                    "label": 0
                },
                {
                    "sent": "This is a big class fire and we will learn it in the tangent space.",
                    "label": 1
                },
                {
                    "sent": "This the more most intuitive thing to do right, but we do.",
                    "label": 1
                },
                {
                    "sent": "We kind of complete the weights.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned this, bated mean computation enables us to impose waits while we are working in the tangent space in boosting.",
                    "label": 0
                },
                {
                    "sent": "This is a boosted classifier based off the samples which are misclassified.",
                    "label": 1
                },
                {
                    "sent": "Increases in the next iteration, so you concentrate more on the examples that your previous classifiers can make most likely make a mistake so difficult examples.",
                    "label": 0
                },
                {
                    "sent": "Weighted mean most towards these points in producing more accurate classifier.",
                    "label": 0
                },
                {
                    "sent": "This is again boosting.",
                    "label": 0
                },
                {
                    "sent": "Well, I mean it's proven that it's.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The minimizes the approximation error through averaging over several we classify.",
                    "label": 0
                },
                {
                    "sent": "And two.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the right hand side, what you see we kind of trust map all the points on the tangent space and then the feature classifier and we do it for different regions and then we choose the best one and this.",
                    "label": 0
                },
                {
                    "sent": "Well, in this situation it's moved right and and it's kind of stabilized.",
                    "label": 0
                },
                {
                    "sent": "We do it for many different choice of selections and then we put them together.",
                    "label": 0
                },
                {
                    "sent": "So we have these multiple classifiers in our booster tree.",
                    "label": 0
                },
                {
                    "sent": "See like one of the figures are missing, so it may not be necessary.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Clear what happens on the manifold.",
                    "label": 0
                },
                {
                    "sent": "You will end up with many, many tangent spaces covering all most of the difficult parts of the meaningful.",
                    "label": 0
                },
                {
                    "sent": "And you did this, you classify the combination of that thing and this is the boosting training algorithm.",
                    "label": 0
                },
                {
                    "sent": "And, well, maybe you you may not like to read all the details and also let me kind of mention about to kiss keep it version.",
                    "label": 0
                },
                {
                    "sent": "To make everything more.",
                    "label": 0
                },
                {
                    "sent": "Much faster.",
                    "label": 0
                },
                {
                    "sent": "It simply cascades the reject.",
                    "label": 0
                },
                {
                    "sent": "Some of the negatives because mostly we have much more negatives than the positives.",
                    "label": 0
                },
                {
                    "sent": "So for instance, in this example we reject.",
                    "label": 0
                },
                {
                    "sent": "35% of the negatives, which means that 65 remains to the next cascate level, but we keep all my.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All deposit this our target and this in this human detection applications we had 30 cascade players and it runs maybe 50 times faster than the original direct implementation and each of them are linear regression functions trained on the tangent space and this dimensionality of the vector space which is 9 features Third 6 and each soft window is actually a covariance matrix at the computer.",
                    "label": 0
                },
                {
                    "sent": "Ryan Smith this is this five we had the lead group and two remaining manifold.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Maybe somebody did, let's say these are my positive samples and negative samples.",
                    "label": 0
                },
                {
                    "sent": "Then I I'm adding my vehicle as far into the strong classifier I have this margin, like I kind of rank all the positives and I want to keep all of this and I rank all the negatives.",
                    "label": 0
                },
                {
                    "sent": "I want to kind of remove all of this attempt but we don't.",
                    "label": 0
                },
                {
                    "sent": "Usually what happens.",
                    "label": 0
                },
                {
                    "sent": "This level is very close to this one, which means that kind of is a very sensitive boundary.",
                    "label": 0
                },
                {
                    "sent": "Introduce another margin is not kind of something that you may write a paper, but it makes everything more robust, OK?",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This talk about this, did I skip any know these?",
                    "label": 0
                },
                {
                    "sent": "Are the records here you see?",
                    "label": 0
                },
                {
                    "sent": "First post this per window and this is 10 to minus five.",
                    "label": 0
                },
                {
                    "sent": "This is Miss Reed and this is linear data set.",
                    "label": 0
                },
                {
                    "sent": "At the time this these are permeant CPR papers.",
                    "label": 0
                },
                {
                    "sent": "This resulted reported results was the land tricks and Zoo of Eden at all, and these are their performance curves is to see if you use manyfold covariance matrix.",
                    "label": 0
                },
                {
                    "sent": "You almost end up an order of.",
                    "label": 0
                },
                {
                    "sent": "Performance improvement, by the way, this blue one is.",
                    "label": 0
                },
                {
                    "sent": "RBF kernel, which is computationally slow and speed updating our algorithm maybe 1000?",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Time faster than that.",
                    "label": 0
                },
                {
                    "sent": "He my manifold.",
                    "label": 0
                },
                {
                    "sent": "I mean in this graph, but you should under see this.",
                    "label": 0
                },
                {
                    "sent": "What happens if you directly use Hawk?",
                    "label": 0
                },
                {
                    "sent": "Which door antique we're using?",
                    "label": 0
                },
                {
                    "sent": "And if you compute the covariance but complete distances in vector space, I'm going to vectorize my metrics without any kind of distances that I was talking about and I will apply it well.",
                    "label": 0
                },
                {
                    "sent": "There's some improvement, but this is not the right thing to do because there's not the right distance norm.",
                    "label": 0
                },
                {
                    "sent": "And if you map everything onto identity without selecting the kind of pickle aspire mapping point, this further improvement and algorithm data short actually kind of this.",
                    "label": 0
                },
                {
                    "sent": "The performance of.",
                    "label": 0
                },
                {
                    "sent": "This algorithm.",
                    "label": 0
                },
                {
                    "sent": "And these are the results.",
                    "label": 0
                },
                {
                    "sent": "I mean, I think this is the fun part.",
                    "label": 0
                },
                {
                    "sent": "Here is an image forming.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Dataset there's the child here and there are you see occluded people, significant occlusions, and what you see.",
                    "label": 0
                },
                {
                    "sent": "These are the detection regions, and blue dots are the centers, and algorithm finds the scale.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At the same time, by searching in this scale and scale space.",
                    "label": 0
                },
                {
                    "sent": "And here here is another result.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Please quite.",
                    "label": 0
                },
                {
                    "sent": "Accurate here is another one.",
                    "label": 0
                },
                {
                    "sent": "While we didn't train with two kind of sitting people images, that's why they're not.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Signis, obviously.",
                    "label": 0
                },
                {
                    "sent": "And deviation as the last thing that I wanted to show.",
                    "label": 0
                },
                {
                    "sent": "Revision means that I'm going to.",
                    "label": 0
                },
                {
                    "sent": "I will try to fit a function on my data points.",
                    "label": 0
                },
                {
                    "sent": "That's basically what regression is anyway.",
                    "label": 0
                },
                {
                    "sent": "So here how I define my application.",
                    "label": 0
                },
                {
                    "sent": "I have these image that points.",
                    "label": 0
                },
                {
                    "sent": "I want to track.",
                    "label": 0
                },
                {
                    "sent": "And it's an image coordinates.",
                    "label": 0
                },
                {
                    "sent": "I make it to my object coordinates and this is kind of like the rigid transformation, rotation and translation.",
                    "label": 0
                },
                {
                    "sent": "And this is a fine transformation.",
                    "label": 0
                },
                {
                    "sent": "And armor level feature is just Hawke, but.",
                    "label": 0
                },
                {
                    "sent": "Since because of this motion I end up working on a manifold again.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is what I'm going to do.",
                    "label": 0
                },
                {
                    "sent": "I will model the interframe motion incrementally from frame to frame and this how it's Delta.",
                    "label": 0
                },
                {
                    "sent": "Mt is the incremental motion corresponding to motion of the target.",
                    "label": 0
                },
                {
                    "sent": "And this offer is my feature hog descriptor and we we have.",
                    "label": 0
                },
                {
                    "sent": "This appears in vector space corresponding to points on the manifold.",
                    "label": 0
                },
                {
                    "sent": "So regression function is Max the vector space data on the manifold.",
                    "label": 0
                },
                {
                    "sent": "So from the.",
                    "label": 0
                },
                {
                    "sent": "This opinion space did mention to the manifold design, which is the motion vector matrices.",
                    "label": 0
                },
                {
                    "sent": "We will define our objective function as the sum of the square geodesic distances between the estimations of our Phi Alpha RFID descriptor and the points on the manifold, and this how we define.",
                    "label": 0
                },
                {
                    "sent": "And since there is the algebra as I mentioned, the objective function you can work on the mathematics to write it in this way up to the 1st order terms and regression function can be written in this way also.",
                    "label": 0
                },
                {
                    "sent": "And this is what we are after the Omega.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um, in terms of Omega.",
                    "label": 0
                },
                {
                    "sent": "Notation this are objective function and remember I can generate because.",
                    "label": 0
                },
                {
                    "sent": "OK, I have the initial frame.",
                    "label": 0
                },
                {
                    "sent": "I have the region that I want to trick, but I do.",
                    "label": 0
                },
                {
                    "sent": "I apply several random transformations but I know those transformations because I generate them and every time around London proper transformations here maybe here.",
                    "label": 0
                },
                {
                    "sent": "Here I met, pick them onto the.",
                    "label": 0
                },
                {
                    "sent": "Kind of my object coordinates and I computed features so.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But I haven't.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But I mean that I know all the descriptors and I know all the doors.",
                    "label": 0
                },
                {
                    "sent": "Kind of like the motion vectors themselves and our goal to kind of, in this case a linear regression function.",
                    "label": 0
                },
                {
                    "sent": "Find this thing at.",
                    "label": 0
                },
                {
                    "sent": "The solution is very straightforward and the trace of this quadratic and.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To make it more kind of robust, but we did, we introduce some additional coefficients to kind of balance the weight contribution of each descriptor coefficient, and that's the result.",
                    "label": 0
                },
                {
                    "sent": "See the kind of actually taking examples.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here but you see, we are tracking the region, not just the center.",
                    "label": 0
                },
                {
                    "sent": "We are a fine tracking and we're only and this is maybe the face tracker you may have.",
                    "label": 0
                },
                {
                    "sent": "Why at the beginning you just compute these Omega relation function and in the following frames you compute the only for one region compute the descriptor at multiplied with a metrics so nothing can be faster than this.",
                    "label": 0
                },
                {
                    "sent": "I think there's no search.",
                    "label": 0
                },
                {
                    "sent": "And this is another.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Example.",
                    "label": 0
                },
                {
                    "sent": "By the way, we were working on the particle filter extensions of this idea, so that's how it works.",
                    "label": 0
                },
                {
                    "sent": "But if it's too much motion, if it doesn't can fit into might wander training samples, it loses the trick, and then the kind of combined everything using a particle filter implementation or many fault again, but I'm not showing that, so this is how it works.",
                    "label": 0
                },
                {
                    "sent": "Significant amount of motion.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "But",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is defined motion and find motion is perfect for planar surface is right?",
                    "label": 0
                },
                {
                    "sent": "Well, if it's small enough, even if for a sphere, it works well.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Like on the boat here.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Even kind of there are two.",
                    "label": 0
                },
                {
                    "sent": "If you anymore.",
                    "label": 0
                },
                {
                    "sent": "But it's a kind of more complicated shape and human nose, and I in 3D you see it's kind of.",
                    "label": 0
                },
                {
                    "sent": "There's nothing cultural tier, just initialize it and it's going to trick, and it's going to take very fast.",
                    "label": 0
                },
                {
                    "sent": "And these are results are actually published at CPR.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now I'm going to do yet another thing I'm going to.",
                    "label": 0
                },
                {
                    "sent": "What I'm going to do.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to do tracking, but I'm gonna do pose estimation using the same algorithm.",
                    "label": 0
                },
                {
                    "sent": "How I'm going to do it now instead of training mind tracker for one image, I'm going to check with multiple images from the same object class.",
                    "label": 0
                },
                {
                    "sent": "In this case faces so I don't initialize anything, but I do.",
                    "label": 0
                },
                {
                    "sent": "I have this MIT face data set and I apply random transformations and then I obtain only one.",
                    "label": 0
                },
                {
                    "sent": "Relation functional.",
                    "label": 0
                },
                {
                    "sent": "And then what I do in the image?",
                    "label": 0
                },
                {
                    "sent": "I have these blocks and I trick each block in the image.",
                    "label": 0
                },
                {
                    "sent": "So I hope this is clear.",
                    "label": 0
                },
                {
                    "sent": "This is not tracking between friends.",
                    "label": 0
                },
                {
                    "sent": "I have this block by train.",
                    "label": 0
                },
                {
                    "sent": "The black bit in the same frame.",
                    "label": 0
                },
                {
                    "sent": "Again I if I initialize here and it moves here I initialize.",
                    "label": 0
                },
                {
                    "sent": "Here it's more serious than I ask a kind of cheap face detector is interface or not because I didn't train a face detector right?",
                    "label": 0
                },
                {
                    "sent": "When combined with this tracking algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is what you get.",
                    "label": 0
                },
                {
                    "sent": "So initially they are started wrong and to face it's small, but the region automatically adapts itself towards the face.",
                    "label": 0
                },
                {
                    "sent": "Even if it doesn't look like it face like in this example, very noisy.",
                    "label": 0
                },
                {
                    "sent": "So these are image tracking examples.",
                    "label": 0
                },
                {
                    "sent": "But it tries to do it, tries to make the region inside this border looks like a face.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Amazing right?",
                    "label": 0
                },
                {
                    "sent": "And we had only frontal faces, and now it's converted to example.",
                    "label": 0
                },
                {
                    "sent": "And these small scale data is.",
                    "label": 0
                },
                {
                    "sent": "You see there is no resolution.",
                    "label": 0
                },
                {
                    "sent": "But this is not my end goal.",
                    "label": 0
                },
                {
                    "sent": "Actually, the next slide I will show you why we want to do this type of tracking between the single image.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Alright, so.",
                    "label": 0
                },
                {
                    "sent": "Let's keep this thing.",
                    "label": 0
                },
                {
                    "sent": "It basically says that this is better than a.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Things, but here is the result.",
                    "label": 0
                },
                {
                    "sent": "This is a kind of an advanced implementation of Viola Jones face vector with multiple rotations and kind of of so this is what you get.",
                    "label": 0
                },
                {
                    "sent": "These are sample images and these are the detection results.",
                    "label": 0
                },
                {
                    "sent": "With that combined with additional heuristics.",
                    "label": 0
                },
                {
                    "sent": "And this is what you would end up if you apply divide the image into blocks and for each black apply this face tracking and tennis.",
                    "label": 0
                },
                {
                    "sent": "Viola Jones, say actually, is it a face or not so?",
                    "label": 0
                },
                {
                    "sent": "And you know that they find transformation into this, so you can actually kind of get an idea about the 3D rotation.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, it was my last night actually.",
                    "label": 0
                },
                {
                    "sent": "So is the last word I want to just repeat myself.",
                    "label": 0
                },
                {
                    "sent": "Several parameter spaces commonly occur in computer vision problems have remaining manifold structure and they provide major improvements.",
                    "label": 1
                },
                {
                    "sent": "I think points of an application might be Glad, Flop lashing and you are the people to investigate it further.",
                    "label": 0
                },
                {
                    "sent": "I believe so that concludes my talk.",
                    "label": 0
                }
            ]
        }
    }
}