{
    "id": "eq6p4yae7szkqizzoxaricjwlkb4zjpr",
    "title": "Applied semantics: beyond the catalog",
    "info": {
        "author": [
            "Jamie Taylor, Google, Inc."
        ],
        "published": "Dec. 19, 2017",
        "recorded": "October 2017",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2017_taylor_applied_semantics/",
    "segmentation": [
        [
            "So that's more credit than I actually deserve.",
            "I was part of a really fabulous team and I continue to be part of a truly terrific team.",
            "Pretty much all of the things that I know about semantics and ontologies.",
            "I have learned from the people that I work with is Natasha said I don't really come from this background.",
            "I worked in enterprise software and I got incredibly frustrated building these very dynamic object oriented systems and then having to stuff all of that information that we were gathering somehow into a relational database.",
            "And it just never worked out.",
            "The way I wanted it to, and so when I was given the opportunity to work on a very large graph system, I jumped at it and it just turned into something that I had never anticipated.",
            "And the people that I was working with really made all of it happen.",
            "I think you know I have breakfast once a week with Natasha.",
            "She is truly a good friend in the sense that I see her after having a 2 hour bus ride an long before.",
            "I have coffee and still she sits with me and I eat my chocolate muffin and talk about sort of random things.",
            "I'm going to talk about more of those random sort of ideas today.",
            "I my concern is that you know next time until she is going to say it actually goes better with slides and I'm going to be obligated to build slides every week.",
            "It really is such a privilege to be here talking with you, and I have to say that this talk is about sort of like the things that we have done.",
            "Some of the things I've observed, but also I think as Natasha was saying where I would really like to see things going and I'm puzzled as to in some sense why they haven't gotten there or why we haven't sort of moved things the way I had anticipated.",
            "So this is actually a really sort of special moment.",
            "This week in that this lab."
        ],
        [
            "Last Sunday was the 11 year anniversary of the first assertion to go into Freebase, and you know, I was just sort of like astounded when I looked at the calendar every year.",
            "We have sort of, you know, an anniversary marker that says, you know this is when Freebase started.",
            "I."
        ],
        [
            "I think you know it was really interesting.",
            "Social semantic experiment and I think for the most part it actually worked out fairly well.",
            "We started with the idea that this was going to be a community built asset and that is that the community, and by that I mean both the Freebase community and the communities of all of the different sources that we were building from put together the complete inventory of the entities that this system was going to have, but.",
            "Also, and I think this was sort of even the more curious, it's part of the experiment was they were going to build the vocabulary on which this whole structure was actually built.",
            "Now, because we sort of had no idea how well this is going to work with the Community, and because we sort of had seen sort of small scale experiments run sort of rather amok.",
            "We used what I would call our DFS minus minus.",
            "And that is to say that the sort of tagline in my technical introduction talks was if you think there is any inference going on in Freebase.",
            "You have sort of observed incorrectly.",
            "We do absolutely no inference.",
            "It's pretty much all these ground assertions that you folks are making.",
            "And yes, we sort of provide some sort of hints and help and guidelines and things like that, but there's sort of no magic going on behind the scenes.",
            "I think one of the things that really made Freebase kind of special was that it had a very simple Web API and we were really trying to encourage web developers to build semantic applications on this Community built.",
            "Resource an that simple API are sort of model was that if you couldn't sort of figure out how this thing worked and you could be building an actually meaningful application within an hour, we were actually doing something wrong and so that was how low we really wanted to bar to be.",
            "After the Metaweb organization had joined Google, I did a presentation at the Google IO conference in 2011 where we were very proud to say that we had 20,000,000 entities in Freebase, an 400 million connections, and I still look back at that point in time and I remember sort of, you know how excited we were about that, and I think that was actually sort of an interesting landmark.",
            "One of the things that really set Freebase apart, and I think this is actually something that made it.",
            "Extremely special and I think it actually helped in its success was that we looked at this resource as a continually creating graph of knowledge and that is there was sort of like one graph image and we carried that graph image through time for people who are familiar with small talk, this was like having a small talk image.",
            "We just sort of kept adding to it.",
            "We never stopped to refactor it.",
            "We never stopped and shut it down and sort of reloaded it and rebuilt it.",
            "In fact, it was built on an append only journaling database system, so it was kind of cool.",
            "You could actually look back and see how Freebase had grown overtime and the image."
        ],
        [
            "That we all had in our head, I think, was that of a crystal that was growing, right?",
            "So you had these sort of like seeds that have been planted from a lot of these different data sources that were being aggregated together and the knowledge was just slowly a creating around that.",
            "And you know, hopefully building this actually sort of rather beautiful structure.",
            "So."
        ],
        [
            "So.",
            "If you're going to build a crystal like that, and if you're going to carry a resource image through time, one of the important things that we sort of identified very early on was this idea of reconciliation.",
            "That was, as we were pulling information from all of these different sources, we wanted to manage the identity so that if you had sort of multiple statements about the same thing coming from all these different places, they needed to be brought together.",
            "And given one identifier and that identity needed to be managed within the system.",
            "So the Canonical example at the time, which I think is rather appropriate for this conference given where we're located, was Arnold Schwarzenegger.",
            "You see him as a bodybuilder and we actually had databases of athletic awards in which Arnold was identified.",
            "We had information about his political career being company that was in California and he was governor at the time.",
            "That was sort of, you know, very apropos.",
            "And then, of course we had a lot of information about media and movies, and so we were getting all of these different sources and we brought them together and the critical part was that there was only one Arnold Schwarzenegger.",
            "In Freebase, an all of the things that we knew about him was aggregated around that one object in the system."
        ],
        [
            "So what did we learn?",
            "It was an experiment after all.",
            "Well managing identity is actually really hard.",
            "I mean no surprise, right?",
            "I mean, record matching and things like that has been sort of a subject of investigation for probably about 40 some years now.",
            "An though I think we sort of fell upon some sort of really good ways of doing it, and we learned some sort of very useful affordances for the user interface.",
            "It turns out it's still really hard, but it's really, really critical, right, and?",
            "That was another sort of takeaway.",
            "Is that quality really matters?",
            "And it really matters from the very first instance, and that is if you actually manage to get good assertions, you then be get more good assertions.",
            "You really sort of able to accrete very solid information around these things, but the moment that you actually have sort of bad quality, you have bad reconciliation.",
            "You have bad assertions against things.",
            "It turns out that that actually diffuses your signal for things like future reconciliation.",
            "And causes you to miss the target on this reconciliation, which therefore just exacerbates the situation, and your system slowly starts falling apart, and a few of my colleagues and I have actually tried to quantify this, and it turns out that it's extraordinarily hard to put metrics around this, and we're still sort of grappling with this, but I think this is a really important sort of take away.",
            "I think the other funny thing that we learned is that not everyone is actually good at semantic modeling.",
            "I think we actually believe that you know this was a community built resource and that you know if you were a domain.",
            "Expert and you had some idea of sort of what was going on in the subject matter area.",
            "You could probably take our tools and you could actually sort of craft up a reasonably good semantic model and go throw some information at it, and we would all benefit from that.",
            "Yet, well, that's not really true.",
            "It turns out that semantic modeling is actually hard, and it takes some sort of like understanding of what the larger picture is to do it well.",
            "So free."
        ],
        [
            "Bass came out at this moment in time and I think that's really quite interesting is we were obviously not alone.",
            "DB PEDIA and Yago appeared virtually simultaneously.",
            "I remember actually sitting in a meeting and we had discovered Jago an it was just like Oh my gosh, somebody else is sort of thinking these thoughts and it was really exciting and I think it was very appropriate that the DB pedia folks were recognized with the 10 year award.",
            "Tenure impact award.",
            "Because I truly think that you know, as sort of a way of sort of evangelizing towards a much larger community.",
            "The fact that there were multiple versions of this story being told and each one with sort of a slightly different take on it, but still sort of all converging on the same idea, was really sort of important and very critical in making all of this work well.",
            "So.",
            "As I said, I think you know this."
        ],
        [
            "It was a really special moment in time and I think we should all sort of like take sort of stock in that.",
            "And the question is sort of like what was really happening.",
            "What made it so special, and I think this is really the sort of the big takeaway is that really large amounts of knowledge were actually being written down an.",
            "That doesn't sound like much, but when you sort of step back and you think about sort of what that means, we're accumulating all of this information.",
            "We're actually taking the time to build a resource that other people can use and build upon that act of sort of stopping and writing it all down so other people can use it is huge.",
            "And when I think about."
        ],
        [
            "This it's a little bit like these different projects were surveyors out there taking stock of the terrain and they were really trying to sort of like understand what was going on and in some sense I think we were really sort of building a map of information."
        ],
        [
            "On I think of this as much like sort of the act that was taking place in the early 1800s, when Lewis and Clark, who were explorers, decided that they were going to venture out across the North American continent and sort of find out what was between the Appalachian Mountains and the Mississippi River, and that ocean that they had actually heard about on the other side.",
            "Anne.",
            "What's really fun about Maps, and the reason that I think DB pedia in Jago and Freebase were sort of like map making is that no map is ever made again without a base map.",
            "So these guys go out and they go and they actually write down what rivers they're coming across.",
            "And they write down what mountain ranges there bumping into and what peaks and what passes are available.",
            "And this is a hand drawn map.",
            "They've got some sort of crude survey equipment.",
            "They're really taking a very meandering path, but they're documenting everything that they bump into, and everything that they can see in the distance.",
            "And this basic survey turns."
        ],
        [
            "To be the base map on which the next explorers build, they now know where the best peaks are to go and sort of take that survey point.",
            "They know what Rivers they're going to have to cross, they know what passes they can get through and which ones they can't get through, and so they go out and they draw an even better map.",
            "And then."
        ],
        [
            "Technology changes and you have things like satellites and you have things like electronic distance measuring equipment and you get really accurate surveys and these things are actually being still built upon that earlier base map because they need ground truth.",
            "They need to know what is actually down at the lower levels and so you get these really high Fidelity surveys of everything that's out there, and I think that's actually sort of the legacy that Knowledge Graph Spring."
        ],
        [
            "So.",
            "These are in fact I think knowledge base Maps.",
            "If we've done our job right, nobody in the future when they're building one of these systems is ever going to encode Angela Merkel's birthday, right?",
            "We know what the height of the Eiffel Tower is, and we know how to extract that from the previous systems and build upon that going forward, an I truly believed.",
            "As I was working on Freebase, and I think many of my colleagues did to that.",
            "If we were doing this right, this data was going to live long beyond our lifetimes.",
            "And in fact, if it didn't.",
            "We were seriously doing something wrong."
        ],
        [
            "So I think as everybody in this audience knows, Freebase is the core on which Google's knowledge graph is built."
        ],
        [
            "And one of the sort of.",
            "Interesting things about Knowledge graph is really sort of thinking about all of the ways in which Google uses this.",
            "So in Freebase we had a very simple model of what airports were.",
            "We knew that airports were located and serve different cities and we understood that airports themselves were actually compounds with multiple buildings, some of which were identified as terminals.",
            "An we had done a lot of instances of airports with this information associated with it and from the."
        ],
        [
            "Google was very quickly able to build the knowledge Graph panels that you see when you do an entity search and you still see these today and we keep enhancing these knowledge graph panels.",
            "So this was a very early one.",
            "We type in SFO.",
            "We were able to bring up San Francisco airport.",
            "We knew certain things about it.",
            "We were able to show that to you."
        ],
        [
            "But then.",
            "That airport foundation actually gave us the ability to do something really exciting.",
            "This was at the very early days of schema.org.",
            "We decided we could have a reservation description an we knew that you were on a flight with an airline and then that flight was actually servicing airport and so we were able to make this next sort of level of schema description built on the original airport foundation and that was really cool because then.",
            "We could go into Gmail."
        ],
        [
            "We could find theschema.org markup that matched this description and we could actually bring this up and make it available through the Knowledge Graph and we could tell you things about the reservation that you had coming up."
        ],
        [
            "So once you have the reservations, then it seems pretty natural that you understand that there is actually data about the statuses of all of the flights that you're taking, and that flights have different legs.",
            "An if we know the status of that leg, then we probably know what gate at what terminal at what airport is being served, and so now we can actually build a much richer."
        ],
        [
            "Our application and we have the flight status displays which I don't know.",
            "Frankly, I find is one of the most useful things that appears on my phone."
        ],
        [
            "So now that we actually know sort of where you're going, and when you're going and when you're getting there, we can also then talk about the city that you're arriving in, and we know all sorts of things."
        ],
        [
            "It's about the events that are going on in that city."
        ],
        [
            "Points of interest in that city, and we can now build a pretty rich experience that tells you about what you can do at your destination at the right time."
        ],
        [
            "So I work as a part of the Knowledge Graph schema team.",
            "We are one of actually many different pieces of the Knowledge Graph ecosystem and.",
            "I think it's really sort of when I think about sort of what it is that we do.",
            "We help the developers at Google actually build these interlocking data structures.",
            "They have some idea for a feature and we help them sort of understand how it fits together with all of the other information that we're managing with in knowledge graph.",
            "We also you know, as sort of a team of people who like to think about semantics and think about sort of what's possible with a knowledge graph.",
            "We're always looking for new ways that we can add structures that will actually improve what it is that we could do in the future.",
            "But it's also interesting.",
            "Sort of.",
            "You know, that's sort of standard semantic story, but we're also sort of like a cornerstone in dealing with quality in the graph because we have sort of this view of all of these things needing to work together, unlike some of the developers who are working and thinking about their specific feature, we think about sort of how all of the features and all of the information needs to work together and what's really fun is that that sort of thinking about quality dovetails with all of the folks that are interested in sort of the greater user experience.",
            "And thinking about sort of how all of these stories should fit together.",
            "And so we're thinking about ways that we can automatically enforce graph quality.",
            "We want to make sure that the information that's going in today actually be gets better information in the future.",
            "So we're thinking about how we can actually use semantics to improve quality checking.",
            "An as a part of that, we continue to think about sort of how it is that you define identity, and frequently we are sort of the folks that are sort of on call to answer identity questions when people can't figure out.",
            "Sort of how the graph should actually look from an instance by instance spaces.",
            "But one of the challenges of being sort of in this position where all of these things are sort of coming together is we really work very, very hard to actually get out of everybody's way.",
            "We want to make this as self-service as possible, and it turns out that that is also extremely challenging.",
            "So the more that we can sort of automate things, the more that we can actually sort of put information into the graph itself, the better it is for everybody, including ourselves.",
            "So."
        ],
        [
            "One of the things that we learn by building these large knowledge graphs is sort of all of the processes that are necessary to make them happen.",
            "I think one of the big ones that we keep encountering is actually dealing with notions of identity around class membership.",
            "What does it actually mean to be a member of this class?",
            "So these are the types of questions that we get asked all the time.",
            "You know, if a person actually played sports when they were in high school, does that make them an athlete?",
            "I don't know.",
            "It probably depends on the level.",
            "No, we can't actually say it.",
            "We don't know.",
            "We actually have to operationally define what it is that we mean by being an athlete.",
            "Yes, actually if you played sports and that was something that we have information about, you are an athlete, awesome.",
            "Government position holders.",
            "Frequently we identify them as politicians.",
            "Something happens, one of them leaves office.",
            "Somebody points a person into that position.",
            "Are they a politician?",
            "I don't know.",
            "They didn't go out and you know, get elected in campaign and things like that.",
            "No, we actually have to have an answer for that.",
            "We have to be able to say that that person is a politician because they're holding an office which we identify as being held by politicians.",
            "This is one of my favourites, you know?",
            "A while back it was really easy to talk about what happened in a cinema.",
            "You saw films in the cinema, so anything that was showing in a cinema had to be film and then all of a sudden you discover that there are things like live sports being broadcast within movie theaters are those live sports films.",
            "I don't know.",
            "Doesn't seem quite right, and in fact we say no if in fact you know this is not something that had a theatrical release, had certain sort of production qualities around it.",
            "No, it's actually not a film, so these are sort of the operational questions that my team.",
            "Has to deal with and coming up with these sort of concrete operational definitions turns out to be really challenging, but really critical if you're going to maintain that quality and be able to have this aggregate structure that serves so many different purposes."
        ],
        [
            "One of my favourites is wondering what it is to actually be a fire station.",
            "This turns out to actually be a real question, and it seems so obvious you say, well, there's a building and there's fire equipment in it and there is, you know, fire personnel and I can go there and they can put out fires and that's all good.",
            "It must be a fire station and then."
        ],
        [
            "We see things like this.",
            "You have a firefighter, you have a piece of firefighting equipment.",
            "It's not a location.",
            "Is that location now a fire station?",
            "I don't know.",
            "That seems a little weird.",
            "Every airport that has a tanker that fights fires is a fire station.",
            "I don't know.",
            "So no, actually we decided that those are not fire stations.",
            "That there are other qualities associated with fire stations."
        ],
        [
            "Reconciliation, so this is, you know we talked about sort of what does it mean to be a member of the class?",
            "Now it's actually down to the level of instances, you know.",
            "If a basketball team picks up and moves to another city, is that the same basketball team?",
            "I don't know.",
            "It feels a little different.",
            "Different arena, different name, potentially.",
            "Yes, we actually thinks the same team director's cuts.",
            "You know what does it actually mean to be a work?",
            "Librarians asked?",
            "Act as if this is a really simple project.",
            "No, they actually have tones that tell them specifically how it is that you go through and catalog these things.",
            "And I think we, as semantic developers, frequently think, oh, that's easy.",
            "I can just sort of like figure that out sitting in my arm chair.",
            "You have to have these operational definitions to understand what it means to be a work."
        ],
        [
            "So Knowledge graph has grown a bit since Freebase we have over a billion entities under management and more than 70 billion assertions."
        ],
        [
            "It's it's big, it's it's really big.",
            "And I think the question is, is it actually big enough?",
            "That's a really sort of curious question.",
            "How big do these things have to be?"
        ],
        [
            "So I I would suggest that everybody go take a look at this article.",
            "This user talk page in Wikipedia.",
            "It's an absolutely fascinating exploration of how big the knowledge space is, and they go off and they sort of characterized well for the arts.",
            "We're going to need to know about architecture and books and performing arts.",
            "How many things are there out there that are actually worthy of having a Wikipedia article?"
        ],
        [
            "An the estimate that they come up with is 104 million.",
            "Notable Wikipedia articles, wow.",
            "That's kind of a big number.",
            "I mean, it's smaller than number of entities and knowledge graph, but to put it in perspective, that suggests that Wikipedia is only 5% complete.",
            "Right, so we've got a lot more Wikipedia that has to be built.",
            "So when we think about knowledge graph, we think about all the non notable ones.",
            "If Wikipedia is only 5% complete, I'm terrified of how big knowledge graph has to be.",
            "And, uh."
        ],
        [
            "Our way of thinking about this is of the trillions of searches that Google gets every year, every day we look at the logs and we discover that 15% of the searches are things that we have never seen before.",
            "It's crazy right?",
            "Our users.",
            "Know about things at a rate that is just unfathomable.",
            "Right, this is this is ever growing.",
            "This is an ever increasing challenge.",
            "So I."
        ],
        [
            "I love to go in and just sort of poke around knowledge graph and so I was there looking at, you know, sort of famous people and bio medicine and Jonas Salk seemed like an obvious person to pursue and so I looked in it.",
            "You know we knew that he was responsible for the polio vaccine and we understood that the polio vaccine targets polio and that this is in fact a vaccine, and that vaccines are drugs and we knew that you know, the polio virus causes polio, and that this is a type of disease."
        ],
        [
            "And no where could I find information that suggested that the polio vaccine actually prevents polio?",
            "I mean really come on this is this is actually what made Jonas Salk important.",
            "So ah."
        ],
        [
            "This point my beautiful crystal.",
            "Feels a lot like rock candy an even worse.",
            "It feels like more of a semantic swizzle stick.",
            "And this is the part of the talk where I'm actually like, really depressed.",
            "But the good part is that your community sort of has really interesting things to say.",
            "And I hear Jim Hendler."
        ],
        [
            "Saying, hey, a little semantics goes a long way.",
            "And this is like a Ray of sunshine.",
            "There's a bit of hope.",
            "And I have this picture in my head as an economist of what this actually means.",
            "And ice."
        ],
        [
            "Stay cool.",
            "I add some more semantics.",
            "I get a bunch of utility out of it.",
            "And this is all like redeeming.",
            "I could, I can see my way clear to how knowledge graphs work and we achieve the scale that's necessary and we can build all sorts of cool things on it.",
            "When I step back and I think to myself, actually Jim may have been saying something else.",
            "As an economist, I say."
        ],
        [
            "Epsilon is greater than 0.",
            "You know, so hey, you know any semantics, some semantics, the littlest amount of semantic is was so much better than no semantics.",
            "Yeah, that doesn't help, OK?",
            "And then you know, I actually wake up in the middle of the night."
        ],
        [
            "And I think maybe this is the way it actually works, right?",
            "You know, yeah, sure you know some semantics is better than none, but you have to have all bunch of semantics before you get any sort of noticeable return out of it, and you just have to keep piling on the semantics.",
            "And it's like holy cow, OK, so."
        ],
        [
            "I I'm willing to sort of play through this model.",
            "OK, this is this is like there's hope at the end of the tunnel here, but I think this is."
        ],
        [
            "This is my real problem when I think about sort of being a part of the Knowledge Graph schema team.",
            "That is that I'm trying to figure out constantly what the net present value of knowledge is.",
            "I'm trying to figure out what my return tomorrow will be from the investment that I'm making today in semantics, and it turns out that we just really don't have a good way as a community of talking about this.",
            "And I think this is really kind of troubling.",
            "I think we need to spend some time thinking about how we measure these things so that we can do these types of calculations, and I think the reason that it's so important is because I think about all of the things."
        ],
        [
            "The Knowledge graph could contain, right.",
            "There are facts about things.",
            "This is sort of the bread and butter of free basing knowledge graph, right?",
            "I know when Jane Austen was born, but you know, then there's also sort of all of the relations between things in the world.",
            "I know that you know, if you talk to me about a fictional story, I know that it probably has characters.",
            "But then there's a lot of other sort of information out there.",
            "Things like, you know, everybody knows phonographs make sound.",
            "Knowledge Graph has no idea.",
            "There's a bunch of locale specific knowledge.",
            "Hey, here's a little tip for you if you're flying through Boston spending some time there.",
            "If you order regular coffee, you may be surprised.",
            "It just comes with cream.",
            "You know it's just the way the world works in Boston.",
            "And then there's a bunch of like social knowledge, right?",
            "That's very sort of specific to sort of how we all behave in society.",
            "Hey, if you're going to cough, you should probably cover your mouth."
        ],
        [
            "And I think there's much more so.",
            "I'm left wondering what it is that we should actually invest in.",
            "What kinds of knowledge, how much knowledge, all of these things are really important questions.",
            "So when I think about this, I think about sort of all the things that Knowledge Graph doesn't have."
        ],
        [
            "You know an identify this sort of notion that.",
            "The idea that the polio vaccine prevents polio is something that we haven't properly encoded, and I think to myself, you know the thing that I need to know is something about vaccines, right?",
            "I knew that this thing was a vaccine.",
            "I should know something more about vaccines, because once I know that, then I know something about sort of all of the."
        ],
        [
            "Things that are vaccines and so it's kind of interesting, right?",
            "This is what typically is identified as common sense knowledge, and I think this is kind of amusing.",
            "Statement and I'm a little bit afraid of sort of why we call it this and why we've actually decided to classify this knowledge as common sense.",
            "I think what's interesting about it is that this is all the stuff that isn't notable.",
            "Right, this is the stuff that isn't going to get the Wikipedia article.",
            "This is the stuff that everybody knows is sort of context background knowledge.",
            "And you know, so hey, it's not that exciting.",
            "So why are we actually going to bother included?",
            "Turns out that this is the stuff that makes the whole world work.",
            "This is what makes us as humans understand stuff so."
        ],
        [
            "I think it's really sort of a misnomer to call it common sense, and I think in fact we've done ourselves a huge disservice classifying this as common sense.",
            "This is a little bit like, you know, classifying it this way so that we get the Douglas Adams.",
            "It's somebody elses problem, so we'll sort of dispatch that to some other group.",
            "They'll worry about that at some other point in the future will go on, and we'll do the really notable important semantic stuff.",
            "Importantly, what we should call this is important sense.",
            "Hey, this is the kind of stuff that people should go out and do a bunch of research on and we should actually."
        ],
        [
            "Sort of build corpuses of.",
            "And we can build a lot of really interesting things around it.",
            "This is all of the stuff that hasn't been written down that I think needs to be written down."
        ],
        [
            "Sociologists have a really interesting way of talking about this.",
            "There's this idea of sort of like, you know, the consensual reality.",
            "All of the things that we sort of understand by being a society and communicating with one another, such that I just assume that you know these things an so these are all the common interpretations.",
            "These are all the short shared views of what it is that people actually do."
        ],
        [
            "And I think again, it's not really the social stock of knowledge.",
            "Is is the locale specific stock of knowledge.",
            "This is all of the things that people in different locales.",
            "And when I mean locales, I mean sort of like the extensive idea of language and location and culture.",
            "These are the things that we need to know about."
        ],
        [
            "So have in mind.",
            "This idea that we should really have a much better way of expressing things like class level attributes.",
            "And in programming languages you would think of this as everything that is a static number, right?",
            "This object definition.",
            "Causes me to sort of like have all of these things and that's true for the class.",
            "I don't have to worry about the instances because they just get it for free.",
            "Another way of sort of thinking about this is that."
        ],
        [
            "I want the abstract methods right.",
            "I want the things that I should know about these classes that my application is actually going to deal with, right?",
            "That's the level at which the implementation is actually going to take place in programming languages.",
            "You might think of this as interfaces, right?",
            "If you're going to deal with this class, you need to go and implement this so that I know that you know how to deal with this piece of information, and you do that at the class level.",
            "You don't do that at the instance level."
        ],
        [
            "So from this perspective, really what I'm talking about is developing an API for the real world, and that is that I want a way of taking all the human requests to these systems to these applications, and I want to be able to encode them.",
            "In such a way that I can actually find the resources in my system that know how to deal with that, and similarly all of those resources needed to be encoded in the same way.",
            "Right, so that I can match these two things up.",
            "This is the thing that they're looking for.",
            "This is the interface that I'm actually going to connect with.",
            "I bind these two things together at that interface.",
            "This is like standard CSS pattern stuff, right?",
            "I mean, we expect all of our undergraduates to understand this, but I think we haven't stepped back and thought about.",
            "Sort of like how are people actually going to use these giant knowledge resources?",
            "What do we really mean?",
            "My semantics?",
            "How do we mean that an application understands anything?",
            "I mean, I think this is in some sense our community's notion of common sense, right?",
            "We all just assume that we've thought about this.",
            "Of course, that's what we're doing, but I think we actually need to step back and say, well, how do you do that?",
            "How do you do that practically?",
            "Because.",
            "That's how applications get built.",
            "So fab."
        ],
        [
            "Leslie, I think actually knowledge graphs are these API's.",
            "I think we just haven't sort of continued to move them forward enough to fulfill this sort of full story."
        ],
        [
            "So here's what I have in mind.",
            "You tell me that I have an electric teapot.",
            "I want to know what the method signatures are for electric teapots.",
            "I want to know that they can heat things.",
            "More importantly, I think it would be actually nice if you told me that they specifically heat water.",
            "Uh."
        ],
        [
            "Mr Hey, it keeps things too.",
            "We have something in common.",
            "There's a class of things that it heats, and those are called baked goods, and we understand what that class of baked goods is.",
            "We have a whole bunch of instances.",
            "You can imagine getting really, really fancy, right, so that you could say, well, you know this toaster.",
            "It actually resides in the kitchen.",
            "So if you're looking for this thing that can heat baked goods, you probably want to look in the kitchen, and you know you have to have electricity.",
            "It's not too useful when you're camping."
        ],
        [
            "I can imagine doing this for all of the concepts that we have in the Knowledge graph, right?",
            "I would really like to know that what we mean by a Bell is something that can be wrong.",
            "You know, planes fly.",
            "That's that's actually like useful information that is not encoded really anywhere in knowledge graph and yet kind of important, because if I actually understand what it means to fly, then I have some idea.",
            "You know that planes might move at a certain speed.",
            "I might also understand that even though I could get to the coffee shop down the block really fast.",
            "If I could take a plane, it's actually not too practical because planes actually move from very specific points to points, whereas you know walking.",
            "It's much more diverse and where it can go.",
            "Um?",
            "Similarly, I would love to sort of have the inverse available, which is, you know, hey, what are all the things that you can actually do with these concepts?",
            "Knives cut very useful.",
            "You can fasten things together with a stapler.",
            "And this concordance between sort of like all of these concepts, and all of the things that you can do.",
            "For his largest knowledge graph is we don't have it.",
            "And I keep looking around and I actually can't find this corpus.",
            "Um?"
        ],
        [
            "No, blender is wow.",
            "They're actually pretty diverse.",
            "You can do all sorts of strange things with them.",
            "You can chop solid substances, and I think the really important part is that you may be thinking, oh, actually, I've heard this story before.",
            "We have some sort of colossally large semantic systems that can do all of this fancy reasoning, and I'm not talking about that.",
            "OK, I'm not talking about inference.",
            "I don't want to know what happens to the thing in the blender when I actually run the CHOP method.",
            "What I really want to be able to do is just describe to you that what a blender does is chop.",
            "Right, because if you think about sort of like getting a recipe.",
            "And the recipe tells you that you need to chop this solid substance depending on sort of like the level at which it's being chopped, you may say to yourself what can do that and it would be really nice to just know that I should be telling you that's a blender.",
            "I don't have to tell you what happens to the stuff afterwards, the recipe takes care of that.",
            "That's the other input to the system.",
            "I'm not going to do sort of all that reasoning.",
            "I'm going to let the application determine what level this has to be implemented at."
        ],
        [
            "So here's the problem.",
            "I said I can't find this corpus and where does this knowledge come from?",
            "And all of this stuff seems like common sense, and I think this is the curious thing, right?",
            "Folks, there is no Wikipedia for this, right?",
            "There is no resource that we can just go and sort of appropriate and rain for all of its semantic worth.",
            "An I don't know.",
            "Many years ago I was at a triple AI workshop talking about semantics and things like that an it was focused on Wikipedia.",
            "And I got up, and as usual I said the most unpopular thing which is, I think Wikipedia is training wheels, right?",
            "Wikipedia was a way for us to actually get started.",
            "It is not the end, and it's not something that we can rely on for everything.",
            "It's a good seed on which we can grow the crystal, but all of the things that I'm talking about are not notable, right?",
            "Nobody is going to actually sit and write the encyclopedic article for, you know, chopping things in blenders.",
            "So.",
            "You know, I start looking."
        ],
        [
            "Around I keep thinking so where am I going to get this information?",
            "How am I going to build this?",
            "And I think it's actually going to be some form of crowdsourcing, right?",
            "We're going to have to go out and collect this information at scale from a lot of people and a lot of different resources.",
            "And we're going to have to sort of build this together.",
            "What I do find is interesting is that when you go and sort of look at definitions or the articles in Wikipedia, they tend to have all of this stuff encoded in language.",
            "I'm sure this is the attraction for NLP, right?",
            "Hey, no problem.",
            "I look up vaccine in the very first thing it tells me is that it prevents diseases.",
            "That's really cool.",
            "When I go and look up Blender."
        ],
        [
            "It turns out that they tell me that they chop things.",
            "Wow, all of the things that I've been looking for are actually encoded in these dictionary glosses."
        ],
        [
            "So maybe dictionaries are an approximation.",
            "Maybe that's a good place to start to grow this seed, and I think you know this is to me.",
            "A really interesting story.",
            "Dictionaries have been around for a really long time right on in there sort of current modern form where we get sort of nice things like the idea that you should use things like different genus and differentia to define the terms.",
            "We're talking about 200 years of sort of refining this resource.",
            "Lexicographers have gotten really good at this.",
            "Many of them have the idea that there is a defining vocabulary.",
            "There's a set of terms out there on which everything else will be defined, and it's really cool.",
            "It's really sort of generative in that sense, right?",
            "You start with you know 2 to 3000 concepts for in English, and I can give you sort of the whole oedi.",
            "There are even sort of, you know, sort of step down resources.",
            "These multi layer dictionaries that are used for language learners where you start with about 400 terms and you can bootstrap the next 2000 so that I can get you to the OD.",
            "So this is very attractive from a semantic perspective, Ann.",
            "I think it's interesting."
        ],
        [
            "Get.",
            "The linguists.",
            "Have actually spent a lot of time thinking about this right?",
            "How is it that language communicates semantics so you have this notion of semantic primes, right?",
            "The Meta language on which all other languages are defined.",
            "This is how meaning is pulled out of language semantic explications this is the idea that you know there are certain constructions out there which can be defined in terms of these semantic primes.",
            "When I think about this."
        ],
        [
            "As an application developer and I have to say that's the thing that really excites me about knowledge.",
            "Graphs is being able to write really interesting applications.",
            "I think you know I start up there with sort of the source code that we're all familiar with, and I run it through the compiler, and the compiler produces assembly and then the assembler runs and turns into the machine code and somewhere at a very very low level.",
            "Microcode the code that's running inside the processor that I didn't actually have access to is bound to very specific actions in hardware, and that's actually how the system works and I'm thinking to myself what is the microcode here?",
            "What things can I do as a developer and go implement those interfaces such that I get the behavior for my application that I want?",
            "Because the semantics at a higher level just follow from that."
        ],
        [
            "And I think the really critical thing is to start thinking about how you build applications.",
            "There are a lot of applications that are semantically enabled, and I think that's a curious thing.",
            "When I hear sort of people wondering sort of what semantic applications are out there.",
            "I mean certainly you have all of the examples of what Google is doing with Knowledge Graph, but you also sort of think about all of the Web 2.0 ish kind of.",
            "You know, they seem like there are very sort of siloed applications, But it turns out that many of them are very horizontal in their knowledge right?",
            "These are taking in reviews of all sorts of different things.",
            "And and the critical part is that I want to be able to write these applications at scale, right?",
            "If I have to hand code everything if I have to have a whole bunch of wrote queries.",
            "Or I require the common sense knowledge of my humans to browse through these application."
        ],
        [
            "And yeah, this is not going to work.",
            "So."
        ],
        [
            "I'm thinking maybe these dictionaries are a good place to start.",
            "So where are these artifacts?",
            "Where are these sort of semantic primitives that we as a community have gone off and said, yeah, these are the things on which you know, sort of.",
            "You should be able to bootstrap the rest of the semantic understanding, and I can't find them and I'm I'm shocked that I'm surprised and I asked my linguist friends and they say, well, actually you know the concordances between nouns and verbs.",
            "Yeah, it seems like a really good idea, but you know, actually, there isn't one.",
            "You know where are these dictionaries that are, you know, machine readable such that it can get access to the genus and differential so that I can actually find the defining concepts and actually use them to bootstrap my semantics.",
            "And and the reference."
        ],
        [
            "So that I can find this a really surprising so Amsler wrote this PhD thesis in 1980 using a machine readable dictionary that was developed in 1970.",
            "And really what it was was the typeset version of the Merriam Webster Pocket Dictionary.",
            "They went through and they cleaned it up and he crowdsourced it to all of his graduate student friends and he said I need you to encode the genus and differentia in this so that I can actually do some interesting things and try to induce hierarchies from this dictionary.",
            "And you know what?",
            "It worked, it was really cool.",
            "This is the most amazing thesis that I've read.",
            "Unfortunately he was using a licensed dictionary.",
            "There is no longer available and the artifact is long gone, but he was operating at a level of about.",
            "Can 10,000 think he had about 30,000 total concepts in his corpus and it said it is defined as an unprecedented size?",
            "If we'd started in 1980, we might actually be at the scale that we need to be.",
            "There's another example, which is the Gelish English Dictionary and Gelish is this sort of semantic way of describing big machines and how they fit together and different taxonomies of these machines and they bothered.",
            "They step back and they said, you know, actually we have sort of a core vocabulary here on which all of the other things are defined and we can define them in terms of genus and differential, and they made this machine accessible and they said, you know, we could actually extend this to do a little bit of simple English.",
            "And it's a really cool idea.",
            "And again, they're talking about sort of like 30,000 terms in this thing, and that was ten years ago.",
            "And that's it.",
            "That's as far as I can find.",
            "Maybe people know about others that I am not aware of, but I have gone looking for this and I've asked a lot of people and nobody can sort of help me lay hands on this type of system.",
            "That's actually going to help us glue all the knowledge graphs together.",
            "So I want to go back and say look."
        ],
        [
            "10 years ago, was this really sort of exciting moment in time where a lot of information was written down and these base Maps were drawn on which we can actually do really interesting things and build up much better semantics.",
            "And once we do that, we actually build applications and we learn how these systems work and we refine those systems and it moves us pretty far forward."
        ],
        [
            "And I'm concerned that you know.",
            "This other area that I want to go into is like infinitely rich.",
            "The other area is just plain old big.",
            "This is like infinite and I'm not sure sort of what things we should focus on.",
            "So I want to propose to the Richard Scary test."
        ],
        [
            "Ann, I discovered that even though these appear in a number of different languages, and they're not as well internationally known, these are children's books which are really sort of intricate pictures that describe sort of activities in everyday life and situations in everyday life and things that you will encounter in everyday life.",
            "And they really sort of form this great basis of discussion with kids about sort of what goes on in the world, and they're really fun.",
            "There is incredible detail in them.",
            "They show you sort of like, you know how the pipes go through walls and are connected to sewer systems and.",
            "How coal is mined underground and refined in such a way that it can be burned in turbines and create electricity then and then transmitted down the transmission grid and the only problem with these book?"
        ],
        [
            "Is that you know they have all of these really interesting experiences, but we need to make sure that the thing that we don't encode is that pigs are firemen.",
            "OK, that's just that's the only caveat on this Richard scale, but I think if we build systems that can actually explain, describe what's going on in these books, we are well on our way to having sort of good semantic understanding.",
            "So according to the."
        ],
        [
            "PD analysis there are 25,000,000.",
            "Books that have ever been written and we can go out and we can actually add information to all 25 million of those.",
            "About the author and illustrator and the publisher of the characters.",
            "In the additions and the publication dates.",
            "And there's a whole bunch more we can do that 25 million times.",
            "Or we can focus on the 1 console."
        ],
        [
            "The book.",
            "And we can encode some information that says, you know.",
            "Actually people write books and people read books and books are typically collections of paper that are bound together in libraries actually store these books.",
            "One concept.",
            "Just a few things that we need to encode, and all of a sudden we understand something about 25 million entities out there.",
            "I don't know, but I."
        ],
        [
            "I think this is actually maybe what Jim was getting at right?",
            "We find the things where we get a lot of leverage or we go off and we encode a little bit of information and all of a sudden we learn about huge swaths of the real world.",
            "So I think if we do this."
        ],
        [
            "We're actually going to be sort of well on our way to growing a really beautiful crystal.",
            "Thank you.",
            "Several times during the talk you said, well, there's nothing out there like this like knowledge interface slots, right?",
            "So there's one thing which is unpopular, or for several reasons, but we have psych right?",
            "As for me, the only trial which is worth exploring and which actually works.",
            "I mean under certain conditions, but still works right.",
            "It has the concept of context and.",
            "Diamond everything else.",
            "OK, it's manually mates fine, but how would you see my?",
            "I mean this old AI experiment which still is alive.",
            "Read in the context of Freebase, which is well is missing upper level ontology in this form right?",
            "Our DFS minus minus right?",
            "I mean it's sort of like the antithesis of psych.",
            "I may have caught my illusion to psych.",
            "I didn't want to actually call it out specifically.",
            "To me.",
            "Psych was on the right track, but it got tangled up.",
            "And that angle is that it spent sort of a lot of effort worrying about that inference, and I understand why it's really attractive, right?",
            "I can just sort of like make this whole sort of machine come to life.",
            "I don't have those aspirations.",
            "OK, because I think the critical thing is before you sort of go down that Rd.",
            "You need the interface you need to say I actually understand all of the methods for these concepts, and that's actually a huge undertaking.",
            "Much larger than site.",
            "Now, I agree that went out and sort of captured a lot of like really core ideas, right?",
            "You know, physical concepts and measurement units and all of that stuff.",
            "And it is very powerful in that sense.",
            "And I actually I go back and I.",
            "Play with psych occasionally and I very attracted to it.",
            "It's a little bit of a siren song for me, but I think that the critical part is, you know when you start getting into things like micro theories and you start having to like partition your world because that angle is getting too hard to actually make work.",
            "That's maybe the point at which we should like stop and step back a little bit and say look, let's just actually try to get the interface right and will let the applications go and do those implementations for now.",
            "And maybe if we get that level right and that's working pretty well, and we discovered that all of these applications are sort of like manageable and they could potentially work together, then we should pursue much more of a psych like approach.",
            "And I have an observation, a question and a recommendation, please.",
            "So my observation is that any human child by the age of seven probably has a more complete knowledge graph in their mind then we as a community can build and dressing.",
            "No, it's great.",
            "It's great because because.",
            "The process by which that happens happens all the time, and in a way that gives us a blueprint to think about that yes, so so my observation is that's my observation.",
            "My question is why aren't we doing that and how?",
            "Maybe as a community we can think about leveraging cognitive science and human development and language learning these elements that that are studied and are available at some level.",
            "So the question is why aren't we doing that?",
            "My recommendation is.",
            "Have you heard of the work of Andrew Gordon and Jerry Hobbs, who are colleagues of mine at ISI who have written a Magnum Opus over the last 20 years describing a whole bunch of machine readable human machine readable machine processing based structures, semantic structures for common sense psychology?",
            "They just published a book this year and so if you haven't seen that, I would definitely recommend it.",
            "'cause it's brilliant, I actually don't know the book.",
            "I know a little bit about the work and I think your observation is dead on and I believe that in some sense.",
            "You're developing the same call that I am hoping to incent here, which is that there's there's a lot of hints of how this could actually play out, and things that we could go look at to learn from.",
            "I don't know that we need to sort of like recapitulate psychology.",
            "I'm come from that background and I don't necessarily sort of think that you know the machines need to actually do that version of it, but I think there's a lot to be learned about.",
            "Sort of how it takes place, and I think this is actually why.",
            "When I talk to my colleagues in NLP, they're actually thinking about these things.",
            "They're thinking about these things in ways that I don't feel like my group and my ecosystem has thought about them, so I think that's the other side of the coin.",
            "Thank you for this wonderful and interesting talk.",
            "What I am thinking about isn't there to kind of philosophical problem.",
            "What you rise because what we call knowledge when it comes to machine.",
            "I think it's not the same when it comes to human beings.",
            "So when we encode knowledge is every time a kind of abstraction that kind of model and what I had to feel you are thinking about is.",
            "About encoding all this very complex and not.",
            "Not variable in that models things, but thinking about this is it.",
            "Maybe it's even not possible to encode all the things.",
            "Yes, it may not be, and I think that is the challenge.",
            "That's before.",
            "I think the really critical part though, is that I'm not suggesting at all that this needs to be human knowledge.",
            "What I'm really suggesting is that we as humans are the ones that benefit from these applications, and so we need to understand, sort of like how our knowledge and the machines knowledge interfaces, right?",
            "And that's really why I think these types of encodings are actually really important at interface level.",
            "I certainly don't think to sort of like my prior comment.",
            "I don't think that this is a story about sort of like how machines do human knowledge and thinking and reasoning or anything like that, but that interface needs to be sort of very clear because that's the level at which we actually care about what the machines are doing.",
            "That I would like to hear a little bit about the relevance of the knowledge graph for the Google Enterprise, so you haven't really talked about that.",
            "I actually I'm hoping that I address that a bit by describing to you some of the features that you have probably encountered on your journey to this conference, which are actually built on knowledge Graph and they started from a very very simple core, right?",
            "And I think the critical part is that you know Google said that one of the big transitions in sort of using the metaweb underpinning is that all of a sudden they were going from sort of text string.",
            "IR retrieval to understanding these things as real objects, right that actually had sort of interactions, and they could be bound in certain interesting ways, and that's prevalent all over Google, right?",
            "Every time.",
            "Many, many features that you are using everyday YouTube right?",
            "Their understanding of what's going on in that video is based on the fact that they actually have found these things to concepts in the Knowledge Graph and they understand what the relationships between those things are.",
            "It's.",
            "All over the ecosystem, and to me, that's what's really exciting.",
            "It's.",
            "In you so prominently and so many of you interact with these things everyday and you don't actually know that that's actually what's making this experience possible, and in some sense, to me, that's sort of like the right level at which semantics is operating.",
            "It's just sort of become transparent, invisible.",
            "It's just enabling the experience that you want to have."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's more credit than I actually deserve.",
                    "label": 0
                },
                {
                    "sent": "I was part of a really fabulous team and I continue to be part of a truly terrific team.",
                    "label": 0
                },
                {
                    "sent": "Pretty much all of the things that I know about semantics and ontologies.",
                    "label": 0
                },
                {
                    "sent": "I have learned from the people that I work with is Natasha said I don't really come from this background.",
                    "label": 0
                },
                {
                    "sent": "I worked in enterprise software and I got incredibly frustrated building these very dynamic object oriented systems and then having to stuff all of that information that we were gathering somehow into a relational database.",
                    "label": 0
                },
                {
                    "sent": "And it just never worked out.",
                    "label": 0
                },
                {
                    "sent": "The way I wanted it to, and so when I was given the opportunity to work on a very large graph system, I jumped at it and it just turned into something that I had never anticipated.",
                    "label": 0
                },
                {
                    "sent": "And the people that I was working with really made all of it happen.",
                    "label": 0
                },
                {
                    "sent": "I think you know I have breakfast once a week with Natasha.",
                    "label": 0
                },
                {
                    "sent": "She is truly a good friend in the sense that I see her after having a 2 hour bus ride an long before.",
                    "label": 0
                },
                {
                    "sent": "I have coffee and still she sits with me and I eat my chocolate muffin and talk about sort of random things.",
                    "label": 0
                },
                {
                    "sent": "I'm going to talk about more of those random sort of ideas today.",
                    "label": 0
                },
                {
                    "sent": "I my concern is that you know next time until she is going to say it actually goes better with slides and I'm going to be obligated to build slides every week.",
                    "label": 0
                },
                {
                    "sent": "It really is such a privilege to be here talking with you, and I have to say that this talk is about sort of like the things that we have done.",
                    "label": 0
                },
                {
                    "sent": "Some of the things I've observed, but also I think as Natasha was saying where I would really like to see things going and I'm puzzled as to in some sense why they haven't gotten there or why we haven't sort of moved things the way I had anticipated.",
                    "label": 0
                },
                {
                    "sent": "So this is actually a really sort of special moment.",
                    "label": 0
                },
                {
                    "sent": "This week in that this lab.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Last Sunday was the 11 year anniversary of the first assertion to go into Freebase, and you know, I was just sort of like astounded when I looked at the calendar every year.",
                    "label": 0
                },
                {
                    "sent": "We have sort of, you know, an anniversary marker that says, you know this is when Freebase started.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I think you know it was really interesting.",
                    "label": 0
                },
                {
                    "sent": "Social semantic experiment and I think for the most part it actually worked out fairly well.",
                    "label": 1
                },
                {
                    "sent": "We started with the idea that this was going to be a community built asset and that is that the community, and by that I mean both the Freebase community and the communities of all of the different sources that we were building from put together the complete inventory of the entities that this system was going to have, but.",
                    "label": 0
                },
                {
                    "sent": "Also, and I think this was sort of even the more curious, it's part of the experiment was they were going to build the vocabulary on which this whole structure was actually built.",
                    "label": 0
                },
                {
                    "sent": "Now, because we sort of had no idea how well this is going to work with the Community, and because we sort of had seen sort of small scale experiments run sort of rather amok.",
                    "label": 0
                },
                {
                    "sent": "We used what I would call our DFS minus minus.",
                    "label": 0
                },
                {
                    "sent": "And that is to say that the sort of tagline in my technical introduction talks was if you think there is any inference going on in Freebase.",
                    "label": 0
                },
                {
                    "sent": "You have sort of observed incorrectly.",
                    "label": 0
                },
                {
                    "sent": "We do absolutely no inference.",
                    "label": 0
                },
                {
                    "sent": "It's pretty much all these ground assertions that you folks are making.",
                    "label": 0
                },
                {
                    "sent": "And yes, we sort of provide some sort of hints and help and guidelines and things like that, but there's sort of no magic going on behind the scenes.",
                    "label": 1
                },
                {
                    "sent": "I think one of the things that really made Freebase kind of special was that it had a very simple Web API and we were really trying to encourage web developers to build semantic applications on this Community built.",
                    "label": 0
                },
                {
                    "sent": "Resource an that simple API are sort of model was that if you couldn't sort of figure out how this thing worked and you could be building an actually meaningful application within an hour, we were actually doing something wrong and so that was how low we really wanted to bar to be.",
                    "label": 0
                },
                {
                    "sent": "After the Metaweb organization had joined Google, I did a presentation at the Google IO conference in 2011 where we were very proud to say that we had 20,000,000 entities in Freebase, an 400 million connections, and I still look back at that point in time and I remember sort of, you know how excited we were about that, and I think that was actually sort of an interesting landmark.",
                    "label": 0
                },
                {
                    "sent": "One of the things that really set Freebase apart, and I think this is actually something that made it.",
                    "label": 0
                },
                {
                    "sent": "Extremely special and I think it actually helped in its success was that we looked at this resource as a continually creating graph of knowledge and that is there was sort of like one graph image and we carried that graph image through time for people who are familiar with small talk, this was like having a small talk image.",
                    "label": 0
                },
                {
                    "sent": "We just sort of kept adding to it.",
                    "label": 0
                },
                {
                    "sent": "We never stopped to refactor it.",
                    "label": 0
                },
                {
                    "sent": "We never stopped and shut it down and sort of reloaded it and rebuilt it.",
                    "label": 0
                },
                {
                    "sent": "In fact, it was built on an append only journaling database system, so it was kind of cool.",
                    "label": 0
                },
                {
                    "sent": "You could actually look back and see how Freebase had grown overtime and the image.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That we all had in our head, I think, was that of a crystal that was growing, right?",
                    "label": 0
                },
                {
                    "sent": "So you had these sort of like seeds that have been planted from a lot of these different data sources that were being aggregated together and the knowledge was just slowly a creating around that.",
                    "label": 0
                },
                {
                    "sent": "And you know, hopefully building this actually sort of rather beautiful structure.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "If you're going to build a crystal like that, and if you're going to carry a resource image through time, one of the important things that we sort of identified very early on was this idea of reconciliation.",
                    "label": 0
                },
                {
                    "sent": "That was, as we were pulling information from all of these different sources, we wanted to manage the identity so that if you had sort of multiple statements about the same thing coming from all these different places, they needed to be brought together.",
                    "label": 0
                },
                {
                    "sent": "And given one identifier and that identity needed to be managed within the system.",
                    "label": 0
                },
                {
                    "sent": "So the Canonical example at the time, which I think is rather appropriate for this conference given where we're located, was Arnold Schwarzenegger.",
                    "label": 0
                },
                {
                    "sent": "You see him as a bodybuilder and we actually had databases of athletic awards in which Arnold was identified.",
                    "label": 0
                },
                {
                    "sent": "We had information about his political career being company that was in California and he was governor at the time.",
                    "label": 0
                },
                {
                    "sent": "That was sort of, you know, very apropos.",
                    "label": 0
                },
                {
                    "sent": "And then, of course we had a lot of information about media and movies, and so we were getting all of these different sources and we brought them together and the critical part was that there was only one Arnold Schwarzenegger.",
                    "label": 0
                },
                {
                    "sent": "In Freebase, an all of the things that we knew about him was aggregated around that one object in the system.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what did we learn?",
                    "label": 1
                },
                {
                    "sent": "It was an experiment after all.",
                    "label": 1
                },
                {
                    "sent": "Well managing identity is actually really hard.",
                    "label": 0
                },
                {
                    "sent": "I mean no surprise, right?",
                    "label": 0
                },
                {
                    "sent": "I mean, record matching and things like that has been sort of a subject of investigation for probably about 40 some years now.",
                    "label": 0
                },
                {
                    "sent": "An though I think we sort of fell upon some sort of really good ways of doing it, and we learned some sort of very useful affordances for the user interface.",
                    "label": 0
                },
                {
                    "sent": "It turns out it's still really hard, but it's really, really critical, right, and?",
                    "label": 0
                },
                {
                    "sent": "That was another sort of takeaway.",
                    "label": 0
                },
                {
                    "sent": "Is that quality really matters?",
                    "label": 0
                },
                {
                    "sent": "And it really matters from the very first instance, and that is if you actually manage to get good assertions, you then be get more good assertions.",
                    "label": 0
                },
                {
                    "sent": "You really sort of able to accrete very solid information around these things, but the moment that you actually have sort of bad quality, you have bad reconciliation.",
                    "label": 0
                },
                {
                    "sent": "You have bad assertions against things.",
                    "label": 0
                },
                {
                    "sent": "It turns out that that actually diffuses your signal for things like future reconciliation.",
                    "label": 0
                },
                {
                    "sent": "And causes you to miss the target on this reconciliation, which therefore just exacerbates the situation, and your system slowly starts falling apart, and a few of my colleagues and I have actually tried to quantify this, and it turns out that it's extraordinarily hard to put metrics around this, and we're still sort of grappling with this, but I think this is a really important sort of take away.",
                    "label": 0
                },
                {
                    "sent": "I think the other funny thing that we learned is that not everyone is actually good at semantic modeling.",
                    "label": 1
                },
                {
                    "sent": "I think we actually believe that you know this was a community built resource and that you know if you were a domain.",
                    "label": 0
                },
                {
                    "sent": "Expert and you had some idea of sort of what was going on in the subject matter area.",
                    "label": 0
                },
                {
                    "sent": "You could probably take our tools and you could actually sort of craft up a reasonably good semantic model and go throw some information at it, and we would all benefit from that.",
                    "label": 0
                },
                {
                    "sent": "Yet, well, that's not really true.",
                    "label": 0
                },
                {
                    "sent": "It turns out that semantic modeling is actually hard, and it takes some sort of like understanding of what the larger picture is to do it well.",
                    "label": 0
                },
                {
                    "sent": "So free.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Bass came out at this moment in time and I think that's really quite interesting is we were obviously not alone.",
                    "label": 0
                },
                {
                    "sent": "DB PEDIA and Yago appeared virtually simultaneously.",
                    "label": 0
                },
                {
                    "sent": "I remember actually sitting in a meeting and we had discovered Jago an it was just like Oh my gosh, somebody else is sort of thinking these thoughts and it was really exciting and I think it was very appropriate that the DB pedia folks were recognized with the 10 year award.",
                    "label": 0
                },
                {
                    "sent": "Tenure impact award.",
                    "label": 0
                },
                {
                    "sent": "Because I truly think that you know, as sort of a way of sort of evangelizing towards a much larger community.",
                    "label": 0
                },
                {
                    "sent": "The fact that there were multiple versions of this story being told and each one with sort of a slightly different take on it, but still sort of all converging on the same idea, was really sort of important and very critical in making all of this work well.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "As I said, I think you know this.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It was a really special moment in time and I think we should all sort of like take sort of stock in that.",
                    "label": 0
                },
                {
                    "sent": "And the question is sort of like what was really happening.",
                    "label": 0
                },
                {
                    "sent": "What made it so special, and I think this is really the sort of the big takeaway is that really large amounts of knowledge were actually being written down an.",
                    "label": 1
                },
                {
                    "sent": "That doesn't sound like much, but when you sort of step back and you think about sort of what that means, we're accumulating all of this information.",
                    "label": 0
                },
                {
                    "sent": "We're actually taking the time to build a resource that other people can use and build upon that act of sort of stopping and writing it all down so other people can use it is huge.",
                    "label": 0
                },
                {
                    "sent": "And when I think about.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This it's a little bit like these different projects were surveyors out there taking stock of the terrain and they were really trying to sort of like understand what was going on and in some sense I think we were really sort of building a map of information.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On I think of this as much like sort of the act that was taking place in the early 1800s, when Lewis and Clark, who were explorers, decided that they were going to venture out across the North American continent and sort of find out what was between the Appalachian Mountains and the Mississippi River, and that ocean that they had actually heard about on the other side.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "What's really fun about Maps, and the reason that I think DB pedia in Jago and Freebase were sort of like map making is that no map is ever made again without a base map.",
                    "label": 0
                },
                {
                    "sent": "So these guys go out and they go and they actually write down what rivers they're coming across.",
                    "label": 0
                },
                {
                    "sent": "And they write down what mountain ranges there bumping into and what peaks and what passes are available.",
                    "label": 0
                },
                {
                    "sent": "And this is a hand drawn map.",
                    "label": 0
                },
                {
                    "sent": "They've got some sort of crude survey equipment.",
                    "label": 0
                },
                {
                    "sent": "They're really taking a very meandering path, but they're documenting everything that they bump into, and everything that they can see in the distance.",
                    "label": 0
                },
                {
                    "sent": "And this basic survey turns.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To be the base map on which the next explorers build, they now know where the best peaks are to go and sort of take that survey point.",
                    "label": 0
                },
                {
                    "sent": "They know what Rivers they're going to have to cross, they know what passes they can get through and which ones they can't get through, and so they go out and they draw an even better map.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Technology changes and you have things like satellites and you have things like electronic distance measuring equipment and you get really accurate surveys and these things are actually being still built upon that earlier base map because they need ground truth.",
                    "label": 0
                },
                {
                    "sent": "They need to know what is actually down at the lower levels and so you get these really high Fidelity surveys of everything that's out there, and I think that's actually sort of the legacy that Knowledge Graph Spring.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "These are in fact I think knowledge base Maps.",
                    "label": 0
                },
                {
                    "sent": "If we've done our job right, nobody in the future when they're building one of these systems is ever going to encode Angela Merkel's birthday, right?",
                    "label": 1
                },
                {
                    "sent": "We know what the height of the Eiffel Tower is, and we know how to extract that from the previous systems and build upon that going forward, an I truly believed.",
                    "label": 1
                },
                {
                    "sent": "As I was working on Freebase, and I think many of my colleagues did to that.",
                    "label": 0
                },
                {
                    "sent": "If we were doing this right, this data was going to live long beyond our lifetimes.",
                    "label": 0
                },
                {
                    "sent": "And in fact, if it didn't.",
                    "label": 0
                },
                {
                    "sent": "We were seriously doing something wrong.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I think as everybody in this audience knows, Freebase is the core on which Google's knowledge graph is built.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And one of the sort of.",
                    "label": 0
                },
                {
                    "sent": "Interesting things about Knowledge graph is really sort of thinking about all of the ways in which Google uses this.",
                    "label": 1
                },
                {
                    "sent": "So in Freebase we had a very simple model of what airports were.",
                    "label": 0
                },
                {
                    "sent": "We knew that airports were located and serve different cities and we understood that airports themselves were actually compounds with multiple buildings, some of which were identified as terminals.",
                    "label": 0
                },
                {
                    "sent": "An we had done a lot of instances of airports with this information associated with it and from the.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Google was very quickly able to build the knowledge Graph panels that you see when you do an entity search and you still see these today and we keep enhancing these knowledge graph panels.",
                    "label": 0
                },
                {
                    "sent": "So this was a very early one.",
                    "label": 0
                },
                {
                    "sent": "We type in SFO.",
                    "label": 0
                },
                {
                    "sent": "We were able to bring up San Francisco airport.",
                    "label": 0
                },
                {
                    "sent": "We knew certain things about it.",
                    "label": 0
                },
                {
                    "sent": "We were able to show that to you.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But then.",
                    "label": 0
                },
                {
                    "sent": "That airport foundation actually gave us the ability to do something really exciting.",
                    "label": 0
                },
                {
                    "sent": "This was at the very early days of schema.org.",
                    "label": 0
                },
                {
                    "sent": "We decided we could have a reservation description an we knew that you were on a flight with an airline and then that flight was actually servicing airport and so we were able to make this next sort of level of schema description built on the original airport foundation and that was really cool because then.",
                    "label": 0
                },
                {
                    "sent": "We could go into Gmail.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We could find theschema.org markup that matched this description and we could actually bring this up and make it available through the Knowledge Graph and we could tell you things about the reservation that you had coming up.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So once you have the reservations, then it seems pretty natural that you understand that there is actually data about the statuses of all of the flights that you're taking, and that flights have different legs.",
                    "label": 0
                },
                {
                    "sent": "An if we know the status of that leg, then we probably know what gate at what terminal at what airport is being served, and so now we can actually build a much richer.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our application and we have the flight status displays which I don't know.",
                    "label": 0
                },
                {
                    "sent": "Frankly, I find is one of the most useful things that appears on my phone.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now that we actually know sort of where you're going, and when you're going and when you're getting there, we can also then talk about the city that you're arriving in, and we know all sorts of things.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's about the events that are going on in that city.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Points of interest in that city, and we can now build a pretty rich experience that tells you about what you can do at your destination at the right time.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I work as a part of the Knowledge Graph schema team.",
                    "label": 1
                },
                {
                    "sent": "We are one of actually many different pieces of the Knowledge Graph ecosystem and.",
                    "label": 0
                },
                {
                    "sent": "I think it's really sort of when I think about sort of what it is that we do.",
                    "label": 1
                },
                {
                    "sent": "We help the developers at Google actually build these interlocking data structures.",
                    "label": 0
                },
                {
                    "sent": "They have some idea for a feature and we help them sort of understand how it fits together with all of the other information that we're managing with in knowledge graph.",
                    "label": 0
                },
                {
                    "sent": "We also you know, as sort of a team of people who like to think about semantics and think about sort of what's possible with a knowledge graph.",
                    "label": 0
                },
                {
                    "sent": "We're always looking for new ways that we can add structures that will actually improve what it is that we could do in the future.",
                    "label": 0
                },
                {
                    "sent": "But it's also interesting.",
                    "label": 0
                },
                {
                    "sent": "Sort of.",
                    "label": 0
                },
                {
                    "sent": "You know, that's sort of standard semantic story, but we're also sort of like a cornerstone in dealing with quality in the graph because we have sort of this view of all of these things needing to work together, unlike some of the developers who are working and thinking about their specific feature, we think about sort of how all of the features and all of the information needs to work together and what's really fun is that that sort of thinking about quality dovetails with all of the folks that are interested in sort of the greater user experience.",
                    "label": 1
                },
                {
                    "sent": "And thinking about sort of how all of these stories should fit together.",
                    "label": 0
                },
                {
                    "sent": "And so we're thinking about ways that we can automatically enforce graph quality.",
                    "label": 0
                },
                {
                    "sent": "We want to make sure that the information that's going in today actually be gets better information in the future.",
                    "label": 0
                },
                {
                    "sent": "So we're thinking about how we can actually use semantics to improve quality checking.",
                    "label": 0
                },
                {
                    "sent": "An as a part of that, we continue to think about sort of how it is that you define identity, and frequently we are sort of the folks that are sort of on call to answer identity questions when people can't figure out.",
                    "label": 0
                },
                {
                    "sent": "Sort of how the graph should actually look from an instance by instance spaces.",
                    "label": 0
                },
                {
                    "sent": "But one of the challenges of being sort of in this position where all of these things are sort of coming together is we really work very, very hard to actually get out of everybody's way.",
                    "label": 0
                },
                {
                    "sent": "We want to make this as self-service as possible, and it turns out that that is also extremely challenging.",
                    "label": 0
                },
                {
                    "sent": "So the more that we can sort of automate things, the more that we can actually sort of put information into the graph itself, the better it is for everybody, including ourselves.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One of the things that we learn by building these large knowledge graphs is sort of all of the processes that are necessary to make them happen.",
                    "label": 0
                },
                {
                    "sent": "I think one of the big ones that we keep encountering is actually dealing with notions of identity around class membership.",
                    "label": 0
                },
                {
                    "sent": "What does it actually mean to be a member of this class?",
                    "label": 0
                },
                {
                    "sent": "So these are the types of questions that we get asked all the time.",
                    "label": 0
                },
                {
                    "sent": "You know, if a person actually played sports when they were in high school, does that make them an athlete?",
                    "label": 1
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "It probably depends on the level.",
                    "label": 0
                },
                {
                    "sent": "No, we can't actually say it.",
                    "label": 0
                },
                {
                    "sent": "We don't know.",
                    "label": 0
                },
                {
                    "sent": "We actually have to operationally define what it is that we mean by being an athlete.",
                    "label": 0
                },
                {
                    "sent": "Yes, actually if you played sports and that was something that we have information about, you are an athlete, awesome.",
                    "label": 0
                },
                {
                    "sent": "Government position holders.",
                    "label": 0
                },
                {
                    "sent": "Frequently we identify them as politicians.",
                    "label": 0
                },
                {
                    "sent": "Something happens, one of them leaves office.",
                    "label": 0
                },
                {
                    "sent": "Somebody points a person into that position.",
                    "label": 0
                },
                {
                    "sent": "Are they a politician?",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "They didn't go out and you know, get elected in campaign and things like that.",
                    "label": 0
                },
                {
                    "sent": "No, we actually have to have an answer for that.",
                    "label": 0
                },
                {
                    "sent": "We have to be able to say that that person is a politician because they're holding an office which we identify as being held by politicians.",
                    "label": 0
                },
                {
                    "sent": "This is one of my favourites, you know?",
                    "label": 0
                },
                {
                    "sent": "A while back it was really easy to talk about what happened in a cinema.",
                    "label": 0
                },
                {
                    "sent": "You saw films in the cinema, so anything that was showing in a cinema had to be film and then all of a sudden you discover that there are things like live sports being broadcast within movie theaters are those live sports films.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "Doesn't seem quite right, and in fact we say no if in fact you know this is not something that had a theatrical release, had certain sort of production qualities around it.",
                    "label": 0
                },
                {
                    "sent": "No, it's actually not a film, so these are sort of the operational questions that my team.",
                    "label": 0
                },
                {
                    "sent": "Has to deal with and coming up with these sort of concrete operational definitions turns out to be really challenging, but really critical if you're going to maintain that quality and be able to have this aggregate structure that serves so many different purposes.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One of my favourites is wondering what it is to actually be a fire station.",
                    "label": 0
                },
                {
                    "sent": "This turns out to actually be a real question, and it seems so obvious you say, well, there's a building and there's fire equipment in it and there is, you know, fire personnel and I can go there and they can put out fires and that's all good.",
                    "label": 0
                },
                {
                    "sent": "It must be a fire station and then.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We see things like this.",
                    "label": 0
                },
                {
                    "sent": "You have a firefighter, you have a piece of firefighting equipment.",
                    "label": 0
                },
                {
                    "sent": "It's not a location.",
                    "label": 0
                },
                {
                    "sent": "Is that location now a fire station?",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "That seems a little weird.",
                    "label": 0
                },
                {
                    "sent": "Every airport that has a tanker that fights fires is a fire station.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "So no, actually we decided that those are not fire stations.",
                    "label": 0
                },
                {
                    "sent": "That there are other qualities associated with fire stations.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Reconciliation, so this is, you know we talked about sort of what does it mean to be a member of the class?",
                    "label": 0
                },
                {
                    "sent": "Now it's actually down to the level of instances, you know.",
                    "label": 0
                },
                {
                    "sent": "If a basketball team picks up and moves to another city, is that the same basketball team?",
                    "label": 1
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "It feels a little different.",
                    "label": 0
                },
                {
                    "sent": "Different arena, different name, potentially.",
                    "label": 0
                },
                {
                    "sent": "Yes, we actually thinks the same team director's cuts.",
                    "label": 0
                },
                {
                    "sent": "You know what does it actually mean to be a work?",
                    "label": 0
                },
                {
                    "sent": "Librarians asked?",
                    "label": 0
                },
                {
                    "sent": "Act as if this is a really simple project.",
                    "label": 0
                },
                {
                    "sent": "No, they actually have tones that tell them specifically how it is that you go through and catalog these things.",
                    "label": 0
                },
                {
                    "sent": "And I think we, as semantic developers, frequently think, oh, that's easy.",
                    "label": 0
                },
                {
                    "sent": "I can just sort of like figure that out sitting in my arm chair.",
                    "label": 0
                },
                {
                    "sent": "You have to have these operational definitions to understand what it means to be a work.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So Knowledge graph has grown a bit since Freebase we have over a billion entities under management and more than 70 billion assertions.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's it's big, it's it's really big.",
                    "label": 0
                },
                {
                    "sent": "And I think the question is, is it actually big enough?",
                    "label": 0
                },
                {
                    "sent": "That's a really sort of curious question.",
                    "label": 1
                },
                {
                    "sent": "How big do these things have to be?",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I I would suggest that everybody go take a look at this article.",
                    "label": 0
                },
                {
                    "sent": "This user talk page in Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "It's an absolutely fascinating exploration of how big the knowledge space is, and they go off and they sort of characterized well for the arts.",
                    "label": 0
                },
                {
                    "sent": "We're going to need to know about architecture and books and performing arts.",
                    "label": 0
                },
                {
                    "sent": "How many things are there out there that are actually worthy of having a Wikipedia article?",
                    "label": 1
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An the estimate that they come up with is 104 million.",
                    "label": 0
                },
                {
                    "sent": "Notable Wikipedia articles, wow.",
                    "label": 0
                },
                {
                    "sent": "That's kind of a big number.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's smaller than number of entities and knowledge graph, but to put it in perspective, that suggests that Wikipedia is only 5% complete.",
                    "label": 0
                },
                {
                    "sent": "Right, so we've got a lot more Wikipedia that has to be built.",
                    "label": 0
                },
                {
                    "sent": "So when we think about knowledge graph, we think about all the non notable ones.",
                    "label": 0
                },
                {
                    "sent": "If Wikipedia is only 5% complete, I'm terrified of how big knowledge graph has to be.",
                    "label": 0
                },
                {
                    "sent": "And, uh.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our way of thinking about this is of the trillions of searches that Google gets every year, every day we look at the logs and we discover that 15% of the searches are things that we have never seen before.",
                    "label": 1
                },
                {
                    "sent": "It's crazy right?",
                    "label": 0
                },
                {
                    "sent": "Our users.",
                    "label": 0
                },
                {
                    "sent": "Know about things at a rate that is just unfathomable.",
                    "label": 0
                },
                {
                    "sent": "Right, this is this is ever growing.",
                    "label": 0
                },
                {
                    "sent": "This is an ever increasing challenge.",
                    "label": 0
                },
                {
                    "sent": "So I.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I love to go in and just sort of poke around knowledge graph and so I was there looking at, you know, sort of famous people and bio medicine and Jonas Salk seemed like an obvious person to pursue and so I looked in it.",
                    "label": 0
                },
                {
                    "sent": "You know we knew that he was responsible for the polio vaccine and we understood that the polio vaccine targets polio and that this is in fact a vaccine, and that vaccines are drugs and we knew that you know, the polio virus causes polio, and that this is a type of disease.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And no where could I find information that suggested that the polio vaccine actually prevents polio?",
                    "label": 1
                },
                {
                    "sent": "I mean really come on this is this is actually what made Jonas Salk important.",
                    "label": 0
                },
                {
                    "sent": "So ah.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This point my beautiful crystal.",
                    "label": 0
                },
                {
                    "sent": "Feels a lot like rock candy an even worse.",
                    "label": 0
                },
                {
                    "sent": "It feels like more of a semantic swizzle stick.",
                    "label": 0
                },
                {
                    "sent": "And this is the part of the talk where I'm actually like, really depressed.",
                    "label": 0
                },
                {
                    "sent": "But the good part is that your community sort of has really interesting things to say.",
                    "label": 0
                },
                {
                    "sent": "And I hear Jim Hendler.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Saying, hey, a little semantics goes a long way.",
                    "label": 1
                },
                {
                    "sent": "And this is like a Ray of sunshine.",
                    "label": 0
                },
                {
                    "sent": "There's a bit of hope.",
                    "label": 0
                },
                {
                    "sent": "And I have this picture in my head as an economist of what this actually means.",
                    "label": 0
                },
                {
                    "sent": "And ice.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Stay cool.",
                    "label": 0
                },
                {
                    "sent": "I add some more semantics.",
                    "label": 0
                },
                {
                    "sent": "I get a bunch of utility out of it.",
                    "label": 0
                },
                {
                    "sent": "And this is all like redeeming.",
                    "label": 0
                },
                {
                    "sent": "I could, I can see my way clear to how knowledge graphs work and we achieve the scale that's necessary and we can build all sorts of cool things on it.",
                    "label": 0
                },
                {
                    "sent": "When I step back and I think to myself, actually Jim may have been saying something else.",
                    "label": 0
                },
                {
                    "sent": "As an economist, I say.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Epsilon is greater than 0.",
                    "label": 0
                },
                {
                    "sent": "You know, so hey, you know any semantics, some semantics, the littlest amount of semantic is was so much better than no semantics.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that doesn't help, OK?",
                    "label": 0
                },
                {
                    "sent": "And then you know, I actually wake up in the middle of the night.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I think maybe this is the way it actually works, right?",
                    "label": 0
                },
                {
                    "sent": "You know, yeah, sure you know some semantics is better than none, but you have to have all bunch of semantics before you get any sort of noticeable return out of it, and you just have to keep piling on the semantics.",
                    "label": 0
                },
                {
                    "sent": "And it's like holy cow, OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I I'm willing to sort of play through this model.",
                    "label": 0
                },
                {
                    "sent": "OK, this is this is like there's hope at the end of the tunnel here, but I think this is.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is my real problem when I think about sort of being a part of the Knowledge Graph schema team.",
                    "label": 0
                },
                {
                    "sent": "That is that I'm trying to figure out constantly what the net present value of knowledge is.",
                    "label": 0
                },
                {
                    "sent": "I'm trying to figure out what my return tomorrow will be from the investment that I'm making today in semantics, and it turns out that we just really don't have a good way as a community of talking about this.",
                    "label": 0
                },
                {
                    "sent": "And I think this is really kind of troubling.",
                    "label": 0
                },
                {
                    "sent": "I think we need to spend some time thinking about how we measure these things so that we can do these types of calculations, and I think the reason that it's so important is because I think about all of the things.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The Knowledge graph could contain, right.",
                    "label": 0
                },
                {
                    "sent": "There are facts about things.",
                    "label": 0
                },
                {
                    "sent": "This is sort of the bread and butter of free basing knowledge graph, right?",
                    "label": 0
                },
                {
                    "sent": "I know when Jane Austen was born, but you know, then there's also sort of all of the relations between things in the world.",
                    "label": 1
                },
                {
                    "sent": "I know that you know, if you talk to me about a fictional story, I know that it probably has characters.",
                    "label": 0
                },
                {
                    "sent": "But then there's a lot of other sort of information out there.",
                    "label": 0
                },
                {
                    "sent": "Things like, you know, everybody knows phonographs make sound.",
                    "label": 0
                },
                {
                    "sent": "Knowledge Graph has no idea.",
                    "label": 0
                },
                {
                    "sent": "There's a bunch of locale specific knowledge.",
                    "label": 0
                },
                {
                    "sent": "Hey, here's a little tip for you if you're flying through Boston spending some time there.",
                    "label": 0
                },
                {
                    "sent": "If you order regular coffee, you may be surprised.",
                    "label": 0
                },
                {
                    "sent": "It just comes with cream.",
                    "label": 0
                },
                {
                    "sent": "You know it's just the way the world works in Boston.",
                    "label": 0
                },
                {
                    "sent": "And then there's a bunch of like social knowledge, right?",
                    "label": 0
                },
                {
                    "sent": "That's very sort of specific to sort of how we all behave in society.",
                    "label": 0
                },
                {
                    "sent": "Hey, if you're going to cough, you should probably cover your mouth.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I think there's much more so.",
                    "label": 0
                },
                {
                    "sent": "I'm left wondering what it is that we should actually invest in.",
                    "label": 1
                },
                {
                    "sent": "What kinds of knowledge, how much knowledge, all of these things are really important questions.",
                    "label": 0
                },
                {
                    "sent": "So when I think about this, I think about sort of all the things that Knowledge Graph doesn't have.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You know an identify this sort of notion that.",
                    "label": 0
                },
                {
                    "sent": "The idea that the polio vaccine prevents polio is something that we haven't properly encoded, and I think to myself, you know the thing that I need to know is something about vaccines, right?",
                    "label": 0
                },
                {
                    "sent": "I knew that this thing was a vaccine.",
                    "label": 0
                },
                {
                    "sent": "I should know something more about vaccines, because once I know that, then I know something about sort of all of the.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Things that are vaccines and so it's kind of interesting, right?",
                    "label": 0
                },
                {
                    "sent": "This is what typically is identified as common sense knowledge, and I think this is kind of amusing.",
                    "label": 1
                },
                {
                    "sent": "Statement and I'm a little bit afraid of sort of why we call it this and why we've actually decided to classify this knowledge as common sense.",
                    "label": 0
                },
                {
                    "sent": "I think what's interesting about it is that this is all the stuff that isn't notable.",
                    "label": 0
                },
                {
                    "sent": "Right, this is the stuff that isn't going to get the Wikipedia article.",
                    "label": 0
                },
                {
                    "sent": "This is the stuff that everybody knows is sort of context background knowledge.",
                    "label": 0
                },
                {
                    "sent": "And you know, so hey, it's not that exciting.",
                    "label": 0
                },
                {
                    "sent": "So why are we actually going to bother included?",
                    "label": 0
                },
                {
                    "sent": "Turns out that this is the stuff that makes the whole world work.",
                    "label": 0
                },
                {
                    "sent": "This is what makes us as humans understand stuff so.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think it's really sort of a misnomer to call it common sense, and I think in fact we've done ourselves a huge disservice classifying this as common sense.",
                    "label": 0
                },
                {
                    "sent": "This is a little bit like, you know, classifying it this way so that we get the Douglas Adams.",
                    "label": 0
                },
                {
                    "sent": "It's somebody elses problem, so we'll sort of dispatch that to some other group.",
                    "label": 0
                },
                {
                    "sent": "They'll worry about that at some other point in the future will go on, and we'll do the really notable important semantic stuff.",
                    "label": 0
                },
                {
                    "sent": "Importantly, what we should call this is important sense.",
                    "label": 0
                },
                {
                    "sent": "Hey, this is the kind of stuff that people should go out and do a bunch of research on and we should actually.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sort of build corpuses of.",
                    "label": 0
                },
                {
                    "sent": "And we can build a lot of really interesting things around it.",
                    "label": 0
                },
                {
                    "sent": "This is all of the stuff that hasn't been written down that I think needs to be written down.",
                    "label": 1
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sociologists have a really interesting way of talking about this.",
                    "label": 0
                },
                {
                    "sent": "There's this idea of sort of like, you know, the consensual reality.",
                    "label": 0
                },
                {
                    "sent": "All of the things that we sort of understand by being a society and communicating with one another, such that I just assume that you know these things an so these are all the common interpretations.",
                    "label": 0
                },
                {
                    "sent": "These are all the short shared views of what it is that people actually do.",
                    "label": 1
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I think again, it's not really the social stock of knowledge.",
                    "label": 0
                },
                {
                    "sent": "Is is the locale specific stock of knowledge.",
                    "label": 1
                },
                {
                    "sent": "This is all of the things that people in different locales.",
                    "label": 0
                },
                {
                    "sent": "And when I mean locales, I mean sort of like the extensive idea of language and location and culture.",
                    "label": 0
                },
                {
                    "sent": "These are the things that we need to know about.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So have in mind.",
                    "label": 0
                },
                {
                    "sent": "This idea that we should really have a much better way of expressing things like class level attributes.",
                    "label": 1
                },
                {
                    "sent": "And in programming languages you would think of this as everything that is a static number, right?",
                    "label": 0
                },
                {
                    "sent": "This object definition.",
                    "label": 0
                },
                {
                    "sent": "Causes me to sort of like have all of these things and that's true for the class.",
                    "label": 0
                },
                {
                    "sent": "I don't have to worry about the instances because they just get it for free.",
                    "label": 0
                },
                {
                    "sent": "Another way of sort of thinking about this is that.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I want the abstract methods right.",
                    "label": 1
                },
                {
                    "sent": "I want the things that I should know about these classes that my application is actually going to deal with, right?",
                    "label": 0
                },
                {
                    "sent": "That's the level at which the implementation is actually going to take place in programming languages.",
                    "label": 0
                },
                {
                    "sent": "You might think of this as interfaces, right?",
                    "label": 0
                },
                {
                    "sent": "If you're going to deal with this class, you need to go and implement this so that I know that you know how to deal with this piece of information, and you do that at the class level.",
                    "label": 0
                },
                {
                    "sent": "You don't do that at the instance level.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So from this perspective, really what I'm talking about is developing an API for the real world, and that is that I want a way of taking all the human requests to these systems to these applications, and I want to be able to encode them.",
                    "label": 1
                },
                {
                    "sent": "In such a way that I can actually find the resources in my system that know how to deal with that, and similarly all of those resources needed to be encoded in the same way.",
                    "label": 0
                },
                {
                    "sent": "Right, so that I can match these two things up.",
                    "label": 0
                },
                {
                    "sent": "This is the thing that they're looking for.",
                    "label": 0
                },
                {
                    "sent": "This is the interface that I'm actually going to connect with.",
                    "label": 0
                },
                {
                    "sent": "I bind these two things together at that interface.",
                    "label": 0
                },
                {
                    "sent": "This is like standard CSS pattern stuff, right?",
                    "label": 0
                },
                {
                    "sent": "I mean, we expect all of our undergraduates to understand this, but I think we haven't stepped back and thought about.",
                    "label": 0
                },
                {
                    "sent": "Sort of like how are people actually going to use these giant knowledge resources?",
                    "label": 0
                },
                {
                    "sent": "What do we really mean?",
                    "label": 0
                },
                {
                    "sent": "My semantics?",
                    "label": 0
                },
                {
                    "sent": "How do we mean that an application understands anything?",
                    "label": 0
                },
                {
                    "sent": "I mean, I think this is in some sense our community's notion of common sense, right?",
                    "label": 0
                },
                {
                    "sent": "We all just assume that we've thought about this.",
                    "label": 0
                },
                {
                    "sent": "Of course, that's what we're doing, but I think we actually need to step back and say, well, how do you do that?",
                    "label": 0
                },
                {
                    "sent": "How do you do that practically?",
                    "label": 0
                },
                {
                    "sent": "Because.",
                    "label": 0
                },
                {
                    "sent": "That's how applications get built.",
                    "label": 0
                },
                {
                    "sent": "So fab.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Leslie, I think actually knowledge graphs are these API's.",
                    "label": 0
                },
                {
                    "sent": "I think we just haven't sort of continued to move them forward enough to fulfill this sort of full story.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here's what I have in mind.",
                    "label": 0
                },
                {
                    "sent": "You tell me that I have an electric teapot.",
                    "label": 0
                },
                {
                    "sent": "I want to know what the method signatures are for electric teapots.",
                    "label": 0
                },
                {
                    "sent": "I want to know that they can heat things.",
                    "label": 0
                },
                {
                    "sent": "More importantly, I think it would be actually nice if you told me that they specifically heat water.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mr Hey, it keeps things too.",
                    "label": 0
                },
                {
                    "sent": "We have something in common.",
                    "label": 0
                },
                {
                    "sent": "There's a class of things that it heats, and those are called baked goods, and we understand what that class of baked goods is.",
                    "label": 0
                },
                {
                    "sent": "We have a whole bunch of instances.",
                    "label": 0
                },
                {
                    "sent": "You can imagine getting really, really fancy, right, so that you could say, well, you know this toaster.",
                    "label": 0
                },
                {
                    "sent": "It actually resides in the kitchen.",
                    "label": 0
                },
                {
                    "sent": "So if you're looking for this thing that can heat baked goods, you probably want to look in the kitchen, and you know you have to have electricity.",
                    "label": 0
                },
                {
                    "sent": "It's not too useful when you're camping.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I can imagine doing this for all of the concepts that we have in the Knowledge graph, right?",
                    "label": 0
                },
                {
                    "sent": "I would really like to know that what we mean by a Bell is something that can be wrong.",
                    "label": 0
                },
                {
                    "sent": "You know, planes fly.",
                    "label": 0
                },
                {
                    "sent": "That's that's actually like useful information that is not encoded really anywhere in knowledge graph and yet kind of important, because if I actually understand what it means to fly, then I have some idea.",
                    "label": 0
                },
                {
                    "sent": "You know that planes might move at a certain speed.",
                    "label": 0
                },
                {
                    "sent": "I might also understand that even though I could get to the coffee shop down the block really fast.",
                    "label": 0
                },
                {
                    "sent": "If I could take a plane, it's actually not too practical because planes actually move from very specific points to points, whereas you know walking.",
                    "label": 0
                },
                {
                    "sent": "It's much more diverse and where it can go.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Similarly, I would love to sort of have the inverse available, which is, you know, hey, what are all the things that you can actually do with these concepts?",
                    "label": 1
                },
                {
                    "sent": "Knives cut very useful.",
                    "label": 0
                },
                {
                    "sent": "You can fasten things together with a stapler.",
                    "label": 0
                },
                {
                    "sent": "And this concordance between sort of like all of these concepts, and all of the things that you can do.",
                    "label": 1
                },
                {
                    "sent": "For his largest knowledge graph is we don't have it.",
                    "label": 0
                },
                {
                    "sent": "And I keep looking around and I actually can't find this corpus.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, blender is wow.",
                    "label": 0
                },
                {
                    "sent": "They're actually pretty diverse.",
                    "label": 0
                },
                {
                    "sent": "You can do all sorts of strange things with them.",
                    "label": 0
                },
                {
                    "sent": "You can chop solid substances, and I think the really important part is that you may be thinking, oh, actually, I've heard this story before.",
                    "label": 0
                },
                {
                    "sent": "We have some sort of colossally large semantic systems that can do all of this fancy reasoning, and I'm not talking about that.",
                    "label": 0
                },
                {
                    "sent": "OK, I'm not talking about inference.",
                    "label": 0
                },
                {
                    "sent": "I don't want to know what happens to the thing in the blender when I actually run the CHOP method.",
                    "label": 0
                },
                {
                    "sent": "What I really want to be able to do is just describe to you that what a blender does is chop.",
                    "label": 0
                },
                {
                    "sent": "Right, because if you think about sort of like getting a recipe.",
                    "label": 0
                },
                {
                    "sent": "And the recipe tells you that you need to chop this solid substance depending on sort of like the level at which it's being chopped, you may say to yourself what can do that and it would be really nice to just know that I should be telling you that's a blender.",
                    "label": 0
                },
                {
                    "sent": "I don't have to tell you what happens to the stuff afterwards, the recipe takes care of that.",
                    "label": 0
                },
                {
                    "sent": "That's the other input to the system.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to do sort of all that reasoning.",
                    "label": 0
                },
                {
                    "sent": "I'm going to let the application determine what level this has to be implemented at.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here's the problem.",
                    "label": 0
                },
                {
                    "sent": "I said I can't find this corpus and where does this knowledge come from?",
                    "label": 1
                },
                {
                    "sent": "And all of this stuff seems like common sense, and I think this is the curious thing, right?",
                    "label": 1
                },
                {
                    "sent": "Folks, there is no Wikipedia for this, right?",
                    "label": 0
                },
                {
                    "sent": "There is no resource that we can just go and sort of appropriate and rain for all of its semantic worth.",
                    "label": 0
                },
                {
                    "sent": "An I don't know.",
                    "label": 0
                },
                {
                    "sent": "Many years ago I was at a triple AI workshop talking about semantics and things like that an it was focused on Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "And I got up, and as usual I said the most unpopular thing which is, I think Wikipedia is training wheels, right?",
                    "label": 0
                },
                {
                    "sent": "Wikipedia was a way for us to actually get started.",
                    "label": 0
                },
                {
                    "sent": "It is not the end, and it's not something that we can rely on for everything.",
                    "label": 0
                },
                {
                    "sent": "It's a good seed on which we can grow the crystal, but all of the things that I'm talking about are not notable, right?",
                    "label": 0
                },
                {
                    "sent": "Nobody is going to actually sit and write the encyclopedic article for, you know, chopping things in blenders.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "You know, I start looking.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Around I keep thinking so where am I going to get this information?",
                    "label": 0
                },
                {
                    "sent": "How am I going to build this?",
                    "label": 0
                },
                {
                    "sent": "And I think it's actually going to be some form of crowdsourcing, right?",
                    "label": 0
                },
                {
                    "sent": "We're going to have to go out and collect this information at scale from a lot of people and a lot of different resources.",
                    "label": 0
                },
                {
                    "sent": "And we're going to have to sort of build this together.",
                    "label": 0
                },
                {
                    "sent": "What I do find is interesting is that when you go and sort of look at definitions or the articles in Wikipedia, they tend to have all of this stuff encoded in language.",
                    "label": 0
                },
                {
                    "sent": "I'm sure this is the attraction for NLP, right?",
                    "label": 0
                },
                {
                    "sent": "Hey, no problem.",
                    "label": 0
                },
                {
                    "sent": "I look up vaccine in the very first thing it tells me is that it prevents diseases.",
                    "label": 0
                },
                {
                    "sent": "That's really cool.",
                    "label": 0
                },
                {
                    "sent": "When I go and look up Blender.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It turns out that they tell me that they chop things.",
                    "label": 0
                },
                {
                    "sent": "Wow, all of the things that I've been looking for are actually encoded in these dictionary glosses.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So maybe dictionaries are an approximation.",
                    "label": 1
                },
                {
                    "sent": "Maybe that's a good place to start to grow this seed, and I think you know this is to me.",
                    "label": 0
                },
                {
                    "sent": "A really interesting story.",
                    "label": 0
                },
                {
                    "sent": "Dictionaries have been around for a really long time right on in there sort of current modern form where we get sort of nice things like the idea that you should use things like different genus and differentia to define the terms.",
                    "label": 0
                },
                {
                    "sent": "We're talking about 200 years of sort of refining this resource.",
                    "label": 0
                },
                {
                    "sent": "Lexicographers have gotten really good at this.",
                    "label": 0
                },
                {
                    "sent": "Many of them have the idea that there is a defining vocabulary.",
                    "label": 0
                },
                {
                    "sent": "There's a set of terms out there on which everything else will be defined, and it's really cool.",
                    "label": 0
                },
                {
                    "sent": "It's really sort of generative in that sense, right?",
                    "label": 0
                },
                {
                    "sent": "You start with you know 2 to 3000 concepts for in English, and I can give you sort of the whole oedi.",
                    "label": 1
                },
                {
                    "sent": "There are even sort of, you know, sort of step down resources.",
                    "label": 0
                },
                {
                    "sent": "These multi layer dictionaries that are used for language learners where you start with about 400 terms and you can bootstrap the next 2000 so that I can get you to the OD.",
                    "label": 0
                },
                {
                    "sent": "So this is very attractive from a semantic perspective, Ann.",
                    "label": 0
                },
                {
                    "sent": "I think it's interesting.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Get.",
                    "label": 0
                },
                {
                    "sent": "The linguists.",
                    "label": 0
                },
                {
                    "sent": "Have actually spent a lot of time thinking about this right?",
                    "label": 0
                },
                {
                    "sent": "How is it that language communicates semantics so you have this notion of semantic primes, right?",
                    "label": 0
                },
                {
                    "sent": "The Meta language on which all other languages are defined.",
                    "label": 0
                },
                {
                    "sent": "This is how meaning is pulled out of language semantic explications this is the idea that you know there are certain constructions out there which can be defined in terms of these semantic primes.",
                    "label": 0
                },
                {
                    "sent": "When I think about this.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As an application developer and I have to say that's the thing that really excites me about knowledge.",
                    "label": 0
                },
                {
                    "sent": "Graphs is being able to write really interesting applications.",
                    "label": 0
                },
                {
                    "sent": "I think you know I start up there with sort of the source code that we're all familiar with, and I run it through the compiler, and the compiler produces assembly and then the assembler runs and turns into the machine code and somewhere at a very very low level.",
                    "label": 0
                },
                {
                    "sent": "Microcode the code that's running inside the processor that I didn't actually have access to is bound to very specific actions in hardware, and that's actually how the system works and I'm thinking to myself what is the microcode here?",
                    "label": 0
                },
                {
                    "sent": "What things can I do as a developer and go implement those interfaces such that I get the behavior for my application that I want?",
                    "label": 0
                },
                {
                    "sent": "Because the semantics at a higher level just follow from that.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I think the really critical thing is to start thinking about how you build applications.",
                    "label": 0
                },
                {
                    "sent": "There are a lot of applications that are semantically enabled, and I think that's a curious thing.",
                    "label": 0
                },
                {
                    "sent": "When I hear sort of people wondering sort of what semantic applications are out there.",
                    "label": 0
                },
                {
                    "sent": "I mean certainly you have all of the examples of what Google is doing with Knowledge Graph, but you also sort of think about all of the Web 2.0 ish kind of.",
                    "label": 0
                },
                {
                    "sent": "You know, they seem like there are very sort of siloed applications, But it turns out that many of them are very horizontal in their knowledge right?",
                    "label": 0
                },
                {
                    "sent": "These are taking in reviews of all sorts of different things.",
                    "label": 0
                },
                {
                    "sent": "And and the critical part is that I want to be able to write these applications at scale, right?",
                    "label": 1
                },
                {
                    "sent": "If I have to hand code everything if I have to have a whole bunch of wrote queries.",
                    "label": 0
                },
                {
                    "sent": "Or I require the common sense knowledge of my humans to browse through these application.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And yeah, this is not going to work.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm thinking maybe these dictionaries are a good place to start.",
                    "label": 0
                },
                {
                    "sent": "So where are these artifacts?",
                    "label": 1
                },
                {
                    "sent": "Where are these sort of semantic primitives that we as a community have gone off and said, yeah, these are the things on which you know, sort of.",
                    "label": 0
                },
                {
                    "sent": "You should be able to bootstrap the rest of the semantic understanding, and I can't find them and I'm I'm shocked that I'm surprised and I asked my linguist friends and they say, well, actually you know the concordances between nouns and verbs.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it seems like a really good idea, but you know, actually, there isn't one.",
                    "label": 0
                },
                {
                    "sent": "You know where are these dictionaries that are, you know, machine readable such that it can get access to the genus and differential so that I can actually find the defining concepts and actually use them to bootstrap my semantics.",
                    "label": 0
                },
                {
                    "sent": "And and the reference.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that I can find this a really surprising so Amsler wrote this PhD thesis in 1980 using a machine readable dictionary that was developed in 1970.",
                    "label": 0
                },
                {
                    "sent": "And really what it was was the typeset version of the Merriam Webster Pocket Dictionary.",
                    "label": 0
                },
                {
                    "sent": "They went through and they cleaned it up and he crowdsourced it to all of his graduate student friends and he said I need you to encode the genus and differentia in this so that I can actually do some interesting things and try to induce hierarchies from this dictionary.",
                    "label": 0
                },
                {
                    "sent": "And you know what?",
                    "label": 0
                },
                {
                    "sent": "It worked, it was really cool.",
                    "label": 0
                },
                {
                    "sent": "This is the most amazing thesis that I've read.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately he was using a licensed dictionary.",
                    "label": 0
                },
                {
                    "sent": "There is no longer available and the artifact is long gone, but he was operating at a level of about.",
                    "label": 0
                },
                {
                    "sent": "Can 10,000 think he had about 30,000 total concepts in his corpus and it said it is defined as an unprecedented size?",
                    "label": 1
                },
                {
                    "sent": "If we'd started in 1980, we might actually be at the scale that we need to be.",
                    "label": 0
                },
                {
                    "sent": "There's another example, which is the Gelish English Dictionary and Gelish is this sort of semantic way of describing big machines and how they fit together and different taxonomies of these machines and they bothered.",
                    "label": 0
                },
                {
                    "sent": "They step back and they said, you know, actually we have sort of a core vocabulary here on which all of the other things are defined and we can define them in terms of genus and differential, and they made this machine accessible and they said, you know, we could actually extend this to do a little bit of simple English.",
                    "label": 0
                },
                {
                    "sent": "And it's a really cool idea.",
                    "label": 0
                },
                {
                    "sent": "And again, they're talking about sort of like 30,000 terms in this thing, and that was ten years ago.",
                    "label": 0
                },
                {
                    "sent": "And that's it.",
                    "label": 0
                },
                {
                    "sent": "That's as far as I can find.",
                    "label": 0
                },
                {
                    "sent": "Maybe people know about others that I am not aware of, but I have gone looking for this and I've asked a lot of people and nobody can sort of help me lay hands on this type of system.",
                    "label": 0
                },
                {
                    "sent": "That's actually going to help us glue all the knowledge graphs together.",
                    "label": 0
                },
                {
                    "sent": "So I want to go back and say look.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "10 years ago, was this really sort of exciting moment in time where a lot of information was written down and these base Maps were drawn on which we can actually do really interesting things and build up much better semantics.",
                    "label": 0
                },
                {
                    "sent": "And once we do that, we actually build applications and we learn how these systems work and we refine those systems and it moves us pretty far forward.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I'm concerned that you know.",
                    "label": 0
                },
                {
                    "sent": "This other area that I want to go into is like infinitely rich.",
                    "label": 0
                },
                {
                    "sent": "The other area is just plain old big.",
                    "label": 0
                },
                {
                    "sent": "This is like infinite and I'm not sure sort of what things we should focus on.",
                    "label": 0
                },
                {
                    "sent": "So I want to propose to the Richard Scary test.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ann, I discovered that even though these appear in a number of different languages, and they're not as well internationally known, these are children's books which are really sort of intricate pictures that describe sort of activities in everyday life and situations in everyday life and things that you will encounter in everyday life.",
                    "label": 0
                },
                {
                    "sent": "And they really sort of form this great basis of discussion with kids about sort of what goes on in the world, and they're really fun.",
                    "label": 0
                },
                {
                    "sent": "There is incredible detail in them.",
                    "label": 0
                },
                {
                    "sent": "They show you sort of like, you know how the pipes go through walls and are connected to sewer systems and.",
                    "label": 0
                },
                {
                    "sent": "How coal is mined underground and refined in such a way that it can be burned in turbines and create electricity then and then transmitted down the transmission grid and the only problem with these book?",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is that you know they have all of these really interesting experiences, but we need to make sure that the thing that we don't encode is that pigs are firemen.",
                    "label": 0
                },
                {
                    "sent": "OK, that's just that's the only caveat on this Richard scale, but I think if we build systems that can actually explain, describe what's going on in these books, we are well on our way to having sort of good semantic understanding.",
                    "label": 0
                },
                {
                    "sent": "So according to the.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "PD analysis there are 25,000,000.",
                    "label": 0
                },
                {
                    "sent": "Books that have ever been written and we can go out and we can actually add information to all 25 million of those.",
                    "label": 0
                },
                {
                    "sent": "About the author and illustrator and the publisher of the characters.",
                    "label": 0
                },
                {
                    "sent": "In the additions and the publication dates.",
                    "label": 0
                },
                {
                    "sent": "And there's a whole bunch more we can do that 25 million times.",
                    "label": 0
                },
                {
                    "sent": "Or we can focus on the 1 console.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The book.",
                    "label": 0
                },
                {
                    "sent": "And we can encode some information that says, you know.",
                    "label": 0
                },
                {
                    "sent": "Actually people write books and people read books and books are typically collections of paper that are bound together in libraries actually store these books.",
                    "label": 1
                },
                {
                    "sent": "One concept.",
                    "label": 0
                },
                {
                    "sent": "Just a few things that we need to encode, and all of a sudden we understand something about 25 million entities out there.",
                    "label": 0
                },
                {
                    "sent": "I don't know, but I.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think this is actually maybe what Jim was getting at right?",
                    "label": 0
                },
                {
                    "sent": "We find the things where we get a lot of leverage or we go off and we encode a little bit of information and all of a sudden we learn about huge swaths of the real world.",
                    "label": 0
                },
                {
                    "sent": "So I think if we do this.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We're actually going to be sort of well on our way to growing a really beautiful crystal.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Several times during the talk you said, well, there's nothing out there like this like knowledge interface slots, right?",
                    "label": 0
                },
                {
                    "sent": "So there's one thing which is unpopular, or for several reasons, but we have psych right?",
                    "label": 0
                },
                {
                    "sent": "As for me, the only trial which is worth exploring and which actually works.",
                    "label": 0
                },
                {
                    "sent": "I mean under certain conditions, but still works right.",
                    "label": 0
                },
                {
                    "sent": "It has the concept of context and.",
                    "label": 0
                },
                {
                    "sent": "Diamond everything else.",
                    "label": 0
                },
                {
                    "sent": "OK, it's manually mates fine, but how would you see my?",
                    "label": 0
                },
                {
                    "sent": "I mean this old AI experiment which still is alive.",
                    "label": 0
                },
                {
                    "sent": "Read in the context of Freebase, which is well is missing upper level ontology in this form right?",
                    "label": 0
                },
                {
                    "sent": "Our DFS minus minus right?",
                    "label": 0
                },
                {
                    "sent": "I mean it's sort of like the antithesis of psych.",
                    "label": 0
                },
                {
                    "sent": "I may have caught my illusion to psych.",
                    "label": 0
                },
                {
                    "sent": "I didn't want to actually call it out specifically.",
                    "label": 0
                },
                {
                    "sent": "To me.",
                    "label": 0
                },
                {
                    "sent": "Psych was on the right track, but it got tangled up.",
                    "label": 0
                },
                {
                    "sent": "And that angle is that it spent sort of a lot of effort worrying about that inference, and I understand why it's really attractive, right?",
                    "label": 0
                },
                {
                    "sent": "I can just sort of like make this whole sort of machine come to life.",
                    "label": 0
                },
                {
                    "sent": "I don't have those aspirations.",
                    "label": 0
                },
                {
                    "sent": "OK, because I think the critical thing is before you sort of go down that Rd.",
                    "label": 0
                },
                {
                    "sent": "You need the interface you need to say I actually understand all of the methods for these concepts, and that's actually a huge undertaking.",
                    "label": 0
                },
                {
                    "sent": "Much larger than site.",
                    "label": 0
                },
                {
                    "sent": "Now, I agree that went out and sort of captured a lot of like really core ideas, right?",
                    "label": 0
                },
                {
                    "sent": "You know, physical concepts and measurement units and all of that stuff.",
                    "label": 0
                },
                {
                    "sent": "And it is very powerful in that sense.",
                    "label": 0
                },
                {
                    "sent": "And I actually I go back and I.",
                    "label": 0
                },
                {
                    "sent": "Play with psych occasionally and I very attracted to it.",
                    "label": 0
                },
                {
                    "sent": "It's a little bit of a siren song for me, but I think that the critical part is, you know when you start getting into things like micro theories and you start having to like partition your world because that angle is getting too hard to actually make work.",
                    "label": 0
                },
                {
                    "sent": "That's maybe the point at which we should like stop and step back a little bit and say look, let's just actually try to get the interface right and will let the applications go and do those implementations for now.",
                    "label": 0
                },
                {
                    "sent": "And maybe if we get that level right and that's working pretty well, and we discovered that all of these applications are sort of like manageable and they could potentially work together, then we should pursue much more of a psych like approach.",
                    "label": 0
                },
                {
                    "sent": "And I have an observation, a question and a recommendation, please.",
                    "label": 0
                },
                {
                    "sent": "So my observation is that any human child by the age of seven probably has a more complete knowledge graph in their mind then we as a community can build and dressing.",
                    "label": 0
                },
                {
                    "sent": "No, it's great.",
                    "label": 0
                },
                {
                    "sent": "It's great because because.",
                    "label": 0
                },
                {
                    "sent": "The process by which that happens happens all the time, and in a way that gives us a blueprint to think about that yes, so so my observation is that's my observation.",
                    "label": 0
                },
                {
                    "sent": "My question is why aren't we doing that and how?",
                    "label": 0
                },
                {
                    "sent": "Maybe as a community we can think about leveraging cognitive science and human development and language learning these elements that that are studied and are available at some level.",
                    "label": 0
                },
                {
                    "sent": "So the question is why aren't we doing that?",
                    "label": 0
                },
                {
                    "sent": "My recommendation is.",
                    "label": 0
                },
                {
                    "sent": "Have you heard of the work of Andrew Gordon and Jerry Hobbs, who are colleagues of mine at ISI who have written a Magnum Opus over the last 20 years describing a whole bunch of machine readable human machine readable machine processing based structures, semantic structures for common sense psychology?",
                    "label": 0
                },
                {
                    "sent": "They just published a book this year and so if you haven't seen that, I would definitely recommend it.",
                    "label": 0
                },
                {
                    "sent": "'cause it's brilliant, I actually don't know the book.",
                    "label": 0
                },
                {
                    "sent": "I know a little bit about the work and I think your observation is dead on and I believe that in some sense.",
                    "label": 0
                },
                {
                    "sent": "You're developing the same call that I am hoping to incent here, which is that there's there's a lot of hints of how this could actually play out, and things that we could go look at to learn from.",
                    "label": 0
                },
                {
                    "sent": "I don't know that we need to sort of like recapitulate psychology.",
                    "label": 0
                },
                {
                    "sent": "I'm come from that background and I don't necessarily sort of think that you know the machines need to actually do that version of it, but I think there's a lot to be learned about.",
                    "label": 0
                },
                {
                    "sent": "Sort of how it takes place, and I think this is actually why.",
                    "label": 0
                },
                {
                    "sent": "When I talk to my colleagues in NLP, they're actually thinking about these things.",
                    "label": 0
                },
                {
                    "sent": "They're thinking about these things in ways that I don't feel like my group and my ecosystem has thought about them, so I think that's the other side of the coin.",
                    "label": 0
                },
                {
                    "sent": "Thank you for this wonderful and interesting talk.",
                    "label": 0
                },
                {
                    "sent": "What I am thinking about isn't there to kind of philosophical problem.",
                    "label": 0
                },
                {
                    "sent": "What you rise because what we call knowledge when it comes to machine.",
                    "label": 0
                },
                {
                    "sent": "I think it's not the same when it comes to human beings.",
                    "label": 0
                },
                {
                    "sent": "So when we encode knowledge is every time a kind of abstraction that kind of model and what I had to feel you are thinking about is.",
                    "label": 0
                },
                {
                    "sent": "About encoding all this very complex and not.",
                    "label": 0
                },
                {
                    "sent": "Not variable in that models things, but thinking about this is it.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's even not possible to encode all the things.",
                    "label": 0
                },
                {
                    "sent": "Yes, it may not be, and I think that is the challenge.",
                    "label": 0
                },
                {
                    "sent": "That's before.",
                    "label": 0
                },
                {
                    "sent": "I think the really critical part though, is that I'm not suggesting at all that this needs to be human knowledge.",
                    "label": 0
                },
                {
                    "sent": "What I'm really suggesting is that we as humans are the ones that benefit from these applications, and so we need to understand, sort of like how our knowledge and the machines knowledge interfaces, right?",
                    "label": 0
                },
                {
                    "sent": "And that's really why I think these types of encodings are actually really important at interface level.",
                    "label": 0
                },
                {
                    "sent": "I certainly don't think to sort of like my prior comment.",
                    "label": 0
                },
                {
                    "sent": "I don't think that this is a story about sort of like how machines do human knowledge and thinking and reasoning or anything like that, but that interface needs to be sort of very clear because that's the level at which we actually care about what the machines are doing.",
                    "label": 0
                },
                {
                    "sent": "That I would like to hear a little bit about the relevance of the knowledge graph for the Google Enterprise, so you haven't really talked about that.",
                    "label": 0
                },
                {
                    "sent": "I actually I'm hoping that I address that a bit by describing to you some of the features that you have probably encountered on your journey to this conference, which are actually built on knowledge Graph and they started from a very very simple core, right?",
                    "label": 0
                },
                {
                    "sent": "And I think the critical part is that you know Google said that one of the big transitions in sort of using the metaweb underpinning is that all of a sudden they were going from sort of text string.",
                    "label": 0
                },
                {
                    "sent": "IR retrieval to understanding these things as real objects, right that actually had sort of interactions, and they could be bound in certain interesting ways, and that's prevalent all over Google, right?",
                    "label": 0
                },
                {
                    "sent": "Every time.",
                    "label": 0
                },
                {
                    "sent": "Many, many features that you are using everyday YouTube right?",
                    "label": 0
                },
                {
                    "sent": "Their understanding of what's going on in that video is based on the fact that they actually have found these things to concepts in the Knowledge Graph and they understand what the relationships between those things are.",
                    "label": 0
                },
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "All over the ecosystem, and to me, that's what's really exciting.",
                    "label": 0
                },
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "In you so prominently and so many of you interact with these things everyday and you don't actually know that that's actually what's making this experience possible, and in some sense, to me, that's sort of like the right level at which semantics is operating.",
                    "label": 0
                },
                {
                    "sent": "It's just sort of become transparent, invisible.",
                    "label": 0
                },
                {
                    "sent": "It's just enabling the experience that you want to have.",
                    "label": 0
                }
            ]
        }
    }
}