{
    "id": "eq7ixx2sqs4f2cpqrnj34xzlz6cwpt75",
    "title": "PageRank and Generic Entity Summarization for RDF Knowledge Bases",
    "info": {
        "author": [
            "Andreas Thalhammer, F. Hoffmann-La Roche Ltd",
            "Dennis Diefenbach, University Jean Monnet, St Etienne"
        ],
        "published": "July 10, 2018",
        "recorded": "June 2018",
        "category": [
            "Top->Computer Science->Big Data",
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2018_diefenbach_thalhammer_pagerank/",
    "segmentation": [
        [
            "Hello, I'm Dennis Dieffenbachia undressed Alhama.",
            "So maybe the title looks a bit scary so let us explain you a bit more what it means.",
            "So there are two things, page rank and general and entity summarization.",
            "OK. RDF knowledge bases everyone of you knows so first."
        ],
        [
            "So what is page rank over RDF graph?",
            "Did this everyone of you knows page rank so we have websites on the web and we want to give important scores to them.",
            "So websites that get a lot of incoming links should be ranked high while the other one should rank low and Arctic F graph.",
            "This is very similar context.",
            "We have a graph structure so it is our resources like this is hierarchy on discrete and so we want to compute patron scores."
        ],
        [
            "The second part was entity summarization.",
            "So what is an?"
        ],
        [
            "The summarization of our knowledge graph.",
            "So we need a knowledge graph.",
            "Here we see Vicky data and we see the entry of the Lake of Garda.",
            "So in a Vicky in a knowledge base, there are many facts about entities.",
            "For example, here we have the inflows of this.",
            "Of this Lake the counter reaches the area official website and so on.",
            "And so."
        ],
        [
            "Duty summarization would mean find between all these facts that are associated to the Lake of Garda.",
            "The top K most important one.",
            "So the task is given an entity find in a knowledge graph, some property that summarize the entity."
        ],
        [
            "And so the outline of the talk.",
            "We have four parts.",
            "The first one is to explain the relation between page rank scores and entity summarization.",
            "Becausw probably for most of you.",
            "Now it shines.",
            "Looks like 2 completely different things.",
            "In the second part, we are going to present, so it's a resource paper.",
            "Our first resource, which is page rank.",
            "RDF, which is a comment line tool to compute Pagerank scores over RDF graphs.",
            "The second resource is a summer server service to compute entity summaries over RDF knowledge bases and in the 4th part we're going to describe how we use these two resources in the domain of question answering."
        ],
        [
            "OK, so let's start from the relation between page rank scores and entity summary."
        ],
        [
            "Nation.",
            "So the idea is that there was an existing approach that was presented by Andrea Stahlhammer for entities summarization and it was working on DB Pedia.",
            "So the idea was that we wanted to extend this approach so that it doesn't work only to DPD about any other knowledge graph so that it is just."
        ],
        [
            "So let me explain briefly what the idea is that was used over the pedia.",
            "We have two faces.",
            "We have the offline phase and the online phase in the offline phase.",
            "We compute Pagerank scores.",
            "So in his work, Andreas used the link structure Wikipedia.",
            "So you look at the different Wikipedia articles, you look into the link structure and you compute Pagerank in the traditional way as it was defined for web pages.",
            "And the the particular thing in DPP?",
            "Just at each Wikipedia page corresponds to a DP pedia page.",
            "So if you compute the Pagerank scores of the Wikipedia page, is using this link structure, you also have the one.",
            "You can also assign Pagerank scores 2 DPI entity."
        ],
        [
            "And now how to compute a summary?",
            "So imagine you have a resource are you want to compute the summary of it.",
            "So what you do is you go into RDF graph, you look around and you look all the resources without associated to this resource.",
            "So imagine this is the Lake of garden.",
            "Here all the Info River and so on.",
            "And now which facts we select.",
            "So between all the resources that are associated we take the one which have the highest Pagerank score.",
            "Because we think that affects this, entities are important.",
            "Also, defects related to this entities are important, so these are exactly the facts that we should show, and we take just the K. Hayastan this we put in the entity."
        ],
        [
            "OK, so now we want to do this not only over DP pedia, but for any any knowledge graph.",
            "So the idea in this work is to present a framework to do this on generic knowledge graphs."
        ],
        [
            "OK, so first of all we need patron scores, so we need patrons crossover, RDF graphs."
        ],
        [
            "So one would think OK page rank everyone knows how to implement it.",
            "I agree it's very easy to implement it straight forward.",
            "So what is the point?",
            "The only difficult part for Page rank is to make it scaleable in time and in memory.",
            "So the."
        ],
        [
            "The to make to make this patron computation schedule in time memory, the observation was that when you compute Pagerank over a graph, you do not really need to ur eyes cause they're not needed in the algorithm.",
            "But you only need in the graph, but you only need the graph structure which is encoded into the triple."
        ],
        [
            "And so the idea is to use HTT, which is a well known format for RDF, and the reason is that it separates your eyes from the structure, so it's very suited for this task.",
            "And indexing comes for free and Moreover you have compression."
        ],
        [
            "So there is this comment line tool which is available on GitHub.",
            "It's free source code.",
            "It is licensed under the MIT License, so you can do whatever you want with it.",
            "This is it's a Java command line tool.",
            "This is roughly how it looks like, so you have an input file output file you have some.",
            "Para meters, which are more related to page rank, like the damping factor, the number of iteration and the start value, and that's roughly it.",
            "So."
        ],
        [
            "To see if this thing works, this idea works out with HTT.",
            "What we did is we compare two straightforward implementation of page rank and one using HTT, and experiment was run on Vicky data dump of the 28th September 2017.",
            "Said yes, it had 240 gigabytes or it's a large knowledge graph.",
            "2.2 billion triples and we run it in a server with quite a bit of 194 gigabytes."
        ],
        [
            "And this table showed the results.",
            "So the the table on the left is the computation time.",
            "So if we use the standard implementation, we needed 800 minutes to compute the page ranks, while when using the HTTP implementation we only needed 42.",
            "And generally so something.",
            "So we personally always have a HD copy of the data set, but if you don't have, you would have to convert into HTTP.",
            "The data set and this would be the time that you would need, so it's still worth to convert force in HCT and then computer patron scores, then compute them directly on the RDF graph and regarding memory consumption is very similar for the non HD version we needed 90 gigabytes of RAM, while when you have the file in HD you need only 18 and this is in fact where what in fact matters.",
            "I would say so the time is maybe not so important but having a 90 gigabyte server done.",
            "18 gigabyte server is much more handy."
        ],
        [
            "OK, so now I give over to Andrea Stahlhammer to answer the question.",
            "So we saw that the original approach was working on the link structure of Wikipedia.",
            "While now we are working on the RTF of Wikipedia.",
            "While now we are working on the RDF structure of the knowledge base.",
            "So the question is what is the quantitative difference between this RDF scores when we use the two approaches?",
            "OK, thanks Dennis.",
            "Hi, I'm Andreas and I'm going to focus now bit on the quality of those Patriots scores that were computed on the RDF graph.",
            "And so for that we did a small experimental set."
        ],
        [
            "So one part was like we took.",
            "We took the wiki database data set.",
            "So here is what.",
            "What is the output of the patron computation on the RDF graph?",
            "So in total we had like about 80,000,000 entities or nodes in the graph, But that's now you would say that's far more than our entities in wiki data.",
            "And it's true because in wiki data are only about 38 million at the time.",
            "Now.",
            "Now it's much more already.",
            "And that the reason for that difference is because you have like a lot of blank notes in the RDF data model of wiki data and you also have external links and this is how we get a lot of more resources.",
            "On that side and and we also computed wiki page rank on wiki data.",
            "With that anchor tool, then Kaiser Tool that uses only the Wikipedia link graph.",
            "But it doesn't do it only for one language like English.",
            "At unites all the link all the links from all languages and expresses the links in wiki data your eyes.",
            "So like this you get a pretty good coverage of the knowledge that is basically out there in all the keys.",
            "So it does it overall 200.",
            "92 languages.",
            "So and when you compute this, you get like a roughly 18 million entities.",
            "And now you see there is a difference between wiki data that has like about 40 million and then we have here the 18 million that differences because not every week article in Wiki data has articulate any link Wikipedia language, so there are there items in wiki data that do not occur in Wikipedia and this is like already a lot as you can see.",
            "As a reference measure, so here both are patron based as a reference measure we have subjective I 3D which is a click based measure.",
            "Actually that was computed by Paul Houle.",
            "And.",
            "He did this measure.",
            "Basically he normalized the language and so on, and he basically had this measure as a ranking measure with based on clicks for about 6 million entities.",
            "So now to correlate all those measures together we had to compute intersection set and that's about 4.2 million 4.3 million.",
            "So that's the intersection set.",
            "So then what you can do afterwards?"
        ],
        [
            "Is it take to normal ranking correlation measures?",
            "There is on one hand side we have Spearman's role and on the other hand we have Kendall's Tau, maybe as a short disclaimer before we look at the figures directly, both measures as humans Rowan also Kendall's Tau they have ranged from minus one to one.",
            "So as you can see already directly all the time.",
            "All the figures are positive so there's always a positive correlation.",
            "So now now let's focus as both measures also have the nice attribute that they're symmetric, so we can just focus on on this part of the triangle here.",
            "And we see directly that the page rank the two Patriot measures are strongly correlated.",
            "That was expected.",
            "Is the same measure.",
            "And that's here the output.",
            "Then you see that page rank.",
            "RDF is not as well correlated with subjective with click based measure as anchor over here so.",
            "There like we looked into the measures and also like at the top 100 and one of the main findings was that some structural elements and wiki data and data.",
            "There's no ontology definition or something like that, but there are elements that are heavily used for structuring the knowledge base, and there are entities like Mail for example, that all of a sudden and in the page rank with RDF get a huge boost compared to the on the Wikipedia link based one."
        ],
        [
            "So through the observations, so all patron measures correlate positively.",
            "So that's a very good result, and the tee box element have a really high.",
            "High ranks in the patron RDF and now you can do the difference and you could do nice analysis and as we have all the datasets online, that's that's something that everybody can do and I'm actually searching for collaboration partners on that idea.",
            "So if anybody's interested, an.",
            "And again, like what should be taken with care here is like this result should be taken with care because we used the click based measure.",
            "Here is kind of a reference, but you could argue whether the click based measure is actually a really good reference or not, so that's debatable."
        ],
        [
            "So to summarize our patron resources, we have the source code and the tool online on GitHub.",
            "You can download it, compile it all the instructions are there and we also provide already precomputed paging scores for all those knowledge bases here.",
            "So DLP, DV Pedia, Freebase, Musicbrainz Springer Nature Side Graph wiki date and wiki data and you find you find all those resources down here in this picture link.",
            "So."
        ],
        [
            "So let's move onto the summer server component, so that's.",
            "This is our second resource that we provide.",
            "And let."
        ],
        [
            "Briefly explain what it is so similar server is basically and a server component that implements a specific API that was defined in an API definition.",
            "And here we have basically the component for all those those knowledge bases that we saw just before."
        ],
        [
            "So briefly, let me explain you the API definition so their API definition is so it's really like just about the interface.",
            "So if you have a different programming language, like in Python, you can implement this API and you can interact with already programmed clients that are already existing.",
            "So."
        ],
        [
            "So let's have a brief look.",
            "The API definition consists of two components.",
            "We have a vocabulary and a restful interaction mechanism, so the vocabulary."
        ],
        [
            "She looks as follows, so in the center we have entity summary and to compute summary the API needs two mandatory parameters and those parameters are resource that needs to be summarized and the top K para meter, which is the number of facts that you want to see about this year.",
            "I then you have a couple of alternatives.",
            "How do you say?",
            "Not not mandatory parameters that are like fixed properties, the language and so on, and those can be configured automatically.",
            "So and then."
        ],
        [
            "When you do the interaction with the server, what you do is, like you say, the client says OK, I post a submarine that doesn't contain anything at this moment and actually you post a blank note because you don't know how it's actually called and you pull.",
            "You send this post request to the server.",
            "You can do this in any of this RDF serializations.",
            "Here.",
            "For brevity, we took Turtle, so it comes back from the server is like, oh you wanted the summary.",
            "I created it for you.",
            "Here's to your eye.",
            "From now on you can always look it up and this year I.",
            "And here is the summary and then you get all the facts and also rankings that are associated with this summary.",
            "From after that, the client can always call the same summary with this, with this direct UI and gets again the summary.",
            "So so this part here is optional because after the first interaction, the client, if it's smart, it can actually exchange here this year I always by itself and it doesn't need to go the full way.",
            "So basically you assume that.",
            "The client can somehow so that the server already created those summaries offline.",
            "So and with that."
        ],
        [
            "I'm heading back to."
        ],
        [
            "So Dennis will give you.",
            "A short implementation guide on the summer server.",
            "OK so we have implemented several entity summarization service for popular knowledge basis.",
            "But imagine you have your own knowledge base and you want to create now a summarization service.",
            "So what you have to do is basically two things you have.",
            "First to compute Pagerank scores over this data set and you have to save this and you have to save the page rank scores end to end and the data set itself into a sparkle endpoint and then you have to.",
            "Right tree sparkle queries so the."
        ],
        [
            "This popular query looks like this, so this is the entity we want to summarize and you in fact just retrieve the RDF label of it in a given language and note that we cannot really write this query for you.",
            "For example in Musicbrainz, not every resource has an RDF label, but it has something like a title, so you really have to write it yourself."
        ],
        [
            "The second query would given an entity do this graph traversal so it would search for every related.",
            "Entity two, yeah, every related resource to it and take also the page rank of this resource is an order them.",
            "By the Pagerank and taking the top K. And this part is for getting the labels in the corresponding language of the object.",
            "This filter here we did over Vicky data Becausw we we wanted to exclude some properties from the summary, like for example the gender because generally the Mail proper domain resource as we said before would be ranked very high, but we want not to have it appear in the summary because it's a quite trivial property."
        ],
        [
            "And finally, you have to implement this query which, given an entity and an object, has to retrieve the label of the predicate and in Vicky data.",
            "For some strange reason it's a bit complicated.",
            "OK, so."
        ],
        [
            "So.",
            "The resources are called related to the summer server are a framework to compute entity summaries, which is the summer server which you find under this GitHub link and we have web services that compute summarization's for the.",
            "Knowledge bases that you saw before OK."
        ],
        [
            "So let me now briefly describe you how you could use or how do we use these resources in the context of question answering.",
            "So."
        ],
        [
            "So where page rank scores used in a question answering system."
        ],
        [
            "So imagine you ask in a question answering system just for River.",
            "And then what you probably would expect is a natural flowing watercourse, usually freshwater flowing towards an ocean.",
            "But there are many other things that are called River in a knowledge base and this you see for example here in this did you mean functionality?"
        ],
        [
            "So you have the River as a natural water course, but you have also this painting by Ernest Lawson and.",
            "A film from 1951, so in this case page rank schools are just used to rank the different possible alternatives and to disambiguate between the entities.",
            "Another part where we use page rank scores is when the answer set has multiple answers.",
            "If the question has multiple answers, so for example, if you ask for lakes in the Pope Basin for the PO is a River in in Italy and you want to know lakes around there.",
            "So we will find many many lakes, but probably you."
        ],
        [
            "Do not want to have as a first week without the Lago Devo Bieta because nobody knows it and you want to have at the beginning the larger majority.",
            "That would be our Gallery, So patrons are typically used as it is also done in information retrieval.",
            "And."
        ],
        [
            "Finally, where we use summaries?"
        ],
        [
            "So if we use, if you ask for example for semantic Web researcher over wiki data, you will have this list of semantic web researchers and for example for this well known semantic web research are there is no Wikipedia link to English probably has only a German Wikipedia article, so we cannot really offer here a text description.",
            "And so if we would not have the summary, you would just see the label, the external links and image.",
            "And yeah, so so the summary in this case is used to add more context to the answer entity.",
            "So for example, you would see here that he works in the semantic web and he was born in Leipzig and the other function of the summary is also that you can use it to explore the data set in a similar independence way.",
            "So you could go to Leipzig and then to Sao Paulo.",
            "And I don't know where to."
        ],
        [
            "OK, so to conclude, we have presented two resources, so when you ever want to calculate Pagerank scores, hopefully you will remember this talk and you will find this comment line tool that is available whenever you want to compute entity summaries.",
            "You will hopefully also remember this tool and we will find this framework.",
            "And we have shown that these resources are really working and can be useful.",
            "For example, in the domain of question answering."
        ],
        [
            "In the presentation there are some through the references to literature and web links."
        ],
        [
            "I would like to acknowledge the WD AQR project which financed me.",
            "Anne."
        ],
        [
            "Thank you very much for your attention and if you have any any questions, I'm happy to answer them.",
            "Thank you very much.",
            "Thanks so we get data has the blazegraph.",
            "Sparkle Engine has Pagerank service.",
            "I haven't used that, but how does that compare to your computation is that?",
            "I suppose that the place graph is is computed on the fly, and so I think it's not possible to compute Pagerank scores on the fly.",
            "Essentially, I do not know how I even was not aware of that.",
            "Is are the Patriots scores in the difficulty of wiki data graph?",
            "There's some there's some kind of service.",
            "Service in the blaze graph that can convert Ghibli will check it out.",
            "Yeah, I can't, but I'm not sure it's it's global.",
            "It can hardly be computed on the fly.",
            "I don't know how they do it.",
            "No?",
            "Patrons stores are generally global, so you need to hold knowledge graph.",
            "You have to iterate multiple time over it.",
            "So you yeah, it's really not a global local measure, so you have to run it once in offline phase.",
            "So online phase it will just crash and whatever else it is.",
            "It would not be page rank.",
            "OK, so very nice.",
            "Basically if I have any application that deals with.",
            "With the DB Pedia even or Wikipedia through the wiki links, I can use your summary online to collect those summary for my application, right?",
            "Yes, so maybe like to make it even more concrete.",
            "So the website is exactly.",
            "This.",
            "It's not this link, it's another link and here we have the API description.",
            "So here with curl you have the typical post request and then if you click on it.",
            "So this is, this would be the client side.",
            "So this is the server side.",
            "You would have to send to the server this request and this.",
            "There is also code available for the client side, so if you want to embed the summary in a in a HTML page, there is some JavaScript and HTML code that you can embed and the client will automatically call the service that you want.",
            "So here summary by blah blah blah and we have the different server instances for Vicki data, DB Pedia, Freebase DLP, SIGGRAPH and Musicbrainz running.",
            "There so you just have to implement basically the client.",
            "So if I can have.",
            "So maybe I missed it.",
            "So the criteria for choosing those features, the page rank is used because the page rank of the values in the properties favored the property that I showed in the Gary writer.",
            "So you see, it may be very good here.",
            "So the first thing the first fact is about United States of America between cross between all this entity United States of America has the highest page rank, while this Indonesian would have the lowest.",
            "And yeah.",
            "Thank you.",
            "And if there are people that are working on entity summary, I think is also good tool to come to compare.",
            "Maybe in a user study like the entity summaries that you generate and the ones that are generated here.",
            "We are not saying that these are the best entity summaries that I existing.",
            "More questions.",
            "OK, so maybe I just closed with the last one, so you presented the use of the services in question, answering setting or there are any other use cases where this could be useful?",
            "If you are at explore?",
            "So for example, there was one use case existing in entity disambiguation, or entity linking.",
            "So when you do entity linking, you want typically to have a resource and a nice way is also to show at this place a summary, because sometimes the entity itself is not.",
            "Say if you say I linked to Rome OK in DP, that's nice because you know if it's just written role.",
            "Mr Wright, Rome, it's a film is written something in parenthesis, but for example in wiki data is already more tricky, so having a little summary.",
            "Adds a bit of context to it, so this is a pretend.",
            "This is an existing application.",
            "Yeah, in recommender systems when you have entities that could also be useful.",
            "Yeah, thanks for the work.",
            "So instructor usually in bed rock is usually you don't have.",
            "I mean the predicate is not important, so I guess in your case as well.",
            "So we just like to give more important to some particular predicates and how it is changed.",
            "The final score again.",
            "So have you investigated or do you plan to just give more important to some predicates in the links just to to recompute the page rank?",
            "So some small things there are in the sense in the API.",
            "You can for example exclude predicates or enforce predicates.",
            "But we didn't really.",
            "Yeah, there exist some measures that you added can be implemented in the in.",
            "This implementation is basically random, but so whatever the Triple Store gives pick back first is the predicate that is chosen is very basic, but that you can apply different measures when you re implement this interface or when you use it.",
            "And maybe also an important thing is if you do too complicated things to exclude or to measure or to look in the neighbor, you have to generally fire a lot of sparkle.",
            "Query and scalability will become very soon an issue.",
            "So yeah, so we wanted to offer also something that at least is in real time.",
            "More questions.",
            "If not, then we can conclude this session thanks to all the speakers and enjoy your coffee break."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hello, I'm Dennis Dieffenbachia undressed Alhama.",
                    "label": 0
                },
                {
                    "sent": "So maybe the title looks a bit scary so let us explain you a bit more what it means.",
                    "label": 0
                },
                {
                    "sent": "So there are two things, page rank and general and entity summarization.",
                    "label": 0
                },
                {
                    "sent": "OK. RDF knowledge bases everyone of you knows so first.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is page rank over RDF graph?",
                    "label": 1
                },
                {
                    "sent": "Did this everyone of you knows page rank so we have websites on the web and we want to give important scores to them.",
                    "label": 0
                },
                {
                    "sent": "So websites that get a lot of incoming links should be ranked high while the other one should rank low and Arctic F graph.",
                    "label": 0
                },
                {
                    "sent": "This is very similar context.",
                    "label": 0
                },
                {
                    "sent": "We have a graph structure so it is our resources like this is hierarchy on discrete and so we want to compute patron scores.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second part was entity summarization.",
                    "label": 0
                },
                {
                    "sent": "So what is an?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The summarization of our knowledge graph.",
                    "label": 0
                },
                {
                    "sent": "So we need a knowledge graph.",
                    "label": 0
                },
                {
                    "sent": "Here we see Vicky data and we see the entry of the Lake of Garda.",
                    "label": 0
                },
                {
                    "sent": "So in a Vicky in a knowledge base, there are many facts about entities.",
                    "label": 0
                },
                {
                    "sent": "For example, here we have the inflows of this.",
                    "label": 0
                },
                {
                    "sent": "Of this Lake the counter reaches the area official website and so on.",
                    "label": 0
                },
                {
                    "sent": "And so.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Duty summarization would mean find between all these facts that are associated to the Lake of Garda.",
                    "label": 0
                },
                {
                    "sent": "The top K most important one.",
                    "label": 0
                },
                {
                    "sent": "So the task is given an entity find in a knowledge graph, some property that summarize the entity.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so the outline of the talk.",
                    "label": 0
                },
                {
                    "sent": "We have four parts.",
                    "label": 0
                },
                {
                    "sent": "The first one is to explain the relation between page rank scores and entity summarization.",
                    "label": 0
                },
                {
                    "sent": "Becausw probably for most of you.",
                    "label": 0
                },
                {
                    "sent": "Now it shines.",
                    "label": 0
                },
                {
                    "sent": "Looks like 2 completely different things.",
                    "label": 0
                },
                {
                    "sent": "In the second part, we are going to present, so it's a resource paper.",
                    "label": 0
                },
                {
                    "sent": "Our first resource, which is page rank.",
                    "label": 0
                },
                {
                    "sent": "RDF, which is a comment line tool to compute Pagerank scores over RDF graphs.",
                    "label": 1
                },
                {
                    "sent": "The second resource is a summer server service to compute entity summaries over RDF knowledge bases and in the 4th part we're going to describe how we use these two resources in the domain of question answering.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so let's start from the relation between page rank scores and entity summary.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Nation.",
                    "label": 0
                },
                {
                    "sent": "So the idea is that there was an existing approach that was presented by Andrea Stahlhammer for entities summarization and it was working on DB Pedia.",
                    "label": 1
                },
                {
                    "sent": "So the idea was that we wanted to extend this approach so that it doesn't work only to DPD about any other knowledge graph so that it is just.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me explain briefly what the idea is that was used over the pedia.",
                    "label": 0
                },
                {
                    "sent": "We have two faces.",
                    "label": 0
                },
                {
                    "sent": "We have the offline phase and the online phase in the offline phase.",
                    "label": 0
                },
                {
                    "sent": "We compute Pagerank scores.",
                    "label": 0
                },
                {
                    "sent": "So in his work, Andreas used the link structure Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "So you look at the different Wikipedia articles, you look into the link structure and you compute Pagerank in the traditional way as it was defined for web pages.",
                    "label": 0
                },
                {
                    "sent": "And the the particular thing in DPP?",
                    "label": 0
                },
                {
                    "sent": "Just at each Wikipedia page corresponds to a DP pedia page.",
                    "label": 0
                },
                {
                    "sent": "So if you compute the Pagerank scores of the Wikipedia page, is using this link structure, you also have the one.",
                    "label": 1
                },
                {
                    "sent": "You can also assign Pagerank scores 2 DPI entity.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And now how to compute a summary?",
                    "label": 1
                },
                {
                    "sent": "So imagine you have a resource are you want to compute the summary of it.",
                    "label": 0
                },
                {
                    "sent": "So what you do is you go into RDF graph, you look around and you look all the resources without associated to this resource.",
                    "label": 0
                },
                {
                    "sent": "So imagine this is the Lake of garden.",
                    "label": 0
                },
                {
                    "sent": "Here all the Info River and so on.",
                    "label": 1
                },
                {
                    "sent": "And now which facts we select.",
                    "label": 0
                },
                {
                    "sent": "So between all the resources that are associated we take the one which have the highest Pagerank score.",
                    "label": 0
                },
                {
                    "sent": "Because we think that affects this, entities are important.",
                    "label": 0
                },
                {
                    "sent": "Also, defects related to this entities are important, so these are exactly the facts that we should show, and we take just the K. Hayastan this we put in the entity.",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so now we want to do this not only over DP pedia, but for any any knowledge graph.",
                    "label": 0
                },
                {
                    "sent": "So the idea in this work is to present a framework to do this on generic knowledge graphs.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so first of all we need patron scores, so we need patrons crossover, RDF graphs.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So one would think OK page rank everyone knows how to implement it.",
                    "label": 0
                },
                {
                    "sent": "I agree it's very easy to implement it straight forward.",
                    "label": 0
                },
                {
                    "sent": "So what is the point?",
                    "label": 0
                },
                {
                    "sent": "The only difficult part for Page rank is to make it scaleable in time and in memory.",
                    "label": 0
                },
                {
                    "sent": "So the.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The to make to make this patron computation schedule in time memory, the observation was that when you compute Pagerank over a graph, you do not really need to ur eyes cause they're not needed in the algorithm.",
                    "label": 0
                },
                {
                    "sent": "But you only need in the graph, but you only need the graph structure which is encoded into the triple.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so the idea is to use HTT, which is a well known format for RDF, and the reason is that it separates your eyes from the structure, so it's very suited for this task.",
                    "label": 0
                },
                {
                    "sent": "And indexing comes for free and Moreover you have compression.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So there is this comment line tool which is available on GitHub.",
                    "label": 0
                },
                {
                    "sent": "It's free source code.",
                    "label": 0
                },
                {
                    "sent": "It is licensed under the MIT License, so you can do whatever you want with it.",
                    "label": 0
                },
                {
                    "sent": "This is it's a Java command line tool.",
                    "label": 0
                },
                {
                    "sent": "This is roughly how it looks like, so you have an input file output file you have some.",
                    "label": 0
                },
                {
                    "sent": "Para meters, which are more related to page rank, like the damping factor, the number of iteration and the start value, and that's roughly it.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To see if this thing works, this idea works out with HTT.",
                    "label": 0
                },
                {
                    "sent": "What we did is we compare two straightforward implementation of page rank and one using HTT, and experiment was run on Vicky data dump of the 28th September 2017.",
                    "label": 1
                },
                {
                    "sent": "Said yes, it had 240 gigabytes or it's a large knowledge graph.",
                    "label": 0
                },
                {
                    "sent": "2.2 billion triples and we run it in a server with quite a bit of 194 gigabytes.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this table showed the results.",
                    "label": 0
                },
                {
                    "sent": "So the the table on the left is the computation time.",
                    "label": 0
                },
                {
                    "sent": "So if we use the standard implementation, we needed 800 minutes to compute the page ranks, while when using the HTTP implementation we only needed 42.",
                    "label": 0
                },
                {
                    "sent": "And generally so something.",
                    "label": 0
                },
                {
                    "sent": "So we personally always have a HD copy of the data set, but if you don't have, you would have to convert into HTTP.",
                    "label": 0
                },
                {
                    "sent": "The data set and this would be the time that you would need, so it's still worth to convert force in HCT and then computer patron scores, then compute them directly on the RDF graph and regarding memory consumption is very similar for the non HD version we needed 90 gigabytes of RAM, while when you have the file in HD you need only 18 and this is in fact where what in fact matters.",
                    "label": 0
                },
                {
                    "sent": "I would say so the time is maybe not so important but having a 90 gigabyte server done.",
                    "label": 0
                },
                {
                    "sent": "18 gigabyte server is much more handy.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so now I give over to Andrea Stahlhammer to answer the question.",
                    "label": 0
                },
                {
                    "sent": "So we saw that the original approach was working on the link structure of Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "While now we are working on the RTF of Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "While now we are working on the RDF structure of the knowledge base.",
                    "label": 0
                },
                {
                    "sent": "So the question is what is the quantitative difference between this RDF scores when we use the two approaches?",
                    "label": 1
                },
                {
                    "sent": "OK, thanks Dennis.",
                    "label": 0
                },
                {
                    "sent": "Hi, I'm Andreas and I'm going to focus now bit on the quality of those Patriots scores that were computed on the RDF graph.",
                    "label": 0
                },
                {
                    "sent": "And so for that we did a small experimental set.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So one part was like we took.",
                    "label": 0
                },
                {
                    "sent": "We took the wiki database data set.",
                    "label": 0
                },
                {
                    "sent": "So here is what.",
                    "label": 0
                },
                {
                    "sent": "What is the output of the patron computation on the RDF graph?",
                    "label": 0
                },
                {
                    "sent": "So in total we had like about 80,000,000 entities or nodes in the graph, But that's now you would say that's far more than our entities in wiki data.",
                    "label": 0
                },
                {
                    "sent": "And it's true because in wiki data are only about 38 million at the time.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "Now it's much more already.",
                    "label": 0
                },
                {
                    "sent": "And that the reason for that difference is because you have like a lot of blank notes in the RDF data model of wiki data and you also have external links and this is how we get a lot of more resources.",
                    "label": 0
                },
                {
                    "sent": "On that side and and we also computed wiki page rank on wiki data.",
                    "label": 0
                },
                {
                    "sent": "With that anchor tool, then Kaiser Tool that uses only the Wikipedia link graph.",
                    "label": 0
                },
                {
                    "sent": "But it doesn't do it only for one language like English.",
                    "label": 0
                },
                {
                    "sent": "At unites all the link all the links from all languages and expresses the links in wiki data your eyes.",
                    "label": 0
                },
                {
                    "sent": "So like this you get a pretty good coverage of the knowledge that is basically out there in all the keys.",
                    "label": 0
                },
                {
                    "sent": "So it does it overall 200.",
                    "label": 0
                },
                {
                    "sent": "92 languages.",
                    "label": 0
                },
                {
                    "sent": "So and when you compute this, you get like a roughly 18 million entities.",
                    "label": 0
                },
                {
                    "sent": "And now you see there is a difference between wiki data that has like about 40 million and then we have here the 18 million that differences because not every week article in Wiki data has articulate any link Wikipedia language, so there are there items in wiki data that do not occur in Wikipedia and this is like already a lot as you can see.",
                    "label": 0
                },
                {
                    "sent": "As a reference measure, so here both are patron based as a reference measure we have subjective I 3D which is a click based measure.",
                    "label": 0
                },
                {
                    "sent": "Actually that was computed by Paul Houle.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "He did this measure.",
                    "label": 0
                },
                {
                    "sent": "Basically he normalized the language and so on, and he basically had this measure as a ranking measure with based on clicks for about 6 million entities.",
                    "label": 0
                },
                {
                    "sent": "So now to correlate all those measures together we had to compute intersection set and that's about 4.2 million 4.3 million.",
                    "label": 0
                },
                {
                    "sent": "So that's the intersection set.",
                    "label": 0
                },
                {
                    "sent": "So then what you can do afterwards?",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is it take to normal ranking correlation measures?",
                    "label": 0
                },
                {
                    "sent": "There is on one hand side we have Spearman's role and on the other hand we have Kendall's Tau, maybe as a short disclaimer before we look at the figures directly, both measures as humans Rowan also Kendall's Tau they have ranged from minus one to one.",
                    "label": 0
                },
                {
                    "sent": "So as you can see already directly all the time.",
                    "label": 0
                },
                {
                    "sent": "All the figures are positive so there's always a positive correlation.",
                    "label": 0
                },
                {
                    "sent": "So now now let's focus as both measures also have the nice attribute that they're symmetric, so we can just focus on on this part of the triangle here.",
                    "label": 0
                },
                {
                    "sent": "And we see directly that the page rank the two Patriot measures are strongly correlated.",
                    "label": 0
                },
                {
                    "sent": "That was expected.",
                    "label": 0
                },
                {
                    "sent": "Is the same measure.",
                    "label": 0
                },
                {
                    "sent": "And that's here the output.",
                    "label": 0
                },
                {
                    "sent": "Then you see that page rank.",
                    "label": 0
                },
                {
                    "sent": "RDF is not as well correlated with subjective with click based measure as anchor over here so.",
                    "label": 0
                },
                {
                    "sent": "There like we looked into the measures and also like at the top 100 and one of the main findings was that some structural elements and wiki data and data.",
                    "label": 0
                },
                {
                    "sent": "There's no ontology definition or something like that, but there are elements that are heavily used for structuring the knowledge base, and there are entities like Mail for example, that all of a sudden and in the page rank with RDF get a huge boost compared to the on the Wikipedia link based one.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So through the observations, so all patron measures correlate positively.",
                    "label": 1
                },
                {
                    "sent": "So that's a very good result, and the tee box element have a really high.",
                    "label": 0
                },
                {
                    "sent": "High ranks in the patron RDF and now you can do the difference and you could do nice analysis and as we have all the datasets online, that's that's something that everybody can do and I'm actually searching for collaboration partners on that idea.",
                    "label": 0
                },
                {
                    "sent": "So if anybody's interested, an.",
                    "label": 0
                },
                {
                    "sent": "And again, like what should be taken with care here is like this result should be taken with care because we used the click based measure.",
                    "label": 1
                },
                {
                    "sent": "Here is kind of a reference, but you could argue whether the click based measure is actually a really good reference or not, so that's debatable.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to summarize our patron resources, we have the source code and the tool online on GitHub.",
                    "label": 0
                },
                {
                    "sent": "You can download it, compile it all the instructions are there and we also provide already precomputed paging scores for all those knowledge bases here.",
                    "label": 0
                },
                {
                    "sent": "So DLP, DV Pedia, Freebase, Musicbrainz Springer Nature Side Graph wiki date and wiki data and you find you find all those resources down here in this picture link.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's move onto the summer server component, so that's.",
                    "label": 0
                },
                {
                    "sent": "This is our second resource that we provide.",
                    "label": 0
                },
                {
                    "sent": "And let.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Briefly explain what it is so similar server is basically and a server component that implements a specific API that was defined in an API definition.",
                    "label": 0
                },
                {
                    "sent": "And here we have basically the component for all those those knowledge bases that we saw just before.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So briefly, let me explain you the API definition so their API definition is so it's really like just about the interface.",
                    "label": 0
                },
                {
                    "sent": "So if you have a different programming language, like in Python, you can implement this API and you can interact with already programmed clients that are already existing.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's have a brief look.",
                    "label": 0
                },
                {
                    "sent": "The API definition consists of two components.",
                    "label": 1
                },
                {
                    "sent": "We have a vocabulary and a restful interaction mechanism, so the vocabulary.",
                    "label": 1
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "She looks as follows, so in the center we have entity summary and to compute summary the API needs two mandatory parameters and those parameters are resource that needs to be summarized and the top K para meter, which is the number of facts that you want to see about this year.",
                    "label": 0
                },
                {
                    "sent": "I then you have a couple of alternatives.",
                    "label": 0
                },
                {
                    "sent": "How do you say?",
                    "label": 0
                },
                {
                    "sent": "Not not mandatory parameters that are like fixed properties, the language and so on, and those can be configured automatically.",
                    "label": 0
                },
                {
                    "sent": "So and then.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When you do the interaction with the server, what you do is, like you say, the client says OK, I post a submarine that doesn't contain anything at this moment and actually you post a blank note because you don't know how it's actually called and you pull.",
                    "label": 0
                },
                {
                    "sent": "You send this post request to the server.",
                    "label": 0
                },
                {
                    "sent": "You can do this in any of this RDF serializations.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "For brevity, we took Turtle, so it comes back from the server is like, oh you wanted the summary.",
                    "label": 0
                },
                {
                    "sent": "I created it for you.",
                    "label": 0
                },
                {
                    "sent": "Here's to your eye.",
                    "label": 0
                },
                {
                    "sent": "From now on you can always look it up and this year I.",
                    "label": 0
                },
                {
                    "sent": "And here is the summary and then you get all the facts and also rankings that are associated with this summary.",
                    "label": 0
                },
                {
                    "sent": "From after that, the client can always call the same summary with this, with this direct UI and gets again the summary.",
                    "label": 0
                },
                {
                    "sent": "So so this part here is optional because after the first interaction, the client, if it's smart, it can actually exchange here this year I always by itself and it doesn't need to go the full way.",
                    "label": 0
                },
                {
                    "sent": "So basically you assume that.",
                    "label": 0
                },
                {
                    "sent": "The client can somehow so that the server already created those summaries offline.",
                    "label": 0
                },
                {
                    "sent": "So and with that.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm heading back to.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So Dennis will give you.",
                    "label": 0
                },
                {
                    "sent": "A short implementation guide on the summer server.",
                    "label": 0
                },
                {
                    "sent": "OK so we have implemented several entity summarization service for popular knowledge basis.",
                    "label": 0
                },
                {
                    "sent": "But imagine you have your own knowledge base and you want to create now a summarization service.",
                    "label": 0
                },
                {
                    "sent": "So what you have to do is basically two things you have.",
                    "label": 0
                },
                {
                    "sent": "First to compute Pagerank scores over this data set and you have to save this and you have to save the page rank scores end to end and the data set itself into a sparkle endpoint and then you have to.",
                    "label": 0
                },
                {
                    "sent": "Right tree sparkle queries so the.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This popular query looks like this, so this is the entity we want to summarize and you in fact just retrieve the RDF label of it in a given language and note that we cannot really write this query for you.",
                    "label": 0
                },
                {
                    "sent": "For example in Musicbrainz, not every resource has an RDF label, but it has something like a title, so you really have to write it yourself.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second query would given an entity do this graph traversal so it would search for every related.",
                    "label": 0
                },
                {
                    "sent": "Entity two, yeah, every related resource to it and take also the page rank of this resource is an order them.",
                    "label": 0
                },
                {
                    "sent": "By the Pagerank and taking the top K. And this part is for getting the labels in the corresponding language of the object.",
                    "label": 0
                },
                {
                    "sent": "This filter here we did over Vicky data Becausw we we wanted to exclude some properties from the summary, like for example the gender because generally the Mail proper domain resource as we said before would be ranked very high, but we want not to have it appear in the summary because it's a quite trivial property.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally, you have to implement this query which, given an entity and an object, has to retrieve the label of the predicate and in Vicky data.",
                    "label": 0
                },
                {
                    "sent": "For some strange reason it's a bit complicated.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The resources are called related to the summer server are a framework to compute entity summaries, which is the summer server which you find under this GitHub link and we have web services that compute summarization's for the.",
                    "label": 0
                },
                {
                    "sent": "Knowledge bases that you saw before OK.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me now briefly describe you how you could use or how do we use these resources in the context of question answering.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So where page rank scores used in a question answering system.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So imagine you ask in a question answering system just for River.",
                    "label": 0
                },
                {
                    "sent": "And then what you probably would expect is a natural flowing watercourse, usually freshwater flowing towards an ocean.",
                    "label": 1
                },
                {
                    "sent": "But there are many other things that are called River in a knowledge base and this you see for example here in this did you mean functionality?",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So you have the River as a natural water course, but you have also this painting by Ernest Lawson and.",
                    "label": 0
                },
                {
                    "sent": "A film from 1951, so in this case page rank schools are just used to rank the different possible alternatives and to disambiguate between the entities.",
                    "label": 0
                },
                {
                    "sent": "Another part where we use page rank scores is when the answer set has multiple answers.",
                    "label": 0
                },
                {
                    "sent": "If the question has multiple answers, so for example, if you ask for lakes in the Pope Basin for the PO is a River in in Italy and you want to know lakes around there.",
                    "label": 1
                },
                {
                    "sent": "So we will find many many lakes, but probably you.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do not want to have as a first week without the Lago Devo Bieta because nobody knows it and you want to have at the beginning the larger majority.",
                    "label": 0
                },
                {
                    "sent": "That would be our Gallery, So patrons are typically used as it is also done in information retrieval.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Finally, where we use summaries?",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if we use, if you ask for example for semantic Web researcher over wiki data, you will have this list of semantic web researchers and for example for this well known semantic web research are there is no Wikipedia link to English probably has only a German Wikipedia article, so we cannot really offer here a text description.",
                    "label": 0
                },
                {
                    "sent": "And so if we would not have the summary, you would just see the label, the external links and image.",
                    "label": 0
                },
                {
                    "sent": "And yeah, so so the summary in this case is used to add more context to the answer entity.",
                    "label": 0
                },
                {
                    "sent": "So for example, you would see here that he works in the semantic web and he was born in Leipzig and the other function of the summary is also that you can use it to explore the data set in a similar independence way.",
                    "label": 0
                },
                {
                    "sent": "So you could go to Leipzig and then to Sao Paulo.",
                    "label": 0
                },
                {
                    "sent": "And I don't know where to.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so to conclude, we have presented two resources, so when you ever want to calculate Pagerank scores, hopefully you will remember this talk and you will find this comment line tool that is available whenever you want to compute entity summaries.",
                    "label": 1
                },
                {
                    "sent": "You will hopefully also remember this tool and we will find this framework.",
                    "label": 0
                },
                {
                    "sent": "And we have shown that these resources are really working and can be useful.",
                    "label": 1
                },
                {
                    "sent": "For example, in the domain of question answering.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the presentation there are some through the references to literature and web links.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would like to acknowledge the WD AQR project which financed me.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you very much for your attention and if you have any any questions, I'm happy to answer them.",
                    "label": 1
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Thanks so we get data has the blazegraph.",
                    "label": 0
                },
                {
                    "sent": "Sparkle Engine has Pagerank service.",
                    "label": 0
                },
                {
                    "sent": "I haven't used that, but how does that compare to your computation is that?",
                    "label": 0
                },
                {
                    "sent": "I suppose that the place graph is is computed on the fly, and so I think it's not possible to compute Pagerank scores on the fly.",
                    "label": 0
                },
                {
                    "sent": "Essentially, I do not know how I even was not aware of that.",
                    "label": 0
                },
                {
                    "sent": "Is are the Patriots scores in the difficulty of wiki data graph?",
                    "label": 0
                },
                {
                    "sent": "There's some there's some kind of service.",
                    "label": 0
                },
                {
                    "sent": "Service in the blaze graph that can convert Ghibli will check it out.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I can't, but I'm not sure it's it's global.",
                    "label": 0
                },
                {
                    "sent": "It can hardly be computed on the fly.",
                    "label": 0
                },
                {
                    "sent": "I don't know how they do it.",
                    "label": 0
                },
                {
                    "sent": "No?",
                    "label": 0
                },
                {
                    "sent": "Patrons stores are generally global, so you need to hold knowledge graph.",
                    "label": 0
                },
                {
                    "sent": "You have to iterate multiple time over it.",
                    "label": 0
                },
                {
                    "sent": "So you yeah, it's really not a global local measure, so you have to run it once in offline phase.",
                    "label": 0
                },
                {
                    "sent": "So online phase it will just crash and whatever else it is.",
                    "label": 0
                },
                {
                    "sent": "It would not be page rank.",
                    "label": 0
                },
                {
                    "sent": "OK, so very nice.",
                    "label": 0
                },
                {
                    "sent": "Basically if I have any application that deals with.",
                    "label": 0
                },
                {
                    "sent": "With the DB Pedia even or Wikipedia through the wiki links, I can use your summary online to collect those summary for my application, right?",
                    "label": 0
                },
                {
                    "sent": "Yes, so maybe like to make it even more concrete.",
                    "label": 0
                },
                {
                    "sent": "So the website is exactly.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "It's not this link, it's another link and here we have the API description.",
                    "label": 0
                },
                {
                    "sent": "So here with curl you have the typical post request and then if you click on it.",
                    "label": 0
                },
                {
                    "sent": "So this is, this would be the client side.",
                    "label": 0
                },
                {
                    "sent": "So this is the server side.",
                    "label": 0
                },
                {
                    "sent": "You would have to send to the server this request and this.",
                    "label": 0
                },
                {
                    "sent": "There is also code available for the client side, so if you want to embed the summary in a in a HTML page, there is some JavaScript and HTML code that you can embed and the client will automatically call the service that you want.",
                    "label": 0
                },
                {
                    "sent": "So here summary by blah blah blah and we have the different server instances for Vicki data, DB Pedia, Freebase DLP, SIGGRAPH and Musicbrainz running.",
                    "label": 0
                },
                {
                    "sent": "There so you just have to implement basically the client.",
                    "label": 0
                },
                {
                    "sent": "So if I can have.",
                    "label": 0
                },
                {
                    "sent": "So maybe I missed it.",
                    "label": 0
                },
                {
                    "sent": "So the criteria for choosing those features, the page rank is used because the page rank of the values in the properties favored the property that I showed in the Gary writer.",
                    "label": 0
                },
                {
                    "sent": "So you see, it may be very good here.",
                    "label": 0
                },
                {
                    "sent": "So the first thing the first fact is about United States of America between cross between all this entity United States of America has the highest page rank, while this Indonesian would have the lowest.",
                    "label": 0
                },
                {
                    "sent": "And yeah.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "And if there are people that are working on entity summary, I think is also good tool to come to compare.",
                    "label": 0
                },
                {
                    "sent": "Maybe in a user study like the entity summaries that you generate and the ones that are generated here.",
                    "label": 0
                },
                {
                    "sent": "We are not saying that these are the best entity summaries that I existing.",
                    "label": 0
                },
                {
                    "sent": "More questions.",
                    "label": 0
                },
                {
                    "sent": "OK, so maybe I just closed with the last one, so you presented the use of the services in question, answering setting or there are any other use cases where this could be useful?",
                    "label": 0
                },
                {
                    "sent": "If you are at explore?",
                    "label": 0
                },
                {
                    "sent": "So for example, there was one use case existing in entity disambiguation, or entity linking.",
                    "label": 0
                },
                {
                    "sent": "So when you do entity linking, you want typically to have a resource and a nice way is also to show at this place a summary, because sometimes the entity itself is not.",
                    "label": 0
                },
                {
                    "sent": "Say if you say I linked to Rome OK in DP, that's nice because you know if it's just written role.",
                    "label": 0
                },
                {
                    "sent": "Mr Wright, Rome, it's a film is written something in parenthesis, but for example in wiki data is already more tricky, so having a little summary.",
                    "label": 0
                },
                {
                    "sent": "Adds a bit of context to it, so this is a pretend.",
                    "label": 0
                },
                {
                    "sent": "This is an existing application.",
                    "label": 0
                },
                {
                    "sent": "Yeah, in recommender systems when you have entities that could also be useful.",
                    "label": 0
                },
                {
                    "sent": "Yeah, thanks for the work.",
                    "label": 0
                },
                {
                    "sent": "So instructor usually in bed rock is usually you don't have.",
                    "label": 0
                },
                {
                    "sent": "I mean the predicate is not important, so I guess in your case as well.",
                    "label": 0
                },
                {
                    "sent": "So we just like to give more important to some particular predicates and how it is changed.",
                    "label": 0
                },
                {
                    "sent": "The final score again.",
                    "label": 0
                },
                {
                    "sent": "So have you investigated or do you plan to just give more important to some predicates in the links just to to recompute the page rank?",
                    "label": 0
                },
                {
                    "sent": "So some small things there are in the sense in the API.",
                    "label": 0
                },
                {
                    "sent": "You can for example exclude predicates or enforce predicates.",
                    "label": 0
                },
                {
                    "sent": "But we didn't really.",
                    "label": 0
                },
                {
                    "sent": "Yeah, there exist some measures that you added can be implemented in the in.",
                    "label": 0
                },
                {
                    "sent": "This implementation is basically random, but so whatever the Triple Store gives pick back first is the predicate that is chosen is very basic, but that you can apply different measures when you re implement this interface or when you use it.",
                    "label": 0
                },
                {
                    "sent": "And maybe also an important thing is if you do too complicated things to exclude or to measure or to look in the neighbor, you have to generally fire a lot of sparkle.",
                    "label": 0
                },
                {
                    "sent": "Query and scalability will become very soon an issue.",
                    "label": 0
                },
                {
                    "sent": "So yeah, so we wanted to offer also something that at least is in real time.",
                    "label": 0
                },
                {
                    "sent": "More questions.",
                    "label": 0
                },
                {
                    "sent": "If not, then we can conclude this session thanks to all the speakers and enjoy your coffee break.",
                    "label": 0
                }
            ]
        }
    }
}