{
    "id": "erg7czdbdqauaqgszjjpppewfnrx5uba",
    "title": "Kernels on histograms through the transportation polytope",
    "info": {
        "author": [
            "Marco Cuturi, Graduate School of Informatics, Kyoto University"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "August 2006",
        "category": [
            "Top->Computer Science->Machine Learning->Kernel Methods"
        ]
    },
    "url": "http://videolectures.net/mlss06tw_cuturi_khttp/",
    "segmentation": [
        [
            "First thing so late, so I'm going to talk about a few."
        ],
        [
            "Amazon histograms, so first I will just simply explain maybe why it's interesting and why people have been interested in defining curls histograms.",
            "And actually, Alex talk was was mentioning this topic in a way because he was trying to compare distributions and by defining distances on distributions it's topic in which is quite closely related to defining kernels in histograms.",
            "So the first slides will be about that and I will try to be as fast as possible and then I would just present a few of your limits of some current research.",
            "So."
        ],
        [
            "First, white histograms where we talk about histograms.",
            "Well, the first thing is that when you want to apply kernel methods to your everyday problems, usually you need to define a kernel and as we've seen in the previous talks, when your your input space is just simply a space of vectors then then we have a lot of well understood kernels, typically Goshen kernel, and putting them in kernel and the problem in that case is typically to find the good para meters.",
            "So we've had a lot of discussions on this."
        ],
        [
            "But when you shift to more tricky, tricky objects such as strings, graphs, text and we also talked quite a lot about this.",
            "You cannot use directly the your standard kernels that you have implemented moves as in as in."
        ],
        [
            "Patience so you have to define kernels too.",
            "How to tell how, how different or similar to strings are graphs or text or etc.",
            "So one of the first solutions is to simply force this feature vector representation using fingerprints.",
            "So a lot of people in many different fields have a nice set of fingerprints to define or two.",
            "To qualify some objects and you can use them directly then, so that's quite."
        ],
        [
            "Nice, but some people have found out that maybe it's it's more interesting to attack directly the issue of defining similarity between those objects, and one of the ways to do it is to use something called convolution kernels.",
            "I don't want to go into the details and truthfully, they also had a talk."
        ],
        [
            "About this and I know the direction which is also related to Fisher Kernel Annina way related to previous approaches to use statistical models because at least we know that even if strings, graphs or texts are not so easy to manipulate objects, a lot of people in statistics and in computer science has been dealing with them for a long time.",
            "They have defined interesting statistical models and maybe we can use those to find good kernels."
        ],
        [
            "And it turns out that quite often, especially in string analysis or sequence analysis, what you're actually doing is treating these objects as bags of components.",
            "So there."
        ],
        [
            "Here is just simply that.",
            "You will have a long sequence and maybe that could be an amino acid sequence, for instance, and it's quite difficult to treat other whole.",
            "So what people do is just slice the sequence and count how often you find some engrams.",
            "So in this case we found such a HLK twice, and so we think that into account we lose a lot of information, but we just say, OK, that sequence after all, is."
        ],
        [
            "Just like this histogram.",
            "Same for for the bag of words representation for text that we don't have been talking."
        ],
        [
            "A lot about.",
            "In same for sometimes images, so you've got this image and this is just like some kind of 3D histogram RGB histogram and the bigger the world is, the more this color is represented in the."
        ],
        [
            "The image, so as you can see a lot of problems can be cast with this framework.",
            "It's not a very efficient framework because it has a lot of problems.",
            "It uses a lot of things, but a lot of people use it, and since a lot of people cast their objects as as histograms, then we have to."
        ],
        [
            "Find.",
            "Good kernels on histograms to treat that."
        ],
        [
            "So you might say, sure, OK, we have histograms, but after all, if this is like the simplex, the simplest is just a vector.",
            "So why can't we use just simply Goshen polynomial kernels and things like that?"
        ],
        [
            "So it turns out that.",
            "Microphones classes I should go for?",
            "OK, sorry I can't hear that.",
            "OK, so it turns out that most of the early applications of SCM actually were using this kind of of kernels and for images or text."
        ],
        [
            "And the people started to realize that it was actually maybe not the best setting.",
            "And I mean this paper, for instance, was comparing images through the histogram of their colors and the first one of the important things is that the histograms are vectors, right?",
            "But they are in the positive orthant, so all of their coordinates are positive.",
            "So does it really make sense to subtract 1 histogram from another to compute the Goshen kernel?",
            "So the question was asked in the this?",
            "This paper by hiring whiskey and they derival."
        ],
        [
            "Most interesting metrics for histograms of probabilities and then the other point is that usually this vectors are also normalized so that they are in the simplex.",
            "So once again you have a lot of dressing tools to handle this kind of this problem, and a lot of it comes from information geometry and a lot of people have been studying histograms from this perspective to define good kernels."
        ],
        [
            "So that's the first point.",
            "But then also, there's a lot of work which has been done in the past as well on on defining good probability metrics.",
            "And if I say metrics, then it looks a bit like saying your kernel because you know that very often if you have a good distance which is negative definite, you can say exponential minus distance becomes a positive definite kernel.",
            "So this is the case for many of the standard metrics in in statistics such as Jensen Divergent or Hellinger Distance key, two etc etc.",
            "So you can use a lot of those two to use them as kernels between Instagrams.",
            "Just a little code to see that you cannot use callback library even if you symmetrize.",
            "It's not exactly positive Def."
        ],
        [
            "And then there's a new newer set of metrics or or kernels between between the histograms, which takes into account prior on your space.",
            "So a lot of the talk of Alex was actually related to this, and so the interesting thing is that you are actually computing a lot of this previous metrics that you are doing it in your kitchen design, and there are a lot of tricks to do it quite cleanly, and so that's one of the.",
            "Approaches."
        ],
        [
            "So the focus of my talk today will just be on the most control which distance, because so far if you take a look at this this metrics, usually they really rely on pair of pair of coefficients comparisons and issues.",
            "If you do this in the dark ages, it becomes it.",
            "It's as if you're so.",
            "Suppose you have histograms.",
            "Usually this metric suppose that all the bins are orthogonal, but then you can.",
            "You can actually embed this multinomial solve this measures.",
            "Work your chest to take into account the fact that they're not really orthogonal.",
            "But then there's this interesting much culture, which this is, which goes a bit beyond this, and it's very old.",
            "It's very old criterion to compare to histograms or and it's really deeply related to linear programming or operations research historically, and it's also well known in the computer vision.",
            "In computer vision environment, as the Earth moves distance, so a lot of people there in computer vision, they want to compare two histograms of colors with think that Earth moves is a good is a good option."
        ],
        [
            "So one question that we can have is whether this distance is negative definite.",
            "Is it a bit like those distances?",
            "Well, the question is not completely solve.",
            "It seems to be that no, it's not negative definite, so some elements show that it shouldn't be and, but we can still take a closer look at it to see if there is a way of.",
            "Trying to kernel eyes it, but I'm just trying to inspire myself from this criterion to to find the."
        ],
        [
            "Missing family of kernels.",
            "So I'm going to talk about a few of those kernels."
        ],
        [
            "So the problem that let's cut the problem quite simply, suppose we have two histograms, so you remember the histograms that I showed in the first slide where I had.",
            "I was counting words and substrings and things like that, and I suppose that they are normalized that there's some, so they are just integrals and they are they are normal."
        ],
        [
            "Now suppose I have a distance matrix between the bins, so that would mean that, for instance, if I have, if I have a histogram of amino acid letters.",
            "So I think that maybe that might be the best example.",
            "Then I will stick to this example so we so previously sequences of amino acids.",
            "You know, we know that some some amino acids are closer to other.",
            "I mean like they are not equally different or they are not orthogonal.",
            "So you can think of this.",
            "There are a lot of actually distance matrices between between amino acids and one of them is the blossom matrix for instance.",
            "And then if you're giving this."
        ],
        [
            "This matrix between the beans there is something which is called the transportation polytope, which you can use to find the best transport from one histogram to another.",
            "This has also been cast in another framework, which is like you have factories and you have shops.",
            "Each factory produces some amount of goods and each shop needs some amount to sell to its customers.",
            "What is the best way to send the goods from the factories to the?"
        ],
        [
            "To the shops and this each of those schemes to transport some raw materials from some goods from the factory to the shops is known as the transportation polytope.",
            "So transportation polytope is just set of matrices such that all the other lines will sum to the the elements of arm and all the columns will sum to the limits of the.",
            "In the statistical framework this is also known as matrix matrices with six marginals.",
            "So we have this big thing.",
            "The transportation polytope and."
        ],
        [
            "What the most control which distances or this from transportation distances?",
            "It's just the minimum of this criterion which will tell me how costly it is to move all these goods from this shop to the other from one factory to that one shop.",
            "Given that I have a cost which is which is a."
        ],
        [
            "This is metrics.",
            "So if we usually this is, you can easily find this optimal transportation.",
            "It's known as you can usually do it with simplex algorithms or any linear programming."
        ],
        [
            "Rhythm, so if we take a picture of what happens when we compute the more controllers distances like we have this big polytope, each of the elements of this polytope is a is a matrix, and we know that the optimal the optimal transportation plan is always the vertex is always somewhere there, and usually what do you do when you compute the earth movers distance or transportation distances that the only thing that you consider is just the value of the criteria and this vertex?",
            "So my question is, can you actually?",
            "Take a look at the whole polytope, because the whole point of it is quite interesting.",
            "It tells you how you can transport one Instagram to another, and all of these configurations are quite might be interesting to define."
        ],
        [
            "Marriage between 2 two histograms.",
            "So very first example, a very simple one is the case of the permanent, so the permanent is is very related to the determinant.",
            "If you indeterminate you will have minus one power.",
            "The signature of the permutation, so it's it's very."
        ],
        [
            "Similar, so it turns out that you have two clouds of points of equal size and that."
        ],
        [
            "You have kernel, so this is pretty much setting that we've been seeing in the in the."
        ],
        [
            "Afternoon then the permanent of the gram matrix is actually a positive definite quantity, so you can use it as a kernel between between 2 clouds of points.",
            "And if you take."
        ],
        [
            "You look at it.",
            "She just assumed that.",
            "You're you're you think your team metrics and you assume that it is negative definite matrix.",
            "That means that the exponential minus the pointwise exponential of this matrix is positive definite kernel.",
            "Then actually this permit this kernel permanent is just a sum over all possible permutations of the of the distance.",
            "I will show you the next slide you will have a very intuition on this."
        ],
        [
            "Think so.",
            "Imagine I have two sets of points to the white car, the white ones and the blue ones.",
            "And of course there is an optimal permutation.",
            "I mean there is an optimal transport from from the white points to the blue points, so you can see that if I move this point here this like this, the total sum of the distances here is that it's the shortest one.",
            "But then if I only use this as a kernel, not only I'm.",
            "I'm not sure that it's definite, but then I. I mean, you were losing the information, which is also that there might be a lot of other plans which are actually are not very costly.",
            "So I want to take this into account and this is what the permanent does.",
            "So what is the problem of the permanent?",
            "Is the computation of the permanent of a matrix is very very costly, but there are now some sequence important sampling algorithms which which make it which can run into the end to the power seven roughly.",
            "So that's still quite a lot.",
            "So I will.",
            "I have done some experiments with 2000 points of 20 story 2000 examples of 20 points.",
            "It takes quite awhile and I haven't run actually those experience with the latest techniques.",
            "This sequence, important sampling techniques, but well, it's obviously limited in terms of computational power, but I think it's interesting to see that you can define such occur."
        ],
        [
            "So now I'm going to go to something a bit different, so when I really have histograms, I have this interesting polytope.",
            "I would just like to mention that the previous part of their work considering actually is the big positive of all possible whose vertices are the permutation.",
            "But now let's really address the whole polytope, and one can also prove that the volume of the polytope.",
            "So if you remember the positive look like this, well, the volume that is the number of transportation plans.",
            "He's actually also opposed."
        ],
        [
            "Definite kernel between between the histograms.",
            "Actually it's very, very difficult to compute the volume of a polytope.",
            "In exact terms.",
            "It's a.",
            "It's a very active branch of mathematics."
        ],
        [
            "But there are some some approximations which which have been proposed, and there are here.",
            "Also there are some sequence important sampling schemes which might be."
        ],
        [
            "Interesting.",
            "So how you can prove that the volume is positive definite I will go."
        ],
        [
            "Very fast because I think maybe this is more like a detailed.",
            "The idea is that for each of the matrices of the polytope you can you can there is objection with a pair of what it's called generalized young Tableau, and so you can."
        ],
        [
            "And actually define the volume of the polytope just simply the sum of something that looks like a Mercer kernel.",
            "Each of these coefficients is a number, so this is the number of generalized young tableau of shape data and of content see.",
            "So we found some nice expression like this."
        ],
        [
            "That means this positive effect.",
            "Then there's another topic, but and I will just finish on this, which is also very very hot topic in combinatorial switches to compute the generating function of the polytope.",
            "So you remember that we computed.",
            "We were discussing about the volume for the generating function is just simply where the volume is just simply the generating function evaluated at T = 0.",
            "And actually it turns out that people use first compute the generating function and then evaluate it on zero to compute the volume.",
            "You cannot compute the volume straightforwardly.",
            "You have to compute first.",
            "Is this big big generating?"
        ],
        [
            "And it's also very, very difficult to compute, and there are also some sequence important sampling results which are really being brought forward.",
            "Those are very recent recent results from last year."
        ],
        [
            "And so I've been one I've been thinking.",
            "What kind of weighted scheme can you apply on on this generating function to obtain a positive definite kernel?",
            "Of course, my idea would be to have something that would be just simply one here, so that we might be able to directly the generating function.",
            "So far it hasn't."
        ],
        [
            "Able to improve that.",
            "But they have been have proved this result, which is a bit more complicated instead."
        ],
        [
            "But when you when you when you really when you particularize it to some, some coefficient equals zero.",
            "This is officially a Fisher Yates statistic for Mattress is with fixed margins and in this in this particular example you only have a weight which only depends on the on the diagonal terms.",
            "So the proof of all these are a bit complicated but be very happy.",
            "More than happy to discuss with you with your interest in that so."
        ],
        [
            "Some very, very elementary experimental results so that those are the results I was talking to you about, and they're not particularly exciting, so I guess I need to work more on them, and the idea is just taking 2000 images of the MACD database so you have 10 classes and I just sample randomly 20 pixels and in the first in the first column I first do some Parson Parson smoothing.",
            "So I put a Goshen small Goshen of varying with.",
            "On the each of the pixels, and then I apply directly Goshen kernel and in this case, or this is pretty much what Alex was presenting at.",
            "In this case, I'm just I'm just taking the means of these points and calculating the distance in the arcade chess.",
            "And in this case I use this permanent kernel, but this is really very.",
            "Preliminary stuff, so thank you very much for staying so late."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "First thing so late, so I'm going to talk about a few.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Amazon histograms, so first I will just simply explain maybe why it's interesting and why people have been interested in defining curls histograms.",
                    "label": 0
                },
                {
                    "sent": "And actually, Alex talk was was mentioning this topic in a way because he was trying to compare distributions and by defining distances on distributions it's topic in which is quite closely related to defining kernels in histograms.",
                    "label": 0
                },
                {
                    "sent": "So the first slides will be about that and I will try to be as fast as possible and then I would just present a few of your limits of some current research.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "First, white histograms where we talk about histograms.",
                    "label": 0
                },
                {
                    "sent": "Well, the first thing is that when you want to apply kernel methods to your everyday problems, usually you need to define a kernel and as we've seen in the previous talks, when your your input space is just simply a space of vectors then then we have a lot of well understood kernels, typically Goshen kernel, and putting them in kernel and the problem in that case is typically to find the good para meters.",
                    "label": 0
                },
                {
                    "sent": "So we've had a lot of discussions on this.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But when you shift to more tricky, tricky objects such as strings, graphs, text and we also talked quite a lot about this.",
                    "label": 0
                },
                {
                    "sent": "You cannot use directly the your standard kernels that you have implemented moves as in as in.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Patience so you have to define kernels too.",
                    "label": 0
                },
                {
                    "sent": "How to tell how, how different or similar to strings are graphs or text or etc.",
                    "label": 0
                },
                {
                    "sent": "So one of the first solutions is to simply force this feature vector representation using fingerprints.",
                    "label": 0
                },
                {
                    "sent": "So a lot of people in many different fields have a nice set of fingerprints to define or two.",
                    "label": 0
                },
                {
                    "sent": "To qualify some objects and you can use them directly then, so that's quite.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nice, but some people have found out that maybe it's it's more interesting to attack directly the issue of defining similarity between those objects, and one of the ways to do it is to use something called convolution kernels.",
                    "label": 0
                },
                {
                    "sent": "I don't want to go into the details and truthfully, they also had a talk.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About this and I know the direction which is also related to Fisher Kernel Annina way related to previous approaches to use statistical models because at least we know that even if strings, graphs or texts are not so easy to manipulate objects, a lot of people in statistics and in computer science has been dealing with them for a long time.",
                    "label": 0
                },
                {
                    "sent": "They have defined interesting statistical models and maybe we can use those to find good kernels.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it turns out that quite often, especially in string analysis or sequence analysis, what you're actually doing is treating these objects as bags of components.",
                    "label": 0
                },
                {
                    "sent": "So there.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here is just simply that.",
                    "label": 0
                },
                {
                    "sent": "You will have a long sequence and maybe that could be an amino acid sequence, for instance, and it's quite difficult to treat other whole.",
                    "label": 1
                },
                {
                    "sent": "So what people do is just slice the sequence and count how often you find some engrams.",
                    "label": 0
                },
                {
                    "sent": "So in this case we found such a HLK twice, and so we think that into account we lose a lot of information, but we just say, OK, that sequence after all, is.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just like this histogram.",
                    "label": 0
                },
                {
                    "sent": "Same for for the bag of words representation for text that we don't have been talking.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A lot about.",
                    "label": 0
                },
                {
                    "sent": "In same for sometimes images, so you've got this image and this is just like some kind of 3D histogram RGB histogram and the bigger the world is, the more this color is represented in the.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The image, so as you can see a lot of problems can be cast with this framework.",
                    "label": 0
                },
                {
                    "sent": "It's not a very efficient framework because it has a lot of problems.",
                    "label": 0
                },
                {
                    "sent": "It uses a lot of things, but a lot of people use it, and since a lot of people cast their objects as as histograms, then we have to.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Find.",
                    "label": 0
                },
                {
                    "sent": "Good kernels on histograms to treat that.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So you might say, sure, OK, we have histograms, but after all, if this is like the simplex, the simplest is just a vector.",
                    "label": 0
                },
                {
                    "sent": "So why can't we use just simply Goshen polynomial kernels and things like that?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So it turns out that.",
                    "label": 0
                },
                {
                    "sent": "Microphones classes I should go for?",
                    "label": 0
                },
                {
                    "sent": "OK, sorry I can't hear that.",
                    "label": 0
                },
                {
                    "sent": "OK, so it turns out that most of the early applications of SCM actually were using this kind of of kernels and for images or text.",
                    "label": 1
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the people started to realize that it was actually maybe not the best setting.",
                    "label": 0
                },
                {
                    "sent": "And I mean this paper, for instance, was comparing images through the histogram of their colors and the first one of the important things is that the histograms are vectors, right?",
                    "label": 0
                },
                {
                    "sent": "But they are in the positive orthant, so all of their coordinates are positive.",
                    "label": 1
                },
                {
                    "sent": "So does it really make sense to subtract 1 histogram from another to compute the Goshen kernel?",
                    "label": 0
                },
                {
                    "sent": "So the question was asked in the this?",
                    "label": 0
                },
                {
                    "sent": "This paper by hiring whiskey and they derival.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Most interesting metrics for histograms of probabilities and then the other point is that usually this vectors are also normalized so that they are in the simplex.",
                    "label": 0
                },
                {
                    "sent": "So once again you have a lot of dressing tools to handle this kind of this problem, and a lot of it comes from information geometry and a lot of people have been studying histograms from this perspective to define good kernels.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's the first point.",
                    "label": 0
                },
                {
                    "sent": "But then also, there's a lot of work which has been done in the past as well on on defining good probability metrics.",
                    "label": 0
                },
                {
                    "sent": "And if I say metrics, then it looks a bit like saying your kernel because you know that very often if you have a good distance which is negative definite, you can say exponential minus distance becomes a positive definite kernel.",
                    "label": 0
                },
                {
                    "sent": "So this is the case for many of the standard metrics in in statistics such as Jensen Divergent or Hellinger Distance key, two etc etc.",
                    "label": 0
                },
                {
                    "sent": "So you can use a lot of those two to use them as kernels between Instagrams.",
                    "label": 0
                },
                {
                    "sent": "Just a little code to see that you cannot use callback library even if you symmetrize.",
                    "label": 0
                },
                {
                    "sent": "It's not exactly positive Def.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then there's a new newer set of metrics or or kernels between between the histograms, which takes into account prior on your space.",
                    "label": 0
                },
                {
                    "sent": "So a lot of the talk of Alex was actually related to this, and so the interesting thing is that you are actually computing a lot of this previous metrics that you are doing it in your kitchen design, and there are a lot of tricks to do it quite cleanly, and so that's one of the.",
                    "label": 0
                },
                {
                    "sent": "Approaches.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the focus of my talk today will just be on the most control which distance, because so far if you take a look at this this metrics, usually they really rely on pair of pair of coefficients comparisons and issues.",
                    "label": 0
                },
                {
                    "sent": "If you do this in the dark ages, it becomes it.",
                    "label": 0
                },
                {
                    "sent": "It's as if you're so.",
                    "label": 0
                },
                {
                    "sent": "Suppose you have histograms.",
                    "label": 0
                },
                {
                    "sent": "Usually this metric suppose that all the bins are orthogonal, but then you can.",
                    "label": 0
                },
                {
                    "sent": "You can actually embed this multinomial solve this measures.",
                    "label": 0
                },
                {
                    "sent": "Work your chest to take into account the fact that they're not really orthogonal.",
                    "label": 0
                },
                {
                    "sent": "But then there's this interesting much culture, which this is, which goes a bit beyond this, and it's very old.",
                    "label": 0
                },
                {
                    "sent": "It's very old criterion to compare to histograms or and it's really deeply related to linear programming or operations research historically, and it's also well known in the computer vision.",
                    "label": 0
                },
                {
                    "sent": "In computer vision environment, as the Earth moves distance, so a lot of people there in computer vision, they want to compare two histograms of colors with think that Earth moves is a good is a good option.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So one question that we can have is whether this distance is negative definite.",
                    "label": 0
                },
                {
                    "sent": "Is it a bit like those distances?",
                    "label": 0
                },
                {
                    "sent": "Well, the question is not completely solve.",
                    "label": 1
                },
                {
                    "sent": "It seems to be that no, it's not negative definite, so some elements show that it shouldn't be and, but we can still take a closer look at it to see if there is a way of.",
                    "label": 1
                },
                {
                    "sent": "Trying to kernel eyes it, but I'm just trying to inspire myself from this criterion to to find the.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Missing family of kernels.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to talk about a few of those kernels.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the problem that let's cut the problem quite simply, suppose we have two histograms, so you remember the histograms that I showed in the first slide where I had.",
                    "label": 0
                },
                {
                    "sent": "I was counting words and substrings and things like that, and I suppose that they are normalized that there's some, so they are just integrals and they are they are normal.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now suppose I have a distance matrix between the bins, so that would mean that, for instance, if I have, if I have a histogram of amino acid letters.",
                    "label": 0
                },
                {
                    "sent": "So I think that maybe that might be the best example.",
                    "label": 0
                },
                {
                    "sent": "Then I will stick to this example so we so previously sequences of amino acids.",
                    "label": 0
                },
                {
                    "sent": "You know, we know that some some amino acids are closer to other.",
                    "label": 0
                },
                {
                    "sent": "I mean like they are not equally different or they are not orthogonal.",
                    "label": 0
                },
                {
                    "sent": "So you can think of this.",
                    "label": 0
                },
                {
                    "sent": "There are a lot of actually distance matrices between between amino acids and one of them is the blossom matrix for instance.",
                    "label": 0
                },
                {
                    "sent": "And then if you're giving this.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This matrix between the beans there is something which is called the transportation polytope, which you can use to find the best transport from one histogram to another.",
                    "label": 0
                },
                {
                    "sent": "This has also been cast in another framework, which is like you have factories and you have shops.",
                    "label": 0
                },
                {
                    "sent": "Each factory produces some amount of goods and each shop needs some amount to sell to its customers.",
                    "label": 0
                },
                {
                    "sent": "What is the best way to send the goods from the factories to the?",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To the shops and this each of those schemes to transport some raw materials from some goods from the factory to the shops is known as the transportation polytope.",
                    "label": 0
                },
                {
                    "sent": "So transportation polytope is just set of matrices such that all the other lines will sum to the the elements of arm and all the columns will sum to the limits of the.",
                    "label": 0
                },
                {
                    "sent": "In the statistical framework this is also known as matrix matrices with six marginals.",
                    "label": 0
                },
                {
                    "sent": "So we have this big thing.",
                    "label": 0
                },
                {
                    "sent": "The transportation polytope and.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What the most control which distances or this from transportation distances?",
                    "label": 0
                },
                {
                    "sent": "It's just the minimum of this criterion which will tell me how costly it is to move all these goods from this shop to the other from one factory to that one shop.",
                    "label": 0
                },
                {
                    "sent": "Given that I have a cost which is which is a.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is metrics.",
                    "label": 0
                },
                {
                    "sent": "So if we usually this is, you can easily find this optimal transportation.",
                    "label": 0
                },
                {
                    "sent": "It's known as you can usually do it with simplex algorithms or any linear programming.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rhythm, so if we take a picture of what happens when we compute the more controllers distances like we have this big polytope, each of the elements of this polytope is a is a matrix, and we know that the optimal the optimal transportation plan is always the vertex is always somewhere there, and usually what do you do when you compute the earth movers distance or transportation distances that the only thing that you consider is just the value of the criteria and this vertex?",
                    "label": 0
                },
                {
                    "sent": "So my question is, can you actually?",
                    "label": 0
                },
                {
                    "sent": "Take a look at the whole polytope, because the whole point of it is quite interesting.",
                    "label": 0
                },
                {
                    "sent": "It tells you how you can transport one Instagram to another, and all of these configurations are quite might be interesting to define.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Marriage between 2 two histograms.",
                    "label": 0
                },
                {
                    "sent": "So very first example, a very simple one is the case of the permanent, so the permanent is is very related to the determinant.",
                    "label": 0
                },
                {
                    "sent": "If you indeterminate you will have minus one power.",
                    "label": 0
                },
                {
                    "sent": "The signature of the permutation, so it's it's very.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Similar, so it turns out that you have two clouds of points of equal size and that.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You have kernel, so this is pretty much setting that we've been seeing in the in the.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Afternoon then the permanent of the gram matrix is actually a positive definite quantity, so you can use it as a kernel between between 2 clouds of points.",
                    "label": 0
                },
                {
                    "sent": "And if you take.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You look at it.",
                    "label": 0
                },
                {
                    "sent": "She just assumed that.",
                    "label": 0
                },
                {
                    "sent": "You're you're you think your team metrics and you assume that it is negative definite matrix.",
                    "label": 0
                },
                {
                    "sent": "That means that the exponential minus the pointwise exponential of this matrix is positive definite kernel.",
                    "label": 0
                },
                {
                    "sent": "Then actually this permit this kernel permanent is just a sum over all possible permutations of the of the distance.",
                    "label": 0
                },
                {
                    "sent": "I will show you the next slide you will have a very intuition on this.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Think so.",
                    "label": 0
                },
                {
                    "sent": "Imagine I have two sets of points to the white car, the white ones and the blue ones.",
                    "label": 1
                },
                {
                    "sent": "And of course there is an optimal permutation.",
                    "label": 0
                },
                {
                    "sent": "I mean there is an optimal transport from from the white points to the blue points, so you can see that if I move this point here this like this, the total sum of the distances here is that it's the shortest one.",
                    "label": 0
                },
                {
                    "sent": "But then if I only use this as a kernel, not only I'm.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure that it's definite, but then I. I mean, you were losing the information, which is also that there might be a lot of other plans which are actually are not very costly.",
                    "label": 0
                },
                {
                    "sent": "So I want to take this into account and this is what the permanent does.",
                    "label": 0
                },
                {
                    "sent": "So what is the problem of the permanent?",
                    "label": 0
                },
                {
                    "sent": "Is the computation of the permanent of a matrix is very very costly, but there are now some sequence important sampling algorithms which which make it which can run into the end to the power seven roughly.",
                    "label": 0
                },
                {
                    "sent": "So that's still quite a lot.",
                    "label": 0
                },
                {
                    "sent": "So I will.",
                    "label": 0
                },
                {
                    "sent": "I have done some experiments with 2000 points of 20 story 2000 examples of 20 points.",
                    "label": 0
                },
                {
                    "sent": "It takes quite awhile and I haven't run actually those experience with the latest techniques.",
                    "label": 0
                },
                {
                    "sent": "This sequence, important sampling techniques, but well, it's obviously limited in terms of computational power, but I think it's interesting to see that you can define such occur.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now I'm going to go to something a bit different, so when I really have histograms, I have this interesting polytope.",
                    "label": 0
                },
                {
                    "sent": "I would just like to mention that the previous part of their work considering actually is the big positive of all possible whose vertices are the permutation.",
                    "label": 0
                },
                {
                    "sent": "But now let's really address the whole polytope, and one can also prove that the volume of the polytope.",
                    "label": 1
                },
                {
                    "sent": "So if you remember the positive look like this, well, the volume that is the number of transportation plans.",
                    "label": 1
                },
                {
                    "sent": "He's actually also opposed.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Definite kernel between between the histograms.",
                    "label": 0
                },
                {
                    "sent": "Actually it's very, very difficult to compute the volume of a polytope.",
                    "label": 1
                },
                {
                    "sent": "In exact terms.",
                    "label": 0
                },
                {
                    "sent": "It's a.",
                    "label": 0
                },
                {
                    "sent": "It's a very active branch of mathematics.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But there are some some approximations which which have been proposed, and there are here.",
                    "label": 0
                },
                {
                    "sent": "Also there are some sequence important sampling schemes which might be.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Interesting.",
                    "label": 0
                },
                {
                    "sent": "So how you can prove that the volume is positive definite I will go.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Very fast because I think maybe this is more like a detailed.",
                    "label": 0
                },
                {
                    "sent": "The idea is that for each of the matrices of the polytope you can you can there is objection with a pair of what it's called generalized young Tableau, and so you can.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And actually define the volume of the polytope just simply the sum of something that looks like a Mercer kernel.",
                    "label": 1
                },
                {
                    "sent": "Each of these coefficients is a number, so this is the number of generalized young tableau of shape data and of content see.",
                    "label": 0
                },
                {
                    "sent": "So we found some nice expression like this.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That means this positive effect.",
                    "label": 0
                },
                {
                    "sent": "Then there's another topic, but and I will just finish on this, which is also very very hot topic in combinatorial switches to compute the generating function of the polytope.",
                    "label": 1
                },
                {
                    "sent": "So you remember that we computed.",
                    "label": 0
                },
                {
                    "sent": "We were discussing about the volume for the generating function is just simply where the volume is just simply the generating function evaluated at T = 0.",
                    "label": 1
                },
                {
                    "sent": "And actually it turns out that people use first compute the generating function and then evaluate it on zero to compute the volume.",
                    "label": 0
                },
                {
                    "sent": "You cannot compute the volume straightforwardly.",
                    "label": 0
                },
                {
                    "sent": "You have to compute first.",
                    "label": 0
                },
                {
                    "sent": "Is this big big generating?",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it's also very, very difficult to compute, and there are also some sequence important sampling results which are really being brought forward.",
                    "label": 0
                },
                {
                    "sent": "Those are very recent recent results from last year.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so I've been one I've been thinking.",
                    "label": 0
                },
                {
                    "sent": "What kind of weighted scheme can you apply on on this generating function to obtain a positive definite kernel?",
                    "label": 0
                },
                {
                    "sent": "Of course, my idea would be to have something that would be just simply one here, so that we might be able to directly the generating function.",
                    "label": 0
                },
                {
                    "sent": "So far it hasn't.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Able to improve that.",
                    "label": 0
                },
                {
                    "sent": "But they have been have proved this result, which is a bit more complicated instead.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But when you when you when you really when you particularize it to some, some coefficient equals zero.",
                    "label": 0
                },
                {
                    "sent": "This is officially a Fisher Yates statistic for Mattress is with fixed margins and in this in this particular example you only have a weight which only depends on the on the diagonal terms.",
                    "label": 0
                },
                {
                    "sent": "So the proof of all these are a bit complicated but be very happy.",
                    "label": 0
                },
                {
                    "sent": "More than happy to discuss with you with your interest in that so.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some very, very elementary experimental results so that those are the results I was talking to you about, and they're not particularly exciting, so I guess I need to work more on them, and the idea is just taking 2000 images of the MACD database so you have 10 classes and I just sample randomly 20 pixels and in the first in the first column I first do some Parson Parson smoothing.",
                    "label": 1
                },
                {
                    "sent": "So I put a Goshen small Goshen of varying with.",
                    "label": 0
                },
                {
                    "sent": "On the each of the pixels, and then I apply directly Goshen kernel and in this case, or this is pretty much what Alex was presenting at.",
                    "label": 0
                },
                {
                    "sent": "In this case, I'm just I'm just taking the means of these points and calculating the distance in the arcade chess.",
                    "label": 1
                },
                {
                    "sent": "And in this case I use this permanent kernel, but this is really very.",
                    "label": 0
                },
                {
                    "sent": "Preliminary stuff, so thank you very much for staying so late.",
                    "label": 0
                }
            ]
        }
    }
}