{
    "id": "eulr3o6qyu64k6ttsf5ljnxmhxlqrzpw",
    "title": "Tricks that our cells use to express their genes in the brain, and how aging affects this",
    "info": {
        "author": [
            "Jernej Ule, Department of Molecular Neuroscience, Institute of Neurology, University College London"
        ],
        "published": "Sept. 22, 2017",
        "recorded": "August 2017",
        "category": [
            "Top->Medicine"
        ]
    },
    "url": "http://videolectures.net/kolokviji_ule_aging_affects/",
    "segmentation": [
        [
            "Philip's Brown Dinosaur more Visalia into the trustor.",
            "So I gotta second issue is different but I am a professor there now or later.",
            "See this enables now with this knowledge which also but scientistic bill.",
            "Yeah, they will actually be set with Eminem, your diploma review technically facultatively Bonnie Inator doctor owner, Rockefeller Institute to New York, China Vestal Auxiliary Institute Yep.",
            "Even more pain your student lesson very negative answer, but I'm more than your name.",
            "Luther, yeah, they will want to know is it certain University College London?",
            "This colonoscopy no panel, no stone Institute to plan it later.",
            "As I synthetic zero damage due to his drug Kissimmee references clicking, but some new minion Kibl mid Scenic View technology innovation decision temperature.",
            "Go ask Pena just avoiding could engineered the top women doing approach to tell its story.",
            "To quote Majeski sell its own audio.",
            "Is Roger gay?",
            "No interpret.",
            "Simple wasabi, supremum spray, millimeter comstar, another Mokoena packet.",
            "Zero of audio new never deviate union bullies me.",
            "Click your name, so do it to the circle to the generic string Informatica.",
            "Hulu Blony Newport Rocio Novick bill informants key already not there to the smaller.",
            "This blood pressure Ponente Moreira separating the guy, insulted aquatic partaker.",
            "Scoop is whenever a Mooney which organ is that is another moon.",
            "If his break with corporate and corporate challenge.",
            "Yeah.",
            "Avoid images alone.",
            "Piranha copper result cuerpo mamino peirano.",
            "In incidental to Steven Gordon with Anna there, it's a pretty active here is that there is a career neonate witness should be greater starting renting.",
            "I support request and consolidation grants.",
            "In #8, North Dakota and provider on Chippenham, proper shot in a constant stream.",
            "Prosigna yeah so much for Mac now.",
            "File a file and establish new Tekken welcomes to Villa.",
            "My mom Crapo glass, which consumer models delicacy.",
            "Is Bravo and Co in?",
            "Jack in the ass Mccrossen brush sticker bomb shots cause religion tematica Nicotera Mal booster conanicut animal.",
            "But cause blushing in Mr Dennison private coder sachitra zoom level so knesek irritable Krishna story in Melbourne on the tile.",
            "Discussion the Vulture centerburg proston cons Dellacroce captivity Rama.",
            "So the risk of acute low in the Sunday load Cygnus to production.",
            "About Easter, Chica, Nashik, knickers, cow unpack some medicine.",
            "If Alex attackers attackers Leach Nick Bosa van met with Raucci into it.",
            "So the ticket taker Shinies Taranaki blow Prospero Thematical think of production code because the chill in."
        ],
        [
            "And I purchased splash, not Snow Tech Chase a similar dilemma.",
            "Search image search.",
            "Games, cakes procedure and they want proposal proper clopen English.",
            "You know customers, dealers nabbed over public exposure, presuming slovensko.",
            "Unless you watch it, please provide an opened up with the virus in newer.",
            "So we are interested in gene expression and what does that mean?",
            "Genes are encoded in our DNA so you can see here the very top DNA is this double spiral which is encoded which is carried over from one cell to another.",
            "When our cells divide and usually chromosomes containing many many different genes with the DNA.",
            "But these genes cannot be carried over into protein if you don't make this intermediate molecule called.",
            "RNA and RNA molecule usually carries information for one gene.",
            "You kind of convert the DNA into an RNA which is chemically similar molecule, and at this stage of RNA lots of interesting things happen are in.",
            "It can be recombined re spliced together in interesting ways before you can make a protein and this is what I was quite interested in from the very beginning because this gives a lot of dynamics to ourselves, we are not fixed by our DNA.",
            "We often the genetics, the air of genetics brought a little bit of determinism in our kind of set of understanding ourselves.",
            "Initially it gives us a sense that we're so fixed by our genes, but studying RNA gives you a sense that actually we can step beyond our genes and we can be much more dynamic and fluid in the way ourselves work.",
            "That's my attraction to the RNA now."
        ],
        [
            "To understand a little bit more what we study when we come to RNA, the first example is something that is called exon skipping.",
            "So the first thing to understand about our genes is that our genes are mating pieces.",
            "They're like a puzzle, you have different pieces that need to be spliced together, combined together to make a product, and that product is called an M RNA, which is then translated into a protein.",
            "And what is interesting that this pieces are not fixed?",
            "So maybe 1 gene in one cell type?",
            "Will create one type of product and in another cell type another product during our lifetime during aging.",
            "This can change, so that's the first element of fluidity we have.",
            "These different pieces and there like a mosaic that can be combined together in many different ways.",
            "The simplest way you can control that is what you call X and skipping, so this little rat block in the middle can either get included or not, so the process is called alternative splicing so we can create a longer or a shorter variant.",
            "You have other ways to do that.",
            "One way you call this intern retention.",
            "So interns are those bits of jeans that are normally considered to be discarded and non relevant so exons are the blocks that are supplies together.",
            "An entrance or discarded.",
            "But in some situations the entrance actually are not discarded and they become exons, so they become included.",
            "So this is particle intra tension and the last one is alternative Poly generation.",
            "This is where the.",
            "End of this product will be so the jeans are kind of starting and ending in certain point, but the product itself may end early or later depending on this alternative Poly, then elation so this will be the end of the product and all of them give you all kinds of combinatorial possibilities of how to create the final product and we'll talk about all of them throughout the talk.",
            "The way we approached."
        ],
        [
            "Problem in our lab.",
            "First of all, this is our molecular problem.",
            "How do the RNAs for the RNA is this little string here that you can see?",
            "How does this RNA interact with other types of molecules?",
            "And we're interested in RNA binding proteins.",
            "Proteins are the main machinery in ourselves that control everything.",
            "They are the actors on the stage of life.",
            "And the RNAs are the carrier information.",
            "But during this step of carrying the interact with proteins that interact with other types of RNA such as micro RNA's and we are interesting how this all assembles together to decide the fate of the RNA to decide what happens to this RNA.",
            "So this is our molecular question.",
            "Biologically, we're interested in neurons and why neurons becausw.",
            "First of all, neurons have the greatest diversity of RNAs.",
            "One thing is, for example, an example here.",
            "They tend to have.",
            "Longer variants, so this Poly a tails and the position of the details in neurons tend to be further down in the gene and they somehow create longer regions in the RNA that allow more regulation.",
            "One reason why that's important is at the bottom, so if you see here an example neuron, actually the RNA's are not just present in the nucleus of the neuron, which is where the jeans are.",
            "Encoded in the DNA, but the RNA can be transported in the cell to all these distant processes, to the dendrites and axons, and in there you will have just the RNA, and this RNA can be then the source of regulation locally as a signal comes into neuron, you can make new proteins locally, which allows much faster control of gene regulation.",
            "And these RNAs are very diverse and control very interesting things such as memory.",
            "The guidance of neurons during the development and.",
            "Somehow underlying a lot of biology of the brain and finally the reason we're interested in in the RNA is because you said important for lots of diseases of the brain, psychiatric diseases, developmental diseases, but especially in Europe, degenerative diseases.",
            "One disease where this particular important is a motor neuron disease.",
            "Maybe you haven't heard about it yet is not as famous as Alzheimer's or Parkinson's disease, but it's actually quite common.",
            "We have about 100 or one in 300 chance of getting this disease in our lifetime.",
            "The reason you rarely see a patient with a LS is because when you when you get a disease, you will have about maximum three years of survival rate and there's no cure to it and it's.",
            "Pretty bad disease because you are completely conscious throughout your brain is perfectly fine.",
            "You just cannot control your movement in the anti die because you cannot breathe.",
            "So you see how your body is like you're losing control of your body but mentally are completely conscious of the whole process.",
            "So it's a very sad disease and the the interesting bit is that a lot of genes involved in this protein.",
            "RNA interactions are implicated in this disease currently.",
            "9 RNA binding proteins already implicated so that mutations in these genes.",
            "Can lead to disease.",
            "Boris sitting here in the audience, was one of the first people who identified worked in the lab that identified mutations in this project.",
            "It before these three was the first protein identified and then other proteins later on and have can talk to him about the details of the relationship between disease and proteins.",
            "But that underlies the importance of this type of mechanism.",
            "For for the disease also."
        ],
        [
            "And here is an example of how this protein looks like in a tissue from a patient.",
            "So if you take a spinal cord from an LS patient and look at these neurons that are dying in this in this tissue you can see this big blobs that are stained by this protein called TDP 43.",
            "So this Brown inclusions in these neurons are consisting largely of this RNA binding proteins which form almost like solid blocks in the cells and.",
            "It's believed that this is what ultimately kills these cells.",
            "This is like this toxic thing that somehow got into you cannot escape away from this aggregation phenomenon.",
            "And this is involved not just in LS but also in another disease called FTD.",
            "Frontotemporal dementia, which usually links to the generation of the cortical tissue, the frontal and temporal regions of the cortex.",
            "And."
        ],
        [
            "Here to just summarize, we have lots of different irony binding proteins involved in diseases when they're mutated, and most of these diseases are age related.",
            "So one is cancer, so you can see here on the top is cancer in connected to lots of mutations in RNA binding proteins and down here we have neurological disorders and especially LS, and this is already a bit outdated.",
            "We have lots more candidates now, but you can see that lots of Arnie binding proteins when mutated will lead to disease and what seems to be the kind of underlying.",
            "Similarity between this is that they contain this, what's called intrinsically disordered regions.",
            "So proteins are known to form certain type of structures like Alpha helices, beta sheets and historically we have put a lot of attention to these structures that they form certain domains, but we have been ignoring the regions of proteins that are relatively hard to understand because they don't have a defined structure in solution.",
            "In solution they would be kind of floppy and disordered, and we don't really know how do they look like in cells very much.",
            "So they were kind of ignored as less important, but what is clear that most mutations leading to disease are in these floppy parts of the proteins and in the last years these regions have been the front page of most of the work in our field.",
            "And I'll tell you a little bit more about that later on.",
            "So now I'll go through three stories that kind of gives you an example of how we tend to approach the problem.",
            "So the 1st way."
        ],
        [
            "To approach the problem is to model the disease with human cells.",
            "And we are using these cells called induced pluripotent stem cells.",
            "This light is kind of similar schematic of how these cells are derived, so you will most simplest way to do it is to collect some skin from patient or from a control individual.",
            "Often you will take a family member that has a disease and it doesn't have a disease and then you will from this fibroblast create cells that are very similar to stem cells, so they're pretty potent.",
            "So this is technology that was now developed by.",
            "Yamanaka about 10 years ago and the stem cells can then be differentiated in any other cells in our body and neurons are actually some of the easiest cells to differentiate from these stem cells.",
            "So then you have pretty much a brain in a dish nowadays.",
            "You can already create organoids that look almost like with all the brain layers and can survive for years in culture and can respond to light.",
            "Can be connected to little eyes and culture and you can actually shine light onto the eye and see.",
            "The visual cortex of that organized to respond to that people are doing quite crazy things already, but of course that's not like a brain, but it does have a lot of features of disease.",
            "When you take a cell from a patient and then culture it in this in vitro situation, you reproduce lots of those molecular phenotypes of disease through that.",
            "So this has been a very valuable source, not so much to my group, but to our closest collaborators that we work with of modeling the disease.",
            "So once you have these neurons in a dish.",
            "You can on one hand do high throughput screens to screen lots of drugs to see what will actually Miller 8 the phenotype.",
            "You can look at candidate drugs, drugs that are already approved and just see if they will do something you tested first on these cells before you actually test it on humans.",
            "Or you can actually you can see now this personalized therapies so you can create cells from certain patients and test whether drugs will work on them before you go to those patients.",
            "'cause it's becoming clear that diseases such as cancer and your degeneration.",
            "Even if you call it a certain disease, can have many different genetic causes and they can respond to drugs very differently.",
            "So that's kind of 1 technology that we used and I'll ghost."
        ],
        [
            "After the conclusion here, I'm not going to.",
            "Describe the whole process of how we came to this findings and order details.",
            "Because we don't have time, I'll just give you the takeaway point and also how we did this collaboratively.",
            "So for this story was driven the data production with driven by Claire was a joint PhD student between my group and Ricky Patton.",
            "Ricky is the expert on the I PS cells.",
            "He's actually clinician, spends two days a week working in the clinic with the LS patients in three days a week, leading a research group modeling the disease.",
            "And he has developed lots of techniques to culture these cells and develop differentiated into motor neurons.",
            "So he's a real expert and Claire has worked between our lab.",
            "So she used the molecular expertise of our group and the seller expertise of Ricky's team to produce the data for this study.",
            "Rafael is a computational biologist.",
            "Her background is actually biology, but she learned computation once she joined the group of Nicklaus Comp with my collaborator in London is a purely computational group.",
            "And he also has biological backgrounds.",
            "Most of people in his lab also biologists.",
            "But when they joined the group, they learn computation and they have enough knowledge to bridge these two kind of fields.",
            "Sorta fell, took the data and looked at in new ways and then came up to these observations.",
            "So there's observations she found is the following.",
            "So mostly when people so far we're looking at what's going wrong in the IPS models of disease.",
            "They were only looking at the motor neuron station, the end stage, so when they fully differentiate.",
            "Which takes about a month in the best case, you differentiate from a prepotent cell to motor neurons, and then after a month or so, depending on the protocol, might take several months.",
            "We now have differentiated neurons and then people checked what happened with the RNA.",
            "We designed the study a little bit differently, with designed it in such a way that we checked what happens with the cells at different stages during their differentiation.",
            "So we looked at this stage.",
            "Is the prepotent stage neural precursors.",
            "So here these are cells are kind of still proliferating, they haven't.",
            "Turned into neurons yet, but they are already on the way towards that direction.",
            "Then we have precursors of motor neurons, so they already specified that they will turn into motor neurons, which are the neurons of the spinal cord, but they're still proliferating.",
            "Then we have post mitotic motor neurons.",
            "So these cells are now looking like neurons.",
            "They have different, they have their processes, they're not dividing yet, but anymore, but they're not yet connected in such a way that they will have electrical signals going across them.",
            "And then the final stages.",
            "Electrophysiological immature motor.",
            "Neurons with the synapses that have proper neural neural networks.",
            "So far, people have been mainly studying this stage, and now we looked at all the stages and the main finding that we see.",
            "So we compared 4 lines from control individuals, some from the same family as a patient and three cell lines with different patients with two different mutations leading to disease.",
            "And saw that there was kind of a clear cut distinction between them in terms of the RNA coming from these cells.",
            "And the takeaway point which you see this in this diagram is that in airless, this changes that happened during the development and differentiation of this program of changes, at least over its motor neurons was speeded up.",
            "It was too quick, everything happened a little bit too early.",
            "We didn't see a lot of changes that were really unique to LS.",
            "There didn't seem to be that.",
            "The program is completely off, it was just the timing of this program that was off.",
            "Things were happening a bit too quickly and the things you can see are mainly affecting these different stages of RNA processing.",
            "The three parameter Regulation is alternative pollination in an intern retention, those two aspects were mainly affected in LS not so much.",
            "The classical alternative splicing and there was absolutely no change in transcription, so some of you might be familiar.",
            "This first stage of converting from DNA to RNA.",
            "Completely normal and unaffected.",
            "All of the dynamics was perfectly fine, so there's something that happens after the irony is made, and then from there on it goes on too quickly to the next stage and so just to tell you a little bit more about this in turn retention.",
            "So we looked here.",
            "In this model we looked at one type of mutation in a gene called VCP, which is not a gene that itself participates in protein RNA interactions, but the product of the gene VCP protein.",
            "Affects the dynamics of these RNA granules that I mentioned before this contact.",
            "Larger complexes between protein, RNA.",
            "It controls how they how dynamic are they are how they turn from one type of complex to another."
        ],
        [
            "And but here we looked at VCP as I show you here a little bit more in detail, so we have two different mutations and for internal attention you can see that this first staged neuronal precursor we're having twice as much of intern retention products that are happening very quickly than in the control and what is supposed to happen in the later stage of the precursor motor neurons is already happening in the neuronal precursors.",
            "So somehow it's skipping ahead.",
            "Everything is skipping a little bit ahead when it comes to intern retention, which is the simple thing down here that this red block is being retained little too quickly and."
        ],
        [
            "The same thing happens also in other types of these models of mutations of LS so fast is an RNA binding protein.",
            "If you have the recommendation on binding protein, we see the same entrance being retained too much and sod one is actually a protein that is very different and was supposed to be completely different pathway.",
            "Nothing to do with Arnie Biology, but here we again see this does happen.",
            "Is the same kind of common phenotype that includes all of the mutations leading to the same disease even though they are.",
            "So far they were supposed to involve very different mechanisms, so we were looking at what is kind of mechanistically a common aspect of this disease that has been one big problem in this field because we have a huge number of different mutations leading to the same disease, and it was very hard to know what is common.",
            "So this is one way to model disease which is using this human cells.",
            "Now the next."
        ],
        [
            "Roche, we're having is to really understand what's happening to the organized.",
            "The real molecular level, so we see something is happening to quickly, but how is this process relevant for the seller?",
            "Decisions that they're making, and how is it regulated?",
            "So imagine that this is how an RNA molecule looks like.",
            "This is slightly more realistic to the way I showed before.",
            "It's not just a string, but it's a string that is kind of wrapped on itself and forms lots of structures inside RNA.",
            "Conform also some type of duplexes within it.",
            "DNA has this long double spiral that is connected to.",
            "Strings are connected together with RNA.",
            "This happens internally that this RNA can wrap into itself and form this type of mini spirals inside.",
            "And what is important with the RNA."
        ],
        [
            "It is also coated by proteins, so as soon as an RNA is made then different proteins bind in different positions and then make the kind of the control of that RNA from whatever happens next.",
            "So this is our molecular problem.",
            "How is this important for LS?"
        ],
        [
            "And the way we tend to approach this is now.",
            "This is our grand strategy.",
            "So on the top left where first trying to identify across our whole all of the RNA seen ourselves.",
            "How are these RNAs interacting with proteins?",
            "So for that we developed some methods called Clip I clip high clip where we can cross link cells or tissue.",
            "You can even take human postmortem tissue just expose it to UV light for a few seconds up to 30 seconds and that will create a covenant bond between proteins and RNA.",
            "That covenant bond can be done a way for us to purify everything and identify those interactions.",
            "We can also look at computational features, sequence, structural features of those RNAs that are of interest on the right.",
            "We are interested what is actually the commonality of those RNAs that are bound by certain protein?",
            "How are they regulated?",
            "How do they change when you take away certain protein?",
            "Does the RNA splicing change on a population change and then we bring that all together computationally to define certain kind of general principles?",
            "One thing that we tend to work on is something called.",
            "Training Maps I'll come to that later to see how the position of interactions relates to their functions that we're trying to connect the left and the right aspects here, and also how different proteins combinatorially act on the certain RNA.",
            "How do they bind next to each other to achieve certain common functions?",
            "So that's more mechanistic research and on the right we are trying to understand the biology of the cell.",
            "So how does that allow cells to make their choices?",
            "So I'll now talk first about this aspect and then to the one on the right.",
            "And."
        ],
        [
            "And so, as I mentioned, we used a technique called clip.",
            "So just shortly guide you through that because we develop that and after crosslinking that issues.",
            "I mentioned, we then lies the cells with some detergent.",
            "So now we have solution of molecules and at this stage we actually add an RNA so that we fragment the RN into small pieces, so that we only left with those pieces that are actually cross linked to our protein of interest.",
            "And then we can purify that protein.",
            "We can use that magnetic bits that stick to the protein with an antibody.",
            "And on that stage we link the RNA to a specific sequence which we call adapter so we can synthesize certain sequence and link it to our RNA purified that complex get rid of the protein and now the .6 we have now are RNA with that sequence that we added to it.",
            "And let's sequences allowing us to then amplify our RNA of interest so we can amplified with what's called PCR and then in the end we use what's called high throughput sequencing.",
            "So this technology again that really changed the way.",
            "Work is done in molecular biology labs over the last decade.",
            "We can get millions of sequences for very affordable price and by sequencing now across all of these sequences kind of short RNAs that we're crossing to our proteins, we get a very good sense of how does this protein interact with all of the RNA into cells.",
            "So we somehow we froze the cells or tissue in a certain stage and now we have a readout of everything that's been kind of going on in the Contacts between molecules.",
            "And this is how."
        ],
        [
            "That kind of first study which was published in 2011 looked like for the protein called TDP 43.",
            "So each of these little blocks you see here, this is really complicated slide, so I'm not going to explain everything but the main thing to take away of it is that each of these little.",
            "Rectangles you see is 1 binding site on an RNA.",
            "This is what we got from this method called clip.",
            "It tells us this protein was cross linked to that position on that RNA.",
            "On the top you see the diagram of exon skipping.",
            "That's what we're looking here.",
            "We're looking at the process of whether Exxon is included or not and what we are distinguishing.",
            "Here are the actions that are enhanced by our protein.",
            "So if the protein is present, this action will be more efficiently included in the message, which are here in red, and the ones that are depressed which are in blue.",
            "And our hypothesis is that the protein can do both things, but the two functions are distinguished by the position where it binds on the RNA.",
            "So this was actually something that we started with eyelash with my brother.",
            "He did the first computation analysis for our data back when I was still in New York.",
            "Our first models of this was were derived at that stage and we kind of continue with this concept that when you see that, for example, here at all, the blue rectangles are all piling up just upstream.",
            "Of this regulated exons and that means that when protein is bound right next to the Axon to repress the axons and the red boxes are further downstream, they are somewhat different.",
            "Position so tells you OK, there's some distinction, but the number of these actions that were regulated was not very high compared to our other proteins, so we actually started thinking maybe this is not the main thing that this protein is doing.",
            "It did follow certain principles, but I didn't really jump out as this would be the primary function."
        ],
        [
            "So we started thinking about this other function, quote alternative polyadenylation, where deaminase are ending and here you see this is an example of a gene.",
            "This is how you look like a gene in what you call the Genome browser, which you can all log into.",
            "If you type genome browser into Google and then look at it.",
            "This is how the genes will look like.",
            "They have this little boxes.",
            "These are the axons and then this box.",
            "Here is a regulated one so it can get included or not and we know that TDP 43 promotes inclusion of this one.",
            "That's why it's in red.",
            "And this blue bars here are our clip data for every nucleotide on the RNA, we can say how well this protein cross links to that nucleotide, and we did that in different cell lines in embryonic stem cells and we also looked at healthy and diseased tissue from human brain tissue so we could again do clip methods in all those different approaches.",
            "And you can see that the binding of this protein overlaps with this green bits on the top, which is just the sequence of the RNA.",
            "So this protein tends to bind to sequences that are rich in UG dinucleotide.",
            "So the more of these huge repeats there are better the protein binds.",
            "Basically, that's what it shows you, but you can see that there is this region here on the RNA DNA, which is called 3 prime UTR.",
            "So this is an untranslated region.",
            "It doesn't generate a protein, but it's a regulatory region of the RNA and in there you can see actually the strongest binding site of this protein.",
            "Is in the three prime UTR that made us think that probably this protein will often regulate alternative Poly generation, which is mainly regulating the three prime UTR.",
            "And so we."
        ],
        [
            "Started working with this with Gregor.",
            "Is a computational biologist currently working at University of Siri who made this beautiful web server and you can look at this and you'll see all our data there, very beautifully presented, and here is now the RNA map of alternative polyadenylation, and so you can see here this red line here is aligned to the first Poly, a site that is being regulated in the gene when the pattern is in red, that means that that Poly site is enhanced so.",
            "This protein promotes the use of that Poly a site when it's blue, it means it is repressing it.",
            "And again we see the same pattern when you see the blue rectangles there's a lot of them just next to this Poly high side so it overlaps with the Poly a site so this protein can prevent the use of this Poly a site to repress it by binding close to there, probably by blocking all the important elements that needs to be recognized by other machinery's.",
            "But it can also enhance that side by binding further away, which is what you see here.",
            "But what was interesting here is that the number of dysregulated size was larger.",
            "It was much more of a clear pattern here, which made us think that we should really focus a little bit more on the ternative pollination to understand this protein and."
        ],
        [
            "What we notice when we compared the binding of this protein between healthy and diseased tissue.",
            "This was work started together with Boris.",
            "I see him smiling.",
            "This is again one of those things quite awhile ago that we keep on thinking about is that there are certain RNAs that are quite different between healthy and diseased tissue and there's one up there called neat one.",
            "So keep attention to that one you did see it really stands out in a way that it's bound much more in diseased tissue compared to healthy tissue and.",
            "What we notice?"
        ],
        [
            "When you look at these RNA, this is a non coding RNA, so these are it doesn't create.",
            "A protein is also become clearer there.",
            "Recent years that a lot of RNAs work on their own, the purpose is not to make protein, but they do something on their own and with this RNA still not completely clear.",
            "But we're making some progress.",
            "What is actually what these are and is doing.",
            "It's a very long RNA.",
            "You can see the protein binds all over this RNA and the best binding sites are dis repeats of hugely bits.",
            "As you can see here."
        ],
        [
            "And this is how this RNA works in the cells.",
            "It is a scaffold.",
            "Scaffold is like you know when you build a house, you first start by just making some basic wooden structure on which everything else can get attached.",
            "The same thing here.",
            "So this RNA is core structure to which other things can get.",
            "Attached is a very long RNA, so it creates these big bowl onto which lots of RNA binding proteins will be trapped and you can see with image in here how this looks like.",
            "It's called Paris Pickle and in the cellular nucleus you will have different dots like little droplets around which this RNA is present and other proteins are trapped in there and what is becoming quite clear."
        ],
        [
            "Our field now is that these droplets are actually quite common in ourselves and they have really important part of biology of ourselves.",
            "Paris speckles are some type of drop it you can see up there, but there are others.",
            "There's nucleoli speckles.",
            "All kinds of droplets are part of normal biology, but what is also becoming clear that in diseases lots of these droplets turn into solid things which are called this amyloid like aggregates on which you can see.",
            "Here is something that happens in the cycle zone and actually people even found it in vitro.",
            "You can just take one single learning binding protein, put it in vitro, underwrite type of buffering environment.",
            "And we start forming these droplets like oil droplets that are floating in the middle of solution.",
            "If you wait long enough.",
            "Then it might start turning into this type of fibrils, but if it contains a disease causing mutation, it will turn into these fibrils quite quickly and this form this weird structures that are irreversible, so these droplets are very dynamic.",
            "They keep on changing, but this solid structures become irreversible.",
            "They don't turn back very easily, and so these are the troublemakers.",
            "This solid structures, so we're quite interested in how this normal biology of RNA droplets like Paris Pickles links to the abnormal biology in the disease.",
            "So we're talking a little bit more about this.",
            "Para speckles now and need one RNA.",
            "So the 1st."
        ],
        [
            "Reservation that it's also potentially linked to.",
            "A LS came to this Japanese study in 2013 where they compared the motor neurons from healthy tissue from the one of a LS patients.",
            "And so the disparate speckles are happening in almost all motor neurons of diseased tissue of LS.",
            "But they are much rarer.",
            "In healthy motor neurons, indicating there's something promoting their formation, again agreeing with also observation that in disease tissue TP moves much more bound to this need one RNA.",
            "So they play some role in increasing their scaling up.",
            "The way."
        ],
        [
            "We approach this was to go down to the basics rather than go straight to disease.",
            "We decided let's try to figure out what is the normal biology of disparate speckles.",
            "And this was actually initiated by me, who is another Slovenian student.",
            "He spent a year doing a master project in our lab, then continued with me, had recur in Munich Namco supervisor of his thesis were just sending this paper out for publication and I will describe this story now.",
            "We could really breach together lots of different fields by going between the different labs.",
            "He also works with Boris on this perspective, so we kind of combining with the expertise and the main thing is that he could address this problem in the context of this cell fate choices that the cells are making during differentiation, which is not my expertise so much so he could get expertise from others, and so the question was what happens is very first transition from prepotency to the exit from pre potency where you have certain markers.",
            "You can see that the protocol he uses allows.",
            "These markers to be turned on, which you can see here in green.",
            "This is just kind of quality control analysis with facts."
        ],
        [
            "And he did also analyze the changes in RNA expression during different protocols of differentiation, and each protocol will lead to induction of different kinds of RNAs, but there's something common.",
            "There's a few genes that are always turning on when you differentiate prepotent cells, and one of those is.",
            "These aren't equal.",
            "Neat one again seems to be something that turns on very early on in differentiation.",
            "So once we notice that we said OK, maybe this is a good way to start by looking at what needs one is doing."
        ],
        [
            "And you can also see at the level of counting the looking at the cells and counting how these perspectives look like in the cells.",
            "You can see here on the way right?",
            "Or the pretty potent cells you cannot see para speckles in them.",
            "But the moment you just wait a little bit and differentiate them, you start seeing this little rat droplets here, which are the Paris speckles you're going to see.",
            "With old protocols you start seeing this dramatic induction of this little perspective.",
            "Droplets in the cells.",
            "You can see this at the level of RNA sequencing that on the top you have lots of reads covering the whole of the need to run after differentiation before you don't get many reads and what may have actually notice is that this is not an aspect that is regulated transcriptionally.",
            "The RNA is actually transcribed, even include potent cells.",
            "So this is nascent RNA which you can see immediately after transcription.",
            "You see transcription going through this gene, but."
        ],
        [
            "What's actually different is that.",
            "Post transcriptionally, the irony is processed in such a way that is degraded at in prepotent cells and Mika founded.",
            "This is regulated by this program called TDP.",
            "43.",
            "To summarize this, to make this story really short, we have two different variants of this RNA have this alternative Poly, a site that creates a short variant which we call this new version one and here in Rat in this red bars we show the binding of TDP 43.",
            "You can see that it binds just around of this alternative.",
            "A site and actually promotes the use of this premature pollination.",
            "And when you use this premature population, the RNA becomes degraded.",
            "So basically it's transcribed important cells, but because of TDP 43 it becomes."
        ],
        [
            "Graded so this is the summary of this, so the short variant is just degraded very quickly.",
            "And.",
            "Only after differentiation you can make the long mature RNA that conform para speckles and we think the reason partly for this transition is that if you look at the abundance of TDP 43 during this first stage is upon differentiation you can see that actually it is much more abundant in pluripotent cells and that's how it can prevent formation of this perspective."
        ],
        [
            "So again, we can see with imaging the two different isoforms now and we can see that in prepotent cells we will see only the version one isoform.",
            "We can see that both in mouse and human ESL sold experiments were done in both species here."
        ],
        [
            "And then Micah used genome editing to remove the first Poly eyesight just by removing that sequence required for recognition of loneliness.",
            "And he removed that.",
            "Then the Paris Packers could become present in the reporting stage.",
            "Can you see this version one not being the only one, but you can also see version 2 being made.",
            "And the same result happens when you remove TDP 43 from prepotent cells.",
            "Again, you can make Paris speckles so that kind of combines the TDP really is the repressor of that first only side."
        ],
        [
            "So TP regulates need one, but what about the other way around?",
            "Does need one which we know interacting with TDP 43 also affected before itself?",
            "So here we have mass spec analysis, appan removal or induction of need one.",
            "So when you remove that Poly a site to induce the need one RNA what happens to RNA binding proteins?",
            "Here we're looking how does that effect Arnie binding proteins on other types of RNA, cenam arenas and TDP?",
            "40 Three was one of the proteins.",
            "Of a complex here that is all shifted away from Ameren Ace when the neat one is induced in pretty potent cells.",
            "So somehow it says that need one is somehow competing for other RNAs, it pulls protein away of where that we use often is sequesters the protein, so need one also has some kind of inhibitory effect on TDP 43.",
            "Then hit each other.",
            "And we can see how that affects differentiation."
        ],
        [
            "So first of all, here we can see that if you overexpressed EDP 43.",
            "After differentiation, then differentiation is inefficient.",
            "So with what you called plus docs, that's induction of TDP 43 here in red then this marker of pluripotent cells is persisting so we cannot push the cells out of prepotent stage."
        ],
        [
            "And actually you see the same thing if you remove need one, so need one is again something that's required to allow efficient exit from prepotent stage.",
            "So this kind of decision of two cellular phase either kind of highly prepotent or more differentiated.",
            "That's something that these two proteins are both.",
            "These two factors are controlling TDP.",
            "43 prevents differentiation and need one promotes differentiation and."
        ],
        [
            "One way to explain it by looking at Poly generation, what happens with the choice of this Poly a tails during early different situation?",
            "So on the Y axis we just see changes in this Poly 8 tail choice as you shift from prepotent too early, differentiate the stage on the X axis is what happens when you remove the P43 from pretty potent cells and you can see there is a quite a close similarity between the two, so just the loss of TDP 43 on its own mimics.",
            "What happens after differentiation.",
            "So you can interpret here is that this decrease in the abundance of TDP upon early differentiation is the driver of this changes in Poly generation and one of the."
        ],
        [
            "Changes in this factor, called socks too.",
            "This is one of these Yamanaka factors I mentioned before.",
            "Factors that are sufficient to create a pretty potent cells include this one, so if you include this plus two other genes, you can create a pretty potent cell, and TDP is required to make this protein because it regulates the Poly a sites of this gene.",
            "You can see that in two different methods here, one method on the top is looking at Reed, just accumulating at the Poly a sites and the method below is the standard Arnie sequencing that covers the whole of the RNA.",
            "I'm not going to go through all the details, but the main takeaway point is in the PDP.",
            "RE promotes the use of the first Poly aside, which produces a more efficient socks to protein."
        ],
        [
            "So this is I mentioned is one of these core machinery of prepotency.",
            "And here you can see that if you remove TDP 43, the socks to protein on the Western blot is not so much detectable in these cells, so."
        ],
        [
            "This was kind of a simplified summary.",
            "There's a lot of complex things that you should discuss with me.",
            "Hope you're interested, but the main takeaway point is that we have what you call a bimodal type of switch.",
            "Here when you have two factors that cross inhibit each other, you cannot have both present at the same time, can have one or the other, so this type of or situation is very common in biology.",
            "When you have to switch from one thing to another and make a very clear cut boundary distinction between them.",
            "So we have a non coding RNA and protein crossing hitting each other.",
            "And on one hand, the Paris Speckles Act to sequester lots of Arnie binding proteins away, and these proteins might all be proteins that drive prepotent stage.",
            "So when you're sequestered in the cells can transition and go on to differentiation.",
            "On the other hand, we have to do before the three that changes three prime end processing this pollination in a way that promotes prepotent stage.",
            "And so this, we think, is now kind of discord.",
            "Machinery of cell fate choices that might link to the observation in LS that we saw that this transitions during the early differentiation with slightly too quick.",
            "Maybe that's because these mutations in LS promote the type of behavior like before this tree that somehow changes the fates in some interesting way.",
            "But this is completely hypothetic.",
            "We still haven't linked these studies together, but the third thing I wanted to mention really quickly, but I'm not sure if I have.",
            "Time action very quickly."
        ],
        [
            "Is how this links to aging, so we all know that this type of disease like motor neuron diseases happen after a certain age.",
            "And what is it that delays these diseases until certain stage of the lifetime?",
            "We've seen that in pretty potent cells, we can see the facts happening already very early on as they start differentiating the somehow Malak at molecular level, they're moving too quickly in this differentiation program.",
            "So why do these disease causing mutations only manifest themselves?",
            "Later in life, if in culture we can see the facts very, very early on, so our hypothesis is that actually our bodies are very good in compensating lots of problems that we have in ourselves.",
            "The cells can work with each other to kind of keep on any dysfunctions under control through most of our lifetime, but upon aging you can see here a variety of different kinds of processes in ourselves are starting to become dysfunctional or less capable of correcting any damage in the cells.",
            "And because of this, depending on which type of.",
            "Aspect of repair is deficient.",
            "Different type of diseases will arise upon aging and we are now interested in how this irony, biology we're studying links to the process of aging and we approach this in a kind of completely agnostic way by actually looking at human tissue postmortem human tissue."
        ],
        [
            "And the first study we did here was to collect tissue from mainly from patients with this frontal temporal dementia that I mentioned earlier, which also involves RNA binding proteins compared it with Alzheimer's disease.",
            "And on top you can see this frontal and temporal lobe of the brain.",
            "These are the lobes affected in front of temporal dementia and the kind of affects the way the patients the problems they have are quite different from Alzheimer's disease because they affect different brain regions.",
            "But this temporal lobe is affected in both diseases, so we could use it as a nice comparison between the diseases.",
            "And we saw here all the orange dots here are samples from disease patients.",
            "All the blue circles are cognitively normal controls, and one thing we notice that the words larger age.",
            "What we looked at here, we're actually all exons regulated by TDP 43.",
            "We had an assumption that the TDP 43 program is somehow implicated in the disease.",
            "It turned out in the end much more complex that we somehow stumbled into this phenomenon of aging, which we're not expecting.",
            "We're expecting all the blue dots to be on the same line, and that there will be no no contribution of aging.",
            "They were all controls.",
            "So we're quite surprised that larger age this blue dot started to move closer to disease.",
            "That was our main takeaway point from this slide, and you can see the blue dots also being very variable, so we have 95 year old sample here.",
            "That's completely the same as the younger sample in the study.",
            "And then we have some that are already at the age 50 and are quite close to the disease sample.",
            "So this is not predict if this is just a trend line that somehow it with H more more healthy samples will start moving closer to the disease state and we were interested about why that might be.",
            "So we took some representative samples that are either kind of having completely normal controls state or more in practice healthy state, but still closer to disease or the disease samples and we characterize them.",
            "In transcriptomic way.",
            "So here we just looked at 13 exons.",
            "But now we characterize thousands of axons with other techniques."
        ],
        [
            "And we notice that we have on one hand set of changes.",
            "Here is just a heat map on the left where you can see that all the controls are different from disease and we don't have a lot of signature of aging.",
            "So there is 1 program which is a disease specific program.",
            "And then there's another program here where you can see changes in processing that mainly distinguish between younger and older controls and all the controls are all next to the disease.",
            "So we can now distinguish this to different programs, but we didn't really know what they mean very much.",
            "We could see the different proteins regulated these two programs.",
            "So this program here would be often regulated by protein called PTB.",
            "And the other program up there is often regulated by protein called Nova, which is more neuron specific, and this is more PTB, some more non neuronal protein that's made more expressing glial cells, but that's all we could just speculate that."
        ],
        [
            "But we thought the 1st way to understand this a little bit better.",
            "So now understanding the context of the cell types of the brain.",
            "So here is just a little scheme of how the primary cell types of the brain interact with each other.",
            "So in order to have the neuron you have in the purple, you have the cell body of the neuron.",
            "This is where the jeans are stored in the DNA, and then you have these different processes going out from the neuron that contact with other cell types.",
            "You have this very long process from the neuron, which is called an Exxon.",
            "Where neurons sends the signal can go quite far away from the cell body to contact other neurons.",
            "And these bits are surrounded by type of glial cell type called oligodendrocyte inside the brain inside the central nervous system.",
            "And so these are good undersides insulated.",
            "These bits and allow this flow of information to be smooth and healthy and provide with nutrition.",
            "And then we have astrocytes which will be mainly contacting the neurons at the points of synapses.",
            "They will provide nutrients.",
            "They kind of give the metabolic support to neurons.",
            "We have microglial cells which are kind of immune cells of the brain.",
            "They scan through potentially infections of the brain, but they're also very important in diseases.",
            "You'll see later and then we have cells that are on the site of these blood vessels in the brain.",
            "This happened immune cells and they communicate between all the kind of.",
            "Blood supply of the brain and all the glial cells and astrocytes and so forth.",
            "All these cells are intensely connected, as you can see here.",
            "None of them can be studied in isolation, so we wanted to see.",
            "Even though our data is from a whole tissue chunk, where all the cells are combined together, we wanted to use computational tools to try to deconvolute this data and learn something about each of these cell types, and one way you can do that is to use available public data that tells you which genes are expressed only in a certain cell type.",
            "There kind of marker genes for that cell type.",
            "And by looking at those genes you can have some information even from a mixed data about what happens to each of these cell types and 1st."
        ],
        [
            "Very simplistic analysis here by just looking at this aging or disease specific programs that we saw earlier and we saw with things that are specific for disease.",
            "The only thing that jumps out is that neurons are dying, so the genes expressed in the neurons are dramatically going losten those and other patterns associated with neurons.",
            "So in disease this is known.",
            "You can look at that issue and you see the neurons are almost gone, so that's expected and nothing new.",
            "What is interesting in this aging associated program that was also present in disease?",
            "We didn't see this loss of neuronal signature.",
            "It was more the glial programs that were standing out a little bit, especially the oligodendrocytes.",
            "So we thought we need to understand this glial program a little bit more."
        ],
        [
            "So when we have about four years ago when we move to London with the Institute Neurology, we started interacting with colleagues there who have produced massive amounts of data from healthy populations across 150 individuals, and you can see here we have now different datasets that we could exploit the UK data set was with our colleagues is UK brain expression consorts.",
            "Him had over 1000 samples analyzed, then we have North American monitors, about 600.",
            "And then we have the information of different cell types in mouse and human that we could take it for data analysis and the lock is a computational biologist.",
            "Very good with machine learning, so she wanted to extract some meaningful information from all this data about aging and from this UK data we also had information about 10 different brain regions.",
            "So we had some information about the regional perspective on the brain and we had a good distribution across the age.",
            "We kind of have their ruffes distinction between young, middle and old age in these samples.",
            "And so we had all these different cell types in terms of expression profiles, because identify markers of these cell types and try to put it."
        ],
        [
            "Altogether and then the first takeaway point is that this microglia, this immune like cells of the brain, their expression signature is dramatically increased upon aging.",
            "The neural expression signature is slightly decreased upon aging, and you can also look at the regional components.",
            "So on the bottom each dot is 1 sample, but because we have 10 different regions of the brain, you have 10 different dots from every individual and at the bottom there color coded by the H. So that are the older samples and green are the younger samples.",
            "You can see if you look at all the dangerous side.",
            "If you look at the microglial markers they separate so we can really say microglia can tell you more.",
            "This sample is older or younger.",
            "Weather is when you look at neuronal markers there on the right.",
            "They don't separate these samples based on age but mainly based on region.",
            "So region is on the top.",
            "The color coding on the 10 regions is marked on the top.",
            "So for neurons regional identity is so strong that with aging it shifts only a little bit.",
            "With microglia, there's not of different regional differences in the brain, so the main changes are with the edge."
        ],
        [
            "And we were really interested a little bit more in other cell types, so it's clear that in disease microglia it's known that there kind of inflammatory state increases and that neurons become a little bit less functional, less active, so their expression goes down.",
            "So that was kind of expected, but we wanted to know.",
            "So what happens with other cell types, specially other glial cell types that are less well understood?"
        ],
        [
            "So we looked at.",
            "One hand, the imaging of neurons which we saw some changes in the program, and this was a very complex analysis with huge amounts of data generated and machine learning to detect these cells.",
            "This is just showing how you get started with this big image down to machine learning to recognize individual cells."
        ],
        [
            "What we notice here is that the largest types of neurons, the ones on the way right here that looks really big that those neurons decrease in their counts in the older brain, whereas most other cell type most of the neural types became quite unchanged.",
            "So there's something to do with the large size of the neurons and those largest neurons have this huge.",
            "What you call arbors huge connection tree and they need a lot of glial support for being functional for attaining their kind of activity.",
            "So it you might say is the reason because.",
            "These neurons are particularly sensitive is because something might be going on with clear space."
        ],
        [
            "We already got dangerous eyes that are wrapped around these processes from the neurons.",
            "So when looking at just expression profiles of these two cell types, we notice that astrocytes had kind of complex patterns depending on the regions different things were happening in Hollywood under sites, we may see this blue.",
            "Blue means that the jeans are mainly going down, which means these jeans for this type of cells are somehow downregulated.",
            "Also oligodendrocyte, similar to neurons and also we saw some interesting shifts in identity.",
            "So this is a regional expression.",
            "And that is the aging so you can see here that.",
            "The red cluster here is missing all the old individuals are clustered together in that red cluster.",
            "We having samples from two different brain regions from hippocampus and substantia nigra.",
            "Hippocampus is the region most implicated with Alzheimer's and substantial nigra with Parkinson's disease and those two regions are showing the biggest shift in a way they're not where they're supposed to be from the young brain, they lose their identity in the kind of shift together when it comes to this cell type, for example, so there was some.",
            "Loss of that regional identity of the cells.",
            "And some changes in expression so."
        ],
        [
            "But we should also look at what happens on the images of these cells.",
            "And again we did the same analysis of all you can decide to recognize how to count them in the."
        ],
        [
            "And we saw now a really interesting and dramatic decrease in their accounts.",
            "You can see here for the aging when you look at the oligodendrocytes in the middle panel, you see quite striking, decreasing the counts of oligodendrocytes, especially in the brain regions that don't have a lot of neurons.",
            "Those that are kind of more white matter like regions where the connections are happening within the brain.",
            "So that somehow comes altogether a little bit.",
            "So this is all very descriptive.",
            "We still don't know how to interpret what is the cause of this, But this gives you a sense of that perspective of looking at the human brain."
        ],
        [
            "So to conclude, we saw that there are changes in RNA processing in LS models on the IP S and the cellular models that are specific for some types of RNA processing and seemed to do something with the timing of that.",
            "And we think that this changes can be related to behavior of RNA granules such as para speckles.",
            "And discerning grandis can affect cell fate choices already in a culture.",
            "And.",
            "What we are also know very well that patients are fine during their lifetime.",
            "So even though in culture we see the facts, this is compensated in an Organism.",
            "So this developmental defects in RNA mechanisms are compensated until you come to aging and what in the end we see in the aging.",
            "Is there something different with this cell fates with oligodendrocytes we see this decreased in the accounts and that might relate to some molecular mechanisms of maintaining the correct fates of the cells.",
            "So I had part is is that we are studying now is that on one hand there compens atory mechanisms that are maintaining cells healthy in spite of some molecular defects throughout the lifetime.",
            "But this compensatory mechanisms become defective in aging.",
            "And then due to that loss, this RNA granules are starting to.",
            "Be apparent in the way that they perturb the cell fate choices and that leads to misbehavior, especially of glial cells, which eventually kind of leads to stress on the brain tissue."
        ],
        [
            "So to conclude, I mentioned already who are the primary leaders of this work.",
            "I also didn't mention to match before.",
            "Who is the person who is doing all the main computational biologists of the clip data and working on Eclipse Server also working together with Co gang Alice that is look eyes here now on making a really nice web server to present.",
            "That is our latest picture of the lab in front of the Institute and our main funders, especially the ERCA and European funds are very important.",
            "Thank you very much.",
            "I'm sorry to be a bit over the timing.",
            "Time for question of emo additional insulation impression.",
            "Translation decibels there should have had nothing 'cause it is slicker than a Kia mechanic.",
            "Natalie said the coast over shiny haleema mechanical.",
            "It's similar or chromatic capper.",
            "Nick Microdynamics renewal agricultural logo to my basic tornado intelligence going to Nikki.",
            "Stop liquor stores this stop near me, Anna Stickler, popular at the processor.",
            "To separate mechanical Michigan mechanical with simple molecular Po po Sam's Nick Day location.",
            "Stop nationella karacha Stover morgani gratitude.",
            "So vasculature as prime member of this color to Red Star package sticker in the second, which is particular to previous trees.",
            "Unpack maturation.",
            "Avoid some.",
            "Cross agrees that the coach in Scac.",
            "They question liquid droplets grazer.",
            "Biophysical Net which is to be a physician if an American circus.",
            "There was crucial as a mid kata dynamic, but still it's inquisitorial era in kite.",
            "Apricot is the culture of tiredness.",
            "Tonya composer personality ballism.",
            "Scope roshanak is exist today to the package mini mining in vitro.",
            "Kentucky pick boy.",
            "With more context Akiva insane, it's very noisy persona.",
            "Person.",
            "As you have around other priorities at the Cucina, Paterno, Spanier testkey accretive concoction.",
            "I put to turn us Tonya Cashman Smith Loma Hanscom Alioto Nick Restaino spaniel.",
            "Yeah, cross better interaction Med beta sheets in top shape processa Titisee to be physician osnova taper harder visional compression should.",
            "Unpack Groo clowns.",
            "Attacker ponytail Luchessa interacts in acquisition for Merit.",
            "Is a molecule is Anadarko visual portfolio terms of parade route for the complex signal, average Nana, Rozen denoting secretaries and appeared in the prayer?",
            "To go out or foggy and cold in God's radio, villagers saw me.",
            "Yeah.",
            "It's really pretty darn it.",
            "Super salty scammers animals visit steam Arantxa Parra Speakers Protv DLC agree to scissor semoran overs to Aaron Accuity DLC soda in vitro to request into that, I'm watching to draw secretly or not or booty.",
            "Saccharin need distance novatech Deltic perspective present.",
            "I need some.",
            "Treatments are Duston checks, Premiership city for mirror, Sony Kataria that need vision and Rivers 39 still leave Anna Nikova Ritsema editor and RNA editing.",
            "Approved Nasha Dominica vlog of antimatter Galaxy Note nurses need developer that could be built.",
            "Oils are verbal output per quarter session resume, it double cheese, queso druger naches setting strict orders not Ryan, eat dinner suppose they cash into the symbols to delusion, dubstep.",
            "Division of Nucleus originally typically keep for mirrors, while last granular prospectuses so many with Nagi, which enable Pogo stick with Anita Sarkeesian and Pack.",
            "Shouldn't ask cause Nova Nikki let's say so, but still it's illegal at risk by eloquently in vitro structured, seamless integration.",
            "Did Pirates attacker it was renewed Ogre and Odyssey Kba San die?",
            "She connected Richie Crona in drugs attack Ascension, which is double kill City protein.",
            "It can model, but not at the subnational located tryba interpreting Sammy said Lotus Core is earlier.",
            "Condense it, could they produce lots of toner in veterinary diet?",
            "Shiny show my mom choice a zerker Shawnee.",
            "Resume what should be said.",
            "Our Pritchard rubies Toaster Evanity, Paris Baker.",
            "So being negative interpretable.",
            "This yeah, this is the village dealer asked Rivonia.",
            "I'll put strain of analytics third Co curvature attic drug emotiva LS Customs Materials, direct narimani protein oblivion out strain of an interested Kona.",
            "And now you're between us.",
            "You're an out of a gear.",
            "Nick is visually sesamin code code that cheat noise.",
            "Private dynamic events inequality must know Ronnie.",
            "In code that they see each other, yes, we have Gina screening go in Brazil and is in a team coached.",
            "Apricot is the coach of 1/3 Nathaniel.",
            "Accordingly, Ramona the cocoa.",
            "Animal protein dispersibility.",
            "Public public truth.",
            "In a team dinner.",
            "Shakira shine yeah.",
            "Is cheese droga droga discipline nakaza listed.",
            "Konicki applicative.",
            "Nick Alpo Simon Says really smelly.",
            "We love our share this car and you put some of the context too.",
            "And OK julians Catawba yeah, but just as a model he petition kind be provincial, T applicative no thinky will Popovich anniversary keep available Pretoria and Gucci which of this one is looking laboratory where rupee America?",
            "Ali Resnica Nick Disruption network issues throughout relative history.",
            "No Sega.",
            "Kaname, but watch American should should be Pacific with Sedona.",
            "This test because they need us more cohesive connectors.",
            "But some temperature Bush corners none such as WPA artist smearing it secure.",
            "Or knowledge prelusion astute appearance CM docious serum.",
            "Back security just occlusion Avanza took a public textually.",
            "Formula study race.",
            "Revered agrace step sales architectures.",
            "Nick boom.",
            "Prison presentation and Compaq Machine as nicely with.",
            "Miley cracking the producer in district consistent, must never Do Club team with the pathetically addition is my list reveal.",
            "And Richie honest.",
            "Yeah Topaz then you must miss laptop's data center.",
            "One more cheese per minute test retrial chassis.",
            "Tried various trees at late paint brushes and Kentucky Aplica tuner sheet.",
            "20 code for the Miss under their projects is low risk of an opera duet.",
            "Could Slack off label toploader privacy training.",
            "Met with the producer.",
            "There was a clear.",
            "The social thing where it's a project to Douglas.",
            "Oh my gosh, no pressure on ya.",
            "Church in customs.",
            "Annotate me now.",
            "Donna's the team focus on nature, shine and the Premier Kiper Edea.",
            "The project Papa team, you just financier and everything and server with me.",
            "She should go.",
            "Concurrent Northampton, yeah yes, Master together, but the prescription be plat financier and noticed that this epilogue iach financial emotional steam unpack the Genco Lackner pray grant much matcha deal taker carpet luggage Noriega in the roster rocket is not liko vicino parameters and Nick and Nora Story continues in alternate piece on imposition.",
            "Flowers in the fray.",
            "In ear tickle abogo Nima Krishna Pro stroganoff, stroganoff, Zara, stink.",
            "I suppose it's still not in Redico Caribbean.",
            "Icarus Nanas, Mariana double doubles attack Mystic story, classic Red, Lago Unpacking Boy, potentially specifically at a situational secrecy preliminary.",
            "Normally there should have been a traditional Christian.",
            "Yeah, just eat my pleasure.",
            "Bad breath after terrace prestige made separate.",
            "Sweeney is a true demo Derby two Dibble, spatial tempered Rocio Pawsox Licia process to valuable to Skokie druggie in Zahrada.",
            "Celestial aodv ask statical spatially kioti store output Portugal, Korea.",
            "Cardamom yet neighbor Margaret Estatico spatially people do before new project to ensure hope timber dot porno coleus from area to Slovensko Papa Tim Weenie.",
            "Yes, I could not play.",
            "Show Cambridge is Cindy Lou.",
            "Is that connected to chemo to spoil last name cosmetic or funding?",
            "To contact some code beauty store snova or distributor Sam Gunderson Stavo in Mail.",
            "It's a narrow princesses, and they're typically have noodles.",
            "Healthier this now.",
            "West African black women's denim and veg cares masternaut mode.",
            "Granto Disney unpack missing the Angelus block chain function eras data.",
            "Bush at distinct positive medical.",
            "The chatter connect.",
            "Previously Deloitte is tenure track, the Lewis have a core funded Institute.",
            "Imitations to the Crick Institute.",
            "Only the pursuer, Somalia, D key phrase kapena until you did to be across the finances, chased up advantix late.",
            "Today, by his logic tonight 'cause it's your cabido garage Newark orphanage to tackle procedures.",
            "They language disappear, but there is available to dissipations jetco that is Pogan Paul Pena pray.",
            "In management, more match diabetes.",
            "The cheaper gone summer hours they pay started Nikos Ammo, so I'm gonna win March.",
            "Dasmarinas deliquesces.",
            "Yes, 20 numbers not range to charge.",
            "So many questions, but Portal Institute says it is achievement on dragon.",
            "Super Cool Examiner technology and the boys Meridell also inform at Sakura Bishop.",
            "In this most low supermodel, to some Nigel ludicrously dial feedback, help ask Dylan Network domestic teacher summer million equals loser talk.",
            "Is that Oscar beyond muscle cause Pantano provisions?",
            "Click into docushare DNS flush Nickelodeon.",
            "Conversion set Kaila Kona demos Linda because pasta wasn't reseal is Zaffina cylinder is Corning Gorilla.",
            "Nice persuaded equivalency honest question is Daniel is responding to my discussion.",
            "Eyes whispered Astra in honest.",
            "Just discovering them in.",
            "Nick isn't a dissolute distagon and packed with Nico interested listening to those non provisioned Coda.",
            "Chicken with Tuna ludim Lada compressible Hawkshaw.",
            "Nixon offers a Chapman over there, so is rain or heat transfer subnet in modest or cordon and scoop is nonya.",
            "Twin dislocated rehire.",
            "New chassis needs.",
            "Emergency Sonic team racing.",
            "London N2 problem.",
            "Squeeze that order.",
            "Mama sent Niko Stabilin last thing, which accent my ship.",
            "They knew that the boy currently pushing in.",
            "Quote.",
            "Not on another man, should reach back miles long of a day and yeah.",
            "OK, here is missing the boat owners the load over.",
            "Shankar fancy."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Philip's Brown Dinosaur more Visalia into the trustor.",
                    "label": 0
                },
                {
                    "sent": "So I gotta second issue is different but I am a professor there now or later.",
                    "label": 0
                },
                {
                    "sent": "See this enables now with this knowledge which also but scientistic bill.",
                    "label": 0
                },
                {
                    "sent": "Yeah, they will actually be set with Eminem, your diploma review technically facultatively Bonnie Inator doctor owner, Rockefeller Institute to New York, China Vestal Auxiliary Institute Yep.",
                    "label": 0
                },
                {
                    "sent": "Even more pain your student lesson very negative answer, but I'm more than your name.",
                    "label": 0
                },
                {
                    "sent": "Luther, yeah, they will want to know is it certain University College London?",
                    "label": 0
                },
                {
                    "sent": "This colonoscopy no panel, no stone Institute to plan it later.",
                    "label": 0
                },
                {
                    "sent": "As I synthetic zero damage due to his drug Kissimmee references clicking, but some new minion Kibl mid Scenic View technology innovation decision temperature.",
                    "label": 0
                },
                {
                    "sent": "Go ask Pena just avoiding could engineered the top women doing approach to tell its story.",
                    "label": 0
                },
                {
                    "sent": "To quote Majeski sell its own audio.",
                    "label": 0
                },
                {
                    "sent": "Is Roger gay?",
                    "label": 0
                },
                {
                    "sent": "No interpret.",
                    "label": 0
                },
                {
                    "sent": "Simple wasabi, supremum spray, millimeter comstar, another Mokoena packet.",
                    "label": 0
                },
                {
                    "sent": "Zero of audio new never deviate union bullies me.",
                    "label": 0
                },
                {
                    "sent": "Click your name, so do it to the circle to the generic string Informatica.",
                    "label": 0
                },
                {
                    "sent": "Hulu Blony Newport Rocio Novick bill informants key already not there to the smaller.",
                    "label": 0
                },
                {
                    "sent": "This blood pressure Ponente Moreira separating the guy, insulted aquatic partaker.",
                    "label": 0
                },
                {
                    "sent": "Scoop is whenever a Mooney which organ is that is another moon.",
                    "label": 0
                },
                {
                    "sent": "If his break with corporate and corporate challenge.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Avoid images alone.",
                    "label": 0
                },
                {
                    "sent": "Piranha copper result cuerpo mamino peirano.",
                    "label": 0
                },
                {
                    "sent": "In incidental to Steven Gordon with Anna there, it's a pretty active here is that there is a career neonate witness should be greater starting renting.",
                    "label": 0
                },
                {
                    "sent": "I support request and consolidation grants.",
                    "label": 0
                },
                {
                    "sent": "In #8, North Dakota and provider on Chippenham, proper shot in a constant stream.",
                    "label": 0
                },
                {
                    "sent": "Prosigna yeah so much for Mac now.",
                    "label": 0
                },
                {
                    "sent": "File a file and establish new Tekken welcomes to Villa.",
                    "label": 0
                },
                {
                    "sent": "My mom Crapo glass, which consumer models delicacy.",
                    "label": 0
                },
                {
                    "sent": "Is Bravo and Co in?",
                    "label": 0
                },
                {
                    "sent": "Jack in the ass Mccrossen brush sticker bomb shots cause religion tematica Nicotera Mal booster conanicut animal.",
                    "label": 0
                },
                {
                    "sent": "But cause blushing in Mr Dennison private coder sachitra zoom level so knesek irritable Krishna story in Melbourne on the tile.",
                    "label": 0
                },
                {
                    "sent": "Discussion the Vulture centerburg proston cons Dellacroce captivity Rama.",
                    "label": 0
                },
                {
                    "sent": "So the risk of acute low in the Sunday load Cygnus to production.",
                    "label": 1
                },
                {
                    "sent": "About Easter, Chica, Nashik, knickers, cow unpack some medicine.",
                    "label": 0
                },
                {
                    "sent": "If Alex attackers attackers Leach Nick Bosa van met with Raucci into it.",
                    "label": 0
                },
                {
                    "sent": "So the ticket taker Shinies Taranaki blow Prospero Thematical think of production code because the chill in.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I purchased splash, not Snow Tech Chase a similar dilemma.",
                    "label": 0
                },
                {
                    "sent": "Search image search.",
                    "label": 0
                },
                {
                    "sent": "Games, cakes procedure and they want proposal proper clopen English.",
                    "label": 0
                },
                {
                    "sent": "You know customers, dealers nabbed over public exposure, presuming slovensko.",
                    "label": 0
                },
                {
                    "sent": "Unless you watch it, please provide an opened up with the virus in newer.",
                    "label": 0
                },
                {
                    "sent": "So we are interested in gene expression and what does that mean?",
                    "label": 0
                },
                {
                    "sent": "Genes are encoded in our DNA so you can see here the very top DNA is this double spiral which is encoded which is carried over from one cell to another.",
                    "label": 0
                },
                {
                    "sent": "When our cells divide and usually chromosomes containing many many different genes with the DNA.",
                    "label": 0
                },
                {
                    "sent": "But these genes cannot be carried over into protein if you don't make this intermediate molecule called.",
                    "label": 0
                },
                {
                    "sent": "RNA and RNA molecule usually carries information for one gene.",
                    "label": 0
                },
                {
                    "sent": "You kind of convert the DNA into an RNA which is chemically similar molecule, and at this stage of RNA lots of interesting things happen are in.",
                    "label": 0
                },
                {
                    "sent": "It can be recombined re spliced together in interesting ways before you can make a protein and this is what I was quite interested in from the very beginning because this gives a lot of dynamics to ourselves, we are not fixed by our DNA.",
                    "label": 0
                },
                {
                    "sent": "We often the genetics, the air of genetics brought a little bit of determinism in our kind of set of understanding ourselves.",
                    "label": 0
                },
                {
                    "sent": "Initially it gives us a sense that we're so fixed by our genes, but studying RNA gives you a sense that actually we can step beyond our genes and we can be much more dynamic and fluid in the way ourselves work.",
                    "label": 0
                },
                {
                    "sent": "That's my attraction to the RNA now.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To understand a little bit more what we study when we come to RNA, the first example is something that is called exon skipping.",
                    "label": 0
                },
                {
                    "sent": "So the first thing to understand about our genes is that our genes are mating pieces.",
                    "label": 0
                },
                {
                    "sent": "They're like a puzzle, you have different pieces that need to be spliced together, combined together to make a product, and that product is called an M RNA, which is then translated into a protein.",
                    "label": 0
                },
                {
                    "sent": "And what is interesting that this pieces are not fixed?",
                    "label": 0
                },
                {
                    "sent": "So maybe 1 gene in one cell type?",
                    "label": 0
                },
                {
                    "sent": "Will create one type of product and in another cell type another product during our lifetime during aging.",
                    "label": 0
                },
                {
                    "sent": "This can change, so that's the first element of fluidity we have.",
                    "label": 0
                },
                {
                    "sent": "These different pieces and there like a mosaic that can be combined together in many different ways.",
                    "label": 0
                },
                {
                    "sent": "The simplest way you can control that is what you call X and skipping, so this little rat block in the middle can either get included or not, so the process is called alternative splicing so we can create a longer or a shorter variant.",
                    "label": 0
                },
                {
                    "sent": "You have other ways to do that.",
                    "label": 0
                },
                {
                    "sent": "One way you call this intern retention.",
                    "label": 0
                },
                {
                    "sent": "So interns are those bits of jeans that are normally considered to be discarded and non relevant so exons are the blocks that are supplies together.",
                    "label": 0
                },
                {
                    "sent": "An entrance or discarded.",
                    "label": 0
                },
                {
                    "sent": "But in some situations the entrance actually are not discarded and they become exons, so they become included.",
                    "label": 0
                },
                {
                    "sent": "So this is particle intra tension and the last one is alternative Poly generation.",
                    "label": 0
                },
                {
                    "sent": "This is where the.",
                    "label": 0
                },
                {
                    "sent": "End of this product will be so the jeans are kind of starting and ending in certain point, but the product itself may end early or later depending on this alternative Poly, then elation so this will be the end of the product and all of them give you all kinds of combinatorial possibilities of how to create the final product and we'll talk about all of them throughout the talk.",
                    "label": 0
                },
                {
                    "sent": "The way we approached.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Problem in our lab.",
                    "label": 0
                },
                {
                    "sent": "First of all, this is our molecular problem.",
                    "label": 0
                },
                {
                    "sent": "How do the RNAs for the RNA is this little string here that you can see?",
                    "label": 0
                },
                {
                    "sent": "How does this RNA interact with other types of molecules?",
                    "label": 0
                },
                {
                    "sent": "And we're interested in RNA binding proteins.",
                    "label": 0
                },
                {
                    "sent": "Proteins are the main machinery in ourselves that control everything.",
                    "label": 0
                },
                {
                    "sent": "They are the actors on the stage of life.",
                    "label": 0
                },
                {
                    "sent": "And the RNAs are the carrier information.",
                    "label": 0
                },
                {
                    "sent": "But during this step of carrying the interact with proteins that interact with other types of RNA such as micro RNA's and we are interesting how this all assembles together to decide the fate of the RNA to decide what happens to this RNA.",
                    "label": 0
                },
                {
                    "sent": "So this is our molecular question.",
                    "label": 0
                },
                {
                    "sent": "Biologically, we're interested in neurons and why neurons becausw.",
                    "label": 1
                },
                {
                    "sent": "First of all, neurons have the greatest diversity of RNAs.",
                    "label": 0
                },
                {
                    "sent": "One thing is, for example, an example here.",
                    "label": 0
                },
                {
                    "sent": "They tend to have.",
                    "label": 0
                },
                {
                    "sent": "Longer variants, so this Poly a tails and the position of the details in neurons tend to be further down in the gene and they somehow create longer regions in the RNA that allow more regulation.",
                    "label": 0
                },
                {
                    "sent": "One reason why that's important is at the bottom, so if you see here an example neuron, actually the RNA's are not just present in the nucleus of the neuron, which is where the jeans are.",
                    "label": 0
                },
                {
                    "sent": "Encoded in the DNA, but the RNA can be transported in the cell to all these distant processes, to the dendrites and axons, and in there you will have just the RNA, and this RNA can be then the source of regulation locally as a signal comes into neuron, you can make new proteins locally, which allows much faster control of gene regulation.",
                    "label": 0
                },
                {
                    "sent": "And these RNAs are very diverse and control very interesting things such as memory.",
                    "label": 0
                },
                {
                    "sent": "The guidance of neurons during the development and.",
                    "label": 0
                },
                {
                    "sent": "Somehow underlying a lot of biology of the brain and finally the reason we're interested in in the RNA is because you said important for lots of diseases of the brain, psychiatric diseases, developmental diseases, but especially in Europe, degenerative diseases.",
                    "label": 0
                },
                {
                    "sent": "One disease where this particular important is a motor neuron disease.",
                    "label": 1
                },
                {
                    "sent": "Maybe you haven't heard about it yet is not as famous as Alzheimer's or Parkinson's disease, but it's actually quite common.",
                    "label": 0
                },
                {
                    "sent": "We have about 100 or one in 300 chance of getting this disease in our lifetime.",
                    "label": 0
                },
                {
                    "sent": "The reason you rarely see a patient with a LS is because when you when you get a disease, you will have about maximum three years of survival rate and there's no cure to it and it's.",
                    "label": 0
                },
                {
                    "sent": "Pretty bad disease because you are completely conscious throughout your brain is perfectly fine.",
                    "label": 0
                },
                {
                    "sent": "You just cannot control your movement in the anti die because you cannot breathe.",
                    "label": 0
                },
                {
                    "sent": "So you see how your body is like you're losing control of your body but mentally are completely conscious of the whole process.",
                    "label": 0
                },
                {
                    "sent": "So it's a very sad disease and the the interesting bit is that a lot of genes involved in this protein.",
                    "label": 1
                },
                {
                    "sent": "RNA interactions are implicated in this disease currently.",
                    "label": 0
                },
                {
                    "sent": "9 RNA binding proteins already implicated so that mutations in these genes.",
                    "label": 0
                },
                {
                    "sent": "Can lead to disease.",
                    "label": 0
                },
                {
                    "sent": "Boris sitting here in the audience, was one of the first people who identified worked in the lab that identified mutations in this project.",
                    "label": 0
                },
                {
                    "sent": "It before these three was the first protein identified and then other proteins later on and have can talk to him about the details of the relationship between disease and proteins.",
                    "label": 0
                },
                {
                    "sent": "But that underlies the importance of this type of mechanism.",
                    "label": 0
                },
                {
                    "sent": "For for the disease also.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here is an example of how this protein looks like in a tissue from a patient.",
                    "label": 0
                },
                {
                    "sent": "So if you take a spinal cord from an LS patient and look at these neurons that are dying in this in this tissue you can see this big blobs that are stained by this protein called TDP 43.",
                    "label": 0
                },
                {
                    "sent": "So this Brown inclusions in these neurons are consisting largely of this RNA binding proteins which form almost like solid blocks in the cells and.",
                    "label": 0
                },
                {
                    "sent": "It's believed that this is what ultimately kills these cells.",
                    "label": 0
                },
                {
                    "sent": "This is like this toxic thing that somehow got into you cannot escape away from this aggregation phenomenon.",
                    "label": 0
                },
                {
                    "sent": "And this is involved not just in LS but also in another disease called FTD.",
                    "label": 0
                },
                {
                    "sent": "Frontotemporal dementia, which usually links to the generation of the cortical tissue, the frontal and temporal regions of the cortex.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here to just summarize, we have lots of different irony binding proteins involved in diseases when they're mutated, and most of these diseases are age related.",
                    "label": 0
                },
                {
                    "sent": "So one is cancer, so you can see here on the top is cancer in connected to lots of mutations in RNA binding proteins and down here we have neurological disorders and especially LS, and this is already a bit outdated.",
                    "label": 0
                },
                {
                    "sent": "We have lots more candidates now, but you can see that lots of Arnie binding proteins when mutated will lead to disease and what seems to be the kind of underlying.",
                    "label": 0
                },
                {
                    "sent": "Similarity between this is that they contain this, what's called intrinsically disordered regions.",
                    "label": 1
                },
                {
                    "sent": "So proteins are known to form certain type of structures like Alpha helices, beta sheets and historically we have put a lot of attention to these structures that they form certain domains, but we have been ignoring the regions of proteins that are relatively hard to understand because they don't have a defined structure in solution.",
                    "label": 0
                },
                {
                    "sent": "In solution they would be kind of floppy and disordered, and we don't really know how do they look like in cells very much.",
                    "label": 0
                },
                {
                    "sent": "So they were kind of ignored as less important, but what is clear that most mutations leading to disease are in these floppy parts of the proteins and in the last years these regions have been the front page of most of the work in our field.",
                    "label": 0
                },
                {
                    "sent": "And I'll tell you a little bit more about that later on.",
                    "label": 0
                },
                {
                    "sent": "So now I'll go through three stories that kind of gives you an example of how we tend to approach the problem.",
                    "label": 0
                },
                {
                    "sent": "So the 1st way.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To approach the problem is to model the disease with human cells.",
                    "label": 0
                },
                {
                    "sent": "And we are using these cells called induced pluripotent stem cells.",
                    "label": 1
                },
                {
                    "sent": "This light is kind of similar schematic of how these cells are derived, so you will most simplest way to do it is to collect some skin from patient or from a control individual.",
                    "label": 0
                },
                {
                    "sent": "Often you will take a family member that has a disease and it doesn't have a disease and then you will from this fibroblast create cells that are very similar to stem cells, so they're pretty potent.",
                    "label": 0
                },
                {
                    "sent": "So this is technology that was now developed by.",
                    "label": 0
                },
                {
                    "sent": "Yamanaka about 10 years ago and the stem cells can then be differentiated in any other cells in our body and neurons are actually some of the easiest cells to differentiate from these stem cells.",
                    "label": 0
                },
                {
                    "sent": "So then you have pretty much a brain in a dish nowadays.",
                    "label": 0
                },
                {
                    "sent": "You can already create organoids that look almost like with all the brain layers and can survive for years in culture and can respond to light.",
                    "label": 0
                },
                {
                    "sent": "Can be connected to little eyes and culture and you can actually shine light onto the eye and see.",
                    "label": 0
                },
                {
                    "sent": "The visual cortex of that organized to respond to that people are doing quite crazy things already, but of course that's not like a brain, but it does have a lot of features of disease.",
                    "label": 0
                },
                {
                    "sent": "When you take a cell from a patient and then culture it in this in vitro situation, you reproduce lots of those molecular phenotypes of disease through that.",
                    "label": 0
                },
                {
                    "sent": "So this has been a very valuable source, not so much to my group, but to our closest collaborators that we work with of modeling the disease.",
                    "label": 0
                },
                {
                    "sent": "So once you have these neurons in a dish.",
                    "label": 0
                },
                {
                    "sent": "You can on one hand do high throughput screens to screen lots of drugs to see what will actually Miller 8 the phenotype.",
                    "label": 0
                },
                {
                    "sent": "You can look at candidate drugs, drugs that are already approved and just see if they will do something you tested first on these cells before you actually test it on humans.",
                    "label": 0
                },
                {
                    "sent": "Or you can actually you can see now this personalized therapies so you can create cells from certain patients and test whether drugs will work on them before you go to those patients.",
                    "label": 0
                },
                {
                    "sent": "'cause it's becoming clear that diseases such as cancer and your degeneration.",
                    "label": 0
                },
                {
                    "sent": "Even if you call it a certain disease, can have many different genetic causes and they can respond to drugs very differently.",
                    "label": 0
                },
                {
                    "sent": "So that's kind of 1 technology that we used and I'll ghost.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "After the conclusion here, I'm not going to.",
                    "label": 0
                },
                {
                    "sent": "Describe the whole process of how we came to this findings and order details.",
                    "label": 0
                },
                {
                    "sent": "Because we don't have time, I'll just give you the takeaway point and also how we did this collaboratively.",
                    "label": 0
                },
                {
                    "sent": "So for this story was driven the data production with driven by Claire was a joint PhD student between my group and Ricky Patton.",
                    "label": 0
                },
                {
                    "sent": "Ricky is the expert on the I PS cells.",
                    "label": 0
                },
                {
                    "sent": "He's actually clinician, spends two days a week working in the clinic with the LS patients in three days a week, leading a research group modeling the disease.",
                    "label": 0
                },
                {
                    "sent": "And he has developed lots of techniques to culture these cells and develop differentiated into motor neurons.",
                    "label": 0
                },
                {
                    "sent": "So he's a real expert and Claire has worked between our lab.",
                    "label": 0
                },
                {
                    "sent": "So she used the molecular expertise of our group and the seller expertise of Ricky's team to produce the data for this study.",
                    "label": 0
                },
                {
                    "sent": "Rafael is a computational biologist.",
                    "label": 0
                },
                {
                    "sent": "Her background is actually biology, but she learned computation once she joined the group of Nicklaus Comp with my collaborator in London is a purely computational group.",
                    "label": 0
                },
                {
                    "sent": "And he also has biological backgrounds.",
                    "label": 0
                },
                {
                    "sent": "Most of people in his lab also biologists.",
                    "label": 0
                },
                {
                    "sent": "But when they joined the group, they learn computation and they have enough knowledge to bridge these two kind of fields.",
                    "label": 0
                },
                {
                    "sent": "Sorta fell, took the data and looked at in new ways and then came up to these observations.",
                    "label": 0
                },
                {
                    "sent": "So there's observations she found is the following.",
                    "label": 0
                },
                {
                    "sent": "So mostly when people so far we're looking at what's going wrong in the IPS models of disease.",
                    "label": 1
                },
                {
                    "sent": "They were only looking at the motor neuron station, the end stage, so when they fully differentiate.",
                    "label": 0
                },
                {
                    "sent": "Which takes about a month in the best case, you differentiate from a prepotent cell to motor neurons, and then after a month or so, depending on the protocol, might take several months.",
                    "label": 0
                },
                {
                    "sent": "We now have differentiated neurons and then people checked what happened with the RNA.",
                    "label": 0
                },
                {
                    "sent": "We designed the study a little bit differently, with designed it in such a way that we checked what happens with the cells at different stages during their differentiation.",
                    "label": 0
                },
                {
                    "sent": "So we looked at this stage.",
                    "label": 0
                },
                {
                    "sent": "Is the prepotent stage neural precursors.",
                    "label": 0
                },
                {
                    "sent": "So here these are cells are kind of still proliferating, they haven't.",
                    "label": 0
                },
                {
                    "sent": "Turned into neurons yet, but they are already on the way towards that direction.",
                    "label": 0
                },
                {
                    "sent": "Then we have precursors of motor neurons, so they already specified that they will turn into motor neurons, which are the neurons of the spinal cord, but they're still proliferating.",
                    "label": 1
                },
                {
                    "sent": "Then we have post mitotic motor neurons.",
                    "label": 0
                },
                {
                    "sent": "So these cells are now looking like neurons.",
                    "label": 0
                },
                {
                    "sent": "They have different, they have their processes, they're not dividing yet, but anymore, but they're not yet connected in such a way that they will have electrical signals going across them.",
                    "label": 0
                },
                {
                    "sent": "And then the final stages.",
                    "label": 0
                },
                {
                    "sent": "Electrophysiological immature motor.",
                    "label": 0
                },
                {
                    "sent": "Neurons with the synapses that have proper neural neural networks.",
                    "label": 0
                },
                {
                    "sent": "So far, people have been mainly studying this stage, and now we looked at all the stages and the main finding that we see.",
                    "label": 0
                },
                {
                    "sent": "So we compared 4 lines from control individuals, some from the same family as a patient and three cell lines with different patients with two different mutations leading to disease.",
                    "label": 0
                },
                {
                    "sent": "And saw that there was kind of a clear cut distinction between them in terms of the RNA coming from these cells.",
                    "label": 0
                },
                {
                    "sent": "And the takeaway point which you see this in this diagram is that in airless, this changes that happened during the development and differentiation of this program of changes, at least over its motor neurons was speeded up.",
                    "label": 0
                },
                {
                    "sent": "It was too quick, everything happened a little bit too early.",
                    "label": 0
                },
                {
                    "sent": "We didn't see a lot of changes that were really unique to LS.",
                    "label": 0
                },
                {
                    "sent": "There didn't seem to be that.",
                    "label": 0
                },
                {
                    "sent": "The program is completely off, it was just the timing of this program that was off.",
                    "label": 0
                },
                {
                    "sent": "Things were happening a bit too quickly and the things you can see are mainly affecting these different stages of RNA processing.",
                    "label": 0
                },
                {
                    "sent": "The three parameter Regulation is alternative pollination in an intern retention, those two aspects were mainly affected in LS not so much.",
                    "label": 0
                },
                {
                    "sent": "The classical alternative splicing and there was absolutely no change in transcription, so some of you might be familiar.",
                    "label": 0
                },
                {
                    "sent": "This first stage of converting from DNA to RNA.",
                    "label": 0
                },
                {
                    "sent": "Completely normal and unaffected.",
                    "label": 0
                },
                {
                    "sent": "All of the dynamics was perfectly fine, so there's something that happens after the irony is made, and then from there on it goes on too quickly to the next stage and so just to tell you a little bit more about this in turn retention.",
                    "label": 0
                },
                {
                    "sent": "So we looked here.",
                    "label": 0
                },
                {
                    "sent": "In this model we looked at one type of mutation in a gene called VCP, which is not a gene that itself participates in protein RNA interactions, but the product of the gene VCP protein.",
                    "label": 0
                },
                {
                    "sent": "Affects the dynamics of these RNA granules that I mentioned before this contact.",
                    "label": 0
                },
                {
                    "sent": "Larger complexes between protein, RNA.",
                    "label": 0
                },
                {
                    "sent": "It controls how they how dynamic are they are how they turn from one type of complex to another.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And but here we looked at VCP as I show you here a little bit more in detail, so we have two different mutations and for internal attention you can see that this first staged neuronal precursor we're having twice as much of intern retention products that are happening very quickly than in the control and what is supposed to happen in the later stage of the precursor motor neurons is already happening in the neuronal precursors.",
                    "label": 0
                },
                {
                    "sent": "So somehow it's skipping ahead.",
                    "label": 0
                },
                {
                    "sent": "Everything is skipping a little bit ahead when it comes to intern retention, which is the simple thing down here that this red block is being retained little too quickly and.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The same thing happens also in other types of these models of mutations of LS so fast is an RNA binding protein.",
                    "label": 0
                },
                {
                    "sent": "If you have the recommendation on binding protein, we see the same entrance being retained too much and sod one is actually a protein that is very different and was supposed to be completely different pathway.",
                    "label": 0
                },
                {
                    "sent": "Nothing to do with Arnie Biology, but here we again see this does happen.",
                    "label": 0
                },
                {
                    "sent": "Is the same kind of common phenotype that includes all of the mutations leading to the same disease even though they are.",
                    "label": 0
                },
                {
                    "sent": "So far they were supposed to involve very different mechanisms, so we were looking at what is kind of mechanistically a common aspect of this disease that has been one big problem in this field because we have a huge number of different mutations leading to the same disease, and it was very hard to know what is common.",
                    "label": 0
                },
                {
                    "sent": "So this is one way to model disease which is using this human cells.",
                    "label": 0
                },
                {
                    "sent": "Now the next.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Roche, we're having is to really understand what's happening to the organized.",
                    "label": 0
                },
                {
                    "sent": "The real molecular level, so we see something is happening to quickly, but how is this process relevant for the seller?",
                    "label": 0
                },
                {
                    "sent": "Decisions that they're making, and how is it regulated?",
                    "label": 0
                },
                {
                    "sent": "So imagine that this is how an RNA molecule looks like.",
                    "label": 0
                },
                {
                    "sent": "This is slightly more realistic to the way I showed before.",
                    "label": 0
                },
                {
                    "sent": "It's not just a string, but it's a string that is kind of wrapped on itself and forms lots of structures inside RNA.",
                    "label": 0
                },
                {
                    "sent": "Conform also some type of duplexes within it.",
                    "label": 0
                },
                {
                    "sent": "DNA has this long double spiral that is connected to.",
                    "label": 0
                },
                {
                    "sent": "Strings are connected together with RNA.",
                    "label": 0
                },
                {
                    "sent": "This happens internally that this RNA can wrap into itself and form this type of mini spirals inside.",
                    "label": 0
                },
                {
                    "sent": "And what is important with the RNA.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is also coated by proteins, so as soon as an RNA is made then different proteins bind in different positions and then make the kind of the control of that RNA from whatever happens next.",
                    "label": 0
                },
                {
                    "sent": "So this is our molecular problem.",
                    "label": 0
                },
                {
                    "sent": "How is this important for LS?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the way we tend to approach this is now.",
                    "label": 0
                },
                {
                    "sent": "This is our grand strategy.",
                    "label": 0
                },
                {
                    "sent": "So on the top left where first trying to identify across our whole all of the RNA seen ourselves.",
                    "label": 0
                },
                {
                    "sent": "How are these RNAs interacting with proteins?",
                    "label": 0
                },
                {
                    "sent": "So for that we developed some methods called Clip I clip high clip where we can cross link cells or tissue.",
                    "label": 0
                },
                {
                    "sent": "You can even take human postmortem tissue just expose it to UV light for a few seconds up to 30 seconds and that will create a covenant bond between proteins and RNA.",
                    "label": 0
                },
                {
                    "sent": "That covenant bond can be done a way for us to purify everything and identify those interactions.",
                    "label": 0
                },
                {
                    "sent": "We can also look at computational features, sequence, structural features of those RNAs that are of interest on the right.",
                    "label": 0
                },
                {
                    "sent": "We are interested what is actually the commonality of those RNAs that are bound by certain protein?",
                    "label": 0
                },
                {
                    "sent": "How are they regulated?",
                    "label": 0
                },
                {
                    "sent": "How do they change when you take away certain protein?",
                    "label": 0
                },
                {
                    "sent": "Does the RNA splicing change on a population change and then we bring that all together computationally to define certain kind of general principles?",
                    "label": 0
                },
                {
                    "sent": "One thing that we tend to work on is something called.",
                    "label": 0
                },
                {
                    "sent": "Training Maps I'll come to that later to see how the position of interactions relates to their functions that we're trying to connect the left and the right aspects here, and also how different proteins combinatorially act on the certain RNA.",
                    "label": 0
                },
                {
                    "sent": "How do they bind next to each other to achieve certain common functions?",
                    "label": 0
                },
                {
                    "sent": "So that's more mechanistic research and on the right we are trying to understand the biology of the cell.",
                    "label": 0
                },
                {
                    "sent": "So how does that allow cells to make their choices?",
                    "label": 0
                },
                {
                    "sent": "So I'll now talk first about this aspect and then to the one on the right.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so, as I mentioned, we used a technique called clip.",
                    "label": 0
                },
                {
                    "sent": "So just shortly guide you through that because we develop that and after crosslinking that issues.",
                    "label": 0
                },
                {
                    "sent": "I mentioned, we then lies the cells with some detergent.",
                    "label": 0
                },
                {
                    "sent": "So now we have solution of molecules and at this stage we actually add an RNA so that we fragment the RN into small pieces, so that we only left with those pieces that are actually cross linked to our protein of interest.",
                    "label": 0
                },
                {
                    "sent": "And then we can purify that protein.",
                    "label": 0
                },
                {
                    "sent": "We can use that magnetic bits that stick to the protein with an antibody.",
                    "label": 0
                },
                {
                    "sent": "And on that stage we link the RNA to a specific sequence which we call adapter so we can synthesize certain sequence and link it to our RNA purified that complex get rid of the protein and now the .6 we have now are RNA with that sequence that we added to it.",
                    "label": 0
                },
                {
                    "sent": "And let's sequences allowing us to then amplify our RNA of interest so we can amplified with what's called PCR and then in the end we use what's called high throughput sequencing.",
                    "label": 0
                },
                {
                    "sent": "So this technology again that really changed the way.",
                    "label": 0
                },
                {
                    "sent": "Work is done in molecular biology labs over the last decade.",
                    "label": 0
                },
                {
                    "sent": "We can get millions of sequences for very affordable price and by sequencing now across all of these sequences kind of short RNAs that we're crossing to our proteins, we get a very good sense of how does this protein interact with all of the RNA into cells.",
                    "label": 0
                },
                {
                    "sent": "So we somehow we froze the cells or tissue in a certain stage and now we have a readout of everything that's been kind of going on in the Contacts between molecules.",
                    "label": 0
                },
                {
                    "sent": "And this is how.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That kind of first study which was published in 2011 looked like for the protein called TDP 43.",
                    "label": 0
                },
                {
                    "sent": "So each of these little blocks you see here, this is really complicated slide, so I'm not going to explain everything but the main thing to take away of it is that each of these little.",
                    "label": 0
                },
                {
                    "sent": "Rectangles you see is 1 binding site on an RNA.",
                    "label": 0
                },
                {
                    "sent": "This is what we got from this method called clip.",
                    "label": 0
                },
                {
                    "sent": "It tells us this protein was cross linked to that position on that RNA.",
                    "label": 0
                },
                {
                    "sent": "On the top you see the diagram of exon skipping.",
                    "label": 0
                },
                {
                    "sent": "That's what we're looking here.",
                    "label": 0
                },
                {
                    "sent": "We're looking at the process of whether Exxon is included or not and what we are distinguishing.",
                    "label": 0
                },
                {
                    "sent": "Here are the actions that are enhanced by our protein.",
                    "label": 0
                },
                {
                    "sent": "So if the protein is present, this action will be more efficiently included in the message, which are here in red, and the ones that are depressed which are in blue.",
                    "label": 0
                },
                {
                    "sent": "And our hypothesis is that the protein can do both things, but the two functions are distinguished by the position where it binds on the RNA.",
                    "label": 0
                },
                {
                    "sent": "So this was actually something that we started with eyelash with my brother.",
                    "label": 0
                },
                {
                    "sent": "He did the first computation analysis for our data back when I was still in New York.",
                    "label": 0
                },
                {
                    "sent": "Our first models of this was were derived at that stage and we kind of continue with this concept that when you see that, for example, here at all, the blue rectangles are all piling up just upstream.",
                    "label": 0
                },
                {
                    "sent": "Of this regulated exons and that means that when protein is bound right next to the Axon to repress the axons and the red boxes are further downstream, they are somewhat different.",
                    "label": 0
                },
                {
                    "sent": "Position so tells you OK, there's some distinction, but the number of these actions that were regulated was not very high compared to our other proteins, so we actually started thinking maybe this is not the main thing that this protein is doing.",
                    "label": 0
                },
                {
                    "sent": "It did follow certain principles, but I didn't really jump out as this would be the primary function.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we started thinking about this other function, quote alternative polyadenylation, where deaminase are ending and here you see this is an example of a gene.",
                    "label": 0
                },
                {
                    "sent": "This is how you look like a gene in what you call the Genome browser, which you can all log into.",
                    "label": 0
                },
                {
                    "sent": "If you type genome browser into Google and then look at it.",
                    "label": 0
                },
                {
                    "sent": "This is how the genes will look like.",
                    "label": 0
                },
                {
                    "sent": "They have this little boxes.",
                    "label": 0
                },
                {
                    "sent": "These are the axons and then this box.",
                    "label": 0
                },
                {
                    "sent": "Here is a regulated one so it can get included or not and we know that TDP 43 promotes inclusion of this one.",
                    "label": 0
                },
                {
                    "sent": "That's why it's in red.",
                    "label": 0
                },
                {
                    "sent": "And this blue bars here are our clip data for every nucleotide on the RNA, we can say how well this protein cross links to that nucleotide, and we did that in different cell lines in embryonic stem cells and we also looked at healthy and diseased tissue from human brain tissue so we could again do clip methods in all those different approaches.",
                    "label": 0
                },
                {
                    "sent": "And you can see that the binding of this protein overlaps with this green bits on the top, which is just the sequence of the RNA.",
                    "label": 0
                },
                {
                    "sent": "So this protein tends to bind to sequences that are rich in UG dinucleotide.",
                    "label": 0
                },
                {
                    "sent": "So the more of these huge repeats there are better the protein binds.",
                    "label": 0
                },
                {
                    "sent": "Basically, that's what it shows you, but you can see that there is this region here on the RNA DNA, which is called 3 prime UTR.",
                    "label": 0
                },
                {
                    "sent": "So this is an untranslated region.",
                    "label": 0
                },
                {
                    "sent": "It doesn't generate a protein, but it's a regulatory region of the RNA and in there you can see actually the strongest binding site of this protein.",
                    "label": 0
                },
                {
                    "sent": "Is in the three prime UTR that made us think that probably this protein will often regulate alternative Poly generation, which is mainly regulating the three prime UTR.",
                    "label": 0
                },
                {
                    "sent": "And so we.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Started working with this with Gregor.",
                    "label": 0
                },
                {
                    "sent": "Is a computational biologist currently working at University of Siri who made this beautiful web server and you can look at this and you'll see all our data there, very beautifully presented, and here is now the RNA map of alternative polyadenylation, and so you can see here this red line here is aligned to the first Poly, a site that is being regulated in the gene when the pattern is in red, that means that that Poly site is enhanced so.",
                    "label": 0
                },
                {
                    "sent": "This protein promotes the use of that Poly a site when it's blue, it means it is repressing it.",
                    "label": 0
                },
                {
                    "sent": "And again we see the same pattern when you see the blue rectangles there's a lot of them just next to this Poly high side so it overlaps with the Poly a site so this protein can prevent the use of this Poly a site to repress it by binding close to there, probably by blocking all the important elements that needs to be recognized by other machinery's.",
                    "label": 0
                },
                {
                    "sent": "But it can also enhance that side by binding further away, which is what you see here.",
                    "label": 0
                },
                {
                    "sent": "But what was interesting here is that the number of dysregulated size was larger.",
                    "label": 0
                },
                {
                    "sent": "It was much more of a clear pattern here, which made us think that we should really focus a little bit more on the ternative pollination to understand this protein and.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What we notice when we compared the binding of this protein between healthy and diseased tissue.",
                    "label": 0
                },
                {
                    "sent": "This was work started together with Boris.",
                    "label": 0
                },
                {
                    "sent": "I see him smiling.",
                    "label": 0
                },
                {
                    "sent": "This is again one of those things quite awhile ago that we keep on thinking about is that there are certain RNAs that are quite different between healthy and diseased tissue and there's one up there called neat one.",
                    "label": 0
                },
                {
                    "sent": "So keep attention to that one you did see it really stands out in a way that it's bound much more in diseased tissue compared to healthy tissue and.",
                    "label": 0
                },
                {
                    "sent": "What we notice?",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When you look at these RNA, this is a non coding RNA, so these are it doesn't create.",
                    "label": 0
                },
                {
                    "sent": "A protein is also become clearer there.",
                    "label": 0
                },
                {
                    "sent": "Recent years that a lot of RNAs work on their own, the purpose is not to make protein, but they do something on their own and with this RNA still not completely clear.",
                    "label": 0
                },
                {
                    "sent": "But we're making some progress.",
                    "label": 0
                },
                {
                    "sent": "What is actually what these are and is doing.",
                    "label": 0
                },
                {
                    "sent": "It's a very long RNA.",
                    "label": 0
                },
                {
                    "sent": "You can see the protein binds all over this RNA and the best binding sites are dis repeats of hugely bits.",
                    "label": 0
                },
                {
                    "sent": "As you can see here.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is how this RNA works in the cells.",
                    "label": 0
                },
                {
                    "sent": "It is a scaffold.",
                    "label": 0
                },
                {
                    "sent": "Scaffold is like you know when you build a house, you first start by just making some basic wooden structure on which everything else can get attached.",
                    "label": 0
                },
                {
                    "sent": "The same thing here.",
                    "label": 0
                },
                {
                    "sent": "So this RNA is core structure to which other things can get.",
                    "label": 0
                },
                {
                    "sent": "Attached is a very long RNA, so it creates these big bowl onto which lots of RNA binding proteins will be trapped and you can see with image in here how this looks like.",
                    "label": 0
                },
                {
                    "sent": "It's called Paris Pickle and in the cellular nucleus you will have different dots like little droplets around which this RNA is present and other proteins are trapped in there and what is becoming quite clear.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our field now is that these droplets are actually quite common in ourselves and they have really important part of biology of ourselves.",
                    "label": 0
                },
                {
                    "sent": "Paris speckles are some type of drop it you can see up there, but there are others.",
                    "label": 0
                },
                {
                    "sent": "There's nucleoli speckles.",
                    "label": 0
                },
                {
                    "sent": "All kinds of droplets are part of normal biology, but what is also becoming clear that in diseases lots of these droplets turn into solid things which are called this amyloid like aggregates on which you can see.",
                    "label": 0
                },
                {
                    "sent": "Here is something that happens in the cycle zone and actually people even found it in vitro.",
                    "label": 0
                },
                {
                    "sent": "You can just take one single learning binding protein, put it in vitro, underwrite type of buffering environment.",
                    "label": 0
                },
                {
                    "sent": "And we start forming these droplets like oil droplets that are floating in the middle of solution.",
                    "label": 0
                },
                {
                    "sent": "If you wait long enough.",
                    "label": 0
                },
                {
                    "sent": "Then it might start turning into this type of fibrils, but if it contains a disease causing mutation, it will turn into these fibrils quite quickly and this form this weird structures that are irreversible, so these droplets are very dynamic.",
                    "label": 0
                },
                {
                    "sent": "They keep on changing, but this solid structures become irreversible.",
                    "label": 0
                },
                {
                    "sent": "They don't turn back very easily, and so these are the troublemakers.",
                    "label": 0
                },
                {
                    "sent": "This solid structures, so we're quite interested in how this normal biology of RNA droplets like Paris Pickles links to the abnormal biology in the disease.",
                    "label": 0
                },
                {
                    "sent": "So we're talking a little bit more about this.",
                    "label": 0
                },
                {
                    "sent": "Para speckles now and need one RNA.",
                    "label": 0
                },
                {
                    "sent": "So the 1st.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Reservation that it's also potentially linked to.",
                    "label": 0
                },
                {
                    "sent": "A LS came to this Japanese study in 2013 where they compared the motor neurons from healthy tissue from the one of a LS patients.",
                    "label": 0
                },
                {
                    "sent": "And so the disparate speckles are happening in almost all motor neurons of diseased tissue of LS.",
                    "label": 1
                },
                {
                    "sent": "But they are much rarer.",
                    "label": 0
                },
                {
                    "sent": "In healthy motor neurons, indicating there's something promoting their formation, again agreeing with also observation that in disease tissue TP moves much more bound to this need one RNA.",
                    "label": 0
                },
                {
                    "sent": "So they play some role in increasing their scaling up.",
                    "label": 0
                },
                {
                    "sent": "The way.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We approach this was to go down to the basics rather than go straight to disease.",
                    "label": 0
                },
                {
                    "sent": "We decided let's try to figure out what is the normal biology of disparate speckles.",
                    "label": 0
                },
                {
                    "sent": "And this was actually initiated by me, who is another Slovenian student.",
                    "label": 0
                },
                {
                    "sent": "He spent a year doing a master project in our lab, then continued with me, had recur in Munich Namco supervisor of his thesis were just sending this paper out for publication and I will describe this story now.",
                    "label": 0
                },
                {
                    "sent": "We could really breach together lots of different fields by going between the different labs.",
                    "label": 0
                },
                {
                    "sent": "He also works with Boris on this perspective, so we kind of combining with the expertise and the main thing is that he could address this problem in the context of this cell fate choices that the cells are making during differentiation, which is not my expertise so much so he could get expertise from others, and so the question was what happens is very first transition from prepotency to the exit from pre potency where you have certain markers.",
                    "label": 0
                },
                {
                    "sent": "You can see that the protocol he uses allows.",
                    "label": 0
                },
                {
                    "sent": "These markers to be turned on, which you can see here in green.",
                    "label": 0
                },
                {
                    "sent": "This is just kind of quality control analysis with facts.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And he did also analyze the changes in RNA expression during different protocols of differentiation, and each protocol will lead to induction of different kinds of RNAs, but there's something common.",
                    "label": 0
                },
                {
                    "sent": "There's a few genes that are always turning on when you differentiate prepotent cells, and one of those is.",
                    "label": 0
                },
                {
                    "sent": "These aren't equal.",
                    "label": 0
                },
                {
                    "sent": "Neat one again seems to be something that turns on very early on in differentiation.",
                    "label": 0
                },
                {
                    "sent": "So once we notice that we said OK, maybe this is a good way to start by looking at what needs one is doing.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you can also see at the level of counting the looking at the cells and counting how these perspectives look like in the cells.",
                    "label": 0
                },
                {
                    "sent": "You can see here on the way right?",
                    "label": 0
                },
                {
                    "sent": "Or the pretty potent cells you cannot see para speckles in them.",
                    "label": 0
                },
                {
                    "sent": "But the moment you just wait a little bit and differentiate them, you start seeing this little rat droplets here, which are the Paris speckles you're going to see.",
                    "label": 0
                },
                {
                    "sent": "With old protocols you start seeing this dramatic induction of this little perspective.",
                    "label": 0
                },
                {
                    "sent": "Droplets in the cells.",
                    "label": 0
                },
                {
                    "sent": "You can see this at the level of RNA sequencing that on the top you have lots of reads covering the whole of the need to run after differentiation before you don't get many reads and what may have actually notice is that this is not an aspect that is regulated transcriptionally.",
                    "label": 0
                },
                {
                    "sent": "The RNA is actually transcribed, even include potent cells.",
                    "label": 0
                },
                {
                    "sent": "So this is nascent RNA which you can see immediately after transcription.",
                    "label": 0
                },
                {
                    "sent": "You see transcription going through this gene, but.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What's actually different is that.",
                    "label": 0
                },
                {
                    "sent": "Post transcriptionally, the irony is processed in such a way that is degraded at in prepotent cells and Mika founded.",
                    "label": 0
                },
                {
                    "sent": "This is regulated by this program called TDP.",
                    "label": 0
                },
                {
                    "sent": "43.",
                    "label": 0
                },
                {
                    "sent": "To summarize this, to make this story really short, we have two different variants of this RNA have this alternative Poly, a site that creates a short variant which we call this new version one and here in Rat in this red bars we show the binding of TDP 43.",
                    "label": 0
                },
                {
                    "sent": "You can see that it binds just around of this alternative.",
                    "label": 0
                },
                {
                    "sent": "A site and actually promotes the use of this premature pollination.",
                    "label": 0
                },
                {
                    "sent": "And when you use this premature population, the RNA becomes degraded.",
                    "label": 0
                },
                {
                    "sent": "So basically it's transcribed important cells, but because of TDP 43 it becomes.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Graded so this is the summary of this, so the short variant is just degraded very quickly.",
                    "label": 1
                },
                {
                    "sent": "And.",
                    "label": 1
                },
                {
                    "sent": "Only after differentiation you can make the long mature RNA that conform para speckles and we think the reason partly for this transition is that if you look at the abundance of TDP 43 during this first stage is upon differentiation you can see that actually it is much more abundant in pluripotent cells and that's how it can prevent formation of this perspective.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So again, we can see with imaging the two different isoforms now and we can see that in prepotent cells we will see only the version one isoform.",
                    "label": 0
                },
                {
                    "sent": "We can see that both in mouse and human ESL sold experiments were done in both species here.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then Micah used genome editing to remove the first Poly eyesight just by removing that sequence required for recognition of loneliness.",
                    "label": 0
                },
                {
                    "sent": "And he removed that.",
                    "label": 0
                },
                {
                    "sent": "Then the Paris Packers could become present in the reporting stage.",
                    "label": 0
                },
                {
                    "sent": "Can you see this version one not being the only one, but you can also see version 2 being made.",
                    "label": 0
                },
                {
                    "sent": "And the same result happens when you remove TDP 43 from prepotent cells.",
                    "label": 0
                },
                {
                    "sent": "Again, you can make Paris speckles so that kind of combines the TDP really is the repressor of that first only side.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So TP regulates need one, but what about the other way around?",
                    "label": 0
                },
                {
                    "sent": "Does need one which we know interacting with TDP 43 also affected before itself?",
                    "label": 0
                },
                {
                    "sent": "So here we have mass spec analysis, appan removal or induction of need one.",
                    "label": 0
                },
                {
                    "sent": "So when you remove that Poly a site to induce the need one RNA what happens to RNA binding proteins?",
                    "label": 0
                },
                {
                    "sent": "Here we're looking how does that effect Arnie binding proteins on other types of RNA, cenam arenas and TDP?",
                    "label": 0
                },
                {
                    "sent": "40 Three was one of the proteins.",
                    "label": 0
                },
                {
                    "sent": "Of a complex here that is all shifted away from Ameren Ace when the neat one is induced in pretty potent cells.",
                    "label": 1
                },
                {
                    "sent": "So somehow it says that need one is somehow competing for other RNAs, it pulls protein away of where that we use often is sequesters the protein, so need one also has some kind of inhibitory effect on TDP 43.",
                    "label": 0
                },
                {
                    "sent": "Then hit each other.",
                    "label": 0
                },
                {
                    "sent": "And we can see how that affects differentiation.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So first of all, here we can see that if you overexpressed EDP 43.",
                    "label": 0
                },
                {
                    "sent": "After differentiation, then differentiation is inefficient.",
                    "label": 0
                },
                {
                    "sent": "So with what you called plus docs, that's induction of TDP 43 here in red then this marker of pluripotent cells is persisting so we cannot push the cells out of prepotent stage.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And actually you see the same thing if you remove need one, so need one is again something that's required to allow efficient exit from prepotent stage.",
                    "label": 0
                },
                {
                    "sent": "So this kind of decision of two cellular phase either kind of highly prepotent or more differentiated.",
                    "label": 0
                },
                {
                    "sent": "That's something that these two proteins are both.",
                    "label": 0
                },
                {
                    "sent": "These two factors are controlling TDP.",
                    "label": 0
                },
                {
                    "sent": "43 prevents differentiation and need one promotes differentiation and.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One way to explain it by looking at Poly generation, what happens with the choice of this Poly a tails during early different situation?",
                    "label": 0
                },
                {
                    "sent": "So on the Y axis we just see changes in this Poly 8 tail choice as you shift from prepotent too early, differentiate the stage on the X axis is what happens when you remove the P43 from pretty potent cells and you can see there is a quite a close similarity between the two, so just the loss of TDP 43 on its own mimics.",
                    "label": 0
                },
                {
                    "sent": "What happens after differentiation.",
                    "label": 0
                },
                {
                    "sent": "So you can interpret here is that this decrease in the abundance of TDP upon early differentiation is the driver of this changes in Poly generation and one of the.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Changes in this factor, called socks too.",
                    "label": 0
                },
                {
                    "sent": "This is one of these Yamanaka factors I mentioned before.",
                    "label": 0
                },
                {
                    "sent": "Factors that are sufficient to create a pretty potent cells include this one, so if you include this plus two other genes, you can create a pretty potent cell, and TDP is required to make this protein because it regulates the Poly a sites of this gene.",
                    "label": 0
                },
                {
                    "sent": "You can see that in two different methods here, one method on the top is looking at Reed, just accumulating at the Poly a sites and the method below is the standard Arnie sequencing that covers the whole of the RNA.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to go through all the details, but the main takeaway point is in the PDP.",
                    "label": 0
                },
                {
                    "sent": "RE promotes the use of the first Poly aside, which produces a more efficient socks to protein.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is I mentioned is one of these core machinery of prepotency.",
                    "label": 0
                },
                {
                    "sent": "And here you can see that if you remove TDP 43, the socks to protein on the Western blot is not so much detectable in these cells, so.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This was kind of a simplified summary.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of complex things that you should discuss with me.",
                    "label": 0
                },
                {
                    "sent": "Hope you're interested, but the main takeaway point is that we have what you call a bimodal type of switch.",
                    "label": 0
                },
                {
                    "sent": "Here when you have two factors that cross inhibit each other, you cannot have both present at the same time, can have one or the other, so this type of or situation is very common in biology.",
                    "label": 0
                },
                {
                    "sent": "When you have to switch from one thing to another and make a very clear cut boundary distinction between them.",
                    "label": 0
                },
                {
                    "sent": "So we have a non coding RNA and protein crossing hitting each other.",
                    "label": 0
                },
                {
                    "sent": "And on one hand, the Paris Speckles Act to sequester lots of Arnie binding proteins away, and these proteins might all be proteins that drive prepotent stage.",
                    "label": 0
                },
                {
                    "sent": "So when you're sequestered in the cells can transition and go on to differentiation.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, we have to do before the three that changes three prime end processing this pollination in a way that promotes prepotent stage.",
                    "label": 0
                },
                {
                    "sent": "And so this, we think, is now kind of discord.",
                    "label": 0
                },
                {
                    "sent": "Machinery of cell fate choices that might link to the observation in LS that we saw that this transitions during the early differentiation with slightly too quick.",
                    "label": 0
                },
                {
                    "sent": "Maybe that's because these mutations in LS promote the type of behavior like before this tree that somehow changes the fates in some interesting way.",
                    "label": 0
                },
                {
                    "sent": "But this is completely hypothetic.",
                    "label": 0
                },
                {
                    "sent": "We still haven't linked these studies together, but the third thing I wanted to mention really quickly, but I'm not sure if I have.",
                    "label": 0
                },
                {
                    "sent": "Time action very quickly.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is how this links to aging, so we all know that this type of disease like motor neuron diseases happen after a certain age.",
                    "label": 0
                },
                {
                    "sent": "And what is it that delays these diseases until certain stage of the lifetime?",
                    "label": 0
                },
                {
                    "sent": "We've seen that in pretty potent cells, we can see the facts happening already very early on as they start differentiating the somehow Malak at molecular level, they're moving too quickly in this differentiation program.",
                    "label": 0
                },
                {
                    "sent": "So why do these disease causing mutations only manifest themselves?",
                    "label": 0
                },
                {
                    "sent": "Later in life, if in culture we can see the facts very, very early on, so our hypothesis is that actually our bodies are very good in compensating lots of problems that we have in ourselves.",
                    "label": 0
                },
                {
                    "sent": "The cells can work with each other to kind of keep on any dysfunctions under control through most of our lifetime, but upon aging you can see here a variety of different kinds of processes in ourselves are starting to become dysfunctional or less capable of correcting any damage in the cells.",
                    "label": 0
                },
                {
                    "sent": "And because of this, depending on which type of.",
                    "label": 0
                },
                {
                    "sent": "Aspect of repair is deficient.",
                    "label": 0
                },
                {
                    "sent": "Different type of diseases will arise upon aging and we are now interested in how this irony, biology we're studying links to the process of aging and we approach this in a kind of completely agnostic way by actually looking at human tissue postmortem human tissue.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the first study we did here was to collect tissue from mainly from patients with this frontal temporal dementia that I mentioned earlier, which also involves RNA binding proteins compared it with Alzheimer's disease.",
                    "label": 0
                },
                {
                    "sent": "And on top you can see this frontal and temporal lobe of the brain.",
                    "label": 0
                },
                {
                    "sent": "These are the lobes affected in front of temporal dementia and the kind of affects the way the patients the problems they have are quite different from Alzheimer's disease because they affect different brain regions.",
                    "label": 0
                },
                {
                    "sent": "But this temporal lobe is affected in both diseases, so we could use it as a nice comparison between the diseases.",
                    "label": 0
                },
                {
                    "sent": "And we saw here all the orange dots here are samples from disease patients.",
                    "label": 0
                },
                {
                    "sent": "All the blue circles are cognitively normal controls, and one thing we notice that the words larger age.",
                    "label": 0
                },
                {
                    "sent": "What we looked at here, we're actually all exons regulated by TDP 43.",
                    "label": 0
                },
                {
                    "sent": "We had an assumption that the TDP 43 program is somehow implicated in the disease.",
                    "label": 0
                },
                {
                    "sent": "It turned out in the end much more complex that we somehow stumbled into this phenomenon of aging, which we're not expecting.",
                    "label": 0
                },
                {
                    "sent": "We're expecting all the blue dots to be on the same line, and that there will be no no contribution of aging.",
                    "label": 0
                },
                {
                    "sent": "They were all controls.",
                    "label": 0
                },
                {
                    "sent": "So we're quite surprised that larger age this blue dot started to move closer to disease.",
                    "label": 0
                },
                {
                    "sent": "That was our main takeaway point from this slide, and you can see the blue dots also being very variable, so we have 95 year old sample here.",
                    "label": 0
                },
                {
                    "sent": "That's completely the same as the younger sample in the study.",
                    "label": 0
                },
                {
                    "sent": "And then we have some that are already at the age 50 and are quite close to the disease sample.",
                    "label": 0
                },
                {
                    "sent": "So this is not predict if this is just a trend line that somehow it with H more more healthy samples will start moving closer to the disease state and we were interested about why that might be.",
                    "label": 0
                },
                {
                    "sent": "So we took some representative samples that are either kind of having completely normal controls state or more in practice healthy state, but still closer to disease or the disease samples and we characterize them.",
                    "label": 0
                },
                {
                    "sent": "In transcriptomic way.",
                    "label": 0
                },
                {
                    "sent": "So here we just looked at 13 exons.",
                    "label": 0
                },
                {
                    "sent": "But now we characterize thousands of axons with other techniques.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we notice that we have on one hand set of changes.",
                    "label": 0
                },
                {
                    "sent": "Here is just a heat map on the left where you can see that all the controls are different from disease and we don't have a lot of signature of aging.",
                    "label": 0
                },
                {
                    "sent": "So there is 1 program which is a disease specific program.",
                    "label": 0
                },
                {
                    "sent": "And then there's another program here where you can see changes in processing that mainly distinguish between younger and older controls and all the controls are all next to the disease.",
                    "label": 0
                },
                {
                    "sent": "So we can now distinguish this to different programs, but we didn't really know what they mean very much.",
                    "label": 0
                },
                {
                    "sent": "We could see the different proteins regulated these two programs.",
                    "label": 0
                },
                {
                    "sent": "So this program here would be often regulated by protein called PTB.",
                    "label": 0
                },
                {
                    "sent": "And the other program up there is often regulated by protein called Nova, which is more neuron specific, and this is more PTB, some more non neuronal protein that's made more expressing glial cells, but that's all we could just speculate that.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But we thought the 1st way to understand this a little bit better.",
                    "label": 0
                },
                {
                    "sent": "So now understanding the context of the cell types of the brain.",
                    "label": 0
                },
                {
                    "sent": "So here is just a little scheme of how the primary cell types of the brain interact with each other.",
                    "label": 0
                },
                {
                    "sent": "So in order to have the neuron you have in the purple, you have the cell body of the neuron.",
                    "label": 0
                },
                {
                    "sent": "This is where the jeans are stored in the DNA, and then you have these different processes going out from the neuron that contact with other cell types.",
                    "label": 0
                },
                {
                    "sent": "You have this very long process from the neuron, which is called an Exxon.",
                    "label": 0
                },
                {
                    "sent": "Where neurons sends the signal can go quite far away from the cell body to contact other neurons.",
                    "label": 0
                },
                {
                    "sent": "And these bits are surrounded by type of glial cell type called oligodendrocyte inside the brain inside the central nervous system.",
                    "label": 0
                },
                {
                    "sent": "And so these are good undersides insulated.",
                    "label": 0
                },
                {
                    "sent": "These bits and allow this flow of information to be smooth and healthy and provide with nutrition.",
                    "label": 0
                },
                {
                    "sent": "And then we have astrocytes which will be mainly contacting the neurons at the points of synapses.",
                    "label": 0
                },
                {
                    "sent": "They will provide nutrients.",
                    "label": 0
                },
                {
                    "sent": "They kind of give the metabolic support to neurons.",
                    "label": 0
                },
                {
                    "sent": "We have microglial cells which are kind of immune cells of the brain.",
                    "label": 0
                },
                {
                    "sent": "They scan through potentially infections of the brain, but they're also very important in diseases.",
                    "label": 0
                },
                {
                    "sent": "You'll see later and then we have cells that are on the site of these blood vessels in the brain.",
                    "label": 0
                },
                {
                    "sent": "This happened immune cells and they communicate between all the kind of.",
                    "label": 0
                },
                {
                    "sent": "Blood supply of the brain and all the glial cells and astrocytes and so forth.",
                    "label": 0
                },
                {
                    "sent": "All these cells are intensely connected, as you can see here.",
                    "label": 0
                },
                {
                    "sent": "None of them can be studied in isolation, so we wanted to see.",
                    "label": 0
                },
                {
                    "sent": "Even though our data is from a whole tissue chunk, where all the cells are combined together, we wanted to use computational tools to try to deconvolute this data and learn something about each of these cell types, and one way you can do that is to use available public data that tells you which genes are expressed only in a certain cell type.",
                    "label": 0
                },
                {
                    "sent": "There kind of marker genes for that cell type.",
                    "label": 0
                },
                {
                    "sent": "And by looking at those genes you can have some information even from a mixed data about what happens to each of these cell types and 1st.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Very simplistic analysis here by just looking at this aging or disease specific programs that we saw earlier and we saw with things that are specific for disease.",
                    "label": 0
                },
                {
                    "sent": "The only thing that jumps out is that neurons are dying, so the genes expressed in the neurons are dramatically going losten those and other patterns associated with neurons.",
                    "label": 0
                },
                {
                    "sent": "So in disease this is known.",
                    "label": 0
                },
                {
                    "sent": "You can look at that issue and you see the neurons are almost gone, so that's expected and nothing new.",
                    "label": 0
                },
                {
                    "sent": "What is interesting in this aging associated program that was also present in disease?",
                    "label": 0
                },
                {
                    "sent": "We didn't see this loss of neuronal signature.",
                    "label": 0
                },
                {
                    "sent": "It was more the glial programs that were standing out a little bit, especially the oligodendrocytes.",
                    "label": 0
                },
                {
                    "sent": "So we thought we need to understand this glial program a little bit more.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So when we have about four years ago when we move to London with the Institute Neurology, we started interacting with colleagues there who have produced massive amounts of data from healthy populations across 150 individuals, and you can see here we have now different datasets that we could exploit the UK data set was with our colleagues is UK brain expression consorts.",
                    "label": 0
                },
                {
                    "sent": "Him had over 1000 samples analyzed, then we have North American monitors, about 600.",
                    "label": 0
                },
                {
                    "sent": "And then we have the information of different cell types in mouse and human that we could take it for data analysis and the lock is a computational biologist.",
                    "label": 0
                },
                {
                    "sent": "Very good with machine learning, so she wanted to extract some meaningful information from all this data about aging and from this UK data we also had information about 10 different brain regions.",
                    "label": 0
                },
                {
                    "sent": "So we had some information about the regional perspective on the brain and we had a good distribution across the age.",
                    "label": 0
                },
                {
                    "sent": "We kind of have their ruffes distinction between young, middle and old age in these samples.",
                    "label": 0
                },
                {
                    "sent": "And so we had all these different cell types in terms of expression profiles, because identify markers of these cell types and try to put it.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Altogether and then the first takeaway point is that this microglia, this immune like cells of the brain, their expression signature is dramatically increased upon aging.",
                    "label": 0
                },
                {
                    "sent": "The neural expression signature is slightly decreased upon aging, and you can also look at the regional components.",
                    "label": 1
                },
                {
                    "sent": "So on the bottom each dot is 1 sample, but because we have 10 different regions of the brain, you have 10 different dots from every individual and at the bottom there color coded by the H. So that are the older samples and green are the younger samples.",
                    "label": 0
                },
                {
                    "sent": "You can see if you look at all the dangerous side.",
                    "label": 0
                },
                {
                    "sent": "If you look at the microglial markers they separate so we can really say microglia can tell you more.",
                    "label": 0
                },
                {
                    "sent": "This sample is older or younger.",
                    "label": 0
                },
                {
                    "sent": "Weather is when you look at neuronal markers there on the right.",
                    "label": 0
                },
                {
                    "sent": "They don't separate these samples based on age but mainly based on region.",
                    "label": 0
                },
                {
                    "sent": "So region is on the top.",
                    "label": 0
                },
                {
                    "sent": "The color coding on the 10 regions is marked on the top.",
                    "label": 0
                },
                {
                    "sent": "So for neurons regional identity is so strong that with aging it shifts only a little bit.",
                    "label": 0
                },
                {
                    "sent": "With microglia, there's not of different regional differences in the brain, so the main changes are with the edge.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we were really interested a little bit more in other cell types, so it's clear that in disease microglia it's known that there kind of inflammatory state increases and that neurons become a little bit less functional, less active, so their expression goes down.",
                    "label": 0
                },
                {
                    "sent": "So that was kind of expected, but we wanted to know.",
                    "label": 0
                },
                {
                    "sent": "So what happens with other cell types, specially other glial cell types that are less well understood?",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we looked at.",
                    "label": 0
                },
                {
                    "sent": "One hand, the imaging of neurons which we saw some changes in the program, and this was a very complex analysis with huge amounts of data generated and machine learning to detect these cells.",
                    "label": 0
                },
                {
                    "sent": "This is just showing how you get started with this big image down to machine learning to recognize individual cells.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What we notice here is that the largest types of neurons, the ones on the way right here that looks really big that those neurons decrease in their counts in the older brain, whereas most other cell type most of the neural types became quite unchanged.",
                    "label": 0
                },
                {
                    "sent": "So there's something to do with the large size of the neurons and those largest neurons have this huge.",
                    "label": 0
                },
                {
                    "sent": "What you call arbors huge connection tree and they need a lot of glial support for being functional for attaining their kind of activity.",
                    "label": 0
                },
                {
                    "sent": "So it you might say is the reason because.",
                    "label": 0
                },
                {
                    "sent": "These neurons are particularly sensitive is because something might be going on with clear space.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We already got dangerous eyes that are wrapped around these processes from the neurons.",
                    "label": 0
                },
                {
                    "sent": "So when looking at just expression profiles of these two cell types, we notice that astrocytes had kind of complex patterns depending on the regions different things were happening in Hollywood under sites, we may see this blue.",
                    "label": 0
                },
                {
                    "sent": "Blue means that the jeans are mainly going down, which means these jeans for this type of cells are somehow downregulated.",
                    "label": 0
                },
                {
                    "sent": "Also oligodendrocyte, similar to neurons and also we saw some interesting shifts in identity.",
                    "label": 0
                },
                {
                    "sent": "So this is a regional expression.",
                    "label": 0
                },
                {
                    "sent": "And that is the aging so you can see here that.",
                    "label": 0
                },
                {
                    "sent": "The red cluster here is missing all the old individuals are clustered together in that red cluster.",
                    "label": 0
                },
                {
                    "sent": "We having samples from two different brain regions from hippocampus and substantia nigra.",
                    "label": 0
                },
                {
                    "sent": "Hippocampus is the region most implicated with Alzheimer's and substantial nigra with Parkinson's disease and those two regions are showing the biggest shift in a way they're not where they're supposed to be from the young brain, they lose their identity in the kind of shift together when it comes to this cell type, for example, so there was some.",
                    "label": 0
                },
                {
                    "sent": "Loss of that regional identity of the cells.",
                    "label": 0
                },
                {
                    "sent": "And some changes in expression so.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But we should also look at what happens on the images of these cells.",
                    "label": 0
                },
                {
                    "sent": "And again we did the same analysis of all you can decide to recognize how to count them in the.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we saw now a really interesting and dramatic decrease in their accounts.",
                    "label": 0
                },
                {
                    "sent": "You can see here for the aging when you look at the oligodendrocytes in the middle panel, you see quite striking, decreasing the counts of oligodendrocytes, especially in the brain regions that don't have a lot of neurons.",
                    "label": 0
                },
                {
                    "sent": "Those that are kind of more white matter like regions where the connections are happening within the brain.",
                    "label": 0
                },
                {
                    "sent": "So that somehow comes altogether a little bit.",
                    "label": 0
                },
                {
                    "sent": "So this is all very descriptive.",
                    "label": 0
                },
                {
                    "sent": "We still don't know how to interpret what is the cause of this, But this gives you a sense of that perspective of looking at the human brain.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to conclude, we saw that there are changes in RNA processing in LS models on the IP S and the cellular models that are specific for some types of RNA processing and seemed to do something with the timing of that.",
                    "label": 0
                },
                {
                    "sent": "And we think that this changes can be related to behavior of RNA granules such as para speckles.",
                    "label": 0
                },
                {
                    "sent": "And discerning grandis can affect cell fate choices already in a culture.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "What we are also know very well that patients are fine during their lifetime.",
                    "label": 0
                },
                {
                    "sent": "So even though in culture we see the facts, this is compensated in an Organism.",
                    "label": 0
                },
                {
                    "sent": "So this developmental defects in RNA mechanisms are compensated until you come to aging and what in the end we see in the aging.",
                    "label": 1
                },
                {
                    "sent": "Is there something different with this cell fates with oligodendrocytes we see this decreased in the accounts and that might relate to some molecular mechanisms of maintaining the correct fates of the cells.",
                    "label": 0
                },
                {
                    "sent": "So I had part is is that we are studying now is that on one hand there compens atory mechanisms that are maintaining cells healthy in spite of some molecular defects throughout the lifetime.",
                    "label": 0
                },
                {
                    "sent": "But this compensatory mechanisms become defective in aging.",
                    "label": 0
                },
                {
                    "sent": "And then due to that loss, this RNA granules are starting to.",
                    "label": 0
                },
                {
                    "sent": "Be apparent in the way that they perturb the cell fate choices and that leads to misbehavior, especially of glial cells, which eventually kind of leads to stress on the brain tissue.",
                    "label": 1
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to conclude, I mentioned already who are the primary leaders of this work.",
                    "label": 0
                },
                {
                    "sent": "I also didn't mention to match before.",
                    "label": 0
                },
                {
                    "sent": "Who is the person who is doing all the main computational biologists of the clip data and working on Eclipse Server also working together with Co gang Alice that is look eyes here now on making a really nice web server to present.",
                    "label": 0
                },
                {
                    "sent": "That is our latest picture of the lab in front of the Institute and our main funders, especially the ERCA and European funds are very important.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry to be a bit over the timing.",
                    "label": 0
                },
                {
                    "sent": "Time for question of emo additional insulation impression.",
                    "label": 0
                },
                {
                    "sent": "Translation decibels there should have had nothing 'cause it is slicker than a Kia mechanic.",
                    "label": 0
                },
                {
                    "sent": "Natalie said the coast over shiny haleema mechanical.",
                    "label": 0
                },
                {
                    "sent": "It's similar or chromatic capper.",
                    "label": 0
                },
                {
                    "sent": "Nick Microdynamics renewal agricultural logo to my basic tornado intelligence going to Nikki.",
                    "label": 0
                },
                {
                    "sent": "Stop liquor stores this stop near me, Anna Stickler, popular at the processor.",
                    "label": 0
                },
                {
                    "sent": "To separate mechanical Michigan mechanical with simple molecular Po po Sam's Nick Day location.",
                    "label": 0
                },
                {
                    "sent": "Stop nationella karacha Stover morgani gratitude.",
                    "label": 0
                },
                {
                    "sent": "So vasculature as prime member of this color to Red Star package sticker in the second, which is particular to previous trees.",
                    "label": 0
                },
                {
                    "sent": "Unpack maturation.",
                    "label": 0
                },
                {
                    "sent": "Avoid some.",
                    "label": 0
                },
                {
                    "sent": "Cross agrees that the coach in Scac.",
                    "label": 0
                },
                {
                    "sent": "They question liquid droplets grazer.",
                    "label": 0
                },
                {
                    "sent": "Biophysical Net which is to be a physician if an American circus.",
                    "label": 0
                },
                {
                    "sent": "There was crucial as a mid kata dynamic, but still it's inquisitorial era in kite.",
                    "label": 0
                },
                {
                    "sent": "Apricot is the culture of tiredness.",
                    "label": 0
                },
                {
                    "sent": "Tonya composer personality ballism.",
                    "label": 0
                },
                {
                    "sent": "Scope roshanak is exist today to the package mini mining in vitro.",
                    "label": 0
                },
                {
                    "sent": "Kentucky pick boy.",
                    "label": 0
                },
                {
                    "sent": "With more context Akiva insane, it's very noisy persona.",
                    "label": 0
                },
                {
                    "sent": "Person.",
                    "label": 0
                },
                {
                    "sent": "As you have around other priorities at the Cucina, Paterno, Spanier testkey accretive concoction.",
                    "label": 0
                },
                {
                    "sent": "I put to turn us Tonya Cashman Smith Loma Hanscom Alioto Nick Restaino spaniel.",
                    "label": 0
                },
                {
                    "sent": "Yeah, cross better interaction Med beta sheets in top shape processa Titisee to be physician osnova taper harder visional compression should.",
                    "label": 0
                },
                {
                    "sent": "Unpack Groo clowns.",
                    "label": 0
                },
                {
                    "sent": "Attacker ponytail Luchessa interacts in acquisition for Merit.",
                    "label": 0
                },
                {
                    "sent": "Is a molecule is Anadarko visual portfolio terms of parade route for the complex signal, average Nana, Rozen denoting secretaries and appeared in the prayer?",
                    "label": 0
                },
                {
                    "sent": "To go out or foggy and cold in God's radio, villagers saw me.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "It's really pretty darn it.",
                    "label": 0
                },
                {
                    "sent": "Super salty scammers animals visit steam Arantxa Parra Speakers Protv DLC agree to scissor semoran overs to Aaron Accuity DLC soda in vitro to request into that, I'm watching to draw secretly or not or booty.",
                    "label": 0
                },
                {
                    "sent": "Saccharin need distance novatech Deltic perspective present.",
                    "label": 0
                },
                {
                    "sent": "I need some.",
                    "label": 0
                },
                {
                    "sent": "Treatments are Duston checks, Premiership city for mirror, Sony Kataria that need vision and Rivers 39 still leave Anna Nikova Ritsema editor and RNA editing.",
                    "label": 0
                },
                {
                    "sent": "Approved Nasha Dominica vlog of antimatter Galaxy Note nurses need developer that could be built.",
                    "label": 0
                },
                {
                    "sent": "Oils are verbal output per quarter session resume, it double cheese, queso druger naches setting strict orders not Ryan, eat dinner suppose they cash into the symbols to delusion, dubstep.",
                    "label": 0
                },
                {
                    "sent": "Division of Nucleus originally typically keep for mirrors, while last granular prospectuses so many with Nagi, which enable Pogo stick with Anita Sarkeesian and Pack.",
                    "label": 0
                },
                {
                    "sent": "Shouldn't ask cause Nova Nikki let's say so, but still it's illegal at risk by eloquently in vitro structured, seamless integration.",
                    "label": 0
                },
                {
                    "sent": "Did Pirates attacker it was renewed Ogre and Odyssey Kba San die?",
                    "label": 0
                },
                {
                    "sent": "She connected Richie Crona in drugs attack Ascension, which is double kill City protein.",
                    "label": 0
                },
                {
                    "sent": "It can model, but not at the subnational located tryba interpreting Sammy said Lotus Core is earlier.",
                    "label": 0
                },
                {
                    "sent": "Condense it, could they produce lots of toner in veterinary diet?",
                    "label": 0
                },
                {
                    "sent": "Shiny show my mom choice a zerker Shawnee.",
                    "label": 0
                },
                {
                    "sent": "Resume what should be said.",
                    "label": 0
                },
                {
                    "sent": "Our Pritchard rubies Toaster Evanity, Paris Baker.",
                    "label": 0
                },
                {
                    "sent": "So being negative interpretable.",
                    "label": 0
                },
                {
                    "sent": "This yeah, this is the village dealer asked Rivonia.",
                    "label": 0
                },
                {
                    "sent": "I'll put strain of analytics third Co curvature attic drug emotiva LS Customs Materials, direct narimani protein oblivion out strain of an interested Kona.",
                    "label": 0
                },
                {
                    "sent": "And now you're between us.",
                    "label": 0
                },
                {
                    "sent": "You're an out of a gear.",
                    "label": 0
                },
                {
                    "sent": "Nick is visually sesamin code code that cheat noise.",
                    "label": 0
                },
                {
                    "sent": "Private dynamic events inequality must know Ronnie.",
                    "label": 0
                },
                {
                    "sent": "In code that they see each other, yes, we have Gina screening go in Brazil and is in a team coached.",
                    "label": 0
                },
                {
                    "sent": "Apricot is the coach of 1/3 Nathaniel.",
                    "label": 0
                },
                {
                    "sent": "Accordingly, Ramona the cocoa.",
                    "label": 0
                },
                {
                    "sent": "Animal protein dispersibility.",
                    "label": 0
                },
                {
                    "sent": "Public public truth.",
                    "label": 0
                },
                {
                    "sent": "In a team dinner.",
                    "label": 0
                },
                {
                    "sent": "Shakira shine yeah.",
                    "label": 0
                },
                {
                    "sent": "Is cheese droga droga discipline nakaza listed.",
                    "label": 0
                },
                {
                    "sent": "Konicki applicative.",
                    "label": 0
                },
                {
                    "sent": "Nick Alpo Simon Says really smelly.",
                    "label": 0
                },
                {
                    "sent": "We love our share this car and you put some of the context too.",
                    "label": 0
                },
                {
                    "sent": "And OK julians Catawba yeah, but just as a model he petition kind be provincial, T applicative no thinky will Popovich anniversary keep available Pretoria and Gucci which of this one is looking laboratory where rupee America?",
                    "label": 0
                },
                {
                    "sent": "Ali Resnica Nick Disruption network issues throughout relative history.",
                    "label": 0
                },
                {
                    "sent": "No Sega.",
                    "label": 0
                },
                {
                    "sent": "Kaname, but watch American should should be Pacific with Sedona.",
                    "label": 0
                },
                {
                    "sent": "This test because they need us more cohesive connectors.",
                    "label": 0
                },
                {
                    "sent": "But some temperature Bush corners none such as WPA artist smearing it secure.",
                    "label": 0
                },
                {
                    "sent": "Or knowledge prelusion astute appearance CM docious serum.",
                    "label": 0
                },
                {
                    "sent": "Back security just occlusion Avanza took a public textually.",
                    "label": 0
                },
                {
                    "sent": "Formula study race.",
                    "label": 0
                },
                {
                    "sent": "Revered agrace step sales architectures.",
                    "label": 0
                },
                {
                    "sent": "Nick boom.",
                    "label": 0
                },
                {
                    "sent": "Prison presentation and Compaq Machine as nicely with.",
                    "label": 0
                },
                {
                    "sent": "Miley cracking the producer in district consistent, must never Do Club team with the pathetically addition is my list reveal.",
                    "label": 0
                },
                {
                    "sent": "And Richie honest.",
                    "label": 0
                },
                {
                    "sent": "Yeah Topaz then you must miss laptop's data center.",
                    "label": 0
                },
                {
                    "sent": "One more cheese per minute test retrial chassis.",
                    "label": 0
                },
                {
                    "sent": "Tried various trees at late paint brushes and Kentucky Aplica tuner sheet.",
                    "label": 0
                },
                {
                    "sent": "20 code for the Miss under their projects is low risk of an opera duet.",
                    "label": 0
                },
                {
                    "sent": "Could Slack off label toploader privacy training.",
                    "label": 0
                },
                {
                    "sent": "Met with the producer.",
                    "label": 0
                },
                {
                    "sent": "There was a clear.",
                    "label": 0
                },
                {
                    "sent": "The social thing where it's a project to Douglas.",
                    "label": 0
                },
                {
                    "sent": "Oh my gosh, no pressure on ya.",
                    "label": 0
                },
                {
                    "sent": "Church in customs.",
                    "label": 0
                },
                {
                    "sent": "Annotate me now.",
                    "label": 0
                },
                {
                    "sent": "Donna's the team focus on nature, shine and the Premier Kiper Edea.",
                    "label": 0
                },
                {
                    "sent": "The project Papa team, you just financier and everything and server with me.",
                    "label": 0
                },
                {
                    "sent": "She should go.",
                    "label": 0
                },
                {
                    "sent": "Concurrent Northampton, yeah yes, Master together, but the prescription be plat financier and noticed that this epilogue iach financial emotional steam unpack the Genco Lackner pray grant much matcha deal taker carpet luggage Noriega in the roster rocket is not liko vicino parameters and Nick and Nora Story continues in alternate piece on imposition.",
                    "label": 0
                },
                {
                    "sent": "Flowers in the fray.",
                    "label": 0
                },
                {
                    "sent": "In ear tickle abogo Nima Krishna Pro stroganoff, stroganoff, Zara, stink.",
                    "label": 0
                },
                {
                    "sent": "I suppose it's still not in Redico Caribbean.",
                    "label": 0
                },
                {
                    "sent": "Icarus Nanas, Mariana double doubles attack Mystic story, classic Red, Lago Unpacking Boy, potentially specifically at a situational secrecy preliminary.",
                    "label": 0
                },
                {
                    "sent": "Normally there should have been a traditional Christian.",
                    "label": 0
                },
                {
                    "sent": "Yeah, just eat my pleasure.",
                    "label": 0
                },
                {
                    "sent": "Bad breath after terrace prestige made separate.",
                    "label": 0
                },
                {
                    "sent": "Sweeney is a true demo Derby two Dibble, spatial tempered Rocio Pawsox Licia process to valuable to Skokie druggie in Zahrada.",
                    "label": 0
                },
                {
                    "sent": "Celestial aodv ask statical spatially kioti store output Portugal, Korea.",
                    "label": 0
                },
                {
                    "sent": "Cardamom yet neighbor Margaret Estatico spatially people do before new project to ensure hope timber dot porno coleus from area to Slovensko Papa Tim Weenie.",
                    "label": 0
                },
                {
                    "sent": "Yes, I could not play.",
                    "label": 0
                },
                {
                    "sent": "Show Cambridge is Cindy Lou.",
                    "label": 0
                },
                {
                    "sent": "Is that connected to chemo to spoil last name cosmetic or funding?",
                    "label": 0
                },
                {
                    "sent": "To contact some code beauty store snova or distributor Sam Gunderson Stavo in Mail.",
                    "label": 0
                },
                {
                    "sent": "It's a narrow princesses, and they're typically have noodles.",
                    "label": 0
                },
                {
                    "sent": "Healthier this now.",
                    "label": 0
                },
                {
                    "sent": "West African black women's denim and veg cares masternaut mode.",
                    "label": 0
                },
                {
                    "sent": "Granto Disney unpack missing the Angelus block chain function eras data.",
                    "label": 0
                },
                {
                    "sent": "Bush at distinct positive medical.",
                    "label": 0
                },
                {
                    "sent": "The chatter connect.",
                    "label": 0
                },
                {
                    "sent": "Previously Deloitte is tenure track, the Lewis have a core funded Institute.",
                    "label": 0
                },
                {
                    "sent": "Imitations to the Crick Institute.",
                    "label": 0
                },
                {
                    "sent": "Only the pursuer, Somalia, D key phrase kapena until you did to be across the finances, chased up advantix late.",
                    "label": 0
                },
                {
                    "sent": "Today, by his logic tonight 'cause it's your cabido garage Newark orphanage to tackle procedures.",
                    "label": 0
                },
                {
                    "sent": "They language disappear, but there is available to dissipations jetco that is Pogan Paul Pena pray.",
                    "label": 0
                },
                {
                    "sent": "In management, more match diabetes.",
                    "label": 0
                },
                {
                    "sent": "The cheaper gone summer hours they pay started Nikos Ammo, so I'm gonna win March.",
                    "label": 0
                },
                {
                    "sent": "Dasmarinas deliquesces.",
                    "label": 0
                },
                {
                    "sent": "Yes, 20 numbers not range to charge.",
                    "label": 0
                },
                {
                    "sent": "So many questions, but Portal Institute says it is achievement on dragon.",
                    "label": 0
                },
                {
                    "sent": "Super Cool Examiner technology and the boys Meridell also inform at Sakura Bishop.",
                    "label": 0
                },
                {
                    "sent": "In this most low supermodel, to some Nigel ludicrously dial feedback, help ask Dylan Network domestic teacher summer million equals loser talk.",
                    "label": 0
                },
                {
                    "sent": "Is that Oscar beyond muscle cause Pantano provisions?",
                    "label": 0
                },
                {
                    "sent": "Click into docushare DNS flush Nickelodeon.",
                    "label": 0
                },
                {
                    "sent": "Conversion set Kaila Kona demos Linda because pasta wasn't reseal is Zaffina cylinder is Corning Gorilla.",
                    "label": 0
                },
                {
                    "sent": "Nice persuaded equivalency honest question is Daniel is responding to my discussion.",
                    "label": 0
                },
                {
                    "sent": "Eyes whispered Astra in honest.",
                    "label": 0
                },
                {
                    "sent": "Just discovering them in.",
                    "label": 0
                },
                {
                    "sent": "Nick isn't a dissolute distagon and packed with Nico interested listening to those non provisioned Coda.",
                    "label": 0
                },
                {
                    "sent": "Chicken with Tuna ludim Lada compressible Hawkshaw.",
                    "label": 0
                },
                {
                    "sent": "Nixon offers a Chapman over there, so is rain or heat transfer subnet in modest or cordon and scoop is nonya.",
                    "label": 0
                },
                {
                    "sent": "Twin dislocated rehire.",
                    "label": 0
                },
                {
                    "sent": "New chassis needs.",
                    "label": 0
                },
                {
                    "sent": "Emergency Sonic team racing.",
                    "label": 0
                },
                {
                    "sent": "London N2 problem.",
                    "label": 0
                },
                {
                    "sent": "Squeeze that order.",
                    "label": 0
                },
                {
                    "sent": "Mama sent Niko Stabilin last thing, which accent my ship.",
                    "label": 0
                },
                {
                    "sent": "They knew that the boy currently pushing in.",
                    "label": 0
                },
                {
                    "sent": "Quote.",
                    "label": 0
                },
                {
                    "sent": "Not on another man, should reach back miles long of a day and yeah.",
                    "label": 0
                },
                {
                    "sent": "OK, here is missing the boat owners the load over.",
                    "label": 0
                },
                {
                    "sent": "Shankar fancy.",
                    "label": 0
                }
            ]
        }
    }
}