{
    "id": "f44oblhsqofdntmftqizpaivddxfskzb",
    "title": "Adventures with Camille",
    "info": {
        "author": [
            "Peter Culicover, Ohio State University"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "May 2005",
        "category": [
            "Top->Computer Science->Machine Learning->Human Language Technology"
        ]
    },
    "url": "http://videolectures.net/mlss05us_culicover_ac/",
    "segmentation": [
        [
            "The kinds of things that we want to be able to explain and my concern is with finding explanations for the things that we know about language to the extent that we understand them, that we understand what goes on in language.",
            "So one of the things that we have been trying to do is to find ways of simulating language acquisition with an eye towards understanding to what extent certain aspects of of language can be accounted for in terms of way.",
            "Language is acquired by learner.",
            "Let's say.",
            "OK, so."
        ],
        [
            "When you think about this kind of issue, there are a number of questions that arise.",
            "One is how do we?",
            "How should we actually think about what knowledge of language consists of?",
            "And if you know anything about linguistics, you know that there's a certain amount of controversy about this and the view that I've been taking is, and I prefer to take is one that is at odds with what everybody else thinks.",
            "Almost perversely, so the second question type of question is, what is the architecture of the learner that would explain how is that we come to have this knowledge?",
            "And in that regard there are basically two possibilities when one can break it down a little bit further, but one possibility is that the knowledge that we have about language some of it is actually built into the learner explicitly, and it's there because we find there, because that's because the learner actually has it and the other is that it arises out of the way that the learner.",
            "Is the kind of data that they learn is exposed to in the way that the learner goes about building knowledge of language and there are other types of explanations, but these are basically the two tip the two.",
            "Most diverse ones, and can we simulate language acquisition in order to explore the view that we have about how language gets its structure from?",
            "From the architecture of the learner?"
        ],
        [
            "So I'm going to very quickly is run through a number of things that I've been involved in, one having to do with what it is that we know when we know language.",
            "This is from my book with Ray Jackendoff called similar syntax where we pursue something that I've come to call the Construction list manifesto, which has a number of different formulations, but I'll explain what that is, and then there's certain kinds of facts that we know about language, and one of the things we have to be able to explain how it is that those.",
            "Those facts are the way they are, how the knowledge of language as we describe it actually ends up in the head of a human being who's acquiring language, and then I'll talk about the the learner, the computational simulation that we've been trying to develop an.",
            "Then I also have a few remarks about simulating language in a social network which has some relevance to the broader questions that I'm talking about."
        ],
        [
            "On the standard view, in linguistic theory, a generative grammar of a language, that is what it is that you know when you know language or representation of what's in your head.",
            "Is an idealized characterization of the linguistic knowledge or linguistic competence of an idealized native speaker, and this is a very classical approach in contemporary linguistic.",
            "Theory and the theory of generative grammar, that is what a possible grammar is, is in term.",
            "In turn, a characterization of possible generative grammars.",
            "Possible things that could be in the heads of native speakers.",
            "On this view at."
        ],
        [
            "Active grammars theory about something that really exists.",
            "The linguistic competence of the native speaker.",
            "And the theory of grammar theory about the language faculty that explains why linguistic competence takes the form that it does.",
            "Both the grammar as described by linguists and the theory of grammar, that is, that this kind of what a possible grammar can be are in some sense in the mind or in the head, and they form a part of the explanation of human linguistic abilities wide.",
            "How it is that we end up knowing what we know."
        ],
        [
            "The alternative view which a lot of people prefer to take very often outside of linguistics, is that what resides in the language faculty is something of quite a different of quite a different sort that reflects in its architecture the dynamical character of language.",
            "In particular, if directly reflects, reflects the fact that grammar is required overtime that it is a psychological mechanism used for speaking and understanding, and that it undergoes.",
            "Change overtime so the view is that is that what we don't have in our heads is some kind of symbolic fixed symbolic device representation which we could call grammar, but rather what we have is our devices that are that are built up overtime that evolve that perform certain kinds of processes and that undergo change."
        ],
        [
            "So the challenge, if we take this alternative view that you really don't have in your head a grammar of the classical sort.",
            "Is that you really do have to account for the linguistic phenomena that have been observed by linguists, so you can throw out the what's known about language simply because you don't like the story that people have told about why it is the way it is.",
            "You have to be able to explain what generative grammar explains, and of course you have to be able to explain more.",
            "You have to be able to explain the acquisition, explain the processing, and explain the change."
        ],
        [
            "But OK.",
            "So the linguistic content of the alternative that you take if you choose to go down that Rd must be at least equivalent to the content of the generative grammar.",
            "And that is to say, both must provide the same or equivalent empirically adequate structural descriptions of words, phrases, idioms, constructions and sentences.",
            "And I would say that some of the reasonable criticism of some of the alternatives to mainstream grammatical theory is that they don't come close to accounting for the facts that have been observed.",
            "And of course this account must explain their dynamical properties as well.",
            "And then that's the end of that slide.",
            "So off we go."
        ],
        [
            "OK.",
            "The construction is manifesto is did a search on Google and I found it.",
            "I was surprised.",
            "Characterized rather nicely by.",
            "Quartz and Sinofsky, in contrast to learning as selective induction, the central component of the constructivists model is that it does not involve search through, and our priority defined hypothesis space, where that would be the classical view in linguistic accounts of language acquisition you have, you have to find you have a set of possible grammars.",
            "Ann, you're basically searching through the space of possible grammars to find the one that's most compatible with the.",
            "With the evidence about the language that you're being exposed to rather.",
            "It's it's not an instance of model based estimation or parametric regression.",
            "Instead, the constructivists learner builds this hypothesis as a process of activity dependent construction of the representations that underlie mature skills.",
            "So you're actually constructing.",
            "The grammar as you go based on your experience.",
            "Um?"
        ],
        [
            "So what we've done is taking this view about constructing a grammar based on experience.",
            "We've taken a view about grammar, which is due largely to Ray Jackendoff, although it's due to others as well, and I've done some work in this area in my book Syntactic Nuts and Jackendoff, and I have a book coming out called similar syntax which develops this.",
            "These kinds of ideas further, this is a construction less one construction list view.",
            "The view is the following.",
            "There's a job of a grammar.",
            "Is to describe the sound meaning correspondence is you have sounds, strings of sounds and they have meanings associated with them.",
            "And the correspondences are more or less systematic.",
            "Some of the correspondence is are analyzable so you have a word and it corresponds to has a certain meaning.",
            "In many cases you cannot explain why it is that that word means what it means.",
            "It has no internal structure.",
            "Some correspondence is do have linguistic structure, but are simple or not entirely transparent on the meaning side.",
            "So you may have an expression that has of many words.",
            "It has a fixed meaning.",
            "Such as an idiom, so there's no nice matching up of the structure of the.",
            "Of the expression in the structure of the meaning you do have you have other cases where you have structure and you have transparent relationship between the structure and the meaning, and this would be the classical case.",
            "The typical case where you have a phrase that's transparent with the meaning of the whole is a function.",
            "A simple function of the meaning of the parts.",
            "And then you have combinations, more complex situations, and that's the one that the kind of situation that I described in syntactic nuts where you have.",
            "Various kinds of constructions which are quasi idioms and if you know anything about linguistics, you know what I'm talking about here.",
            "Double object constructions, movement along a path, expressions, syntactic nuts.",
            "In my book, various operator trace binding constructions and so on.",
            "Each of these constructions which we find in natural languages has some degree of predictability.",
            "Systematis city in generality, but I also have some, some idiosyncrasy's and the and the problem for the learner is to acquire them accurately, get the general parts right.",
            "And get the idiosyncrasy is right, and the secrecies may.",
            "In fact, we have some regularity.",
            "There may be somewhat systematic, or they may be entirely exceptional, so you have to get it right and the fact about language that we have to recognize that the range of knowledge that we have, the knowledge that we have ranges in character from the very very specific and idiosyncratic to the very general and depends on the case on the construction on the phenomenon that we're talking about.",
            "We can talk, and that was the that was the point that I tried to make.",
            "In syntactic nuts."
        ],
        [
            "The simpler syntax hypothesis that we layout in our book is that the most explanatory syntactic theory is the one that includes the minimum structure necessary to mediate between sound demeaning.",
            "And here we're arguing with a long tradition of of syntactic theorizing.",
            "Where a lot of there's a lot of elaborate abstract structure to mediate the meaning, which is not really identifiable in terms of the form."
        ],
        [
            "I'll give you a few examples about this range of correspondences, so you get a few."
        ],
        [
            "For it, as I mentioned before, many words are unanalyzable correspondences between sounds, sound and meaning.",
            "Well, some have argued otherwise.",
            "It."
        ],
        [
            "Games have a recognizable, typically have a recognizable syntactic structure, but unpredictable meaning.",
            "So by and large is 2 things that are coordinated.",
            "Lo and behold, similarly beat a dead horse.",
            "That's a very normal phrase.",
            "It actually has a literal meaning, but it also has a non literal meaning.",
            "The non literal meaning is not predictable from the meaning of the parts make amends.",
            "IS has a structure that's recognizable, it's English and the verb goes where it should go and the object goes where it should go.",
            "But the meaning is not in any obvious sense of composition.",
            "Compositional product of the syntactic structure.",
            "We have some very special idiosyncrasies such as we have cast aspersions on.",
            "Cast dispersions at I don't think is proper English cast dispersions too, so you have to know something about this specific about this particular expression of flash in the pan is another such thing put up with is another kind of.",
            "Idiomatic construction, where you can't.",
            "You can't predict what the meaning is going to be by knowing the meaning of the parts, and this is very, very common.",
            "It's quite endemic to natural language."
        ],
        [
            "There are constructions in English which are verb phrases where the the verb phrase itself has parts that are that have normal meetings.",
            "But then the whole the whole construction itself imposes a little bit extra meaning on the construction so.",
            "The way construction Elmer hobbled or Joe laughed or joked his way to the bank means made his way to the bank.",
            "Humbling, laughing, joking, and so on.",
            "Hermione slept, drank soda, programmed three whole evenings away.",
            "Isn't this another special construction which has a certain form and a certain meaning in virtue of the particular parts, sound, sound, motion, construction like the car whizzed past Harry, which means the car went past Harry making a whizzing sound.",
            "Resultative construction, the chef Cook the pot black, meaning the chef cook the pot until it was black or made it black by by cooking.",
            "In these are all cases, and there are many, many more, and it can be multiplied at quite quite indefinitely by linguists, where there's there's a range of specificity, some of the meaning of the construction is predictable from the meaning of the parts, but you have to know something about the construction, and you have to know that there's something else there that is not there.",
            "In the construction, it's not explicitly there, you just have to know what it means."
        ],
        [
            "Uh.",
            "These kids show they all share the same basic syntax, so there's something there's something general about them.",
            "Since they're all English.",
            "But what's an idiosyncratic is the way in which their meanings are related to the to the parts."
        ],
        [
            "So the view that I'd like to suggest is that when you have.",
            "So the way that language is constructed, that language is not there, but it's constructed on the basis of experience that the way in which language is constructed gives rise to constructions.",
            "In the general case.",
            "Meaning that you lack the knowledge of language is constructed by a learner that is, learning actually takes place and it's not some kind of parameter setting or simply picking out one of the many possibilities from the from a pre constructed space.",
            "What emerges from this process are constructions in the sense that I've been discussing just now that may ultimately become rules if they become general enough, but they only become general enough if there's enough evidence to support the generalization.",
            "Otherwise, they remain constructions in the sense that they are not fully general and they have idiosyncrasy's."
        ],
        [
            "So you say, well, the obvious question is if you are a learner, how do you know whether you're dealing with something that's general or something that's?",
            "Idiosyncratic, and the answer is you don't you start off by assuming everything is reduced syncratic and you only generalize if you have evidence to support the generalization.",
            "That means that as you construct the language, everything is going to start out being a construction or an idiom of something rather specific, and you're going to start generalizing and building sort of larger structure in this representation of the language as the evidence comes in.",
            "This is a view that is has also been proposed by Michael Tomasello, a psychologist who works on language acquisition."
        ],
        [
            "So the computational model that we've simulation that we've come up with is not a model.",
            "Simulation is way of exploring some of these ideas, and as a simulation it turns out to be messy and much more difficult to do then I had originally intended, but it is interesting, is called Camille Camille because it's conservative or concrete.",
            "It's conservative and conservative in the sense that on the basis of of.",
            "It does not generalize much beyond the evidence.",
            "That is that it's given.",
            "So if it's not given a lot of evidence, it will end up assuming that something is an idiom or construction.",
            "It's attentive that is all the inputs that it gets.",
            "All the experience that it has.",
            "Is potentially relevant to the final state, as contrasted with a more classical view of language acquisition, which is that in linguistics, which is that only certain pieces of information are useful to the learner.",
            "These are triggers, and the learner uses the triggers to decide what the grammar isn't.",
            "Everything else is basically irrelevant.",
            "Listen, I'll talk a little bit more about what that means.",
            "It's a language learner.",
            "OK, so that's coming."
        ],
        [
            "So we constructed Camille with the with the pursuing this these ideas with a with minimal prior knowledge of linguistic structure.",
            "When we visualize the way we conceived of language acquisition and Camille is a dynamical metaphor, it's useful, may even be correct.",
            "Correct way to think about it, but we think we think of of a sentence or even a string of sounds as a trajectory in a linguistic space of some type.",
            "And if you get multiple trajectories that follow basically the same direction, going from the same place to the same place, then you may begin to get flows.",
            "And if you get flows that are reasonably coherent, then you may in fact get self organization and generalization.",
            "That's the metaphor that we.",
            "Envisions and one that we've tried to implement, but not with any tremendous success.",
            "Our experiments are intended to determine how much grammatical knowledge such a learner is capable of acquiring, strictly from sound, meaning pairs.",
            "So we start out assuming that the learner knows virtually nothing about how language works, and see where it fails, and.",
            "I. I'll come back to that point, I mean so."
        ],
        [
            "The spatial metaphor is 1, where if you have things that are members of the same category or share some kind of feature, then they can be represented as occupying the same or relative relatively close to one another in space.",
            "If you take the right kind of sliced along a dimension, trajectories are simply go from one place, one position, one place in space to another, and thereby go can be represented by a linguist as as as involving transitions from one category to another.",
            "Sequencing from one category to another, but that's our description, not what the learner knows.",
            "And the structure that is imposed on the space basically guides the movement from one region to another.",
            "Here's."
        ],
        [
            "If you have a struct I don't know, I didn't put here if you have a transition from a noun through an adjective, you can see that as a trajectory from the end space to the adjective space.",
            "Region in space.",
            "If you can keep going through that over and over again, you get what appears to be recursion."
        ],
        [
            "And as I said before, the system should ideally self organize when it's possible to collapse individual rules or representations into.",
            "Larger flows this which should produce generalization, and it should produce over generalization.",
            "The trick is to get it right, and I'm sure that's one of the things that you're all concerned about in areas that have quite not nothing to do with language at all.",
            "Uh.",
            "So."
        ],
        [
            "In terms of.",
            "How much knowledge of language this simulation has?",
            "If we start out with nothing or very very little, then it's likely to fail.",
            "This is the idea.",
            "If it succeeds, that's interesting.",
            "It means that.",
            "Based just sort of general kind general approaches to learning general learning mechanisms can acquire language.",
            "If it fails, then it means you have to add something specific and you can use the simulation to pinpoint where the failure lies and what it is you have to add.",
            "So rather than taking.",
            "Of you about language that's not based on any particular experience, but just using logic to try to decide what it is that you think is necessary for language learning.",
            "What do you think is actually built into the language learner?",
            "We can actually.",
            "We can envision experimenting and trying to figure out what we really do need to assume a language learner has prior to approaching.",
            "Language learning and we can also try to explain how it is there.",
            "Some things emerged from the over the course of learning.",
            "So."
        ],
        [
            "While success would be nice, failure can be quite informative and nice too."
        ],
        [
            "So what we assume is that the learner has access to the sounds in the phone, a logical system of language.",
            "And that's necessary for us to get things off the ground.",
            "We assume that the learner has access to meanings and the conceptual structure system.",
            "The conceptual structure system is 1 in which we represent meaning.",
            "So the assumption is that the learner is exposed to.",
            "Experiences in the world, and those get represented internally in some in some system that there are meanings, basically that are constructed through the experience that the learner has.",
            "How that works is a very complicated question, and one that has that behind which there's a lot of psychology and a lot of philosophy.",
            "We just simply assume that it's there that is learner has an experience and that experience is gets translated into a mental representation of some type, which we will call the meaning, so that meaning is what the learner.",
            "It has.",
            "Access to when the learner.",
            "Here's some some expression from the language."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The kinds of things that we want to be able to explain and my concern is with finding explanations for the things that we know about language to the extent that we understand them, that we understand what goes on in language.",
                    "label": 0
                },
                {
                    "sent": "So one of the things that we have been trying to do is to find ways of simulating language acquisition with an eye towards understanding to what extent certain aspects of of language can be accounted for in terms of way.",
                    "label": 0
                },
                {
                    "sent": "Language is acquired by learner.",
                    "label": 0
                },
                {
                    "sent": "Let's say.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "When you think about this kind of issue, there are a number of questions that arise.",
                    "label": 0
                },
                {
                    "sent": "One is how do we?",
                    "label": 0
                },
                {
                    "sent": "How should we actually think about what knowledge of language consists of?",
                    "label": 1
                },
                {
                    "sent": "And if you know anything about linguistics, you know that there's a certain amount of controversy about this and the view that I've been taking is, and I prefer to take is one that is at odds with what everybody else thinks.",
                    "label": 1
                },
                {
                    "sent": "Almost perversely, so the second question type of question is, what is the architecture of the learner that would explain how is that we come to have this knowledge?",
                    "label": 0
                },
                {
                    "sent": "And in that regard there are basically two possibilities when one can break it down a little bit further, but one possibility is that the knowledge that we have about language some of it is actually built into the learner explicitly, and it's there because we find there, because that's because the learner actually has it and the other is that it arises out of the way that the learner.",
                    "label": 1
                },
                {
                    "sent": "Is the kind of data that they learn is exposed to in the way that the learner goes about building knowledge of language and there are other types of explanations, but these are basically the two tip the two.",
                    "label": 0
                },
                {
                    "sent": "Most diverse ones, and can we simulate language acquisition in order to explore the view that we have about how language gets its structure from?",
                    "label": 0
                },
                {
                    "sent": "From the architecture of the learner?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'm going to very quickly is run through a number of things that I've been involved in, one having to do with what it is that we know when we know language.",
                    "label": 0
                },
                {
                    "sent": "This is from my book with Ray Jackendoff called similar syntax where we pursue something that I've come to call the Construction list manifesto, which has a number of different formulations, but I'll explain what that is, and then there's certain kinds of facts that we know about language, and one of the things we have to be able to explain how it is that those.",
                    "label": 0
                },
                {
                    "sent": "Those facts are the way they are, how the knowledge of language as we describe it actually ends up in the head of a human being who's acquiring language, and then I'll talk about the the learner, the computational simulation that we've been trying to develop an.",
                    "label": 0
                },
                {
                    "sent": "Then I also have a few remarks about simulating language in a social network which has some relevance to the broader questions that I'm talking about.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On the standard view, in linguistic theory, a generative grammar of a language, that is what it is that you know when you know language or representation of what's in your head.",
                    "label": 1
                },
                {
                    "sent": "Is an idealized characterization of the linguistic knowledge or linguistic competence of an idealized native speaker, and this is a very classical approach in contemporary linguistic.",
                    "label": 1
                },
                {
                    "sent": "Theory and the theory of generative grammar, that is what a possible grammar is, is in term.",
                    "label": 1
                },
                {
                    "sent": "In turn, a characterization of possible generative grammars.",
                    "label": 0
                },
                {
                    "sent": "Possible things that could be in the heads of native speakers.",
                    "label": 0
                },
                {
                    "sent": "On this view at.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Active grammars theory about something that really exists.",
                    "label": 0
                },
                {
                    "sent": "The linguistic competence of the native speaker.",
                    "label": 1
                },
                {
                    "sent": "And the theory of grammar theory about the language faculty that explains why linguistic competence takes the form that it does.",
                    "label": 1
                },
                {
                    "sent": "Both the grammar as described by linguists and the theory of grammar, that is, that this kind of what a possible grammar can be are in some sense in the mind or in the head, and they form a part of the explanation of human linguistic abilities wide.",
                    "label": 0
                },
                {
                    "sent": "How it is that we end up knowing what we know.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The alternative view which a lot of people prefer to take very often outside of linguistics, is that what resides in the language faculty is something of quite a different of quite a different sort that reflects in its architecture the dynamical character of language.",
                    "label": 1
                },
                {
                    "sent": "In particular, if directly reflects, reflects the fact that grammar is required overtime that it is a psychological mechanism used for speaking and understanding, and that it undergoes.",
                    "label": 1
                },
                {
                    "sent": "Change overtime so the view is that is that what we don't have in our heads is some kind of symbolic fixed symbolic device representation which we could call grammar, but rather what we have is our devices that are that are built up overtime that evolve that perform certain kinds of processes and that undergo change.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the challenge, if we take this alternative view that you really don't have in your head a grammar of the classical sort.",
                    "label": 1
                },
                {
                    "sent": "Is that you really do have to account for the linguistic phenomena that have been observed by linguists, so you can throw out the what's known about language simply because you don't like the story that people have told about why it is the way it is.",
                    "label": 1
                },
                {
                    "sent": "You have to be able to explain what generative grammar explains, and of course you have to be able to explain more.",
                    "label": 1
                },
                {
                    "sent": "You have to be able to explain the acquisition, explain the processing, and explain the change.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But OK.",
                    "label": 0
                },
                {
                    "sent": "So the linguistic content of the alternative that you take if you choose to go down that Rd must be at least equivalent to the content of the generative grammar.",
                    "label": 1
                },
                {
                    "sent": "And that is to say, both must provide the same or equivalent empirically adequate structural descriptions of words, phrases, idioms, constructions and sentences.",
                    "label": 1
                },
                {
                    "sent": "And I would say that some of the reasonable criticism of some of the alternatives to mainstream grammatical theory is that they don't come close to accounting for the facts that have been observed.",
                    "label": 0
                },
                {
                    "sent": "And of course this account must explain their dynamical properties as well.",
                    "label": 0
                },
                {
                    "sent": "And then that's the end of that slide.",
                    "label": 0
                },
                {
                    "sent": "So off we go.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "The construction is manifesto is did a search on Google and I found it.",
                    "label": 0
                },
                {
                    "sent": "I was surprised.",
                    "label": 0
                },
                {
                    "sent": "Characterized rather nicely by.",
                    "label": 0
                },
                {
                    "sent": "Quartz and Sinofsky, in contrast to learning as selective induction, the central component of the constructivists model is that it does not involve search through, and our priority defined hypothesis space, where that would be the classical view in linguistic accounts of language acquisition you have, you have to find you have a set of possible grammars.",
                    "label": 1
                },
                {
                    "sent": "Ann, you're basically searching through the space of possible grammars to find the one that's most compatible with the.",
                    "label": 0
                },
                {
                    "sent": "With the evidence about the language that you're being exposed to rather.",
                    "label": 1
                },
                {
                    "sent": "It's it's not an instance of model based estimation or parametric regression.",
                    "label": 1
                },
                {
                    "sent": "Instead, the constructivists learner builds this hypothesis as a process of activity dependent construction of the representations that underlie mature skills.",
                    "label": 0
                },
                {
                    "sent": "So you're actually constructing.",
                    "label": 0
                },
                {
                    "sent": "The grammar as you go based on your experience.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what we've done is taking this view about constructing a grammar based on experience.",
                    "label": 0
                },
                {
                    "sent": "We've taken a view about grammar, which is due largely to Ray Jackendoff, although it's due to others as well, and I've done some work in this area in my book Syntactic Nuts and Jackendoff, and I have a book coming out called similar syntax which develops this.",
                    "label": 0
                },
                {
                    "sent": "These kinds of ideas further, this is a construction less one construction list view.",
                    "label": 0
                },
                {
                    "sent": "The view is the following.",
                    "label": 0
                },
                {
                    "sent": "There's a job of a grammar.",
                    "label": 0
                },
                {
                    "sent": "Is to describe the sound meaning correspondence is you have sounds, strings of sounds and they have meanings associated with them.",
                    "label": 0
                },
                {
                    "sent": "And the correspondences are more or less systematic.",
                    "label": 1
                },
                {
                    "sent": "Some of the correspondence is are analyzable so you have a word and it corresponds to has a certain meaning.",
                    "label": 0
                },
                {
                    "sent": "In many cases you cannot explain why it is that that word means what it means.",
                    "label": 0
                },
                {
                    "sent": "It has no internal structure.",
                    "label": 0
                },
                {
                    "sent": "Some correspondence is do have linguistic structure, but are simple or not entirely transparent on the meaning side.",
                    "label": 1
                },
                {
                    "sent": "So you may have an expression that has of many words.",
                    "label": 0
                },
                {
                    "sent": "It has a fixed meaning.",
                    "label": 0
                },
                {
                    "sent": "Such as an idiom, so there's no nice matching up of the structure of the.",
                    "label": 0
                },
                {
                    "sent": "Of the expression in the structure of the meaning you do have you have other cases where you have structure and you have transparent relationship between the structure and the meaning, and this would be the classical case.",
                    "label": 0
                },
                {
                    "sent": "The typical case where you have a phrase that's transparent with the meaning of the whole is a function.",
                    "label": 0
                },
                {
                    "sent": "A simple function of the meaning of the parts.",
                    "label": 0
                },
                {
                    "sent": "And then you have combinations, more complex situations, and that's the one that the kind of situation that I described in syntactic nuts where you have.",
                    "label": 0
                },
                {
                    "sent": "Various kinds of constructions which are quasi idioms and if you know anything about linguistics, you know what I'm talking about here.",
                    "label": 1
                },
                {
                    "sent": "Double object constructions, movement along a path, expressions, syntactic nuts.",
                    "label": 1
                },
                {
                    "sent": "In my book, various operator trace binding constructions and so on.",
                    "label": 0
                },
                {
                    "sent": "Each of these constructions which we find in natural languages has some degree of predictability.",
                    "label": 0
                },
                {
                    "sent": "Systematis city in generality, but I also have some, some idiosyncrasy's and the and the problem for the learner is to acquire them accurately, get the general parts right.",
                    "label": 0
                },
                {
                    "sent": "And get the idiosyncrasy is right, and the secrecies may.",
                    "label": 0
                },
                {
                    "sent": "In fact, we have some regularity.",
                    "label": 0
                },
                {
                    "sent": "There may be somewhat systematic, or they may be entirely exceptional, so you have to get it right and the fact about language that we have to recognize that the range of knowledge that we have, the knowledge that we have ranges in character from the very very specific and idiosyncratic to the very general and depends on the case on the construction on the phenomenon that we're talking about.",
                    "label": 0
                },
                {
                    "sent": "We can talk, and that was the that was the point that I tried to make.",
                    "label": 0
                },
                {
                    "sent": "In syntactic nuts.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The simpler syntax hypothesis that we layout in our book is that the most explanatory syntactic theory is the one that includes the minimum structure necessary to mediate between sound demeaning.",
                    "label": 1
                },
                {
                    "sent": "And here we're arguing with a long tradition of of syntactic theorizing.",
                    "label": 0
                },
                {
                    "sent": "Where a lot of there's a lot of elaborate abstract structure to mediate the meaning, which is not really identifiable in terms of the form.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'll give you a few examples about this range of correspondences, so you get a few.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For it, as I mentioned before, many words are unanalyzable correspondences between sounds, sound and meaning.",
                    "label": 1
                },
                {
                    "sent": "Well, some have argued otherwise.",
                    "label": 0
                },
                {
                    "sent": "It.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Games have a recognizable, typically have a recognizable syntactic structure, but unpredictable meaning.",
                    "label": 1
                },
                {
                    "sent": "So by and large is 2 things that are coordinated.",
                    "label": 0
                },
                {
                    "sent": "Lo and behold, similarly beat a dead horse.",
                    "label": 1
                },
                {
                    "sent": "That's a very normal phrase.",
                    "label": 0
                },
                {
                    "sent": "It actually has a literal meaning, but it also has a non literal meaning.",
                    "label": 0
                },
                {
                    "sent": "The non literal meaning is not predictable from the meaning of the parts make amends.",
                    "label": 0
                },
                {
                    "sent": "IS has a structure that's recognizable, it's English and the verb goes where it should go and the object goes where it should go.",
                    "label": 0
                },
                {
                    "sent": "But the meaning is not in any obvious sense of composition.",
                    "label": 0
                },
                {
                    "sent": "Compositional product of the syntactic structure.",
                    "label": 0
                },
                {
                    "sent": "We have some very special idiosyncrasies such as we have cast aspersions on.",
                    "label": 0
                },
                {
                    "sent": "Cast dispersions at I don't think is proper English cast dispersions too, so you have to know something about this specific about this particular expression of flash in the pan is another such thing put up with is another kind of.",
                    "label": 0
                },
                {
                    "sent": "Idiomatic construction, where you can't.",
                    "label": 0
                },
                {
                    "sent": "You can't predict what the meaning is going to be by knowing the meaning of the parts, and this is very, very common.",
                    "label": 0
                },
                {
                    "sent": "It's quite endemic to natural language.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are constructions in English which are verb phrases where the the verb phrase itself has parts that are that have normal meetings.",
                    "label": 0
                },
                {
                    "sent": "But then the whole the whole construction itself imposes a little bit extra meaning on the construction so.",
                    "label": 0
                },
                {
                    "sent": "The way construction Elmer hobbled or Joe laughed or joked his way to the bank means made his way to the bank.",
                    "label": 1
                },
                {
                    "sent": "Humbling, laughing, joking, and so on.",
                    "label": 1
                },
                {
                    "sent": "Hermione slept, drank soda, programmed three whole evenings away.",
                    "label": 0
                },
                {
                    "sent": "Isn't this another special construction which has a certain form and a certain meaning in virtue of the particular parts, sound, sound, motion, construction like the car whizzed past Harry, which means the car went past Harry making a whizzing sound.",
                    "label": 0
                },
                {
                    "sent": "Resultative construction, the chef Cook the pot black, meaning the chef cook the pot until it was black or made it black by by cooking.",
                    "label": 1
                },
                {
                    "sent": "In these are all cases, and there are many, many more, and it can be multiplied at quite quite indefinitely by linguists, where there's there's a range of specificity, some of the meaning of the construction is predictable from the meaning of the parts, but you have to know something about the construction, and you have to know that there's something else there that is not there.",
                    "label": 0
                },
                {
                    "sent": "In the construction, it's not explicitly there, you just have to know what it means.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "These kids show they all share the same basic syntax, so there's something there's something general about them.",
                    "label": 1
                },
                {
                    "sent": "Since they're all English.",
                    "label": 0
                },
                {
                    "sent": "But what's an idiosyncratic is the way in which their meanings are related to the to the parts.",
                    "label": 1
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the view that I'd like to suggest is that when you have.",
                    "label": 0
                },
                {
                    "sent": "So the way that language is constructed, that language is not there, but it's constructed on the basis of experience that the way in which language is constructed gives rise to constructions.",
                    "label": 0
                },
                {
                    "sent": "In the general case.",
                    "label": 0
                },
                {
                    "sent": "Meaning that you lack the knowledge of language is constructed by a learner that is, learning actually takes place and it's not some kind of parameter setting or simply picking out one of the many possibilities from the from a pre constructed space.",
                    "label": 1
                },
                {
                    "sent": "What emerges from this process are constructions in the sense that I've been discussing just now that may ultimately become rules if they become general enough, but they only become general enough if there's enough evidence to support the generalization.",
                    "label": 1
                },
                {
                    "sent": "Otherwise, they remain constructions in the sense that they are not fully general and they have idiosyncrasy's.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So you say, well, the obvious question is if you are a learner, how do you know whether you're dealing with something that's general or something that's?",
                    "label": 0
                },
                {
                    "sent": "Idiosyncratic, and the answer is you don't you start off by assuming everything is reduced syncratic and you only generalize if you have evidence to support the generalization.",
                    "label": 0
                },
                {
                    "sent": "That means that as you construct the language, everything is going to start out being a construction or an idiom of something rather specific, and you're going to start generalizing and building sort of larger structure in this representation of the language as the evidence comes in.",
                    "label": 1
                },
                {
                    "sent": "This is a view that is has also been proposed by Michael Tomasello, a psychologist who works on language acquisition.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the computational model that we've simulation that we've come up with is not a model.",
                    "label": 0
                },
                {
                    "sent": "Simulation is way of exploring some of these ideas, and as a simulation it turns out to be messy and much more difficult to do then I had originally intended, but it is interesting, is called Camille Camille because it's conservative or concrete.",
                    "label": 0
                },
                {
                    "sent": "It's conservative and conservative in the sense that on the basis of of.",
                    "label": 0
                },
                {
                    "sent": "It does not generalize much beyond the evidence.",
                    "label": 1
                },
                {
                    "sent": "That is that it's given.",
                    "label": 0
                },
                {
                    "sent": "So if it's not given a lot of evidence, it will end up assuming that something is an idiom or construction.",
                    "label": 0
                },
                {
                    "sent": "It's attentive that is all the inputs that it gets.",
                    "label": 0
                },
                {
                    "sent": "All the experience that it has.",
                    "label": 0
                },
                {
                    "sent": "Is potentially relevant to the final state, as contrasted with a more classical view of language acquisition, which is that in linguistics, which is that only certain pieces of information are useful to the learner.",
                    "label": 0
                },
                {
                    "sent": "These are triggers, and the learner uses the triggers to decide what the grammar isn't.",
                    "label": 0
                },
                {
                    "sent": "Everything else is basically irrelevant.",
                    "label": 0
                },
                {
                    "sent": "Listen, I'll talk a little bit more about what that means.",
                    "label": 0
                },
                {
                    "sent": "It's a language learner.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's coming.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we constructed Camille with the with the pursuing this these ideas with a with minimal prior knowledge of linguistic structure.",
                    "label": 1
                },
                {
                    "sent": "When we visualize the way we conceived of language acquisition and Camille is a dynamical metaphor, it's useful, may even be correct.",
                    "label": 0
                },
                {
                    "sent": "Correct way to think about it, but we think we think of of a sentence or even a string of sounds as a trajectory in a linguistic space of some type.",
                    "label": 0
                },
                {
                    "sent": "And if you get multiple trajectories that follow basically the same direction, going from the same place to the same place, then you may begin to get flows.",
                    "label": 0
                },
                {
                    "sent": "And if you get flows that are reasonably coherent, then you may in fact get self organization and generalization.",
                    "label": 0
                },
                {
                    "sent": "That's the metaphor that we.",
                    "label": 0
                },
                {
                    "sent": "Envisions and one that we've tried to implement, but not with any tremendous success.",
                    "label": 0
                },
                {
                    "sent": "Our experiments are intended to determine how much grammatical knowledge such a learner is capable of acquiring, strictly from sound, meaning pairs.",
                    "label": 1
                },
                {
                    "sent": "So we start out assuming that the learner knows virtually nothing about how language works, and see where it fails, and.",
                    "label": 0
                },
                {
                    "sent": "I. I'll come back to that point, I mean so.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The spatial metaphor is 1, where if you have things that are members of the same category or share some kind of feature, then they can be represented as occupying the same or relative relatively close to one another in space.",
                    "label": 1
                },
                {
                    "sent": "If you take the right kind of sliced along a dimension, trajectories are simply go from one place, one position, one place in space to another, and thereby go can be represented by a linguist as as as involving transitions from one category to another.",
                    "label": 0
                },
                {
                    "sent": "Sequencing from one category to another, but that's our description, not what the learner knows.",
                    "label": 0
                },
                {
                    "sent": "And the structure that is imposed on the space basically guides the movement from one region to another.",
                    "label": 1
                },
                {
                    "sent": "Here's.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you have a struct I don't know, I didn't put here if you have a transition from a noun through an adjective, you can see that as a trajectory from the end space to the adjective space.",
                    "label": 0
                },
                {
                    "sent": "Region in space.",
                    "label": 0
                },
                {
                    "sent": "If you can keep going through that over and over again, you get what appears to be recursion.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And as I said before, the system should ideally self organize when it's possible to collapse individual rules or representations into.",
                    "label": 0
                },
                {
                    "sent": "Larger flows this which should produce generalization, and it should produce over generalization.",
                    "label": 0
                },
                {
                    "sent": "The trick is to get it right, and I'm sure that's one of the things that you're all concerned about in areas that have quite not nothing to do with language at all.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In terms of.",
                    "label": 0
                },
                {
                    "sent": "How much knowledge of language this simulation has?",
                    "label": 1
                },
                {
                    "sent": "If we start out with nothing or very very little, then it's likely to fail.",
                    "label": 0
                },
                {
                    "sent": "This is the idea.",
                    "label": 0
                },
                {
                    "sent": "If it succeeds, that's interesting.",
                    "label": 0
                },
                {
                    "sent": "It means that.",
                    "label": 0
                },
                {
                    "sent": "Based just sort of general kind general approaches to learning general learning mechanisms can acquire language.",
                    "label": 0
                },
                {
                    "sent": "If it fails, then it means you have to add something specific and you can use the simulation to pinpoint where the failure lies and what it is you have to add.",
                    "label": 0
                },
                {
                    "sent": "So rather than taking.",
                    "label": 0
                },
                {
                    "sent": "Of you about language that's not based on any particular experience, but just using logic to try to decide what it is that you think is necessary for language learning.",
                    "label": 0
                },
                {
                    "sent": "What do you think is actually built into the language learner?",
                    "label": 0
                },
                {
                    "sent": "We can actually.",
                    "label": 0
                },
                {
                    "sent": "We can envision experimenting and trying to figure out what we really do need to assume a language learner has prior to approaching.",
                    "label": 0
                },
                {
                    "sent": "Language learning and we can also try to explain how it is there.",
                    "label": 0
                },
                {
                    "sent": "Some things emerged from the over the course of learning.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "While success would be nice, failure can be quite informative and nice too.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what we assume is that the learner has access to the sounds in the phone, a logical system of language.",
                    "label": 0
                },
                {
                    "sent": "And that's necessary for us to get things off the ground.",
                    "label": 0
                },
                {
                    "sent": "We assume that the learner has access to meanings and the conceptual structure system.",
                    "label": 1
                },
                {
                    "sent": "The conceptual structure system is 1 in which we represent meaning.",
                    "label": 0
                },
                {
                    "sent": "So the assumption is that the learner is exposed to.",
                    "label": 0
                },
                {
                    "sent": "Experiences in the world, and those get represented internally in some in some system that there are meanings, basically that are constructed through the experience that the learner has.",
                    "label": 0
                },
                {
                    "sent": "How that works is a very complicated question, and one that has that behind which there's a lot of psychology and a lot of philosophy.",
                    "label": 0
                },
                {
                    "sent": "We just simply assume that it's there that is learner has an experience and that experience is gets translated into a mental representation of some type, which we will call the meaning, so that meaning is what the learner.",
                    "label": 0
                },
                {
                    "sent": "It has.",
                    "label": 0
                },
                {
                    "sent": "Access to when the learner.",
                    "label": 0
                },
                {
                    "sent": "Here's some some expression from the language.",
                    "label": 0
                }
            ]
        }
    }
}