{
    "id": "f4bey4xmpn5gs6qmjlvke7xkoznbo6xa",
    "title": "Network inference using steady-state data and Goldbeter-Koshland kinetics",
    "info": {
        "author": [
            "Chris J Oates, Centre for Complexity Science, University of Warwick"
        ],
        "published": "Oct. 23, 2012",
        "recorded": "September 2012",
        "category": [
            "Top->Computer Science->Computational Biology",
            "Top->Computer Science->Bioinformatics",
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/mlsb2012_oates_inference/",
    "segmentation": [
        [
            "Good afternoon Phil.",
            "It's a pleasure to be talking to you today.",
            "The work I'm going to present is joint work with both my supervisor, such Mukherjee at the Netherlands Cancer Institute and also while collaborators Brian Hennessy, Yelling Lou and Gordon Mills, variously from Island, an from America.",
            "So I'm going to talk about.",
            "Interpretations of causality issues in the context of network inference.",
            "Causality is not something that's been discussed so far at this conference, yet.",
            "Many of the talks have employed feature selection approaches for ultimately causal goals, and I'll elaborate on that shortly.",
            "Another, another issue that needs to be considered is.",
            "How reliable are feature selection estimators in the setting given that causation implies correlation, but of course not the convex.",
            "So let me let me get started.",
            "I'm going to not embarrass myself by disguise and describing network inference.",
            "He."
        ],
        [
            "You are the weather, but that is I'm going to talk about protein network inference, so in particular phosphoprotein network inference.",
            "Just to recap here, a protein can be phosphorylated, it can accept fasfa at any given time.",
            "A certain fraction of all the protein in a cell will be phosphorylated.",
            "Proteins can phosphorylate each other, and in that way you can construct a network of these phosphorylation interactions."
        ],
        [
            "I'm going to describe some problems that are rooted in causality.",
            "Also, problems are rooted in the study."
        ],
        [
            "The nature of some of the data that we work with and how these can be resolved.",
            "So this is going to be constructive talk.",
            "It's not going to be counterexamples talk.",
            "And I'm going to propose a fairly ad hoc."
        ],
        [
            "Weighted perform protein network inference, but away that is rooted in causality and has a stronger causal interpretation that we might normally get with feature selection approaches."
        ],
        [
            "And of course there's some results."
        ],
        [
            "So."
        ],
        [
            "No, just two."
        ],
        [
            "Just to set."
        ],
        [
            "Now this is a very."
        ],
        [
            "Framework the only thing to notice is that I'm going to frame network inference as a variable selection problem.",
            "The reason for this is that protein networks are of course not closed.",
            "Systems are heavily regulated by external signals, so there's not a lot of point trying to model this as a closed system.",
            "That's of course not the case for gene regulatory networks that we know about.",
            "So the this is the typical setup and we've seen many examples of L1L2 combinations of L1 with two variable selection methods."
        ],
        [
            "This model you want to choose the Cobra."
        ],
        [
            "Is the X is the explain the response, why?"
        ],
        [
            "Had the covariates that explain the response Y in."
        ],
        [
            "Minimize some loss are those features which you selected and hence the name feature selection methods.",
            "So that's that's what I'm going to call this piece at here.",
            "So PR features which are really good for prediction.",
            "On the other hand, covariates which actually caused the response might not be so good for prediction, and I'm sure you're aware this now show you a concrete example.",
            "Of course, when we infer signaling networks were interested in in causal links were not interested so much in correlation, because actually if you look at protein signaling network as soon as you stimulate the network effect level, everything switches on and everything is correlated.",
            "So that's not what we're interested in.",
            "So the very clear."
        ],
        [
            "Example of this is where you've got three variables.",
            "The first variable just takes some random value.",
            "Here, the second variable is equal to the first variable, but there's a fair bit of noise attached to it.",
            "The third random variable is equal to the second random variable, and there's a tiny bit of noise attached.",
            "So obviously predictive optimal would say pick this variable to predict this variable because it's most correlated with X.",
            "Two X3 is most correlated with X2.",
            "Nevertheless, X1 causes X2 and this is not only to show that, of course.",
            "Correlation doesn't imply causation, but actually the causation can be quite weak compared with correlation.",
            "Correlation can be an overriding force and in protein signaling networks I just mentioned.",
            "Actually it is so we need to deal with this."
        ],
        [
            "So of course, when."
        ],
        [
            "When we enter these networks, phone calls and networks because we're going to validate with interventions."
        ],
        [
            "Feature selection methods are more commonly used, so we've seen all of these, and of course linear models as you know, are linear.",
            "Nature isn't as we've heard."
        ],
        [
            "Anne.",
            "Moreover"
        ],
        [
            "Amazon Scooter discriminating between correlated covariance.",
            "The linear model is very forgiving and that's why we use it.",
            "So if you want to discriminate between two very correlated covariance, the linear model is not going to.",
            "And."
        ],
        [
            "Finally, symmetry of a linear model is not particularly useful if you see that X is a good predictor of Y, then what will be a good predictor of X?",
            "And that's not really telling us very much in terms of the directionality of this causal relationship.",
            "So just go back."
        ],
        [
            "This example just for those of you that aren't familiar with this sort of problem.",
            "If I try and infer the causal structure here using observational data, be this by inferring an inverse covariance matrix using a Gaussian graphical model, or by performing conditional independence tests of the various variables.",
            "I will only get the undirected graph.",
            "There's no way that I can tell the X1 causes X2 and X 2 = X Three.",
            "That's just absolutely true, and you can read about that if you want to.",
            "But it's true you can't get, you can't identify the network topology from observational data.",
            "In general.",
            "So that's the problem, and it's a problem with the linear model.",
            "An OK, so this is a motivating example.",
            "So what I've done here is I've plotted weight and height."
        ],
        [
            "But I haven't told you weeks which accesses wait and which accesses height.",
            "But of course you will know which accesses way in which accesses height.",
            "So this axis here is height and this axis here is wait.",
            "So how do I know that?",
            "Well, I know that because weight should scale as something like the key with your Heights.",
            "That's kind of very simple geometry and this looks a bit like a cube.",
            "So this is this is a height and weight.",
            "What did I do?",
            "Well, I didn't use a linear model.",
            "I used to keep it.",
            "And how was I able to identify the labels of the axes?",
            "Well, because if the data was scattered in this direction sleeping this way.",
            "That would make physical sense.",
            "So I used.",
            "I used additional knowledge about nonlinearity within the physical system to discriminate the causal directionality of weight on height."
        ],
        [
            "OK, so that was just an example.",
            "What we need to do in protein signaling is find nonlinearity that's relevant to us, something that we can use to exploit to infer the directions of our links in the network.",
            "There was a recent theoretical result, so this was from uncertainty in artificial intelligence, which is a big machine learning conference last year, which is that if you ascribe a nonlinear functional model to some data, then you can always identify the entire network, provided that.",
            "Fixing all the covariates except two in varying them.",
            "The scatter plot that you get is not linear in the way that I described in the sense that the alternative scatter plot if you flipped it over wouldn't make physical sense.",
            "Anne, this is nice because in case you weren't aware, you normally can't identify networks completely.",
            "Normally you end up with what's known as an equivalence class of networks which are."
        ],
        [
            "Identical in a problem."
        ],
        [
            "Stick sense, but under this assumption, which is known as an identifiable functional model assumption, you actually can identify the entire network and it's rooted in this bivariate identifiability, which I just showed you in the height weight example.",
            "So does that exist for protein cycling?",
            "Well, actually it does.",
            "This is this is a little."
        ],
        [
            "Little diagram of enzyme kinetics which you're aware of, so substrate binds and substrate binds an enzyme.",
            "The product binds as well and then the enzyme is conserved.",
            "Yet this.",
            "So I T substrates of finding its ion the product particles.",
            "This is not."
        ],
        [
            "As you all know, the reason being if the limiting quantity is the amount of substrate, then most of the enzyme is unbound and if you plot the amount of substrate against the reaction rate, you'll have a nice linear line here.",
            "However, for protein signaling the proteins are enzymes, but they're also the substrate and you don't have a nice approximation where one of these things is a lot smaller than the other.",
            "So actually you're going to be looking at this this whole range of dynamics where actually the enzyme can be totally saturated with substrate.",
            "So, so any sort of linearity model here is going to.",
            "It's not going to play because proteins are the kidneys is, but they're also the substrates here this is.",
            "This is not an appropriate situation to use a linear model.",
            "So actually the equation looks like this is the Michaelis."
        ],
        [
            "Equation is a classical enzyme kinetic relationship which you will.",
            "Most likely scene.",
            "We got the substrate here, which is the unphosphorylated protein or enzyme is often phosphorylated protein.",
            "We call them kinases.",
            "And there are two unknowns.",
            "There's a maximum reaction rate and Michaelis Menten constant.",
            "OK, that's not linearity.",
            "We can use that to break the symmetry of the linear model to infer complete protein signaling networks that are completely identifiable."
        ],
        [
            "OK, the other the other issue I want to raise is a steady state data.",
            "Stuff happens quickly, and if you look at studies that you don't see it, we know that.",
            "So does that prevent us from identifying causal protein interaction well?",
            "Maybe?"
        ],
        [
            "Let me just take a moment to define what I mean by causes in the dynamic sense.",
            "So this is very intuitive.",
            "But if if Akin's appears on the right hand side of an ordinary differential equa."
        ],
        [
            "In formulation of your protein system that Kynes is said to cause phosphorylation of its substrate.",
            "OK, that's that's what you would expect, but I just want to make sure that we're on the same lines here.",
            "So here's an example of differential equations where X2 drives X1 and X1 drive XD.",
            "But if I solve this differential equations for this item state, I find no information whatsoever about causality because the stationary state is just some trivial solution.",
            "So if we observe this system at equilibrium, I'm not going to be able to identify any of this regulatory relationship here, which is in the sort of dynamic causal network.",
            "I'm just going to network and that's not ideal.",
            "So if I've got equilibrium observations of protein expression.",
            "I'm not going to be able to do anything with them.",
            "Turns out."
        ],
        [
            "In some situations you can let me try and characterize this issue."
        ],
        [
            "So this is work almost 10 years old now.",
            "Also from the machine learning community.",
            "And it's today."
        ],
        [
            "With faithfulness of the equilibrium distribution.",
            "So let me try and explain this little picture here, so the dynamic causal network is what we intuitively think of as the protein signaling network.",
            "It's what's on the right hand side of the differential equation.",
            "If we let the dynamics equilibriate, we get an equilibrium network.",
            "It was the empty network on the previous slide.",
            "It probably contains a bit less than the dynamic network, because some stuff transient and you can't see it at equilibrium.",
            "So what we doing when we do inference using steady state data?",
            "Well, we've got equilibrium observations and we want to make claims that if we manipulate so if we target a node in the network then we want to be able to predict what happens as a result of that intervention using our network info to equilibrium, OK?",
            "That's going from here to here.",
            "However, that's not really what happens when I give a drug to a asseline.",
            "That cell line isn't going to be equilibrium anymore.",
            "It's going to be reacting to that drug, and it's not going to process the intervention effect using the equilibrium network is going to use the dynamic network.",
            "So this is a problem, so I'm starting with the wrong network.",
            "I need to use this network in order to infer what's going to happen when I give it the drug.",
            "So the question is, under what situation is this pathway?",
            "The experimental pathway equivalent to the network inference pathway using steady state data?",
            "The condition is formally called the equilibrium commutability criterion I believe, and under some situations that satisfied is that satisfied for protein signaling.",
            "That's the question."
        ],
        [
            "Anne."
        ],
        [
            "So here's an example.",
            "Here's another system.",
            "We solve it.",
            "We find the X one is driving X2 in the solution.",
            "That's right, so we've got that.",
            "So we've solved.",
            "We solve for the equilibrium graph and got the dynamic graph.",
            "So sometimes it works.",
            "So can we.",
            "Can we make this more general?",
            "Well, yes, if this is your ordinary differential equation description of your protein signaling system.",
            "Then if I solve it, I put zeros here, here, here, here and here.",
            "I rearranged to solve."
        ],
        [
            "What the substrate which is X1 here and anything that was on the right hand side here is still on the right hand side.",
            "I've just put this on there and this is still here, so under systems that have some sort of, in this case a linear Decatur.",
            "Then the entire protein signaling network, the dynamic protein signaling network, is identifiable from steady state data.",
            "Well.",
            "Phosphorylated proteins become UN phosphorylated.",
            "They do so in a way that's not as well understood as phosphorylation, because phosphatases are specific, but we don't know an awful lot about that.",
            "So why not use this?",
            "Why not use this as a base model?",
            "Which will allow us to infer the entire protein signaling network.",
            "The dynamic protein system network from steady state data."
        ],
        [
            "So that's what we did.",
            "So this is what I'm talking about when I talk about a protein phosphorylation network is unpacked slightly from what you may have seen before.",
            "So here's a phosphoprotein.",
            "This is protein three with phosphor on it.",
            "This is the unphosphorylated form.",
            "And I've been leased with language here because of course a protein can have multiple foster sides.",
            "This just stick to one for the purposes of this talk.",
            "So proteins can be dephosphorylated.",
            "Phosphorylated phosphorylation can be catalyzed so so here X3 is connais for phosphorylation of X4.",
            "Also Kinesis can be inhibited maybe by competitive binding of other things to the enzymatic site.",
            "So here X3 is inhibiting the kinneys activity of X1 on phosphorylation of X2.",
            "These are my description of protein signaling networks.",
            "And so given at work we can write down a differential equation which describes the dynamics on that network."
        ],
        [
            "And it has all of these properties I've mentioned up to now.",
            "We've got the nonlinearities.",
            "These nonlinearities are nonsensical when inverted, so this gives us the direction of any edges we infer, and we infer all the edges because there's this linear decay term, so that when we solve it, anything that was a cause in the dynamic regime is still causing the equilibrium regime.",
            "So we're on completely solid causal footing there.",
            "We"
        ],
        [
            "To do inference so this naturally means putting a probability model there."
        ],
        [
            "I've put an ad hoc probability model on it.",
            "I'm looking at the difference between the predicted solution and the measured solution.",
            "Well, I'm plugging in observations into into the original equation and then putting a normal error on on the equation.",
            "It's ad hoc.",
            "That's because the point I'm trying to make here is that by formulating models in this way, which allows for causal identifiability, you can gain in performance.",
            "This is not an observation.",
            "ULL model coupled with.",
            "Dynamic model."
        ],
        [
            "So let's see how it does so.",
            "So of course you can do inference and Monte Carlo isn't of general interest here, so I'll just briefly describe the process.",
            "So what you need to learn, you need to learn the parents.",
            "The parents are either kinesis or inhibitors of said Kinesis.",
            "So there's two different types of parents.",
            "Once you know the parents, you can talk about the chemical parameters that define those reactions.",
            "So we got the case.",
            "The Michaelis menten constants and the vis the maximum reaction rate.",
            "So there's a lot that needs to be learned from the data here.",
            "Well, how do we do that?",
            "Well, we construct an reversible jump sampler, so for those that don't know, reversible jump sampler, Ann.",
            "Moves across the joint space of both structural models and parameters.",
            "That is, we update the network and the parameters at each iteration.",
            "These are notoriously difficult to get to converge, and the results that I'm showing you are based on quite a small sample, so actually it's not not such a tough problem, But if I was going to roll this out on an industrial scale, I would need to put some more thought into this.",
            "Naive reversible jump was constructed using.",
            "The simplest possible moves we didn't want to pretend that we had an intuition for the cross model parameter space.",
            "We don't, so we're using simple moves here and they get accepted at reasonable rates, which means that our posterior probability of having an edge or not in our protein cycling network converges reasonably rapidly on a laptop.",
            "So I should mention that."
        ],
        [
            "The posterior probability of an edge here."
        ],
        [
            "And is without this additional."
        ],
        [
            "Thing of being a teenager organize inhibitor.",
            "It's sign free so I've collapsed that for the purposes of this this presentation.",
            "Right, the system is also simulated results.",
            "We took a computational model of the EGFR signaling pathway."
        ],
        [
            "Which came out in science signaling two years ago?",
            "This is their picture.",
            "I've unpacked it into the picture I showed you earlier.",
            "So for each protein there are two nodes, the phosphorylated and the unphosphorylated mode.",
            "We can simulate lots of things.",
            "We can give it EGF, we can do various types of inhibition experiment.",
            "So we've got a nice simulation platform to test whether basing causality on chemical kinetic descriptions and studies their data is a viable technique to use."
        ],
        [
            "And it turns out it is.",
            "So what am I comparing it against?",
            "I'm comparing it against a linear model with feature selection techniques, so feature selection in this case is Bayesian variable selection by model averaging.",
            "This is a reasonably standard technique and also the last year of course, which is well known.",
            "I'm also comparing two variants whereby the response is not the amount of phosphorylated protein, it's rather the fraction of phosphorylated protein, because, as you can appreciate.",
            "Variation in the total protein levels is going to be a factor here, and we want to try to account for that in a linear model, especially Cam.",
            "You can see the basing inference on on Kenny's equation.",
            "So This is why white emptiness driven inference does seem to rather outperform at any linear formulation.",
            "Now you can do this in two ways.",
            "You can view this as justification of all my talk about how causality is important.",
            "Or you can view it as the fact that I've accounted for variation in total protein levels when doing inference.",
            "They're both valid in front of interpretations.",
            "I prefer the cause interpretation, but nevertheless you can view this as a fancy normalization technique if you want.",
            "So we."
        ],
        [
            "Peter, this, across various noise and sample size regimes, and this is the chemical kinetic method here it seems to outperform various linear methods.",
            "Anne.",
            "An interesting question that we haven't quite addressed is.",
            "Is our method any good prediction tool if you're in furthering the correct causal structure, you would like to think bigger prediction, but actually linear methods are variable selection techniques for linear methods are generally predictive optimal, so these are guaranteed to be as good as possible at prediction given the linear model.",
            "So it'll be interesting to see if we can actually prediction here.",
            "But this is just inferring the structure of underlying protein signaling network.",
            "So real data across we workout accounts hospital so we had plenty of cancer data so modulator rewiring that might happen.",
            "Here's some results.",
            "So we took 22 Council lines and we took protein measurements for this.",
            "About 40 different phosphoproteins their corresponding unphosphorylated concentration.",
            "So his cell lines on the proteins and then the question is, given a particular breathing.",
            "So this is the sort question we get in hospital.",
            "The clinician will come to us and say.",
            "What could be phosphorylated matinees in my triple negative breast cancer?",
            "So that's a question that's a structural causal question.",
            "It's also a local question.",
            "It's not a network question.",
            "We don't care what the degree distribution of patients network is.",
            "We just want to know what's fascinating.",
            "That conveys in this cancer cell line.",
            "So if you ask these sort of questions, how does it look?",
            "So the question we asked here is what's phosphorylating the S6 protein in all of the basal cancer cell lines for we stricted to pay for here and we.",
            "We ranked all of the other phosphorylated proteins as potential kinesis for S6 in this setting.",
            "The chemical connecting connecting method says the P-76 counties.",
            "Actually, my guess is actually kind of is the preferred preferred kinds of that.",
            "Six other methods don't do so well, so linear methods don't have an awful lot of evidence for the true counties and the last few methods which are quite conservative, don't ascribe any weight at all to the true kinase, so."
        ],
        [
            "So what's going on?",
            "Either our method is making the."
        ],
        [
            "That causes prediction it well.",
            "It is making the correct causal prediction.",
            "All we are accounting for noise due to variation in the total protein levels between the different cancer cell lines that we're looking at.",
            "The completely jewel interpretations here.",
            "This is finding generalized to other proteins.",
            "Of course, that's the natural question.",
            "So the other question can ask is.",
            "OK, so these methods don't seem to work well are they?",
            "Are they at least similar?",
            "So these are all linear models, right?",
            "You would expect a linear model to make similar predictions, but actually they don't.",
            "So here we got all the different methods and what I'm plotting are the either the posterior probabilities of each."
        ],
        [
            "An putative parents or the weight according to the last few model, and actually see if you take 2 linear models here.",
            "So this is a good example.",
            "Here we got a linear model and linear model here in linear model here and actually the various wait subscribe to different proteins are not particularly in agreement.",
            "So what does this say?",
            "This says that how you set up variable selection in the linear model seems to be pretty crucial into what your results are.",
            "It also probably says that confounding due to variation in total protein levels of factor, even when you model the fraction of protein is facilitated.",
            "The response.",
            "You still don't don't do well, so so you've got a joint model.",
            "Both the total and the amount of phosphorylated protein under these chemical connect kinetic equations.",
            "In order to really account for confounding and or improve your causal inference ability.",
            "In this setting, a few more examples so."
        ],
        [
            "To the best of course, but there are other examples which do pretty well.",
            "P3P53 didn't do so well, but these accounts cell lines, so who knows what was going on there and we're pretty happy with how it went.",
            "And of course this was a proof of principle concept.",
            "This was.",
            "This was demonstrating that using nonlinear equations coupled with this causal premise is a reasonable approach to inference.",
            "We haven't tuned this method for a high throughput rollout or anything like this.",
            "So to summarize."
        ],
        [
            "We've seen how we can."
        ],
        [
            "These chemistry to get the directions of these edges normally can't."
        ],
        [
            "We see that.",
            "We discuss why for steady State data we can actually identify the dynamic signaling network.",
            "That's true for protein signaling.",
            "The same argument may all these arguments may apply for gene regulation.",
            "Of course, it's a bit murkier, but nevertheless there are these Michaelis Menten formulations which one could in principle used in this setting.",
            "We've also seen that the method, which was pretty ad hoc, to be honest, does actually outperform linear methods, so with where they work in."
        ],
        [
            "Making it so we should be able to improve on this.",
            "And of course, in the future we."
        ],
        [
            "Need to do a systematic validation of."
        ],
        [
            "Things I showed you a very very brief summary with just a few proteins, but we need to really do this properly."
        ],
        [
            "And of course, if you wanted, you could introduce lots of chemical processes.",
            "You can have competitive non competitive interaction of enzymes and there's also what you could do.",
            "We restrict such as skin ages and inhibitors.",
            "But you could go crazy if you wanted to.",
            "And so I'd like to thank you and suggest that if you're interested in the causal aspects of this paper, you will find it in the end the conference proceedings."
        ],
        [
            "And it and this rewrite of the paper.",
            "So thank you for attention.",
            "Thanks for your very nice took, it's very deep.",
            "I'd like to ask you when you talked about identifiability and the fact that I know you have a faithful model for the equilibrium.",
            "When you use kinetics equation where you have a product instead of some because you use a summation is cumulative.",
            "Affect do you still get some results with products?",
            "So so you would end up with the product if, um, if you had competitive.",
            "Yeah, so exactly.",
            "So maybe not in your in your case, but for instance generating networks, yes?",
            "Full for the NT and Seat I presented.",
            "There's absolutely no reason why you couldn't compute these quantities in terms of identifiability.",
            "I strongly suspect so, although I haven't actually written down on paper to check that the inverse isn't possible as well.",
            "One question would be N CNT might quite struggle quite badly because as a product these parameter values are going to be pretty coupled.",
            "All of my parameter updates for orthogonal, so I would be a little bit weary, but as you say, in principle this this is a very sound idea, thank you.",
            "More questions.",
            "Maybe have one refund so I'm trying to understand the assumption and why that assumption works for you but may not work for gene regulation.",
            "So I mean you can go back to that to that slide into the.",
            "Right?",
            "So I guess it wasn't this technical.",
            "No.",
            "Here it that's that's your assumption.",
            "OK, so and why is that not?"
        ],
        [
            "Satisfied in other cases, so I'm just thinking what are the technical conditions which need to have it applicable in a more broad sense.",
            "OK, the.",
            "The technical condition.",
            "If we're being rigorous."
        ],
        [
            "Actually previous slide it's the quality of this diagram."
        ],
        [
            "In practice."
        ],
        [
            "What this means is that.",
            "The equilibrium relations that you get by solving these equations.",
            "Should show the same dependent structure the same.",
            "Ethical model corresponding to the structural equations as the time varying model.",
            "So the steady state model agree with.",
            "I'm very model in terms of the network underlying the structural equation formulation.",
            "OK, OK.",
            "So you say, for example if and if there I can show you why this fails actually so so this example failed because.",
            "When you solve these equations, everything just disappears.",
            "So since I can no longer see the X twos depending on X1, there's no way I couldn't."
        ],
        [
            "That from the equilibrium data, yeah, I see.",
            "OK more questions, no?",
            "So then, let's have a break for about 25 minutes.",
            "We're going to resume at 3:30.",
            "Let's thank the speaker again, thanks."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good afternoon Phil.",
                    "label": 0
                },
                {
                    "sent": "It's a pleasure to be talking to you today.",
                    "label": 0
                },
                {
                    "sent": "The work I'm going to present is joint work with both my supervisor, such Mukherjee at the Netherlands Cancer Institute and also while collaborators Brian Hennessy, Yelling Lou and Gordon Mills, variously from Island, an from America.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to talk about.",
                    "label": 0
                },
                {
                    "sent": "Interpretations of causality issues in the context of network inference.",
                    "label": 0
                },
                {
                    "sent": "Causality is not something that's been discussed so far at this conference, yet.",
                    "label": 0
                },
                {
                    "sent": "Many of the talks have employed feature selection approaches for ultimately causal goals, and I'll elaborate on that shortly.",
                    "label": 0
                },
                {
                    "sent": "Another, another issue that needs to be considered is.",
                    "label": 0
                },
                {
                    "sent": "How reliable are feature selection estimators in the setting given that causation implies correlation, but of course not the convex.",
                    "label": 0
                },
                {
                    "sent": "So let me let me get started.",
                    "label": 0
                },
                {
                    "sent": "I'm going to not embarrass myself by disguise and describing network inference.",
                    "label": 0
                },
                {
                    "sent": "He.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You are the weather, but that is I'm going to talk about protein network inference, so in particular phosphoprotein network inference.",
                    "label": 1
                },
                {
                    "sent": "Just to recap here, a protein can be phosphorylated, it can accept fasfa at any given time.",
                    "label": 0
                },
                {
                    "sent": "A certain fraction of all the protein in a cell will be phosphorylated.",
                    "label": 0
                },
                {
                    "sent": "Proteins can phosphorylate each other, and in that way you can construct a network of these phosphorylation interactions.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm going to describe some problems that are rooted in causality.",
                    "label": 0
                },
                {
                    "sent": "Also, problems are rooted in the study.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The nature of some of the data that we work with and how these can be resolved.",
                    "label": 0
                },
                {
                    "sent": "So this is going to be constructive talk.",
                    "label": 0
                },
                {
                    "sent": "It's not going to be counterexamples talk.",
                    "label": 0
                },
                {
                    "sent": "And I'm going to propose a fairly ad hoc.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Weighted perform protein network inference, but away that is rooted in causality and has a stronger causal interpretation that we might normally get with feature selection approaches.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course there's some results.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, just two.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just to set.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now this is a very.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Framework the only thing to notice is that I'm going to frame network inference as a variable selection problem.",
                    "label": 0
                },
                {
                    "sent": "The reason for this is that protein networks are of course not closed.",
                    "label": 0
                },
                {
                    "sent": "Systems are heavily regulated by external signals, so there's not a lot of point trying to model this as a closed system.",
                    "label": 0
                },
                {
                    "sent": "That's of course not the case for gene regulatory networks that we know about.",
                    "label": 0
                },
                {
                    "sent": "So the this is the typical setup and we've seen many examples of L1L2 combinations of L1 with two variable selection methods.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This model you want to choose the Cobra.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is the X is the explain the response, why?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Had the covariates that explain the response Y in.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Minimize some loss are those features which you selected and hence the name feature selection methods.",
                    "label": 0
                },
                {
                    "sent": "So that's that's what I'm going to call this piece at here.",
                    "label": 0
                },
                {
                    "sent": "So PR features which are really good for prediction.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, covariates which actually caused the response might not be so good for prediction, and I'm sure you're aware this now show you a concrete example.",
                    "label": 0
                },
                {
                    "sent": "Of course, when we infer signaling networks were interested in in causal links were not interested so much in correlation, because actually if you look at protein signaling network as soon as you stimulate the network effect level, everything switches on and everything is correlated.",
                    "label": 0
                },
                {
                    "sent": "So that's not what we're interested in.",
                    "label": 0
                },
                {
                    "sent": "So the very clear.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Example of this is where you've got three variables.",
                    "label": 0
                },
                {
                    "sent": "The first variable just takes some random value.",
                    "label": 0
                },
                {
                    "sent": "Here, the second variable is equal to the first variable, but there's a fair bit of noise attached to it.",
                    "label": 0
                },
                {
                    "sent": "The third random variable is equal to the second random variable, and there's a tiny bit of noise attached.",
                    "label": 0
                },
                {
                    "sent": "So obviously predictive optimal would say pick this variable to predict this variable because it's most correlated with X.",
                    "label": 0
                },
                {
                    "sent": "Two X3 is most correlated with X2.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, X1 causes X2 and this is not only to show that, of course.",
                    "label": 0
                },
                {
                    "sent": "Correlation doesn't imply causation, but actually the causation can be quite weak compared with correlation.",
                    "label": 0
                },
                {
                    "sent": "Correlation can be an overriding force and in protein signaling networks I just mentioned.",
                    "label": 0
                },
                {
                    "sent": "Actually it is so we need to deal with this.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So of course, when.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When we enter these networks, phone calls and networks because we're going to validate with interventions.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Feature selection methods are more commonly used, so we've seen all of these, and of course linear models as you know, are linear.",
                    "label": 0
                },
                {
                    "sent": "Nature isn't as we've heard.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Moreover",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Amazon Scooter discriminating between correlated covariance.",
                    "label": 0
                },
                {
                    "sent": "The linear model is very forgiving and that's why we use it.",
                    "label": 0
                },
                {
                    "sent": "So if you want to discriminate between two very correlated covariance, the linear model is not going to.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Finally, symmetry of a linear model is not particularly useful if you see that X is a good predictor of Y, then what will be a good predictor of X?",
                    "label": 0
                },
                {
                    "sent": "And that's not really telling us very much in terms of the directionality of this causal relationship.",
                    "label": 0
                },
                {
                    "sent": "So just go back.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This example just for those of you that aren't familiar with this sort of problem.",
                    "label": 0
                },
                {
                    "sent": "If I try and infer the causal structure here using observational data, be this by inferring an inverse covariance matrix using a Gaussian graphical model, or by performing conditional independence tests of the various variables.",
                    "label": 0
                },
                {
                    "sent": "I will only get the undirected graph.",
                    "label": 0
                },
                {
                    "sent": "There's no way that I can tell the X1 causes X2 and X 2 = X Three.",
                    "label": 0
                },
                {
                    "sent": "That's just absolutely true, and you can read about that if you want to.",
                    "label": 0
                },
                {
                    "sent": "But it's true you can't get, you can't identify the network topology from observational data.",
                    "label": 0
                },
                {
                    "sent": "In general.",
                    "label": 0
                },
                {
                    "sent": "So that's the problem, and it's a problem with the linear model.",
                    "label": 0
                },
                {
                    "sent": "An OK, so this is a motivating example.",
                    "label": 0
                },
                {
                    "sent": "So what I've done here is I've plotted weight and height.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But I haven't told you weeks which accesses wait and which accesses height.",
                    "label": 0
                },
                {
                    "sent": "But of course you will know which accesses way in which accesses height.",
                    "label": 0
                },
                {
                    "sent": "So this axis here is height and this axis here is wait.",
                    "label": 0
                },
                {
                    "sent": "So how do I know that?",
                    "label": 0
                },
                {
                    "sent": "Well, I know that because weight should scale as something like the key with your Heights.",
                    "label": 0
                },
                {
                    "sent": "That's kind of very simple geometry and this looks a bit like a cube.",
                    "label": 0
                },
                {
                    "sent": "So this is this is a height and weight.",
                    "label": 0
                },
                {
                    "sent": "What did I do?",
                    "label": 0
                },
                {
                    "sent": "Well, I didn't use a linear model.",
                    "label": 0
                },
                {
                    "sent": "I used to keep it.",
                    "label": 0
                },
                {
                    "sent": "And how was I able to identify the labels of the axes?",
                    "label": 0
                },
                {
                    "sent": "Well, because if the data was scattered in this direction sleeping this way.",
                    "label": 0
                },
                {
                    "sent": "That would make physical sense.",
                    "label": 0
                },
                {
                    "sent": "So I used.",
                    "label": 0
                },
                {
                    "sent": "I used additional knowledge about nonlinearity within the physical system to discriminate the causal directionality of weight on height.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so that was just an example.",
                    "label": 0
                },
                {
                    "sent": "What we need to do in protein signaling is find nonlinearity that's relevant to us, something that we can use to exploit to infer the directions of our links in the network.",
                    "label": 0
                },
                {
                    "sent": "There was a recent theoretical result, so this was from uncertainty in artificial intelligence, which is a big machine learning conference last year, which is that if you ascribe a nonlinear functional model to some data, then you can always identify the entire network, provided that.",
                    "label": 0
                },
                {
                    "sent": "Fixing all the covariates except two in varying them.",
                    "label": 0
                },
                {
                    "sent": "The scatter plot that you get is not linear in the way that I described in the sense that the alternative scatter plot if you flipped it over wouldn't make physical sense.",
                    "label": 0
                },
                {
                    "sent": "Anne, this is nice because in case you weren't aware, you normally can't identify networks completely.",
                    "label": 0
                },
                {
                    "sent": "Normally you end up with what's known as an equivalence class of networks which are.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Identical in a problem.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Stick sense, but under this assumption, which is known as an identifiable functional model assumption, you actually can identify the entire network and it's rooted in this bivariate identifiability, which I just showed you in the height weight example.",
                    "label": 0
                },
                {
                    "sent": "So does that exist for protein cycling?",
                    "label": 0
                },
                {
                    "sent": "Well, actually it does.",
                    "label": 0
                },
                {
                    "sent": "This is this is a little.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Little diagram of enzyme kinetics which you're aware of, so substrate binds and substrate binds an enzyme.",
                    "label": 0
                },
                {
                    "sent": "The product binds as well and then the enzyme is conserved.",
                    "label": 0
                },
                {
                    "sent": "Yet this.",
                    "label": 0
                },
                {
                    "sent": "So I T substrates of finding its ion the product particles.",
                    "label": 0
                },
                {
                    "sent": "This is not.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As you all know, the reason being if the limiting quantity is the amount of substrate, then most of the enzyme is unbound and if you plot the amount of substrate against the reaction rate, you'll have a nice linear line here.",
                    "label": 0
                },
                {
                    "sent": "However, for protein signaling the proteins are enzymes, but they're also the substrate and you don't have a nice approximation where one of these things is a lot smaller than the other.",
                    "label": 0
                },
                {
                    "sent": "So actually you're going to be looking at this this whole range of dynamics where actually the enzyme can be totally saturated with substrate.",
                    "label": 0
                },
                {
                    "sent": "So, so any sort of linearity model here is going to.",
                    "label": 0
                },
                {
                    "sent": "It's not going to play because proteins are the kidneys is, but they're also the substrates here this is.",
                    "label": 0
                },
                {
                    "sent": "This is not an appropriate situation to use a linear model.",
                    "label": 0
                },
                {
                    "sent": "So actually the equation looks like this is the Michaelis.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Equation is a classical enzyme kinetic relationship which you will.",
                    "label": 0
                },
                {
                    "sent": "Most likely scene.",
                    "label": 0
                },
                {
                    "sent": "We got the substrate here, which is the unphosphorylated protein or enzyme is often phosphorylated protein.",
                    "label": 0
                },
                {
                    "sent": "We call them kinases.",
                    "label": 0
                },
                {
                    "sent": "And there are two unknowns.",
                    "label": 0
                },
                {
                    "sent": "There's a maximum reaction rate and Michaelis Menten constant.",
                    "label": 0
                },
                {
                    "sent": "OK, that's not linearity.",
                    "label": 0
                },
                {
                    "sent": "We can use that to break the symmetry of the linear model to infer complete protein signaling networks that are completely identifiable.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, the other the other issue I want to raise is a steady state data.",
                    "label": 0
                },
                {
                    "sent": "Stuff happens quickly, and if you look at studies that you don't see it, we know that.",
                    "label": 0
                },
                {
                    "sent": "So does that prevent us from identifying causal protein interaction well?",
                    "label": 0
                },
                {
                    "sent": "Maybe?",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let me just take a moment to define what I mean by causes in the dynamic sense.",
                    "label": 0
                },
                {
                    "sent": "So this is very intuitive.",
                    "label": 0
                },
                {
                    "sent": "But if if Akin's appears on the right hand side of an ordinary differential equa.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In formulation of your protein system that Kynes is said to cause phosphorylation of its substrate.",
                    "label": 0
                },
                {
                    "sent": "OK, that's that's what you would expect, but I just want to make sure that we're on the same lines here.",
                    "label": 0
                },
                {
                    "sent": "So here's an example of differential equations where X2 drives X1 and X1 drive XD.",
                    "label": 0
                },
                {
                    "sent": "But if I solve this differential equations for this item state, I find no information whatsoever about causality because the stationary state is just some trivial solution.",
                    "label": 0
                },
                {
                    "sent": "So if we observe this system at equilibrium, I'm not going to be able to identify any of this regulatory relationship here, which is in the sort of dynamic causal network.",
                    "label": 0
                },
                {
                    "sent": "I'm just going to network and that's not ideal.",
                    "label": 0
                },
                {
                    "sent": "So if I've got equilibrium observations of protein expression.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to be able to do anything with them.",
                    "label": 0
                },
                {
                    "sent": "Turns out.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In some situations you can let me try and characterize this issue.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is work almost 10 years old now.",
                    "label": 0
                },
                {
                    "sent": "Also from the machine learning community.",
                    "label": 0
                },
                {
                    "sent": "And it's today.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "With faithfulness of the equilibrium distribution.",
                    "label": 1
                },
                {
                    "sent": "So let me try and explain this little picture here, so the dynamic causal network is what we intuitively think of as the protein signaling network.",
                    "label": 0
                },
                {
                    "sent": "It's what's on the right hand side of the differential equation.",
                    "label": 0
                },
                {
                    "sent": "If we let the dynamics equilibriate, we get an equilibrium network.",
                    "label": 0
                },
                {
                    "sent": "It was the empty network on the previous slide.",
                    "label": 0
                },
                {
                    "sent": "It probably contains a bit less than the dynamic network, because some stuff transient and you can't see it at equilibrium.",
                    "label": 0
                },
                {
                    "sent": "So what we doing when we do inference using steady state data?",
                    "label": 0
                },
                {
                    "sent": "Well, we've got equilibrium observations and we want to make claims that if we manipulate so if we target a node in the network then we want to be able to predict what happens as a result of that intervention using our network info to equilibrium, OK?",
                    "label": 0
                },
                {
                    "sent": "That's going from here to here.",
                    "label": 0
                },
                {
                    "sent": "However, that's not really what happens when I give a drug to a asseline.",
                    "label": 0
                },
                {
                    "sent": "That cell line isn't going to be equilibrium anymore.",
                    "label": 0
                },
                {
                    "sent": "It's going to be reacting to that drug, and it's not going to process the intervention effect using the equilibrium network is going to use the dynamic network.",
                    "label": 0
                },
                {
                    "sent": "So this is a problem, so I'm starting with the wrong network.",
                    "label": 0
                },
                {
                    "sent": "I need to use this network in order to infer what's going to happen when I give it the drug.",
                    "label": 0
                },
                {
                    "sent": "So the question is, under what situation is this pathway?",
                    "label": 1
                },
                {
                    "sent": "The experimental pathway equivalent to the network inference pathway using steady state data?",
                    "label": 0
                },
                {
                    "sent": "The condition is formally called the equilibrium commutability criterion I believe, and under some situations that satisfied is that satisfied for protein signaling.",
                    "label": 0
                },
                {
                    "sent": "That's the question.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here's an example.",
                    "label": 0
                },
                {
                    "sent": "Here's another system.",
                    "label": 0
                },
                {
                    "sent": "We solve it.",
                    "label": 0
                },
                {
                    "sent": "We find the X one is driving X2 in the solution.",
                    "label": 0
                },
                {
                    "sent": "That's right, so we've got that.",
                    "label": 0
                },
                {
                    "sent": "So we've solved.",
                    "label": 0
                },
                {
                    "sent": "We solve for the equilibrium graph and got the dynamic graph.",
                    "label": 0
                },
                {
                    "sent": "So sometimes it works.",
                    "label": 0
                },
                {
                    "sent": "So can we.",
                    "label": 0
                },
                {
                    "sent": "Can we make this more general?",
                    "label": 0
                },
                {
                    "sent": "Well, yes, if this is your ordinary differential equation description of your protein signaling system.",
                    "label": 0
                },
                {
                    "sent": "Then if I solve it, I put zeros here, here, here, here and here.",
                    "label": 0
                },
                {
                    "sent": "I rearranged to solve.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What the substrate which is X1 here and anything that was on the right hand side here is still on the right hand side.",
                    "label": 0
                },
                {
                    "sent": "I've just put this on there and this is still here, so under systems that have some sort of, in this case a linear Decatur.",
                    "label": 0
                },
                {
                    "sent": "Then the entire protein signaling network, the dynamic protein signaling network, is identifiable from steady state data.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "Phosphorylated proteins become UN phosphorylated.",
                    "label": 0
                },
                {
                    "sent": "They do so in a way that's not as well understood as phosphorylation, because phosphatases are specific, but we don't know an awful lot about that.",
                    "label": 0
                },
                {
                    "sent": "So why not use this?",
                    "label": 0
                },
                {
                    "sent": "Why not use this as a base model?",
                    "label": 0
                },
                {
                    "sent": "Which will allow us to infer the entire protein signaling network.",
                    "label": 0
                },
                {
                    "sent": "The dynamic protein system network from steady state data.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's what we did.",
                    "label": 0
                },
                {
                    "sent": "So this is what I'm talking about when I talk about a protein phosphorylation network is unpacked slightly from what you may have seen before.",
                    "label": 0
                },
                {
                    "sent": "So here's a phosphoprotein.",
                    "label": 0
                },
                {
                    "sent": "This is protein three with phosphor on it.",
                    "label": 0
                },
                {
                    "sent": "This is the unphosphorylated form.",
                    "label": 0
                },
                {
                    "sent": "And I've been leased with language here because of course a protein can have multiple foster sides.",
                    "label": 0
                },
                {
                    "sent": "This just stick to one for the purposes of this talk.",
                    "label": 0
                },
                {
                    "sent": "So proteins can be dephosphorylated.",
                    "label": 0
                },
                {
                    "sent": "Phosphorylated phosphorylation can be catalyzed so so here X3 is connais for phosphorylation of X4.",
                    "label": 0
                },
                {
                    "sent": "Also Kinesis can be inhibited maybe by competitive binding of other things to the enzymatic site.",
                    "label": 0
                },
                {
                    "sent": "So here X3 is inhibiting the kinneys activity of X1 on phosphorylation of X2.",
                    "label": 0
                },
                {
                    "sent": "These are my description of protein signaling networks.",
                    "label": 0
                },
                {
                    "sent": "And so given at work we can write down a differential equation which describes the dynamics on that network.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it has all of these properties I've mentioned up to now.",
                    "label": 0
                },
                {
                    "sent": "We've got the nonlinearities.",
                    "label": 0
                },
                {
                    "sent": "These nonlinearities are nonsensical when inverted, so this gives us the direction of any edges we infer, and we infer all the edges because there's this linear decay term, so that when we solve it, anything that was a cause in the dynamic regime is still causing the equilibrium regime.",
                    "label": 0
                },
                {
                    "sent": "So we're on completely solid causal footing there.",
                    "label": 0
                },
                {
                    "sent": "We",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To do inference so this naturally means putting a probability model there.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I've put an ad hoc probability model on it.",
                    "label": 0
                },
                {
                    "sent": "I'm looking at the difference between the predicted solution and the measured solution.",
                    "label": 0
                },
                {
                    "sent": "Well, I'm plugging in observations into into the original equation and then putting a normal error on on the equation.",
                    "label": 0
                },
                {
                    "sent": "It's ad hoc.",
                    "label": 0
                },
                {
                    "sent": "That's because the point I'm trying to make here is that by formulating models in this way, which allows for causal identifiability, you can gain in performance.",
                    "label": 0
                },
                {
                    "sent": "This is not an observation.",
                    "label": 0
                },
                {
                    "sent": "ULL model coupled with.",
                    "label": 0
                },
                {
                    "sent": "Dynamic model.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's see how it does so.",
                    "label": 0
                },
                {
                    "sent": "So of course you can do inference and Monte Carlo isn't of general interest here, so I'll just briefly describe the process.",
                    "label": 0
                },
                {
                    "sent": "So what you need to learn, you need to learn the parents.",
                    "label": 0
                },
                {
                    "sent": "The parents are either kinesis or inhibitors of said Kinesis.",
                    "label": 0
                },
                {
                    "sent": "So there's two different types of parents.",
                    "label": 0
                },
                {
                    "sent": "Once you know the parents, you can talk about the chemical parameters that define those reactions.",
                    "label": 0
                },
                {
                    "sent": "So we got the case.",
                    "label": 0
                },
                {
                    "sent": "The Michaelis menten constants and the vis the maximum reaction rate.",
                    "label": 0
                },
                {
                    "sent": "So there's a lot that needs to be learned from the data here.",
                    "label": 0
                },
                {
                    "sent": "Well, how do we do that?",
                    "label": 0
                },
                {
                    "sent": "Well, we construct an reversible jump sampler, so for those that don't know, reversible jump sampler, Ann.",
                    "label": 0
                },
                {
                    "sent": "Moves across the joint space of both structural models and parameters.",
                    "label": 0
                },
                {
                    "sent": "That is, we update the network and the parameters at each iteration.",
                    "label": 0
                },
                {
                    "sent": "These are notoriously difficult to get to converge, and the results that I'm showing you are based on quite a small sample, so actually it's not not such a tough problem, But if I was going to roll this out on an industrial scale, I would need to put some more thought into this.",
                    "label": 0
                },
                {
                    "sent": "Naive reversible jump was constructed using.",
                    "label": 0
                },
                {
                    "sent": "The simplest possible moves we didn't want to pretend that we had an intuition for the cross model parameter space.",
                    "label": 0
                },
                {
                    "sent": "We don't, so we're using simple moves here and they get accepted at reasonable rates, which means that our posterior probability of having an edge or not in our protein cycling network converges reasonably rapidly on a laptop.",
                    "label": 0
                },
                {
                    "sent": "So I should mention that.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The posterior probability of an edge here.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And is without this additional.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thing of being a teenager organize inhibitor.",
                    "label": 0
                },
                {
                    "sent": "It's sign free so I've collapsed that for the purposes of this this presentation.",
                    "label": 0
                },
                {
                    "sent": "Right, the system is also simulated results.",
                    "label": 0
                },
                {
                    "sent": "We took a computational model of the EGFR signaling pathway.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which came out in science signaling two years ago?",
                    "label": 0
                },
                {
                    "sent": "This is their picture.",
                    "label": 0
                },
                {
                    "sent": "I've unpacked it into the picture I showed you earlier.",
                    "label": 0
                },
                {
                    "sent": "So for each protein there are two nodes, the phosphorylated and the unphosphorylated mode.",
                    "label": 0
                },
                {
                    "sent": "We can simulate lots of things.",
                    "label": 0
                },
                {
                    "sent": "We can give it EGF, we can do various types of inhibition experiment.",
                    "label": 0
                },
                {
                    "sent": "So we've got a nice simulation platform to test whether basing causality on chemical kinetic descriptions and studies their data is a viable technique to use.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it turns out it is.",
                    "label": 0
                },
                {
                    "sent": "So what am I comparing it against?",
                    "label": 0
                },
                {
                    "sent": "I'm comparing it against a linear model with feature selection techniques, so feature selection in this case is Bayesian variable selection by model averaging.",
                    "label": 0
                },
                {
                    "sent": "This is a reasonably standard technique and also the last year of course, which is well known.",
                    "label": 0
                },
                {
                    "sent": "I'm also comparing two variants whereby the response is not the amount of phosphorylated protein, it's rather the fraction of phosphorylated protein, because, as you can appreciate.",
                    "label": 0
                },
                {
                    "sent": "Variation in the total protein levels is going to be a factor here, and we want to try to account for that in a linear model, especially Cam.",
                    "label": 0
                },
                {
                    "sent": "You can see the basing inference on on Kenny's equation.",
                    "label": 0
                },
                {
                    "sent": "So This is why white emptiness driven inference does seem to rather outperform at any linear formulation.",
                    "label": 0
                },
                {
                    "sent": "Now you can do this in two ways.",
                    "label": 0
                },
                {
                    "sent": "You can view this as justification of all my talk about how causality is important.",
                    "label": 0
                },
                {
                    "sent": "Or you can view it as the fact that I've accounted for variation in total protein levels when doing inference.",
                    "label": 0
                },
                {
                    "sent": "They're both valid in front of interpretations.",
                    "label": 0
                },
                {
                    "sent": "I prefer the cause interpretation, but nevertheless you can view this as a fancy normalization technique if you want.",
                    "label": 0
                },
                {
                    "sent": "So we.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Peter, this, across various noise and sample size regimes, and this is the chemical kinetic method here it seems to outperform various linear methods.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "An interesting question that we haven't quite addressed is.",
                    "label": 0
                },
                {
                    "sent": "Is our method any good prediction tool if you're in furthering the correct causal structure, you would like to think bigger prediction, but actually linear methods are variable selection techniques for linear methods are generally predictive optimal, so these are guaranteed to be as good as possible at prediction given the linear model.",
                    "label": 0
                },
                {
                    "sent": "So it'll be interesting to see if we can actually prediction here.",
                    "label": 0
                },
                {
                    "sent": "But this is just inferring the structure of underlying protein signaling network.",
                    "label": 0
                },
                {
                    "sent": "So real data across we workout accounts hospital so we had plenty of cancer data so modulator rewiring that might happen.",
                    "label": 0
                },
                {
                    "sent": "Here's some results.",
                    "label": 0
                },
                {
                    "sent": "So we took 22 Council lines and we took protein measurements for this.",
                    "label": 0
                },
                {
                    "sent": "About 40 different phosphoproteins their corresponding unphosphorylated concentration.",
                    "label": 0
                },
                {
                    "sent": "So his cell lines on the proteins and then the question is, given a particular breathing.",
                    "label": 0
                },
                {
                    "sent": "So this is the sort question we get in hospital.",
                    "label": 0
                },
                {
                    "sent": "The clinician will come to us and say.",
                    "label": 0
                },
                {
                    "sent": "What could be phosphorylated matinees in my triple negative breast cancer?",
                    "label": 0
                },
                {
                    "sent": "So that's a question that's a structural causal question.",
                    "label": 0
                },
                {
                    "sent": "It's also a local question.",
                    "label": 0
                },
                {
                    "sent": "It's not a network question.",
                    "label": 0
                },
                {
                    "sent": "We don't care what the degree distribution of patients network is.",
                    "label": 0
                },
                {
                    "sent": "We just want to know what's fascinating.",
                    "label": 0
                },
                {
                    "sent": "That conveys in this cancer cell line.",
                    "label": 0
                },
                {
                    "sent": "So if you ask these sort of questions, how does it look?",
                    "label": 0
                },
                {
                    "sent": "So the question we asked here is what's phosphorylating the S6 protein in all of the basal cancer cell lines for we stricted to pay for here and we.",
                    "label": 0
                },
                {
                    "sent": "We ranked all of the other phosphorylated proteins as potential kinesis for S6 in this setting.",
                    "label": 0
                },
                {
                    "sent": "The chemical connecting connecting method says the P-76 counties.",
                    "label": 0
                },
                {
                    "sent": "Actually, my guess is actually kind of is the preferred preferred kinds of that.",
                    "label": 0
                },
                {
                    "sent": "Six other methods don't do so well, so linear methods don't have an awful lot of evidence for the true counties and the last few methods which are quite conservative, don't ascribe any weight at all to the true kinase, so.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what's going on?",
                    "label": 0
                },
                {
                    "sent": "Either our method is making the.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That causes prediction it well.",
                    "label": 0
                },
                {
                    "sent": "It is making the correct causal prediction.",
                    "label": 0
                },
                {
                    "sent": "All we are accounting for noise due to variation in the total protein levels between the different cancer cell lines that we're looking at.",
                    "label": 0
                },
                {
                    "sent": "The completely jewel interpretations here.",
                    "label": 0
                },
                {
                    "sent": "This is finding generalized to other proteins.",
                    "label": 0
                },
                {
                    "sent": "Of course, that's the natural question.",
                    "label": 0
                },
                {
                    "sent": "So the other question can ask is.",
                    "label": 0
                },
                {
                    "sent": "OK, so these methods don't seem to work well are they?",
                    "label": 0
                },
                {
                    "sent": "Are they at least similar?",
                    "label": 0
                },
                {
                    "sent": "So these are all linear models, right?",
                    "label": 0
                },
                {
                    "sent": "You would expect a linear model to make similar predictions, but actually they don't.",
                    "label": 0
                },
                {
                    "sent": "So here we got all the different methods and what I'm plotting are the either the posterior probabilities of each.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An putative parents or the weight according to the last few model, and actually see if you take 2 linear models here.",
                    "label": 0
                },
                {
                    "sent": "So this is a good example.",
                    "label": 0
                },
                {
                    "sent": "Here we got a linear model and linear model here in linear model here and actually the various wait subscribe to different proteins are not particularly in agreement.",
                    "label": 0
                },
                {
                    "sent": "So what does this say?",
                    "label": 0
                },
                {
                    "sent": "This says that how you set up variable selection in the linear model seems to be pretty crucial into what your results are.",
                    "label": 0
                },
                {
                    "sent": "It also probably says that confounding due to variation in total protein levels of factor, even when you model the fraction of protein is facilitated.",
                    "label": 0
                },
                {
                    "sent": "The response.",
                    "label": 0
                },
                {
                    "sent": "You still don't don't do well, so so you've got a joint model.",
                    "label": 0
                },
                {
                    "sent": "Both the total and the amount of phosphorylated protein under these chemical connect kinetic equations.",
                    "label": 0
                },
                {
                    "sent": "In order to really account for confounding and or improve your causal inference ability.",
                    "label": 0
                },
                {
                    "sent": "In this setting, a few more examples so.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To the best of course, but there are other examples which do pretty well.",
                    "label": 0
                },
                {
                    "sent": "P3P53 didn't do so well, but these accounts cell lines, so who knows what was going on there and we're pretty happy with how it went.",
                    "label": 0
                },
                {
                    "sent": "And of course this was a proof of principle concept.",
                    "label": 0
                },
                {
                    "sent": "This was.",
                    "label": 0
                },
                {
                    "sent": "This was demonstrating that using nonlinear equations coupled with this causal premise is a reasonable approach to inference.",
                    "label": 0
                },
                {
                    "sent": "We haven't tuned this method for a high throughput rollout or anything like this.",
                    "label": 0
                },
                {
                    "sent": "So to summarize.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We've seen how we can.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These chemistry to get the directions of these edges normally can't.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We see that.",
                    "label": 0
                },
                {
                    "sent": "We discuss why for steady State data we can actually identify the dynamic signaling network.",
                    "label": 0
                },
                {
                    "sent": "That's true for protein signaling.",
                    "label": 0
                },
                {
                    "sent": "The same argument may all these arguments may apply for gene regulation.",
                    "label": 0
                },
                {
                    "sent": "Of course, it's a bit murkier, but nevertheless there are these Michaelis Menten formulations which one could in principle used in this setting.",
                    "label": 0
                },
                {
                    "sent": "We've also seen that the method, which was pretty ad hoc, to be honest, does actually outperform linear methods, so with where they work in.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Making it so we should be able to improve on this.",
                    "label": 0
                },
                {
                    "sent": "And of course, in the future we.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Need to do a systematic validation of.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Things I showed you a very very brief summary with just a few proteins, but we need to really do this properly.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course, if you wanted, you could introduce lots of chemical processes.",
                    "label": 0
                },
                {
                    "sent": "You can have competitive non competitive interaction of enzymes and there's also what you could do.",
                    "label": 0
                },
                {
                    "sent": "We restrict such as skin ages and inhibitors.",
                    "label": 0
                },
                {
                    "sent": "But you could go crazy if you wanted to.",
                    "label": 0
                },
                {
                    "sent": "And so I'd like to thank you and suggest that if you're interested in the causal aspects of this paper, you will find it in the end the conference proceedings.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it and this rewrite of the paper.",
                    "label": 0
                },
                {
                    "sent": "So thank you for attention.",
                    "label": 0
                },
                {
                    "sent": "Thanks for your very nice took, it's very deep.",
                    "label": 0
                },
                {
                    "sent": "I'd like to ask you when you talked about identifiability and the fact that I know you have a faithful model for the equilibrium.",
                    "label": 0
                },
                {
                    "sent": "When you use kinetics equation where you have a product instead of some because you use a summation is cumulative.",
                    "label": 0
                },
                {
                    "sent": "Affect do you still get some results with products?",
                    "label": 0
                },
                {
                    "sent": "So so you would end up with the product if, um, if you had competitive.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so exactly.",
                    "label": 0
                },
                {
                    "sent": "So maybe not in your in your case, but for instance generating networks, yes?",
                    "label": 0
                },
                {
                    "sent": "Full for the NT and Seat I presented.",
                    "label": 0
                },
                {
                    "sent": "There's absolutely no reason why you couldn't compute these quantities in terms of identifiability.",
                    "label": 0
                },
                {
                    "sent": "I strongly suspect so, although I haven't actually written down on paper to check that the inverse isn't possible as well.",
                    "label": 0
                },
                {
                    "sent": "One question would be N CNT might quite struggle quite badly because as a product these parameter values are going to be pretty coupled.",
                    "label": 0
                },
                {
                    "sent": "All of my parameter updates for orthogonal, so I would be a little bit weary, but as you say, in principle this this is a very sound idea, thank you.",
                    "label": 0
                },
                {
                    "sent": "More questions.",
                    "label": 0
                },
                {
                    "sent": "Maybe have one refund so I'm trying to understand the assumption and why that assumption works for you but may not work for gene regulation.",
                    "label": 0
                },
                {
                    "sent": "So I mean you can go back to that to that slide into the.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "So I guess it wasn't this technical.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Here it that's that's your assumption.",
                    "label": 0
                },
                {
                    "sent": "OK, so and why is that not?",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Satisfied in other cases, so I'm just thinking what are the technical conditions which need to have it applicable in a more broad sense.",
                    "label": 0
                },
                {
                    "sent": "OK, the.",
                    "label": 0
                },
                {
                    "sent": "The technical condition.",
                    "label": 0
                },
                {
                    "sent": "If we're being rigorous.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually previous slide it's the quality of this diagram.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In practice.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What this means is that.",
                    "label": 0
                },
                {
                    "sent": "The equilibrium relations that you get by solving these equations.",
                    "label": 1
                },
                {
                    "sent": "Should show the same dependent structure the same.",
                    "label": 0
                },
                {
                    "sent": "Ethical model corresponding to the structural equations as the time varying model.",
                    "label": 0
                },
                {
                    "sent": "So the steady state model agree with.",
                    "label": 0
                },
                {
                    "sent": "I'm very model in terms of the network underlying the structural equation formulation.",
                    "label": 0
                },
                {
                    "sent": "OK, OK.",
                    "label": 0
                },
                {
                    "sent": "So you say, for example if and if there I can show you why this fails actually so so this example failed because.",
                    "label": 0
                },
                {
                    "sent": "When you solve these equations, everything just disappears.",
                    "label": 0
                },
                {
                    "sent": "So since I can no longer see the X twos depending on X1, there's no way I couldn't.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That from the equilibrium data, yeah, I see.",
                    "label": 0
                },
                {
                    "sent": "OK more questions, no?",
                    "label": 0
                },
                {
                    "sent": "So then, let's have a break for about 25 minutes.",
                    "label": 0
                },
                {
                    "sent": "We're going to resume at 3:30.",
                    "label": 0
                },
                {
                    "sent": "Let's thank the speaker again, thanks.",
                    "label": 0
                }
            ]
        }
    }
}