{
    "id": "f4iylthen4bu5ypyr5canzx3bzblvkrf",
    "title": "Reading Customers’ Needs and Expectations with Analytics",
    "info": {
        "author": [
            "Vasilis Aggelis, Piraeus Bank"
        ],
        "published": "Oct. 3, 2011",
        "recorded": "September 2011",
        "category": [
            "Top->Computer Science->Data Mining->Data Mining Experiences",
            "Top->Computer Science->Data Mining"
        ]
    },
    "url": "http://videolectures.net/ecmlpkdd2011_aggelis_reading/",
    "segmentation": [
        [
            "Hello to everyone.",
            "I would like to thank you for being here tonight.",
            "My name is Vassilis Angeles and I'm from Piraeus Bank, head of customers analysis sector.",
            "It's a great honor for private bank and for me of course, presenting now in the CML conference.",
            "Our work in business.",
            "Let's start."
        ],
        [
            "Here is a brief agenda of my presentation.",
            "Firstly, I will make a short introduction for Piraeus Bank.",
            "After that I will present you browse bank customer segmentation and cross selling model.",
            "The next XX section belongs to cross model which is actually the model we use in order to utilize data and knowledge.",
            "It is also essential to show you our business process concerning analytics.",
            "Finally, I will quote some cases of data mining analysis that we have done in our customer data and my presentation will be ended presenting to you the benefits of customer analytics both for our bank and for our customers."
        ],
        [
            "But I was Bank was born in 1916.",
            "Our bank privatisation was held in 1991.",
            "Since then, perhaps banks growth was extreme, absorbing other banks and merging with others.",
            "During that time periods, Bank had a strong international expansion, having presence in nine different countries."
        ],
        [
            "But as banks total assets were 56.6 billion euro in March 2011, where the 4th largest bank in Greece with 872 brands is both in Greece and abroad having 30,000 well trained customer setting and IT familiar employees."
        ],
        [
            "We undertook tasks in retail banking development division in January 2010.",
            "Our scope was to plan a strategic model that focus on developing first current and new individual customer and second banks product portfolio.",
            "The target that we have to achieve goes to turn our strategy from product oriented to a customer set required and of course to contribute to the growth of retail customers.",
            "Scope and Target is accomplished through our know how into first customer analysis.",
            "We have done more than 50 different complete analysis using analytics.",
            "Second strategic analysis like next best product, crucial ratio.",
            "Customer lifetime value, RFM racist frequency, and monetary score and many more using analytics again.",
            "3rd customer utilization with implementation of all commercial and communication criteria and also introducing and utilizing propensity scoring.",
            "4th Administration of below.",
            "The line channels such as crucial advisor which is a brads application ATM, SMS, email, banking and finally results measurement with direct adjustment in our next campaigns."
        ],
        [
            "In this slide you can see perhaps bank customer structure.",
            "Apart from main, indirect and historic individual, there are also private enterprises bank and do group stuff in retail banking customer base.",
            "At the same time, organisations, public, non-profit institutes and financial institutes are part of our corporate banking customer base.",
            "My sector focused on main individuals and all new main individuals that were coming to our bank which are more than two million distant customers.",
            "In order to prepare segmentation."
        ],
        [
            "We took into consideration the following criteria of customer segments market and commercial potential.",
            "Clear definition and measurement.",
            "It is a matter of great importance to define clearly a group of customers.",
            "For example, someone may name a customer segment such super Mom's.",
            "It sounds good, but who are super Mamas?",
            "Do they wear a Cape as Superman does?",
            "We are a finance at least that so we have to set clear and measurable definitions when I talk about payroll customers, I have the ability to measure and distinguish them.",
            "Also, capability of planning a customer centric approach and communication product portfolio increase and, of course, Piraeus bank structure.",
            "For example, agricultural sector for farmers or peril sector for payroll customers."
        ],
        [
            "Talking about customer segment, here are some basic measures, metrics and values that we have computed in order to have an almost complete picture with one glance.",
            "Firstly, we are interested in share in total size of men, individuals, gender and relationship aids.",
            "According customer Sir, we find sharing deposit and investment balances and second share in credit product balances.",
            "Focusing on customer product portfolio is necessary to know first of all average active product number and average active arrangements number.",
            "I give you an example to make clear the difference between product and arrangement.",
            "When a customer has one Visa classic credit card and one miles and more MasterCard, then he has one product credit card but two arrangements, Visa and MasterCard.",
            "As for the definition of active, we consider active an arrangement if transaction have been done on it in a default time period, which varies depending on product.",
            "Also.",
            "We measure launch sales.",
            "The number of products.",
            "Basic categories purchased by customer that date when he became our customer.",
            "Cross ratio the number of products.",
            "Basic categories purchased by customer in his lifetime in our bank but different from launch sales, basic products and finally, absolutely sure any additional arrangement of basic products.",
            "Categories perceived by customers in his lifetime.",
            "Add the last three measures, launch sales cross sell ratio an absolute ratio.",
            "We take the total number of customer purchases during his relation with us.",
            "RFM is an exceptional indicator for customer potential.",
            "Finally, we are interested to measure our channels, users by customers and how many of them transact through brands.",
            "ATM automatic automatic payment systems, Internet, iOS or EP OS."
        ],
        [
            "Another important metric is the number of inactive customers, namely customers with no RFM score.",
            "The last six months.",
            "Product portfolio composition is also significant.",
            "What is the percentage of holders in time deposits in deposits in credit cards and debit cards and bank insurers?",
            "And there's so many bank product categories about 50 different basic product categories, imperious Bank."
        ],
        [
            "A visual sense of segments.",
            "Customer distribution in whole country gives you in a glass in which areas a segment is well developed.",
            "And then which is not.",
            "There is a big consideration of population in Athens and Salonika.",
            "Here in Greece, in our country and this concentration reflects.",
            "And in an organization customer distribution as we see clearly in the side slide.",
            "Attic, Athens and Salonika.",
            "Which is about the 50% of our customer population."
        ],
        [
            "I just got the calculation formula for four crucial ratio which takes into consideration.",
            "Total number of distinct basic products ever sold to individual customer.",
            "I total number of District Basic products that solve the same date with customers at the station and of course total number of distant customers with Metalation.",
            "It depends on the status."
        ],
        [
            "Here is the calculation for the absolute ratio."
        ],
        [
            "Let's see this water analysis for our segmentation model.",
            "Strengths our customers Cedric and targeted communication banks, product portfolio utilization and aiming commercial value offers according to customer profile Profile and the needs we support and contribute to product development and I will talk about it later.",
            "Weaknesses Where absence of customer centric approach product structure according to customer segments need.",
            "I use the verb where because I strongly believe that we manage to diffuse our customer centric philosophy in our organization in a great manner.",
            "After almost 1 1/2 year for our first step.",
            "Opportunities are.",
            "Customer centric approach and customer said communication term.",
            "Customer and product targeted utilization and finally threats were and they still are more or less product oriented culture and mentality.",
            "Financial crisis.",
            "Unfortunately my country lately become main issue for its depth and economic crisis."
        ],
        [
            "It was I was looking for an enlightening picture to give you my sense.",
            "What might be a problem in our relation with you?",
            "I mean with our customers, I believe I found the pretty one sometimes, but things should be happened behind our back."
        ],
        [
            "In order to mitigate or avoid collateral damage like the one we showing previous light, we have to become bridge for our customers.",
            "My motto is let's make our customers fans of Piraeus bank proving the right of their choice.",
            "Customer begins to cross the River through our breads.",
            "He starts his relation with our bank that is the first stage in our coexistence which is acquisition and be measured by launch sales.",
            "Now customer is in the middle of the bridge.",
            "This is the most crucial period we have to make him feel strong and steady because if we don't he may feel dizzy and then search competitors.",
            "In other words, help.",
            "In that time we focus on customer retention.",
            "Selling products crucial from our product portfolio based on their needs.",
            "Customer comes to the other side of the River.",
            "Now he feels safe and comfort, Rible loyalty, and we can easily increase their product portfolio.",
            "Upsell."
        ],
        [
            "That was our old culture, clearly product oriented.",
            "But there were two basic problems with our target.",
            "First, it was slightly changeable and 2nd same customers were conducted continuously.",
            "Here is new culture customer centric.",
            "Now we have bigger number of customers to target segmented customers.",
            "So we have a better knowledge for them and their needs.",
            "Not communicated customers.",
            "In other words, customers banned due to our old culture and of course more clean customers.",
            "Customers who don't forbid to contact with him or customers who don't have MPLS for example."
        ],
        [
            "Our segmentation model was implemented on July 2010 in all customer centric platforms and applications in Prius Bank.",
            "We define eight different and distinct retail customer segments with more than two million unique customers.",
            "We set prioritization process in order to compute the right segment for its customer taking into consideration the overall retail buying transit strategy.",
            "Also, we refresh.",
            "Customer segment every six months 1st of January and 1st of July.",
            "But I was bank adopts basic measurements for its segment, which are recording sales, launch sales ratio, cross ratio and top seller ratio and according customer activity activities, average number of active products and average number of active arrangements.",
            "Finally, thanks to analytics, we make a certain commercial value offer for its individual customer in the same time all below the Lanka bands are targeted once."
        ],
        [
            "In this slide you can see a part of the front customer screen on our customer centric platform which is called eyes.",
            "Our Calling brands can see in which segment customer belongs, how many active product he has and the commercial value offer for the customer.",
            "Our colleagues have been well trained on our segmentation so they know the basic characteristics of its segment and how to treat any customer.",
            "If there is a check mark nearby the proposed product.",
            "For example here.",
            "That means that is a product.",
            "That the customer hears the product and it is active.",
            "If there is a suitcase nearby, the proposed product that means that is a product for sale.",
            "In addition, there are also indicators for resales and inactive products."
        ],
        [
            "Final step represented as raw data in business and knowledge layer.",
            "Consent definition of entities and their attributes.",
            "Very important is to set the process for data extraction, data transformation, data cleansing and data loading.",
            "Four step of priors is referred to information layer before having information representation, it is critical to manage missing values which inflict in many cases the results.",
            "After the task in formation can be represented as report or graph.",
            "Nowadays there are more sophisticated representation forms like kepis or visualization.",
            "Next layer is the intelligence run.",
            "In order to make your business intelligent, hidden formation patterns must be found using at most data mining techniques.",
            "Data mining would advance intelligence in decision-making.",
            "There are many practices that could help to take decision, such as advanced or predictive analytics.",
            "Last layer is related with benefits and profit and that then that obtained from the whole process speaking about genes.",
            "It is important to emphasize that genes are both for companies and their customers.",
            "Discrete human roles are defined increase model.",
            "Human factor is the innovative part of the model or roles have same importance.",
            "But two of them are most crucial.",
            "Those roles are.",
            "Customer customer is the initial and better data source.",
            "Any customer could be internal organization stuff or external customer transactions produce huge data volumes daily.",
            "Customers buy pay, deposit order, register, allocate, cancel, navigate, have, needs, have opinions, work, leave Mary study and make many other actions that have new data production.",
            "Or current data transformation as results at the same time customers are recipient of knowledge that benefits from cross process.",
            "Analyst analyst must be qualified with business process knowledge and data manipulation skills.",
            "I this stuff.",
            "I think people contribution is necessary because they are the most appropriate to design in cooperation with business analysts.",
            "That data repository and implement it.",
            "Also they could help in the ETL process design and it's automated operation sales departments.",
            "Coburn Sales Department receiving formation about crucial metrics via different systems like MI, SRM, etc.",
            "In addition, they received clearance standing formation for their customers in order to plan.",
            "Next actions directors information received by directors.",
            "Defers that information gets by Sales Department's.",
            "It is not so detailed, but contributes in a safe and real presentation of business value.",
            "Directors belong to Decision Makers Group.",
            "Data mining or business intelligence analysts?",
            "This specific analyst has to know data mining at business, intelligent techniques and methods.",
            "It is the second most crucial role because he's the one who adds value in business.",
            "By establishing models and patterns for hidden information.",
            "Top management executive.",
            "Presidents general Directors are those who take the critical decision for a company.",
            "Top management is the most crucial role.",
            "The foundation stone of careers.",
            "If this is the starting point.",
            "If they don't believe in cross capabilities, there is not chance to take part cross revolution.",
            "Combining with this abstract notion, we mean all combining stuff that is responsible to execute business planet actions.",
            "Companies.",
            "Shareholders also participated in this notion.",
            "There are those who James benefits from companies.",
            "Revenues."
        ],
        [
            "As we stated, top management is a key role in cross.",
            "Our intention is to persuade all those leader fourcross usefulness.",
            "In order to set up our data utilization philosophy in a big organization is not enough to have few visionaries somewhere and organization structure vision must be part of top management as well as faith, inspiration, and lead.",
            "Leaders are the most appropriate persons to enforce rules in organisations scales.",
            "Lamp example describes that need.",
            "Let's assume that organizational structure is like a pyramid.",
            "In the top of pyramid, our leaders top management and as we go down to the base all rows are rolled out.",
            "If there is a visionary in a middle level of pyramid, at turn owns a lab only a restricted part of it's it's lightened.",
            "Head of Pyramid remained darkness, but if leader turns on the lab, then light is set in whole pyramid.",
            "Even the restricted part will be over light and then.",
            "Top management are those who take Decissions experience emotional intelligence.",
            "Scientific knowledge is valuable tools for decision-making.",
            "Krios is an added value.",
            "Our model can verify facts and assumptions and support decision making.",
            "In addition, crews can fill parts of decision puzzle, importing new and uncovered information."
        ],
        [
            "Our."
        ],
        [
            "Business process now.",
            "Our business process according.",
            "Analytics is presented in that slide.",
            "When we receive a business case, first of all think possible solutions and Secondly, think data.",
            "Our process, as you can see, start with modeling and then pass through execution and model suitability check.",
            "In many cases we have to execute many times our models changing slightly or heavily our parameters.",
            "When we are sure and say for our model, we publish and distribute results in this possible units that executives who are those who take decisions and root actions.",
            "A short period after actions, we evaluate the results of them benefits, profit loss, etc.",
            "And we decide if there is a need for modular design.",
            "Finally, we do get our model with current data.",
            "That process consists the notion of constant analytics modeling repetition in predefined periods.",
            "For example, such an analytics model.",
            "It certain analysis."
        ],
        [
            "And now let's see some cases of that."
        ],
        [
            "Mining analysis.",
            "The first data mining analysis case concerns customer segmentation and it is called understanding pariahs bank consumers.",
            "Please notice that we talk about consumers and not customers.",
            "We use analytics to identify our customers preferences based mainly on the means of payment they prefer most.",
            "Intrasexual channels they use more."
        ],
        [
            "Our scope was to segment our entire customer base in order to find the best communication.",
            "Chandler or combination of channels suggest better ways to control and perform their transactions.",
            "Locate shopping carriers they visit often and examine whether or not it worth opening a seltzer brands.",
            "We analyze aerial case 5 big shopping trends of our consumer customers.",
            "In the Mall of Athens."
        ],
        [
            "The next data mining analysis case concerns also customer segmentation and it is called allocate the next best product for its customer.",
            "I think that the next best product is a familiar term to some of you.",
            "We segmented our customers using analytics based on their life states, gender, location of residence, duration of being active customers."
        ],
        [
            "We found 48 different customer segments for each segment.",
            "We defined the sequence of product purchase.",
            "Now we have available more than 45,000 rules to define which is the next best product for its customer."
        ],
        [
            "This data mining analysis case.",
            "Concerns product development and it is called the regular saver.",
            "We built we designed a new product based on customer behavior."
        ],
        [
            "Our scope was to utilize customer data using analytics to develop new deposit product with the goal of increasing banks market share and assets and of course achieving new customer acquisition."
        ],
        [
            "I'm glad to say that a new saving account called Borrow, which mean in English I can launch from Piraeus Bank on March 2011."
        ],
        [
            "Also, this data mining analysis case concerns product development and it is called frequent traveler.",
            "Again, we build, we design a new product based on customer behavior."
        ],
        [
            "Our scope was to utilize customer data using analytics to develop new insurance product, aiming to attract our traveler customers.",
            "In addition, offer it as an extra service to our high value bank customers, free of charge.",
            "Our product development analysis is studied now by Paris Bank responsible Bank."
        ],
        [
            "Sure's Department.",
            "The last data mining analysis case concerns customer behavior and it is called focusing on customer deposit behave."
        ],
        [
            "The scope of this case was to utilize data using analytics to understand trends and patterns in any customers.",
            "Overall deposit balance change and categorize them in distinct groups.",
            "At this, running to our commercial offer, we have the ability to strengthen our customer commercial approach."
        ],
        [
            "In this slide you can see a part of the front customers cream on our customer centric platform which is called ties.",
            "And our colleague in brands can see customer deposit behavior with.",
            "Words.",
            "Graphs.",
            "And assets."
        ],
        [
            "The audience line in the graph shows deposits.",
            "Closing balance is progress for the last seven months.",
            "The blue line in the graph shows average deposit balances progress for the last seven months.",
            "Amount of 743 euro in the is the total semester deposit chains and 54.04% is the percentage of semester deposit change."
        ],
        [
            "Let's now see the benef."
        ],
        [
            "It's.",
            "The point is to make.",
            "The right offer.",
            "To the right customer.",
            "Via the right channel.",
            "At the right time.",
            "Then you can achieve to reduce advertising or communication cost, reduce valuable human hours, do better sales and succeed better result."
        ],
        [
            "It's.",
            "Benefits for our bank are the following.",
            "Increased core acceleracers improved response ratios on marketing campaigns cost and time savings, improved customer satisfaction and retention."
        ],
        [
            "After the implementation of customer segmentation and commercial approach on July 2010, we closed 2010 with 3% degrees in the average number of active products.",
            "An almost 12% increase in the average number of active arrangements.",
            "And all those numbers were succeeded only in a period of five and a half months.",
            "And in a very difficult timing where the economic environment was getting worse and worse."
        ],
        [
            "When weather took tasks in retail banking, development division, we set our target concerning below the land cabins.",
            "It is obvious that the response rates from past years were not satisfactory.",
            "Another issue was the mass campaign targeting, which probably make a number of our customers not to pay attention in our Contacts anymore.",
            "Where is the bar high?",
            "Setting a target four point 1% response ratio and total number of communicated customers 7700 thousand customers.",
            "It would be the first time that Perez Bank would overtake 4%."
        ],
        [
            "Results exceeded our expectation.",
            "We succeed 8.9% response ratio in all below the Lanka bans through any channel brands.",
            "8:00 PM call center SMS, banking direct Mail.",
            "2010 results was 536% better than 2009 and it is worth to note that we achieve 117% better result that than our predefined target.",
            "Another in currency issue is that we managed to conduct with 41% less customers than 2009 and that 280% more customer responded in our offers."
        ],
        [
            "But the most astonishing result was cost reduction.",
            "2010 campaign and communication costs reduced by 78% from 1 million euro, spending 9 in 2009.",
            "Prius Bank reduced that amount to 228 thousand Euro, having much better results than 2009."
        ],
        [
            "In my opinion, the greatest achievement is that we keep having satisfied customers.",
            "We try hard to know them to understand their needs through analytics and to offer them a product or a service.",
            "They want to show.",
            "People get in formation and offers that are interested in buy products or services fulfill their needs.",
            "And finally mutual trust is established."
        ],
        [
            "But in the end of my presentation, I would like to emphasize to SuccessFactors of our new strategy.",
            "First of all, pairs banks top management adopt customer centric model at the extent of segmentation advantages and supported.",
            "Business units take advantages from the full utilization of banks, customer centric platforms and applications.",
            "Our division contributes with customer centric campaign management planning, targeted customer selection, music propensity models and selection of most appropriate channel mix for its campaign using analytics.",
            "And finally, our branch colleagues have better results with Perez Bank new communication model.",
            "Through a new design, personal tool for every brands employee and of course through direct implementation.",
            "After filtering of course of information and experience that we receive from them.",
            "Every time I visit those people countrywide, I tell them that they are pariahs, banks, eyes and tears that they are our frontline and make an excellent job and always thank them for their contribution."
        ],
        [
            "I will close my presentation with our six principles for success.",
            "First, have vision.",
            "Our vision is customer in the center and we have already done a lot of things.",
            "But also we have a long distance to run second phase the truth.",
            "Feel comfortable with any status.",
            "Be modest with success and don't try to ship the dust under the carpet when things are going worse in any situation, you have the power to cope with it.",
            "Only if you accept the real facts.",
            "3rd for get numbers.",
            "I know it is a little bit odd to tell you for get numbers because I'm one person overwhelmed by numbers.",
            "But the numbers themselves cannot tell us anything.",
            "I used to set my colleagues OK.",
            "Your brands bought 1000 banking services.",
            "So what was the difference?",
            "If I told you that you bought 500 or 1500 new banking services?",
            "I mean that looking and reading number is not valuable.",
            "Important is to read behind numbers to fill numbers and the history behind them.",
            "4th fill your customer the most important.",
            "Analytics do great jobs.",
            "But we have to.",
            "Talk with our customers.",
            "Give them time to express their needs and expectations.",
            "Listen them.",
            "Stand by them.",
            "Fill their anxieties.",
            "Interested in them?",
            "Ask them for their dreams.",
            "Finally we are same with them.",
            "They are not aliens.",
            "Firstly we have to know better ourselves and then we have to understand them.",
            "Customer is inside the US.",
            "Fifth take action.",
            "Make your vision come through.",
            "And finally, 6 cooperate with your colleagues.",
            "You are not alone.",
            "Give them value.",
            "There are those who will help you in any situation.",
            "Personally I'm very proud of my colleagues.",
            "I believe they make the best and our success story comes through through teamwork."
        ],
        [
            "Thank you for graduations.",
            "Thanks, representation very nice.",
            "I have actually 2 questions.",
            "First, what software packages you use in your group?",
            "I mean, except probably so so.",
            "So what packages are using data mining packages?",
            "We use the IBM SPSS modeler.",
            "For all our data mining techniques.",
            "OK thanks and question number 2.",
            "When you implement your cross sell modeling, let's say it's credit related product lending product right so?",
            "Do you deal with compliance issues with legal issues?",
            "Is a top management is governed anything?",
            "So do you have any lending laws and some other legal issues which might prohibit you to use a mother?",
            "Or at least you have to go through governance and you know, explain why you use this variable and so on.",
            "We don't have such issues, but if you mean in our contact with customers, if we have any direct Mail, you have crossed some model you want to sell, you know credit card we have such issues, but we take into consideration or laws and compliance.",
            "I mean here in Greece if a customer don't want to contact with him, he can sign an application that he tell us.",
            "But I don't want to receive direct Mail or SMS or email and then we take into consideration his willing and we don't contact with him.",
            "OK, now I'm talking about, like you know, if you have some legal issues and fair lending laws or something in in Greece that prohibit you too, because the lending product should be distributed freely.",
            "Right now we don't have any.",
            "We don't have any legal issues.",
            "OK, thank you.",
            "Any other questions?",
            "Sydney.",
            "If I see you also wanted to ask you which channel did you find was the most effective with?",
            "Telephone sorry makes for great friends.",
            "OK so face to face, yes the most effective especially in this.",
            "The most effective channel is face to face communication and we almost give all our power to our callings and brothers because we show.",
            "From the past years that direct Mail Oracle Center, it is not show appropriate channels for the Greek consumers.",
            "OK, so all of our strength power is distributed to our Brands Store brands colleague.",
            "OK, so thank you for the talk Vassilis and my question is about the models.",
            "How do you update the models because they change overtime with new data from the customer.",
            "So how do you deal with this and also an at least from this presentation you use mainly the transaction data, but nowadays we have also feedbacks from the customers through social media and so on.",
            "So if you incorporate somehow this information.",
            "In the analysis, yes.",
            "First of all about our models.",
            "If you remember I mentioned my presentation that we always educate our models.",
            "That means that we always take into consideration new data because data are changing OK and also we run any model in predefined periods every semester, every month, every three months, etc.",
            "As for the second one, remind me what you.",
            "Yes, OK, we are not only utilized transaction data.",
            "OK, we utilize demographic data.",
            "OK, transaction data also assets, data deposits, balances of customer customer indicators such as RFM or customer lifetime value.",
            "And also we have data from customer feedback, but the true answer is that we are not utilizing them.",
            "At least at that time, 'cause we don't have any human resources in order to help us to make, for example, text mining in order to analyze and find some conclusions from customer feedback via call center or via direct Mail of for any of customer complaints.",
            "But it is in our.",
            "Plan to make text mining and to advance our analytics process process with customer feedback.",
            "Vasily fingering, you was also suggesting to use the social graph of people because if you know that one person is happy, then this happiness, let's say, is likely to propagate to other people.",
            "Or if you're happy with likely to we also, we also have all those data, but we don't utilize them, at least at that time, OK?",
            "But it is in our intention to do now.",
            "The situation is difficult in Greece and if there is some I don't know.",
            "Some change in the customer segments because of this.",
            "If you have some reason, yes, we are now in the process to.",
            "A rebuild and redesign our segments OK because we have almost two years with that eight different customer segments where the process to redesign our segmentation model.",
            "Perhaps we have to see some other customer groups because of the current situation.",
            "Probably in the first semester of 2012 we have some new segment or we have to.",
            "Delete some segment that we use.",
            "That time.",
            "So let's say thank you, Lisa Gillis, thank you for coming."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hello to everyone.",
                    "label": 0
                },
                {
                    "sent": "I would like to thank you for being here tonight.",
                    "label": 0
                },
                {
                    "sent": "My name is Vassilis Angeles and I'm from Piraeus Bank, head of customers analysis sector.",
                    "label": 1
                },
                {
                    "sent": "It's a great honor for private bank and for me of course, presenting now in the CML conference.",
                    "label": 0
                },
                {
                    "sent": "Our work in business.",
                    "label": 0
                },
                {
                    "sent": "Let's start.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here is a brief agenda of my presentation.",
                    "label": 0
                },
                {
                    "sent": "Firstly, I will make a short introduction for Piraeus Bank.",
                    "label": 0
                },
                {
                    "sent": "After that I will present you browse bank customer segmentation and cross selling model.",
                    "label": 0
                },
                {
                    "sent": "The next XX section belongs to cross model which is actually the model we use in order to utilize data and knowledge.",
                    "label": 0
                },
                {
                    "sent": "It is also essential to show you our business process concerning analytics.",
                    "label": 0
                },
                {
                    "sent": "Finally, I will quote some cases of data mining analysis that we have done in our customer data and my presentation will be ended presenting to you the benefits of customer analytics both for our bank and for our customers.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But I was Bank was born in 1916.",
                    "label": 0
                },
                {
                    "sent": "Our bank privatisation was held in 1991.",
                    "label": 0
                },
                {
                    "sent": "Since then, perhaps banks growth was extreme, absorbing other banks and merging with others.",
                    "label": 0
                },
                {
                    "sent": "During that time periods, Bank had a strong international expansion, having presence in nine different countries.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But as banks total assets were 56.6 billion euro in March 2011, where the 4th largest bank in Greece with 872 brands is both in Greece and abroad having 30,000 well trained customer setting and IT familiar employees.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We undertook tasks in retail banking development division in January 2010.",
                    "label": 0
                },
                {
                    "sent": "Our scope was to plan a strategic model that focus on developing first current and new individual customer and second banks product portfolio.",
                    "label": 1
                },
                {
                    "sent": "The target that we have to achieve goes to turn our strategy from product oriented to a customer set required and of course to contribute to the growth of retail customers.",
                    "label": 1
                },
                {
                    "sent": "Scope and Target is accomplished through our know how into first customer analysis.",
                    "label": 0
                },
                {
                    "sent": "We have done more than 50 different complete analysis using analytics.",
                    "label": 0
                },
                {
                    "sent": "Second strategic analysis like next best product, crucial ratio.",
                    "label": 1
                },
                {
                    "sent": "Customer lifetime value, RFM racist frequency, and monetary score and many more using analytics again.",
                    "label": 0
                },
                {
                    "sent": "3rd customer utilization with implementation of all commercial and communication criteria and also introducing and utilizing propensity scoring.",
                    "label": 0
                },
                {
                    "sent": "4th Administration of below.",
                    "label": 0
                },
                {
                    "sent": "The line channels such as crucial advisor which is a brads application ATM, SMS, email, banking and finally results measurement with direct adjustment in our next campaigns.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In this slide you can see perhaps bank customer structure.",
                    "label": 0
                },
                {
                    "sent": "Apart from main, indirect and historic individual, there are also private enterprises bank and do group stuff in retail banking customer base.",
                    "label": 0
                },
                {
                    "sent": "At the same time, organisations, public, non-profit institutes and financial institutes are part of our corporate banking customer base.",
                    "label": 0
                },
                {
                    "sent": "My sector focused on main individuals and all new main individuals that were coming to our bank which are more than two million distant customers.",
                    "label": 1
                },
                {
                    "sent": "In order to prepare segmentation.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We took into consideration the following criteria of customer segments market and commercial potential.",
                    "label": 1
                },
                {
                    "sent": "Clear definition and measurement.",
                    "label": 0
                },
                {
                    "sent": "It is a matter of great importance to define clearly a group of customers.",
                    "label": 0
                },
                {
                    "sent": "For example, someone may name a customer segment such super Mom's.",
                    "label": 0
                },
                {
                    "sent": "It sounds good, but who are super Mamas?",
                    "label": 0
                },
                {
                    "sent": "Do they wear a Cape as Superman does?",
                    "label": 0
                },
                {
                    "sent": "We are a finance at least that so we have to set clear and measurable definitions when I talk about payroll customers, I have the ability to measure and distinguish them.",
                    "label": 0
                },
                {
                    "sent": "Also, capability of planning a customer centric approach and communication product portfolio increase and, of course, Piraeus bank structure.",
                    "label": 1
                },
                {
                    "sent": "For example, agricultural sector for farmers or peril sector for payroll customers.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Talking about customer segment, here are some basic measures, metrics and values that we have computed in order to have an almost complete picture with one glance.",
                    "label": 0
                },
                {
                    "sent": "Firstly, we are interested in share in total size of men, individuals, gender and relationship aids.",
                    "label": 1
                },
                {
                    "sent": "According customer Sir, we find sharing deposit and investment balances and second share in credit product balances.",
                    "label": 1
                },
                {
                    "sent": "Focusing on customer product portfolio is necessary to know first of all average active product number and average active arrangements number.",
                    "label": 0
                },
                {
                    "sent": "I give you an example to make clear the difference between product and arrangement.",
                    "label": 0
                },
                {
                    "sent": "When a customer has one Visa classic credit card and one miles and more MasterCard, then he has one product credit card but two arrangements, Visa and MasterCard.",
                    "label": 0
                },
                {
                    "sent": "As for the definition of active, we consider active an arrangement if transaction have been done on it in a default time period, which varies depending on product.",
                    "label": 0
                },
                {
                    "sent": "Also.",
                    "label": 0
                },
                {
                    "sent": "We measure launch sales.",
                    "label": 0
                },
                {
                    "sent": "The number of products.",
                    "label": 0
                },
                {
                    "sent": "Basic categories purchased by customer that date when he became our customer.",
                    "label": 0
                },
                {
                    "sent": "Cross ratio the number of products.",
                    "label": 0
                },
                {
                    "sent": "Basic categories purchased by customer in his lifetime in our bank but different from launch sales, basic products and finally, absolutely sure any additional arrangement of basic products.",
                    "label": 0
                },
                {
                    "sent": "Categories perceived by customers in his lifetime.",
                    "label": 1
                },
                {
                    "sent": "Add the last three measures, launch sales cross sell ratio an absolute ratio.",
                    "label": 0
                },
                {
                    "sent": "We take the total number of customer purchases during his relation with us.",
                    "label": 0
                },
                {
                    "sent": "RFM is an exceptional indicator for customer potential.",
                    "label": 0
                },
                {
                    "sent": "Finally, we are interested to measure our channels, users by customers and how many of them transact through brands.",
                    "label": 0
                },
                {
                    "sent": "ATM automatic automatic payment systems, Internet, iOS or EP OS.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another important metric is the number of inactive customers, namely customers with no RFM score.",
                    "label": 1
                },
                {
                    "sent": "The last six months.",
                    "label": 0
                },
                {
                    "sent": "Product portfolio composition is also significant.",
                    "label": 0
                },
                {
                    "sent": "What is the percentage of holders in time deposits in deposits in credit cards and debit cards and bank insurers?",
                    "label": 0
                },
                {
                    "sent": "And there's so many bank product categories about 50 different basic product categories, imperious Bank.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A visual sense of segments.",
                    "label": 0
                },
                {
                    "sent": "Customer distribution in whole country gives you in a glass in which areas a segment is well developed.",
                    "label": 0
                },
                {
                    "sent": "And then which is not.",
                    "label": 0
                },
                {
                    "sent": "There is a big consideration of population in Athens and Salonika.",
                    "label": 0
                },
                {
                    "sent": "Here in Greece, in our country and this concentration reflects.",
                    "label": 0
                },
                {
                    "sent": "And in an organization customer distribution as we see clearly in the side slide.",
                    "label": 0
                },
                {
                    "sent": "Attic, Athens and Salonika.",
                    "label": 0
                },
                {
                    "sent": "Which is about the 50% of our customer population.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I just got the calculation formula for four crucial ratio which takes into consideration.",
                    "label": 0
                },
                {
                    "sent": "Total number of distinct basic products ever sold to individual customer.",
                    "label": 1
                },
                {
                    "sent": "I total number of District Basic products that solve the same date with customers at the station and of course total number of distant customers with Metalation.",
                    "label": 0
                },
                {
                    "sent": "It depends on the status.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here is the calculation for the absolute ratio.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's see this water analysis for our segmentation model.",
                    "label": 0
                },
                {
                    "sent": "Strengths our customers Cedric and targeted communication banks, product portfolio utilization and aiming commercial value offers according to customer profile Profile and the needs we support and contribute to product development and I will talk about it later.",
                    "label": 1
                },
                {
                    "sent": "Weaknesses Where absence of customer centric approach product structure according to customer segments need.",
                    "label": 0
                },
                {
                    "sent": "I use the verb where because I strongly believe that we manage to diffuse our customer centric philosophy in our organization in a great manner.",
                    "label": 0
                },
                {
                    "sent": "After almost 1 1/2 year for our first step.",
                    "label": 0
                },
                {
                    "sent": "Opportunities are.",
                    "label": 1
                },
                {
                    "sent": "Customer centric approach and customer said communication term.",
                    "label": 0
                },
                {
                    "sent": "Customer and product targeted utilization and finally threats were and they still are more or less product oriented culture and mentality.",
                    "label": 0
                },
                {
                    "sent": "Financial crisis.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately my country lately become main issue for its depth and economic crisis.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It was I was looking for an enlightening picture to give you my sense.",
                    "label": 0
                },
                {
                    "sent": "What might be a problem in our relation with you?",
                    "label": 1
                },
                {
                    "sent": "I mean with our customers, I believe I found the pretty one sometimes, but things should be happened behind our back.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In order to mitigate or avoid collateral damage like the one we showing previous light, we have to become bridge for our customers.",
                    "label": 0
                },
                {
                    "sent": "My motto is let's make our customers fans of Piraeus bank proving the right of their choice.",
                    "label": 1
                },
                {
                    "sent": "Customer begins to cross the River through our breads.",
                    "label": 0
                },
                {
                    "sent": "He starts his relation with our bank that is the first stage in our coexistence which is acquisition and be measured by launch sales.",
                    "label": 0
                },
                {
                    "sent": "Now customer is in the middle of the bridge.",
                    "label": 0
                },
                {
                    "sent": "This is the most crucial period we have to make him feel strong and steady because if we don't he may feel dizzy and then search competitors.",
                    "label": 0
                },
                {
                    "sent": "In other words, help.",
                    "label": 1
                },
                {
                    "sent": "In that time we focus on customer retention.",
                    "label": 1
                },
                {
                    "sent": "Selling products crucial from our product portfolio based on their needs.",
                    "label": 1
                },
                {
                    "sent": "Customer comes to the other side of the River.",
                    "label": 0
                },
                {
                    "sent": "Now he feels safe and comfort, Rible loyalty, and we can easily increase their product portfolio.",
                    "label": 0
                },
                {
                    "sent": "Upsell.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That was our old culture, clearly product oriented.",
                    "label": 0
                },
                {
                    "sent": "But there were two basic problems with our target.",
                    "label": 0
                },
                {
                    "sent": "First, it was slightly changeable and 2nd same customers were conducted continuously.",
                    "label": 1
                },
                {
                    "sent": "Here is new culture customer centric.",
                    "label": 0
                },
                {
                    "sent": "Now we have bigger number of customers to target segmented customers.",
                    "label": 1
                },
                {
                    "sent": "So we have a better knowledge for them and their needs.",
                    "label": 0
                },
                {
                    "sent": "Not communicated customers.",
                    "label": 0
                },
                {
                    "sent": "In other words, customers banned due to our old culture and of course more clean customers.",
                    "label": 0
                },
                {
                    "sent": "Customers who don't forbid to contact with him or customers who don't have MPLS for example.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our segmentation model was implemented on July 2010 in all customer centric platforms and applications in Prius Bank.",
                    "label": 1
                },
                {
                    "sent": "We define eight different and distinct retail customer segments with more than two million unique customers.",
                    "label": 1
                },
                {
                    "sent": "We set prioritization process in order to compute the right segment for its customer taking into consideration the overall retail buying transit strategy.",
                    "label": 0
                },
                {
                    "sent": "Also, we refresh.",
                    "label": 0
                },
                {
                    "sent": "Customer segment every six months 1st of January and 1st of July.",
                    "label": 1
                },
                {
                    "sent": "But I was bank adopts basic measurements for its segment, which are recording sales, launch sales ratio, cross ratio and top seller ratio and according customer activity activities, average number of active products and average number of active arrangements.",
                    "label": 1
                },
                {
                    "sent": "Finally, thanks to analytics, we make a certain commercial value offer for its individual customer in the same time all below the Lanka bands are targeted once.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In this slide you can see a part of the front customer screen on our customer centric platform which is called eyes.",
                    "label": 1
                },
                {
                    "sent": "Our Calling brands can see in which segment customer belongs, how many active product he has and the commercial value offer for the customer.",
                    "label": 0
                },
                {
                    "sent": "Our colleagues have been well trained on our segmentation so they know the basic characteristics of its segment and how to treat any customer.",
                    "label": 0
                },
                {
                    "sent": "If there is a check mark nearby the proposed product.",
                    "label": 0
                },
                {
                    "sent": "For example here.",
                    "label": 0
                },
                {
                    "sent": "That means that is a product.",
                    "label": 0
                },
                {
                    "sent": "That the customer hears the product and it is active.",
                    "label": 0
                },
                {
                    "sent": "If there is a suitcase nearby, the proposed product that means that is a product for sale.",
                    "label": 0
                },
                {
                    "sent": "In addition, there are also indicators for resales and inactive products.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Final step represented as raw data in business and knowledge layer.",
                    "label": 0
                },
                {
                    "sent": "Consent definition of entities and their attributes.",
                    "label": 0
                },
                {
                    "sent": "Very important is to set the process for data extraction, data transformation, data cleansing and data loading.",
                    "label": 0
                },
                {
                    "sent": "Four step of priors is referred to information layer before having information representation, it is critical to manage missing values which inflict in many cases the results.",
                    "label": 0
                },
                {
                    "sent": "After the task in formation can be represented as report or graph.",
                    "label": 0
                },
                {
                    "sent": "Nowadays there are more sophisticated representation forms like kepis or visualization.",
                    "label": 0
                },
                {
                    "sent": "Next layer is the intelligence run.",
                    "label": 0
                },
                {
                    "sent": "In order to make your business intelligent, hidden formation patterns must be found using at most data mining techniques.",
                    "label": 0
                },
                {
                    "sent": "Data mining would advance intelligence in decision-making.",
                    "label": 0
                },
                {
                    "sent": "There are many practices that could help to take decision, such as advanced or predictive analytics.",
                    "label": 0
                },
                {
                    "sent": "Last layer is related with benefits and profit and that then that obtained from the whole process speaking about genes.",
                    "label": 0
                },
                {
                    "sent": "It is important to emphasize that genes are both for companies and their customers.",
                    "label": 0
                },
                {
                    "sent": "Discrete human roles are defined increase model.",
                    "label": 0
                },
                {
                    "sent": "Human factor is the innovative part of the model or roles have same importance.",
                    "label": 0
                },
                {
                    "sent": "But two of them are most crucial.",
                    "label": 0
                },
                {
                    "sent": "Those roles are.",
                    "label": 0
                },
                {
                    "sent": "Customer customer is the initial and better data source.",
                    "label": 0
                },
                {
                    "sent": "Any customer could be internal organization stuff or external customer transactions produce huge data volumes daily.",
                    "label": 0
                },
                {
                    "sent": "Customers buy pay, deposit order, register, allocate, cancel, navigate, have, needs, have opinions, work, leave Mary study and make many other actions that have new data production.",
                    "label": 0
                },
                {
                    "sent": "Or current data transformation as results at the same time customers are recipient of knowledge that benefits from cross process.",
                    "label": 0
                },
                {
                    "sent": "Analyst analyst must be qualified with business process knowledge and data manipulation skills.",
                    "label": 0
                },
                {
                    "sent": "I this stuff.",
                    "label": 0
                },
                {
                    "sent": "I think people contribution is necessary because they are the most appropriate to design in cooperation with business analysts.",
                    "label": 0
                },
                {
                    "sent": "That data repository and implement it.",
                    "label": 1
                },
                {
                    "sent": "Also they could help in the ETL process design and it's automated operation sales departments.",
                    "label": 0
                },
                {
                    "sent": "Coburn Sales Department receiving formation about crucial metrics via different systems like MI, SRM, etc.",
                    "label": 0
                },
                {
                    "sent": "In addition, they received clearance standing formation for their customers in order to plan.",
                    "label": 0
                },
                {
                    "sent": "Next actions directors information received by directors.",
                    "label": 0
                },
                {
                    "sent": "Defers that information gets by Sales Department's.",
                    "label": 0
                },
                {
                    "sent": "It is not so detailed, but contributes in a safe and real presentation of business value.",
                    "label": 0
                },
                {
                    "sent": "Directors belong to Decision Makers Group.",
                    "label": 0
                },
                {
                    "sent": "Data mining or business intelligence analysts?",
                    "label": 0
                },
                {
                    "sent": "This specific analyst has to know data mining at business, intelligent techniques and methods.",
                    "label": 0
                },
                {
                    "sent": "It is the second most crucial role because he's the one who adds value in business.",
                    "label": 0
                },
                {
                    "sent": "By establishing models and patterns for hidden information.",
                    "label": 0
                },
                {
                    "sent": "Top management executive.",
                    "label": 0
                },
                {
                    "sent": "Presidents general Directors are those who take the critical decision for a company.",
                    "label": 0
                },
                {
                    "sent": "Top management is the most crucial role.",
                    "label": 0
                },
                {
                    "sent": "The foundation stone of careers.",
                    "label": 1
                },
                {
                    "sent": "If this is the starting point.",
                    "label": 0
                },
                {
                    "sent": "If they don't believe in cross capabilities, there is not chance to take part cross revolution.",
                    "label": 0
                },
                {
                    "sent": "Combining with this abstract notion, we mean all combining stuff that is responsible to execute business planet actions.",
                    "label": 0
                },
                {
                    "sent": "Companies.",
                    "label": 0
                },
                {
                    "sent": "Shareholders also participated in this notion.",
                    "label": 0
                },
                {
                    "sent": "There are those who James benefits from companies.",
                    "label": 0
                },
                {
                    "sent": "Revenues.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As we stated, top management is a key role in cross.",
                    "label": 0
                },
                {
                    "sent": "Our intention is to persuade all those leader fourcross usefulness.",
                    "label": 0
                },
                {
                    "sent": "In order to set up our data utilization philosophy in a big organization is not enough to have few visionaries somewhere and organization structure vision must be part of top management as well as faith, inspiration, and lead.",
                    "label": 0
                },
                {
                    "sent": "Leaders are the most appropriate persons to enforce rules in organisations scales.",
                    "label": 0
                },
                {
                    "sent": "Lamp example describes that need.",
                    "label": 0
                },
                {
                    "sent": "Let's assume that organizational structure is like a pyramid.",
                    "label": 0
                },
                {
                    "sent": "In the top of pyramid, our leaders top management and as we go down to the base all rows are rolled out.",
                    "label": 0
                },
                {
                    "sent": "If there is a visionary in a middle level of pyramid, at turn owns a lab only a restricted part of it's it's lightened.",
                    "label": 0
                },
                {
                    "sent": "Head of Pyramid remained darkness, but if leader turns on the lab, then light is set in whole pyramid.",
                    "label": 0
                },
                {
                    "sent": "Even the restricted part will be over light and then.",
                    "label": 0
                },
                {
                    "sent": "Top management are those who take Decissions experience emotional intelligence.",
                    "label": 0
                },
                {
                    "sent": "Scientific knowledge is valuable tools for decision-making.",
                    "label": 0
                },
                {
                    "sent": "Krios is an added value.",
                    "label": 0
                },
                {
                    "sent": "Our model can verify facts and assumptions and support decision making.",
                    "label": 0
                },
                {
                    "sent": "In addition, crews can fill parts of decision puzzle, importing new and uncovered information.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Business process now.",
                    "label": 0
                },
                {
                    "sent": "Our business process according.",
                    "label": 0
                },
                {
                    "sent": "Analytics is presented in that slide.",
                    "label": 0
                },
                {
                    "sent": "When we receive a business case, first of all think possible solutions and Secondly, think data.",
                    "label": 0
                },
                {
                    "sent": "Our process, as you can see, start with modeling and then pass through execution and model suitability check.",
                    "label": 0
                },
                {
                    "sent": "In many cases we have to execute many times our models changing slightly or heavily our parameters.",
                    "label": 0
                },
                {
                    "sent": "When we are sure and say for our model, we publish and distribute results in this possible units that executives who are those who take decisions and root actions.",
                    "label": 0
                },
                {
                    "sent": "A short period after actions, we evaluate the results of them benefits, profit loss, etc.",
                    "label": 0
                },
                {
                    "sent": "And we decide if there is a need for modular design.",
                    "label": 0
                },
                {
                    "sent": "Finally, we do get our model with current data.",
                    "label": 0
                },
                {
                    "sent": "That process consists the notion of constant analytics modeling repetition in predefined periods.",
                    "label": 1
                },
                {
                    "sent": "For example, such an analytics model.",
                    "label": 0
                },
                {
                    "sent": "It certain analysis.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And now let's see some cases of that.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Mining analysis.",
                    "label": 0
                },
                {
                    "sent": "The first data mining analysis case concerns customer segmentation and it is called understanding pariahs bank consumers.",
                    "label": 0
                },
                {
                    "sent": "Please notice that we talk about consumers and not customers.",
                    "label": 0
                },
                {
                    "sent": "We use analytics to identify our customers preferences based mainly on the means of payment they prefer most.",
                    "label": 1
                },
                {
                    "sent": "Intrasexual channels they use more.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our scope was to segment our entire customer base in order to find the best communication.",
                    "label": 1
                },
                {
                    "sent": "Chandler or combination of channels suggest better ways to control and perform their transactions.",
                    "label": 1
                },
                {
                    "sent": "Locate shopping carriers they visit often and examine whether or not it worth opening a seltzer brands.",
                    "label": 0
                },
                {
                    "sent": "We analyze aerial case 5 big shopping trends of our consumer customers.",
                    "label": 0
                },
                {
                    "sent": "In the Mall of Athens.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The next data mining analysis case concerns also customer segmentation and it is called allocate the next best product for its customer.",
                    "label": 0
                },
                {
                    "sent": "I think that the next best product is a familiar term to some of you.",
                    "label": 0
                },
                {
                    "sent": "We segmented our customers using analytics based on their life states, gender, location of residence, duration of being active customers.",
                    "label": 1
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We found 48 different customer segments for each segment.",
                    "label": 1
                },
                {
                    "sent": "We defined the sequence of product purchase.",
                    "label": 0
                },
                {
                    "sent": "Now we have available more than 45,000 rules to define which is the next best product for its customer.",
                    "label": 1
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This data mining analysis case.",
                    "label": 0
                },
                {
                    "sent": "Concerns product development and it is called the regular saver.",
                    "label": 1
                },
                {
                    "sent": "We built we designed a new product based on customer behavior.",
                    "label": 1
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our scope was to utilize customer data using analytics to develop new deposit product with the goal of increasing banks market share and assets and of course achieving new customer acquisition.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm glad to say that a new saving account called Borrow, which mean in English I can launch from Piraeus Bank on March 2011.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, this data mining analysis case concerns product development and it is called frequent traveler.",
                    "label": 0
                },
                {
                    "sent": "Again, we build, we design a new product based on customer behavior.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our scope was to utilize customer data using analytics to develop new insurance product, aiming to attract our traveler customers.",
                    "label": 1
                },
                {
                    "sent": "In addition, offer it as an extra service to our high value bank customers, free of charge.",
                    "label": 1
                },
                {
                    "sent": "Our product development analysis is studied now by Paris Bank responsible Bank.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sure's Department.",
                    "label": 0
                },
                {
                    "sent": "The last data mining analysis case concerns customer behavior and it is called focusing on customer deposit behave.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The scope of this case was to utilize data using analytics to understand trends and patterns in any customers.",
                    "label": 1
                },
                {
                    "sent": "Overall deposit balance change and categorize them in distinct groups.",
                    "label": 1
                },
                {
                    "sent": "At this, running to our commercial offer, we have the ability to strengthen our customer commercial approach.",
                    "label": 1
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In this slide you can see a part of the front customers cream on our customer centric platform which is called ties.",
                    "label": 0
                },
                {
                    "sent": "And our colleague in brands can see customer deposit behavior with.",
                    "label": 1
                },
                {
                    "sent": "Words.",
                    "label": 0
                },
                {
                    "sent": "Graphs.",
                    "label": 0
                },
                {
                    "sent": "And assets.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The audience line in the graph shows deposits.",
                    "label": 0
                },
                {
                    "sent": "Closing balance is progress for the last seven months.",
                    "label": 1
                },
                {
                    "sent": "The blue line in the graph shows average deposit balances progress for the last seven months.",
                    "label": 1
                },
                {
                    "sent": "Amount of 743 euro in the is the total semester deposit chains and 54.04% is the percentage of semester deposit change.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's now see the benef.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "The point is to make.",
                    "label": 0
                },
                {
                    "sent": "The right offer.",
                    "label": 0
                },
                {
                    "sent": "To the right customer.",
                    "label": 0
                },
                {
                    "sent": "Via the right channel.",
                    "label": 0
                },
                {
                    "sent": "At the right time.",
                    "label": 0
                },
                {
                    "sent": "Then you can achieve to reduce advertising or communication cost, reduce valuable human hours, do better sales and succeed better result.",
                    "label": 1
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "Benefits for our bank are the following.",
                    "label": 0
                },
                {
                    "sent": "Increased core acceleracers improved response ratios on marketing campaigns cost and time savings, improved customer satisfaction and retention.",
                    "label": 1
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "After the implementation of customer segmentation and commercial approach on July 2010, we closed 2010 with 3% degrees in the average number of active products.",
                    "label": 1
                },
                {
                    "sent": "An almost 12% increase in the average number of active arrangements.",
                    "label": 0
                },
                {
                    "sent": "And all those numbers were succeeded only in a period of five and a half months.",
                    "label": 0
                },
                {
                    "sent": "And in a very difficult timing where the economic environment was getting worse and worse.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When weather took tasks in retail banking, development division, we set our target concerning below the land cabins.",
                    "label": 0
                },
                {
                    "sent": "It is obvious that the response rates from past years were not satisfactory.",
                    "label": 0
                },
                {
                    "sent": "Another issue was the mass campaign targeting, which probably make a number of our customers not to pay attention in our Contacts anymore.",
                    "label": 0
                },
                {
                    "sent": "Where is the bar high?",
                    "label": 0
                },
                {
                    "sent": "Setting a target four point 1% response ratio and total number of communicated customers 7700 thousand customers.",
                    "label": 0
                },
                {
                    "sent": "It would be the first time that Perez Bank would overtake 4%.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Results exceeded our expectation.",
                    "label": 0
                },
                {
                    "sent": "We succeed 8.9% response ratio in all below the Lanka bans through any channel brands.",
                    "label": 0
                },
                {
                    "sent": "8:00 PM call center SMS, banking direct Mail.",
                    "label": 0
                },
                {
                    "sent": "2010 results was 536% better than 2009 and it is worth to note that we achieve 117% better result that than our predefined target.",
                    "label": 1
                },
                {
                    "sent": "Another in currency issue is that we managed to conduct with 41% less customers than 2009 and that 280% more customer responded in our offers.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But the most astonishing result was cost reduction.",
                    "label": 1
                },
                {
                    "sent": "2010 campaign and communication costs reduced by 78% from 1 million euro, spending 9 in 2009.",
                    "label": 1
                },
                {
                    "sent": "Prius Bank reduced that amount to 228 thousand Euro, having much better results than 2009.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In my opinion, the greatest achievement is that we keep having satisfied customers.",
                    "label": 0
                },
                {
                    "sent": "We try hard to know them to understand their needs through analytics and to offer them a product or a service.",
                    "label": 0
                },
                {
                    "sent": "They want to show.",
                    "label": 0
                },
                {
                    "sent": "People get in formation and offers that are interested in buy products or services fulfill their needs.",
                    "label": 1
                },
                {
                    "sent": "And finally mutual trust is established.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But in the end of my presentation, I would like to emphasize to SuccessFactors of our new strategy.",
                    "label": 0
                },
                {
                    "sent": "First of all, pairs banks top management adopt customer centric model at the extent of segmentation advantages and supported.",
                    "label": 0
                },
                {
                    "sent": "Business units take advantages from the full utilization of banks, customer centric platforms and applications.",
                    "label": 1
                },
                {
                    "sent": "Our division contributes with customer centric campaign management planning, targeted customer selection, music propensity models and selection of most appropriate channel mix for its campaign using analytics.",
                    "label": 1
                },
                {
                    "sent": "And finally, our branch colleagues have better results with Perez Bank new communication model.",
                    "label": 0
                },
                {
                    "sent": "Through a new design, personal tool for every brands employee and of course through direct implementation.",
                    "label": 1
                },
                {
                    "sent": "After filtering of course of information and experience that we receive from them.",
                    "label": 0
                },
                {
                    "sent": "Every time I visit those people countrywide, I tell them that they are pariahs, banks, eyes and tears that they are our frontline and make an excellent job and always thank them for their contribution.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I will close my presentation with our six principles for success.",
                    "label": 1
                },
                {
                    "sent": "First, have vision.",
                    "label": 0
                },
                {
                    "sent": "Our vision is customer in the center and we have already done a lot of things.",
                    "label": 0
                },
                {
                    "sent": "But also we have a long distance to run second phase the truth.",
                    "label": 0
                },
                {
                    "sent": "Feel comfortable with any status.",
                    "label": 0
                },
                {
                    "sent": "Be modest with success and don't try to ship the dust under the carpet when things are going worse in any situation, you have the power to cope with it.",
                    "label": 0
                },
                {
                    "sent": "Only if you accept the real facts.",
                    "label": 0
                },
                {
                    "sent": "3rd for get numbers.",
                    "label": 0
                },
                {
                    "sent": "I know it is a little bit odd to tell you for get numbers because I'm one person overwhelmed by numbers.",
                    "label": 0
                },
                {
                    "sent": "But the numbers themselves cannot tell us anything.",
                    "label": 0
                },
                {
                    "sent": "I used to set my colleagues OK.",
                    "label": 0
                },
                {
                    "sent": "Your brands bought 1000 banking services.",
                    "label": 0
                },
                {
                    "sent": "So what was the difference?",
                    "label": 0
                },
                {
                    "sent": "If I told you that you bought 500 or 1500 new banking services?",
                    "label": 0
                },
                {
                    "sent": "I mean that looking and reading number is not valuable.",
                    "label": 0
                },
                {
                    "sent": "Important is to read behind numbers to fill numbers and the history behind them.",
                    "label": 0
                },
                {
                    "sent": "4th fill your customer the most important.",
                    "label": 0
                },
                {
                    "sent": "Analytics do great jobs.",
                    "label": 0
                },
                {
                    "sent": "But we have to.",
                    "label": 0
                },
                {
                    "sent": "Talk with our customers.",
                    "label": 0
                },
                {
                    "sent": "Give them time to express their needs and expectations.",
                    "label": 0
                },
                {
                    "sent": "Listen them.",
                    "label": 0
                },
                {
                    "sent": "Stand by them.",
                    "label": 0
                },
                {
                    "sent": "Fill their anxieties.",
                    "label": 0
                },
                {
                    "sent": "Interested in them?",
                    "label": 0
                },
                {
                    "sent": "Ask them for their dreams.",
                    "label": 0
                },
                {
                    "sent": "Finally we are same with them.",
                    "label": 0
                },
                {
                    "sent": "They are not aliens.",
                    "label": 0
                },
                {
                    "sent": "Firstly we have to know better ourselves and then we have to understand them.",
                    "label": 0
                },
                {
                    "sent": "Customer is inside the US.",
                    "label": 0
                },
                {
                    "sent": "Fifth take action.",
                    "label": 0
                },
                {
                    "sent": "Make your vision come through.",
                    "label": 0
                },
                {
                    "sent": "And finally, 6 cooperate with your colleagues.",
                    "label": 1
                },
                {
                    "sent": "You are not alone.",
                    "label": 0
                },
                {
                    "sent": "Give them value.",
                    "label": 0
                },
                {
                    "sent": "There are those who will help you in any situation.",
                    "label": 0
                },
                {
                    "sent": "Personally I'm very proud of my colleagues.",
                    "label": 0
                },
                {
                    "sent": "I believe they make the best and our success story comes through through teamwork.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you for graduations.",
                    "label": 0
                },
                {
                    "sent": "Thanks, representation very nice.",
                    "label": 0
                },
                {
                    "sent": "I have actually 2 questions.",
                    "label": 0
                },
                {
                    "sent": "First, what software packages you use in your group?",
                    "label": 0
                },
                {
                    "sent": "I mean, except probably so so.",
                    "label": 0
                },
                {
                    "sent": "So what packages are using data mining packages?",
                    "label": 0
                },
                {
                    "sent": "We use the IBM SPSS modeler.",
                    "label": 0
                },
                {
                    "sent": "For all our data mining techniques.",
                    "label": 0
                },
                {
                    "sent": "OK thanks and question number 2.",
                    "label": 0
                },
                {
                    "sent": "When you implement your cross sell modeling, let's say it's credit related product lending product right so?",
                    "label": 0
                },
                {
                    "sent": "Do you deal with compliance issues with legal issues?",
                    "label": 0
                },
                {
                    "sent": "Is a top management is governed anything?",
                    "label": 0
                },
                {
                    "sent": "So do you have any lending laws and some other legal issues which might prohibit you to use a mother?",
                    "label": 0
                },
                {
                    "sent": "Or at least you have to go through governance and you know, explain why you use this variable and so on.",
                    "label": 0
                },
                {
                    "sent": "We don't have such issues, but if you mean in our contact with customers, if we have any direct Mail, you have crossed some model you want to sell, you know credit card we have such issues, but we take into consideration or laws and compliance.",
                    "label": 0
                },
                {
                    "sent": "I mean here in Greece if a customer don't want to contact with him, he can sign an application that he tell us.",
                    "label": 0
                },
                {
                    "sent": "But I don't want to receive direct Mail or SMS or email and then we take into consideration his willing and we don't contact with him.",
                    "label": 0
                },
                {
                    "sent": "OK, now I'm talking about, like you know, if you have some legal issues and fair lending laws or something in in Greece that prohibit you too, because the lending product should be distributed freely.",
                    "label": 0
                },
                {
                    "sent": "Right now we don't have any.",
                    "label": 0
                },
                {
                    "sent": "We don't have any legal issues.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you.",
                    "label": 0
                },
                {
                    "sent": "Any other questions?",
                    "label": 0
                },
                {
                    "sent": "Sydney.",
                    "label": 0
                },
                {
                    "sent": "If I see you also wanted to ask you which channel did you find was the most effective with?",
                    "label": 0
                },
                {
                    "sent": "Telephone sorry makes for great friends.",
                    "label": 0
                },
                {
                    "sent": "OK so face to face, yes the most effective especially in this.",
                    "label": 0
                },
                {
                    "sent": "The most effective channel is face to face communication and we almost give all our power to our callings and brothers because we show.",
                    "label": 0
                },
                {
                    "sent": "From the past years that direct Mail Oracle Center, it is not show appropriate channels for the Greek consumers.",
                    "label": 0
                },
                {
                    "sent": "OK, so all of our strength power is distributed to our Brands Store brands colleague.",
                    "label": 0
                },
                {
                    "sent": "OK, so thank you for the talk Vassilis and my question is about the models.",
                    "label": 0
                },
                {
                    "sent": "How do you update the models because they change overtime with new data from the customer.",
                    "label": 0
                },
                {
                    "sent": "So how do you deal with this and also an at least from this presentation you use mainly the transaction data, but nowadays we have also feedbacks from the customers through social media and so on.",
                    "label": 0
                },
                {
                    "sent": "So if you incorporate somehow this information.",
                    "label": 0
                },
                {
                    "sent": "In the analysis, yes.",
                    "label": 0
                },
                {
                    "sent": "First of all about our models.",
                    "label": 0
                },
                {
                    "sent": "If you remember I mentioned my presentation that we always educate our models.",
                    "label": 0
                },
                {
                    "sent": "That means that we always take into consideration new data because data are changing OK and also we run any model in predefined periods every semester, every month, every three months, etc.",
                    "label": 0
                },
                {
                    "sent": "As for the second one, remind me what you.",
                    "label": 0
                },
                {
                    "sent": "Yes, OK, we are not only utilized transaction data.",
                    "label": 0
                },
                {
                    "sent": "OK, we utilize demographic data.",
                    "label": 0
                },
                {
                    "sent": "OK, transaction data also assets, data deposits, balances of customer customer indicators such as RFM or customer lifetime value.",
                    "label": 0
                },
                {
                    "sent": "And also we have data from customer feedback, but the true answer is that we are not utilizing them.",
                    "label": 0
                },
                {
                    "sent": "At least at that time, 'cause we don't have any human resources in order to help us to make, for example, text mining in order to analyze and find some conclusions from customer feedback via call center or via direct Mail of for any of customer complaints.",
                    "label": 0
                },
                {
                    "sent": "But it is in our.",
                    "label": 0
                },
                {
                    "sent": "Plan to make text mining and to advance our analytics process process with customer feedback.",
                    "label": 0
                },
                {
                    "sent": "Vasily fingering, you was also suggesting to use the social graph of people because if you know that one person is happy, then this happiness, let's say, is likely to propagate to other people.",
                    "label": 0
                },
                {
                    "sent": "Or if you're happy with likely to we also, we also have all those data, but we don't utilize them, at least at that time, OK?",
                    "label": 0
                },
                {
                    "sent": "But it is in our intention to do now.",
                    "label": 0
                },
                {
                    "sent": "The situation is difficult in Greece and if there is some I don't know.",
                    "label": 0
                },
                {
                    "sent": "Some change in the customer segments because of this.",
                    "label": 0
                },
                {
                    "sent": "If you have some reason, yes, we are now in the process to.",
                    "label": 0
                },
                {
                    "sent": "A rebuild and redesign our segments OK because we have almost two years with that eight different customer segments where the process to redesign our segmentation model.",
                    "label": 0
                },
                {
                    "sent": "Perhaps we have to see some other customer groups because of the current situation.",
                    "label": 0
                },
                {
                    "sent": "Probably in the first semester of 2012 we have some new segment or we have to.",
                    "label": 0
                },
                {
                    "sent": "Delete some segment that we use.",
                    "label": 0
                },
                {
                    "sent": "That time.",
                    "label": 0
                },
                {
                    "sent": "So let's say thank you, Lisa Gillis, thank you for coming.",
                    "label": 1
                }
            ]
        }
    }
}