{
    "id": "f4pjm6h2gh42fwwkqubzi5wb5ocbo2p6",
    "title": "Bio-integrated micro-laser particles for sensing, imaging and cell barcoding",
    "info": {
        "author": [
            "Matjaž Humar, Institut \"Jožef Stefan\""
        ],
        "published": "July 9, 2018",
        "recorded": "May 2018",
        "category": [
            "Top->Chemistry",
            "Top->Biology",
            "Top->Physics"
        ]
    },
    "url": "http://videolectures.net/biophysics2018_humar_micro_laser/",
    "segmentation": [
        [
            "Thank you, I still can't.",
            "Thanks for the organizers for giving me the opportunity to speak at such a nice conference, so I will talk about very special exotic type of lasers so."
        ],
        [
            "Julie's a laser you think of a box sitting on your left bench and you use for different in purposes but here the idea is to put the."
        ],
        [
            "Are the box into the biological system, or more exactly into cells and tissues?",
            "So usually."
        ],
        [
            "To study cells, different probes are used.",
            "Most notably fluorescent probes.",
            "But the problem of."
        ],
        [
            "Um, this props is that usually they have."
        ],
        [
            "Quite broad emission and the idea is now instead of using molecular fluorescent molecules or quantum dots to use lasers to put inside and lasers.",
            "This micro lasers have very sharp emission lines, so this would enable very precise sensing, multiplexing, barcoding and so on."
        ],
        [
            "So to remind you what a laser is composed of.",
            "So first we have laser cavity.",
            "So usually it's like 2 mirrors that confine the light and produce the resonances.",
            "Then we have a gain medium which.",
            "Amplifies the light, and in our case this will be a die, so it's DI laser and the third thing that you need is source of energy.",
            "So so a pump pump source and the idea is to make all these components out of biological systems, biological components and integrate into biological systems."
        ],
        [
            "So usually what most of us do is that we have some some kind of bad Tronic device, and on the other hand we have a biological system that we study and these things are usually separated.",
            "So one example would be for example a microscope and cell so you don't put a microscope into the cell, don't you?",
            "But this is what we do here and we have a laser and in this case a peak and we want to integrate this and this is so called.",
            "Bio integrated photonics and how we can do that.",
            "We can put a peek into the laser.",
            "Actually its biggest.",
            "I'm little bit too big, but for simply computer cell into a laser and and make a component of the laser itself.",
            "The way around you can put laser insight, biological systems, or the third case, which is the most interesting is can we really make lasers out of completely biological life life materials?",
            "So."
        ],
        [
            "Why we want to do this?",
            "So there are several reasons.",
            "One is that if you we couple this to systems, we could get much better sensing because the two systems are integrated within each other and.",
            "So also in future like it could be used for more targeted medical treatments.",
            "So it's a two way interaction.",
            "So the other thing is that you could actually make life lasers that divide self, reproduce selfheal adept and so on.",
            "And the third more like science fiction is knew human robot interfaces.",
            "And in this talk I will show you almost all of these things.",
            "Except maybe for human cyber cable.",
            "So you pick pick Seiberg."
        ],
        [
            "So before our work there were several other bio lasers that people showed, for example.",
            "In this paper, in the same left that I was also working that they put a cell inside the laser cavity and the cell produces green fluorescent protein and so it's a biological gain material, but the cavity is outside and is not not natural one, so people also inserted different photonic props like photonic crystals inside cells.",
            "Or this is another example droplet with active fluorescent bacteria and this also works as a laser and another interesting one is actually if you just infiltrate a dye into tissues you can make so called random lasers.",
            "So this has been done before."
        ],
        [
            "For my PhD thesis I was working on a small laser so called Whispering Gallery mode lasers.",
            "So in this case you have a spherical object with refractive index larger than the outside, and the light is trapped inside and circulates due to total internal reflection, and this makes a small laser cavity.",
            "And here inside you also have a fluorescent dye which provides gain for the lasing, and the idea was to actually implement this.",
            "This kind of lasers into cells.",
            "And this was published in this nice paper and I will be talking about this and continuation of this work."
        ],
        [
            "Six is the first experiment was quite easy.",
            "Actually I didn't know anything about biology.",
            "Then I still don't don't know much, but I just put fluorescent polystyrene beads to cells and so surprised that these cells sexually uptake these bits.",
            "And this picture actually lasers because they have died inside and they go inside the cells and."
        ],
        [
            "I know it's very simple optical setup.",
            "What you do is you have a past laser until you pump from outside this.",
            "Beats inside cells and you collect light to the camera and spectrometer, and these are typical Spectra of the lasing below the lasing threshold and above you see this very sharp narrow lines and usually that's just the dial would be this very broad background.",
            "And we also have a lasing threshold, so it's not nonlinear behavior of the output intensity."
        ],
        [
            "What can we do with this?",
            "Lasers inside cells?",
            "So this for example one silent there this lasers inside and we took hyperspectral fluorescence image and here we play in wavelength but this is not the time but wavelength and you can see this lasers blinking.",
            "Why?",
            "Because each of them has a slightly different spectrum, so this is this sharp peaks so that it blinks in the wavelength and what you can do is to fit this.",
            "Spectra to model and actually you can get out the diameter of the beat very precisely of the laser, and this precision is huge.",
            "Is below one nanometer.",
            "So this bit is 1.5 Micron cents.",
            "And you can do."
        ],
        [
            "This for a lot of cells with lasers insight and for each.",
            "For each laser you get the size.",
            "So why we want to do get very precisely the size?",
            "The."
        ],
        [
            "And the reason is for cell barcoding.",
            "So for some experiments, it would be very nice to be able to track cells during the whole experiment.",
            "So to put a bar code and address to the cell, but with dice you are very limited to the number that you can.",
            "You can barcode here with with lasers, because we can measure very precisely the big diameter, and we have different polydisperse lasers we can have.",
            "For example, in this range that we have 8 from 12 microns, the bit size.",
            "We have already 2000 individual barcodes and we can even increase this by using by multiplexing different colors.",
            "Also, maybe you can we can use 10 different floors and ice and we already have 20,000 unique combinations and even more as you see here this SEM image.",
            "The cells also up take a lot of these lasers, so if you calculate that each server updates takes 3 lasers for example.",
            "You could you can calculate easily that the number of combinations of the barcodes is 10 to the 12.",
            "So this is a huge number.",
            "This is the same order of magnitude as cells in our body.",
            "So in principle you could take each individual cell uniquely in our body.",
            "Now the question is how to do this and how to read out and so on.",
            "But there is option to do this.",
            "Um?",
            "So another."
        ],
        [
            "Um?",
            "So this was elected erratically, that it's possible to take, but then we try it also in microfluidics to to really show that this is possible to take cells.",
            "So we have a microfluidic channel and we flow the cells in One Direction and then into the other, and we try to identify them.",
            "So we were able to identify a few 100 cells.",
            "So this is, this is also possible, like in in free flowing cell to really identify.",
            "Which sells its is which."
        ],
        [
            "On another application of the cell lasers.",
            "Is a sensing so the lasers inside cells 'cause they're very precise device very sharp resonances?",
            "The letters are very sensitive to the environment, and in this case we're measuring refractive index of the environment of the cell, and we changed the similarity of the medium outside and then the cell shrink and also the reflective index changed.",
            "So this is the position of one of the laser lines.",
            "This is the wavelength.",
            "And in time when we add a little bit of sodium chloride, we see this jump in the refractive index and you can measure this very precisely the refractive index.",
            "But we are also currently working on is to functionalize the lasers, so it may be antibodies or some other molecules.",
            "So we could do also very very precise real time sensing within cells.",
            "With this this lasers."
        ],
        [
            "Another type of lasers that we also showed this by injecting oil droplet inside cells, so the previous laser that I was showing who they were solid spheres.",
            "But here we inject high index oil insight with a very small pee pad.",
            "There confocal images of of the oil droplets inside, and these are also then works as a laser so that the difference between the solitaire."
        ],
        [
            "This is that the droplets are soft and then can be deformed within the cell due to intracellular forces, and if such a laser deforms then the spectrum the output spectrum changes.",
            "So some modes that are previously degenerate in a spherical laser are not anymore.",
            "They generate and you get some laser line splitting from the disputing you can approximate approximately calculate out the.",
            "The formation of the droplet and then back recalculate the forces within cell and you can do this life cell.",
            "You can see in time how how the force changes within the cell and sensitivity is also very good is for typical newtons per square Micron and this is one of the few methods that you can actually measure the force directly within cell because most of methods are to measure forces cell acting on some.",
            "External media."
        ],
        [
            "And then also I was showing you artificial laser cavities but actually we have find out found out that adipocyte fat cells they already contain lipid droplets and this lipid droplets are actually natural laser cavities and you just put a little bit of dye to the to the cells and to excite them and to see this very nice lasing.",
            "Also from from the adipocytes and this could be used for very precise measurement of.",
            "The size, so how that's the size changes down to nanometer precision."
        ],
        [
            "The other thing is that we tried this also in pig tissue, so adipocyte tissue.",
            "Just first I injected inside a little bit of dye and then I go with the optical fiber to pump and collect back the light and this this cells within tissue deposit issue.",
            "They emit laser light and we can see very nice the spectrum of this light coming out of the cells."
        ],
        [
            "So this is like science fiction.",
            "But reality is that we generated light from from fat, not from the ice.",
            "So next time you go to the gym, you can say you I will get rid of a little bit of lasers because.",
            "You can lasers here.",
            "Um?"
        ],
        [
            "So this cat are huge media impact and also in the scientific community.",
            "So it's like really interesting quirk also to the general public.",
            "Um so."
        ],
        [
            "What we have done more continuation of this.",
            "We want to implement these lasers like really in the human body and that's why we made also lasers out of materials that are already approved for medical use.",
            "And this is example lasers that are made from PLG and PLA.",
            "These are polymers that are used for medical implants.",
            "And in the same way you can make small laser sent.",
            "This lasers are also then completely bio compatible and biodegradable so they will stay inside your body for four weeks or months and then the great without any side effects.",
            "Um?"
        ],
        [
            "We we actually also implanted like in science fiction, implanted also in the eye just to see if it works in an.",
            "Also this this tissue and this is also inside blood.",
            "So this is our laser.",
            "These are red blood cells and emission from from this laser.",
            "So this kind of lasers could be used in future for like direct diagnosis inside the blood because they are very sensitive to the environment."
        ],
        [
            "Another thing that we have done is to implant these lasers.",
            "This biodegradable lasers inside skin and this is actually just we just used.",
            "This the two gun.",
            "But instead of using like normal in tattoo ink, used the dispersion of lasers and this laser go into the skin and you can make different tattoos out of this.",
            "Now if you look at such a laser or below the skin, you can actually not see the individual lasers because of scattering, but if you take a Spectra, you can still see this sharp lines coming out.",
            "So for example for for like diagnosis it's very nice because you can still get information out of that issue even though the laser is very deep insight and you cannot see the image of the laser and this in future could be could be used like you have.",
            "The two major functional laser sent you just with the light you can.",
            "Measure some parameters like glucose or something like that within without taking drawing blood."
        ],
        [
            "Under the type of laser that we have shot.",
            "So then I was talking about this whispering Gallery mode laser that you have a droplet and the light circulates inside.",
            "But if you use liquid crystals were exactly cholesteric liquid crystal.",
            "This molecules Orient in like Helix and you get a periodic periodic structure.",
            "Here is actually a droplet with nice radial periodic structure and this periodic structure can be used as a DFB distributed.",
            "Feedback laser it's a photonic crystal.",
            "In this case we have lasing.",
            "Single mode lasing coming from the center of the laser and we have shown this kind of small lasers some time ago, but."
        ],
        [
            "And I think is that you can make this product structures and so lasers from cholesterol derivates.",
            "And yeah, clustered elevates and you can see this very nice.",
            "Single mode lasing from such such lasers and because we have cholesterol already present on our bodies like.",
            "In principle bio bio compatible RAM, biodegradable and this lasers are very sensitive to the temperature, so in principle could be used for for example for measuring temperature within within body or.",
            "Cells also."
        ],
        [
            "So we're talking about laser cavities, so we have made biological biodegradable natural laser cavities, So what about the gain material?",
            "So till now all the material with some external died that we supplied to the to the cells, but actually we can also use."
        ],
        [
            "GFP good impression protein as again material and as a first experiment we just quoted these beats with GFP and in the spectrum you again have this very sharp optical resonances, so it works also with GFP.",
            "And this is another example of a cell that has this kind of beat with GFP insight and this cell divides into two and actually itself.",
            "Even these lasers are quite large, they divide happily and we don't.",
            "We don't see much.",
            "Aside effects on the on the cells and if you look at the spectrum, actually we see some shifting in the wavelength when the cell divides.",
            "So there is some change in the in the volume in the refractive index.",
            "When the cell divides."
        ],
        [
            "On what we have done more is that I have shown your natural deposits are these droplets are laser cavities and also GFP.",
            "So can we combine a natural cavity, an unnatural gain material and we have used again adipocyte and we transfected done with with Fusion protein which binds to the surface of the lipid droplets.",
            "So now we have a separate self self assembly on the on the surface and cavity inside.",
            "And in the spectrum you actually can see again this optical modes inside, and this is now really life laser because his life this also has ability to sell for self healing.",
            "If your damage a little bit this it will again produce GFP and self heal and actually we photo bleached this and after some recovery it recovered some of the intensity.",
            "So it's really self healing.",
            "Live life laser."
        ],
        [
            "Um?",
            "In the same way, we can also use.",
            "Jeff, be in combination with also artificial laser.",
            "So if you inject insights, oil, high index oil droplets.",
            "In this case we also get this very sharp lasing lines."
        ],
        [
            "So we have made also gain from biological materials, So what about the third component of the laser?",
            "That's the source of energy.",
            "So can we make this biological?"
        ],
        [
            "And then biology, the source of light is of course bioluminescence by luminescence is reaction between molecules luciferin and luciferase, which is a protein.",
            "And produces light.",
            "And what we have done."
        ],
        [
            "We used this artificial.",
            "The Beats, laser cavities and we quoted outside with luciferase and put luciferin into the solution and now this images without any external light source is just a reaction of of these two chemicals and if we take Spectra we again see this very sharp.",
            "Restaurants inside this can be used again for sensing barcoding and so on, but I have to say that this is not actually a laser because we didn't go above the lasing threshold.",
            "That emission is similar to the laser.",
            "We have sharp, sharp spectral lines, but but it's not really the definition of lasing.",
            "But anyway, we also manage this without any external light source."
        ],
        [
            "And I would like to show you another use of.",
            "Laser that are integrated into biological systems so the letters could be used for imaging and Oval image Ng so so usually if you do for example fluorescent microscopy or confocal, you have like a sample with distributed fluorescent molecules, right?",
            "And you have a laser which you scan over the sample and if this is.",
            "No, just normal microscope present microscope, then the the signal intensity is linearly dependent on the input intensity.",
            "So when you scan the this laser know the directions all the molecules in this direction will have the same contribution, so will not.",
            "You will not have confocal or just just normal across copy to.",
            "The contribution will be the same for all the molecules in this direction.",
            "So the upgrade is 2 photon microscopy where the output intensities quadratically dependent on the input intensity and in this case you will have contribution just close to them to the maximum intensity of of your laser.",
            "So you will have this kind of distribution we have get slices so confocal scanning.",
            "In our case, if you use instead of molecules lasers then the lasers have this very nonlinear.",
            "Output that has threshold so below some intensity you don't have any lasing output, but above the laser threshold you steeply increase the output.",
            "And this enables very very high nonlinear microscopy, and in this case in the Z direction you have 000 and then just where you reached the threshold, then you have some signal.",
            "So we can do confocal imaging without any pinhole.",
            "Just by by using laser scanning.",
            "And we have."
        ],
        [
            "Showed this in a little bit different system.",
            "We have a nanowire, laser and quite large.",
            "Beam and we scan this beam across this nanowire and if we go close to this January, we have just fluorescent fluorescent emission.",
            "But when we overlap exactly with the nanowire, we have this sharp lasing and then again flor essence and then zero signal."
        ],
        [
            "And here are the results of this this.",
            "This is their calculations and experimental, so this is the direction there is the point spread function to intensity that we get out and just flor essence.",
            "The dashed line is very broad broad point spread function.",
            "But then if we use a laser and we go close to the lasing threshold, we see the huge increase.",
            "So in the resolution and actually this resolution depends on how close we are to the lasing threshold.",
            "And this this is this P the laser power divided by the threshold power.",
            "So their solution if you are at very low, very low power we have normal diffraction limited resolution.",
            "But if you go close to the to the.",
            "Lasing threshold we actually can increase the resolution so it's a super solution method and the increases depending on how close to the thresholds we are.",
            "It's up to six times better solution than than just diffraction limited and in experiments it's the same so you see very narrowing of the points that function when you go close to the lasing threshold.",
            "Um?"
        ],
        [
            "Yeah, with this I would like to conclude something.",
            "Everybody involved in this and funding and we have postdoc position available.",
            "If anyone is interested in working in this area and thank you for attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you, I still can't.",
                    "label": 0
                },
                {
                    "sent": "Thanks for the organizers for giving me the opportunity to speak at such a nice conference, so I will talk about very special exotic type of lasers so.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Julie's a laser you think of a box sitting on your left bench and you use for different in purposes but here the idea is to put the.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are the box into the biological system, or more exactly into cells and tissues?",
                    "label": 0
                },
                {
                    "sent": "So usually.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To study cells, different probes are used.",
                    "label": 0
                },
                {
                    "sent": "Most notably fluorescent probes.",
                    "label": 0
                },
                {
                    "sent": "But the problem of.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um, this props is that usually they have.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Quite broad emission and the idea is now instead of using molecular fluorescent molecules or quantum dots to use lasers to put inside and lasers.",
                    "label": 0
                },
                {
                    "sent": "This micro lasers have very sharp emission lines, so this would enable very precise sensing, multiplexing, barcoding and so on.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to remind you what a laser is composed of.",
                    "label": 0
                },
                {
                    "sent": "So first we have laser cavity.",
                    "label": 0
                },
                {
                    "sent": "So usually it's like 2 mirrors that confine the light and produce the resonances.",
                    "label": 0
                },
                {
                    "sent": "Then we have a gain medium which.",
                    "label": 0
                },
                {
                    "sent": "Amplifies the light, and in our case this will be a die, so it's DI laser and the third thing that you need is source of energy.",
                    "label": 0
                },
                {
                    "sent": "So so a pump pump source and the idea is to make all these components out of biological systems, biological components and integrate into biological systems.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So usually what most of us do is that we have some some kind of bad Tronic device, and on the other hand we have a biological system that we study and these things are usually separated.",
                    "label": 0
                },
                {
                    "sent": "So one example would be for example a microscope and cell so you don't put a microscope into the cell, don't you?",
                    "label": 0
                },
                {
                    "sent": "But this is what we do here and we have a laser and in this case a peak and we want to integrate this and this is so called.",
                    "label": 0
                },
                {
                    "sent": "Bio integrated photonics and how we can do that.",
                    "label": 0
                },
                {
                    "sent": "We can put a peek into the laser.",
                    "label": 0
                },
                {
                    "sent": "Actually its biggest.",
                    "label": 0
                },
                {
                    "sent": "I'm little bit too big, but for simply computer cell into a laser and and make a component of the laser itself.",
                    "label": 1
                },
                {
                    "sent": "The way around you can put laser insight, biological systems, or the third case, which is the most interesting is can we really make lasers out of completely biological life life materials?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Why we want to do this?",
                    "label": 0
                },
                {
                    "sent": "So there are several reasons.",
                    "label": 0
                },
                {
                    "sent": "One is that if you we couple this to systems, we could get much better sensing because the two systems are integrated within each other and.",
                    "label": 0
                },
                {
                    "sent": "So also in future like it could be used for more targeted medical treatments.",
                    "label": 1
                },
                {
                    "sent": "So it's a two way interaction.",
                    "label": 0
                },
                {
                    "sent": "So the other thing is that you could actually make life lasers that divide self, reproduce selfheal adept and so on.",
                    "label": 1
                },
                {
                    "sent": "And the third more like science fiction is knew human robot interfaces.",
                    "label": 0
                },
                {
                    "sent": "And in this talk I will show you almost all of these things.",
                    "label": 0
                },
                {
                    "sent": "Except maybe for human cyber cable.",
                    "label": 0
                },
                {
                    "sent": "So you pick pick Seiberg.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So before our work there were several other bio lasers that people showed, for example.",
                    "label": 0
                },
                {
                    "sent": "In this paper, in the same left that I was also working that they put a cell inside the laser cavity and the cell produces green fluorescent protein and so it's a biological gain material, but the cavity is outside and is not not natural one, so people also inserted different photonic props like photonic crystals inside cells.",
                    "label": 0
                },
                {
                    "sent": "Or this is another example droplet with active fluorescent bacteria and this also works as a laser and another interesting one is actually if you just infiltrate a dye into tissues you can make so called random lasers.",
                    "label": 0
                },
                {
                    "sent": "So this has been done before.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For my PhD thesis I was working on a small laser so called Whispering Gallery mode lasers.",
                    "label": 0
                },
                {
                    "sent": "So in this case you have a spherical object with refractive index larger than the outside, and the light is trapped inside and circulates due to total internal reflection, and this makes a small laser cavity.",
                    "label": 1
                },
                {
                    "sent": "And here inside you also have a fluorescent dye which provides gain for the lasing, and the idea was to actually implement this.",
                    "label": 0
                },
                {
                    "sent": "This kind of lasers into cells.",
                    "label": 0
                },
                {
                    "sent": "And this was published in this nice paper and I will be talking about this and continuation of this work.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Six is the first experiment was quite easy.",
                    "label": 0
                },
                {
                    "sent": "Actually I didn't know anything about biology.",
                    "label": 0
                },
                {
                    "sent": "Then I still don't don't know much, but I just put fluorescent polystyrene beads to cells and so surprised that these cells sexually uptake these bits.",
                    "label": 0
                },
                {
                    "sent": "And this picture actually lasers because they have died inside and they go inside the cells and.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I know it's very simple optical setup.",
                    "label": 0
                },
                {
                    "sent": "What you do is you have a past laser until you pump from outside this.",
                    "label": 0
                },
                {
                    "sent": "Beats inside cells and you collect light to the camera and spectrometer, and these are typical Spectra of the lasing below the lasing threshold and above you see this very sharp narrow lines and usually that's just the dial would be this very broad background.",
                    "label": 0
                },
                {
                    "sent": "And we also have a lasing threshold, so it's not nonlinear behavior of the output intensity.",
                    "label": 1
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What can we do with this?",
                    "label": 0
                },
                {
                    "sent": "Lasers inside cells?",
                    "label": 0
                },
                {
                    "sent": "So this for example one silent there this lasers inside and we took hyperspectral fluorescence image and here we play in wavelength but this is not the time but wavelength and you can see this lasers blinking.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because each of them has a slightly different spectrum, so this is this sharp peaks so that it blinks in the wavelength and what you can do is to fit this.",
                    "label": 0
                },
                {
                    "sent": "Spectra to model and actually you can get out the diameter of the beat very precisely of the laser, and this precision is huge.",
                    "label": 0
                },
                {
                    "sent": "Is below one nanometer.",
                    "label": 0
                },
                {
                    "sent": "So this bit is 1.5 Micron cents.",
                    "label": 0
                },
                {
                    "sent": "And you can do.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This for a lot of cells with lasers insight and for each.",
                    "label": 0
                },
                {
                    "sent": "For each laser you get the size.",
                    "label": 0
                },
                {
                    "sent": "So why we want to do get very precisely the size?",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the reason is for cell barcoding.",
                    "label": 0
                },
                {
                    "sent": "So for some experiments, it would be very nice to be able to track cells during the whole experiment.",
                    "label": 0
                },
                {
                    "sent": "So to put a bar code and address to the cell, but with dice you are very limited to the number that you can.",
                    "label": 0
                },
                {
                    "sent": "You can barcode here with with lasers, because we can measure very precisely the big diameter, and we have different polydisperse lasers we can have.",
                    "label": 0
                },
                {
                    "sent": "For example, in this range that we have 8 from 12 microns, the bit size.",
                    "label": 0
                },
                {
                    "sent": "We have already 2000 individual barcodes and we can even increase this by using by multiplexing different colors.",
                    "label": 1
                },
                {
                    "sent": "Also, maybe you can we can use 10 different floors and ice and we already have 20,000 unique combinations and even more as you see here this SEM image.",
                    "label": 0
                },
                {
                    "sent": "The cells also up take a lot of these lasers, so if you calculate that each server updates takes 3 lasers for example.",
                    "label": 0
                },
                {
                    "sent": "You could you can calculate easily that the number of combinations of the barcodes is 10 to the 12.",
                    "label": 1
                },
                {
                    "sent": "So this is a huge number.",
                    "label": 0
                },
                {
                    "sent": "This is the same order of magnitude as cells in our body.",
                    "label": 1
                },
                {
                    "sent": "So in principle you could take each individual cell uniquely in our body.",
                    "label": 0
                },
                {
                    "sent": "Now the question is how to do this and how to read out and so on.",
                    "label": 0
                },
                {
                    "sent": "But there is option to do this.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So another.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So this was elected erratically, that it's possible to take, but then we try it also in microfluidics to to really show that this is possible to take cells.",
                    "label": 0
                },
                {
                    "sent": "So we have a microfluidic channel and we flow the cells in One Direction and then into the other, and we try to identify them.",
                    "label": 1
                },
                {
                    "sent": "So we were able to identify a few 100 cells.",
                    "label": 0
                },
                {
                    "sent": "So this is, this is also possible, like in in free flowing cell to really identify.",
                    "label": 0
                },
                {
                    "sent": "Which sells its is which.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On another application of the cell lasers.",
                    "label": 0
                },
                {
                    "sent": "Is a sensing so the lasers inside cells 'cause they're very precise device very sharp resonances?",
                    "label": 0
                },
                {
                    "sent": "The letters are very sensitive to the environment, and in this case we're measuring refractive index of the environment of the cell, and we changed the similarity of the medium outside and then the cell shrink and also the reflective index changed.",
                    "label": 1
                },
                {
                    "sent": "So this is the position of one of the laser lines.",
                    "label": 0
                },
                {
                    "sent": "This is the wavelength.",
                    "label": 0
                },
                {
                    "sent": "And in time when we add a little bit of sodium chloride, we see this jump in the refractive index and you can measure this very precisely the refractive index.",
                    "label": 1
                },
                {
                    "sent": "But we are also currently working on is to functionalize the lasers, so it may be antibodies or some other molecules.",
                    "label": 0
                },
                {
                    "sent": "So we could do also very very precise real time sensing within cells.",
                    "label": 0
                },
                {
                    "sent": "With this this lasers.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another type of lasers that we also showed this by injecting oil droplet inside cells, so the previous laser that I was showing who they were solid spheres.",
                    "label": 0
                },
                {
                    "sent": "But here we inject high index oil insight with a very small pee pad.",
                    "label": 1
                },
                {
                    "sent": "There confocal images of of the oil droplets inside, and these are also then works as a laser so that the difference between the solitaire.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is that the droplets are soft and then can be deformed within the cell due to intracellular forces, and if such a laser deforms then the spectrum the output spectrum changes.",
                    "label": 0
                },
                {
                    "sent": "So some modes that are previously degenerate in a spherical laser are not anymore.",
                    "label": 0
                },
                {
                    "sent": "They generate and you get some laser line splitting from the disputing you can approximate approximately calculate out the.",
                    "label": 0
                },
                {
                    "sent": "The formation of the droplet and then back recalculate the forces within cell and you can do this life cell.",
                    "label": 0
                },
                {
                    "sent": "You can see in time how how the force changes within the cell and sensitivity is also very good is for typical newtons per square Micron and this is one of the few methods that you can actually measure the force directly within cell because most of methods are to measure forces cell acting on some.",
                    "label": 0
                },
                {
                    "sent": "External media.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then also I was showing you artificial laser cavities but actually we have find out found out that adipocyte fat cells they already contain lipid droplets and this lipid droplets are actually natural laser cavities and you just put a little bit of dye to the to the cells and to excite them and to see this very nice lasing.",
                    "label": 0
                },
                {
                    "sent": "Also from from the adipocytes and this could be used for very precise measurement of.",
                    "label": 0
                },
                {
                    "sent": "The size, so how that's the size changes down to nanometer precision.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The other thing is that we tried this also in pig tissue, so adipocyte tissue.",
                    "label": 0
                },
                {
                    "sent": "Just first I injected inside a little bit of dye and then I go with the optical fiber to pump and collect back the light and this this cells within tissue deposit issue.",
                    "label": 1
                },
                {
                    "sent": "They emit laser light and we can see very nice the spectrum of this light coming out of the cells.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is like science fiction.",
                    "label": 0
                },
                {
                    "sent": "But reality is that we generated light from from fat, not from the ice.",
                    "label": 0
                },
                {
                    "sent": "So next time you go to the gym, you can say you I will get rid of a little bit of lasers because.",
                    "label": 0
                },
                {
                    "sent": "You can lasers here.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this cat are huge media impact and also in the scientific community.",
                    "label": 1
                },
                {
                    "sent": "So it's like really interesting quirk also to the general public.",
                    "label": 0
                },
                {
                    "sent": "Um so.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What we have done more continuation of this.",
                    "label": 0
                },
                {
                    "sent": "We want to implement these lasers like really in the human body and that's why we made also lasers out of materials that are already approved for medical use.",
                    "label": 0
                },
                {
                    "sent": "And this is example lasers that are made from PLG and PLA.",
                    "label": 0
                },
                {
                    "sent": "These are polymers that are used for medical implants.",
                    "label": 0
                },
                {
                    "sent": "And in the same way you can make small laser sent.",
                    "label": 0
                },
                {
                    "sent": "This lasers are also then completely bio compatible and biodegradable so they will stay inside your body for four weeks or months and then the great without any side effects.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We we actually also implanted like in science fiction, implanted also in the eye just to see if it works in an.",
                    "label": 1
                },
                {
                    "sent": "Also this this tissue and this is also inside blood.",
                    "label": 0
                },
                {
                    "sent": "So this is our laser.",
                    "label": 0
                },
                {
                    "sent": "These are red blood cells and emission from from this laser.",
                    "label": 1
                },
                {
                    "sent": "So this kind of lasers could be used in future for like direct diagnosis inside the blood because they are very sensitive to the environment.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another thing that we have done is to implant these lasers.",
                    "label": 0
                },
                {
                    "sent": "This biodegradable lasers inside skin and this is actually just we just used.",
                    "label": 0
                },
                {
                    "sent": "This the two gun.",
                    "label": 0
                },
                {
                    "sent": "But instead of using like normal in tattoo ink, used the dispersion of lasers and this laser go into the skin and you can make different tattoos out of this.",
                    "label": 0
                },
                {
                    "sent": "Now if you look at such a laser or below the skin, you can actually not see the individual lasers because of scattering, but if you take a Spectra, you can still see this sharp lines coming out.",
                    "label": 0
                },
                {
                    "sent": "So for example for for like diagnosis it's very nice because you can still get information out of that issue even though the laser is very deep insight and you cannot see the image of the laser and this in future could be could be used like you have.",
                    "label": 0
                },
                {
                    "sent": "The two major functional laser sent you just with the light you can.",
                    "label": 0
                },
                {
                    "sent": "Measure some parameters like glucose or something like that within without taking drawing blood.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Under the type of laser that we have shot.",
                    "label": 0
                },
                {
                    "sent": "So then I was talking about this whispering Gallery mode laser that you have a droplet and the light circulates inside.",
                    "label": 0
                },
                {
                    "sent": "But if you use liquid crystals were exactly cholesteric liquid crystal.",
                    "label": 1
                },
                {
                    "sent": "This molecules Orient in like Helix and you get a periodic periodic structure.",
                    "label": 0
                },
                {
                    "sent": "Here is actually a droplet with nice radial periodic structure and this periodic structure can be used as a DFB distributed.",
                    "label": 0
                },
                {
                    "sent": "Feedback laser it's a photonic crystal.",
                    "label": 0
                },
                {
                    "sent": "In this case we have lasing.",
                    "label": 1
                },
                {
                    "sent": "Single mode lasing coming from the center of the laser and we have shown this kind of small lasers some time ago, but.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I think is that you can make this product structures and so lasers from cholesterol derivates.",
                    "label": 0
                },
                {
                    "sent": "And yeah, clustered elevates and you can see this very nice.",
                    "label": 0
                },
                {
                    "sent": "Single mode lasing from such such lasers and because we have cholesterol already present on our bodies like.",
                    "label": 1
                },
                {
                    "sent": "In principle bio bio compatible RAM, biodegradable and this lasers are very sensitive to the temperature, so in principle could be used for for example for measuring temperature within within body or.",
                    "label": 0
                },
                {
                    "sent": "Cells also.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we're talking about laser cavities, so we have made biological biodegradable natural laser cavities, So what about the gain material?",
                    "label": 0
                },
                {
                    "sent": "So till now all the material with some external died that we supplied to the to the cells, but actually we can also use.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "GFP good impression protein as again material and as a first experiment we just quoted these beats with GFP and in the spectrum you again have this very sharp optical resonances, so it works also with GFP.",
                    "label": 0
                },
                {
                    "sent": "And this is another example of a cell that has this kind of beat with GFP insight and this cell divides into two and actually itself.",
                    "label": 0
                },
                {
                    "sent": "Even these lasers are quite large, they divide happily and we don't.",
                    "label": 0
                },
                {
                    "sent": "We don't see much.",
                    "label": 0
                },
                {
                    "sent": "Aside effects on the on the cells and if you look at the spectrum, actually we see some shifting in the wavelength when the cell divides.",
                    "label": 0
                },
                {
                    "sent": "So there is some change in the in the volume in the refractive index.",
                    "label": 0
                },
                {
                    "sent": "When the cell divides.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On what we have done more is that I have shown your natural deposits are these droplets are laser cavities and also GFP.",
                    "label": 0
                },
                {
                    "sent": "So can we combine a natural cavity, an unnatural gain material and we have used again adipocyte and we transfected done with with Fusion protein which binds to the surface of the lipid droplets.",
                    "label": 1
                },
                {
                    "sent": "So now we have a separate self self assembly on the on the surface and cavity inside.",
                    "label": 0
                },
                {
                    "sent": "And in the spectrum you actually can see again this optical modes inside, and this is now really life laser because his life this also has ability to sell for self healing.",
                    "label": 0
                },
                {
                    "sent": "If your damage a little bit this it will again produce GFP and self heal and actually we photo bleached this and after some recovery it recovered some of the intensity.",
                    "label": 0
                },
                {
                    "sent": "So it's really self healing.",
                    "label": 0
                },
                {
                    "sent": "Live life laser.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "In the same way, we can also use.",
                    "label": 0
                },
                {
                    "sent": "Jeff, be in combination with also artificial laser.",
                    "label": 0
                },
                {
                    "sent": "So if you inject insights, oil, high index oil droplets.",
                    "label": 0
                },
                {
                    "sent": "In this case we also get this very sharp lasing lines.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we have made also gain from biological materials, So what about the third component of the laser?",
                    "label": 1
                },
                {
                    "sent": "That's the source of energy.",
                    "label": 0
                },
                {
                    "sent": "So can we make this biological?",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then biology, the source of light is of course bioluminescence by luminescence is reaction between molecules luciferin and luciferase, which is a protein.",
                    "label": 0
                },
                {
                    "sent": "And produces light.",
                    "label": 0
                },
                {
                    "sent": "And what we have done.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We used this artificial.",
                    "label": 0
                },
                {
                    "sent": "The Beats, laser cavities and we quoted outside with luciferase and put luciferin into the solution and now this images without any external light source is just a reaction of of these two chemicals and if we take Spectra we again see this very sharp.",
                    "label": 1
                },
                {
                    "sent": "Restaurants inside this can be used again for sensing barcoding and so on, but I have to say that this is not actually a laser because we didn't go above the lasing threshold.",
                    "label": 0
                },
                {
                    "sent": "That emission is similar to the laser.",
                    "label": 0
                },
                {
                    "sent": "We have sharp, sharp spectral lines, but but it's not really the definition of lasing.",
                    "label": 0
                },
                {
                    "sent": "But anyway, we also manage this without any external light source.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I would like to show you another use of.",
                    "label": 0
                },
                {
                    "sent": "Laser that are integrated into biological systems so the letters could be used for imaging and Oval image Ng so so usually if you do for example fluorescent microscopy or confocal, you have like a sample with distributed fluorescent molecules, right?",
                    "label": 0
                },
                {
                    "sent": "And you have a laser which you scan over the sample and if this is.",
                    "label": 0
                },
                {
                    "sent": "No, just normal microscope present microscope, then the the signal intensity is linearly dependent on the input intensity.",
                    "label": 0
                },
                {
                    "sent": "So when you scan the this laser know the directions all the molecules in this direction will have the same contribution, so will not.",
                    "label": 0
                },
                {
                    "sent": "You will not have confocal or just just normal across copy to.",
                    "label": 0
                },
                {
                    "sent": "The contribution will be the same for all the molecules in this direction.",
                    "label": 0
                },
                {
                    "sent": "So the upgrade is 2 photon microscopy where the output intensities quadratically dependent on the input intensity and in this case you will have contribution just close to them to the maximum intensity of of your laser.",
                    "label": 0
                },
                {
                    "sent": "So you will have this kind of distribution we have get slices so confocal scanning.",
                    "label": 0
                },
                {
                    "sent": "In our case, if you use instead of molecules lasers then the lasers have this very nonlinear.",
                    "label": 0
                },
                {
                    "sent": "Output that has threshold so below some intensity you don't have any lasing output, but above the laser threshold you steeply increase the output.",
                    "label": 0
                },
                {
                    "sent": "And this enables very very high nonlinear microscopy, and in this case in the Z direction you have 000 and then just where you reached the threshold, then you have some signal.",
                    "label": 0
                },
                {
                    "sent": "So we can do confocal imaging without any pinhole.",
                    "label": 0
                },
                {
                    "sent": "Just by by using laser scanning.",
                    "label": 0
                },
                {
                    "sent": "And we have.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Showed this in a little bit different system.",
                    "label": 0
                },
                {
                    "sent": "We have a nanowire, laser and quite large.",
                    "label": 0
                },
                {
                    "sent": "Beam and we scan this beam across this nanowire and if we go close to this January, we have just fluorescent fluorescent emission.",
                    "label": 0
                },
                {
                    "sent": "But when we overlap exactly with the nanowire, we have this sharp lasing and then again flor essence and then zero signal.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here are the results of this this.",
                    "label": 0
                },
                {
                    "sent": "This is their calculations and experimental, so this is the direction there is the point spread function to intensity that we get out and just flor essence.",
                    "label": 0
                },
                {
                    "sent": "The dashed line is very broad broad point spread function.",
                    "label": 0
                },
                {
                    "sent": "But then if we use a laser and we go close to the lasing threshold, we see the huge increase.",
                    "label": 0
                },
                {
                    "sent": "So in the resolution and actually this resolution depends on how close we are to the lasing threshold.",
                    "label": 0
                },
                {
                    "sent": "And this this is this P the laser power divided by the threshold power.",
                    "label": 0
                },
                {
                    "sent": "So their solution if you are at very low, very low power we have normal diffraction limited resolution.",
                    "label": 0
                },
                {
                    "sent": "But if you go close to the to the.",
                    "label": 0
                },
                {
                    "sent": "Lasing threshold we actually can increase the resolution so it's a super solution method and the increases depending on how close to the thresholds we are.",
                    "label": 0
                },
                {
                    "sent": "It's up to six times better solution than than just diffraction limited and in experiments it's the same so you see very narrowing of the points that function when you go close to the lasing threshold.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, with this I would like to conclude something.",
                    "label": 0
                },
                {
                    "sent": "Everybody involved in this and funding and we have postdoc position available.",
                    "label": 1
                },
                {
                    "sent": "If anyone is interested in working in this area and thank you for attention.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": []
        }
    }
}