{
    "id": "f4vwa54omqg5gpxyo32zfuyemvdesk7u",
    "title": "On a statistical model of cluster stability",
    "info": {
        "author": [
            "Zeev Volkovich, ORT Braude College of Engineering"
        ],
        "published": "July 28, 2007",
        "recorded": "July 2007",
        "category": [
            "Top->Computer Science->Machine Learning->Clustering"
        ]
    },
    "url": "http://videolectures.net/srmc07_volkovich_zeev_osm/",
    "segmentation": [
        [
            "I'm going to present in how to say it in Russian English.",
            "The idea of using.",
            "Of probability metrics in the cluster stability probe."
        ],
        [
            "The concept of our talk we propose in general statistical approach for study of the cluster validation problem.",
            "Our concept suggestions partitions obtained by the class by class regarding running can be considered as realization of random variable such as the most stable random variable infers that wrong number of clusters.",
            "The basic idea.",
            "Look for to measure stability by means of probability densities with him with him.",
            "The observed realization hours methods suggest applications of probability metric between around."
        ],
        [
            "Random variables.",
            "I must say that this our work is motivated by ideas stated in this papers and then we started to read these papers were paid our attention that.",
            "Actually others, the others of these papers used.",
            "How to say it is a concentration measure derived by a component metrics?",
            "I will demonstrate it later.",
            "Something's wrong."
        ],
        [
            "No, I think so is.",
            "It's not need, but I would like to remind what is clustering clustering is.",
            "To give Google Translate to give a partition of a set, say in English and Space Rd by means of clustering algorithm such that.",
            "Do items belonging to the same cluster are SIM?"
        ],
        [
            "The rent items belonging to different cluster are not similar.",
            "Something like this is important and important.",
            "Questions that we are speaking all the time.",
            "How many clusters are they in the clustering time?",
            "A first though I would like to demonstrate some.",
            "A toy example.",
            "For multi mission of."
        ],
        [
            "Our approach let's consider A3 clustered.",
            "Did you cross the red set?",
            "We can.",
            "See that is there are three three clusters.",
            "More or less separated linearly if we tried.",
            "The party to Thursday, Vita said in two into a cluster for 10.",
            "One non consistent cluster.",
            "This is a green one.",
            "Here is green one here.",
            "Actually, this cluster is unit of two homogeneous clusters only in the in the in the source partition and then similar.",
            "Similar picture signature situation we can obtain in the case when we try.",
            "To divide our set into four clusters, there's a blue clusters includes includes points belonging to all clusters, red, green and and so and so."
        ],
        [
            "Or is it this observed that is the case when the number of cluster is not correctly choosing no consistent cluster can be formed?",
            "Such as cluster C, unions, or several gather organelles parts having different distributions."
        ],
        [
            "And.",
            "Our kangkang concept here of usual.",
            "So we were speaking in our.",
            "Workshop we take the data, withdraw the sample from that of a cluster.",
            "The sample.",
            "And we obtain.",
            "Sam"
        ],
        [
            "After it's in.",
            "And so on.",
            "This cluster examples can be considered as estimators estimators of look for.",
            "Through partitions and appropriately or can concept with this part partitions as instances of random variables.",
            "Wearable excuse me such that the stiffness random variable is associated with the true number of class."
        ],
        [
            "Outliers is a simple sent imitation of clustering algorithm significato.",
            "The noise levels increase models and instability, so the clustering procedure can has to be iterated many times to obtain many meaningful results.",
            "The stability of random variables is measured via probability measure measures according to our principle is natural to assume that that room number of clusters correspond to distance distribution having the minimal in variation.",
            "Yes.",
            "So.",
            "So you have now a true distribution and you have a cluster.",
            "Once more.",
            "You should for Ritchie brothers, no, no, I I I don't know that that that restrict motion.",
            "I don't, I don't I don't know.",
            "With the clustering has generated the data or that the classroom is an interpretation class.",
            "Rustic is interpretation.",
            "In the interpretation of that.",
            "Interpretation, yeah."
        ],
        [
            "But this probability matrix?",
            "Probability Village metrics are introduced in Spaceland's real valued random variables defined on the same probability space.",
            "The important points that this must be defined as the same or the same probability space.",
            "This looks like similar.",
            "To definition of the regular methods.",
            "But what is difference here?",
            "Is that when we speak about then to fly over the probability just distribution of random variation we can use into?",
            "24 the 4th is the first form here.",
            "Kiss my brother said.",
            "Excuse me 7A is the distance between two variables is zero.",
            "That that means that one variable equals to to second one most.",
            "Almost sure.",
            "But we can take here is another definition of this property that the most most of the vendors when they have.",
            "A zero value of the distance.",
            "Is that that means for us the two distributions two very very variables X&Y have the same distribution?",
            "In this case they say that the metric is simple, one simple method, another case metric is called compound.",
            "Her connect conversion example of Vernon Vernon Component Metrics LLP metric.",
            "The metric.",
            "This.",
            "Did that, definitely such way.",
            "For example, for a P = 0 vertain heroes indicated metric.",
            "That was what you use in your paper."
        ],
        [
            "And there are there are many, many examples of probability metrics.",
            "LP metrics.",
            "He found metrics that."
        ],
        [
            "For example, can be.",
            "Can we definitely say in such way?",
            "Being bomb orange metrics is so complicated structure having so so complicated structure and so on."
        ],
        [
            "What is a very interested for us in this?",
            "In this aplicacion is concentration index their art giraffe by the by the by the metric.",
            "Difference between simple and come come component metric is that they don't like the component.",
            "One simple metrics equals 0 from 2 independent in identically distributed random variables.",
            "Moreover, if just it is symmetric, is a component metric and.",
            "Distance between X&X.",
            "Prime is zero.",
            "Very recent experiment independent realizations.",
            "Some random variable that is a constant almost surely.",
            "Almost in conference distance can be used as a measure of UN centrality, particularly if we can consider distance between two realizations on the same two independent realizations of the same.",
            "It was the same random variable.",
            "We can use this this this function as I can concentration index derived by the component metric distance.",
            "The stability of random variable can be estimate."
        ],
        [
            "By means of this metric.",
            "And algorithms that we can obtain, but this way by by by such yes.",
            "She said.",
            "And this is normal.",
            "Then it is constant.",
            "Yes, is it is it?",
            "Is it if you speak about the simple simple metric?",
            "Is suburbs because simple metric defines the distance between two distributions?",
            "They have the same distribution.",
            "Almost surely.",
            "You just have to just.",
            "No distance between between the distributions zero.",
            "They depend on the power BI part parameters of the distributions.",
            "With the same parameters, then their distances zero yes distance simple simple distances zero comp component is not zero.",
            "But it is.",
            "It is simple one is 0.",
            "Compote like something like this.",
            "Expectation.",
            "Thanks, Amber.",
            "Expectation yeah, you could say yes, it's OK.",
            "Yes, yes, it's about this high angle.",
            "So you listed that long list of different yes.",
            "Justin.",
            "Is that part of how we should model our our clusters I?",
            "I'm going.",
            "I'm surprised this man.",
            "Yes, I'm going to explain this now.",
            "Just a minute is just list of of of of possibilities.",
            "This list of the possibilities.",
            "And how can we the answer for for for an answer for your question, how can we build and clustering algorithm cluster stability algorithm by means of of such a metric?",
            "Is there is 2 cases as a simple matrix leads geometrical algorithm algorithm that uses geometrical properties of the of the clusters and the second one is the component methods list member membership algorithm like.",
            "Your paper."
        ],
        [
            "Hey.",
            "Several geometrical algorithms.",
            "Yes, yes.",
            "What is the metric over?",
            "What do you?",
            "You look at the distribution that generates the data.",
            "Just a minute you'll see it here."
        ],
        [
            "I mean I. I spend it here, I think so that it could be much, much, much better.",
            "We look at each cluster.",
            "For example, let's consider this draft algorithm.",
            "Does recovery.",
            "Is there a way took our date and draft to jail joint samples?",
            "From the data, the union them into clusters, went across and divide the clustered sample according to the source samples.",
            "We do it in the first proposed to avoid the cluster cluster matching matching problem between between 2:00.",
            "Between 2:00 door samples and we calculate distance between 2.",
            "Search samples what does it mean?",
            "We calculate distance between two such samples and we will speak about simple distance.",
            "Actually we check.",
            "Each cluster.",
            "The defiant here?",
            "Via samples the check it cost if there if it's a homogeneous set is it not come again.",
            "I said if can if can can can can can can we say that each clusters can be considered as one unit population as or otherwise is if it mixed of several populations.",
            "So when you look at the distance.",
            "Help with distance.",
            "This is this is a business between clustering or is it is this between clustered samples this is.",
            "This line, when it's black, the samples and when there ready yet is clusters cluster.",
            "Red means that now the distance between the clusters, yeah.",
            "Yes."
        ],
        [
            "I see.",
            "Let's can can consider this examples this kettle this is this.",
            "This example may explain it here.",
            "Let's suppose we have a cluster at sample.",
            "And in each bar, in each one of the clusters, we have points belonging.",
            "To different samples.",
            "Something like this?",
            "We can ask.",
            "Here, if each cluster is.",
            "Homogeneous disappoint of you of this office of the samples or not.",
            "Actually we we were."
        ],
        [
            "Like we will test this hypothesis in each one of the of the of the of the clusters.",
            "In each one of the of the cluster, what we can see here, the cluster, the points are mixed well.",
            "Is a insect blossom?",
            "Is that zed, zed, zed?",
            "Means if we try to define this this cluster by means of the 2nd.",
            "Sample or bind by means of the first one, we actually obtained the same cluster virtual obtains the same cluster.",
            "For example, we use here came in, so got it.",
            "Is it yes?",
            "Yes.",
            "So you look at the.",
            "Plastic.",
            "When you say I look at the points in the same cluster in the picture that you just wrote."
        ],
        [
            "The convex Hull.",
            "What does it mean?",
            "I look at the same.",
            "Just to generate great points.",
            "Isn't it?",
            "But but but but but but the Black Flag is it is it is the same question I just I would now.",
            "Understand.",
            "Generated.",
            "Between.",
            "Yes.",
            "Yes.",
            "For example, let's say we can.",
            "We can use test distance.",
            "We can, we can just once more excuse me.",
            "I would like to explain this, but once we take.",
            "A union union sample for classes.",
            "It depends of algorithm which which we can use here am algorithm.",
            "Pam Pam algorithm came in.",
            "So algorithm something like this is not so important case here.",
            "Photo Photo given algorithm for a girl for what we what we are going to check here.",
            "If our clusters that obtained here are homogeneous, set or not.",
            "Are homogeneous set or not?",
            "Yes.",
            "Labels.",
            "No no no no no no no video evidence.",
            "Just a minute.",
            "Just a minute I I have an example.",
            "I have an exam.",
            "For example we have two.",
            "We have two to samples as one at a store.",
            "And we we we clustered.",
            "Is a result of the cluster cluster construction is a cluster number one is a cluster number #2 C. How can we estimate distance between samples within the cluster?"
        ],
        [
            "In such a way for a photo photo, for example, in the 1st.",
            "Step V calculate distances between.",
            "Points belonging to different samples.",
            "Point belonging to different samples is the 1st.",
            "I said first statement in here."
        ],
        [
            "What is the second one?",
            "What is the second one is is there are distances between?",
            "Between.",
            "Phones belonging to the same same same same.",
            "In Gloucester is stable.",
            "Is algorithm is good?",
            "Everything is good.",
            "This distance must be 0.",
            "This must be bad for close to there.",
            "Mother Mother Mother Mother mother must be close to sell this we we see here an attempt to estimate in the diameter of the cluster by two different form by two different forms.",
            "The first step is calculated by means distances.",
            "Belonging to different.",
            "Different different different samples and the 2nd second step we calculate distances between points belonging to the to the same class is in the cluster gang metrical stable is must be the same.",
            "This must be the.",
            "The thing is, this distances must be close to 0.",
            "Do they still invite small?",
            "It's OK.",
            "This.",
            "Geometric distance between points.",
            "It's not.",
            "It's usually a metrical distance.",
            "But it can be interpreted as two sample test distance of klibanoff.",
            "Is just geometrical interpretation of two simple tests.",
            "Of Lebanon it's OK."
        ],
        [
            "It's somewhere else, but I I tried to say in this very close to 0.",
            "Then we can conclude that the partitions table normally is the elements of the same for all closed located.",
            "Inside the clusters have came the dimmed and the inconsistent set, which which.",
            "Is he in each one of the clusters kiss me?",
            "I'm going.",
            "A little bit to."
        ],
        [
            "Change the order of my of my of my lecture.",
            "Another approach.",
            "Is it can be used here with approach based on based on to sample test using equation minimal spanning explanatory.",
            "Is it?",
            "What does an impression minimal spanning spanning trees is it is minus three of the set points in a equation space.",
            "Where is the weight of the ages between each part of the points is distance between.",
            "Those two points in simple tests, three connects sets of those using clients such that the total length of lines is minimized and any dog can can be reach from other.",
            "By following the lines."
        ],
        [
            "Here, can we see an example of minimal spanning tree?",
            "Off random.",
            "60 points, how can we use it in cluster stable?"
        ],
        [
            "It's a problem.",
            "Is the same procedure way thou to samples via class transit in respect?",
            "Respect and in case with a stable crossing, the two samples item.",
            "I grow.",
            "Our clothes are located inside the clusters.",
            "In fact, is its factors characterized by number of edges connected points from differ."
        ],
        [
            "Samples.",
            "Foreign foreign for example.",
            "Let's can can can can can consider a good case when we have two.",
            "To samples located, each one with him and another we have here.",
            "The edges the connecting points from different from different samples are marked by right here.",
            "And we can see there are many many many edges, red edges, red edges.",
            "Becausw big cause of the fact of the fact that the samples are closely located within Zach last.",
            "And it's a good situation."
        ],
        [
            "What is the best situation here?",
            "Something like this?",
            "Samples is separated.",
            "Simply excuse myself as a sample.",
            "Samples are separated with visions exactly exactly.",
            "That's one.",
            "The first sample says.",
            "I would like to.",
            "To speak about this cluster and the second one defines another another cluster.",
            "In this.",
            "Degenerate case webtrain only one age.",
            "Is that connect?",
            "Points belonging to different to different proliferant samples.",
            "So all the samples are the mixture of the two cells, yeah?",
            "Distinguishing by color, which points came from himself?",
            "No, this is a.",
            "Is it first in the second?",
            "Say.",
            "The first samples are encircled with it.",
            "Is it?",
            "This is the first sample.",
            "This is the second one.",
            "Yes.",
            "This is using you looking inside single cluster, yes.",
            "Up the universe 1 Miss 2 yes.",
            "OK, so why you would?",
            "The the basic idea is that the samples.",
            "Do not.",
            "Define the same cluster.",
            "To define the terms of the union of this one, yes.",
            "Yes.",
            "We look at the view.",
            "Look at the sample the samples point belonging to the same cluster.",
            "This is something like this.",
            "For example, we have.",
            "See if we can separate.",
            "Something like this?",
            "It's not.",
            "It's not good for for a cluster, that means that it is is clusters actually is not,, Daniel said.",
            "What's wrong?",
            "Yes.",
            "If he could.",
            "Identify the source from the first sample compared to the second.",
            "When they're mixing, then the classes are still yes, exactly.",
            "Thank you.",
            "Thank you very much.",
            "This.",
            "If the two samples come from the same distribution, yes.",
            "That would be for the classroom noticed and separated because they come from the same distribution.",
            "If I have to vote.",
            "What does it mean came from from, from from from the same distribution?",
            "I know distribution yes yes.",
            "In in this case.",
            "Yes.",
            "Two samples I like.",
            "Yes yes yes of course.",
            "Define makers I first do clustering and then I test within clusters.",
            "I still should not be able to determine the difference between as well understood because this one is too painful.",
            "Semi solution and this is I don't know, know, know, know, know.",
            "I don't.",
            "I don't agree with you if you have.",
            "If you have.",
            "For for artifical, cluster and Artifical culture, this cluster is actually mix of two Gaussian distribution.",
            "After off to Gaussian distribution, something like this.",
            "If you will start.",
            "Is it?",
            "To check it by means to sample test sample test.",
            "Right sample test might say.",
            "That you that your population is not unique is not a comma,,,,, homogeneous, one.",
            "Appointment time from 1000 to the point company, but you can you can.",
            "You cannot know it, yes.",
            "The mixture, yes.",
            "Yes.",
            "Every considerable test should tell me.",
            "Solution no no no no no.",
            "But in in, in in, in this point of view is no, no, no science, they use any any any to sample test we can.",
            "We can we can, we can say inititation vacant vacancy vicar underlying.",
            "We haven't relying just distribution of course.",
            "If you do the test on the distribution the same, but if you do clustering pills and then test cluster wise then there will be the same.",
            "If they do the same thing.",
            "I haven't.",
            "And then testing.",
            "Yeah, then the combined thing is a testing to distinguish between S1S2.",
            "Nobody knows whether you split them into the same cluster.",
            "For the union.",
            "So here is a test of the things I have S1S2 with having the same city and I will give you a test that will distinguish gender.",
            "What would I do?",
            "Do a bed plaster and check each of the clusters separately.",
            "Suddenly I'm getting distinction between who came from as well and who Cantonese too, but that's inconsiderate because they can, as well as potentially several times, so you get now you get a different sample as 1S to do again.",
            "Custom union.",
            "You might not get the same clusters.",
            "Yes.",
            "All the points that were drawn the first half of the points in the order level.",
            "Second half.",
            "Yeah, so I should.",
            "Detect yes yes.",
            "That's why we get there.",
            "I cannot your why.",
            "So you can, why not?",
            "No, no you can may.",
            "May I continue with cervical.",
            "You can distinguish between between 2 the top populations.",
            "Yes, but this go to examples.",
            "Ports.",
            "And how can we?",
            "How can we connect between two external cases of this, one that you.",
            "Derived in the first one and."
        ],
        [
            "There was a result.",
            "Of Vincent and pimples from film film, German should consider consider the asymptotical behavior of number of edges in this.",
            "In this case is.",
            "And according to the result.",
            "The number of these agents must be distributed normally.",
            "What?",
            "RN is the number of edges connected points belonging to a different cost to different samples.",
            "Where Eminem is MMN is the size of the samples.",
            "Harrison was a Sunday.",
            "But unlike usual, certain situation where when when when we go to compare it with uniform distribution on something like this here, we must compare our just distribution of number of edges.",
            "This normal distribution with a normal guy."
        ],
        [
            "Distribution.",
            "Actually this results, coincidences all intuition sense of to says are closed.",
            "Then I remained a edges which unit points from different samples.",
            "Is the spirit of the central limit serving just one quick one?",
            "Must must be asymptotic, normally distrib."
        ],
        [
            "And what to say about clustering what, what?",
            "How it can ask?",
            "To protest.",
            "Cluster cluster stability as we make it as the same way withdraw.",
            "See two samples there.",
            "Are there clusters and we look at each cluster."
        ],
        [
            "At each cluster and we calculate this statistics within each cluster.",
            "And the summary statistic is actually the average of this statistic overall."
        ],
        [
            "Or clusters here we can see an example for calculating of the of the statistics.",
            "And we have here to clusters red edges.",
            "There are agents that connected connecting.",
            "Points belonging to different clusters we.",
            "Song.",
            "This numbers and with appropriate normalization and then centralization we obtain and the value of this of this of the status.",
            "And we re run this process many many times, many many times and we VVVV obtain an array as a set of the values of this.",
            "Of this of this statistic.",
            "What this?",
            "What this theorem says.",
            "Is it?",
            "NZ Best situation, where, when, or or or classes are Gama genius at this.",
            "Statistics must be.",
            "Distributed normally asymptotically.",
            "Normally awesome thought experiment, we just.",
            "Voice gives me."
        ],
        [
            "We just test for several values of K distance from the obtained set of the values of the statistics to the normal distribution.",
            "Doesn't normal, just this?",
            "Is it so?",
            "This actually is actually statistics.",
            "Is actually not not give purchase test.",
            "Where is we have the best matching to normal distribution itself.",
            "We see here several.",
            "Distance is that can barely hear that can can can can we use here just distances attendant to estimate to estimate the distance from the empirical distribution statistic to the charitable, normal normal distribution the most none of this distance is Kolmogorov Smirnov test statistics.",
            "I think so."
        ],
        [
            "That's a.",
            "Definite in such way.",
            "If we can, we can see it here.",
            "The Red Line is a theoretical curvature, and the blue, blue, blue, blue, blue, blue one is a graph of the empirical distribution,,, lative function.",
            "Answer, Grossman of Distance says that.",
            "Is actually marks marks distance, supremum distance between two curves?",
            "Between the target, but will be between between in between the toes that occurs.",
            "We cannot see here the.",
            "Right?"
        ],
        [
            "Swan and this toy example toy toy toy toy example.",
            "If we perform this procedure, we."
        ],
        [
            "Obtain.",
            "Such a graph of the distance between congressman of distance between empirical distribution of the statistic and the theoretical distribution.",
            "Normal distribution of statistics, and we can vacant vacancy.",
            "We obtain the minimum when the test number of clusters is 3.",
            "Isn't.",
            "This number goes about.",
            "This is a toy example.",
            "I must say that there's a spiritual solution can be obtained here to.",
            "Is there a bus?",
            "I don't present it here, but it well, but I I have is it stable?",
            "Yes yes yes yes.",
            "So it's five statistically significantly lower than the four.",
            "I don't know, they I don't know how.",
            "How can I can I can I can I can explain it?",
            "For example 3K equals three, is it true?",
            "Solution, no doubt, Sir, by the have a local minimum at .5 I don't know.",
            "No, no, that refers to her question.",
            "If you know how big the error bars.",
            "Yes yes yes I. Activation or is it something which which is a problem?",
            "I will check it once more, but it seems to me that is not the problem here is that it's not.",
            "It's not the point here.",
            "Robustas is important.",
            "I agree with you.",
            "I agree with.",
            "No doubts.",
            "Is the elbows around 5:00?",
            "They have a large intersection with the overflow.",
            "Then five, Oh yes, I agree.",
            "I agree, but but I think so.",
            "But as it is, it is not.",
            "It's not a reason here.",
            "I agree it's no doubt."
        ],
        [
            "And.",
            "I would like to say.",
            "Several words about membership stability algorithms that.",
            "Algorithm in tyrant.",
            "I belong to the approach stated in the.",
            "Papers in the two papers.",
            "Here.",
            "But is the.",
            "Difference, that is that is.",
            "The area of the possible view.",
            "Boston area.",
            "Of the possible values of the.",
            "Random variables is this KCK is 412 K is very poor is very very very very very poor.",
            "And we can use here.",
            "In component metric something like like like this, but there's a problem that we."
        ],
        [
            "We are playing here that is.",
            "As such, is it fails from.",
            "How can we simulate the?",
            "A random variable XY.",
            "Here is one of the other ways.",
            "Do is to do it by means of several or sequence of sequence of.",
            "Clustering algorithm algorithms.",
            "A another hunt.",
            "It would be the same algorithm starting from from different points starting from different ways.",
            "We can consider the result of the of this customization as realization of the same random variables is.",
            "It was stated your your.",
            "India papers.",
            "But this is the problem here is."
        ],
        [
            "Cluster matching problem.",
            "How can we understand becausw?",
            "Random variable steaks they have several is in the set one CK.",
            "How can we determine?",
            "8 very very very first customers second cousin.",
            "So on the same."
        ],
        [
            "What was proposed?",
            "In your paper.",
            "In your paper they use here.",
            "There hung a very well known, hung, hung, hung, hung, garden.",
            "Need to turn out the appropriate permutations of the of the indexes.",
            "So 5 minutes.",
            "I would like.",
            "To demonstrate one example."
        ],
        [
            "This one this example, maybe I'm going.",
            "To kill myself, but I.",
            "However, 1:30 must read the result.",
            "The using of klebanov test for well known Iris flower data data data sets is also presented in your in your paper.",
            "It's well now there are three clusters here and to cluster our third to cluster, I've simply separated linearly.",
            "Is the source in the last one is not linearly separate from from the 1st and the 2nd one?",
            "But our.",
            "Our method is kept, is capable to find out how many clusters is here.",
            "Zovi use K means algorithm here but we find here in three."
        ],
        [
            "Three clusters as we can see here.",
            "The graph of the.",
            "Or the average of the appropriate appropriate statistics?",
            "Is there is a minimum the .3."
        ],
        [
            "And here we can see the graph of the.",
            "Normalized quarter loss quarter very well.",
            "The is indicated trick three Class 3 clusters in the data to.",
            "Once more.",
            "Yes yes yes yes yes yes.",
            "Creation Science Center division.",
            "It doesn't.",
            "Doesn't doesn't work here with V. Try to work with Standard Division doesn't doesn't work."
        ],
        [
            "Becausw becausw I assess isn't he is he is he is attending the imperative from the form of the distribution.",
            "For example in this case.",
            "In this case, the auction is the cases against a gram of the statistics just distribution like I remember yesterday you spoke about.",
            "Histogram's at bun bun.",
            "Horse statistics.",
            "Something like this?",
            "Something like this?",
            "We see here distribution of the of the statistic in this case to use.",
            "Standard deviation.",
            "For for further counseling.",
            "Harter Azatian of the of the scatter so artifical, and I know I know on my opinion on my on my opinion, it's not.",
            "It's not, it's not symmetric distribution."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm going to present in how to say it in Russian English.",
                    "label": 0
                },
                {
                    "sent": "The idea of using.",
                    "label": 0
                },
                {
                    "sent": "Of probability metrics in the cluster stability probe.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The concept of our talk we propose in general statistical approach for study of the cluster validation problem.",
                    "label": 0
                },
                {
                    "sent": "Our concept suggestions partitions obtained by the class by class regarding running can be considered as realization of random variable such as the most stable random variable infers that wrong number of clusters.",
                    "label": 0
                },
                {
                    "sent": "The basic idea.",
                    "label": 0
                },
                {
                    "sent": "Look for to measure stability by means of probability densities with him with him.",
                    "label": 0
                },
                {
                    "sent": "The observed realization hours methods suggest applications of probability metric between around.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Random variables.",
                    "label": 0
                },
                {
                    "sent": "I must say that this our work is motivated by ideas stated in this papers and then we started to read these papers were paid our attention that.",
                    "label": 0
                },
                {
                    "sent": "Actually others, the others of these papers used.",
                    "label": 0
                },
                {
                    "sent": "How to say it is a concentration measure derived by a component metrics?",
                    "label": 0
                },
                {
                    "sent": "I will demonstrate it later.",
                    "label": 0
                },
                {
                    "sent": "Something's wrong.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No, I think so is.",
                    "label": 0
                },
                {
                    "sent": "It's not need, but I would like to remind what is clustering clustering is.",
                    "label": 0
                },
                {
                    "sent": "To give Google Translate to give a partition of a set, say in English and Space Rd by means of clustering algorithm such that.",
                    "label": 1
                },
                {
                    "sent": "Do items belonging to the same cluster are SIM?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The rent items belonging to different cluster are not similar.",
                    "label": 0
                },
                {
                    "sent": "Something like this is important and important.",
                    "label": 0
                },
                {
                    "sent": "Questions that we are speaking all the time.",
                    "label": 0
                },
                {
                    "sent": "How many clusters are they in the clustering time?",
                    "label": 1
                },
                {
                    "sent": "A first though I would like to demonstrate some.",
                    "label": 0
                },
                {
                    "sent": "A toy example.",
                    "label": 0
                },
                {
                    "sent": "For multi mission of.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our approach let's consider A3 clustered.",
                    "label": 0
                },
                {
                    "sent": "Did you cross the red set?",
                    "label": 0
                },
                {
                    "sent": "We can.",
                    "label": 0
                },
                {
                    "sent": "See that is there are three three clusters.",
                    "label": 0
                },
                {
                    "sent": "More or less separated linearly if we tried.",
                    "label": 0
                },
                {
                    "sent": "The party to Thursday, Vita said in two into a cluster for 10.",
                    "label": 0
                },
                {
                    "sent": "One non consistent cluster.",
                    "label": 0
                },
                {
                    "sent": "This is a green one.",
                    "label": 0
                },
                {
                    "sent": "Here is green one here.",
                    "label": 0
                },
                {
                    "sent": "Actually, this cluster is unit of two homogeneous clusters only in the in the in the source partition and then similar.",
                    "label": 0
                },
                {
                    "sent": "Similar picture signature situation we can obtain in the case when we try.",
                    "label": 0
                },
                {
                    "sent": "To divide our set into four clusters, there's a blue clusters includes includes points belonging to all clusters, red, green and and so and so.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or is it this observed that is the case when the number of cluster is not correctly choosing no consistent cluster can be formed?",
                    "label": 0
                },
                {
                    "sent": "Such as cluster C, unions, or several gather organelles parts having different distributions.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Our kangkang concept here of usual.",
                    "label": 0
                },
                {
                    "sent": "So we were speaking in our.",
                    "label": 0
                },
                {
                    "sent": "Workshop we take the data, withdraw the sample from that of a cluster.",
                    "label": 0
                },
                {
                    "sent": "The sample.",
                    "label": 0
                },
                {
                    "sent": "And we obtain.",
                    "label": 0
                },
                {
                    "sent": "Sam",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "After it's in.",
                    "label": 0
                },
                {
                    "sent": "And so on.",
                    "label": 0
                },
                {
                    "sent": "This cluster examples can be considered as estimators estimators of look for.",
                    "label": 1
                },
                {
                    "sent": "Through partitions and appropriately or can concept with this part partitions as instances of random variables.",
                    "label": 1
                },
                {
                    "sent": "Wearable excuse me such that the stiffness random variable is associated with the true number of class.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Outliers is a simple sent imitation of clustering algorithm significato.",
                    "label": 0
                },
                {
                    "sent": "The noise levels increase models and instability, so the clustering procedure can has to be iterated many times to obtain many meaningful results.",
                    "label": 1
                },
                {
                    "sent": "The stability of random variables is measured via probability measure measures according to our principle is natural to assume that that room number of clusters correspond to distance distribution having the minimal in variation.",
                    "label": 1
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So you have now a true distribution and you have a cluster.",
                    "label": 0
                },
                {
                    "sent": "Once more.",
                    "label": 0
                },
                {
                    "sent": "You should for Ritchie brothers, no, no, I I I don't know that that that restrict motion.",
                    "label": 0
                },
                {
                    "sent": "I don't, I don't I don't know.",
                    "label": 0
                },
                {
                    "sent": "With the clustering has generated the data or that the classroom is an interpretation class.",
                    "label": 0
                },
                {
                    "sent": "Rustic is interpretation.",
                    "label": 0
                },
                {
                    "sent": "In the interpretation of that.",
                    "label": 0
                },
                {
                    "sent": "Interpretation, yeah.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But this probability matrix?",
                    "label": 0
                },
                {
                    "sent": "Probability Village metrics are introduced in Spaceland's real valued random variables defined on the same probability space.",
                    "label": 1
                },
                {
                    "sent": "The important points that this must be defined as the same or the same probability space.",
                    "label": 0
                },
                {
                    "sent": "This looks like similar.",
                    "label": 0
                },
                {
                    "sent": "To definition of the regular methods.",
                    "label": 0
                },
                {
                    "sent": "But what is difference here?",
                    "label": 0
                },
                {
                    "sent": "Is that when we speak about then to fly over the probability just distribution of random variation we can use into?",
                    "label": 0
                },
                {
                    "sent": "24 the 4th is the first form here.",
                    "label": 0
                },
                {
                    "sent": "Kiss my brother said.",
                    "label": 0
                },
                {
                    "sent": "Excuse me 7A is the distance between two variables is zero.",
                    "label": 0
                },
                {
                    "sent": "That that means that one variable equals to to second one most.",
                    "label": 0
                },
                {
                    "sent": "Almost sure.",
                    "label": 0
                },
                {
                    "sent": "But we can take here is another definition of this property that the most most of the vendors when they have.",
                    "label": 0
                },
                {
                    "sent": "A zero value of the distance.",
                    "label": 0
                },
                {
                    "sent": "Is that that means for us the two distributions two very very variables X&Y have the same distribution?",
                    "label": 1
                },
                {
                    "sent": "In this case they say that the metric is simple, one simple method, another case metric is called compound.",
                    "label": 0
                },
                {
                    "sent": "Her connect conversion example of Vernon Vernon Component Metrics LLP metric.",
                    "label": 0
                },
                {
                    "sent": "The metric.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "Did that, definitely such way.",
                    "label": 0
                },
                {
                    "sent": "For example, for a P = 0 vertain heroes indicated metric.",
                    "label": 0
                },
                {
                    "sent": "That was what you use in your paper.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there are there are many, many examples of probability metrics.",
                    "label": 0
                },
                {
                    "sent": "LP metrics.",
                    "label": 0
                },
                {
                    "sent": "He found metrics that.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For example, can be.",
                    "label": 0
                },
                {
                    "sent": "Can we definitely say in such way?",
                    "label": 0
                },
                {
                    "sent": "Being bomb orange metrics is so complicated structure having so so complicated structure and so on.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What is a very interested for us in this?",
                    "label": 0
                },
                {
                    "sent": "In this aplicacion is concentration index their art giraffe by the by the by the metric.",
                    "label": 0
                },
                {
                    "sent": "Difference between simple and come come component metric is that they don't like the component.",
                    "label": 0
                },
                {
                    "sent": "One simple metrics equals 0 from 2 independent in identically distributed random variables.",
                    "label": 1
                },
                {
                    "sent": "Moreover, if just it is symmetric, is a component metric and.",
                    "label": 0
                },
                {
                    "sent": "Distance between X&X.",
                    "label": 0
                },
                {
                    "sent": "Prime is zero.",
                    "label": 0
                },
                {
                    "sent": "Very recent experiment independent realizations.",
                    "label": 0
                },
                {
                    "sent": "Some random variable that is a constant almost surely.",
                    "label": 1
                },
                {
                    "sent": "Almost in conference distance can be used as a measure of UN centrality, particularly if we can consider distance between two realizations on the same two independent realizations of the same.",
                    "label": 1
                },
                {
                    "sent": "It was the same random variable.",
                    "label": 0
                },
                {
                    "sent": "We can use this this this function as I can concentration index derived by the component metric distance.",
                    "label": 1
                },
                {
                    "sent": "The stability of random variable can be estimate.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "By means of this metric.",
                    "label": 0
                },
                {
                    "sent": "And algorithms that we can obtain, but this way by by by such yes.",
                    "label": 0
                },
                {
                    "sent": "She said.",
                    "label": 0
                },
                {
                    "sent": "And this is normal.",
                    "label": 0
                },
                {
                    "sent": "Then it is constant.",
                    "label": 0
                },
                {
                    "sent": "Yes, is it is it?",
                    "label": 0
                },
                {
                    "sent": "Is it if you speak about the simple simple metric?",
                    "label": 0
                },
                {
                    "sent": "Is suburbs because simple metric defines the distance between two distributions?",
                    "label": 0
                },
                {
                    "sent": "They have the same distribution.",
                    "label": 0
                },
                {
                    "sent": "Almost surely.",
                    "label": 0
                },
                {
                    "sent": "You just have to just.",
                    "label": 0
                },
                {
                    "sent": "No distance between between the distributions zero.",
                    "label": 0
                },
                {
                    "sent": "They depend on the power BI part parameters of the distributions.",
                    "label": 0
                },
                {
                    "sent": "With the same parameters, then their distances zero yes distance simple simple distances zero comp component is not zero.",
                    "label": 0
                },
                {
                    "sent": "But it is.",
                    "label": 0
                },
                {
                    "sent": "It is simple one is 0.",
                    "label": 0
                },
                {
                    "sent": "Compote like something like this.",
                    "label": 0
                },
                {
                    "sent": "Expectation.",
                    "label": 0
                },
                {
                    "sent": "Thanks, Amber.",
                    "label": 0
                },
                {
                    "sent": "Expectation yeah, you could say yes, it's OK.",
                    "label": 0
                },
                {
                    "sent": "Yes, yes, it's about this high angle.",
                    "label": 0
                },
                {
                    "sent": "So you listed that long list of different yes.",
                    "label": 0
                },
                {
                    "sent": "Justin.",
                    "label": 0
                },
                {
                    "sent": "Is that part of how we should model our our clusters I?",
                    "label": 0
                },
                {
                    "sent": "I'm going.",
                    "label": 0
                },
                {
                    "sent": "I'm surprised this man.",
                    "label": 0
                },
                {
                    "sent": "Yes, I'm going to explain this now.",
                    "label": 0
                },
                {
                    "sent": "Just a minute is just list of of of of possibilities.",
                    "label": 0
                },
                {
                    "sent": "This list of the possibilities.",
                    "label": 0
                },
                {
                    "sent": "And how can we the answer for for for an answer for your question, how can we build and clustering algorithm cluster stability algorithm by means of of such a metric?",
                    "label": 0
                },
                {
                    "sent": "Is there is 2 cases as a simple matrix leads geometrical algorithm algorithm that uses geometrical properties of the of the clusters and the second one is the component methods list member membership algorithm like.",
                    "label": 0
                },
                {
                    "sent": "Your paper.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hey.",
                    "label": 0
                },
                {
                    "sent": "Several geometrical algorithms.",
                    "label": 0
                },
                {
                    "sent": "Yes, yes.",
                    "label": 0
                },
                {
                    "sent": "What is the metric over?",
                    "label": 0
                },
                {
                    "sent": "What do you?",
                    "label": 0
                },
                {
                    "sent": "You look at the distribution that generates the data.",
                    "label": 0
                },
                {
                    "sent": "Just a minute you'll see it here.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I mean I. I spend it here, I think so that it could be much, much, much better.",
                    "label": 0
                },
                {
                    "sent": "We look at each cluster.",
                    "label": 0
                },
                {
                    "sent": "For example, let's consider this draft algorithm.",
                    "label": 0
                },
                {
                    "sent": "Does recovery.",
                    "label": 0
                },
                {
                    "sent": "Is there a way took our date and draft to jail joint samples?",
                    "label": 0
                },
                {
                    "sent": "From the data, the union them into clusters, went across and divide the clustered sample according to the source samples.",
                    "label": 0
                },
                {
                    "sent": "We do it in the first proposed to avoid the cluster cluster matching matching problem between between 2:00.",
                    "label": 0
                },
                {
                    "sent": "Between 2:00 door samples and we calculate distance between 2.",
                    "label": 0
                },
                {
                    "sent": "Search samples what does it mean?",
                    "label": 0
                },
                {
                    "sent": "We calculate distance between two such samples and we will speak about simple distance.",
                    "label": 0
                },
                {
                    "sent": "Actually we check.",
                    "label": 0
                },
                {
                    "sent": "Each cluster.",
                    "label": 0
                },
                {
                    "sent": "The defiant here?",
                    "label": 0
                },
                {
                    "sent": "Via samples the check it cost if there if it's a homogeneous set is it not come again.",
                    "label": 0
                },
                {
                    "sent": "I said if can if can can can can can can we say that each clusters can be considered as one unit population as or otherwise is if it mixed of several populations.",
                    "label": 0
                },
                {
                    "sent": "So when you look at the distance.",
                    "label": 0
                },
                {
                    "sent": "Help with distance.",
                    "label": 0
                },
                {
                    "sent": "This is this is a business between clustering or is it is this between clustered samples this is.",
                    "label": 0
                },
                {
                    "sent": "This line, when it's black, the samples and when there ready yet is clusters cluster.",
                    "label": 0
                },
                {
                    "sent": "Red means that now the distance between the clusters, yeah.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I see.",
                    "label": 0
                },
                {
                    "sent": "Let's can can consider this examples this kettle this is this.",
                    "label": 0
                },
                {
                    "sent": "This example may explain it here.",
                    "label": 0
                },
                {
                    "sent": "Let's suppose we have a cluster at sample.",
                    "label": 0
                },
                {
                    "sent": "And in each bar, in each one of the clusters, we have points belonging.",
                    "label": 0
                },
                {
                    "sent": "To different samples.",
                    "label": 0
                },
                {
                    "sent": "Something like this?",
                    "label": 0
                },
                {
                    "sent": "We can ask.",
                    "label": 0
                },
                {
                    "sent": "Here, if each cluster is.",
                    "label": 0
                },
                {
                    "sent": "Homogeneous disappoint of you of this office of the samples or not.",
                    "label": 0
                },
                {
                    "sent": "Actually we we were.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like we will test this hypothesis in each one of the of the of the of the clusters.",
                    "label": 0
                },
                {
                    "sent": "In each one of the of the cluster, what we can see here, the cluster, the points are mixed well.",
                    "label": 0
                },
                {
                    "sent": "Is a insect blossom?",
                    "label": 0
                },
                {
                    "sent": "Is that zed, zed, zed?",
                    "label": 0
                },
                {
                    "sent": "Means if we try to define this this cluster by means of the 2nd.",
                    "label": 0
                },
                {
                    "sent": "Sample or bind by means of the first one, we actually obtained the same cluster virtual obtains the same cluster.",
                    "label": 0
                },
                {
                    "sent": "For example, we use here came in, so got it.",
                    "label": 0
                },
                {
                    "sent": "Is it yes?",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "So you look at the.",
                    "label": 0
                },
                {
                    "sent": "Plastic.",
                    "label": 0
                },
                {
                    "sent": "When you say I look at the points in the same cluster in the picture that you just wrote.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The convex Hull.",
                    "label": 0
                },
                {
                    "sent": "What does it mean?",
                    "label": 0
                },
                {
                    "sent": "I look at the same.",
                    "label": 0
                },
                {
                    "sent": "Just to generate great points.",
                    "label": 0
                },
                {
                    "sent": "Isn't it?",
                    "label": 0
                },
                {
                    "sent": "But but but but but but the Black Flag is it is it is the same question I just I would now.",
                    "label": 0
                },
                {
                    "sent": "Understand.",
                    "label": 0
                },
                {
                    "sent": "Generated.",
                    "label": 0
                },
                {
                    "sent": "Between.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "For example, let's say we can.",
                    "label": 0
                },
                {
                    "sent": "We can use test distance.",
                    "label": 0
                },
                {
                    "sent": "We can, we can just once more excuse me.",
                    "label": 0
                },
                {
                    "sent": "I would like to explain this, but once we take.",
                    "label": 0
                },
                {
                    "sent": "A union union sample for classes.",
                    "label": 0
                },
                {
                    "sent": "It depends of algorithm which which we can use here am algorithm.",
                    "label": 0
                },
                {
                    "sent": "Pam Pam algorithm came in.",
                    "label": 0
                },
                {
                    "sent": "So algorithm something like this is not so important case here.",
                    "label": 0
                },
                {
                    "sent": "Photo Photo given algorithm for a girl for what we what we are going to check here.",
                    "label": 0
                },
                {
                    "sent": "If our clusters that obtained here are homogeneous, set or not.",
                    "label": 0
                },
                {
                    "sent": "Are homogeneous set or not?",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Labels.",
                    "label": 0
                },
                {
                    "sent": "No no no no no no no video evidence.",
                    "label": 0
                },
                {
                    "sent": "Just a minute.",
                    "label": 0
                },
                {
                    "sent": "Just a minute I I have an example.",
                    "label": 0
                },
                {
                    "sent": "I have an exam.",
                    "label": 0
                },
                {
                    "sent": "For example we have two.",
                    "label": 0
                },
                {
                    "sent": "We have two to samples as one at a store.",
                    "label": 0
                },
                {
                    "sent": "And we we we clustered.",
                    "label": 0
                },
                {
                    "sent": "Is a result of the cluster cluster construction is a cluster number one is a cluster number #2 C. How can we estimate distance between samples within the cluster?",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In such a way for a photo photo, for example, in the 1st.",
                    "label": 0
                },
                {
                    "sent": "Step V calculate distances between.",
                    "label": 0
                },
                {
                    "sent": "Points belonging to different samples.",
                    "label": 1
                },
                {
                    "sent": "Point belonging to different samples is the 1st.",
                    "label": 0
                },
                {
                    "sent": "I said first statement in here.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What is the second one?",
                    "label": 0
                },
                {
                    "sent": "What is the second one is is there are distances between?",
                    "label": 0
                },
                {
                    "sent": "Between.",
                    "label": 0
                },
                {
                    "sent": "Phones belonging to the same same same same.",
                    "label": 0
                },
                {
                    "sent": "In Gloucester is stable.",
                    "label": 0
                },
                {
                    "sent": "Is algorithm is good?",
                    "label": 0
                },
                {
                    "sent": "Everything is good.",
                    "label": 0
                },
                {
                    "sent": "This distance must be 0.",
                    "label": 0
                },
                {
                    "sent": "This must be bad for close to there.",
                    "label": 0
                },
                {
                    "sent": "Mother Mother Mother Mother mother must be close to sell this we we see here an attempt to estimate in the diameter of the cluster by two different form by two different forms.",
                    "label": 0
                },
                {
                    "sent": "The first step is calculated by means distances.",
                    "label": 0
                },
                {
                    "sent": "Belonging to different.",
                    "label": 0
                },
                {
                    "sent": "Different different different samples and the 2nd second step we calculate distances between points belonging to the to the same class is in the cluster gang metrical stable is must be the same.",
                    "label": 0
                },
                {
                    "sent": "This must be the.",
                    "label": 0
                },
                {
                    "sent": "The thing is, this distances must be close to 0.",
                    "label": 0
                },
                {
                    "sent": "Do they still invite small?",
                    "label": 0
                },
                {
                    "sent": "It's OK.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "Geometric distance between points.",
                    "label": 0
                },
                {
                    "sent": "It's not.",
                    "label": 0
                },
                {
                    "sent": "It's usually a metrical distance.",
                    "label": 0
                },
                {
                    "sent": "But it can be interpreted as two sample test distance of klibanoff.",
                    "label": 0
                },
                {
                    "sent": "Is just geometrical interpretation of two simple tests.",
                    "label": 0
                },
                {
                    "sent": "Of Lebanon it's OK.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's somewhere else, but I I tried to say in this very close to 0.",
                    "label": 0
                },
                {
                    "sent": "Then we can conclude that the partitions table normally is the elements of the same for all closed located.",
                    "label": 1
                },
                {
                    "sent": "Inside the clusters have came the dimmed and the inconsistent set, which which.",
                    "label": 0
                },
                {
                    "sent": "Is he in each one of the clusters kiss me?",
                    "label": 0
                },
                {
                    "sent": "I'm going.",
                    "label": 0
                },
                {
                    "sent": "A little bit to.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Change the order of my of my of my lecture.",
                    "label": 0
                },
                {
                    "sent": "Another approach.",
                    "label": 0
                },
                {
                    "sent": "Is it can be used here with approach based on based on to sample test using equation minimal spanning explanatory.",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "What does an impression minimal spanning spanning trees is it is minus three of the set points in a equation space.",
                    "label": 0
                },
                {
                    "sent": "Where is the weight of the ages between each part of the points is distance between.",
                    "label": 1
                },
                {
                    "sent": "Those two points in simple tests, three connects sets of those using clients such that the total length of lines is minimized and any dog can can be reach from other.",
                    "label": 1
                },
                {
                    "sent": "By following the lines.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here, can we see an example of minimal spanning tree?",
                    "label": 0
                },
                {
                    "sent": "Off random.",
                    "label": 0
                },
                {
                    "sent": "60 points, how can we use it in cluster stable?",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's a problem.",
                    "label": 0
                },
                {
                    "sent": "Is the same procedure way thou to samples via class transit in respect?",
                    "label": 0
                },
                {
                    "sent": "Respect and in case with a stable crossing, the two samples item.",
                    "label": 1
                },
                {
                    "sent": "I grow.",
                    "label": 0
                },
                {
                    "sent": "Our clothes are located inside the clusters.",
                    "label": 1
                },
                {
                    "sent": "In fact, is its factors characterized by number of edges connected points from differ.",
                    "label": 1
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Samples.",
                    "label": 0
                },
                {
                    "sent": "Foreign foreign for example.",
                    "label": 0
                },
                {
                    "sent": "Let's can can can can can consider a good case when we have two.",
                    "label": 0
                },
                {
                    "sent": "To samples located, each one with him and another we have here.",
                    "label": 0
                },
                {
                    "sent": "The edges the connecting points from different from different samples are marked by right here.",
                    "label": 0
                },
                {
                    "sent": "And we can see there are many many many edges, red edges, red edges.",
                    "label": 0
                },
                {
                    "sent": "Becausw big cause of the fact of the fact that the samples are closely located within Zach last.",
                    "label": 0
                },
                {
                    "sent": "And it's a good situation.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What is the best situation here?",
                    "label": 0
                },
                {
                    "sent": "Something like this?",
                    "label": 0
                },
                {
                    "sent": "Samples is separated.",
                    "label": 0
                },
                {
                    "sent": "Simply excuse myself as a sample.",
                    "label": 0
                },
                {
                    "sent": "Samples are separated with visions exactly exactly.",
                    "label": 0
                },
                {
                    "sent": "That's one.",
                    "label": 0
                },
                {
                    "sent": "The first sample says.",
                    "label": 0
                },
                {
                    "sent": "I would like to.",
                    "label": 0
                },
                {
                    "sent": "To speak about this cluster and the second one defines another another cluster.",
                    "label": 0
                },
                {
                    "sent": "In this.",
                    "label": 0
                },
                {
                    "sent": "Degenerate case webtrain only one age.",
                    "label": 0
                },
                {
                    "sent": "Is that connect?",
                    "label": 0
                },
                {
                    "sent": "Points belonging to different to different proliferant samples.",
                    "label": 0
                },
                {
                    "sent": "So all the samples are the mixture of the two cells, yeah?",
                    "label": 0
                },
                {
                    "sent": "Distinguishing by color, which points came from himself?",
                    "label": 0
                },
                {
                    "sent": "No, this is a.",
                    "label": 0
                },
                {
                    "sent": "Is it first in the second?",
                    "label": 0
                },
                {
                    "sent": "Say.",
                    "label": 0
                },
                {
                    "sent": "The first samples are encircled with it.",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "This is the first sample.",
                    "label": 0
                },
                {
                    "sent": "This is the second one.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "This is using you looking inside single cluster, yes.",
                    "label": 0
                },
                {
                    "sent": "Up the universe 1 Miss 2 yes.",
                    "label": 0
                },
                {
                    "sent": "OK, so why you would?",
                    "label": 0
                },
                {
                    "sent": "The the basic idea is that the samples.",
                    "label": 0
                },
                {
                    "sent": "Do not.",
                    "label": 0
                },
                {
                    "sent": "Define the same cluster.",
                    "label": 0
                },
                {
                    "sent": "To define the terms of the union of this one, yes.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "We look at the view.",
                    "label": 0
                },
                {
                    "sent": "Look at the sample the samples point belonging to the same cluster.",
                    "label": 0
                },
                {
                    "sent": "This is something like this.",
                    "label": 0
                },
                {
                    "sent": "For example, we have.",
                    "label": 0
                },
                {
                    "sent": "See if we can separate.",
                    "label": 0
                },
                {
                    "sent": "Something like this?",
                    "label": 0
                },
                {
                    "sent": "It's not.",
                    "label": 0
                },
                {
                    "sent": "It's not good for for a cluster, that means that it is is clusters actually is not,, Daniel said.",
                    "label": 0
                },
                {
                    "sent": "What's wrong?",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "If he could.",
                    "label": 0
                },
                {
                    "sent": "Identify the source from the first sample compared to the second.",
                    "label": 0
                },
                {
                    "sent": "When they're mixing, then the classes are still yes, exactly.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "If the two samples come from the same distribution, yes.",
                    "label": 0
                },
                {
                    "sent": "That would be for the classroom noticed and separated because they come from the same distribution.",
                    "label": 0
                },
                {
                    "sent": "If I have to vote.",
                    "label": 0
                },
                {
                    "sent": "What does it mean came from from, from from from the same distribution?",
                    "label": 0
                },
                {
                    "sent": "I know distribution yes yes.",
                    "label": 0
                },
                {
                    "sent": "In in this case.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Two samples I like.",
                    "label": 0
                },
                {
                    "sent": "Yes yes yes of course.",
                    "label": 0
                },
                {
                    "sent": "Define makers I first do clustering and then I test within clusters.",
                    "label": 0
                },
                {
                    "sent": "I still should not be able to determine the difference between as well understood because this one is too painful.",
                    "label": 0
                },
                {
                    "sent": "Semi solution and this is I don't know, know, know, know, know.",
                    "label": 0
                },
                {
                    "sent": "I don't.",
                    "label": 0
                },
                {
                    "sent": "I don't agree with you if you have.",
                    "label": 0
                },
                {
                    "sent": "If you have.",
                    "label": 0
                },
                {
                    "sent": "For for artifical, cluster and Artifical culture, this cluster is actually mix of two Gaussian distribution.",
                    "label": 0
                },
                {
                    "sent": "After off to Gaussian distribution, something like this.",
                    "label": 0
                },
                {
                    "sent": "If you will start.",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "To check it by means to sample test sample test.",
                    "label": 0
                },
                {
                    "sent": "Right sample test might say.",
                    "label": 0
                },
                {
                    "sent": "That you that your population is not unique is not a comma,,,,, homogeneous, one.",
                    "label": 0
                },
                {
                    "sent": "Appointment time from 1000 to the point company, but you can you can.",
                    "label": 0
                },
                {
                    "sent": "You cannot know it, yes.",
                    "label": 0
                },
                {
                    "sent": "The mixture, yes.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Every considerable test should tell me.",
                    "label": 0
                },
                {
                    "sent": "Solution no no no no no.",
                    "label": 0
                },
                {
                    "sent": "But in in, in in, in this point of view is no, no, no science, they use any any any to sample test we can.",
                    "label": 0
                },
                {
                    "sent": "We can we can, we can say inititation vacant vacancy vicar underlying.",
                    "label": 0
                },
                {
                    "sent": "We haven't relying just distribution of course.",
                    "label": 0
                },
                {
                    "sent": "If you do the test on the distribution the same, but if you do clustering pills and then test cluster wise then there will be the same.",
                    "label": 0
                },
                {
                    "sent": "If they do the same thing.",
                    "label": 0
                },
                {
                    "sent": "I haven't.",
                    "label": 0
                },
                {
                    "sent": "And then testing.",
                    "label": 0
                },
                {
                    "sent": "Yeah, then the combined thing is a testing to distinguish between S1S2.",
                    "label": 0
                },
                {
                    "sent": "Nobody knows whether you split them into the same cluster.",
                    "label": 0
                },
                {
                    "sent": "For the union.",
                    "label": 0
                },
                {
                    "sent": "So here is a test of the things I have S1S2 with having the same city and I will give you a test that will distinguish gender.",
                    "label": 0
                },
                {
                    "sent": "What would I do?",
                    "label": 0
                },
                {
                    "sent": "Do a bed plaster and check each of the clusters separately.",
                    "label": 0
                },
                {
                    "sent": "Suddenly I'm getting distinction between who came from as well and who Cantonese too, but that's inconsiderate because they can, as well as potentially several times, so you get now you get a different sample as 1S to do again.",
                    "label": 0
                },
                {
                    "sent": "Custom union.",
                    "label": 0
                },
                {
                    "sent": "You might not get the same clusters.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "All the points that were drawn the first half of the points in the order level.",
                    "label": 0
                },
                {
                    "sent": "Second half.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so I should.",
                    "label": 0
                },
                {
                    "sent": "Detect yes yes.",
                    "label": 0
                },
                {
                    "sent": "That's why we get there.",
                    "label": 0
                },
                {
                    "sent": "I cannot your why.",
                    "label": 0
                },
                {
                    "sent": "So you can, why not?",
                    "label": 0
                },
                {
                    "sent": "No, no you can may.",
                    "label": 0
                },
                {
                    "sent": "May I continue with cervical.",
                    "label": 0
                },
                {
                    "sent": "You can distinguish between between 2 the top populations.",
                    "label": 0
                },
                {
                    "sent": "Yes, but this go to examples.",
                    "label": 0
                },
                {
                    "sent": "Ports.",
                    "label": 0
                },
                {
                    "sent": "And how can we?",
                    "label": 0
                },
                {
                    "sent": "How can we connect between two external cases of this, one that you.",
                    "label": 0
                },
                {
                    "sent": "Derived in the first one and.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There was a result.",
                    "label": 0
                },
                {
                    "sent": "Of Vincent and pimples from film film, German should consider consider the asymptotical behavior of number of edges in this.",
                    "label": 1
                },
                {
                    "sent": "In this case is.",
                    "label": 0
                },
                {
                    "sent": "And according to the result.",
                    "label": 0
                },
                {
                    "sent": "The number of these agents must be distributed normally.",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                },
                {
                    "sent": "RN is the number of edges connected points belonging to a different cost to different samples.",
                    "label": 0
                },
                {
                    "sent": "Where Eminem is MMN is the size of the samples.",
                    "label": 0
                },
                {
                    "sent": "Harrison was a Sunday.",
                    "label": 0
                },
                {
                    "sent": "But unlike usual, certain situation where when when when we go to compare it with uniform distribution on something like this here, we must compare our just distribution of number of edges.",
                    "label": 0
                },
                {
                    "sent": "This normal distribution with a normal guy.",
                    "label": 1
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Distribution.",
                    "label": 0
                },
                {
                    "sent": "Actually this results, coincidences all intuition sense of to says are closed.",
                    "label": 1
                },
                {
                    "sent": "Then I remained a edges which unit points from different samples.",
                    "label": 1
                },
                {
                    "sent": "Is the spirit of the central limit serving just one quick one?",
                    "label": 0
                },
                {
                    "sent": "Must must be asymptotic, normally distrib.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what to say about clustering what, what?",
                    "label": 0
                },
                {
                    "sent": "How it can ask?",
                    "label": 0
                },
                {
                    "sent": "To protest.",
                    "label": 0
                },
                {
                    "sent": "Cluster cluster stability as we make it as the same way withdraw.",
                    "label": 0
                },
                {
                    "sent": "See two samples there.",
                    "label": 0
                },
                {
                    "sent": "Are there clusters and we look at each cluster.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At each cluster and we calculate this statistics within each cluster.",
                    "label": 0
                },
                {
                    "sent": "And the summary statistic is actually the average of this statistic overall.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or clusters here we can see an example for calculating of the of the statistics.",
                    "label": 0
                },
                {
                    "sent": "And we have here to clusters red edges.",
                    "label": 0
                },
                {
                    "sent": "There are agents that connected connecting.",
                    "label": 0
                },
                {
                    "sent": "Points belonging to different clusters we.",
                    "label": 0
                },
                {
                    "sent": "Song.",
                    "label": 0
                },
                {
                    "sent": "This numbers and with appropriate normalization and then centralization we obtain and the value of this of this of the status.",
                    "label": 0
                },
                {
                    "sent": "And we re run this process many many times, many many times and we VVVV obtain an array as a set of the values of this.",
                    "label": 0
                },
                {
                    "sent": "Of this of this statistic.",
                    "label": 0
                },
                {
                    "sent": "What this?",
                    "label": 0
                },
                {
                    "sent": "What this theorem says.",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "NZ Best situation, where, when, or or or classes are Gama genius at this.",
                    "label": 0
                },
                {
                    "sent": "Statistics must be.",
                    "label": 0
                },
                {
                    "sent": "Distributed normally asymptotically.",
                    "label": 0
                },
                {
                    "sent": "Normally awesome thought experiment, we just.",
                    "label": 0
                },
                {
                    "sent": "Voice gives me.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We just test for several values of K distance from the obtained set of the values of the statistics to the normal distribution.",
                    "label": 0
                },
                {
                    "sent": "Doesn't normal, just this?",
                    "label": 0
                },
                {
                    "sent": "Is it so?",
                    "label": 0
                },
                {
                    "sent": "This actually is actually statistics.",
                    "label": 0
                },
                {
                    "sent": "Is actually not not give purchase test.",
                    "label": 0
                },
                {
                    "sent": "Where is we have the best matching to normal distribution itself.",
                    "label": 0
                },
                {
                    "sent": "We see here several.",
                    "label": 0
                },
                {
                    "sent": "Distance is that can barely hear that can can can can we use here just distances attendant to estimate to estimate the distance from the empirical distribution statistic to the charitable, normal normal distribution the most none of this distance is Kolmogorov Smirnov test statistics.",
                    "label": 0
                },
                {
                    "sent": "I think so.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's a.",
                    "label": 0
                },
                {
                    "sent": "Definite in such way.",
                    "label": 0
                },
                {
                    "sent": "If we can, we can see it here.",
                    "label": 0
                },
                {
                    "sent": "The Red Line is a theoretical curvature, and the blue, blue, blue, blue, blue, blue one is a graph of the empirical distribution,,, lative function.",
                    "label": 0
                },
                {
                    "sent": "Answer, Grossman of Distance says that.",
                    "label": 0
                },
                {
                    "sent": "Is actually marks marks distance, supremum distance between two curves?",
                    "label": 0
                },
                {
                    "sent": "Between the target, but will be between between in between the toes that occurs.",
                    "label": 0
                },
                {
                    "sent": "We cannot see here the.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Swan and this toy example toy toy toy toy example.",
                    "label": 0
                },
                {
                    "sent": "If we perform this procedure, we.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Obtain.",
                    "label": 0
                },
                {
                    "sent": "Such a graph of the distance between congressman of distance between empirical distribution of the statistic and the theoretical distribution.",
                    "label": 0
                },
                {
                    "sent": "Normal distribution of statistics, and we can vacant vacancy.",
                    "label": 0
                },
                {
                    "sent": "We obtain the minimum when the test number of clusters is 3.",
                    "label": 0
                },
                {
                    "sent": "Isn't.",
                    "label": 0
                },
                {
                    "sent": "This number goes about.",
                    "label": 0
                },
                {
                    "sent": "This is a toy example.",
                    "label": 0
                },
                {
                    "sent": "I must say that there's a spiritual solution can be obtained here to.",
                    "label": 0
                },
                {
                    "sent": "Is there a bus?",
                    "label": 0
                },
                {
                    "sent": "I don't present it here, but it well, but I I have is it stable?",
                    "label": 0
                },
                {
                    "sent": "Yes yes yes yes.",
                    "label": 0
                },
                {
                    "sent": "So it's five statistically significantly lower than the four.",
                    "label": 0
                },
                {
                    "sent": "I don't know, they I don't know how.",
                    "label": 0
                },
                {
                    "sent": "How can I can I can I can I can explain it?",
                    "label": 0
                },
                {
                    "sent": "For example 3K equals three, is it true?",
                    "label": 0
                },
                {
                    "sent": "Solution, no doubt, Sir, by the have a local minimum at .5 I don't know.",
                    "label": 0
                },
                {
                    "sent": "No, no, that refers to her question.",
                    "label": 0
                },
                {
                    "sent": "If you know how big the error bars.",
                    "label": 0
                },
                {
                    "sent": "Yes yes yes I. Activation or is it something which which is a problem?",
                    "label": 0
                },
                {
                    "sent": "I will check it once more, but it seems to me that is not the problem here is that it's not.",
                    "label": 0
                },
                {
                    "sent": "It's not the point here.",
                    "label": 0
                },
                {
                    "sent": "Robustas is important.",
                    "label": 0
                },
                {
                    "sent": "I agree with you.",
                    "label": 0
                },
                {
                    "sent": "I agree with.",
                    "label": 0
                },
                {
                    "sent": "No doubts.",
                    "label": 0
                },
                {
                    "sent": "Is the elbows around 5:00?",
                    "label": 0
                },
                {
                    "sent": "They have a large intersection with the overflow.",
                    "label": 0
                },
                {
                    "sent": "Then five, Oh yes, I agree.",
                    "label": 0
                },
                {
                    "sent": "I agree, but but I think so.",
                    "label": 0
                },
                {
                    "sent": "But as it is, it is not.",
                    "label": 0
                },
                {
                    "sent": "It's not a reason here.",
                    "label": 0
                },
                {
                    "sent": "I agree it's no doubt.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "I would like to say.",
                    "label": 0
                },
                {
                    "sent": "Several words about membership stability algorithms that.",
                    "label": 0
                },
                {
                    "sent": "Algorithm in tyrant.",
                    "label": 0
                },
                {
                    "sent": "I belong to the approach stated in the.",
                    "label": 0
                },
                {
                    "sent": "Papers in the two papers.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "But is the.",
                    "label": 0
                },
                {
                    "sent": "Difference, that is that is.",
                    "label": 0
                },
                {
                    "sent": "The area of the possible view.",
                    "label": 0
                },
                {
                    "sent": "Boston area.",
                    "label": 0
                },
                {
                    "sent": "Of the possible values of the.",
                    "label": 1
                },
                {
                    "sent": "Random variables is this KCK is 412 K is very poor is very very very very very poor.",
                    "label": 0
                },
                {
                    "sent": "And we can use here.",
                    "label": 0
                },
                {
                    "sent": "In component metric something like like like this, but there's a problem that we.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We are playing here that is.",
                    "label": 0
                },
                {
                    "sent": "As such, is it fails from.",
                    "label": 0
                },
                {
                    "sent": "How can we simulate the?",
                    "label": 0
                },
                {
                    "sent": "A random variable XY.",
                    "label": 0
                },
                {
                    "sent": "Here is one of the other ways.",
                    "label": 0
                },
                {
                    "sent": "Do is to do it by means of several or sequence of sequence of.",
                    "label": 0
                },
                {
                    "sent": "Clustering algorithm algorithms.",
                    "label": 0
                },
                {
                    "sent": "A another hunt.",
                    "label": 0
                },
                {
                    "sent": "It would be the same algorithm starting from from different points starting from different ways.",
                    "label": 1
                },
                {
                    "sent": "We can consider the result of the of this customization as realization of the same random variables is.",
                    "label": 0
                },
                {
                    "sent": "It was stated your your.",
                    "label": 0
                },
                {
                    "sent": "India papers.",
                    "label": 0
                },
                {
                    "sent": "But this is the problem here is.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cluster matching problem.",
                    "label": 0
                },
                {
                    "sent": "How can we understand becausw?",
                    "label": 0
                },
                {
                    "sent": "Random variable steaks they have several is in the set one CK.",
                    "label": 0
                },
                {
                    "sent": "How can we determine?",
                    "label": 0
                },
                {
                    "sent": "8 very very very first customers second cousin.",
                    "label": 0
                },
                {
                    "sent": "So on the same.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What was proposed?",
                    "label": 0
                },
                {
                    "sent": "In your paper.",
                    "label": 0
                },
                {
                    "sent": "In your paper they use here.",
                    "label": 0
                },
                {
                    "sent": "There hung a very well known, hung, hung, hung, hung, garden.",
                    "label": 0
                },
                {
                    "sent": "Need to turn out the appropriate permutations of the of the indexes.",
                    "label": 0
                },
                {
                    "sent": "So 5 minutes.",
                    "label": 0
                },
                {
                    "sent": "I would like.",
                    "label": 0
                },
                {
                    "sent": "To demonstrate one example.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This one this example, maybe I'm going.",
                    "label": 0
                },
                {
                    "sent": "To kill myself, but I.",
                    "label": 0
                },
                {
                    "sent": "However, 1:30 must read the result.",
                    "label": 0
                },
                {
                    "sent": "The using of klebanov test for well known Iris flower data data data sets is also presented in your in your paper.",
                    "label": 0
                },
                {
                    "sent": "It's well now there are three clusters here and to cluster our third to cluster, I've simply separated linearly.",
                    "label": 0
                },
                {
                    "sent": "Is the source in the last one is not linearly separate from from the 1st and the 2nd one?",
                    "label": 0
                },
                {
                    "sent": "But our.",
                    "label": 0
                },
                {
                    "sent": "Our method is kept, is capable to find out how many clusters is here.",
                    "label": 0
                },
                {
                    "sent": "Zovi use K means algorithm here but we find here in three.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Three clusters as we can see here.",
                    "label": 0
                },
                {
                    "sent": "The graph of the.",
                    "label": 0
                },
                {
                    "sent": "Or the average of the appropriate appropriate statistics?",
                    "label": 1
                },
                {
                    "sent": "Is there is a minimum the .3.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And here we can see the graph of the.",
                    "label": 1
                },
                {
                    "sent": "Normalized quarter loss quarter very well.",
                    "label": 0
                },
                {
                    "sent": "The is indicated trick three Class 3 clusters in the data to.",
                    "label": 0
                },
                {
                    "sent": "Once more.",
                    "label": 0
                },
                {
                    "sent": "Yes yes yes yes yes yes.",
                    "label": 0
                },
                {
                    "sent": "Creation Science Center division.",
                    "label": 0
                },
                {
                    "sent": "It doesn't.",
                    "label": 0
                },
                {
                    "sent": "Doesn't doesn't work here with V. Try to work with Standard Division doesn't doesn't work.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Becausw becausw I assess isn't he is he is he is attending the imperative from the form of the distribution.",
                    "label": 0
                },
                {
                    "sent": "For example in this case.",
                    "label": 0
                },
                {
                    "sent": "In this case, the auction is the cases against a gram of the statistics just distribution like I remember yesterday you spoke about.",
                    "label": 0
                },
                {
                    "sent": "Histogram's at bun bun.",
                    "label": 0
                },
                {
                    "sent": "Horse statistics.",
                    "label": 0
                },
                {
                    "sent": "Something like this?",
                    "label": 0
                },
                {
                    "sent": "Something like this?",
                    "label": 0
                },
                {
                    "sent": "We see here distribution of the of the statistic in this case to use.",
                    "label": 1
                },
                {
                    "sent": "Standard deviation.",
                    "label": 0
                },
                {
                    "sent": "For for further counseling.",
                    "label": 0
                },
                {
                    "sent": "Harter Azatian of the of the scatter so artifical, and I know I know on my opinion on my on my opinion, it's not.",
                    "label": 0
                },
                {
                    "sent": "It's not, it's not symmetric distribution.",
                    "label": 0
                }
            ]
        }
    }
}