{
    "id": "fayzfq2jgaeppol43nia3om2k6sdgajf",
    "title": "AWG Gaming and Simulation",
    "info": {
        "author": [
            "Wolfgang Hürst, Utrecht University"
        ],
        "published": "Dec. 4, 2008",
        "recorded": "November 2008",
        "category": [
            "Top->Computers->Digital Media"
        ]
    },
    "url": "http://videolectures.net/ict08fr_hurst_ags/",
    "segmentation": [
        [
            "Alright, so game Santa simulation, so let me start by talking a little bit about gaming in general because games are sometime."
        ],
        [
            "This.",
            "Sometimes not really taken serious because games are something that you usually do for fun, but if you look at the gaming industry, if you look at how much money they are making and you see that this is not just fun, this is like a really serious business.",
            "For example, I recently read an article where they expect that in a few years the gaming industry will make more money than the Hollywood movies and the music industry together.",
            "So this is like a huge market and this is just the entertainment part.",
            "But if you look at the gaming industry"
        ],
        [
            "Yeah, if you look at the gaming industry and you realize that games are not only for entertainment but games are used for all different kind of things, especially for example a huge trend is using games for educational purposes.",
            "Another thing is that games if you look at the gaming market."
        ],
        [
            "You see that games are not is not something that is just done by kids anymore.",
            "It is done by people of all ages.",
            "This is an example from an article about how the new We controller, which is this, this controller that measures your emotions and then use it to control the game.",
            "How that is popular among senior citizens in the US.",
            "So obviously they play different games than their grandchildren.",
            "They probably don't play World of Warcraft or so, but I think bowling was the most popular applicational game that was mentioned here in this article.",
            "But you see now that gaming is really something that is done by people of all ages.",
            "And."
        ],
        [
            "Other thing you see when you try to analyze the gaming industry is that there is some really true innovation coming from that industry.",
            "For example, the re game controller was the first commercially successful device that uses accelerometer data to measure this.",
            "This motion and this is now a trend that is used.",
            "This type of technology is now comes from the gaming industry, but it's used more in serious, completely different.",
            "Serious application is also integrated in different devices.",
            "For example, in the iPhone it's a very common trends to have this accelerated.",
            "I use it to input.",
            "To input data and for data manipulation.",
            "This innovation."
        ],
        [
            "And thing is also are true for.",
            "For example, for computer graphics on.",
            "If you look at games.",
            "Since this is such a huge market, if there is a lot of competition in this market.",
            "So as a game developer, if you want to survive in that field, you really have to have the best graphics.",
            "The most realistic graphics, the coolest graphics, because the consumers are really critical to this kind of issues.",
            "And obviously this is not only true for gaming, but also for simulations, because assimilation, which is not realistic is useless.",
            "In fact, it might be even worse.",
            "It might be even dangerous because, for example, I don't want to sit in an airplane where the pilot cannot react appropriate to a situation in a real world, because the simulator he was used for training didn't model this situation appropriately.",
            "Good, so the really key word or the key issue here really is realistic.",
            "We have to have a realistic scenario.",
            "For example, think again about the we controller.",
            "The main reason why it is so popular is that it is more realistic to make this movement to, for example, to throw a bowling ball instead of using a joystick or pressing a few buttons.",
            "So it is more realistic, but that not only this motion is more realistic, but also you have for the game designer for the game developer.",
            "This means that they have to map this physical input to appropriate motions in the game to appropriate movements of the bowling ball.",
            "So you have to.",
            "I have to have some knowledge about how objects behave, how they react, how they influence each other, how they interact with each other.",
            "So this realistic modeling really involves now this is where the knowledge comes in, where the knowledge becomes very important.",
            "So let me skip this.",
            "This is just a more detail about that."
        ],
        [
            "Developing process let me give you another example because I think it's really important to realize these for simulations.",
            "It's so obvious that we need knowledge that we are realistic, but it's also important for the gaming scenario.",
            "Let me bring you an example which might first seem a little off, but I think it illustrates it quite well at the end of the 90s they made a remake of the movie Godzilla and when that movie became when the first images of this new Godzilla monster became online became appeared online, the fans of the old movie started discussing about it.",
            "And it turns out that a lot of people didn't really like it very much.",
            "They said it doesn't look good.",
            "It doesn't look natural.",
            "It doesn't look realistic, which is a weird thing to say about the movie monster.",
            "But anyway, there were a couple of scientists who obviously had too much time on their hands.",
            "They tried to evaluate this and they figured out that the legs were actually not strong enough or not large enough, so they said if a creature has this large body and this large estimated wait, then it needs larger likes to be able to walk.",
            "So this I think is a really good example where you have on the one hand users.",
            "Who don't have the physical knowledge about their biology and everything, but they just look at it and it just doesn't look right.",
            "And then you have the scientists who have the knowledge.",
            "You can prove that it is indeed not right.",
            "So.",
            "The point here is that even if you're making a game for fantasy world where you have creatures that are not real, people have certain expectations to it which are influenced by the knowledge we have from the world.",
            "So bringing this knowledge in for the game development is very important, even if you are developing a game for a fantasy world.",
            "So.",
            "Now, if you if you are remember what I said at the beginning, if you look at the gaming industry this is then you see that there is a large variety in this gaming industry we have."
        ],
        [
            "Games for cell phones.",
            "Console augmented reality, which I didn't even talk about.",
            "We have young users.",
            "We have adults.",
            "We have senior citizens playing.",
            "We have games used for fun, for education, for training for simulations, and I'm actually quite happy how this turned out that in our working group so far the Members we have really reflect this kind of variety that we have in the gaming industry.",
            "For example, we have the typical game developers here, which this is a company from Italy who develops online games."
        ],
        [
            "We also have a company.",
            "This is a company from the Netherlands."
        ],
        [
            "Develop simulations for training purposes.",
            "You see a firefighter training here.",
            "At the bottom we have a company which is, I think, very interesting.",
            "It's."
        ],
        [
            "TX changed it so it's actually a mixture of a company in a research lab and they're doing something very interesting.",
            "They're using Sirius Gaming for designing, So what they do is they they have a design case they want to design something and then they create a simulation for it this and set it up as a game so you have, for example, 11 case should study.",
            "They showed me was creating a tool, the other one was creating a new landscaping.",
            "New use of an area in the city, but these were really actual design cases that are real.",
            "Design cases and then took people who have no experience with design and let them play this design game and then they compared their result to some designs that were done by actual designers.",
            "And then the designers they showed the results to the designers and they were very impressed about the results at these average people who have no experience or knowledge about design were able to achieve so I found this really an impressive example about how games can really use in a serious scenario.",
            "But in a scenario where you need to have the knowledge because.",
            "Those people were average people.",
            "They didn't have any knowledge about it.",
            "Good so."
        ],
        [
            "But you have this futurity on the user side, but you also obviously have the variety on the company side, which I think is also quite well reflected in the group of people, companies and institutions that we have in our in our working group now very small map companies.",
            "We have large companies like one company from the oil industry who is interested interested in simulation.",
            "So not more than 1000 people all working on simulations.",
            "But it is a larger Corporation which is also interested in this kind of things.",
            "So the bottom."
        ],
        [
            "And here is really you have this huge variety of different companies interested.",
            "But the most important thing is really the realistic.",
            "Realistic aspect, and this is where the knowledge technologies come in.",
            "So this is the thing that brings all these different companies that have different interests together that they all need realistic scenarios.",
            "And if you think about the example, that page will show due with the chair that is modified.",
            "This is obviously also a very important, very interesting thing for gaming.",
            "If you think about you.",
            "You have one creature and you want to create your own species and you want to create different characters of that species.",
            "We can easily modify them if you have the knowledge model.",
            "You can create smaller and larger species, or like the example I talked to you with the legs.",
            "Think about a game where you have different levels and you go from one level to the next level.",
            "You get more power, you get stronger leg, but it still should work appropriately and still should function appropriately so.",
            "This is really weird and our technology can come in and can bring in some value and speed up the development process because in the game developer developer development it's usually you have designers and you have programmers, but they don't really have this physical knowledge that you need to do an appropriate modeling.",
            "So yeah, so this is where the knowledge check, mostly convenient.",
            "Unfortunately if you look at the initial impression we have from the questionnaires we have so far.",
            "Then you realize that there is really a large need for it, but so far the status is at most of this is all done by hand, so there is really a lot lot of need for this knowledge.",
            "Technologies alright?",
            "Select word."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Alright, so game Santa simulation, so let me start by talking a little bit about gaming in general because games are sometime.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "Sometimes not really taken serious because games are something that you usually do for fun, but if you look at the gaming industry, if you look at how much money they are making and you see that this is not just fun, this is like a really serious business.",
                    "label": 0
                },
                {
                    "sent": "For example, I recently read an article where they expect that in a few years the gaming industry will make more money than the Hollywood movies and the music industry together.",
                    "label": 0
                },
                {
                    "sent": "So this is like a huge market and this is just the entertainment part.",
                    "label": 0
                },
                {
                    "sent": "But if you look at the gaming industry",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, if you look at the gaming industry and you realize that games are not only for entertainment but games are used for all different kind of things, especially for example a huge trend is using games for educational purposes.",
                    "label": 0
                },
                {
                    "sent": "Another thing is that games if you look at the gaming market.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You see that games are not is not something that is just done by kids anymore.",
                    "label": 0
                },
                {
                    "sent": "It is done by people of all ages.",
                    "label": 0
                },
                {
                    "sent": "This is an example from an article about how the new We controller, which is this, this controller that measures your emotions and then use it to control the game.",
                    "label": 0
                },
                {
                    "sent": "How that is popular among senior citizens in the US.",
                    "label": 0
                },
                {
                    "sent": "So obviously they play different games than their grandchildren.",
                    "label": 0
                },
                {
                    "sent": "They probably don't play World of Warcraft or so, but I think bowling was the most popular applicational game that was mentioned here in this article.",
                    "label": 0
                },
                {
                    "sent": "But you see now that gaming is really something that is done by people of all ages.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other thing you see when you try to analyze the gaming industry is that there is some really true innovation coming from that industry.",
                    "label": 0
                },
                {
                    "sent": "For example, the re game controller was the first commercially successful device that uses accelerometer data to measure this.",
                    "label": 0
                },
                {
                    "sent": "This motion and this is now a trend that is used.",
                    "label": 0
                },
                {
                    "sent": "This type of technology is now comes from the gaming industry, but it's used more in serious, completely different.",
                    "label": 0
                },
                {
                    "sent": "Serious application is also integrated in different devices.",
                    "label": 0
                },
                {
                    "sent": "For example, in the iPhone it's a very common trends to have this accelerated.",
                    "label": 0
                },
                {
                    "sent": "I use it to input.",
                    "label": 0
                },
                {
                    "sent": "To input data and for data manipulation.",
                    "label": 0
                },
                {
                    "sent": "This innovation.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And thing is also are true for.",
                    "label": 0
                },
                {
                    "sent": "For example, for computer graphics on.",
                    "label": 0
                },
                {
                    "sent": "If you look at games.",
                    "label": 0
                },
                {
                    "sent": "Since this is such a huge market, if there is a lot of competition in this market.",
                    "label": 0
                },
                {
                    "sent": "So as a game developer, if you want to survive in that field, you really have to have the best graphics.",
                    "label": 0
                },
                {
                    "sent": "The most realistic graphics, the coolest graphics, because the consumers are really critical to this kind of issues.",
                    "label": 1
                },
                {
                    "sent": "And obviously this is not only true for gaming, but also for simulations, because assimilation, which is not realistic is useless.",
                    "label": 0
                },
                {
                    "sent": "In fact, it might be even worse.",
                    "label": 0
                },
                {
                    "sent": "It might be even dangerous because, for example, I don't want to sit in an airplane where the pilot cannot react appropriate to a situation in a real world, because the simulator he was used for training didn't model this situation appropriately.",
                    "label": 0
                },
                {
                    "sent": "Good, so the really key word or the key issue here really is realistic.",
                    "label": 0
                },
                {
                    "sent": "We have to have a realistic scenario.",
                    "label": 0
                },
                {
                    "sent": "For example, think again about the we controller.",
                    "label": 0
                },
                {
                    "sent": "The main reason why it is so popular is that it is more realistic to make this movement to, for example, to throw a bowling ball instead of using a joystick or pressing a few buttons.",
                    "label": 0
                },
                {
                    "sent": "So it is more realistic, but that not only this motion is more realistic, but also you have for the game designer for the game developer.",
                    "label": 0
                },
                {
                    "sent": "This means that they have to map this physical input to appropriate motions in the game to appropriate movements of the bowling ball.",
                    "label": 0
                },
                {
                    "sent": "So you have to.",
                    "label": 0
                },
                {
                    "sent": "I have to have some knowledge about how objects behave, how they react, how they influence each other, how they interact with each other.",
                    "label": 1
                },
                {
                    "sent": "So this realistic modeling really involves now this is where the knowledge comes in, where the knowledge becomes very important.",
                    "label": 0
                },
                {
                    "sent": "So let me skip this.",
                    "label": 0
                },
                {
                    "sent": "This is just a more detail about that.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Developing process let me give you another example because I think it's really important to realize these for simulations.",
                    "label": 1
                },
                {
                    "sent": "It's so obvious that we need knowledge that we are realistic, but it's also important for the gaming scenario.",
                    "label": 0
                },
                {
                    "sent": "Let me bring you an example which might first seem a little off, but I think it illustrates it quite well at the end of the 90s they made a remake of the movie Godzilla and when that movie became when the first images of this new Godzilla monster became online became appeared online, the fans of the old movie started discussing about it.",
                    "label": 0
                },
                {
                    "sent": "And it turns out that a lot of people didn't really like it very much.",
                    "label": 0
                },
                {
                    "sent": "They said it doesn't look good.",
                    "label": 0
                },
                {
                    "sent": "It doesn't look natural.",
                    "label": 0
                },
                {
                    "sent": "It doesn't look realistic, which is a weird thing to say about the movie monster.",
                    "label": 1
                },
                {
                    "sent": "But anyway, there were a couple of scientists who obviously had too much time on their hands.",
                    "label": 0
                },
                {
                    "sent": "They tried to evaluate this and they figured out that the legs were actually not strong enough or not large enough, so they said if a creature has this large body and this large estimated wait, then it needs larger likes to be able to walk.",
                    "label": 0
                },
                {
                    "sent": "So this I think is a really good example where you have on the one hand users.",
                    "label": 1
                },
                {
                    "sent": "Who don't have the physical knowledge about their biology and everything, but they just look at it and it just doesn't look right.",
                    "label": 0
                },
                {
                    "sent": "And then you have the scientists who have the knowledge.",
                    "label": 0
                },
                {
                    "sent": "You can prove that it is indeed not right.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The point here is that even if you're making a game for fantasy world where you have creatures that are not real, people have certain expectations to it which are influenced by the knowledge we have from the world.",
                    "label": 0
                },
                {
                    "sent": "So bringing this knowledge in for the game development is very important, even if you are developing a game for a fantasy world.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Now, if you if you are remember what I said at the beginning, if you look at the gaming industry this is then you see that there is a large variety in this gaming industry we have.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Games for cell phones.",
                    "label": 0
                },
                {
                    "sent": "Console augmented reality, which I didn't even talk about.",
                    "label": 1
                },
                {
                    "sent": "We have young users.",
                    "label": 0
                },
                {
                    "sent": "We have adults.",
                    "label": 0
                },
                {
                    "sent": "We have senior citizens playing.",
                    "label": 0
                },
                {
                    "sent": "We have games used for fun, for education, for training for simulations, and I'm actually quite happy how this turned out that in our working group so far the Members we have really reflect this kind of variety that we have in the gaming industry.",
                    "label": 0
                },
                {
                    "sent": "For example, we have the typical game developers here, which this is a company from Italy who develops online games.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also have a company.",
                    "label": 0
                },
                {
                    "sent": "This is a company from the Netherlands.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Develop simulations for training purposes.",
                    "label": 0
                },
                {
                    "sent": "You see a firefighter training here.",
                    "label": 0
                },
                {
                    "sent": "At the bottom we have a company which is, I think, very interesting.",
                    "label": 0
                },
                {
                    "sent": "It's.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "TX changed it so it's actually a mixture of a company in a research lab and they're doing something very interesting.",
                    "label": 0
                },
                {
                    "sent": "They're using Sirius Gaming for designing, So what they do is they they have a design case they want to design something and then they create a simulation for it this and set it up as a game so you have, for example, 11 case should study.",
                    "label": 0
                },
                {
                    "sent": "They showed me was creating a tool, the other one was creating a new landscaping.",
                    "label": 0
                },
                {
                    "sent": "New use of an area in the city, but these were really actual design cases that are real.",
                    "label": 0
                },
                {
                    "sent": "Design cases and then took people who have no experience with design and let them play this design game and then they compared their result to some designs that were done by actual designers.",
                    "label": 0
                },
                {
                    "sent": "And then the designers they showed the results to the designers and they were very impressed about the results at these average people who have no experience or knowledge about design were able to achieve so I found this really an impressive example about how games can really use in a serious scenario.",
                    "label": 0
                },
                {
                    "sent": "But in a scenario where you need to have the knowledge because.",
                    "label": 0
                },
                {
                    "sent": "Those people were average people.",
                    "label": 0
                },
                {
                    "sent": "They didn't have any knowledge about it.",
                    "label": 0
                },
                {
                    "sent": "Good so.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But you have this futurity on the user side, but you also obviously have the variety on the company side, which I think is also quite well reflected in the group of people, companies and institutions that we have in our in our working group now very small map companies.",
                    "label": 0
                },
                {
                    "sent": "We have large companies like one company from the oil industry who is interested interested in simulation.",
                    "label": 0
                },
                {
                    "sent": "So not more than 1000 people all working on simulations.",
                    "label": 0
                },
                {
                    "sent": "But it is a larger Corporation which is also interested in this kind of things.",
                    "label": 0
                },
                {
                    "sent": "So the bottom.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And here is really you have this huge variety of different companies interested.",
                    "label": 0
                },
                {
                    "sent": "But the most important thing is really the realistic.",
                    "label": 0
                },
                {
                    "sent": "Realistic aspect, and this is where the knowledge technologies come in.",
                    "label": 1
                },
                {
                    "sent": "So this is the thing that brings all these different companies that have different interests together that they all need realistic scenarios.",
                    "label": 1
                },
                {
                    "sent": "And if you think about the example, that page will show due with the chair that is modified.",
                    "label": 0
                },
                {
                    "sent": "This is obviously also a very important, very interesting thing for gaming.",
                    "label": 0
                },
                {
                    "sent": "If you think about you.",
                    "label": 0
                },
                {
                    "sent": "You have one creature and you want to create your own species and you want to create different characters of that species.",
                    "label": 0
                },
                {
                    "sent": "We can easily modify them if you have the knowledge model.",
                    "label": 0
                },
                {
                    "sent": "You can create smaller and larger species, or like the example I talked to you with the legs.",
                    "label": 0
                },
                {
                    "sent": "Think about a game where you have different levels and you go from one level to the next level.",
                    "label": 0
                },
                {
                    "sent": "You get more power, you get stronger leg, but it still should work appropriately and still should function appropriately so.",
                    "label": 0
                },
                {
                    "sent": "This is really weird and our technology can come in and can bring in some value and speed up the development process because in the game developer developer development it's usually you have designers and you have programmers, but they don't really have this physical knowledge that you need to do an appropriate modeling.",
                    "label": 0
                },
                {
                    "sent": "So yeah, so this is where the knowledge check, mostly convenient.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately if you look at the initial impression we have from the questionnaires we have so far.",
                    "label": 0
                },
                {
                    "sent": "Then you realize that there is really a large need for it, but so far the status is at most of this is all done by hand, so there is really a lot lot of need for this knowledge.",
                    "label": 0
                },
                {
                    "sent": "Technologies alright?",
                    "label": 0
                },
                {
                    "sent": "Select word.",
                    "label": 0
                }
            ]
        }
    }
}