{
    "id": "fgvhqyht6lcmd7rhep5i46xancobypvb",
    "title": "Complexity-Based Approach to Calibration with Checking Rules",
    "info": {
        "author": [
            "Alexander Rakhlin, Statistics Department, Wharton School, University of Pennsylvania"
        ],
        "published": "Aug. 2, 2011",
        "recorded": "July 2011",
        "category": [
            "Top->Computer Science->Machine Learning->Supervised Learning"
        ]
    },
    "url": "http://videolectures.net/colt2011_rakhlin_rules/",
    "segmentation": [
        [
            "So we're going to continue with the idea that one can look at problems which are characterized by I do something.",
            "Nature does something.",
            "I do something nature does something, and we've been trying to develop a theory where one can analyze different problems like that and get to the right inherent complexity of the problem without actually trying to find an algorithm.",
            "So that allows the kind of more distilled understanding of.",
            "What is the right complexity?",
            "And this is one of one application of that approach.",
            "We cannot exactly get the results from what Karthick explained, but with a certain twist.",
            "We can get some interesting results so."
        ],
        [
            "What does calibration Jake talked a little bit about that?",
            "Let me give an example.",
            "This is a bridge players study done in 1987.",
            "Bridge players make a contract and then they are asked to write down the probability that there will be successful in making this contract and so of course, if you're a good bridge player it would be very nice to realistically understand the chances that you have.",
            "Making the game, winning the game and here you can see that experts are actually better at being calibrated than amateurs.",
            "What does it mean to be calibrated anytime that the bridge player says I have about 60% chance of winning this hand?",
            "It should be that roughly 60% of the time they actually win this.",
            "And so the amateurs are in the solid line and the experts are in a dotted line.",
            "And what you see is that the other line is better.",
            "Clinging to the 45 degree line than the for amateurs, and you have this effect here that amateurs often say yes, I'm very confident around 90% confident, but actually they will lose the hand.",
            "So it's important to be calibrated.",
            "Notion studied in cognitive science and psychology and so forth, and there is extensive little."
        ],
        [
            "OK, I have to give the slide any talk on calibration uses the weather example, so if you're looking at the forecast and this is not particularly nice, I was making the talk on the June 20th in Philadelphia.",
            "Not very nice forecast for the next 5 days and there's associated probability of rain on each day and what's the meaning of that probability?",
            "Well, the only meaning kind of you can have is that in the long run, whenever they said 30% it should rain 30% of the time.",
            "Approximately."
        ],
        [
            "OK, I also have to say that this is it looks like Beamer, it's keynote.",
            "This is 100% Sue the beamer."
        ],
        [
            "So calibration for individual sequences if the source if what they observe is actually follows some stochastic process, then it's relatively easy to be calibrated.",
            "What's interesting is that you can be calibrated even if the sequence is of weather.",
            "For instance, is an individual sequence engineered by an adversary."
        ],
        [
            "And I want to give this definitely not be where I can give.",
            "I would like to give kind of a high level handwaving idea, so there is a world of stochastic modeling.",
            "There is a world of individual sequences.",
            "This is not going to be very precise."
        ],
        [
            "The world of stochastic modeling.",
            "We have a bunch of models or model of different probabilities indexed by Theta, let's say and what you see is a bunch of data coming from one of them.",
            "You assume that you.",
            "That's what you observe and you would like to estimate data by some Theta hat.",
            "And then if you have to.",
            "Some action or you have to do something after that.",
            "Then you act as if they had this correct.",
            "Similar to plug-in approach in statistics.",
            "Now I would like to draw."
        ],
        [
            "So the following parallels in the world of individual sequences.",
            "You make no assumption on the source.",
            "You observe some data and if you can calibrate probabilities, if you can calibrate the probabilities of of possible events then you can then act as if these are true probabilities."
        ],
        [
            "You can see this as an intermediate step, not as an end.",
            "Goal.",
            "Calibration is not necessarily the end goal, but there's an intermediate step for something else.",
            "For instance for acting for decision-making and so forth.",
            "In some sense, if you can calibrate, you can then act as if you know the mixed strategy of nature, and that leads to convergence to Nash correlated colibria.",
            "You can also do Blackwell approachability as I think we're just recently nicely noted.",
            "You can do in no internal regret and so forth, so you can use this as an intermediate step if you can calibrate now.",
            "What would prevent us from using this as an intermediate step is that we don't really know the rates with which we can calibrate under different circumstances, and this.",
            "Work gives a precise rates well in some sense precise, but there are some lower bounds we know, but they seem to be the right rates.",
            "For for the problem of calibration.",
            "So now we know the intermediate rates."
        ],
        [
            "OK, so if calibration and from now on I will refer to this type of calibration is classical calibration.",
            "If the calibration is so nice, then why do we need checking rules?"
        ],
        [
            "Well, consider the sequence 010101 and you can find this example in other papers as well.",
            "This is a hypothetical world where it rains only on even days, so if it rains only on even days."
        ],
        [
            "And the weatherman says 0.5 then he's calibrated because we require that in the long run your forecast of the probability matches the actual frequency of events, but no one would keep this weatherman, of course."
        ],
        [
            "You would get fired so.",
            "This comes up because calibration only cares about the long run frequency.",
            "That's the problem only about the long run frequency, and in some sense this is the minimum requirement from the from the forecaster, whenever forecaster forecaster probability that's the minimum we would like to require, but in fact."
        ],
        [
            "I can ask for more, So what?",
            "What else can you ask?",
            "Well, you can ask.",
            "Suppose that you would like to check the forecaster in a somehow better way, so you would like to say alright, besides being calibrated in the classical sense, I want you to be calibrated on all the even rounds.",
            "In that case, the frequency on even rounds is 1, but he is forecasting machines forecasting 0.5 not calibrated, so the forecaster now has to devise a different strategy.",
            "You can now take the the side of the nature who really wants to break this forecaster by devising different checking rules, and the forecaster is trying to be calibrated with respect to all these checking rules.",
            "Now the question is how many of these checking rules can you be calibrated against can be calibrated against 10 this calibration.",
            "These checking rules can be quite involved.",
            "They can say if the past five.",
            "Outcomes are 010011.",
            "Then I would like to check the weather forecaster knows the frequency and so forth.",
            "They can complicate it.",
            "So what is the right?",
            "What is the right notion?",
            "What is the right complexity that?",
            "Inherent to this."
        ],
        [
            "Problem."
        ],
        [
            "So let me actually go into the setup."
        ],
        [
            "40 rounds The player chooses a mixed strategy.",
            "Mixed strategy is a distribution over the moves of the player.",
            "Moves of the player are probabilistic forecasts and therefore the mixed strategy is a distribution on the simplex distribution over distributions."
        ],
        [
            "The adversary picks an outcome.",
            "I have to say that we have K possibilities, so it's not just rain, no rain, but also hail and so forth.",
            "So there are K outcomes there associated with vertices of the simplex.",
            "An outcome is one of these verticies."
        ],
        [
            "And then the player draws his forecast from his from his mixed strategy.",
            "Right now this is exactly what we want.",
            "It's this repeated interaction with the adversary, and so we have a great hope that we can just put it in the framework that we that Kartik talked about and then get get some results.",
            "I accept I didn't tell you how to define the measure of what is the regret.",
            "What is the measure of goodness?"
        ],
        [
            "And so to do that, let me introduce precisely the checking rules.",
            "Checking rules depends on history.",
            "History is nothing but a forecast which is a member of the simplex and the vertex of the simplex.",
            "That's actual outcome.",
            "So a history is just up to T -- 1.",
            "What happened?",
            "The forecast based checking rule is just a mapping.",
            "It's 01 mapping from the history and the current forecast of the player.",
            "OK, OK, what's the calibration metric?",
            "This form that we've seen before, except that now it's a supremum.",
            "Overall checking rules, so we want kind of check the worst checking rules rule, and then we're going to pick those rounds.",
            "So that's going to be 01.",
            "We're going to pick a certain round where certain rounds where the checking rule turns on, and on those rounds, on average we would like the average of our forecasts to match.",
            "The.",
            "Frequency of the events right?",
            "So that is, that is the definition of checking rules.",
            "So the class of checking rules is summarized in some collections data in a way that the function class summarizes a bunch of functions, yes?",
            "The number of times to check in through Spired and then just take those sequences when that goes to Infinity and so that.",
            "So here if checking rule.",
            "If you let you go to Infinity and checking rule only checks a finite small number, it's not even turning up, so this only cares about those checking rules that fire many times.",
            "Checking those can fire with different relative frequency.",
            "So what I'm saying is that maybe it would be more natural.",
            "Maybe maybe it would make analysis a bit more, but this is a bit similar to Brier, Brier score."
        ],
        [
            "OK, So what are the examples?"
        ],
        [
            "The classical epsilon calibration is nothing but a specific family of checking rules.",
            "So whatever Jake talked about before that's a corresponds to these checking rules.",
            "There is a checking role corresponds to each probability forecast P associated with HP, and what it does is, it looks, did the forecaster did this weatherman predict close to 70%?",
            "If yes, it's going to be on, so then it's going to pick those rounds.",
            "When the weatherman checked, when the weatherman forecasts 30% probability of rain.",
            "So that's the classical epsilon calibration, and we do show that you can actually do it for all epsilon uniformly and you get well calibrated forecasting."
        ],
        [
            "OK, but this is actually another example which is even more interesting.",
            "Suppose you have a number of probabilistic models.",
            "Be fade, each P Theta will give you a forecast on the given round given the history.",
            "So it's just the conditional distribution.",
            "And now let's create a family of checking rules such that which is associated with each member of this model, which each possibility for different data and with a forecast.",
            "Possible forecast P and let's check whenever the model whenever the forecast but made by the probabilistic model falls close to this P. In this case what we're doing is we're testing whether a model A probabilistic model is a better fit to data than what we're doing, and if the forecaster is able to.",
            "Calibrate with this type of checking rules.",
            "Then he's doing as well as a set of probabilistic models, which is somehow provides a link between these two worlds, maybe even a bit relevant too."
        ],
        [
            "Something that Peter Greenwald talked yesterday, I guess.",
            "So here's a value of the game.",
            "This is exactly what Karthick defined in the previous slide previous talk, but here we put an indicator, so we're going to be interested in probability is not expectations, but nothing really changes.",
            "It's the same formulation.",
            "It's an indicator that this calibration metric is above data.",
            "This is the value of the game that depends on Theta, and it's nothing but the probability that calibration metric is above a certain threshold Theta.",
            "Instead of expectation, you can do even something better.",
            "You can put the something related to a moment generating function here.",
            "Still the results would go through an.",
            "One would then get the almost sure convergence, so one one can.",
            "One can put stronger requirements here than just the indicator of being above a certain level."
        ],
        [
            "OK, and."
        ],
        [
            "I would turn the crank with only difficulty being that checking rules depends on the history and whatever Karthik talked about there was no such.",
            "It didn't allow for such dependence on the history, but it's not difficult to put it in a bit more math.",
            "Basically, by doing Symmetrization again, that's what saves us.",
            "This is the savior.",
            "By doing symmetrization, one can remove all this complicated stochastic process that's going on.",
            "In this mean Max Min, Max, Min, Max and one can just go to the stochastic process, which we're the only randomness comes from Rademacher Random variables.",
            "OK, that's the only randomness and let's not pay attention to.",
            "This is basically over discretized histories.",
            "This is nothing but a supremum over the set of checking rules of submartingale.",
            "And we know how to deal with that.",
            "So once we get into this form.",
            "This is a sequential Rademacher.",
            "The idea is that now we can do the covering number just the way that we did.",
            "Covering number in the statistical learning theory and statistical learning theory.",
            "One would get super function class of some empirical process which can then be symmetrized.",
            "Here it's a supremum over checking rules of a some kind of martingale process right, but the idea is the same."
        ],
        [
            "And you."
        ],
        [
            "And by doing something that I guess it goes back to vaping or something, you can upper bound.",
            "This by looking at the centers of the cover and then losing it a little bit and you have exponentially decaying tail.",
            "As long as this covering number is not exponential, we're all set.",
            "So now the game."
        ],
        [
            "Reduces to upper bounding sequential covering number.",
            "This is not the usual covering number.",
            "This sequential covering number because we're in this sequential setting OK."
        ],
        [
            "So what kind of checking rules can we work with?"
        ],
        [
            "If whenever you have a finite class of checking rules, so if you try to come up with 20 checking rules no matter what they are.",
            "We'll be able to have a 1 / sqrt T rate for calibration, so there exists a strategy for the player.",
            "For the forecaster that achieves this rate."
        ],
        [
            "If checking rules are history invariant, then checking rule is nothing but a mapping from a simplex in 201.",
            "That's our favorite concepts with VC dimension.",
            "Could visit dimension could be bounded or little stone dimension could be bounded.",
            "You would get a familiar form which is square root of VC or square root of littlestone divided by square root of T."
        ],
        [
            "And as a corollary, we get classical calibration result with K actions and the calibration deviation being measured by L1 norm.",
            "And that gives you 1 / sqrt 2 rate with K squared outside.",
            "But at least it's the rate does not depend on the number of actions, and this to our knowledge this is not known.",
            "Maybe Viani proved there's something like this is about the same time but with a different method, but this rate.",
            "I think was not known."
        ],
        [
            "And if you allow all completely arbitrary measurable history invariant checking rules.",
            "This corresponds to a result by Manor installs, and you would get a rate which suffers from the curse of dimensionality 'cause you calibrating against the world measurable sets.",
            "OK, we don't know.",
            "By the way, this is an open question.",
            "We tried and we do not know if even in two dimensions, whether this is the right rate.",
            "That's a very difficult problem."
        ],
        [
            "You can go to more checking rules.",
            "I'm not going to go into detail if you have time dependent, but history invariant one can get a nice covering argument going and bound the rate if history is represented by a smaller set in.",
            "Otherwise you have a bounded memory where you store your past history.",
            "Then again there is a covering argument that bounds this limited memory.",
            "Look back and this is one of them.",
            "I guess.",
            "Interesting ones if checking rules require a.",
            "Some polynomial number of additions, multiplications and so forth.",
            "Then the VC dimension is not too big and then one can bound the covering number yet again and show that there exists a strategy which calibrates against this set of checking rules.",
            "In other words, if you want to try to break the calendar, the forecaster by devising a set of checking rules you really have to have a lot of computation on your at your hands.",
            "Don't take home message."
        ],
        [
            "There is a lower bound one over square root T. I'm just going to quickly show there is no way to improve kind of one over scores of dependence.",
            "This is for classical calibration."
        ],
        [
            "And last two points were going to go very quickly.",
            "Being calibrated can be viewed as a negative result.",
            "There's a whole testing literature out there.",
            "Alvaro Sandroni is the main guy.",
            "You can take a point of view of nature and you can say I'm going to try to devise checking rules.",
            "Such that I test whether the forecaster knows what he's talking about, the weatherman who is calibrated in the sense that I described, can do so without knowing what weather is.",
            "In other words, is there a way to devise a set of checking rules such that you can distinguish someone who knows the stochastic process?",
            "From the from the one that doesn't right, it's very interesting example, so you can turn it around and see calibration as a negative exam."
        ],
        [
            "OK, and then finally the final remark.",
            "There are very close related ideas and as we understand in the past few years calibration, no internal regret.",
            "Blackwell approachability.",
            "Online optimization.",
            "There are reductions from several of them, and it's kind of exciting.",
            "We have now a framework where we can analyze all of them in the same same platform and get."
        ],
        [
            "Right complexity efficient algorithms is kind of the big open question and there are some more further directions further work.",
            "Thank you, thanks.",
            "I'm so I wonder, is there any, maybe even more connections to more things there are these papers by Falcon cognition about weak predictive complexity?",
            "Which is a generalization of Kolmogorov complexity, so you're not familiar with it.",
            "I'm not, but this is getting closer to color complexity with the number of computations that you would need to figure out if he knows what he's talking about.",
            "So they talk about version of Kolmogorov complexity for things like absolute loss in 01 loss, where you can't get you also get a sqrt T basically in your.",
            "If you look at the difference between two different prediction algorithms.",
            "And so I would guess that any kind of results you get would be.",
            "Let's see, would be a lower bound and upper bound on this week complexity.",
            "But you haven't looked at it.",
            "There should be some relation there.",
            "Pastor mark you had these rates up there.",
            "Could you back a couple of slides?",
            "Do you mind?",
            "I don't.",
            "You're like a list of rates one, so it's much later.",
            "I think that's the one thing about Keynote."
        ],
        [
            "Are these the rates?",
            "So what is it that corollary?",
            "What is that value to you?",
            "It's the, so it's an old one.",
            "Calibration score.",
            "So you're summing up over every single out over an epsilon grade of the probabilities in place is Supreme over the worst been taking some of the worst pain with the L1 over the difference in the accuracy is usually when you say the L1.",
            "OK, that's just a deceptive difference again.",
            "So actually, just on this light, when you have the finite clear class, are you saying it doesn't depend on the cardinality of the class or just didn't deal with the carnality of the class of checking rules?",
            "Oh no.",
            "So yeah.",
            "OK, yeah, definitely Colonel Sanders.",
            "Questions.",
            "Says there some intuition about why the learning rules the checking rules that depend on a longer history are not more complex than the ones that depend on short history.",
            "They are.",
            "So if they depend on longer history than there are more expressive and you can, you can do more now, But suppose I take a finite family of rules that depend on a very long history versus a finite family of rules that depend on very short history then at least.",
            "Over Finite's for a finite human.",
            "I don't know the answer.",
            "Yeah, I don't know why.",
            "Leora Sandroni, as they define their checking rules as a big set with a probability measure on it, and they saw that can be created respect almost every checking words in this set with respect to the problem.",
            "Users can this week over from your result.",
            "So they don't get any rates.",
            "First of all, they are.",
            "It's just a limited result.",
            "They have a little bit different notion of forecast based checking rule which might make it.",
            "It might not follow from these results.",
            "OK, we're out of time.",
            "Let's thank Sasha."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we're going to continue with the idea that one can look at problems which are characterized by I do something.",
                    "label": 0
                },
                {
                    "sent": "Nature does something.",
                    "label": 0
                },
                {
                    "sent": "I do something nature does something, and we've been trying to develop a theory where one can analyze different problems like that and get to the right inherent complexity of the problem without actually trying to find an algorithm.",
                    "label": 0
                },
                {
                    "sent": "So that allows the kind of more distilled understanding of.",
                    "label": 0
                },
                {
                    "sent": "What is the right complexity?",
                    "label": 0
                },
                {
                    "sent": "And this is one of one application of that approach.",
                    "label": 0
                },
                {
                    "sent": "We cannot exactly get the results from what Karthick explained, but with a certain twist.",
                    "label": 0
                },
                {
                    "sent": "We can get some interesting results so.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What does calibration Jake talked a little bit about that?",
                    "label": 0
                },
                {
                    "sent": "Let me give an example.",
                    "label": 0
                },
                {
                    "sent": "This is a bridge players study done in 1987.",
                    "label": 0
                },
                {
                    "sent": "Bridge players make a contract and then they are asked to write down the probability that there will be successful in making this contract and so of course, if you're a good bridge player it would be very nice to realistically understand the chances that you have.",
                    "label": 0
                },
                {
                    "sent": "Making the game, winning the game and here you can see that experts are actually better at being calibrated than amateurs.",
                    "label": 1
                },
                {
                    "sent": "What does it mean to be calibrated anytime that the bridge player says I have about 60% chance of winning this hand?",
                    "label": 0
                },
                {
                    "sent": "It should be that roughly 60% of the time they actually win this.",
                    "label": 0
                },
                {
                    "sent": "And so the amateurs are in the solid line and the experts are in a dotted line.",
                    "label": 1
                },
                {
                    "sent": "And what you see is that the other line is better.",
                    "label": 0
                },
                {
                    "sent": "Clinging to the 45 degree line than the for amateurs, and you have this effect here that amateurs often say yes, I'm very confident around 90% confident, but actually they will lose the hand.",
                    "label": 0
                },
                {
                    "sent": "So it's important to be calibrated.",
                    "label": 0
                },
                {
                    "sent": "Notion studied in cognitive science and psychology and so forth, and there is extensive little.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I have to give the slide any talk on calibration uses the weather example, so if you're looking at the forecast and this is not particularly nice, I was making the talk on the June 20th in Philadelphia.",
                    "label": 0
                },
                {
                    "sent": "Not very nice forecast for the next 5 days and there's associated probability of rain on each day and what's the meaning of that probability?",
                    "label": 0
                },
                {
                    "sent": "Well, the only meaning kind of you can have is that in the long run, whenever they said 30% it should rain 30% of the time.",
                    "label": 0
                },
                {
                    "sent": "Approximately.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I also have to say that this is it looks like Beamer, it's keynote.",
                    "label": 0
                },
                {
                    "sent": "This is 100% Sue the beamer.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So calibration for individual sequences if the source if what they observe is actually follows some stochastic process, then it's relatively easy to be calibrated.",
                    "label": 1
                },
                {
                    "sent": "What's interesting is that you can be calibrated even if the sequence is of weather.",
                    "label": 0
                },
                {
                    "sent": "For instance, is an individual sequence engineered by an adversary.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I want to give this definitely not be where I can give.",
                    "label": 0
                },
                {
                    "sent": "I would like to give kind of a high level handwaving idea, so there is a world of stochastic modeling.",
                    "label": 1
                },
                {
                    "sent": "There is a world of individual sequences.",
                    "label": 1
                },
                {
                    "sent": "This is not going to be very precise.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The world of stochastic modeling.",
                    "label": 1
                },
                {
                    "sent": "We have a bunch of models or model of different probabilities indexed by Theta, let's say and what you see is a bunch of data coming from one of them.",
                    "label": 0
                },
                {
                    "sent": "You assume that you.",
                    "label": 0
                },
                {
                    "sent": "That's what you observe and you would like to estimate data by some Theta hat.",
                    "label": 0
                },
                {
                    "sent": "And then if you have to.",
                    "label": 0
                },
                {
                    "sent": "Some action or you have to do something after that.",
                    "label": 1
                },
                {
                    "sent": "Then you act as if they had this correct.",
                    "label": 0
                },
                {
                    "sent": "Similar to plug-in approach in statistics.",
                    "label": 0
                },
                {
                    "sent": "Now I would like to draw.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the following parallels in the world of individual sequences.",
                    "label": 1
                },
                {
                    "sent": "You make no assumption on the source.",
                    "label": 0
                },
                {
                    "sent": "You observe some data and if you can calibrate probabilities, if you can calibrate the probabilities of of possible events then you can then act as if these are true probabilities.",
                    "label": 1
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You can see this as an intermediate step, not as an end.",
                    "label": 0
                },
                {
                    "sent": "Goal.",
                    "label": 0
                },
                {
                    "sent": "Calibration is not necessarily the end goal, but there's an intermediate step for something else.",
                    "label": 0
                },
                {
                    "sent": "For instance for acting for decision-making and so forth.",
                    "label": 0
                },
                {
                    "sent": "In some sense, if you can calibrate, you can then act as if you know the mixed strategy of nature, and that leads to convergence to Nash correlated colibria.",
                    "label": 1
                },
                {
                    "sent": "You can also do Blackwell approachability as I think we're just recently nicely noted.",
                    "label": 0
                },
                {
                    "sent": "You can do in no internal regret and so forth, so you can use this as an intermediate step if you can calibrate now.",
                    "label": 0
                },
                {
                    "sent": "What would prevent us from using this as an intermediate step is that we don't really know the rates with which we can calibrate under different circumstances, and this.",
                    "label": 0
                },
                {
                    "sent": "Work gives a precise rates well in some sense precise, but there are some lower bounds we know, but they seem to be the right rates.",
                    "label": 0
                },
                {
                    "sent": "For for the problem of calibration.",
                    "label": 0
                },
                {
                    "sent": "So now we know the intermediate rates.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so if calibration and from now on I will refer to this type of calibration is classical calibration.",
                    "label": 0
                },
                {
                    "sent": "If the calibration is so nice, then why do we need checking rules?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, consider the sequence 010101 and you can find this example in other papers as well.",
                    "label": 0
                },
                {
                    "sent": "This is a hypothetical world where it rains only on even days, so if it rains only on even days.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the weatherman says 0.5 then he's calibrated because we require that in the long run your forecast of the probability matches the actual frequency of events, but no one would keep this weatherman, of course.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You would get fired so.",
                    "label": 0
                },
                {
                    "sent": "This comes up because calibration only cares about the long run frequency.",
                    "label": 1
                },
                {
                    "sent": "That's the problem only about the long run frequency, and in some sense this is the minimum requirement from the from the forecaster, whenever forecaster forecaster probability that's the minimum we would like to require, but in fact.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I can ask for more, So what?",
                    "label": 1
                },
                {
                    "sent": "What else can you ask?",
                    "label": 0
                },
                {
                    "sent": "Well, you can ask.",
                    "label": 0
                },
                {
                    "sent": "Suppose that you would like to check the forecaster in a somehow better way, so you would like to say alright, besides being calibrated in the classical sense, I want you to be calibrated on all the even rounds.",
                    "label": 0
                },
                {
                    "sent": "In that case, the frequency on even rounds is 1, but he is forecasting machines forecasting 0.5 not calibrated, so the forecaster now has to devise a different strategy.",
                    "label": 0
                },
                {
                    "sent": "You can now take the the side of the nature who really wants to break this forecaster by devising different checking rules, and the forecaster is trying to be calibrated with respect to all these checking rules.",
                    "label": 0
                },
                {
                    "sent": "Now the question is how many of these checking rules can you be calibrated against can be calibrated against 10 this calibration.",
                    "label": 1
                },
                {
                    "sent": "These checking rules can be quite involved.",
                    "label": 0
                },
                {
                    "sent": "They can say if the past five.",
                    "label": 0
                },
                {
                    "sent": "Outcomes are 010011.",
                    "label": 0
                },
                {
                    "sent": "Then I would like to check the weather forecaster knows the frequency and so forth.",
                    "label": 0
                },
                {
                    "sent": "They can complicate it.",
                    "label": 1
                },
                {
                    "sent": "So what is the right?",
                    "label": 0
                },
                {
                    "sent": "What is the right notion?",
                    "label": 0
                },
                {
                    "sent": "What is the right complexity that?",
                    "label": 0
                },
                {
                    "sent": "Inherent to this.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Problem.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me actually go into the setup.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "40 rounds The player chooses a mixed strategy.",
                    "label": 1
                },
                {
                    "sent": "Mixed strategy is a distribution over the moves of the player.",
                    "label": 0
                },
                {
                    "sent": "Moves of the player are probabilistic forecasts and therefore the mixed strategy is a distribution on the simplex distribution over distributions.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The adversary picks an outcome.",
                    "label": 1
                },
                {
                    "sent": "I have to say that we have K possibilities, so it's not just rain, no rain, but also hail and so forth.",
                    "label": 0
                },
                {
                    "sent": "So there are K outcomes there associated with vertices of the simplex.",
                    "label": 0
                },
                {
                    "sent": "An outcome is one of these verticies.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then the player draws his forecast from his from his mixed strategy.",
                    "label": 1
                },
                {
                    "sent": "Right now this is exactly what we want.",
                    "label": 0
                },
                {
                    "sent": "It's this repeated interaction with the adversary, and so we have a great hope that we can just put it in the framework that we that Kartik talked about and then get get some results.",
                    "label": 0
                },
                {
                    "sent": "I accept I didn't tell you how to define the measure of what is the regret.",
                    "label": 0
                },
                {
                    "sent": "What is the measure of goodness?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so to do that, let me introduce precisely the checking rules.",
                    "label": 0
                },
                {
                    "sent": "Checking rules depends on history.",
                    "label": 1
                },
                {
                    "sent": "History is nothing but a forecast which is a member of the simplex and the vertex of the simplex.",
                    "label": 0
                },
                {
                    "sent": "That's actual outcome.",
                    "label": 0
                },
                {
                    "sent": "So a history is just up to T -- 1.",
                    "label": 0
                },
                {
                    "sent": "What happened?",
                    "label": 0
                },
                {
                    "sent": "The forecast based checking rule is just a mapping.",
                    "label": 1
                },
                {
                    "sent": "It's 01 mapping from the history and the current forecast of the player.",
                    "label": 0
                },
                {
                    "sent": "OK, OK, what's the calibration metric?",
                    "label": 0
                },
                {
                    "sent": "This form that we've seen before, except that now it's a supremum.",
                    "label": 0
                },
                {
                    "sent": "Overall checking rules, so we want kind of check the worst checking rules rule, and then we're going to pick those rounds.",
                    "label": 0
                },
                {
                    "sent": "So that's going to be 01.",
                    "label": 0
                },
                {
                    "sent": "We're going to pick a certain round where certain rounds where the checking rule turns on, and on those rounds, on average we would like the average of our forecasts to match.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Frequency of the events right?",
                    "label": 0
                },
                {
                    "sent": "So that is, that is the definition of checking rules.",
                    "label": 0
                },
                {
                    "sent": "So the class of checking rules is summarized in some collections data in a way that the function class summarizes a bunch of functions, yes?",
                    "label": 1
                },
                {
                    "sent": "The number of times to check in through Spired and then just take those sequences when that goes to Infinity and so that.",
                    "label": 0
                },
                {
                    "sent": "So here if checking rule.",
                    "label": 0
                },
                {
                    "sent": "If you let you go to Infinity and checking rule only checks a finite small number, it's not even turning up, so this only cares about those checking rules that fire many times.",
                    "label": 0
                },
                {
                    "sent": "Checking those can fire with different relative frequency.",
                    "label": 0
                },
                {
                    "sent": "So what I'm saying is that maybe it would be more natural.",
                    "label": 0
                },
                {
                    "sent": "Maybe maybe it would make analysis a bit more, but this is a bit similar to Brier, Brier score.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, So what are the examples?",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The classical epsilon calibration is nothing but a specific family of checking rules.",
                    "label": 0
                },
                {
                    "sent": "So whatever Jake talked about before that's a corresponds to these checking rules.",
                    "label": 0
                },
                {
                    "sent": "There is a checking role corresponds to each probability forecast P associated with HP, and what it does is, it looks, did the forecaster did this weatherman predict close to 70%?",
                    "label": 0
                },
                {
                    "sent": "If yes, it's going to be on, so then it's going to pick those rounds.",
                    "label": 0
                },
                {
                    "sent": "When the weatherman checked, when the weatherman forecasts 30% probability of rain.",
                    "label": 0
                },
                {
                    "sent": "So that's the classical epsilon calibration, and we do show that you can actually do it for all epsilon uniformly and you get well calibrated forecasting.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, but this is actually another example which is even more interesting.",
                    "label": 0
                },
                {
                    "sent": "Suppose you have a number of probabilistic models.",
                    "label": 0
                },
                {
                    "sent": "Be fade, each P Theta will give you a forecast on the given round given the history.",
                    "label": 0
                },
                {
                    "sent": "So it's just the conditional distribution.",
                    "label": 0
                },
                {
                    "sent": "And now let's create a family of checking rules such that which is associated with each member of this model, which each possibility for different data and with a forecast.",
                    "label": 0
                },
                {
                    "sent": "Possible forecast P and let's check whenever the model whenever the forecast but made by the probabilistic model falls close to this P. In this case what we're doing is we're testing whether a model A probabilistic model is a better fit to data than what we're doing, and if the forecaster is able to.",
                    "label": 1
                },
                {
                    "sent": "Calibrate with this type of checking rules.",
                    "label": 0
                },
                {
                    "sent": "Then he's doing as well as a set of probabilistic models, which is somehow provides a link between these two worlds, maybe even a bit relevant too.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Something that Peter Greenwald talked yesterday, I guess.",
                    "label": 0
                },
                {
                    "sent": "So here's a value of the game.",
                    "label": 1
                },
                {
                    "sent": "This is exactly what Karthick defined in the previous slide previous talk, but here we put an indicator, so we're going to be interested in probability is not expectations, but nothing really changes.",
                    "label": 0
                },
                {
                    "sent": "It's the same formulation.",
                    "label": 0
                },
                {
                    "sent": "It's an indicator that this calibration metric is above data.",
                    "label": 0
                },
                {
                    "sent": "This is the value of the game that depends on Theta, and it's nothing but the probability that calibration metric is above a certain threshold Theta.",
                    "label": 0
                },
                {
                    "sent": "Instead of expectation, you can do even something better.",
                    "label": 0
                },
                {
                    "sent": "You can put the something related to a moment generating function here.",
                    "label": 0
                },
                {
                    "sent": "Still the results would go through an.",
                    "label": 0
                },
                {
                    "sent": "One would then get the almost sure convergence, so one one can.",
                    "label": 0
                },
                {
                    "sent": "One can put stronger requirements here than just the indicator of being above a certain level.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, and.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would turn the crank with only difficulty being that checking rules depends on the history and whatever Karthik talked about there was no such.",
                    "label": 0
                },
                {
                    "sent": "It didn't allow for such dependence on the history, but it's not difficult to put it in a bit more math.",
                    "label": 0
                },
                {
                    "sent": "Basically, by doing Symmetrization again, that's what saves us.",
                    "label": 0
                },
                {
                    "sent": "This is the savior.",
                    "label": 0
                },
                {
                    "sent": "By doing symmetrization, one can remove all this complicated stochastic process that's going on.",
                    "label": 0
                },
                {
                    "sent": "In this mean Max Min, Max, Min, Max and one can just go to the stochastic process, which we're the only randomness comes from Rademacher Random variables.",
                    "label": 0
                },
                {
                    "sent": "OK, that's the only randomness and let's not pay attention to.",
                    "label": 0
                },
                {
                    "sent": "This is basically over discretized histories.",
                    "label": 0
                },
                {
                    "sent": "This is nothing but a supremum over the set of checking rules of submartingale.",
                    "label": 0
                },
                {
                    "sent": "And we know how to deal with that.",
                    "label": 0
                },
                {
                    "sent": "So once we get into this form.",
                    "label": 0
                },
                {
                    "sent": "This is a sequential Rademacher.",
                    "label": 0
                },
                {
                    "sent": "The idea is that now we can do the covering number just the way that we did.",
                    "label": 0
                },
                {
                    "sent": "Covering number in the statistical learning theory and statistical learning theory.",
                    "label": 0
                },
                {
                    "sent": "One would get super function class of some empirical process which can then be symmetrized.",
                    "label": 0
                },
                {
                    "sent": "Here it's a supremum over checking rules of a some kind of martingale process right, but the idea is the same.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And by doing something that I guess it goes back to vaping or something, you can upper bound.",
                    "label": 0
                },
                {
                    "sent": "This by looking at the centers of the cover and then losing it a little bit and you have exponentially decaying tail.",
                    "label": 0
                },
                {
                    "sent": "As long as this covering number is not exponential, we're all set.",
                    "label": 0
                },
                {
                    "sent": "So now the game.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Reduces to upper bounding sequential covering number.",
                    "label": 1
                },
                {
                    "sent": "This is not the usual covering number.",
                    "label": 0
                },
                {
                    "sent": "This sequential covering number because we're in this sequential setting OK.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what kind of checking rules can we work with?",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If whenever you have a finite class of checking rules, so if you try to come up with 20 checking rules no matter what they are.",
                    "label": 1
                },
                {
                    "sent": "We'll be able to have a 1 / sqrt T rate for calibration, so there exists a strategy for the player.",
                    "label": 0
                },
                {
                    "sent": "For the forecaster that achieves this rate.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If checking rules are history invariant, then checking rule is nothing but a mapping from a simplex in 201.",
                    "label": 0
                },
                {
                    "sent": "That's our favorite concepts with VC dimension.",
                    "label": 1
                },
                {
                    "sent": "Could visit dimension could be bounded or little stone dimension could be bounded.",
                    "label": 0
                },
                {
                    "sent": "You would get a familiar form which is square root of VC or square root of littlestone divided by square root of T.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And as a corollary, we get classical calibration result with K actions and the calibration deviation being measured by L1 norm.",
                    "label": 1
                },
                {
                    "sent": "And that gives you 1 / sqrt 2 rate with K squared outside.",
                    "label": 0
                },
                {
                    "sent": "But at least it's the rate does not depend on the number of actions, and this to our knowledge this is not known.",
                    "label": 0
                },
                {
                    "sent": "Maybe Viani proved there's something like this is about the same time but with a different method, but this rate.",
                    "label": 0
                },
                {
                    "sent": "I think was not known.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And if you allow all completely arbitrary measurable history invariant checking rules.",
                    "label": 1
                },
                {
                    "sent": "This corresponds to a result by Manor installs, and you would get a rate which suffers from the curse of dimensionality 'cause you calibrating against the world measurable sets.",
                    "label": 0
                },
                {
                    "sent": "OK, we don't know.",
                    "label": 0
                },
                {
                    "sent": "By the way, this is an open question.",
                    "label": 0
                },
                {
                    "sent": "We tried and we do not know if even in two dimensions, whether this is the right rate.",
                    "label": 0
                },
                {
                    "sent": "That's a very difficult problem.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You can go to more checking rules.",
                    "label": 1
                },
                {
                    "sent": "I'm not going to go into detail if you have time dependent, but history invariant one can get a nice covering argument going and bound the rate if history is represented by a smaller set in.",
                    "label": 1
                },
                {
                    "sent": "Otherwise you have a bounded memory where you store your past history.",
                    "label": 0
                },
                {
                    "sent": "Then again there is a covering argument that bounds this limited memory.",
                    "label": 1
                },
                {
                    "sent": "Look back and this is one of them.",
                    "label": 1
                },
                {
                    "sent": "I guess.",
                    "label": 0
                },
                {
                    "sent": "Interesting ones if checking rules require a.",
                    "label": 0
                },
                {
                    "sent": "Some polynomial number of additions, multiplications and so forth.",
                    "label": 0
                },
                {
                    "sent": "Then the VC dimension is not too big and then one can bound the covering number yet again and show that there exists a strategy which calibrates against this set of checking rules.",
                    "label": 0
                },
                {
                    "sent": "In other words, if you want to try to break the calendar, the forecaster by devising a set of checking rules you really have to have a lot of computation on your at your hands.",
                    "label": 0
                },
                {
                    "sent": "Don't take home message.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There is a lower bound one over square root T. I'm just going to quickly show there is no way to improve kind of one over scores of dependence.",
                    "label": 0
                },
                {
                    "sent": "This is for classical calibration.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And last two points were going to go very quickly.",
                    "label": 0
                },
                {
                    "sent": "Being calibrated can be viewed as a negative result.",
                    "label": 1
                },
                {
                    "sent": "There's a whole testing literature out there.",
                    "label": 0
                },
                {
                    "sent": "Alvaro Sandroni is the main guy.",
                    "label": 0
                },
                {
                    "sent": "You can take a point of view of nature and you can say I'm going to try to devise checking rules.",
                    "label": 0
                },
                {
                    "sent": "Such that I test whether the forecaster knows what he's talking about, the weatherman who is calibrated in the sense that I described, can do so without knowing what weather is.",
                    "label": 0
                },
                {
                    "sent": "In other words, is there a way to devise a set of checking rules such that you can distinguish someone who knows the stochastic process?",
                    "label": 0
                },
                {
                    "sent": "From the from the one that doesn't right, it's very interesting example, so you can turn it around and see calibration as a negative exam.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, and then finally the final remark.",
                    "label": 0
                },
                {
                    "sent": "There are very close related ideas and as we understand in the past few years calibration, no internal regret.",
                    "label": 1
                },
                {
                    "sent": "Blackwell approachability.",
                    "label": 0
                },
                {
                    "sent": "Online optimization.",
                    "label": 0
                },
                {
                    "sent": "There are reductions from several of them, and it's kind of exciting.",
                    "label": 0
                },
                {
                    "sent": "We have now a framework where we can analyze all of them in the same same platform and get.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right complexity efficient algorithms is kind of the big open question and there are some more further directions further work.",
                    "label": 1
                },
                {
                    "sent": "Thank you, thanks.",
                    "label": 0
                },
                {
                    "sent": "I'm so I wonder, is there any, maybe even more connections to more things there are these papers by Falcon cognition about weak predictive complexity?",
                    "label": 0
                },
                {
                    "sent": "Which is a generalization of Kolmogorov complexity, so you're not familiar with it.",
                    "label": 0
                },
                {
                    "sent": "I'm not, but this is getting closer to color complexity with the number of computations that you would need to figure out if he knows what he's talking about.",
                    "label": 0
                },
                {
                    "sent": "So they talk about version of Kolmogorov complexity for things like absolute loss in 01 loss, where you can't get you also get a sqrt T basically in your.",
                    "label": 0
                },
                {
                    "sent": "If you look at the difference between two different prediction algorithms.",
                    "label": 0
                },
                {
                    "sent": "And so I would guess that any kind of results you get would be.",
                    "label": 0
                },
                {
                    "sent": "Let's see, would be a lower bound and upper bound on this week complexity.",
                    "label": 0
                },
                {
                    "sent": "But you haven't looked at it.",
                    "label": 0
                },
                {
                    "sent": "There should be some relation there.",
                    "label": 0
                },
                {
                    "sent": "Pastor mark you had these rates up there.",
                    "label": 0
                },
                {
                    "sent": "Could you back a couple of slides?",
                    "label": 0
                },
                {
                    "sent": "Do you mind?",
                    "label": 0
                },
                {
                    "sent": "I don't.",
                    "label": 0
                },
                {
                    "sent": "You're like a list of rates one, so it's much later.",
                    "label": 0
                },
                {
                    "sent": "I think that's the one thing about Keynote.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are these the rates?",
                    "label": 0
                },
                {
                    "sent": "So what is it that corollary?",
                    "label": 0
                },
                {
                    "sent": "What is that value to you?",
                    "label": 0
                },
                {
                    "sent": "It's the, so it's an old one.",
                    "label": 0
                },
                {
                    "sent": "Calibration score.",
                    "label": 0
                },
                {
                    "sent": "So you're summing up over every single out over an epsilon grade of the probabilities in place is Supreme over the worst been taking some of the worst pain with the L1 over the difference in the accuracy is usually when you say the L1.",
                    "label": 0
                },
                {
                    "sent": "OK, that's just a deceptive difference again.",
                    "label": 0
                },
                {
                    "sent": "So actually, just on this light, when you have the finite clear class, are you saying it doesn't depend on the cardinality of the class or just didn't deal with the carnality of the class of checking rules?",
                    "label": 0
                },
                {
                    "sent": "Oh no.",
                    "label": 0
                },
                {
                    "sent": "So yeah.",
                    "label": 0
                },
                {
                    "sent": "OK, yeah, definitely Colonel Sanders.",
                    "label": 0
                },
                {
                    "sent": "Questions.",
                    "label": 0
                },
                {
                    "sent": "Says there some intuition about why the learning rules the checking rules that depend on a longer history are not more complex than the ones that depend on short history.",
                    "label": 0
                },
                {
                    "sent": "They are.",
                    "label": 0
                },
                {
                    "sent": "So if they depend on longer history than there are more expressive and you can, you can do more now, But suppose I take a finite family of rules that depend on a very long history versus a finite family of rules that depend on very short history then at least.",
                    "label": 0
                },
                {
                    "sent": "Over Finite's for a finite human.",
                    "label": 0
                },
                {
                    "sent": "I don't know the answer.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I don't know why.",
                    "label": 0
                },
                {
                    "sent": "Leora Sandroni, as they define their checking rules as a big set with a probability measure on it, and they saw that can be created respect almost every checking words in this set with respect to the problem.",
                    "label": 0
                },
                {
                    "sent": "Users can this week over from your result.",
                    "label": 0
                },
                {
                    "sent": "So they don't get any rates.",
                    "label": 0
                },
                {
                    "sent": "First of all, they are.",
                    "label": 0
                },
                {
                    "sent": "It's just a limited result.",
                    "label": 0
                },
                {
                    "sent": "They have a little bit different notion of forecast based checking rule which might make it.",
                    "label": 0
                },
                {
                    "sent": "It might not follow from these results.",
                    "label": 0
                },
                {
                    "sent": "OK, we're out of time.",
                    "label": 0
                },
                {
                    "sent": "Let's thank Sasha.",
                    "label": 0
                }
            ]
        }
    }
}