{
    "id": "fi755jn7bjp3774hvo6ajg37irweowvo",
    "title": "Repositories Management",
    "info": {
        "author": [
            "Michael Schneider, FZI Forschungszentrum Informatik"
        ],
        "published": "June 20, 2011",
        "recorded": "May 2011",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2011_schneider_repositories/",
    "segmentation": [
        [
            "Alright, so we now come to the technical part.",
            "In the second half of the.",
            "Off the tutorial.",
            "The first talk will be on repository management.",
            "I am the replacement of battery and motor from STI innsbrook over and created these slides and so I will present on behalf of."
        ],
        [
            "So this is the overall architecture of.",
            "Platform which has in its core the scene service manager and the runtime Evaluation Service, which is responsible for running evaluations.",
            "And there are.",
            "Four different repositories in the system.",
            "The first is the evaluation Description Repository service, which stores evaluation descriptions.",
            "We will come to this later in a second separate talk, and what this is about when we talk about evaluation descriptions which define evaluations.",
            "In this talk we will talk about these three repository services.",
            "This is the test data repository service which stores and test data.",
            "Which is used in the evaluation.",
            "The tool repository service which stores tools the tools to be evaluated, and finally the results repository service, which is about storing the results of the evaluation."
        ],
        [
            "So the Seals repository's well, as I said, the test data repository service is responsible for storing test datasets and not only for well.",
            "In most cases it this will be some static data which is stored and can be retrieved afterwards.",
            "But it's also possible it's a bit more flexible.",
            "It's also possible to store just references to existing test data, and which another thing that is actually used in the science project is the option to have.",
            "Test data generated on demand and for this it is possible to richest.",
            "Test data generators.",
            "In the repository.",
            "The truth repository has said is just, well, just as that it stores tools.",
            "And the Resource Repository stores results, and we distinguish costly between two kinds of results.",
            "The first kind is the raw data.",
            "The second kind is interpretation.",
            "Interpreted.",
            "Results and it's in the end.",
            "It's up to the to those who define the evaluations, how whether they use this distinction at all, and how they what they understand under the wrong results and under interpreted results.",
            "But costly, one can say.",
            "The data that comes out directly from from the tools and it's the raw data is the result.",
            "For example, for a reason, and this could be just the outcome of yes, no unknown or some error and interpret interpretation.",
            "This could be, well, the classification of the outcome, or let's say aggregation of several outcomes from several tools, building statistics from it so.",
            "This these are different kinds of impossible interpretations.",
            "And the test data repository service makes this distinction how it is used to stand up to the truth.",
            "Those who create the evaluation."
        ],
        [
            "So about the."
        ],
        [
            "Architecture of the of these services of these repository services.",
            "So in general there is a distinction between artifacts and artifact versions.",
            "Aren't you you?",
            "You can.",
            "Well we have worsened with versions systems like SVN or CVS as you know it.",
            "So you store for example test data and then you find that the test data has changed overtime or there was an error or whatever.",
            "So you can start another version of the same test data and what you do is an artifact is more is more.",
            "Virtual kind of thing so you register some test data set and, but this is not the test data as such for the moment.",
            "After you have registered this test data, you can store versions a sequence of versions, history of versions as you like.",
            "So this is the concrete version and OK here in here.",
            "The example is for a tool.",
            "I have made an example for test data."
        ],
        [
            "So and well, there was the artifacts and their versions.",
            "On the one hand side and there is some meta data that is stored with these artifacts.",
            "On the other hand.",
            "Yes I will.",
            "They are stored separately, but I will.",
            "I will go into details later."
        ],
        [
            "About this what you can see here is, so before we had we had this overall architecture of the of the six platform and we had these pack.",
            "Storage systems and now we look into into these storage systems and this is the few here.",
            "We have on the bottom at the bottom we have two storage is 1 in RDF repository which stores the meter data and file repository which stores the actual artifacts so the artifacts, versions, test data or tools or results.",
            "Then there is some internal interface and well, yes to the different repositories.",
            "Which is in Java and this is well, it's there.",
            "It provides, provides, makes iaccessible the whole functionality of the system.",
            "But this is not the interface as it is used by users or the platform itself.",
            "The actual external interfaces a rest interface.",
            "Well, so it's based on HTTP and you have these typical methods.",
            "Put our store to store some new resource and get to retrieve it again.",
            "Put for some update operations and delete.",
            "We are.",
            "We even make it.",
            "Possible to delete?",
            "Artifacts.",
            "For, for example, if someone and some provider decides that this particular version shouldn't be available anymore, so this is something deletions.",
            "For example, in S when you don't have.",
            "You don't have real deletions.",
            "Things will always be available.",
            "They are perhaps not visible anymore, but you can go back to previous version and then you can see it again.",
            "But we allow for real deletion just for example for legal reasons.",
            "Um?",
            "OK, now to the to the different layers."
        ],
        [
            "The storage layer has said consists of at 10.",
            "On the one hand, and a file repository and narrative repository.",
            "Yeah, well, I think I've already said what what's the purpose?",
            "They store the actual things.",
            "The tool tool for example, and the RDF repository.",
            "Everything all the meter data and everything.",
            "All the information that is needed.",
            "For example, if you have several versions, then this versioning information is also stored in the RDF repository just as well as information who created that tool when and so on.",
            "That's all.",
            "And RDF graph, and that's in the RDF repository.",
            "And well, yes, one can have access to this then.",
            "Bye."
        ],
        [
            "Marshall queries, so then this internal interface layer.",
            "This Java and interface.",
            "I said this is this is not the interface that just made public, but so I think I won't tell much about it because this is not something that one tip."
        ],
        [
            "Lizzies it's some kind of SPI API.",
            "And then the external layer restful interface has already said.",
            "Right, well I already explained it.",
            "It's a real rest interface and you can have, for example you can you can.",
            "You can post you can post the tool version for example and afterwards you can get.",
            "The meta data for this for this this tool or the tool itself."
        ],
        [
            "And I will.",
            "Soon show exactly what what the these operations are."
        ],
        [
            "Managing entities well.",
            "When I talk about entities here, I'm always mean tools or results or test data items.",
            "So we will later come to these different things, but at the moment still we have all these entities, all these as an abstract entities.",
            "The meter data for them is RDF XML encoded OK.",
            "It's RDF that is started in RDF store and can be retrieved with Sparkle.",
            "Um?",
            "The there is this meta data that is stored in the moment when when a tool is registered or version is stored and it is used well.",
            "Among other things, yes, to identify or to.",
            "Well, to search for entities so with sparkle you have quite some options to search and say.",
            "For example, I want to have all the tools that have been created before some date."
        ],
        [
            "Storing the entities.",
            "Yes, it's it's the other stuff we have the meta data and it's now the entities themselves tools, for example.",
            "They're posted with this with this.",
            "Restful interface.",
            "Um?",
            "Allison, OK, the Artifact version is this is a concrete interfaces.",
            "A concrete thing then that can be stored get pushed.",
            "Eden poster already said these are the 4 four methods that can be used to get to access the tool or meter data.",
            "Put to update meta data.",
            "This is also an option that we have that for example is not available in this win.",
            "We can go down to a version and update.",
            "And updation it's meta data.",
            "We can delete it.",
            "I already said said it and there is a special thing we can we can actually publish an artifact.",
            "This is special.",
            "Just storing just storing a tool, for example doesn't yet make it available for the for the evaluation.",
            "So we have this fine grained and way too.",
            "Also to say this tool is not yet ready for for evaluation we might.",
            "We might live well.",
            "Um?"
        ],
        [
            "OK, accessing entities every every N, every artifact.",
            "We will have an identifier.",
            "This is basically UI which.",
            "Precisely and uniquely identifies this thing, and by means of this identifier, one can then access the.",
            "Artifact afterwards again.",
            "It's auto generated this identifier when when one starts, for example a tool.",
            "And there are certain URL schemes that match the.",
            "Well, that that are typical for for restful, for restful."
        ],
        [
            "Services and I will show them later.",
            "So now we can come to the test data repository serve."
        ],
        [
            "The manager said test data collections.",
            "And actual test data versions.",
            "And well, this is the repetition from from earlier on.",
            "The one hand, there is persistent.",
            "Static test data that is typically not not changed, at least not for a version or a reference to some data that is that exists somewhere else on the web, for example.",
            "And this generating option that the test data isn't isn't there in a persistent way, but you have a generator and the generator creates the data on demand.",
            "And this is the visualization that you have this virtual test data artifact and then different versions and every.",
            "And then there's the distinction between the data and the metered."
        ],
        [
            "There are well over made in or meta data is with respect to some.",
            "Some ontologies we have we have a generic seals ontology which I haven't shown here about.",
            "We have a test.",
            "We have 10 specialized ontologies for the different item types.",
            "Test data.",
            "For example.",
            "This is an excerpt from the Test Data Ontology.",
            "We see we have and we have a class test data which is a subclass of a generic class artifact.",
            "The artifact classes defined in the generic since metadata specification in the seals on Teologi and test data is a class of the test data ontology and we have test data versions as a class which is then a subclass of artifact version and test data, whereas said there can be different kinds of test data.",
            "Consistent test data.",
            "External test data and synthetic or general generated test data or in this case it's the generator.",
            "These are all subclasses."
        ],
        [
            "Um?",
            "Well, it's it's XML I am.",
            "I don't tell him much about it.",
            "This is the new meta data description in XML, so there is a name.",
            "There is a description of the whole of the whole test data of the virtual test data artifact and for the different versions there is.",
            "Version number, also a description for this particular version.",
            "That's just the format."
        ],
        [
            "And here are the.",
            "These are the rest.",
            "Methods.",
            "So when you when you create when you register new, the new test data collection without without yet having a certain test data where the test data itself just just this virtual object.",
            "Then this is to your eyes scheme, well, some domain.",
            "This can be anything, but then test data and it's persistent to distinguish it from, for example, generated the generated stuff and the rest operation.",
            "The rest method disposed in this case where this is not so relevant here and then you.",
            "I'm.",
            "You submit the meta data and then into."
        ],
        [
            "Registered.",
            "And when you want to read when you want to.",
            "Retrieve the metadata for the for this.",
            "This version then you use the rest method on the HTTP method get.",
            "And tell that the expected media type should be RDF.",
            "These two informations specify the method to say the operation.",
            "To say that the meter data for the.",
            "For the.",
            "For this artifact should be retrieved.",
            "You can use put to update the meta data.",
            "This is not.",
            "Yes, it's right, there is always.",
            "There is always a current.",
            "Almost always, there is almost always a current.",
            "The current version.",
            "If there is a version, then there is a current version and and the whole history of older versions.",
            "So you are this is a convenience method to just access.",
            "I get and saying that the mimetype is similar, then you get the current version.",
            "But you can also access specific versions by get and, so I think this is not quite right.",
            "What we I think this should be.",
            "Get and zip here and you should be able then to get the.",
            "That particular version.",
            "OK, I think I think here is a bug.",
            "Here is an error when I when I look at this.",
            "So the basic idea is it is possible to access a specific version using such such a UI scheme.",
            "And then get and then plus zip and then you will get it."
        ],
        [
            "OK. OK, this is just to say this is specific for test data becausw we found in the project.",
            "It's not very convenient to have.",
            "Access to a whole test suite in general.",
            "So there are 1000 or so different test cases within and every test suite.",
            "Well consists of several test cases, so it is possible to have a more fine grained access to the specific test cases or test data items.",
            "So when this is supported here as well, you see for a test suite you can access an item then."
        ],
        [
            "OK.",
            "Yes, just a few words about the test data generators, as I've already explained the their purpose and there are just to say there is an API that has to be by those who create.",
            "I'm such a test and data generator and then it is and then it is available from from the system."
        ],
        [
            "That"
        ],
        [
            "This repository service, well, managers, tools and tool versions just exactly in the same way As for test data.",
            "You're again have this abstract tool and then the different versions, and then you have the meta data for the tool and specific meta data for the versions.",
            "And of course the.",
            "Well data, well this is the tool in this case this is the.",
            "The supplier that makes up the tool.",
            "Now here the tools are expected to be packaged such that they can be integrated in an evaluation workflow.",
            "When I read this, I just don't know whether the weather, the test data repository makes validation on this format.",
            "No no.",
            "OK, future feature, I don't know.",
            "So so it looks to me that it's just a zip file in the end which is stored and then whatever it is, it is probably not not validated.",
            "Would be good to have some validation on it OK."
        ],
        [
            "It came to mind, and so when there was again specific ontology for for this describing tools, the meta data, which is which underlies the meta data.",
            "Again, we have artifact, an artifact version from the upper on column.",
            "Well, since up ontology, so to speak, and then specific classes tool and tool version as directly derived classes.",
            "And we have 4 for Atul.",
            "Property has two category and we have five different categories in the scenes project.",
            "This is for ontology engineering tools reasoning or storage systems.",
            "Ontology mapping, semantic tool and semantic web service and this is specified."
        ],
        [
            "And finally the results."
        ],
        [
            "Pozza Tori service.",
            "What are the limits on the languages and technologies you would support for tools?",
            "The limits of.",
            "Java tools in Milani.",
            "Things about know not only Java tools, but it's better that Miguel explains this because this is, well, this is basically what we just discussed there is.",
            "You can put there whatever you want in a sense, but what?",
            "It's actually a thing what the runtime evaluation service is able to manage to execute.",
            "Amended.",
            "The only thing is that in order to plug the tune with the platform, you have to develop a specific Java piece of code which is a coverage analysis enables the communication between the two and the runtime valuation service.",
            "That's.",
            "And then there's some support for existing.",
            "Kind of software repository systems like Maven for Java, anything like somebody Unix based systems like to get towards.",
            "12:00 PM.",
            "What day did you integrate with any existing repository systems for software for managing the tools are used within the path more for consuming them or publisher tool?",
            "Could I give you made in description for example?",
            "No, not really.",
            "You have to conform to what we already have in the product mix at this picture format an iPod.",
            "This format that we have to to follow in order to package everything and populate into the repository and in that repository.",
            "So there aren't any value service can understand it and use it later on the transaction.",
            "Could you clarify or give more details of how do you mean by synthetic test data and?",
            "How your synthetic test data generator is producing?",
            "Does it have to be confirmed?",
            "To certain kind of.",
            "Conditions, so first of all and the test well that the.",
            "One and this can be answered on a more generic level.",
            "You can put any test data in that you like, whether this is generated or not doesn't make a difference from this point of view, so right and you have to, you have to come test data as to conform to the.",
            "You have some fine point way to describe your test data and if you have test data you have to create meter data which is stored together with the test data and then it's completely up to you what how you organize this.",
            "And then you have pretty much freedom.",
            "And so this this generator is more or less like annotation.",
            "No no no no wait what I just said is this is generally the case for test data.",
            "Whether it is generated or not doesn't make a difference from this point of view.",
            "So you what you have to do, what you have to.",
            "Create is a test data generator which implements a certain API and this creates then whatever.",
            "So it stand up to you and to have only you know about the internal structure of the test data.",
            "So you have to make sure you have you have the.",
            "I didn't show everything here you have.",
            "You have some some ways to describe meta data which which.",
            "And you have the option to to make what you know.",
            "The only thing that is that is fixed is that you have a suite consisting of test data items.",
            "OK, in the end this is everything.",
            "What's the format of these test data items?",
            "No one knows, only you or better say only those people who who create the value defined evaluation.",
            "They have to know what's the format is and they have to.",
            "Well, they have to make.",
            "I will show this in the in the second talk, but the cases.",
            "You can access via the test data repository single test data items and four for the test data repositories.",
            "These are just.",
            "Big chains OK, so how to interpret them?",
            "Stand up to the valuation?",
            "The value in the MD within the evaluation which is described within the evaluation description.",
            "There is this access to the test data repository and say give me that that well it loops over test data.",
            "Give me that and that test data item which comes there, justice bit streams and then the evaluation has two.",
            "Make the best of it and the evaluation.",
            "Those guys who create the evaluation know how the have to know how the test data is, what the format is and then have to create some what we call custom procedure for which splits up.",
            "For example the test data item into its different files or whatever.",
            "So this is not something that the test data repository is responsible for the test data repository is only responsible for maintaining this cost structure of having the whole suite and the different test data items within everything else is up to the evaluation description later, and this is a different topic.",
            "OK, does that mean for every tool you want to evaluate it using this platform they need to have a synthetic synthetic know, know, know, know, know first of all, not for every, not for every tool.",
            "This is not true.",
            "Well, tools of course.",
            "Well, maybe it's also possible that I get you wrong now that certain tools can be tested with certain test data.",
            "Clearly not every tools can be tested with every test data.",
            "This is also also think that that it will come true later when I talk about the evaluation descriptions.",
            "We have these different kind well on a cost level.",
            "We have these different kinds of.",
            "Well, we have this reasoning and we have these different categories so and.",
            "At least at least.",
            "It's all up to the even.",
            "Let's say it, so it's all up to those who create the evaluation to make sure that things match.",
            "So you you can of course have a tool, some tool, whatever some reason and get some tests to make access to some test data for.",
            "Whatever.",
            "Ontology engineering and testing and then put this into the reasoner and it may work or not.",
            "The point is that those who have you have some categorization.",
            "So if you have, if you have, if you have a tool that has different, has a users test data from a different category, it will probably be rejected but within a categorization within a category that makes may still be mismatches.",
            "And then those who create the evaluation.",
            "To make sure that everything works.",
            "This this cannot be perfectly enforced automatically.",
            "OK, so it's quite quite some responsibility on those who define the evaluation.",
            "They now have to know the test data.",
            "The test data don't have to come from themselves, but they have to know the format of the test data.",
            "They have to know.",
            "About the tools.",
            "What they can do, what they expect and so on, and what they give the same father.",
            "We start with the next thing that I come to.",
            "The tools give some results.",
            "Those who create the evaluation have to know what the format is.",
            "So one curve one could start and have some extremely sophisticated support for this and have all kinds of formal specification stuff so that you can do some automatic checking, But this will.",
            "This would just make the everything much more difficult and it would wouldn't be perfect.",
            "It would never be perfectly possible to do it.",
            "So it's in the end the one who creates the evaluation is responsible for that.",
            "Everything matches fine and, well, you can.",
            "You can check it and test it locally and then see how things work fine and then so from a pragmatic point of view that it works in general.",
            "OK, finally the Resource Repository service where OK.",
            "Manage this access Rory Sultan interpretations.",
            "And again, so this is also point here.",
            "The results repository has no idea.",
            "About any format.",
            "What what Aurora scientists put into interpretation is it doesn't know about it.",
            "It just makes the suspension.",
            "So those who want to store it separately have away have a means to store it separately.",
            "That's it.",
            "It's it's not a clever.",
            "It's not a clever thing.",
            "It's not.",
            "It doesn't have any.",
            "Any idea about some format, because it's the same As for test data.",
            "It result can be everything."
        ],
        [
            "And there was again.",
            "Specialized ontology artifact from the scenes ontology then result distinct distinction between two classes.",
            "Rather resulted into interpretation.",
            "And the result refers to some result category.",
            "And there is, yes, an internal interpretation always belongs to some result we 1st December or so.",
            "As you see, it's all very cause.",
            "There is.",
            "It doesn't go much deeper.",
            "Not much, no much finer granularity becausw.",
            "We don't.",
            "It's not that we we are the whole project and the whole platform.",
            "So in sales is very generic in the end.",
            "We have different tool categories right?",
            "But even this could be extended to other tool categories and we can have all even if we would only talk about treasonous, there would be so many different kinds of test data that are possible and so many different and different kinds of results.",
            "And for other tool categories it's perhaps even more different ways.",
            "What can work.",
            "Results can be, so making any assumptions about format.",
            "Won't won't lead to.",
            "Meaningful and I believe so.",
            "It's in the end in the hands of the evaluator."
        ],
        [
            "OK, this war this for the whole this was fast.",
            "This was meant to take an hour and it's now just half an hour.",
            "Any questions?",
            "More questions.",
            "I should put this on the slides.",
            "If not, then I will do my second.",
            "OK, is this evaluation entirely about the quality of the service?",
            "Also by the functionality of the service, I don't understand this question.",
            "How?",
            "How much does it work?",
            "Or does it ask you mean you mean the result?",
            "OK, this is great.",
            "OK well this is result.",
            "This is results.",
            "This is totally up to two the evaluation, so some.",
            "In some cases it may be maybe only about it might.",
            "Well it may be about functionality, it may be about robustness or whatever.",
            "So this is something that is specified for the evaluation.",
            "And we are here on the technical on the platform side.",
            "No assumptions on this.",
            "You have the option to store.",
            "Interpretations OK and what this means.",
            "This would be an interpretation so the services have some degree of robustness, for example.",
            "You have a lot of raw results and you see there are certain exceptions have been thrown by the by the system.",
            "Then you have to go down and see what kind of exceptions.",
            "Without this.",
            "Did they came from the platform that they came from the tool?",
            "What kind of exception was it?",
            "Was it?",
            "Was it some internal exception or whatever?",
            "This has to be analyzed then.",
            "If if this is if This is why if this is desired from the evaluation and then you can you can have.",
            "Some categorization and say this tool has a certain robustness.",
            "This tool has a certain coverage of functionality and whatever.",
            "See something like J unit 2.",
            "Check with easy object in the system is actually working, we know.",
            "And I wonder how this would affect your valuation.",
            "Keep checking that part of the code work and these things are broken.",
            "Well, actually we do kind of unit testing in the end.",
            "Something that's almost embedded into the ceiling shot yes.",
            "4 Four in a specific for a specific weight of testing.",
            "Valuation for the Internet compartments evaluations.",
            "This is somewhat like an interesting thing because you make specific tests that you can pass or not pass and then get to teleport.",
            "That is possible, but it's always a Black Ops black box next, so we don't know what happens inside it."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Alright, so we now come to the technical part.",
                    "label": 0
                },
                {
                    "sent": "In the second half of the.",
                    "label": 0
                },
                {
                    "sent": "Off the tutorial.",
                    "label": 0
                },
                {
                    "sent": "The first talk will be on repository management.",
                    "label": 0
                },
                {
                    "sent": "I am the replacement of battery and motor from STI innsbrook over and created these slides and so I will present on behalf of.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is the overall architecture of.",
                    "label": 0
                },
                {
                    "sent": "Platform which has in its core the scene service manager and the runtime Evaluation Service, which is responsible for running evaluations.",
                    "label": 1
                },
                {
                    "sent": "And there are.",
                    "label": 0
                },
                {
                    "sent": "Four different repositories in the system.",
                    "label": 0
                },
                {
                    "sent": "The first is the evaluation Description Repository service, which stores evaluation descriptions.",
                    "label": 0
                },
                {
                    "sent": "We will come to this later in a second separate talk, and what this is about when we talk about evaluation descriptions which define evaluations.",
                    "label": 0
                },
                {
                    "sent": "In this talk we will talk about these three repository services.",
                    "label": 0
                },
                {
                    "sent": "This is the test data repository service which stores and test data.",
                    "label": 1
                },
                {
                    "sent": "Which is used in the evaluation.",
                    "label": 0
                },
                {
                    "sent": "The tool repository service which stores tools the tools to be evaluated, and finally the results repository service, which is about storing the results of the evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the Seals repository's well, as I said, the test data repository service is responsible for storing test datasets and not only for well.",
                    "label": 1
                },
                {
                    "sent": "In most cases it this will be some static data which is stored and can be retrieved afterwards.",
                    "label": 0
                },
                {
                    "sent": "But it's also possible it's a bit more flexible.",
                    "label": 1
                },
                {
                    "sent": "It's also possible to store just references to existing test data, and which another thing that is actually used in the science project is the option to have.",
                    "label": 0
                },
                {
                    "sent": "Test data generated on demand and for this it is possible to richest.",
                    "label": 0
                },
                {
                    "sent": "Test data generators.",
                    "label": 0
                },
                {
                    "sent": "In the repository.",
                    "label": 0
                },
                {
                    "sent": "The truth repository has said is just, well, just as that it stores tools.",
                    "label": 0
                },
                {
                    "sent": "And the Resource Repository stores results, and we distinguish costly between two kinds of results.",
                    "label": 0
                },
                {
                    "sent": "The first kind is the raw data.",
                    "label": 0
                },
                {
                    "sent": "The second kind is interpretation.",
                    "label": 0
                },
                {
                    "sent": "Interpreted.",
                    "label": 0
                },
                {
                    "sent": "Results and it's in the end.",
                    "label": 0
                },
                {
                    "sent": "It's up to the to those who define the evaluations, how whether they use this distinction at all, and how they what they understand under the wrong results and under interpreted results.",
                    "label": 0
                },
                {
                    "sent": "But costly, one can say.",
                    "label": 0
                },
                {
                    "sent": "The data that comes out directly from from the tools and it's the raw data is the result.",
                    "label": 1
                },
                {
                    "sent": "For example, for a reason, and this could be just the outcome of yes, no unknown or some error and interpret interpretation.",
                    "label": 0
                },
                {
                    "sent": "This could be, well, the classification of the outcome, or let's say aggregation of several outcomes from several tools, building statistics from it so.",
                    "label": 0
                },
                {
                    "sent": "This these are different kinds of impossible interpretations.",
                    "label": 0
                },
                {
                    "sent": "And the test data repository service makes this distinction how it is used to stand up to the truth.",
                    "label": 1
                },
                {
                    "sent": "Those who create the evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So about the.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Architecture of the of these services of these repository services.",
                    "label": 0
                },
                {
                    "sent": "So in general there is a distinction between artifacts and artifact versions.",
                    "label": 1
                },
                {
                    "sent": "Aren't you you?",
                    "label": 0
                },
                {
                    "sent": "You can.",
                    "label": 0
                },
                {
                    "sent": "Well we have worsened with versions systems like SVN or CVS as you know it.",
                    "label": 0
                },
                {
                    "sent": "So you store for example test data and then you find that the test data has changed overtime or there was an error or whatever.",
                    "label": 0
                },
                {
                    "sent": "So you can start another version of the same test data and what you do is an artifact is more is more.",
                    "label": 1
                },
                {
                    "sent": "Virtual kind of thing so you register some test data set and, but this is not the test data as such for the moment.",
                    "label": 1
                },
                {
                    "sent": "After you have registered this test data, you can store versions a sequence of versions, history of versions as you like.",
                    "label": 0
                },
                {
                    "sent": "So this is the concrete version and OK here in here.",
                    "label": 0
                },
                {
                    "sent": "The example is for a tool.",
                    "label": 0
                },
                {
                    "sent": "I have made an example for test data.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So and well, there was the artifacts and their versions.",
                    "label": 0
                },
                {
                    "sent": "On the one hand side and there is some meta data that is stored with these artifacts.",
                    "label": 0
                },
                {
                    "sent": "On the other hand.",
                    "label": 0
                },
                {
                    "sent": "Yes I will.",
                    "label": 0
                },
                {
                    "sent": "They are stored separately, but I will.",
                    "label": 0
                },
                {
                    "sent": "I will go into details later.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "About this what you can see here is, so before we had we had this overall architecture of the of the six platform and we had these pack.",
                    "label": 0
                },
                {
                    "sent": "Storage systems and now we look into into these storage systems and this is the few here.",
                    "label": 0
                },
                {
                    "sent": "We have on the bottom at the bottom we have two storage is 1 in RDF repository which stores the meter data and file repository which stores the actual artifacts so the artifacts, versions, test data or tools or results.",
                    "label": 1
                },
                {
                    "sent": "Then there is some internal interface and well, yes to the different repositories.",
                    "label": 0
                },
                {
                    "sent": "Which is in Java and this is well, it's there.",
                    "label": 0
                },
                {
                    "sent": "It provides, provides, makes iaccessible the whole functionality of the system.",
                    "label": 0
                },
                {
                    "sent": "But this is not the interface as it is used by users or the platform itself.",
                    "label": 0
                },
                {
                    "sent": "The actual external interfaces a rest interface.",
                    "label": 0
                },
                {
                    "sent": "Well, so it's based on HTTP and you have these typical methods.",
                    "label": 0
                },
                {
                    "sent": "Put our store to store some new resource and get to retrieve it again.",
                    "label": 0
                },
                {
                    "sent": "Put for some update operations and delete.",
                    "label": 0
                },
                {
                    "sent": "We are.",
                    "label": 0
                },
                {
                    "sent": "We even make it.",
                    "label": 0
                },
                {
                    "sent": "Possible to delete?",
                    "label": 0
                },
                {
                    "sent": "Artifacts.",
                    "label": 0
                },
                {
                    "sent": "For, for example, if someone and some provider decides that this particular version shouldn't be available anymore, so this is something deletions.",
                    "label": 0
                },
                {
                    "sent": "For example, in S when you don't have.",
                    "label": 0
                },
                {
                    "sent": "You don't have real deletions.",
                    "label": 0
                },
                {
                    "sent": "Things will always be available.",
                    "label": 0
                },
                {
                    "sent": "They are perhaps not visible anymore, but you can go back to previous version and then you can see it again.",
                    "label": 0
                },
                {
                    "sent": "But we allow for real deletion just for example for legal reasons.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "OK, now to the to the different layers.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The storage layer has said consists of at 10.",
                    "label": 1
                },
                {
                    "sent": "On the one hand, and a file repository and narrative repository.",
                    "label": 0
                },
                {
                    "sent": "Yeah, well, I think I've already said what what's the purpose?",
                    "label": 0
                },
                {
                    "sent": "They store the actual things.",
                    "label": 1
                },
                {
                    "sent": "The tool tool for example, and the RDF repository.",
                    "label": 0
                },
                {
                    "sent": "Everything all the meter data and everything.",
                    "label": 0
                },
                {
                    "sent": "All the information that is needed.",
                    "label": 0
                },
                {
                    "sent": "For example, if you have several versions, then this versioning information is also stored in the RDF repository just as well as information who created that tool when and so on.",
                    "label": 0
                },
                {
                    "sent": "That's all.",
                    "label": 0
                },
                {
                    "sent": "And RDF graph, and that's in the RDF repository.",
                    "label": 0
                },
                {
                    "sent": "And well, yes, one can have access to this then.",
                    "label": 0
                },
                {
                    "sent": "Bye.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Marshall queries, so then this internal interface layer.",
                    "label": 1
                },
                {
                    "sent": "This Java and interface.",
                    "label": 0
                },
                {
                    "sent": "I said this is this is not the interface that just made public, but so I think I won't tell much about it because this is not something that one tip.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Lizzies it's some kind of SPI API.",
                    "label": 0
                },
                {
                    "sent": "And then the external layer restful interface has already said.",
                    "label": 1
                },
                {
                    "sent": "Right, well I already explained it.",
                    "label": 0
                },
                {
                    "sent": "It's a real rest interface and you can have, for example you can you can.",
                    "label": 0
                },
                {
                    "sent": "You can post you can post the tool version for example and afterwards you can get.",
                    "label": 0
                },
                {
                    "sent": "The meta data for this for this this tool or the tool itself.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I will.",
                    "label": 0
                },
                {
                    "sent": "Soon show exactly what what the these operations are.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Managing entities well.",
                    "label": 0
                },
                {
                    "sent": "When I talk about entities here, I'm always mean tools or results or test data items.",
                    "label": 0
                },
                {
                    "sent": "So we will later come to these different things, but at the moment still we have all these entities, all these as an abstract entities.",
                    "label": 0
                },
                {
                    "sent": "The meter data for them is RDF XML encoded OK.",
                    "label": 0
                },
                {
                    "sent": "It's RDF that is started in RDF store and can be retrieved with Sparkle.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "The there is this meta data that is stored in the moment when when a tool is registered or version is stored and it is used well.",
                    "label": 1
                },
                {
                    "sent": "Among other things, yes, to identify or to.",
                    "label": 1
                },
                {
                    "sent": "Well, to search for entities so with sparkle you have quite some options to search and say.",
                    "label": 1
                },
                {
                    "sent": "For example, I want to have all the tools that have been created before some date.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Storing the entities.",
                    "label": 0
                },
                {
                    "sent": "Yes, it's it's the other stuff we have the meta data and it's now the entities themselves tools, for example.",
                    "label": 0
                },
                {
                    "sent": "They're posted with this with this.",
                    "label": 0
                },
                {
                    "sent": "Restful interface.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Allison, OK, the Artifact version is this is a concrete interfaces.",
                    "label": 1
                },
                {
                    "sent": "A concrete thing then that can be stored get pushed.",
                    "label": 0
                },
                {
                    "sent": "Eden poster already said these are the 4 four methods that can be used to get to access the tool or meter data.",
                    "label": 1
                },
                {
                    "sent": "Put to update meta data.",
                    "label": 0
                },
                {
                    "sent": "This is also an option that we have that for example is not available in this win.",
                    "label": 0
                },
                {
                    "sent": "We can go down to a version and update.",
                    "label": 0
                },
                {
                    "sent": "And updation it's meta data.",
                    "label": 0
                },
                {
                    "sent": "We can delete it.",
                    "label": 0
                },
                {
                    "sent": "I already said said it and there is a special thing we can we can actually publish an artifact.",
                    "label": 0
                },
                {
                    "sent": "This is special.",
                    "label": 0
                },
                {
                    "sent": "Just storing just storing a tool, for example doesn't yet make it available for the for the evaluation.",
                    "label": 0
                },
                {
                    "sent": "So we have this fine grained and way too.",
                    "label": 0
                },
                {
                    "sent": "Also to say this tool is not yet ready for for evaluation we might.",
                    "label": 0
                },
                {
                    "sent": "We might live well.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, accessing entities every every N, every artifact.",
                    "label": 1
                },
                {
                    "sent": "We will have an identifier.",
                    "label": 0
                },
                {
                    "sent": "This is basically UI which.",
                    "label": 0
                },
                {
                    "sent": "Precisely and uniquely identifies this thing, and by means of this identifier, one can then access the.",
                    "label": 0
                },
                {
                    "sent": "Artifact afterwards again.",
                    "label": 0
                },
                {
                    "sent": "It's auto generated this identifier when when one starts, for example a tool.",
                    "label": 1
                },
                {
                    "sent": "And there are certain URL schemes that match the.",
                    "label": 0
                },
                {
                    "sent": "Well, that that are typical for for restful, for restful.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Services and I will show them later.",
                    "label": 0
                },
                {
                    "sent": "So now we can come to the test data repository serve.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The manager said test data collections.",
                    "label": 1
                },
                {
                    "sent": "And actual test data versions.",
                    "label": 1
                },
                {
                    "sent": "And well, this is the repetition from from earlier on.",
                    "label": 0
                },
                {
                    "sent": "The one hand, there is persistent.",
                    "label": 0
                },
                {
                    "sent": "Static test data that is typically not not changed, at least not for a version or a reference to some data that is that exists somewhere else on the web, for example.",
                    "label": 1
                },
                {
                    "sent": "And this generating option that the test data isn't isn't there in a persistent way, but you have a generator and the generator creates the data on demand.",
                    "label": 0
                },
                {
                    "sent": "And this is the visualization that you have this virtual test data artifact and then different versions and every.",
                    "label": 0
                },
                {
                    "sent": "And then there's the distinction between the data and the metered.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are well over made in or meta data is with respect to some.",
                    "label": 0
                },
                {
                    "sent": "Some ontologies we have we have a generic seals ontology which I haven't shown here about.",
                    "label": 0
                },
                {
                    "sent": "We have a test.",
                    "label": 0
                },
                {
                    "sent": "We have 10 specialized ontologies for the different item types.",
                    "label": 0
                },
                {
                    "sent": "Test data.",
                    "label": 0
                },
                {
                    "sent": "For example.",
                    "label": 0
                },
                {
                    "sent": "This is an excerpt from the Test Data Ontology.",
                    "label": 1
                },
                {
                    "sent": "We see we have and we have a class test data which is a subclass of a generic class artifact.",
                    "label": 0
                },
                {
                    "sent": "The artifact classes defined in the generic since metadata specification in the seals on Teologi and test data is a class of the test data ontology and we have test data versions as a class which is then a subclass of artifact version and test data, whereas said there can be different kinds of test data.",
                    "label": 0
                },
                {
                    "sent": "Consistent test data.",
                    "label": 0
                },
                {
                    "sent": "External test data and synthetic or general generated test data or in this case it's the generator.",
                    "label": 0
                },
                {
                    "sent": "These are all subclasses.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Well, it's it's XML I am.",
                    "label": 0
                },
                {
                    "sent": "I don't tell him much about it.",
                    "label": 0
                },
                {
                    "sent": "This is the new meta data description in XML, so there is a name.",
                    "label": 0
                },
                {
                    "sent": "There is a description of the whole of the whole test data of the virtual test data artifact and for the different versions there is.",
                    "label": 1
                },
                {
                    "sent": "Version number, also a description for this particular version.",
                    "label": 0
                },
                {
                    "sent": "That's just the format.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And here are the.",
                    "label": 0
                },
                {
                    "sent": "These are the rest.",
                    "label": 0
                },
                {
                    "sent": "Methods.",
                    "label": 0
                },
                {
                    "sent": "So when you when you create when you register new, the new test data collection without without yet having a certain test data where the test data itself just just this virtual object.",
                    "label": 1
                },
                {
                    "sent": "Then this is to your eyes scheme, well, some domain.",
                    "label": 0
                },
                {
                    "sent": "This can be anything, but then test data and it's persistent to distinguish it from, for example, generated the generated stuff and the rest operation.",
                    "label": 0
                },
                {
                    "sent": "The rest method disposed in this case where this is not so relevant here and then you.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "You submit the meta data and then into.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Registered.",
                    "label": 0
                },
                {
                    "sent": "And when you want to read when you want to.",
                    "label": 0
                },
                {
                    "sent": "Retrieve the metadata for the for this.",
                    "label": 0
                },
                {
                    "sent": "This version then you use the rest method on the HTTP method get.",
                    "label": 0
                },
                {
                    "sent": "And tell that the expected media type should be RDF.",
                    "label": 0
                },
                {
                    "sent": "These two informations specify the method to say the operation.",
                    "label": 0
                },
                {
                    "sent": "To say that the meter data for the.",
                    "label": 0
                },
                {
                    "sent": "For the.",
                    "label": 0
                },
                {
                    "sent": "For this artifact should be retrieved.",
                    "label": 0
                },
                {
                    "sent": "You can use put to update the meta data.",
                    "label": 0
                },
                {
                    "sent": "This is not.",
                    "label": 0
                },
                {
                    "sent": "Yes, it's right, there is always.",
                    "label": 0
                },
                {
                    "sent": "There is always a current.",
                    "label": 0
                },
                {
                    "sent": "Almost always, there is almost always a current.",
                    "label": 0
                },
                {
                    "sent": "The current version.",
                    "label": 0
                },
                {
                    "sent": "If there is a version, then there is a current version and and the whole history of older versions.",
                    "label": 0
                },
                {
                    "sent": "So you are this is a convenience method to just access.",
                    "label": 0
                },
                {
                    "sent": "I get and saying that the mimetype is similar, then you get the current version.",
                    "label": 0
                },
                {
                    "sent": "But you can also access specific versions by get and, so I think this is not quite right.",
                    "label": 0
                },
                {
                    "sent": "What we I think this should be.",
                    "label": 0
                },
                {
                    "sent": "Get and zip here and you should be able then to get the.",
                    "label": 0
                },
                {
                    "sent": "That particular version.",
                    "label": 0
                },
                {
                    "sent": "OK, I think I think here is a bug.",
                    "label": 0
                },
                {
                    "sent": "Here is an error when I when I look at this.",
                    "label": 0
                },
                {
                    "sent": "So the basic idea is it is possible to access a specific version using such such a UI scheme.",
                    "label": 0
                },
                {
                    "sent": "And then get and then plus zip and then you will get it.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK. OK, this is just to say this is specific for test data becausw we found in the project.",
                    "label": 0
                },
                {
                    "sent": "It's not very convenient to have.",
                    "label": 0
                },
                {
                    "sent": "Access to a whole test suite in general.",
                    "label": 0
                },
                {
                    "sent": "So there are 1000 or so different test cases within and every test suite.",
                    "label": 0
                },
                {
                    "sent": "Well consists of several test cases, so it is possible to have a more fine grained access to the specific test cases or test data items.",
                    "label": 0
                },
                {
                    "sent": "So when this is supported here as well, you see for a test suite you can access an item then.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Yes, just a few words about the test data generators, as I've already explained the their purpose and there are just to say there is an API that has to be by those who create.",
                    "label": 1
                },
                {
                    "sent": "I'm such a test and data generator and then it is and then it is available from from the system.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This repository service, well, managers, tools and tool versions just exactly in the same way As for test data.",
                    "label": 0
                },
                {
                    "sent": "You're again have this abstract tool and then the different versions, and then you have the meta data for the tool and specific meta data for the versions.",
                    "label": 0
                },
                {
                    "sent": "And of course the.",
                    "label": 0
                },
                {
                    "sent": "Well data, well this is the tool in this case this is the.",
                    "label": 0
                },
                {
                    "sent": "The supplier that makes up the tool.",
                    "label": 0
                },
                {
                    "sent": "Now here the tools are expected to be packaged such that they can be integrated in an evaluation workflow.",
                    "label": 1
                },
                {
                    "sent": "When I read this, I just don't know whether the weather, the test data repository makes validation on this format.",
                    "label": 0
                },
                {
                    "sent": "No no.",
                    "label": 0
                },
                {
                    "sent": "OK, future feature, I don't know.",
                    "label": 0
                },
                {
                    "sent": "So so it looks to me that it's just a zip file in the end which is stored and then whatever it is, it is probably not not validated.",
                    "label": 0
                },
                {
                    "sent": "Would be good to have some validation on it OK.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It came to mind, and so when there was again specific ontology for for this describing tools, the meta data, which is which underlies the meta data.",
                    "label": 0
                },
                {
                    "sent": "Again, we have artifact, an artifact version from the upper on column.",
                    "label": 0
                },
                {
                    "sent": "Well, since up ontology, so to speak, and then specific classes tool and tool version as directly derived classes.",
                    "label": 0
                },
                {
                    "sent": "And we have 4 for Atul.",
                    "label": 0
                },
                {
                    "sent": "Property has two category and we have five different categories in the scenes project.",
                    "label": 0
                },
                {
                    "sent": "This is for ontology engineering tools reasoning or storage systems.",
                    "label": 0
                },
                {
                    "sent": "Ontology mapping, semantic tool and semantic web service and this is specified.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally the results.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pozza Tori service.",
                    "label": 0
                },
                {
                    "sent": "What are the limits on the languages and technologies you would support for tools?",
                    "label": 0
                },
                {
                    "sent": "The limits of.",
                    "label": 0
                },
                {
                    "sent": "Java tools in Milani.",
                    "label": 0
                },
                {
                    "sent": "Things about know not only Java tools, but it's better that Miguel explains this because this is, well, this is basically what we just discussed there is.",
                    "label": 0
                },
                {
                    "sent": "You can put there whatever you want in a sense, but what?",
                    "label": 0
                },
                {
                    "sent": "It's actually a thing what the runtime evaluation service is able to manage to execute.",
                    "label": 0
                },
                {
                    "sent": "Amended.",
                    "label": 0
                },
                {
                    "sent": "The only thing is that in order to plug the tune with the platform, you have to develop a specific Java piece of code which is a coverage analysis enables the communication between the two and the runtime valuation service.",
                    "label": 0
                },
                {
                    "sent": "That's.",
                    "label": 0
                },
                {
                    "sent": "And then there's some support for existing.",
                    "label": 0
                },
                {
                    "sent": "Kind of software repository systems like Maven for Java, anything like somebody Unix based systems like to get towards.",
                    "label": 0
                },
                {
                    "sent": "12:00 PM.",
                    "label": 0
                },
                {
                    "sent": "What day did you integrate with any existing repository systems for software for managing the tools are used within the path more for consuming them or publisher tool?",
                    "label": 0
                },
                {
                    "sent": "Could I give you made in description for example?",
                    "label": 0
                },
                {
                    "sent": "No, not really.",
                    "label": 0
                },
                {
                    "sent": "You have to conform to what we already have in the product mix at this picture format an iPod.",
                    "label": 0
                },
                {
                    "sent": "This format that we have to to follow in order to package everything and populate into the repository and in that repository.",
                    "label": 0
                },
                {
                    "sent": "So there aren't any value service can understand it and use it later on the transaction.",
                    "label": 0
                },
                {
                    "sent": "Could you clarify or give more details of how do you mean by synthetic test data and?",
                    "label": 0
                },
                {
                    "sent": "How your synthetic test data generator is producing?",
                    "label": 0
                },
                {
                    "sent": "Does it have to be confirmed?",
                    "label": 0
                },
                {
                    "sent": "To certain kind of.",
                    "label": 0
                },
                {
                    "sent": "Conditions, so first of all and the test well that the.",
                    "label": 0
                },
                {
                    "sent": "One and this can be answered on a more generic level.",
                    "label": 0
                },
                {
                    "sent": "You can put any test data in that you like, whether this is generated or not doesn't make a difference from this point of view, so right and you have to, you have to come test data as to conform to the.",
                    "label": 0
                },
                {
                    "sent": "You have some fine point way to describe your test data and if you have test data you have to create meter data which is stored together with the test data and then it's completely up to you what how you organize this.",
                    "label": 0
                },
                {
                    "sent": "And then you have pretty much freedom.",
                    "label": 0
                },
                {
                    "sent": "And so this this generator is more or less like annotation.",
                    "label": 0
                },
                {
                    "sent": "No no no no wait what I just said is this is generally the case for test data.",
                    "label": 0
                },
                {
                    "sent": "Whether it is generated or not doesn't make a difference from this point of view.",
                    "label": 0
                },
                {
                    "sent": "So you what you have to do, what you have to.",
                    "label": 0
                },
                {
                    "sent": "Create is a test data generator which implements a certain API and this creates then whatever.",
                    "label": 0
                },
                {
                    "sent": "So it stand up to you and to have only you know about the internal structure of the test data.",
                    "label": 0
                },
                {
                    "sent": "So you have to make sure you have you have the.",
                    "label": 0
                },
                {
                    "sent": "I didn't show everything here you have.",
                    "label": 0
                },
                {
                    "sent": "You have some some ways to describe meta data which which.",
                    "label": 0
                },
                {
                    "sent": "And you have the option to to make what you know.",
                    "label": 0
                },
                {
                    "sent": "The only thing that is that is fixed is that you have a suite consisting of test data items.",
                    "label": 0
                },
                {
                    "sent": "OK, in the end this is everything.",
                    "label": 0
                },
                {
                    "sent": "What's the format of these test data items?",
                    "label": 0
                },
                {
                    "sent": "No one knows, only you or better say only those people who who create the value defined evaluation.",
                    "label": 0
                },
                {
                    "sent": "They have to know what's the format is and they have to.",
                    "label": 0
                },
                {
                    "sent": "Well, they have to make.",
                    "label": 0
                },
                {
                    "sent": "I will show this in the in the second talk, but the cases.",
                    "label": 0
                },
                {
                    "sent": "You can access via the test data repository single test data items and four for the test data repositories.",
                    "label": 0
                },
                {
                    "sent": "These are just.",
                    "label": 0
                },
                {
                    "sent": "Big chains OK, so how to interpret them?",
                    "label": 0
                },
                {
                    "sent": "Stand up to the valuation?",
                    "label": 0
                },
                {
                    "sent": "The value in the MD within the evaluation which is described within the evaluation description.",
                    "label": 0
                },
                {
                    "sent": "There is this access to the test data repository and say give me that that well it loops over test data.",
                    "label": 0
                },
                {
                    "sent": "Give me that and that test data item which comes there, justice bit streams and then the evaluation has two.",
                    "label": 0
                },
                {
                    "sent": "Make the best of it and the evaluation.",
                    "label": 0
                },
                {
                    "sent": "Those guys who create the evaluation know how the have to know how the test data is, what the format is and then have to create some what we call custom procedure for which splits up.",
                    "label": 0
                },
                {
                    "sent": "For example the test data item into its different files or whatever.",
                    "label": 0
                },
                {
                    "sent": "So this is not something that the test data repository is responsible for the test data repository is only responsible for maintaining this cost structure of having the whole suite and the different test data items within everything else is up to the evaluation description later, and this is a different topic.",
                    "label": 0
                },
                {
                    "sent": "OK, does that mean for every tool you want to evaluate it using this platform they need to have a synthetic synthetic know, know, know, know, know first of all, not for every, not for every tool.",
                    "label": 0
                },
                {
                    "sent": "This is not true.",
                    "label": 0
                },
                {
                    "sent": "Well, tools of course.",
                    "label": 0
                },
                {
                    "sent": "Well, maybe it's also possible that I get you wrong now that certain tools can be tested with certain test data.",
                    "label": 0
                },
                {
                    "sent": "Clearly not every tools can be tested with every test data.",
                    "label": 0
                },
                {
                    "sent": "This is also also think that that it will come true later when I talk about the evaluation descriptions.",
                    "label": 0
                },
                {
                    "sent": "We have these different kind well on a cost level.",
                    "label": 0
                },
                {
                    "sent": "We have these different kinds of.",
                    "label": 0
                },
                {
                    "sent": "Well, we have this reasoning and we have these different categories so and.",
                    "label": 0
                },
                {
                    "sent": "At least at least.",
                    "label": 0
                },
                {
                    "sent": "It's all up to the even.",
                    "label": 0
                },
                {
                    "sent": "Let's say it, so it's all up to those who create the evaluation to make sure that things match.",
                    "label": 0
                },
                {
                    "sent": "So you you can of course have a tool, some tool, whatever some reason and get some tests to make access to some test data for.",
                    "label": 0
                },
                {
                    "sent": "Whatever.",
                    "label": 0
                },
                {
                    "sent": "Ontology engineering and testing and then put this into the reasoner and it may work or not.",
                    "label": 0
                },
                {
                    "sent": "The point is that those who have you have some categorization.",
                    "label": 0
                },
                {
                    "sent": "So if you have, if you have, if you have a tool that has different, has a users test data from a different category, it will probably be rejected but within a categorization within a category that makes may still be mismatches.",
                    "label": 0
                },
                {
                    "sent": "And then those who create the evaluation.",
                    "label": 0
                },
                {
                    "sent": "To make sure that everything works.",
                    "label": 0
                },
                {
                    "sent": "This this cannot be perfectly enforced automatically.",
                    "label": 0
                },
                {
                    "sent": "OK, so it's quite quite some responsibility on those who define the evaluation.",
                    "label": 0
                },
                {
                    "sent": "They now have to know the test data.",
                    "label": 0
                },
                {
                    "sent": "The test data don't have to come from themselves, but they have to know the format of the test data.",
                    "label": 0
                },
                {
                    "sent": "They have to know.",
                    "label": 0
                },
                {
                    "sent": "About the tools.",
                    "label": 0
                },
                {
                    "sent": "What they can do, what they expect and so on, and what they give the same father.",
                    "label": 0
                },
                {
                    "sent": "We start with the next thing that I come to.",
                    "label": 0
                },
                {
                    "sent": "The tools give some results.",
                    "label": 0
                },
                {
                    "sent": "Those who create the evaluation have to know what the format is.",
                    "label": 0
                },
                {
                    "sent": "So one curve one could start and have some extremely sophisticated support for this and have all kinds of formal specification stuff so that you can do some automatic checking, But this will.",
                    "label": 0
                },
                {
                    "sent": "This would just make the everything much more difficult and it would wouldn't be perfect.",
                    "label": 0
                },
                {
                    "sent": "It would never be perfectly possible to do it.",
                    "label": 0
                },
                {
                    "sent": "So it's in the end the one who creates the evaluation is responsible for that.",
                    "label": 0
                },
                {
                    "sent": "Everything matches fine and, well, you can.",
                    "label": 0
                },
                {
                    "sent": "You can check it and test it locally and then see how things work fine and then so from a pragmatic point of view that it works in general.",
                    "label": 0
                },
                {
                    "sent": "OK, finally the Resource Repository service where OK.",
                    "label": 0
                },
                {
                    "sent": "Manage this access Rory Sultan interpretations.",
                    "label": 0
                },
                {
                    "sent": "And again, so this is also point here.",
                    "label": 0
                },
                {
                    "sent": "The results repository has no idea.",
                    "label": 0
                },
                {
                    "sent": "About any format.",
                    "label": 0
                },
                {
                    "sent": "What what Aurora scientists put into interpretation is it doesn't know about it.",
                    "label": 0
                },
                {
                    "sent": "It just makes the suspension.",
                    "label": 0
                },
                {
                    "sent": "So those who want to store it separately have away have a means to store it separately.",
                    "label": 0
                },
                {
                    "sent": "That's it.",
                    "label": 0
                },
                {
                    "sent": "It's it's not a clever.",
                    "label": 0
                },
                {
                    "sent": "It's not a clever thing.",
                    "label": 0
                },
                {
                    "sent": "It's not.",
                    "label": 0
                },
                {
                    "sent": "It doesn't have any.",
                    "label": 0
                },
                {
                    "sent": "Any idea about some format, because it's the same As for test data.",
                    "label": 0
                },
                {
                    "sent": "It result can be everything.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there was again.",
                    "label": 0
                },
                {
                    "sent": "Specialized ontology artifact from the scenes ontology then result distinct distinction between two classes.",
                    "label": 0
                },
                {
                    "sent": "Rather resulted into interpretation.",
                    "label": 0
                },
                {
                    "sent": "And the result refers to some result category.",
                    "label": 0
                },
                {
                    "sent": "And there is, yes, an internal interpretation always belongs to some result we 1st December or so.",
                    "label": 0
                },
                {
                    "sent": "As you see, it's all very cause.",
                    "label": 0
                },
                {
                    "sent": "There is.",
                    "label": 0
                },
                {
                    "sent": "It doesn't go much deeper.",
                    "label": 0
                },
                {
                    "sent": "Not much, no much finer granularity becausw.",
                    "label": 0
                },
                {
                    "sent": "We don't.",
                    "label": 0
                },
                {
                    "sent": "It's not that we we are the whole project and the whole platform.",
                    "label": 0
                },
                {
                    "sent": "So in sales is very generic in the end.",
                    "label": 0
                },
                {
                    "sent": "We have different tool categories right?",
                    "label": 0
                },
                {
                    "sent": "But even this could be extended to other tool categories and we can have all even if we would only talk about treasonous, there would be so many different kinds of test data that are possible and so many different and different kinds of results.",
                    "label": 0
                },
                {
                    "sent": "And for other tool categories it's perhaps even more different ways.",
                    "label": 0
                },
                {
                    "sent": "What can work.",
                    "label": 0
                },
                {
                    "sent": "Results can be, so making any assumptions about format.",
                    "label": 0
                },
                {
                    "sent": "Won't won't lead to.",
                    "label": 0
                },
                {
                    "sent": "Meaningful and I believe so.",
                    "label": 0
                },
                {
                    "sent": "It's in the end in the hands of the evaluator.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, this war this for the whole this was fast.",
                    "label": 0
                },
                {
                    "sent": "This was meant to take an hour and it's now just half an hour.",
                    "label": 0
                },
                {
                    "sent": "Any questions?",
                    "label": 0
                },
                {
                    "sent": "More questions.",
                    "label": 0
                },
                {
                    "sent": "I should put this on the slides.",
                    "label": 0
                },
                {
                    "sent": "If not, then I will do my second.",
                    "label": 0
                },
                {
                    "sent": "OK, is this evaluation entirely about the quality of the service?",
                    "label": 0
                },
                {
                    "sent": "Also by the functionality of the service, I don't understand this question.",
                    "label": 0
                },
                {
                    "sent": "How?",
                    "label": 0
                },
                {
                    "sent": "How much does it work?",
                    "label": 0
                },
                {
                    "sent": "Or does it ask you mean you mean the result?",
                    "label": 0
                },
                {
                    "sent": "OK, this is great.",
                    "label": 0
                },
                {
                    "sent": "OK well this is result.",
                    "label": 0
                },
                {
                    "sent": "This is results.",
                    "label": 0
                },
                {
                    "sent": "This is totally up to two the evaluation, so some.",
                    "label": 0
                },
                {
                    "sent": "In some cases it may be maybe only about it might.",
                    "label": 0
                },
                {
                    "sent": "Well it may be about functionality, it may be about robustness or whatever.",
                    "label": 0
                },
                {
                    "sent": "So this is something that is specified for the evaluation.",
                    "label": 0
                },
                {
                    "sent": "And we are here on the technical on the platform side.",
                    "label": 0
                },
                {
                    "sent": "No assumptions on this.",
                    "label": 0
                },
                {
                    "sent": "You have the option to store.",
                    "label": 0
                },
                {
                    "sent": "Interpretations OK and what this means.",
                    "label": 0
                },
                {
                    "sent": "This would be an interpretation so the services have some degree of robustness, for example.",
                    "label": 0
                },
                {
                    "sent": "You have a lot of raw results and you see there are certain exceptions have been thrown by the by the system.",
                    "label": 0
                },
                {
                    "sent": "Then you have to go down and see what kind of exceptions.",
                    "label": 0
                },
                {
                    "sent": "Without this.",
                    "label": 0
                },
                {
                    "sent": "Did they came from the platform that they came from the tool?",
                    "label": 0
                },
                {
                    "sent": "What kind of exception was it?",
                    "label": 0
                },
                {
                    "sent": "Was it?",
                    "label": 0
                },
                {
                    "sent": "Was it some internal exception or whatever?",
                    "label": 0
                },
                {
                    "sent": "This has to be analyzed then.",
                    "label": 0
                },
                {
                    "sent": "If if this is if This is why if this is desired from the evaluation and then you can you can have.",
                    "label": 0
                },
                {
                    "sent": "Some categorization and say this tool has a certain robustness.",
                    "label": 0
                },
                {
                    "sent": "This tool has a certain coverage of functionality and whatever.",
                    "label": 0
                },
                {
                    "sent": "See something like J unit 2.",
                    "label": 0
                },
                {
                    "sent": "Check with easy object in the system is actually working, we know.",
                    "label": 0
                },
                {
                    "sent": "And I wonder how this would affect your valuation.",
                    "label": 0
                },
                {
                    "sent": "Keep checking that part of the code work and these things are broken.",
                    "label": 0
                },
                {
                    "sent": "Well, actually we do kind of unit testing in the end.",
                    "label": 0
                },
                {
                    "sent": "Something that's almost embedded into the ceiling shot yes.",
                    "label": 0
                },
                {
                    "sent": "4 Four in a specific for a specific weight of testing.",
                    "label": 0
                },
                {
                    "sent": "Valuation for the Internet compartments evaluations.",
                    "label": 0
                },
                {
                    "sent": "This is somewhat like an interesting thing because you make specific tests that you can pass or not pass and then get to teleport.",
                    "label": 0
                },
                {
                    "sent": "That is possible, but it's always a Black Ops black box next, so we don't know what happens inside it.",
                    "label": 0
                }
            ]
        }
    }
}