{
    "id": "fkeqnopkehdieupbem36gewwqhfjuxmm",
    "title": "A one-stop shop for Open Government Data: publicdata.eu",
    "info": {
        "author": [
            "Christian Villum, Open Knowledge Foundation",
            "Sander van der Waal, Open Knowledge Foundation"
        ],
        "published": "May 16, 2013",
        "recorded": "April 2013",
        "category": [
            "Top->Computer Science->Big Data",
            "Top->Social Sciences->Society->Public Policy"
        ]
    },
    "url": "http://videolectures.net/dataforum2013_van_der_waal_villum_government_data/",
    "segmentation": [
        [
            "And before I'll tell you about there."
        ],
        [
            "Public data dot EU portal.",
            "I'll I'll tell a little bit about the Open Knowledge Foundation about who we are and what we do.",
            "We are a nonprofit organization that are dedicated to promoting openness in all its forms, and that's mostly centered around open data.",
            "On the one hand, and open content on the other hand, and we structure our activities around communities and tools and communities, can be open, government related or open science or Open Access or open culture, and we organize activities such as the Open Knowledge Conference which is happening in September this year.",
            "We educate on on data and data literacy.",
            "With the School of data, for example, which allows you to learn about how to work with data out, officialize data, etc.",
            "And we publish resources such as the Open Data Handbook which is further aimed at increasing literacy and and helping people understand what open data is, what.",
            "We're also more active nowadays in engaging citizens in the general public with things like science.",
            "So crowd crafting is a platform that we built in order to engage the general public in scientific projects and and crowd make crowdsourcing for good as we.",
            "As we call it.",
            "On the other hand, we build tools and see can is one of the probably the most famous example of the tool that we've built that we we've deployed across across several governments, for example, but also other organizations like universities, are starting to use it, and we build other tools such as open spending, which is a tool specifically aimed at providing more transparency about government spending, and we have deployed that across different countries around the world.",
            "And when we talk about openness, we don't.",
            "We don't just mean it, make it available on the web, but we have a very specific idea about what open is."
        ],
        [
            "And we maintain a website called Open definition.org which is a community effort to further define what open means and for us a piece of content or data is open.",
            "If anyone is free to use, reuse and re distributed subject only at most to the requirement to attribute and share alike so that those are two extra options that you could have when you make data available.",
            "And there are several licenses that we that we have developed ourselves so that we have incorporated in open.",
            "Open definition.org for example.",
            "The Creative Commons licenses and we encourage everyone to have a look at those and help us further spread the world word about open licenses and help people understand to openly license their content and data.",
            "Because if you license it openly, you explicitly allow for the possibility of reusing it in a way that doesn't further limit any uptake of content or data, and we think that if you don't explicitly license the.",
            "Information you make available online.",
            "It's much more difficult for people to understand to know how they can use the information and how they can further use or reuse your data.",
            "So now moving on to public data U and this is Annette."
        ],
        [
            "Sample of one of the portals that we've recently included in public data.",
            "You this is the national portal for Austria.",
            "Data GC 80 and this is an example of an open data portal that is running on the on the national level for Austria and you can see on the screen shot that they actually get their information for some of the from some of the local open data portals throughout Austria and they aggregate those on the national level, and then we intern from public data EU.",
            "Aggregate the information from the national level into public data EU and that's really what what public data EU is about.",
            "It's about aggregating data from all of these different sources across Europe and make those available fire a central portal and allowed the search and categorization of this data through a central means and at the moment this is just a prototype and it's being developed as part of the LO D2 project.",
            "One of the organizing project and we use the Open Knowledge Foundation or a partner on that project.",
            "And this is an example of a portal that's running on C cannon."
        ],
        [
            "Christian in a moment will show a little bit more about the features that we've developed over the last few months on public data EU.",
            "But before we go there, I'd like to explain a little bit about two related initiatives that we have developed or are involved with related to the aggregation of data from different portals because it's not always that easy to aggregate data from other portals because it depends on the technical level.",
            "Of course alot on the technology that's being used in these different portals and.",
            "If portals use the software that we've developed on seek, and it's easier for us to aggregate that on on another ccount platform.",
            "But if there is a custom build portal that are not using standard technologies, it's sometimes more difficult to aggregate that data in public data EU.",
            "So there are two initiatives that I think are relevant in this in this area.",
            "One is a recently started working group that."
        ],
        [
            "Like to mention here by the EC to create a deep cut profile for data portals in Europe and we are a member of that of that working group.",
            "And if you are interested in open data portals and you'd like to learn more about this, I I encourage you to join us and I'm sure that people are consuming Hills there who can tell you more about it.",
            "And there are other people involved here with that working group and this is really an effort to better understand how you define an open data portal.",
            "What are the elements that are needed specifically from the requirements in Europe?",
            "And that's more on the on.",
            "The semantic level of how you define open data, portals and metadata around the content, but there's also the question about how do you actually get to data?",
            "How do you define the API to actually access an open data portal?",
            "And some of the work that."
        ],
        [
            "We've done in this space is around an initiative we called ikip or data Catalog Interoperability protocol, which is aiming to to allow for an API that will define how you actually access data that is using D cat on the portal level, and this is still quite early work.",
            "I should say we we started it with a community effort at a workshop when we're planning to organise another workshop soon to make sure we better define how to how to.",
            "Interoperate between all these different data portals and make it easier for people to share the data, aggregate data and make the receipt their data more easily discoverable, as well as making it easier for other people to use it and find the data that they've made available on their portals.",
            "So I'll now hand over to Christian who will explain more about how we built public data EU on."
        ],
        [
            "We can and latest features that we've developed around that.",
            "Yes, thank you.",
            "A center already hinted at public data.",
            "EU runs on second, which is this open source data portal software that we've developed and reasonably large.",
            "Launched in our version 2.0 beta and.",
            "I want to."
        ],
        [
            "To take your spin on the site, basically show you some of these new features that we've deployed as part of this 2.0 beta version which are, among other some social features."
        ],
        [
            "Which are, among other away to engage citizens and people interested in open data and make meaning of all these open data that are being made available.",
            "So public data dot EU is as mentioned in the title, A one stop shop for public data in the EU.",
            "So you can go there to to get the grand overview, but you can also go in and look at countries specifically.",
            "One way is this.",
            "Availability map that you see here as well as inside on the side you have this map that we've cut in on the side.",
            "Basically you can go in and take any other countries.",
            "This is saying that primarily EU 27 countries go in and see exactly what data sets are available for a country."
        ],
        [
            "The social aspects that I mentioned before allows you to engage with these data in new ways.",
            "Basically, as you can see here, you can make a profile on the site and go in and look at that data and actually follow the data streams in order to keep getting updated about you harvest of these these data at the same time.",
            "You can also follow other users in here and engage with with them.",
            "As well, you can comment and communicate in there, but you can even also share your findings in there on some of the major social media platforms.",
            "Google Plus Twitter Facebook being those obviously.",
            "Another"
        ],
        [
            "Anything about this?",
            "This recent version is how the side supports the semantic Web through RDF.",
            "As you can see here also from the screen dump, you can go in and explore the data as they are, which I'll show you in a minute, but you can also actually download RDF version of the data and actually most of the data are not available initially as RDF, but through work by Soren Auer from Leipzig University.",
            "And others and development of a neat tool called CSV.",
            "Two RDF has been developed which basically lets you automatically convert the data to RDF, providing a default mapping between the CSV file, which is usually a spreadsheet like Excel and then providing this default mapping into RDF.",
            "The new thing.",
            "Another thing is also that you can actually go in as a user and re map these data.",
            "The relationship between the CSV file in the RDF through Wiki site, which is also available Additionally to the site.",
            "So this is another way."
        ],
        [
            "As a citizen and use up data to go in and actually engage with the site, an actually take part in the actual use of the data like that.",
            "So exploring the data, you have different options on the side.",
            "You can obviously go in and see a table such as this one, which provides of course lists of data as they are, but you can actually also visualize the data in."
        ],
        [
            "In different ways here you see a map version from the data that has geographic.",
            "Values, so basically you can go in and look at the map and see exactly where whether the data relates to geographically.",
            "You can also go in and use the graph view and."
        ],
        [
            "Rather than looking at the table version, get visual visualization of the data in a table, also allowing you to actually apply more sets of data in the same table.",
            "Now in the same graph and thereby making comparisons.",
            "The idea of course, with this visualization features are of course to be able to make meaning from these these data as a way to make it easier to find the kind of data that you're looking for.",
            "Especially for people who want to use the data."
        ],
        [
            "For projects of which we have two examples here, the first one, traintimes.org.uk, is one of the featured projects on the front page of the actual site.",
            "You can see that here, but it's actually a live map that shows the exact position or estimated position of tube trains in London at all times, and this is of course based on the data that the person who made this project.",
            "Found via the public data EU sites.",
            "The other example here is the project below called Europe's energy, which is really neat site that was developed actually from data from Euro stat, but the idea is the same, namely to try to make meaning out of data by visualizing them in different ways.",
            "The site is really interactive and you can.",
            "Create various bubble diagrams like the one you see below and compare countries.",
            "An difference different criterias of their energy consumption and production.",
            "One thing we'd like to also leave."
        ],
        [
            "Your attention to in terms of using open data is this related project which we have recently had been part of starting.",
            "We opened this foundation is one of 19 partners for the project title apps for Europe.",
            "Which is this thematic network project that works with 20 existing app competitions around Europe in an effort to create more interoperability in the creation of apps and also.",
            "A helping app developers actually become more serious in their work with developing apps and thereby making business from all these open data being made available.",
            "So that concludes."
        ],
        [
            "It's our brief presentation.",
            "If you want to get in touch in regards to this, send us an email on info at public data dot EU.",
            "We also of course encourage you to connect with us through all the social media platforms you see here, not just for public data you, but for any of all the projects that we run with the Open Knowledge Foundation, thanks.",
            "What is your perception based on your experience of the willingness by public administration to make their data open?",
            "Because it is something they do because they are convinced about the value of the data.",
            "Or is it because of the directives and they feel push somehow to publish this data?",
            "In fact, I remember a case in Spain there was a village or a city that published all the data about environment.",
            "And suddenly the newspapers or people study to analyze data and they appear like the most polluted city in Spain.",
            "So apparently the mayor closed all the channels of information immediately.",
            "So I was wondering if this value is really perceived by public sector or not.",
            "What is your experience about that?",
            "Yeah, I think this is an interesting question and the example you mentioned is a good one.",
            "How it may potentially be perceived as backfire on the on the the government that's releasing the data.",
            "I think in general though we see a positive tendency towards releasing more data and even though not all governments on all levels are as eager as some others to release data due to the directive, you know they have to in some cases.",
            "And also we see that.",
            "That some governments are seeing the value once they have actually crossed that line and actually have done it and made up and open data portal available, made the data available and then if you have a few competitions and you have a few apps, for example the one that Christian showed around the train times, some of them can be very compelling and it can be an encouragement for governments to further release data and make more data available if they see what the public can do with their data without.",
            "Any investment from the government, and I think that's where the value for a lot of these governments come from, they can see that the data is being taken up by the by the general public and actually being put to use and at that point they can see the extra value, but it's trying to convince them to 1st make the data available before they can actually see the value.",
            "So one of the things we do as part of apps for Europe is to gather these success stories and gather from throughout Europe.",
            "All of these successful applications of open data too.",
            "Take those two to governments that are not that willing to release data and show them what the value can be, and actually making their data openly available."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And before I'll tell you about there.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Public data dot EU portal.",
                    "label": 0
                },
                {
                    "sent": "I'll I'll tell a little bit about the Open Knowledge Foundation about who we are and what we do.",
                    "label": 0
                },
                {
                    "sent": "We are a nonprofit organization that are dedicated to promoting openness in all its forms, and that's mostly centered around open data.",
                    "label": 1
                },
                {
                    "sent": "On the one hand, and open content on the other hand, and we structure our activities around communities and tools and communities, can be open, government related or open science or Open Access or open culture, and we organize activities such as the Open Knowledge Conference which is happening in September this year.",
                    "label": 0
                },
                {
                    "sent": "We educate on on data and data literacy.",
                    "label": 0
                },
                {
                    "sent": "With the School of data, for example, which allows you to learn about how to work with data out, officialize data, etc.",
                    "label": 0
                },
                {
                    "sent": "And we publish resources such as the Open Data Handbook which is further aimed at increasing literacy and and helping people understand what open data is, what.",
                    "label": 0
                },
                {
                    "sent": "We're also more active nowadays in engaging citizens in the general public with things like science.",
                    "label": 0
                },
                {
                    "sent": "So crowd crafting is a platform that we built in order to engage the general public in scientific projects and and crowd make crowdsourcing for good as we.",
                    "label": 0
                },
                {
                    "sent": "As we call it.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, we build tools and see can is one of the probably the most famous example of the tool that we've built that we we've deployed across across several governments, for example, but also other organizations like universities, are starting to use it, and we build other tools such as open spending, which is a tool specifically aimed at providing more transparency about government spending, and we have deployed that across different countries around the world.",
                    "label": 0
                },
                {
                    "sent": "And when we talk about openness, we don't.",
                    "label": 0
                },
                {
                    "sent": "We don't just mean it, make it available on the web, but we have a very specific idea about what open is.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we maintain a website called Open definition.org which is a community effort to further define what open means and for us a piece of content or data is open.",
                    "label": 0
                },
                {
                    "sent": "If anyone is free to use, reuse and re distributed subject only at most to the requirement to attribute and share alike so that those are two extra options that you could have when you make data available.",
                    "label": 1
                },
                {
                    "sent": "And there are several licenses that we that we have developed ourselves so that we have incorporated in open.",
                    "label": 0
                },
                {
                    "sent": "Open definition.org for example.",
                    "label": 0
                },
                {
                    "sent": "The Creative Commons licenses and we encourage everyone to have a look at those and help us further spread the world word about open licenses and help people understand to openly license their content and data.",
                    "label": 0
                },
                {
                    "sent": "Because if you license it openly, you explicitly allow for the possibility of reusing it in a way that doesn't further limit any uptake of content or data, and we think that if you don't explicitly license the.",
                    "label": 0
                },
                {
                    "sent": "Information you make available online.",
                    "label": 0
                },
                {
                    "sent": "It's much more difficult for people to understand to know how they can use the information and how they can further use or reuse your data.",
                    "label": 0
                },
                {
                    "sent": "So now moving on to public data U and this is Annette.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sample of one of the portals that we've recently included in public data.",
                    "label": 0
                },
                {
                    "sent": "You this is the national portal for Austria.",
                    "label": 0
                },
                {
                    "sent": "Data GC 80 and this is an example of an open data portal that is running on the on the national level for Austria and you can see on the screen shot that they actually get their information for some of the from some of the local open data portals throughout Austria and they aggregate those on the national level, and then we intern from public data EU.",
                    "label": 0
                },
                {
                    "sent": "Aggregate the information from the national level into public data EU and that's really what what public data EU is about.",
                    "label": 0
                },
                {
                    "sent": "It's about aggregating data from all of these different sources across Europe and make those available fire a central portal and allowed the search and categorization of this data through a central means and at the moment this is just a prototype and it's being developed as part of the LO D2 project.",
                    "label": 0
                },
                {
                    "sent": "One of the organizing project and we use the Open Knowledge Foundation or a partner on that project.",
                    "label": 0
                },
                {
                    "sent": "And this is an example of a portal that's running on C cannon.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Christian in a moment will show a little bit more about the features that we've developed over the last few months on public data EU.",
                    "label": 0
                },
                {
                    "sent": "But before we go there, I'd like to explain a little bit about two related initiatives that we have developed or are involved with related to the aggregation of data from different portals because it's not always that easy to aggregate data from other portals because it depends on the technical level.",
                    "label": 0
                },
                {
                    "sent": "Of course alot on the technology that's being used in these different portals and.",
                    "label": 0
                },
                {
                    "sent": "If portals use the software that we've developed on seek, and it's easier for us to aggregate that on on another ccount platform.",
                    "label": 0
                },
                {
                    "sent": "But if there is a custom build portal that are not using standard technologies, it's sometimes more difficult to aggregate that data in public data EU.",
                    "label": 0
                },
                {
                    "sent": "So there are two initiatives that I think are relevant in this in this area.",
                    "label": 0
                },
                {
                    "sent": "One is a recently started working group that.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Like to mention here by the EC to create a deep cut profile for data portals in Europe and we are a member of that of that working group.",
                    "label": 1
                },
                {
                    "sent": "And if you are interested in open data portals and you'd like to learn more about this, I I encourage you to join us and I'm sure that people are consuming Hills there who can tell you more about it.",
                    "label": 0
                },
                {
                    "sent": "And there are other people involved here with that working group and this is really an effort to better understand how you define an open data portal.",
                    "label": 0
                },
                {
                    "sent": "What are the elements that are needed specifically from the requirements in Europe?",
                    "label": 0
                },
                {
                    "sent": "And that's more on the on.",
                    "label": 0
                },
                {
                    "sent": "The semantic level of how you define open data, portals and metadata around the content, but there's also the question about how do you actually get to data?",
                    "label": 0
                },
                {
                    "sent": "How do you define the API to actually access an open data portal?",
                    "label": 0
                },
                {
                    "sent": "And some of the work that.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We've done in this space is around an initiative we called ikip or data Catalog Interoperability protocol, which is aiming to to allow for an API that will define how you actually access data that is using D cat on the portal level, and this is still quite early work.",
                    "label": 0
                },
                {
                    "sent": "I should say we we started it with a community effort at a workshop when we're planning to organise another workshop soon to make sure we better define how to how to.",
                    "label": 0
                },
                {
                    "sent": "Interoperate between all these different data portals and make it easier for people to share the data, aggregate data and make the receipt their data more easily discoverable, as well as making it easier for other people to use it and find the data that they've made available on their portals.",
                    "label": 0
                },
                {
                    "sent": "So I'll now hand over to Christian who will explain more about how we built public data EU on.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We can and latest features that we've developed around that.",
                    "label": 0
                },
                {
                    "sent": "Yes, thank you.",
                    "label": 0
                },
                {
                    "sent": "A center already hinted at public data.",
                    "label": 0
                },
                {
                    "sent": "EU runs on second, which is this open source data portal software that we've developed and reasonably large.",
                    "label": 1
                },
                {
                    "sent": "Launched in our version 2.0 beta and.",
                    "label": 0
                },
                {
                    "sent": "I want to.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To take your spin on the site, basically show you some of these new features that we've deployed as part of this 2.0 beta version which are, among other some social features.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which are, among other away to engage citizens and people interested in open data and make meaning of all these open data that are being made available.",
                    "label": 0
                },
                {
                    "sent": "So public data dot EU is as mentioned in the title, A one stop shop for public data in the EU.",
                    "label": 0
                },
                {
                    "sent": "So you can go there to to get the grand overview, but you can also go in and look at countries specifically.",
                    "label": 0
                },
                {
                    "sent": "One way is this.",
                    "label": 0
                },
                {
                    "sent": "Availability map that you see here as well as inside on the side you have this map that we've cut in on the side.",
                    "label": 0
                },
                {
                    "sent": "Basically you can go in and take any other countries.",
                    "label": 0
                },
                {
                    "sent": "This is saying that primarily EU 27 countries go in and see exactly what data sets are available for a country.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The social aspects that I mentioned before allows you to engage with these data in new ways.",
                    "label": 0
                },
                {
                    "sent": "Basically, as you can see here, you can make a profile on the site and go in and look at that data and actually follow the data streams in order to keep getting updated about you harvest of these these data at the same time.",
                    "label": 0
                },
                {
                    "sent": "You can also follow other users in here and engage with with them.",
                    "label": 0
                },
                {
                    "sent": "As well, you can comment and communicate in there, but you can even also share your findings in there on some of the major social media platforms.",
                    "label": 0
                },
                {
                    "sent": "Google Plus Twitter Facebook being those obviously.",
                    "label": 1
                },
                {
                    "sent": "Another",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anything about this?",
                    "label": 0
                },
                {
                    "sent": "This recent version is how the side supports the semantic Web through RDF.",
                    "label": 0
                },
                {
                    "sent": "As you can see here also from the screen dump, you can go in and explore the data as they are, which I'll show you in a minute, but you can also actually download RDF version of the data and actually most of the data are not available initially as RDF, but through work by Soren Auer from Leipzig University.",
                    "label": 0
                },
                {
                    "sent": "And others and development of a neat tool called CSV.",
                    "label": 0
                },
                {
                    "sent": "Two RDF has been developed which basically lets you automatically convert the data to RDF, providing a default mapping between the CSV file, which is usually a spreadsheet like Excel and then providing this default mapping into RDF.",
                    "label": 0
                },
                {
                    "sent": "The new thing.",
                    "label": 0
                },
                {
                    "sent": "Another thing is also that you can actually go in as a user and re map these data.",
                    "label": 0
                },
                {
                    "sent": "The relationship between the CSV file in the RDF through Wiki site, which is also available Additionally to the site.",
                    "label": 0
                },
                {
                    "sent": "So this is another way.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As a citizen and use up data to go in and actually engage with the site, an actually take part in the actual use of the data like that.",
                    "label": 0
                },
                {
                    "sent": "So exploring the data, you have different options on the side.",
                    "label": 0
                },
                {
                    "sent": "You can obviously go in and see a table such as this one, which provides of course lists of data as they are, but you can actually also visualize the data in.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In different ways here you see a map version from the data that has geographic.",
                    "label": 1
                },
                {
                    "sent": "Values, so basically you can go in and look at the map and see exactly where whether the data relates to geographically.",
                    "label": 0
                },
                {
                    "sent": "You can also go in and use the graph view and.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rather than looking at the table version, get visual visualization of the data in a table, also allowing you to actually apply more sets of data in the same table.",
                    "label": 0
                },
                {
                    "sent": "Now in the same graph and thereby making comparisons.",
                    "label": 0
                },
                {
                    "sent": "The idea of course, with this visualization features are of course to be able to make meaning from these these data as a way to make it easier to find the kind of data that you're looking for.",
                    "label": 0
                },
                {
                    "sent": "Especially for people who want to use the data.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For projects of which we have two examples here, the first one, traintimes.org.uk, is one of the featured projects on the front page of the actual site.",
                    "label": 0
                },
                {
                    "sent": "You can see that here, but it's actually a live map that shows the exact position or estimated position of tube trains in London at all times, and this is of course based on the data that the person who made this project.",
                    "label": 0
                },
                {
                    "sent": "Found via the public data EU sites.",
                    "label": 0
                },
                {
                    "sent": "The other example here is the project below called Europe's energy, which is really neat site that was developed actually from data from Euro stat, but the idea is the same, namely to try to make meaning out of data by visualizing them in different ways.",
                    "label": 0
                },
                {
                    "sent": "The site is really interactive and you can.",
                    "label": 0
                },
                {
                    "sent": "Create various bubble diagrams like the one you see below and compare countries.",
                    "label": 0
                },
                {
                    "sent": "An difference different criterias of their energy consumption and production.",
                    "label": 0
                },
                {
                    "sent": "One thing we'd like to also leave.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Your attention to in terms of using open data is this related project which we have recently had been part of starting.",
                    "label": 0
                },
                {
                    "sent": "We opened this foundation is one of 19 partners for the project title apps for Europe.",
                    "label": 0
                },
                {
                    "sent": "Which is this thematic network project that works with 20 existing app competitions around Europe in an effort to create more interoperability in the creation of apps and also.",
                    "label": 0
                },
                {
                    "sent": "A helping app developers actually become more serious in their work with developing apps and thereby making business from all these open data being made available.",
                    "label": 0
                },
                {
                    "sent": "So that concludes.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's our brief presentation.",
                    "label": 0
                },
                {
                    "sent": "If you want to get in touch in regards to this, send us an email on info at public data dot EU.",
                    "label": 0
                },
                {
                    "sent": "We also of course encourage you to connect with us through all the social media platforms you see here, not just for public data you, but for any of all the projects that we run with the Open Knowledge Foundation, thanks.",
                    "label": 0
                },
                {
                    "sent": "What is your perception based on your experience of the willingness by public administration to make their data open?",
                    "label": 0
                },
                {
                    "sent": "Because it is something they do because they are convinced about the value of the data.",
                    "label": 0
                },
                {
                    "sent": "Or is it because of the directives and they feel push somehow to publish this data?",
                    "label": 0
                },
                {
                    "sent": "In fact, I remember a case in Spain there was a village or a city that published all the data about environment.",
                    "label": 0
                },
                {
                    "sent": "And suddenly the newspapers or people study to analyze data and they appear like the most polluted city in Spain.",
                    "label": 0
                },
                {
                    "sent": "So apparently the mayor closed all the channels of information immediately.",
                    "label": 0
                },
                {
                    "sent": "So I was wondering if this value is really perceived by public sector or not.",
                    "label": 0
                },
                {
                    "sent": "What is your experience about that?",
                    "label": 0
                },
                {
                    "sent": "Yeah, I think this is an interesting question and the example you mentioned is a good one.",
                    "label": 0
                },
                {
                    "sent": "How it may potentially be perceived as backfire on the on the the government that's releasing the data.",
                    "label": 0
                },
                {
                    "sent": "I think in general though we see a positive tendency towards releasing more data and even though not all governments on all levels are as eager as some others to release data due to the directive, you know they have to in some cases.",
                    "label": 0
                },
                {
                    "sent": "And also we see that.",
                    "label": 0
                },
                {
                    "sent": "That some governments are seeing the value once they have actually crossed that line and actually have done it and made up and open data portal available, made the data available and then if you have a few competitions and you have a few apps, for example the one that Christian showed around the train times, some of them can be very compelling and it can be an encouragement for governments to further release data and make more data available if they see what the public can do with their data without.",
                    "label": 0
                },
                {
                    "sent": "Any investment from the government, and I think that's where the value for a lot of these governments come from, they can see that the data is being taken up by the by the general public and actually being put to use and at that point they can see the extra value, but it's trying to convince them to 1st make the data available before they can actually see the value.",
                    "label": 0
                },
                {
                    "sent": "So one of the things we do as part of apps for Europe is to gather these success stories and gather from throughout Europe.",
                    "label": 0
                },
                {
                    "sent": "All of these successful applications of open data too.",
                    "label": 0
                },
                {
                    "sent": "Take those two to governments that are not that willing to release data and show them what the value can be, and actually making their data openly available.",
                    "label": 0
                }
            ]
        }
    }
}