{
    "id": "flncicwajtidflxw365qe7pprszmkkim",
    "title": "META-NET: Towards the Multilingual Europe Technology Alliance",
    "info": {
        "author": [
            "Hans Uszkoreit, German Research Center for Artificial Intelligence (DFKI)"
        ],
        "published": "July 15, 2010",
        "recorded": "June 2010",
        "category": [
            "Top->Events",
            "Top->Computer Science->Computational Linguistics->Machine Translation"
        ]
    },
    "url": "http://videolectures.net/translingeu2010_uszkoreit_tme/",
    "segmentation": [
        [
            "Just give you a very brief overview.",
            "This is mainly important for the Europeans among you, so only for 95%."
        ],
        [
            "Of the people in the room, and it's a.",
            "It's an initiative I won't try and not to bother you with lots of the administrative details, but give you a little overview Metanet together with your matrix.",
            "These two projects are the organizers of this event today.",
            "The Euro matrix project will be introduced in the latest results will be given to you in the next stop by USF Fund in a bit, so I think I can make this introductory part short because we are all in the field.",
            "We don't need to be convinced this is preaching to the choir.",
            "It's pretty clear that Europe now and he said he isn't quite his.",
            "Some opposition building up to two of you change that Kimber Aussie indicated in his introductory remarks.",
            "Yeah, there's quite some opposition building up here.",
            "On the one hand, it's true right now Europe could save some money, but very little money because we don't get much here in language technology.",
            "On the other hand.",
            "Costs that could come up with neglecting this area, taking the sensitivity of language communities when it comes to their cultural identity could be quite drastic.",
            "Yeah, so in the end, language communities as we know from many parts of the world, they are able to not only spend money on their language, but also to do bloodshed, to fight, to destroy cities, to do anything to maybe reject the next Treaty of the European Union.",
            "And veto it to do anything to keep their identity.",
            "So here we really have a problem because Europe, as opposed to the other superpowers of the world to the United States, to Japan, to China, is not a mainly predominant monolingual SoC, but Europe has made this promise that even the smallest of our languages in Europe is important enough to be kept and preserved, and this would cost a little money.",
            "And in another talk I calculated that.",
            "Actually, our field just needs the tiny some that it cost to build 93 kilometers of Hwy around, namely 500,500 million euro for the next years would suffice to make a bigger push in this area.",
            "And this is just a tiny little drop of money for the you for the major challenges are clear, it's preserving the European cultural and linguistic diversity secure."
        ],
        [
            "Ring at affordable cost.",
            "The free flow of information and thought across languages and then not only the cross lingual aspect but also providing each language community with the most advanced technologies for communication, information and knowledge management so that maintaining the mother tongue does not turn into a disk."
        ],
        [
            "Advantage so that people don't regret later on that they followed this.",
            "So where are we today?",
            "Yes, of course we are researchers and of course we have been successful, at least partially.",
            "So research has made considerable progress in recent years.",
            "Successful projects have been funded by EU national programs others, but the pace of progress is really too slow.",
            "It's not fast enough to meet the three challenges I just mentioned within the next 10 to 20 years, but this is very important time.",
            "This is when the digital SoC the.",
            "Common Digital, the single digital market develops, and so there's no way that with the current pace of progress, we will be able to really provide the necessary technological means for not even the 23 official languages leave alone.",
            "The 57 or so languages of Europe that really want to survive can progress be accelerated, yes, but only if the relevant stakeholders such as research communities, the language, technology, industry, user industries, language communities, funding programs, policy makers, team up.",
            "Two and two, a joint.",
            "Not that every work has to be joined, clearly not.",
            "There will be lots of different lots of different strengths of research, technology development, market exploration, market penetration.",
            "But nevertheless we need first to team up because otherwise the type of subsidy that this mainly SMB oriented SME centered sector of economy needs.",
            "The subsidy won't get.",
            "Many other areas have this subsidy and have much stronger subsidies here.",
            "When you think of the European airplane industry."
        ],
        [
            "And and automobile industry is heavily subsidized by countries now, but the language technology industry really is not.",
            "It's heavily underfunded.",
            "So how can we form such an alliant?",
            "So how can we as researchers now?"
        ],
        [
            "We also I'm a researcher.",
            "How can I do it?",
            "I mean, as many of you are from industry or you have all the power you don't have the time, you know, but you have all the power you could do it and so how can we together do it?",
            "Yeah."
        ],
        [
            "And it's clear the mechanism is not that difficult, and it has been shown by other fields, so you need to strong community with ties to other communities with a network of industry public administration.",
            "But then in addition you need some visions and plans just with a bunch of individual project proposals.",
            "Nobody is going to give us these 500 million nobody because we need something more.",
            "We need a strategic research agenda and then you get the visibility credibility you get massive support and then it feeds back.",
            "And as already indicated, there are good examples from other areas.",
            "There are other errors and other technology fields who have done this already who have formed this type of alliance, sometimes strengthened by the fact that more large."
        ],
        [
            "Organizations large multinational companies are part of these technology areas.",
            "We only have them in the user industries there.",
            "We also have them here, but they teamed up and they got there.",
            "They came up with visions with a strategic research agenda and actually all of these groups by one instrument or the other.",
            "They use completely different instruments, but in the end here they managed to get up.",
            "These 10s and in many cases hundreds of millions of support for their fields.",
            "And if you look at the titles they are important but they are not more important than the preservation of linguistic diversity in Europe."
        ],
        [
            "So meta or meta net is actually dedicated to foster this technologic.",
            "The technological foundations of the European Multilingual information SoC.",
            "Now this is the goal here.",
            "The Alliance and Metanet now tries to establish."
        ],
        [
            "This alliance so the meta net is just a network of excellence, and it has three major objectives.",
            "First, to prepare the grounds for this large scale concerted effort by trying to bring together the Strategic alliance, then strengthen the European research community through networking of research, sharing resources and efforts.",
            "Here we are on a line with other initiatives like Flarenet claren like Towers, many others we need to kind of combine our efforts and then build bridges.",
            "By approaching open problems and research in collaboration with other research fields such as Miss."
        ],
        [
            "Team learning social computing, cognitive systems, cognitive science, knowledge technologies, multimedia content so that we are better connected there and this network got some initial funding.",
            "So 6 million Euro contribution and it's funded for three years.",
            "And maybe it's not by mistake funded at a time when the eight framework program is being prepared and many other things happen in Europe.",
            "And there's no one project funded under Metanet, but there are other projects in the making.",
            "Whether they will be funded, we will see we will be there.",
            "Let's be optimistic there other proposals and they are looked at now and evaluated carefully.",
            "And if we are lucky then we will have a couple of more."
        ],
        [
            "Projects under this umbrella and we have established many corporations with things like Clara nor the Multilingual web project or many other projects that provide resources because, as I said, without this general alliance it won't be possible.",
            "Those are the funding members.",
            "I won't go through the list in detail, but some of the strongest groups and in Europe now and as I said right now there are maybe three times these numbers in the wings in these other.",
            "Consortia that have put in the projects now that may be funded and join us, hopefully.",
            "So."
        ],
        [
            "There are these three lengths of actions are already mentioned.",
            "When is the community building and then the exchange the meta share building a resource exchange and building bridges to neighboring fields with not not in isolation, but.",
            "But really, with very explicit concrete topics of research that help to address, because you cannot, researchers cannot draw in other researchers without getting their ambition and do it with very specific research topics.",
            "Let me say a few words on the."
        ],
        [
            "Because that is where we want to get all of your cooperation.",
            "So we need to mobilize researchers, enables providers for cooperation and you first need to survey the field.",
            "Not really, because this will be the main tool later to convince the politicians supported the survey would be a huge grid.",
            "Imagine 57 or 60 or whatever languages and then all the technologies really needed to guarantee their survival in the digital society and then you would say how far are we from this point and it is right now is sparsely filled matrix.",
            "Not much we can say.",
            "It's a very sparsely filled matrix, so that will rather shock people now.",
            "But if the survey can be used to convince the politicians and Kimo said right now, the main worry is saving money at all metrics and just fix things at the most.",
            "But if we get the there's a different view.",
            "If you look at it from the viewpoint of language communities we will have a forum on smaller languages later today during our conference here and then we will hear what the smaller languages have to say.",
            "And I think they see the priorities a little different because it's actually drawing the carpet underneath away from them.",
            "If their language is really not supported, so this grid there is not so much there for putting in price tags and shocking the European public.",
            "And how much is needed, this partially filled matrix.",
            "But it is mainly for telling the people who care about individual languages, namely the individual language communities.",
            "What's really needed for them and how do they stand.",
            "In comparison with the better resourced languages and then they can estimate their chances and then they can really help because we need their help so."
        ],
        [
            "Then to come up with a strategic research agenda and build the community so there's the survey and we have established three vision groups.",
            "We are in the project now.",
            "We're putting them together on three topics, three areas of India."
        ],
        [
            "And then, with the help of a technology Council that we will establish, we will try to approach the decision makers and strategic research agenda.",
            "So these vision groups are in three areas and we have already together with the help of the public, we had a public call.",
            "People were suggested proposed by the public.",
            "Then we selected.",
            "The error of translation, localization media and Information Services and interactive systems, and of course, multilinguality goes across those clearly."
        ],
        [
            "So what can people do to help?",
            "They can work in vision groups.",
            "They can provide input via a web based discussion forum that we are setting up now they can contribute to these language reports.",
            "They participate in the conference and the idea."
        ],
        [
            "It's really to start them out from this language community with the metanet.",
            "Have these vision groups have the Council get the provider user industries, language communities in and some we got already in this room.",
            "Lots of them."
        ],
        [
            "Are already in this room, so if you leave then."
        ],
        [
            "Try to not not believe too."
        ],
        [
            "Not sure to be in state part of this state."
        ],
        [
            "Why does this thing so?",
            "We have set up a virtual Information Center that will keep."
        ],
        [
            "Informed on that.",
            "So how can you participate?",
            "Centers of Excellence and Language Technology research can come up here.",
            "Be involved as additional nodes of metanet researchers, technologists, professionals."
        ],
        [
            "Can help research and technology development projects can participate and you find all of this text out to right.",
            "I don't have to repeat it because you have all found this little folder on your on your desk, so why do I use?"
        ],
        [
            "Precious time now to say exactly what you can read at any point here.",
            "So your voice is important, as is your language.",
            "It's a it is a big business in Europe, but we have to convince we have to do quite a bit of convincing work of persuading and where to start.",
            "It's basically at this web address I started this web address and send email to this email and come to our next meetings.",
            "And it would be really, and we really hope to draw in.",
            "Watch is the 100 plus new groups that Kimmel was asking.",
            "But also get the sustained support of some of the groups who and companies who are very active already in the field and try to develop this strategic risk."
        ],
        [
            "Which agenda thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just give you a very brief overview.",
                    "label": 0
                },
                {
                    "sent": "This is mainly important for the Europeans among you, so only for 95%.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of the people in the room, and it's a.",
                    "label": 0
                },
                {
                    "sent": "It's an initiative I won't try and not to bother you with lots of the administrative details, but give you a little overview Metanet together with your matrix.",
                    "label": 0
                },
                {
                    "sent": "These two projects are the organizers of this event today.",
                    "label": 0
                },
                {
                    "sent": "The Euro matrix project will be introduced in the latest results will be given to you in the next stop by USF Fund in a bit, so I think I can make this introductory part short because we are all in the field.",
                    "label": 0
                },
                {
                    "sent": "We don't need to be convinced this is preaching to the choir.",
                    "label": 0
                },
                {
                    "sent": "It's pretty clear that Europe now and he said he isn't quite his.",
                    "label": 0
                },
                {
                    "sent": "Some opposition building up to two of you change that Kimber Aussie indicated in his introductory remarks.",
                    "label": 0
                },
                {
                    "sent": "Yeah, there's quite some opposition building up here.",
                    "label": 0
                },
                {
                    "sent": "On the one hand, it's true right now Europe could save some money, but very little money because we don't get much here in language technology.",
                    "label": 0
                },
                {
                    "sent": "On the other hand.",
                    "label": 0
                },
                {
                    "sent": "Costs that could come up with neglecting this area, taking the sensitivity of language communities when it comes to their cultural identity could be quite drastic.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so in the end, language communities as we know from many parts of the world, they are able to not only spend money on their language, but also to do bloodshed, to fight, to destroy cities, to do anything to maybe reject the next Treaty of the European Union.",
                    "label": 1
                },
                {
                    "sent": "And veto it to do anything to keep their identity.",
                    "label": 0
                },
                {
                    "sent": "So here we really have a problem because Europe, as opposed to the other superpowers of the world to the United States, to Japan, to China, is not a mainly predominant monolingual SoC, but Europe has made this promise that even the smallest of our languages in Europe is important enough to be kept and preserved, and this would cost a little money.",
                    "label": 0
                },
                {
                    "sent": "And in another talk I calculated that.",
                    "label": 0
                },
                {
                    "sent": "Actually, our field just needs the tiny some that it cost to build 93 kilometers of Hwy around, namely 500,500 million euro for the next years would suffice to make a bigger push in this area.",
                    "label": 0
                },
                {
                    "sent": "And this is just a tiny little drop of money for the you for the major challenges are clear, it's preserving the European cultural and linguistic diversity secure.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ring at affordable cost.",
                    "label": 0
                },
                {
                    "sent": "The free flow of information and thought across languages and then not only the cross lingual aspect but also providing each language community with the most advanced technologies for communication, information and knowledge management so that maintaining the mother tongue does not turn into a disk.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Advantage so that people don't regret later on that they followed this.",
                    "label": 0
                },
                {
                    "sent": "So where are we today?",
                    "label": 1
                },
                {
                    "sent": "Yes, of course we are researchers and of course we have been successful, at least partially.",
                    "label": 0
                },
                {
                    "sent": "So research has made considerable progress in recent years.",
                    "label": 1
                },
                {
                    "sent": "Successful projects have been funded by EU national programs others, but the pace of progress is really too slow.",
                    "label": 1
                },
                {
                    "sent": "It's not fast enough to meet the three challenges I just mentioned within the next 10 to 20 years, but this is very important time.",
                    "label": 0
                },
                {
                    "sent": "This is when the digital SoC the.",
                    "label": 0
                },
                {
                    "sent": "Common Digital, the single digital market develops, and so there's no way that with the current pace of progress, we will be able to really provide the necessary technological means for not even the 23 official languages leave alone.",
                    "label": 0
                },
                {
                    "sent": "The 57 or so languages of Europe that really want to survive can progress be accelerated, yes, but only if the relevant stakeholders such as research communities, the language, technology, industry, user industries, language communities, funding programs, policy makers, team up.",
                    "label": 1
                },
                {
                    "sent": "Two and two, a joint.",
                    "label": 0
                },
                {
                    "sent": "Not that every work has to be joined, clearly not.",
                    "label": 0
                },
                {
                    "sent": "There will be lots of different lots of different strengths of research, technology development, market exploration, market penetration.",
                    "label": 0
                },
                {
                    "sent": "But nevertheless we need first to team up because otherwise the type of subsidy that this mainly SMB oriented SME centered sector of economy needs.",
                    "label": 0
                },
                {
                    "sent": "The subsidy won't get.",
                    "label": 0
                },
                {
                    "sent": "Many other areas have this subsidy and have much stronger subsidies here.",
                    "label": 0
                },
                {
                    "sent": "When you think of the European airplane industry.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And and automobile industry is heavily subsidized by countries now, but the language technology industry really is not.",
                    "label": 0
                },
                {
                    "sent": "It's heavily underfunded.",
                    "label": 0
                },
                {
                    "sent": "So how can we form such an alliant?",
                    "label": 1
                },
                {
                    "sent": "So how can we as researchers now?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We also I'm a researcher.",
                    "label": 0
                },
                {
                    "sent": "How can I do it?",
                    "label": 1
                },
                {
                    "sent": "I mean, as many of you are from industry or you have all the power you don't have the time, you know, but you have all the power you could do it and so how can we together do it?",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And it's clear the mechanism is not that difficult, and it has been shown by other fields, so you need to strong community with ties to other communities with a network of industry public administration.",
                    "label": 1
                },
                {
                    "sent": "But then in addition you need some visions and plans just with a bunch of individual project proposals.",
                    "label": 0
                },
                {
                    "sent": "Nobody is going to give us these 500 million nobody because we need something more.",
                    "label": 0
                },
                {
                    "sent": "We need a strategic research agenda and then you get the visibility credibility you get massive support and then it feeds back.",
                    "label": 0
                },
                {
                    "sent": "And as already indicated, there are good examples from other areas.",
                    "label": 0
                },
                {
                    "sent": "There are other errors and other technology fields who have done this already who have formed this type of alliance, sometimes strengthened by the fact that more large.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Organizations large multinational companies are part of these technology areas.",
                    "label": 0
                },
                {
                    "sent": "We only have them in the user industries there.",
                    "label": 0
                },
                {
                    "sent": "We also have them here, but they teamed up and they got there.",
                    "label": 0
                },
                {
                    "sent": "They came up with visions with a strategic research agenda and actually all of these groups by one instrument or the other.",
                    "label": 0
                },
                {
                    "sent": "They use completely different instruments, but in the end here they managed to get up.",
                    "label": 0
                },
                {
                    "sent": "These 10s and in many cases hundreds of millions of support for their fields.",
                    "label": 0
                },
                {
                    "sent": "And if you look at the titles they are important but they are not more important than the preservation of linguistic diversity in Europe.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So meta or meta net is actually dedicated to foster this technologic.",
                    "label": 0
                },
                {
                    "sent": "The technological foundations of the European Multilingual information SoC.",
                    "label": 1
                },
                {
                    "sent": "Now this is the goal here.",
                    "label": 0
                },
                {
                    "sent": "The Alliance and Metanet now tries to establish.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This alliance so the meta net is just a network of excellence, and it has three major objectives.",
                    "label": 1
                },
                {
                    "sent": "First, to prepare the grounds for this large scale concerted effort by trying to bring together the Strategic alliance, then strengthen the European research community through networking of research, sharing resources and efforts.",
                    "label": 1
                },
                {
                    "sent": "Here we are on a line with other initiatives like Flarenet claren like Towers, many others we need to kind of combine our efforts and then build bridges.",
                    "label": 1
                },
                {
                    "sent": "By approaching open problems and research in collaboration with other research fields such as Miss.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Team learning social computing, cognitive systems, cognitive science, knowledge technologies, multimedia content so that we are better connected there and this network got some initial funding.",
                    "label": 0
                },
                {
                    "sent": "So 6 million Euro contribution and it's funded for three years.",
                    "label": 0
                },
                {
                    "sent": "And maybe it's not by mistake funded at a time when the eight framework program is being prepared and many other things happen in Europe.",
                    "label": 0
                },
                {
                    "sent": "And there's no one project funded under Metanet, but there are other projects in the making.",
                    "label": 1
                },
                {
                    "sent": "Whether they will be funded, we will see we will be there.",
                    "label": 0
                },
                {
                    "sent": "Let's be optimistic there other proposals and they are looked at now and evaluated carefully.",
                    "label": 0
                },
                {
                    "sent": "And if we are lucky then we will have a couple of more.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Projects under this umbrella and we have established many corporations with things like Clara nor the Multilingual web project or many other projects that provide resources because, as I said, without this general alliance it won't be possible.",
                    "label": 0
                },
                {
                    "sent": "Those are the funding members.",
                    "label": 0
                },
                {
                    "sent": "I won't go through the list in detail, but some of the strongest groups and in Europe now and as I said right now there are maybe three times these numbers in the wings in these other.",
                    "label": 0
                },
                {
                    "sent": "Consortia that have put in the projects now that may be funded and join us, hopefully.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There are these three lengths of actions are already mentioned.",
                    "label": 0
                },
                {
                    "sent": "When is the community building and then the exchange the meta share building a resource exchange and building bridges to neighboring fields with not not in isolation, but.",
                    "label": 0
                },
                {
                    "sent": "But really, with very explicit concrete topics of research that help to address, because you cannot, researchers cannot draw in other researchers without getting their ambition and do it with very specific research topics.",
                    "label": 0
                },
                {
                    "sent": "Let me say a few words on the.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Because that is where we want to get all of your cooperation.",
                    "label": 0
                },
                {
                    "sent": "So we need to mobilize researchers, enables providers for cooperation and you first need to survey the field.",
                    "label": 1
                },
                {
                    "sent": "Not really, because this will be the main tool later to convince the politicians supported the survey would be a huge grid.",
                    "label": 0
                },
                {
                    "sent": "Imagine 57 or 60 or whatever languages and then all the technologies really needed to guarantee their survival in the digital society and then you would say how far are we from this point and it is right now is sparsely filled matrix.",
                    "label": 0
                },
                {
                    "sent": "Not much we can say.",
                    "label": 0
                },
                {
                    "sent": "It's a very sparsely filled matrix, so that will rather shock people now.",
                    "label": 0
                },
                {
                    "sent": "But if the survey can be used to convince the politicians and Kimo said right now, the main worry is saving money at all metrics and just fix things at the most.",
                    "label": 0
                },
                {
                    "sent": "But if we get the there's a different view.",
                    "label": 0
                },
                {
                    "sent": "If you look at it from the viewpoint of language communities we will have a forum on smaller languages later today during our conference here and then we will hear what the smaller languages have to say.",
                    "label": 0
                },
                {
                    "sent": "And I think they see the priorities a little different because it's actually drawing the carpet underneath away from them.",
                    "label": 0
                },
                {
                    "sent": "If their language is really not supported, so this grid there is not so much there for putting in price tags and shocking the European public.",
                    "label": 0
                },
                {
                    "sent": "And how much is needed, this partially filled matrix.",
                    "label": 0
                },
                {
                    "sent": "But it is mainly for telling the people who care about individual languages, namely the individual language communities.",
                    "label": 0
                },
                {
                    "sent": "What's really needed for them and how do they stand.",
                    "label": 0
                },
                {
                    "sent": "In comparison with the better resourced languages and then they can estimate their chances and then they can really help because we need their help so.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then to come up with a strategic research agenda and build the community so there's the survey and we have established three vision groups.",
                    "label": 1
                },
                {
                    "sent": "We are in the project now.",
                    "label": 0
                },
                {
                    "sent": "We're putting them together on three topics, three areas of India.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then, with the help of a technology Council that we will establish, we will try to approach the decision makers and strategic research agenda.",
                    "label": 0
                },
                {
                    "sent": "So these vision groups are in three areas and we have already together with the help of the public, we had a public call.",
                    "label": 0
                },
                {
                    "sent": "People were suggested proposed by the public.",
                    "label": 0
                },
                {
                    "sent": "Then we selected.",
                    "label": 0
                },
                {
                    "sent": "The error of translation, localization media and Information Services and interactive systems, and of course, multilinguality goes across those clearly.",
                    "label": 1
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what can people do to help?",
                    "label": 0
                },
                {
                    "sent": "They can work in vision groups.",
                    "label": 1
                },
                {
                    "sent": "They can provide input via a web based discussion forum that we are setting up now they can contribute to these language reports.",
                    "label": 1
                },
                {
                    "sent": "They participate in the conference and the idea.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's really to start them out from this language community with the metanet.",
                    "label": 0
                },
                {
                    "sent": "Have these vision groups have the Council get the provider user industries, language communities in and some we got already in this room.",
                    "label": 0
                },
                {
                    "sent": "Lots of them.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are already in this room, so if you leave then.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Try to not not believe too.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not sure to be in state part of this state.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Why does this thing so?",
                    "label": 0
                },
                {
                    "sent": "We have set up a virtual Information Center that will keep.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Informed on that.",
                    "label": 0
                },
                {
                    "sent": "So how can you participate?",
                    "label": 0
                },
                {
                    "sent": "Centers of Excellence and Language Technology research can come up here.",
                    "label": 1
                },
                {
                    "sent": "Be involved as additional nodes of metanet researchers, technologists, professionals.",
                    "label": 1
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can help research and technology development projects can participate and you find all of this text out to right.",
                    "label": 0
                },
                {
                    "sent": "I don't have to repeat it because you have all found this little folder on your on your desk, so why do I use?",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Precious time now to say exactly what you can read at any point here.",
                    "label": 0
                },
                {
                    "sent": "So your voice is important, as is your language.",
                    "label": 1
                },
                {
                    "sent": "It's a it is a big business in Europe, but we have to convince we have to do quite a bit of convincing work of persuading and where to start.",
                    "label": 0
                },
                {
                    "sent": "It's basically at this web address I started this web address and send email to this email and come to our next meetings.",
                    "label": 0
                },
                {
                    "sent": "And it would be really, and we really hope to draw in.",
                    "label": 0
                },
                {
                    "sent": "Watch is the 100 plus new groups that Kimmel was asking.",
                    "label": 0
                },
                {
                    "sent": "But also get the sustained support of some of the groups who and companies who are very active already in the field and try to develop this strategic risk.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which agenda thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}