{
    "id": "fqagkrkx2bic3m7n6slxebq4xero5yl7",
    "title": "Teaching Data Mining: a Specific Experience",
    "info": {
        "author": [
            "Lluís Belanche, Technical University of Valencia (UPV)"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "October 2006",
        "category": [
            "Top->Computer Science->Data Mining"
        ]
    },
    "url": "http://videolectures.net/learning06_belanche_se/",
    "segmentation": [
        [
            "Give you some ideas about how we teach data mining in the.",
            "In the 5th, which is the computer science faculty?",
            "Of this University located in in Barcelona."
        ],
        [
            "I'm not going to bother you about the topic itself, but this is a definition of mine, so I wanted to give it to you.",
            "Blah blah blah techniques, algorithms, machine learning, statistics.",
            "For what for doing what in my humble opinion to make decisions based on weight?",
            "Plus a lot of experience.",
            "Plus a lot of common sense.",
            "This is my definition of data mining and this is what we try to transfer to the students."
        ],
        [
            "Ask about Cather said.",
            "There's a lot of of disciplines, methodologies, algorithms, techniques, So what subset of these which we could label as data mining is taught actually at the fee.",
            "We're in our in our core switches one semester course just four months.",
            "This is the outline.",
            "It covers some basic ground, but there are absolutely missing ones here.",
            "As you may notice, but.",
            "Well, neural networks and support vector machines should be present.",
            "Nearest neighbors decision trees.",
            "Classical regression Association rules is one of the appeals in data mining.",
            "Well, this is what we thought."
        ],
        [
            "Feature selection has been one of the topics in one of their talks.",
            "It's not explicitly covered, but it's always present in the background.",
            "We emphasize the extremely.",
            "Importance of selecting adequate features and whynott trying to extract new ones.",
            "Also, how to evaluate the quality of your model?",
            "How to select one of your models among a family of models and what?",
            "What else have to combine different models to get a new one, which could be better?",
            "This is this is huge.",
            "I mean we we just do not include this these topics as specific points because it would take a whole year, but we try to transmit the message that this topics are extremely important in order to be successful.",
            "Well, this is one of the critics.",
            "While the criticisms that someone may make may say what you actually teach has nothing to do with what data mining is understood in business.",
            "Well.",
            "I have just collected 22 topics here.",
            "Do we need professional software to do data mining?",
            "There are some excellent and very expensive packages of software.",
            "Do you think we could do something else with this software?",
            "Packages that we cannot do with our self mate home programs?",
            "I think the answer is no.",
            "And this is important to be transmitted also to the students are more expensive or more sophisticated.",
            "Software is not necessarily better if you don't know how to use it, how to extract the most of it.",
            "Anyway.",
            "Anyway.",
            "I didn't know that this was moving when I just.",
            "Attach it well.",
            "We invite someone from the business from the industry supposedly working in data mining to have a talk in the middle of the semester.",
            "And this is nice because it's always a man.",
            "It's always a man that's definitely.",
            "But yes, I don't know why, but he comes with with full suit.",
            "And everything and and.",
            "All the only all the gotchas you expect from a businessman, so it's interesting for the students to see the contrast with me, for example.",
            "So and he talks about professional experiences and successes and we asked him to talk about failures and he did, and this was most interesting.",
            "Because in these failures they they lose money, so they never want to tell.",
            "I think this is good for the students because probably one of them or two content working with this kind of."
        ],
        [
            "Of people well, this seems now information for the students, but you may forgive me for this.",
            "I think it's interesting to know what we do.",
            "There is no example.",
            "There's no exam.",
            "Instead, there are three practical homeworks.",
            "The most important of which is 1/3 one which is intended to be a full data mining project.",
            "From the road data to a final decision, final model, which is supposed to explain the data and say something new.",
            "This third project involves an oral defense.",
            "With just takes from 10 to 15 minutes an an additional 5 minutes of questions that we, the teachers, can ask to the students.",
            "The students make a team of two or sometimes three so they can support each other.",
            "This is interesting because we let them say whatever they want.",
            "Even complaining about about the project itself.",
            "Like we hate this or we didn't like doing that or we experienced problems with this with this.",
            "So we get much information with these talks apart from.",
            "Obtaining an.",
            "And an evaluation and score.",
            "For this project we selected the R language which is public license version.",
            "So so of the S&S plus statistical software.",
            "The students don't like this language Becausw."
        ],
        [
            "The students replies becausw they say R is not a programming language because they try to program it like Lexie or like C++.",
            "Difficult to convince them that this is not what they should do.",
            "They also complained that their results were not as good as they expected, although they've been very clever.",
            "They also complain there's too much theory.",
            "This is not true.",
            "I think it's there's a bit more, but they don't allow me to put more.",
            "But then they they miss it because they have lacks of something.",
            "And finally, although all of them agree in that they have enjoyed doing it well, I don't know where to put it here as a subtext, but I think most of the times it's true because we allow them to say whatever they they feel about it."
        ],
        [
            "I.",
            "There's two teachers.",
            "White, two teachers well.",
            "There's one from the software Department, which is a computer scientist.",
            "In this case, it's me.",
            "And there's another one from the Statistics Department which is logically statistician.",
            "This is because the organization of the discourse having this way.",
            "So of course taken by by two different departments, but it ended up well because."
        ],
        [
            "I'm sorry this is helping cattle and health in English, but the first thing we do when we get the first day is to give them this equivalence table.",
            "When I called this the statistician call it's there and the other way around.",
            "This may seem a little bit confusing, but the students like it because they they realize that that one may come to the same place with different by different paths of with different formation, with different curricula, and this is good because the statistician is very bias statistics.",
            "He always likes to talk about means and variances and principal components.",
            "An tests and Gaussians and so on.",
            "And I prefer to talk about about examples where para meters learning and and all that.",
            "And we tried these things not to be mixed it up, but we check it one against the other.",
            "So this when we when we did this table we realized there is a mess of names because variable attribute register field transaction observation.",
            "There are so many words which are not exactly the same, but that usually means the same that the students get confused.",
            "Not to mention other other things.",
            "For example, what the statisticians called what I call classification statistician means clustering.",
            "I do not mean clustering.",
            "I mean supervisor classification, but he means unsupervised classification, so it's a little bit difficult, but it's nice for them I think."
        ],
        [
            "This is the favorite phase of the Mike my statistician colleague.",
            "The model must follow the data, not otherwise.",
            "And we tried.",
            "This is the kind of underlying texts in the line messages that we tried to give to the students continuously.",
            "Every five minutes or so.",
            "Also these.",
            "Successful data mining project has four components.",
            "Well maybe I should have right?",
            "It should have four components, because if it doesn't then go data clean goals second, this is it was new to me when I first thought of it.",
            "Good algorithms and human expertise.",
            "This is obvious when written it down, but for me it wasn't until until I did I think it's it's nice to to keep it in mind well."
        ],
        [
            "And I'm finishing.",
            "In conclusion, well, my conclusions, of course.",
            "My personal conclusions.",
            "The students like the course.",
            "I think this is true.",
            "It's an optional course.",
            "And they like, especially the practical work.",
            "No surprise here.",
            "They tend to work autonomously, really, they don't ask questions and they do things without asking questions, but not always for the good.",
            "So we have to ask them what?",
            "What are you doing?",
            "What have you been doing lately?",
            "I come up with this how?",
            "It's wrong, but how?",
            "But it's good, but how?",
            "In the end, even though they take the same data set, they never come out with same results.",
            "This this is one thing to think about because they diverge paths somewhere and they obtain different results.",
            "May be similar but never equal.",
            "Of course, one thing I've I've been learning teaching this is there is always much much room to improve on the teachers part, and that's what we try.",
            "Thank you.",
            "Questions."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Give you some ideas about how we teach data mining in the.",
                    "label": 1
                },
                {
                    "sent": "In the 5th, which is the computer science faculty?",
                    "label": 0
                },
                {
                    "sent": "Of this University located in in Barcelona.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm not going to bother you about the topic itself, but this is a definition of mine, so I wanted to give it to you.",
                    "label": 0
                },
                {
                    "sent": "Blah blah blah techniques, algorithms, machine learning, statistics.",
                    "label": 0
                },
                {
                    "sent": "For what for doing what in my humble opinion to make decisions based on weight?",
                    "label": 0
                },
                {
                    "sent": "Plus a lot of experience.",
                    "label": 0
                },
                {
                    "sent": "Plus a lot of common sense.",
                    "label": 0
                },
                {
                    "sent": "This is my definition of data mining and this is what we try to transfer to the students.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ask about Cather said.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of of disciplines, methodologies, algorithms, techniques, So what subset of these which we could label as data mining is taught actually at the fee.",
                    "label": 1
                },
                {
                    "sent": "We're in our in our core switches one semester course just four months.",
                    "label": 0
                },
                {
                    "sent": "This is the outline.",
                    "label": 0
                },
                {
                    "sent": "It covers some basic ground, but there are absolutely missing ones here.",
                    "label": 0
                },
                {
                    "sent": "As you may notice, but.",
                    "label": 0
                },
                {
                    "sent": "Well, neural networks and support vector machines should be present.",
                    "label": 0
                },
                {
                    "sent": "Nearest neighbors decision trees.",
                    "label": 0
                },
                {
                    "sent": "Classical regression Association rules is one of the appeals in data mining.",
                    "label": 0
                },
                {
                    "sent": "Well, this is what we thought.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Feature selection has been one of the topics in one of their talks.",
                    "label": 0
                },
                {
                    "sent": "It's not explicitly covered, but it's always present in the background.",
                    "label": 0
                },
                {
                    "sent": "We emphasize the extremely.",
                    "label": 0
                },
                {
                    "sent": "Importance of selecting adequate features and whynott trying to extract new ones.",
                    "label": 0
                },
                {
                    "sent": "Also, how to evaluate the quality of your model?",
                    "label": 0
                },
                {
                    "sent": "How to select one of your models among a family of models and what?",
                    "label": 0
                },
                {
                    "sent": "What else have to combine different models to get a new one, which could be better?",
                    "label": 0
                },
                {
                    "sent": "This is this is huge.",
                    "label": 0
                },
                {
                    "sent": "I mean we we just do not include this these topics as specific points because it would take a whole year, but we try to transmit the message that this topics are extremely important in order to be successful.",
                    "label": 0
                },
                {
                    "sent": "Well, this is one of the critics.",
                    "label": 0
                },
                {
                    "sent": "While the criticisms that someone may make may say what you actually teach has nothing to do with what data mining is understood in business.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "I have just collected 22 topics here.",
                    "label": 0
                },
                {
                    "sent": "Do we need professional software to do data mining?",
                    "label": 0
                },
                {
                    "sent": "There are some excellent and very expensive packages of software.",
                    "label": 0
                },
                {
                    "sent": "Do you think we could do something else with this software?",
                    "label": 0
                },
                {
                    "sent": "Packages that we cannot do with our self mate home programs?",
                    "label": 0
                },
                {
                    "sent": "I think the answer is no.",
                    "label": 0
                },
                {
                    "sent": "And this is important to be transmitted also to the students are more expensive or more sophisticated.",
                    "label": 0
                },
                {
                    "sent": "Software is not necessarily better if you don't know how to use it, how to extract the most of it.",
                    "label": 0
                },
                {
                    "sent": "Anyway.",
                    "label": 0
                },
                {
                    "sent": "Anyway.",
                    "label": 0
                },
                {
                    "sent": "I didn't know that this was moving when I just.",
                    "label": 0
                },
                {
                    "sent": "Attach it well.",
                    "label": 0
                },
                {
                    "sent": "We invite someone from the business from the industry supposedly working in data mining to have a talk in the middle of the semester.",
                    "label": 0
                },
                {
                    "sent": "And this is nice because it's always a man.",
                    "label": 0
                },
                {
                    "sent": "It's always a man that's definitely.",
                    "label": 0
                },
                {
                    "sent": "But yes, I don't know why, but he comes with with full suit.",
                    "label": 0
                },
                {
                    "sent": "And everything and and.",
                    "label": 0
                },
                {
                    "sent": "All the only all the gotchas you expect from a businessman, so it's interesting for the students to see the contrast with me, for example.",
                    "label": 0
                },
                {
                    "sent": "So and he talks about professional experiences and successes and we asked him to talk about failures and he did, and this was most interesting.",
                    "label": 0
                },
                {
                    "sent": "Because in these failures they they lose money, so they never want to tell.",
                    "label": 0
                },
                {
                    "sent": "I think this is good for the students because probably one of them or two content working with this kind of.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of people well, this seems now information for the students, but you may forgive me for this.",
                    "label": 0
                },
                {
                    "sent": "I think it's interesting to know what we do.",
                    "label": 0
                },
                {
                    "sent": "There is no example.",
                    "label": 0
                },
                {
                    "sent": "There's no exam.",
                    "label": 0
                },
                {
                    "sent": "Instead, there are three practical homeworks.",
                    "label": 0
                },
                {
                    "sent": "The most important of which is 1/3 one which is intended to be a full data mining project.",
                    "label": 0
                },
                {
                    "sent": "From the road data to a final decision, final model, which is supposed to explain the data and say something new.",
                    "label": 0
                },
                {
                    "sent": "This third project involves an oral defense.",
                    "label": 0
                },
                {
                    "sent": "With just takes from 10 to 15 minutes an an additional 5 minutes of questions that we, the teachers, can ask to the students.",
                    "label": 0
                },
                {
                    "sent": "The students make a team of two or sometimes three so they can support each other.",
                    "label": 0
                },
                {
                    "sent": "This is interesting because we let them say whatever they want.",
                    "label": 0
                },
                {
                    "sent": "Even complaining about about the project itself.",
                    "label": 0
                },
                {
                    "sent": "Like we hate this or we didn't like doing that or we experienced problems with this with this.",
                    "label": 0
                },
                {
                    "sent": "So we get much information with these talks apart from.",
                    "label": 0
                },
                {
                    "sent": "Obtaining an.",
                    "label": 0
                },
                {
                    "sent": "And an evaluation and score.",
                    "label": 0
                },
                {
                    "sent": "For this project we selected the R language which is public license version.",
                    "label": 0
                },
                {
                    "sent": "So so of the S&S plus statistical software.",
                    "label": 0
                },
                {
                    "sent": "The students don't like this language Becausw.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The students replies becausw they say R is not a programming language because they try to program it like Lexie or like C++.",
                    "label": 0
                },
                {
                    "sent": "Difficult to convince them that this is not what they should do.",
                    "label": 0
                },
                {
                    "sent": "They also complained that their results were not as good as they expected, although they've been very clever.",
                    "label": 0
                },
                {
                    "sent": "They also complain there's too much theory.",
                    "label": 0
                },
                {
                    "sent": "This is not true.",
                    "label": 0
                },
                {
                    "sent": "I think it's there's a bit more, but they don't allow me to put more.",
                    "label": 0
                },
                {
                    "sent": "But then they they miss it because they have lacks of something.",
                    "label": 0
                },
                {
                    "sent": "And finally, although all of them agree in that they have enjoyed doing it well, I don't know where to put it here as a subtext, but I think most of the times it's true because we allow them to say whatever they they feel about it.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "There's two teachers.",
                    "label": 0
                },
                {
                    "sent": "White, two teachers well.",
                    "label": 0
                },
                {
                    "sent": "There's one from the software Department, which is a computer scientist.",
                    "label": 1
                },
                {
                    "sent": "In this case, it's me.",
                    "label": 0
                },
                {
                    "sent": "And there's another one from the Statistics Department which is logically statistician.",
                    "label": 0
                },
                {
                    "sent": "This is because the organization of the discourse having this way.",
                    "label": 0
                },
                {
                    "sent": "So of course taken by by two different departments, but it ended up well because.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm sorry this is helping cattle and health in English, but the first thing we do when we get the first day is to give them this equivalence table.",
                    "label": 0
                },
                {
                    "sent": "When I called this the statistician call it's there and the other way around.",
                    "label": 0
                },
                {
                    "sent": "This may seem a little bit confusing, but the students like it because they they realize that that one may come to the same place with different by different paths of with different formation, with different curricula, and this is good because the statistician is very bias statistics.",
                    "label": 0
                },
                {
                    "sent": "He always likes to talk about means and variances and principal components.",
                    "label": 0
                },
                {
                    "sent": "An tests and Gaussians and so on.",
                    "label": 0
                },
                {
                    "sent": "And I prefer to talk about about examples where para meters learning and and all that.",
                    "label": 0
                },
                {
                    "sent": "And we tried these things not to be mixed it up, but we check it one against the other.",
                    "label": 0
                },
                {
                    "sent": "So this when we when we did this table we realized there is a mess of names because variable attribute register field transaction observation.",
                    "label": 0
                },
                {
                    "sent": "There are so many words which are not exactly the same, but that usually means the same that the students get confused.",
                    "label": 0
                },
                {
                    "sent": "Not to mention other other things.",
                    "label": 0
                },
                {
                    "sent": "For example, what the statisticians called what I call classification statistician means clustering.",
                    "label": 0
                },
                {
                    "sent": "I do not mean clustering.",
                    "label": 0
                },
                {
                    "sent": "I mean supervisor classification, but he means unsupervised classification, so it's a little bit difficult, but it's nice for them I think.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the favorite phase of the Mike my statistician colleague.",
                    "label": 0
                },
                {
                    "sent": "The model must follow the data, not otherwise.",
                    "label": 0
                },
                {
                    "sent": "And we tried.",
                    "label": 0
                },
                {
                    "sent": "This is the kind of underlying texts in the line messages that we tried to give to the students continuously.",
                    "label": 0
                },
                {
                    "sent": "Every five minutes or so.",
                    "label": 0
                },
                {
                    "sent": "Also these.",
                    "label": 0
                },
                {
                    "sent": "Successful data mining project has four components.",
                    "label": 1
                },
                {
                    "sent": "Well maybe I should have right?",
                    "label": 0
                },
                {
                    "sent": "It should have four components, because if it doesn't then go data clean goals second, this is it was new to me when I first thought of it.",
                    "label": 0
                },
                {
                    "sent": "Good algorithms and human expertise.",
                    "label": 0
                },
                {
                    "sent": "This is obvious when written it down, but for me it wasn't until until I did I think it's it's nice to to keep it in mind well.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I'm finishing.",
                    "label": 0
                },
                {
                    "sent": "In conclusion, well, my conclusions, of course.",
                    "label": 0
                },
                {
                    "sent": "My personal conclusions.",
                    "label": 0
                },
                {
                    "sent": "The students like the course.",
                    "label": 0
                },
                {
                    "sent": "I think this is true.",
                    "label": 0
                },
                {
                    "sent": "It's an optional course.",
                    "label": 0
                },
                {
                    "sent": "And they like, especially the practical work.",
                    "label": 0
                },
                {
                    "sent": "No surprise here.",
                    "label": 0
                },
                {
                    "sent": "They tend to work autonomously, really, they don't ask questions and they do things without asking questions, but not always for the good.",
                    "label": 0
                },
                {
                    "sent": "So we have to ask them what?",
                    "label": 0
                },
                {
                    "sent": "What are you doing?",
                    "label": 0
                },
                {
                    "sent": "What have you been doing lately?",
                    "label": 0
                },
                {
                    "sent": "I come up with this how?",
                    "label": 0
                },
                {
                    "sent": "It's wrong, but how?",
                    "label": 0
                },
                {
                    "sent": "But it's good, but how?",
                    "label": 0
                },
                {
                    "sent": "In the end, even though they take the same data set, they never come out with same results.",
                    "label": 0
                },
                {
                    "sent": "This this is one thing to think about because they diverge paths somewhere and they obtain different results.",
                    "label": 0
                },
                {
                    "sent": "May be similar but never equal.",
                    "label": 0
                },
                {
                    "sent": "Of course, one thing I've I've been learning teaching this is there is always much much room to improve on the teachers part, and that's what we try.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Questions.",
                    "label": 0
                }
            ]
        }
    }
}