{
    "id": "fqgtnmx5tvcdd7fg7l6u3tbbj3in4l5w",
    "title": "Creativity and radical breakthroughs in Science",
    "info": {
        "author": [
            "Rogers Hollingsworth, University of Wisconsin - Madison"
        ],
        "published": "Oct. 17, 2008",
        "recorded": "September 2008",
        "category": [
            "Top->Science"
        ]
    },
    "url": "http://videolectures.net/risc08_hollingsworth_crbs/",
    "segmentation": [
        [
            "Yeah.",
            "The plan we see I think it's really a great pleasure to meet, introduce today's speaker.",
            "Actually, in speaker that will have selectors in the future days.",
            "Professor Roger Hallieford, professor history at the University of Wisconsin.",
            "In the United States, and he's quite known in Slovenian academic world.",
            "Let me say something about his work so that we should see and understand he's actually park, which is actually inside his major question that is raising in his research work.",
            "Two major questions are raised from here.",
            "First one, why would particular institutional arrangements and specific types of organizations emerge?",
            "And the second, what consequences follow from these institutional and organizational arrangements?",
            "Now he works on complex research project which attempts to explain why this there is a variation across countries overtime and across research organizations in the rate at which major discoveries in biomedical science occur.",
            "He's also getting another rather complex cross national Historical Research Project, which attempts to explain why countries vary in their capacity to being innovative in science based industry.",
            "During the 20th century, this project brings together that are ethical perspectives of his previous work on institutional analysis, industrial sectors, major discoveries in biomedical science, and in the governance of capitalist economies.",
            "Together with Karen Miller, Roger wrote an article about transdisciplinary research for our program for the 21st century, which was the basis of this project.",
            "He's one of the founders of this program at the University of Louisiana, and now she's also chair of the Scientific Advisory Board.",
            "So we're very pleased that he can give us several lectures at University of Louisiana, and today is the first one.",
            "Undiagnosed creativity and radical breaks or breakthroughs in science resources deployed.",
            "Thank you.",
            "You're of course to be here in Louisiana.",
            "I think this is my fourth trip here and every time I've been here the people here have been extraordinarily gracious and hospitable.",
            "Jimmy and I had a very stimulating experience each time I'm here.",
            "It's true that at the University of Wisconsin I have been professor of history, but none of my colleagues think I'm a historian, Anne.",
            "Actually, at University of California San Diego, I have an appointment in the Department of Physics and also an affiliation within, you know, scientists Neurosciences Institute and it was constant.",
            "I'm also professor in sociology, so when people ask me what is your field, I frequently say I don't know.",
            "But I do try to look at things across disciplines.",
            "An IAM historian in that I really am interested in looking at problems overtime and how changes in variables influence change overtime now.",
            "Last year we began to actually two years ago when I first 2 1/2 years ago when I first came to lubiano, we began to think about a new kind of research project, actually.",
            "For the world.",
            "That's a study of raree bands with big social consequences and rare events are indeed rare, but they really do have large social consequences.",
            "Earthquakes, hurricanes, nuclear accidents, large terrorist attacks to mention a few, but also major advances in technologies and to some extent in science and without fundamental advances in science we.",
            "Would not have a good many of our fundamental advances in technology.",
            "If you just think I think sometimes on a day to day basis, we really don't realize the extent to which we have been living in a moment in history in which there are large numbers of rare technological innovations.",
            "We take the laptop for granted the cell phone for granted and the like.",
            "But if you think actually 20 years ago there were no cell phones, we make sure the clothing we wear was.",
            "These are synthetic materials that they were created in part by fundamental basic science and the like.",
            "Now in the last four to five years we've been living in a moment of great financial exuberance and the financial markets have been rising.",
            "Housing prices have been rising globally.",
            "And we've had relatively low interest rates globally, and this is also a kind of rare event.",
            "We had something similar in the 1920s with this kind of.",
            "Real exuberance globally and then you have another kind of rare event, and that is the collapse of financial markets and the collapse of financial markets or another kind of rare event.",
            "And they really do have worldwide and global consequences and many others fear that one is now happening in the global financial markets are likely to have worldwide implications for many of us across countries.",
            "For some years to come, that remains to be seen, but these are of course rare events.",
            "Now I have been studying rare events for some time.",
            "I want to talk to you today about a particular class of rare events.",
            "It's maybe one that you don't really think so much about rare events, but it is what I call major discoveries in science.",
            "And in this case an basic biomedical science.",
            "And many of these are major discoveries do along the way have fundamental impacts on medical technology, clinical practice and like and some of them are yet to be realized."
        ],
        [
            "So can you see this one?",
            "This is when there's least readable, and this study in which I have been involved in is a multi level analysis which raises a number of methodological questions we have.",
            "The larger institutional environment in which scientists and universities work, and then you have research within a country that is.",
            "These institutional environments.",
            "Then we have the often universities or Research Institute.",
            "Department's an laboratories and finally, individual Sciences and all of these things are interacting together, and as result of these interactions we occasionally have a major discovery, but we aren't living in a world and I'll talk at another.",
            "Another talked in this lecture series because actually we do live in a world that is really very nested, whether we think of our economies or our political systems where we have local politics, the national politics, the European Union or Trans, National regional politics and funding, the global level, and so we're living in a moment in history in which we really do have these.",
            "Multi level effects and one of the great challenges for us.",
            "It seems to me is to try to understand the way all these different levels are interacting and I'm going to talk to you about just one small part of this multi level activity going on in science Now.",
            "So as I say, I'm studying major discoveries and basic biomedical science."
        ],
        [
            "And so forget my topic.",
            "What I'm talking about for a moment and just reflect and ask yourself.",
            "Well if you were going to design a study.",
            "How would you define a major breakthrough?",
            "And if you define a major breakthrough, how would you operationalize it?",
            "Because no matter how honest you tend to be, or trying to be in defining major breakthroughs when anyone else agree with you, when you identify a major breakthrough now actually I spent about a year and a half thinking about this problem, because I will need to be able to define major breakthroughs.",
            "So in the scientific community an others at least who would read my work and might be critical of it.",
            "We could all agree on what a major breakthrough is.",
            "So I remember that I was beginning this project and I was at a Research Institute.",
            "I think for a year.",
            "But anyway, many months and I was in Sweden and each year about this time or in early October, what I called the Nobel business.",
            "He shot and the Nobel Prizes are awarded by the Royal Swedish Academy of Sciences in Stockholm as well as the Karolinska Institute.",
            "An I was fortunate in this Institute that I had lunch several times a week with a scholar and Swedish scholar who is a member of the Royal Swedish Academy of Sciences and they were deciding who would win Nobel Prizes.",
            "Now he was not, of course, at Liberty to tell me what was going on, but I was.",
            "We had a lot of discussions about how they decide what a major who would get these Nobel Prizes.",
            "So what I have done I've come up with is somewhat abstract and.",
            "Very abstract in definition of a major discovery, but one of the keywords here is diverse.",
            "In our research we have studied approximately 325 major discoveries throughout the 20th century in four countries, Britain, France, Germany and United States, and everyone of these 325 major discoveries reflect a great deal of cyantific diversity.",
            "That is, the people who made made the major breakthroughs.",
            "Well, first of all, they are recognized people in many different fields of science, but the site is doing them themselves internalize a great deal of scientific diversity.",
            "And so this is one of the key words.",
            "Now.",
            "Then, once we have this definition of a major discovery, how would you know one if someone or read about it?",
            "So this is again what I came up with in Sweden."
        ],
        [
            "And the Swedes were extraordinarily cooperative an the they were the first to fund my project and I do appreciate their generosity.",
            "One of the Swedish Research Council's now.",
            "So we we we when I say we because I've had a number of assistance an my wife has worked with me and but then enormously helpful.",
            "But also my most severe critic, and so this is the way we operationalize the subject of a major breakthrough.",
            "First, when the running Society of London, very prestigious organization, awards prizes each year, and some of them are in basic biomedical science.",
            "So since 1901, and now we're probably covers the period 1901 throughout the 20th century.",
            "Whenever a scientist doing work in the basic biomedical Sciences received a coping metal, we include that one, and then there are these two kinds of Nobel Prizes and Nobel Prize in Physiology or Medicine that's awarded annually an by the Karolinska Institute and we will see in the next few weeks who received the Nobel Prize in Physiology or Medicine, and then we have the Royal Swedish Academy of Sciences and the.",
            "Award prizes in a variety of fields in physics and chemistry and economics and the like, but insofar as there has been a Nobel Prize in chemistry with high relevance in basic biomedical science, we've included these for the most part, these have been in biochemistry, but not exclusively.",
            "Then we've spent a great deal of time studying the archives of both the Royal Swedish Academy an the Carolines Institute, and.",
            "However, those are kinds are not open for reasons of confidentiality over in the last 50 years, which is good for us because the number of people permitted to make nominations has increased dramatically in more recent years, so it was manageable for us to go back and study the archives in these earlier years, and so whenever there was a nomination for these two are kinds of prizes and a single body of research receive.",
            "Our ten nominations and each of three years we include in that, and then each year at both the Karolinska in the Royal Swedish Academy.",
            "They have a committee, and each one of these two who study all of these nominations, and after studying them, and sometimes they studied them for 3, four, or five years and and they end up with a list of things called prize worthy, and from that prize worthy list they end up.",
            "Making making a choice for a Nobel Prize, but so we gave these committees some legitimacy and credibility.",
            "And so whenever through our study of the archives, a body of work was listed as prize worthy.",
            "We've included that now, as I said, the Nobel archives have been closed for the last 50 years and we didn't want this project to be just about Nobel Prizes.",
            "So we have several other major international prizes and they are the Lasker Prize and Basic actually basic biomedical science, Louisa Gross Horwitz Prize, an the Crayford Prize, which happens to be also awarded by the Forest Ridge Academy of Sciences.",
            "Now what we have done, we have taken these three."
        ],
        [
            "In 25 major discoveries and that was relatively easy, but this has been an extraordinarily labor intensive project.",
            "Once we have these major discoveries, then the question is what is the institutional and organizational environment in which they occur?",
            "What was the structure of the organizations?",
            "What were the laboratories about an overall?",
            "We have studied approximately 750 research organizations in these four countries.",
            "Britain, France, Germany and the United States throughout the 20th century there have been approximately 2000 labs that we have studied an we've conducted approximately 500 in.",
            "In depth interviews with scientists.",
            "A good many of them have received Nobel Prizes.",
            "Obviously a few of these, some of some of the recipients and other prizes were deceased and died before we got into this project.",
            "We've also worked with archives about the labs and many of these scientists, unlike so, it's been a very labor intensive project to study the the institutional organization and the department's and labs where where this research occurred and when could say will only imagine me do all this labor intensive work and again.",
            "I've had a good bit of assistance in this match, but this is only another part of the problem because.",
            "What about those scientists who who don't receive major discoveries?",
            "Are they working in different kinds of organizations?",
            "Are they working in different labs?",
            "So what we have done in these four countries, we have drone samples of what we know to be distinguished.",
            "Scientist, that is, they were.",
            "They might be members of the National Academy of Sciences in United States or members of the Royal Society in Great Britain, and we have grown samples of those scientists.",
            "Who were distinguished scientist but never received on this kind of recognition, and we've studied a good many.",
            "We've studied those labs and those organizations to see.",
            "Are there substantial differences.",
            "This is not been a statistical analysis for complex reasons, but we have attempted to find out here.",
            "Are there substantial differences?",
            "An indeed they have been, and I hope through in this lecture I can begin to.",
            "Talking about that now, the kinds of organizations an organizational environments in which these major discoveries occur.",
            "Let me say again when I'm talking bout rare events in science I guess and forgive me, I should have said this at the outset.",
            "We cannot predict where an when a major discovery such as we are talking about here.",
            "We ran when one will injure.",
            "I think what we can do is to what we're trying to do is to understand the.",
            "Circumstances under which they do occur, and I think we can pretty well tell you the circumstances under which they are very likely unlikely.",
            "It is very unlikely to occur, so the kinds of environments in which these major discoveries tend to occur is if you remember a these major discoveries reflect a good bit of scientific diversity, and so they take place in organizations in which there is a moderately high degree of scientific diversity.",
            "Now what does that mean?",
            "For example, if you look at Germany, they have a large number of Max Planck Institutes and these are extremely high quality institutes, and some of Germany's leading scientists are directores there.",
            "But if you look at those Max Planck institutes, there's a Max Planck Institute for Genetics and Max Planck Institute for Biochemistry mods.",
            "Plank Institute for Neuroscience and the like.",
            "And while they do extraordinarily good science, they there.",
            "They're very narrow in their research program, so they do not have a relative behind degree of scientific diversity.",
            "An and these prizes if you will, or these recognitions are.",
            "Reflect recognition by a diverse body of the scientific community across fields, so it's not that small institutes don't get this kind of recognition as we'll see in a few minutes, but I certain amount of of.",
            "Scientific diversity in the organization as well as the individual scientist is necessary then.",
            "The organization has the capacity to we recruit scientists, then, who internalize a fair amount of scientific diversity.",
            "This next one is quite important.",
            "This is not just important to have scientists in an organization or a setting in which there is this scientific University working in different fields, but it's absolutely necessary that there is a high degree of communication and integration among scientists in different fields.",
            "Through frequent and intense interaction, I will discuss a few of these organizations in few minutes and you'll see that there is no single pathway or single prescription for how this interaction takes place.",
            "But it is pretty common and they have little leaders.",
            "Two points there may be leaders of a single organization that is a relatively small Institute, or there may be leaders ahead of a lab with four five, 1015, sometimes 20 leaders who.",
            "Nevertheless these labs or the organization has a fair amount of scientific diversity, but the leaders are able to integrate this scientific University.",
            "The leaders are individuals who have a.",
            "High capacity to understand the direction in which scientific research is moving an.",
            "When I use this term nurturing environment, what does that mean?",
            "I remember one of the first talks I I gave on this topic.",
            "I was speaking to an audience in Germany.",
            "Now, in my judgment, and I've spent a good bit of time over the years in Germany.",
            "There is a fair amount of authoritarian, in contrast to say.",
            "States in the labs.",
            "And like they're very strong leaders and like an they're not what I call a very nurturing.",
            "I don't mean by nurturing, having low standards, but in these nurturing environments we do have leaders who who interact particularly with younger people provide really rigorous criticism, but provided in a somewhat nurturing and helpful way.",
            "And finally, these organizations have a high degree of flexibility.",
            "That is, science is changing.",
            "Rapidly all the time.",
            "These are organizations that have the capacity to adapt to new trends in science, and they have a high degree of autonomy to do what they think they should do.",
            "Then of course, we have organizations.",
            "What kind of characteristics hamper the making?",
            "A major discoveries well here."
        ],
        [
            "Organizations that are really highly differentiated.",
            "They have large numbers of departments, people in many, many specialties, and the right there's someone hierarchical and like, but they have very little communication across fields and that kind of social integration interaction across fields is apparent that they do have diversity, but there's a high so much diversity.",
            "That it's very difficult to have effective communication among actors in different fields of science now.",
            "So then.",
            "We have"
        ],
        [
            "These what I call institutional environments.",
            "Let's just take these four countries.",
            "Britain, France, Germany and the United States throughout the 20th century.",
            "Now Britain and USI have coded in my research as being relatively weak institutional environments.",
            "What does that mean?",
            "Well, remember, I suggested that the institution environment pretty much is focusing at the national level in which science is concerned, and whereas in France, for example, there is a high degree of centralization, largely focused in Paris.",
            "Over the appointment of personnel.",
            "Not in these organizations.",
            "These organizations with weak institutional environments or one in which there are likely to be a multiplicity of major breakthroughs.",
            "But those with.",
            "They also have weak control over scientific disciplines.",
            "For example in Germany.",
            "Um?",
            "As you probably know, in order to become a professor, it historically it was very common to that a person have completed the ability to see Onan.",
            "There is kind of general standards of fields is not easy for these fields to change very quickly, but in the US, for example, the University has high autonomy to decide whether there will be a new discipline.",
            "Or not so often in the US, and to some extent in Great Britain, you see large numbers of scientific disciplines and new ones emerging.",
            "There is relatively weak control over funding, though that is increasing, say in the US and to some extent in Britain, partly because of the size of the US, partly because it is amazing diversity.",
            "There are literally thousands of private.",
            "Foundations, so while we do have a great deal of funding and I'll come back of an increasing percentage of funding for research coming from the national government in US.",
            "Nevertheless, overtime it's been much easier in the US for scientist to knock on one door and another door door until someday someone is found who will support one's research there.",
            "So there's been relatively weak control of our funding, and.",
            "An the lack of a say huh?",
            "Billy Taxi on and like another thing only this sort of adds up to the fact that when scientists have a high degree of autonomy, there is much more around possibility for people to engage in high risk research.",
            "An as we will see at the tored, the end of the talk this.",
            "Ability to engage in high risk research I think has been very important.",
            "When we look at these people who have made these major breakthroughs in basic biomedical science."
        ],
        [
            "Then strong institutional environments are pretty much at the opposite end of the continuum.",
            "Highly centralized control over personnel are much stronger.",
            "What would constitute an appropriate discipline and much more centralized control or funding.",
            "When prescribing what this comes back to, this ability to see on and like much more on discouraging.",
            "I'm really high risk research now.",
            "I do want to come back and just jump ahead as we have more and more larger and larger percentage of funding in US coming from the central government you do have.",
            "A.",
            "It makes it increasingly difficult for scientist to engage in really high risk if you will crazy research.",
            "For example, there was a time in 1920s when Niels Bohr, one of the world's great physicists, attended a AA meeting.",
            "Ann Goodman, which was one of the great centers of physics in the 1920s, and Niels Bohr, of course, with one of the world's great physicists in the 20s.",
            "And there was a young man by the name of Wolfgang Pauli, who would later win a Nobel Prize in Physics, and Polly gave a talk.",
            "Anbur stood back and said, yeah, this is pretty good, but I'm not sure that it's good enough to be really crazy and what board meant was, you know, it's really important that a young scientist be willing to take high risk and he wasn't certain that Paul's work was really.",
            "Crazy enough."
        ],
        [
            "Two OK, so here is in crude way kind of summary of a good bit.",
            "What I've been saying so.",
            "These major breakthroughs tend to occur environments in which there is a model.",
            "Degree of scientific diversity, but also in organizational settings in which there is increasing high communication.",
            "An social integration an as you get up to a certain limit, a certain amount of scientific diversity.",
            "An increasing level of communication across these different fields.",
            "These major breakthroughs are more likely to occur.",
            "They are least likely to occur as you have more, an more diversity.",
            "If you remember I was talking bout hyper diversity and as you have less and less communication across different fields of science, so in one sense this is the kind of crude cartoon of a good bit of our findings."
        ],
        [
            "No.",
            "Scientific disciplines are always changing, and it's sort of interesting.",
            "The World of Science today has become extremely competitive.",
            "Just to make a comment.",
            "And I study a lot of scientists who are after what I call big game.",
            "I mean, they really are extraordinary in competitive Anna's fields of science becomes more and more advanced and more and more competitive.",
            "Scientists are increasingly reluctant to share their results.",
            "This is in the not in all fields, but in the basic biomedical scientist to large extent in many fields and natural scientists.",
            "That is, those who are really after the big game and.",
            "I'm calling about this Nobel business and the major rewards.",
            "And like once a scientific field, begins to mature.",
            "Scientists are not so willing to cooperate one another.",
            "There's a high degree of secrecy, an even in applying for research grants, or even in publishing papers.",
            "Scientists are often reluctant to share too much of what they're doing because they don't want their competitors to get the latest information, and so, but on the other hand, they have to share enough information, say through the funding agencies.",
            "Or they won't be there.",
            "They research funding, but they know their competitors are among going to be among those who are reviewing their projects.",
            "And I know their competitors are going to be reading their articles, but on the other hand, they also know that if a competitor say wins the Nobel Prize or something, they want to demonstrate well.",
            "I was already pretty much there, so it's important that even though there is this high degree of competitiveness that people, to some extent are revealing where they are in this so called game.",
            "But it's sort of interesting in the early fields.",
            "Early stages of a new field.",
            "It's really quite remarkable, and as you study the social interaction among scientists in the early stages of a new field, it's really quite remarkable how much cooperation and sharing and communication among people are.",
            "It's like low hanging fruit.",
            "I won't say it's easy, but at least with low hanging fruit it's not as difficult.",
            "Or in you discover a new goldmine early on.",
            "It's not that difficult to exploit some of the resources, but as you dig further and further, it becomes increasingly difficult to get the big reward.",
            "So and so scientific disciplines rise and fall.",
            "An in the early stages of a new field there is a high degree of sharing and cooperation, but as the field matures.",
            "The fields become much more competitive.",
            "There is less communication and sharing that is less.",
            "Sharing among potential competitors and then finally a field shorter dies out now.",
            "So for an organization that wants to make major discoveries, time and time again well.",
            "Then the organization has to be able to."
        ],
        [
            "To move in to adapt and be prepared to move in another field an overtime and yet another field.",
            "So because academic or scientific fuels are rising and declining, an rising and declining and the like and you will see that in a few minutes that among those few organizations that have had these major discoveries, time and time again.",
            "Part of it is that they had been able to move into different fields.",
            "They have been really innovators at the fundamental frontiers of science.",
            "Let me.",
            "Elaborate a little on some of these so let me talk to you briefly about some organizations that have had multiple breakthroughs.",
            "Ann measure fields of science.",
            "And as I say, these are really rare events and.",
            "Over these four countries and across the 20th century, now I used to as I will ask this question and that is what organization do you think worldwide?",
            "Made more major breakthroughs in basic biomedical science over the last 20 century and I used to tell my audience.",
            "If you can name that organization I will host you to a dinner of your choice anywhere in the world.",
            "Never logs that big, but now I've published a fair amount and they don't make it anymore because some people there are number of people who know the answer, but it's sort of interesting.",
            "The one organization that's had more major breakthroughs as I define major breakthroughs than any other in the world in the 20th century is a small organization in the United States, and most Americans have never heard of it.",
            "This is Rockefeller University.",
            "Rockefeller University is a relatively small organization.",
            "It has no departments, no departments.",
            "It has 70 laboratories, and they all report to a single president.",
            "Now, if you remember.",
            "A few minutes ago.",
            "When?",
            "It is I talked for a few minutes."
        ],
        [
            "On a few of these organizations, keep this slide in mind so the Rockefeller is relatively small, but unlike these Max Planck Institutes and was talking about, they do have a moderate and high degree of scientific diversity, an historically they have had a.",
            "The scientist they recruited invariably are scientists who internalize a great deal of scientific diversity.",
            "There's a kind of self selection that takes place in the world of science.",
            "I'm for many years I have spent my career at the University of Wisconsin.",
            "This is this is a huge Amber City.",
            "Is largest University here in new Byana, but it's a huge University with large numbers of academic departments and.",
            "The scientist in them are quite good, but they are highly specialized.",
            "Now.",
            "What happens is just take the field in neuroscience, for example, University, Wisconsin.",
            "Madison has approximately 250 scientists who worked in neuroscience.",
            "An many of them are quite good.",
            "But then there is a relatively small organization in La Jolla, CA.",
            "The Salk Institute they have over the years had maybe 10 scientists working in neuroscience, but but in the late 80s, if you looked at citation indices, the Salk Institute was right at the top among organizations in the world and in citation counts in Neuroscience, University of Wisconsin with many more.",
            "The scientist in your science doing pretty well publishing a lot, was ranked very low in citation count.",
            "Why?",
            "How do you account for that?",
            "Well, the fact is that sunk Institute is a small organization and the people interact a great deal.",
            "And the kinds of papers they published are in journals in which people in all kinds of fields.",
            "We'd maybe the British general nature, or the American general science.",
            "But generals that are read by people in many fields, whereas in many of these big universities which are quite good, they published in much more highly specialized journals.",
            "They're not read.",
            "The papers are not read very much by people outside the highly specialized journals.",
            "So then in place like the Rockefeller, these individual scientists do internalize a good bit of diversity, and they do have a high degree of communication.",
            "An interaction among them.",
            "Let me just give you one story.",
            "That sort of tells you a lot about the culture of Rockefeller University.",
            "It's a small place and some many years ago they had a.",
            "What they call a Journal club, but it was the German club met in the evening and they had a fairly good dinner and nothing elaborate in this.",
            "Club and remember that a good many a number of these people were Nobel laureate, so some of the world's most distinguished scientists, and so.",
            "At this Journal Club they would always have two or three presentations by one of the members of the faculty, and these were the norms.",
            "The person who presided.",
            "I would call on two or three of these signs to make a presentation, but no one ever knew in advance who was going to be called upon.",
            "Even the people who were making the presentation.",
            "They didn't know whether they would be called upon an yet.",
            "Here they are in the presence of these really world class scientist.",
            "The second point was one always had to be prepared to give a presentation.",
            "Outside 1 field of working, it's an on a relatively on a recently developing project and so forth.",
            "Now why would people at Rockefeller do this?",
            "Partly because they were.",
            "They knew they were pretty good and they knew that one of the reasons they were pretty good was their capacity to read journals across many fuels and to communicate with their colleagues that there was often a lot of rivalry.",
            "And it's not that these people remember.",
            "You know, living friends of each other, but but there was a high degree of communication.",
            "This kind of interaction and also at the lunch table.",
            "It's really quite remarkable that some of these very small places that perform extraordinarily well.",
            "It's.",
            "It's sort of amazing that is eating together, but usually around tables that serve only 6 to 8 people so that you can have people in diverse fields, but you can have a single conversation at these, and often in some of these organizations at the Rockefeller at another which.",
            "Touch on is the discount tag and Californians to technology in Pasadena, CA.",
            "There's another one of these organizations that has made major registers time and time again.",
            "Again, the lunch table has been very important.",
            "We're often newfields have emerged over the lunch table.",
            "People carrying on informal conversations or another place in Europe.",
            "We are in the 1980s.",
            "Three of these major discoveries of curd and remember that there are hundreds of thousands of scientists in the basic biomedical Sciences across the world.",
            "But in the 1980s there was a small Institute in Basel, Switzerland.",
            "It never had more than 30 scientists, no longer operating, but it never had more than 30 scientists.",
            "But on three separate occasions.",
            "In the 1980s, there were three Nobel Prizes awarded.",
            "Now this was a relatively small organization.",
            "I spent a few known some time there and it was designed like a submarine.",
            "You could see down the corridor in almost every lab.",
            "What was going on, and they had three floors.",
            "So like respect like you're in the submarine and you could walk down and see what's going up above and they too had a common lunchroom.",
            "Nothing elaborate, an quite surprisingly they put on theatrical performances on the weekend, so there is no single formula how you have this kind of social interaction.",
            "But in my judgment, that was very important as to why they had.",
            "These major breakthrough now so far, and as I said, there's Caltech.",
            "California Institute of Technology in Pasadena.",
            "Contact has only about 1200 students.",
            "It's an extraordinary, high quality organization.",
            "But with that kind of smaller size, they're able to interact and so forth.",
            "But it doesn't happen.",
            "These kinds of things only in small research organizations.",
            "Let me speak now.",
            "I'm briefly about two other very large organizations.",
            "One is the University of California in San Francisco and by most standards today University of California, San Francisco is certainly considered among the top two organizations in the basic biomedical Sciences, and it may well be in the top two or three worldwide.",
            "It's very distinguished, but if you go back to 1960 University of California, San Francisco were so bad, hardly anyone would go there.",
            "Now the point I'm trying to make sure we have a number of cases where there were really not second or third rate, but even fifth rate organizations that really made a fundamental transformation.",
            "Now you see SF for the emergency in California.",
            "San Francisco is, by and large the large biological.",
            "Medical Center and so they had a lot of clinical signs there.",
            "People in medicine and surgery and light, but they had to high standards and they were really appalled by the very low standards and that existed in the basic Sciences.",
            "So they decided.",
            "OK, let's try to improve the quality in the basic scientist, scientist.",
            "And so they went for they tried to get a new chair in biochemistry.",
            "Now they offered the head or chair of Biochemistry, 210 separate scientist.",
            "They had really high taste and they offered this position to quite distinguished and everyone turned it down.",
            "They didn't think the place was good enough.",
            "The man who finally accepted this position was a scientist by the name of Bill Rutter Rutter and returned it down.",
            "And then they offered it to him again and turn it down the second time.",
            "And writer tells me that finally he and his wife thought it over and they were at the University of Washington, Seattle and they said, well, let's go down to San Francisco and give this a try.",
            "So they go down to San Francisco and writer is to be the new head of biochemistry.",
            "The first thing he did was to bring in one of the people who had already turned down the directorship or head of this Department.",
            "And this was a man by the name of Gordon Tompkins at the National Institutes of Health.",
            "Bill Reiter, in his career, he had been trained in PhD, an organic chemistry.",
            "He did a postdoc at the Mercer, WI in Samala G, and then went to University of Washington, Seattle and began to learn Human Genetics.",
            "So here's a scientist who internalizes a good bit of scientific diversity when he brings it in Gordon's Tompkins.",
            "Tompkins is one of the world's leading biochemist, and so the two of them together.",
            "They they internalize a good bit of scientific diversity, and they believe all the world is full of pretty good scientists.",
            "But if we're going to have a first rate Department, we have to recruit people, not only who internalize scientific diversity, but who can really work together and get along, and so they didn't think it was enough just to look at people's papers.",
            "An letters of recommendation lead believe that for people really to get along and work together.",
            "In the line of personal attributes and so, runner and Tompkins.",
            "Whenever they recruiting a more advanced scientists they would go and spend 3 days at the Scientist Institute because they wanted to see how do they interact with their colleagues with their students, their postdocs and like now the looking ahead jumping ahead of the story within 12 years that Department had become the Premier Department in biochemistry in the world but not.",
            "Only did it become Premier in biochemistry.",
            "Another thing the first one of the first things they did was to change the name of biochemistry to the Department of Biochemistry and Biophysics, and then presume they added a section in genetics.",
            "But what finally happened at the University of California, San Francisco?",
            "They abolished oh, basic Biological Sciences, and they became integrated, and so pretty soon.",
            "They were so good that all the teaching faculty wanted to sit one of the problems began with all the teaching faculty wanted to sit in each other's lectures, and pretty soon they were having the schedule lectures at night to accommodate everyone's schedule and so, for all practical purposes, we now have in a large, relatively large University a good bit of scientific diversity.",
            "An interesting enough this place that had not been very good.",
            "In the early 60s, pretty soon was beginning to have a number of Nobel Prizes.",
            "The later the president of the National Academy of Sciences in United States with a professor there and it really got done trying this form.",
            "Now in my own University University, Wisconsin.",
            "As I've already told you, this is a big University fragmented into different sizes, but one of the things the University Wisconsin did.",
            "They created 2 research institutes at the University of Wisconsin.",
            "Now all universities have research institutes and most research institutes people are a member of an Institute, but they also at least in in many universities.",
            "The people not only are a member of the Institute, but their primary appointment is in a disciplinary based Department and the major rewards come through department's, that is, promotions, salaries.",
            "It's not like here in Slovenia.",
            "There's a kind of market mentality or practice that goes on and everyone's salary is different and so forth.",
            "So the rewards really flow through Department.",
            "But what Wisconsin did was create these two institutes and the people in them did not have appointments in departments, and these institutes were highly disciplinary and each of these.",
            "Institute had not necessarily a very distinguished scientist, but leaders heads on them who could integrate scientific diversity.",
            "Each of these institutes with relatively small.",
            "They had a capacity to understand the direction in which science is moving and they were able to provide a kind of nurturing environment.",
            "Well, actually it's sort of interesting that in this huge University and University, which constant 2 Nobel Prizes came out of that Institute, one was in the.",
            "One Institute with the McArdle Cancer Institute and the other was the Institute for Entomology, just too.",
            "More about the one organization.",
            "The McConnell Institute for Cancer Research, a scientist by the name of Howard, Tim and TMIN, Tim, and was awarded the Nobel Prize around 1970.",
            "Four 75 Tim and went to Wisconsin as a young scientist from Caltech.",
            "An he was appointed in the McArdle Institute and Tim was one of these people who was willing to take high risk and the director of the Institute as I said, was not a great scientist, but he had a sense of direction in which science was moving.",
            "He was able to recruit young talent and nurture it in the light and everybody for some years thought Tim was a bit crazy.",
            "I was wondering these young scientist who was willing to take high risk.",
            "We have what's called academic tenure in the United States and after about six years.",
            "University is either award you tenure or they don't, and if they don't, you have to leave now.",
            "I've often thought in Timmins case that had Tim and been in one of the leading biology departments in their states, whether it was at Harvard, wherever he probably would not have been given academic tenure because people just Tim and was.",
            "Doing good research, and indeed there was a major conference at the National Institutes of Health.",
            "Before Kim and was awarded the Nobel Prize and an A presentation was made that was related to Timmins Research and the presenter.",
            "At the end, somebody said, well, you didn't mention Howard Timmons work at Wisconsin and the presenter said I gave it is not much attention as it deserves.",
            "In other words, it didn't deserve any intention.",
            "Timlin, however, published a couple of very pathbreaking papers in 1970 and within four years he was awarded the Nobel Prize.",
            "Now this is an example of what can happen in a very large research University in which you have a small Institute with a the right kind of leadership and you have this scientific diversity and someone who will have the capacity to nurture.",
            "An Tillman was protected if you will by this director at the McArdle.",
            "Well.",
            "Let me move along quickly."
        ],
        [
            "What are the things I want to make in in my concluding comments are not very encouraging.",
            "Their disturbing to me they ought to be disturbing in one sense to the world of science.",
            "If we look globally over some years what we've had in virtually all fields are certainly in all fields of the natural Sciences.",
            "We for seven years had.",
            "Countries spending an increased percentage of their gross national product for research and development.",
            "We had more and more people going into science.",
            "Obviously, there's an upper limit to how many people can go into the field of science, because if this were increasing exponentially, eventually everyone would be a scientist.",
            "Is another amendment as to how many people can go into science?",
            "So we've had over the last 3540 years.",
            "Is increasing on a trend and that is some what level of some countries spend a bit more of a percent of their GNP and then others.",
            "But there's not a high degree of variability among the highly industrialized countries, but the thing that is really very interesting is that.",
            "The number of scientific journals has been growing almost exponentially, and the number of scientific papers published annually has been growing enormously.",
            "The organization called ISI tracks the citation indices.",
            "Sid are the leading 5000 maybe 5200 academic scientific journals in the world, but there are approximately 100,000.",
            "Academic scientific journals in the world at large an of those that are tracked by ISI.",
            "Approximately 50% practically 50% of all the papers published in this more elite set of population of better generals are never cited.",
            "I'm sorry, never cited or cited, only once, so this is interesting.",
            "That and yet at the same time the world is producing more and more scientists.",
            "If you look, say, at the United States, or whether it's Germany or Britain or what have you, and I suspect it's similar here in Slovenia.",
            "In the career of a more senior professor, one is likely over the years to have trained at least 15 or 20.",
            "Scientists so we are turning out if you will.",
            "More and more scientists across the globe, and as you have more and more scientists across the globe, they're producing more and more papers which encourages the world of science to have more and more academic journals and the light and then one of the things that begins to happen.",
            "Is that there is increasing competition for funds and this we're finding all over the world, so this is not a good time to be a young scientist competing."
        ],
        [
            "For research grants, an universities are competing for more and more research grants.",
            "It becomes increasingly difficult.",
            "It becomes very, very competitive.",
            "An if in some countries in which its individuals who are applying for research is not only difficult for them, but as we begin to have more and more scientists, even senior scientist who are applying for grants, it becomes increasingly difficult to be funded.",
            "For example, in one of my interviews.",
            "And was with a quite a distinguished scientist at Harvard University, a man by the name of Walter Gilbert.",
            "Now Gilbert was awarded the Nobel Prize in chemistry seven years ago, and Gilbert is a kind of fantastic man.",
            "He was trained in mathematics at Harvard as an undergraduate.",
            "Then he went to the University of Cambridge and received a PhD, and he crossed his fields.",
            "He went to Cambridge in England, University of Cambridge in England.",
            "He received a PhD in physics.",
            "He returns to Harvard and begins a young man to to be in the chemistry Department at Harvard so you can see he's changing fuels and like and then he decides on, you know, I don't really like chemistry and physics, so we moved into biology and we could never have done that in the German scene where there is the ability types young here is Gilbert and into the American environment where there is this relatively weak institutional environment and so Gilbert.",
            "Moves into biology an he will later be awarded the Nobel Prize, but the point I'm about to make is that Gilbert tells me that Indian manage states that at least 50 percent, 50% of the time when he submits a research grant, he's turned down.",
            "Now this is really quite interesting because from my perspective, everything that Gilbert has ever touched in science turns to gold.",
            "And yet.",
            "He always does high risk research, but when he applies to these granting agencies in which there are so-called specialists reviewing the grant proposals.",
            "His research or his proposals are viewed as well because you have so many people who are competent and so many people doing research is not so high risk and it's easier to make some judgments about watch like it happen.",
            "But here is one of the world's most creative and distinguished scientist.",
            "But in America we need applies to the National Institutes of Health or National Science Foundation.",
            "He is turned down about.",
            "50% of more over all of these people who we've interviewed among some of the most distinguished scientist in the world in United States.",
            "A high percentage tell us that they spend almost 30% of their time attempting to raise money.",
            "That's a little misleading because in order to write a good grant proposal for a really good proposal, you already have to have done a good bit of research in the field.",
            "Order to impress the granting agencies that research committees and the like, but people are spending an extraordinary amount of time.",
            "Raising money, so I find this somewhat discouraging study because there are these diminishing returns in science we have, we are training more and more scientists and.",
            "It and more and more papers and more and more papers not being read by anyone, so it's a.",
            "Difficult moment, let me find your say.",
            "That once more, my wife has really been a major contribu."
        ],
        [
            "Here to this project she's published a number of papers with me.",
            "I become somewhat tearful because.",
            "These people have invested so much time and energy this man David Gear gave it his work for me for 10 years.",
            "David is.",
            "Maybe stupidly.",
            "Highly committed to me, David not only has worked for me for 10 years, but he's on call.",
            "Seven days a week, 24 hours a day.",
            "We talk from Ljubljana to wiscconsin almost every day of the week.",
            "We have some low price telephone services from the US to Europe.",
            "It caused about five or six cents a minute.",
            "So David is just a wonderful person.",
            "And without the help of a number of these people, we could not do.",
            "I could not do the really labor intensive research, so I'm very grateful to them.",
            "Thank you.",
            "Thank you very much or just for his great electric.",
            "Any comments questions?",
            "Sure, France money from the back of your service."
        ],
        [
            "First, thanks very much for your very interesting lecture and.",
            "Well, I'm very glad to listen you.",
            "I thought I'd like say your letter would be instructive for the people who are created research policies for women.",
            "Some sense.",
            "Because because you're presented very well, how important are not only this formal procedure to create something in science and science achievement?",
            "Of course, for Sabrina is difficult to talk now.",
            "So that we can create maybe.",
            "Prize is but you present that we can measure this week achievement also with some other indicators.",
            "In that sense, I would really say it would be interesting to to have this public lecture for the people who have big influence easily cause sometimes in Slovenia it's wrong understanding or even useful as you present it as whole difficulties.",
            "Procreative items to come to this to this.",
            "Big achievements in that sense, I would ask you.",
            "Hello, how do you assess now this endeavors in Europe?",
            "Oh historical is for instance rather ask you mentioned in this venue amazes comparability between German.",
            "For instance, Max Planck Institute for this particular case in United States, it is interesting history United State in Sensors or America already imported in good sense.",
            "Or this experience from German?",
            "If we went back to end of 19 century when you're in some sense adopted gumballs system and you use them your code I said destroy this.",
            "This comparative structure of scientific organization in Germany.",
            "It's very lonely this pre models or denials or auto clicker Professoren seat and then after that.",
            "Who created this Department system?",
            "You know?",
            "Again, as I understood your electric step further in this regard, 'cause the big the best results in the smallest no more important Department.",
            "But this informer.",
            "Crisis of scientists.",
            "Then, of course, this flexible talking and I would ask you which impacts Europe.",
            "Careful this mother or is still too much by the traffic even at the level of European Union we know that we now have this European Research Council and the big talking through Europe.",
            "We should now be cause he before that it was too much.",
            "Say that sounds really application.",
            "Now we're opening up again.",
            "It seems that we need again this something basic.",
            "That's a problem, you know.",
            "I love.",
            "United States Army.",
            "It's still for America.",
            "Welcome at his head community one step further in regards to Sister institution organization.",
            "Let me speak to several of the questions you raise.",
            "First, bomb academic institutions, in my judgment, are inherently quite conservative.",
            "They are slow to change.",
            "Just compare a.",
            "A University with the military organizations.",
            "Military organizations are driven very much by changes in technology and they really change rather rapidly across time.",
            "Now, universities are really inherently quite conservative, and that's across the world.",
            "In my judgment, an SEC.",
            "Universities have tended to grow and become more and more larger, and his new knowledge advances.",
            "We have greater and greater numbers of departments, and then it's very rare that departments get closed down.",
            "There are some interesting examples in our research, the Karolinska Institute, where the Nobel Prize in Physiology or Medicine are awarded.",
            "Few years ago, they closed down 17 department's.",
            "Why?",
            "Because they found it really desirable to try to integrate the fields.",
            "University, California, Berkeley?",
            "One of the great universities in the world.",
            "They were not.",
            "They discovered by my criterion, like they were not performing so well, but they had a large number of different departments in the Biological Sciences, and they closed many of them down 2nd.",
            "So it is possible, but it requires strong leadership.",
            "And visionary leaders.",
            "It's not easy.",
            "Depends on the governance structure and the like.",
            "Anna University.",
            "Whether that can happen.",
            "The second point, I would like to make though in This is why I think the example of the University was constant.",
            "Model is worth noting and it's not only at the University of Wisconsin where that I could tell you where this is happening.",
            "It is possible for a large University to create some small institutes.",
            "That have a high degree of flexibility.",
            "Indeed, it's been one of the things we have noticed in our research is that.",
            "I knew organizations often have greater capacity to adapt to what's going on in the world than older organizations, but also, it's also when you can create a new Institute within an older organization.",
            "It is possible to.",
            "Really, leap forward an be up with the rest of now why am I out here and will be honored?",
            "Be cause I had this idea two or so years ago, that one of the major problems of our time is to study rare events.",
            "There is no other University that is really concentrating on the study of rare events across a large number of fields, and we had a conference last year and I was able to bring some very distinguished scientist here.",
            "One work.",
            "One is great Britain's.",
            "Leading Earth scientist who works on Earthquake, San and another was one of the world's leading people in the.",
            "Crash in financial markets and and one of the things is that we wanted to look at rare events across many different fields and there are a lot of similarities, so I the first time I came to lubiana I still remember it very distinctly.",
            "I had dinner in the first night with Doctor Demshar.",
            "Many of you know of Doctor Demshar who is head of the sleeping in Research Council and I.",
            "Leader had several conversations with with the.",
            "The problem is Slovenia has in fact I really get very interested in.",
            "Organizations that are not necessarily performing so well globally because they're the ones who could take big risk, is those that think we're doing so well.",
            "They become very inbred and there's a lot of organizational inertia.",
            "I think looking at.",
            "Slovenia on a worldwide scale.",
            "I think there are some opportunities for a small country.",
            "Do some things and because in a country the size of the United States science has become so large and so competitive in the light.",
            "And it's very difficult to get to the people at the top.",
            "So I'm optimistic of the potential of some small countries.",
            "Now coming to another point I had with my wife and I call Mueller, we published a January coauthor in this nature paperwork.",
            "We had a paper in nature in July, which is, you know, I think it is.",
            "I'd be very proud to have that paper in there because I consider it the world's most prestigious Science Journal and it was about what I call hegemonic.",
            "Science and the argument we made that if we look at over the last 250 years in the late 18th and early 19th centuries, France was the leading scientific power.",
            "If you will, on the world and then the leadership passed Germany and eventually to Great Britain, and ultimately by the end of the second quarter the United States.",
            "If you look at each of those countries at the height of their.",
            "Scientific hegemony if you will, each one is a great power.",
            "Each of these countries was performing extraordinarily well and US has been in great power, but its power, politically, militarily and economically, is now declining relative to the rest of the world.",
            "You is still pretty significant power.",
            "Militarily, economically, but its power is declining and one of the things we pointed out in our article that the scientific hegemony of the United States.",
            "We can expect it, therefore, to begin declining.",
            "Now one of the things that I argued in that paper is there is not likely that we will have over the next several decades another scientific hedgeman what I think we will have.",
            "Increasingly is more an more networks among scientists across the world.",
            "We already see that more Europeans are willing to go and do research in Singapore and South Korea and Taiwan and the People's Republic of China.",
            "And we see this increasing mobility and people are reading the same scientific journals and we're having, I mean, in a sense, when we talk about globalization.",
            "What globalization means in some respects is a kind of increasing standardization of what is excellent across the world, so I don't see another scientific hedgeman coming on the scene for several decades, but I really do think there is potential for greater cooperation among scientists.",
            "Greater communication among scientists across the world, but I think it's very important that.",
            "The young scientist in Slovenia, the young scholar in Slovenia, had opportunity to go and interact with people elsewhere and with the.",
            "European Union and the Bologna process.",
            "In the light.",
            "I looking forward, smart, more optimistic of what the prospects are for Europe and these European countries over the next 30 years and was the case in the last 30 years.",
            "Now maybe I'm an eternal optimist about and I do think of you know, what is the potential for changing the world?",
            "And sometimes I'm a bit optimistic.",
            "Some of my critics tell me.",
            "So I believe in taking big risk and the people who take big risk, you know they fail what we really want.",
            "And then they say it's one of the interesting traits about the United States.",
            "Historically, it has had a culture in which it encourages people to take big risks, I know.",
            "Chief executives of similar largest companies in America, and often when they hire someone if they have failed at something.",
            "Those are the people they want because they have had experience in failing.",
            "It's those who've never failed and who are often very arrogant.",
            "But there's nothing wrong with failing one of the greatest scientist the United States produced in the 20th century with a man by the name of God Linus Pauling.",
            "At Caltech one, certainly the leading perhaps of the chemist of the last century.",
            "I never met calling, but I studied him so closely and calling my first name, Linus.",
            "Language was willing to take big risks and hit what we call in baseball.",
            "A lot of home runs, but he struck out the numbers.",
            "He was a man willing to take big risks.",
            "An I think it's important in science that people are encouraged to fail and they not be beaten up and destroyed for failing, but they need to be nurtured with high standards.",
            "You can't let someone fell forever.",
            "But we should encourage more people in my opinion, to take risk.",
            "Sure, yes.",
            "My name is clinical store, separated social Sciences.",
            "The proposals are interesting and stimulating.",
            "And then I would like to ask whether familiar with the concept of convergence in science and technology as defined by Armenians, Bainbridge and Casserole is defined by.",
            "In the house here on the National Science Foundation, I don't know whether I'm familiar with that or not, but I have written over the years a good bit about convergence and divergent sunla.",
            "They talk of commercial technologies or Sciences converging technologies.",
            "Arise from older disciplines or Sciences, but are qualitatively different than all the disciplines, and so they also stressed the need for a price.",
            "Disciplinary education for scientists or cooperation from different scientific fields which are quite far apart as necessary to form this new Sciences automated technological order on scientific breakthroughs, which is quite similar when you take the institutional approach.",
            "Network fosters this.",
            "So that was the first part on and I would also like to ask when you mentioned that.",
            "There is an increasing number of signing papers that don't get regular science.",
            "I would like to know if you have any thoughts on whether or more transdisciplinary education in scientific operating education would mitigate the problem.",
            "So the researchers that.",
            "They provide or systemic neuroscience with.",
            "Cancel the second ones on whether you think this politicization, which will find patterns and answer whether the organization.",
            "Like on computer programs or federal emissions, software will also contribute to finding similar horses or patterns between different language papers.",
            "Different languages in different fields, yeah?",
            "Automatisation doesn't help.",
            "Yes.",
            "Securities.",
            "Well, these are really big questions you're posing and I may not give you a very satisfactory answer, but let's begin with the first one, convergence.",
            "On the one hand.",
            "There really is a good bit of convergence taking place across the world.",
            "When I spoke about increasing.",
            "Convergence time standards across countries and people are reading the same journals and the light.",
            "That's a that's one form of converging standards and in terms of what is excellent.",
            "At the same time, the world is we have two opposite trends.",
            "On the one hand, we have.",
            "High degree of specialization and sometimes greater and greater fragmentation with more and more subspecialties going on at the same time that we have greater and greater interdisciplinarity.",
            "Now I, I'm.",
            "In this paper, I think that you referred to me before the talk today by myself in Carl Miller.",
            "I talked a little bit and I'm writing some more about this on creativity, and I think people who are really creative, say in science they have to have done two things.",
            "I think they need to be well grounded and in particular feel like kind of specificity.",
            "But at the same time, one of the tricks is to have a high.",
            "Range, and so there's a tradeoff.",
            "If you invest too much in too much depth in a specific field.",
            "Have much range and many of these scientists whom I have studied who are really highly creative.",
            "They did start in a specific field.",
            "I mentioned this man Norwalk, Gilbert and Gilbert starts off in mathematics and physics but then he he begins to have quite a range and so one of the problems through or really creative people.",
            "I think you see we don't want to get rid of departments.",
            "I think we.",
            "Here sometimes in having that is scientific disciplines.",
            "I think we error too much, however, often in having too much subspecialization so that people even in the same field, can't understand when I study some Department of Cardiology.",
            "The people in the same in heart and vascular heart disease.",
            "They can't even understand one another because each is so specialized, much less communicate with people across fields.",
            "So we want to have the specialization, but not so much that people even in the same fields can understand each other.",
            "And I'm sure you see sociology and like so.",
            "The trick is to have.",
            "So, so we do have this increasing convergence and greater interdisciplinary at the same time that in some respects we're having more and more specialization.",
            "And that's just the dynamics and the way in which science is moving.",
            "Now, what can we do about it?",
            "Well.",
            "So I think the major breakthroughs are indeed rare events and we can't plan.",
            "We cannot specify, just we ran when they will occur.",
            "But I think what I am vain enough to believe is that our research has helped us to understand where they are more likely to occur and the environments in which they are least likely to occur.",
            "And I do believe that even if you have an organization.",
            "By our criteria, that looks as though it's not likely to have a major breakthrough.",
            "I think it's possible by creating new arrangements within the organization that has a high degree of flexibility an has the potential to make these fundamental changes.",
            "You spoke something about different languages, and I wasn't certain that I quite.",
            "I understood what you were saying.",
            "In terms of certainly are different kinds of software, but I think I'm optimistic that we really have increasing common software and the like.",
            "And I'm going to make one comment and I don't know whether it's irrelevant to your question or not.",
            "And that is we have more and more people.",
            "Working across fields and working across countries together.",
            "So when we read.",
            "You pick up the scientific journals and the leading lines.",
            "You will see more and more authors in different countries.",
            "One of the things that is really interesting when we look at these 325 major discoveries, which we have studied and where there are multiple authors, every single one without exception.",
            "Have been people who have spent a good bit of time with one another.",
            "That is, if you're working with someone in another field, there is this problem of a common language.",
            "You and coming back to Bill Reader at the University of California, San Francisco, people who are in different fuels, and like if you're really talking about it fundamentally different.",
            "They have to learn to speak the same language.",
            "They have to be tolerant of one another so that when I'm working with someone.",
            "Karl Mueller, for example, Carl is related in Vienna and he and I write papers and we come from completely different academic backgrounds.",
            "But it's necessary that Carl feel comfortable in telling me that my ideas are stupid.",
            "And of course I tell call some of his ideas are stupid and that we can talk openly like this.",
            "And but on the Internet.",
            "And when you were writing papers across countries, what is really going on is that the big breakthroughs.",
            "Don't happen like that.",
            "I do believe that for these big breakthroughs to occur, there has to be this kind of intense and frequent social interaction that I can look at you in the face and I can.",
            "You can tell me that my ideas are really stupid and the next day and go home and I think about these things and the next day I come back and talk to you.",
            "And I say, well, I thought about that and you tell me again, you know that's still stupid, but we can still.",
            "Communicate, and so there's a lot of excellent research that takes place across countries and the like.",
            "But it's so much of it is in more established fields and people can interact a good bit and really do good research.",
            "But there really major breakthroughs and at least an hour research, requires this intense and frequent interaction.",
            "It doesn't mean they have to live together all the time, but you do have to have these periodic.",
            "Frequent and intense interactions.",
            "At least that's what our data show.",
            "The thing that's interesting.",
            "So basically you are saying that it's a different kind of creativity that arises from a personal communication then that arises from other more emails or no well, depends on this is an interesting point that you're making.",
            "I just gave a paper couple of weeks ago in Italy.",
            "Anne on creativity.",
            "The difficult problems in talking about creativity.",
            "What is creativity?",
            "How do we measure in the light now again, forgive me, I use our criterion for defining creativity and.",
            "Yes.",
            "I have known some scientist, one with whom I interacted, great, deal.",
            "A great sign is that the Neurosciences Institute in La Jolla, CA and I'm affiliated with that scientists and the director is one of my better friends.",
            "Gerald Edelman.",
            "An Jerry is a Nobel laureate.",
            "Jerry is a DVD in many respects, but Jerry is one of them.",
            "Really more creative as soon as he made a major discovery many years ago in.",
            "Immunology for which he was awarded Nobel Prize.",
            "Then later he moves in a new field and again makes a major discovery in cell biology, and now he's been for seven years one of the world's leading people in neuroscience and Jerry, even though he has a lab and like he really works, he thinks bring much alone now he and another great scientist whom I never spend as much time.",
            "Of course, with him as I have Jerry Edelman, but never another great scientist of the last century.",
            "Was Francis Crick?",
            "Who were Jim Watson discovered the structure of DNA and I've had the pleasure of interviewing what Creek several times and he died a couple of years ago.",
            "But I studied Crick.",
            "I always study people who go contrary.",
            "What my user in Creek, also with the exception.",
            "His work with Watson and Crick is also been kind of loner.",
            "Anna, very he was very creative man and so.",
            "I don't want to say.",
            "You can be highly creative even by my criteria by working very much alone, but I think Rick and Edelman and a few others are really exceptions to research and that we do.",
            "Maybe I would just mention your fancy and some other qualities.",
            "We were working together in a broader in the project.",
            "Who is the we?",
            "Oh excuse me, yeah.",
            "Kind of a international project.",
            "Is it illogical terminology?",
            "We were studying how social capital of a research girl group effects the performance of young researchers, right?",
            "The story on the microlab yes, right?",
            "We lived operationalizing measuring what kind of things these social capital in the research group and we had actually so similar results.",
            "Grayson's what kind of research group produces a good young researcher, right?",
            "Right?",
            "Yeah, is diverse.",
            "Again, this is the logic of terminology, structural pose, which means that there are people that can bridge different parts of your little group together.",
            "So again, in your your points of the creative group.",
            "So there are some entries, another point is.",
            "Cohesiveness, you know?",
            "So very low cohesive.",
            "Talk right, right, right?",
            "I know he's right, which then interview that there are two clues.",
            "To each other, they do not go.",
            "If everybody thinks the same way.",
            "Low performance yes, right right?",
            "Many different points that you have in your yeah here you know we we got it empirically ourselves.",
            "Small research group yeah no.",
            "This isn't us."
        ],
        [
            "I'd just as an aside when I talk about this nurturing environment.",
            "Yes.",
            "I think that is really very important this if I may.",
            "Just as an aside, I have many many friends in Germany and the Germans have been really very supportive of my research overtime.",
            "And if you look at my video you will see I been visiting professor here and there and the Germans have funded my research and I'm very grateful.",
            "But there are different cultural environments.",
            "An I want to spent pretty much a year in a monks punk Institute in in Germany.",
            "Anne had two directores Anne.",
            "Both are friends of mine and yet it's this story I'm about to tell you is really interesting because I think it says something about the difference between research organization in Germany, Anna Research Organization in the United States.",
            "So one of these both directors were friends of mine, but one of them.",
            "Whenever she giving way, whenever she will need to speak to one of the younger researchers who is just down the Hall, she would have her secretary called the young researcher professor suing So wants to see you.",
            "Now in America, the head of our organization would go down and speak the young.",
            "So it was sort of like, you know.",
            "The young researcher is someone, but in the American environment, what I think is really necessary in creative environment is that there is almost no hierarchy.",
            "You know, when you're in the scientific community, people know who's doing better and who knows more.",
            "But there's no need to have this kind of status hierarchy.",
            "We're all learning together, anwer on ignorant.",
            "And I must confess that I have some Gray hairs and as I get older, I mean I realize I know less and less.",
            "We have to have a good bit of humility and recognize that we can learn from everybody, and I think it really in a scientific environment.",
            "It's really very important that older people and younger people can work together on first name basis and like and there is a kind of.",
            "Status hierarchy and that it becomes pretty obvious sometimes.",
            "Maybe a student knows more than some old fogey, but I really do need enormous amount from young people, but in the Max Planck structure there is this very hierarchical, almost authoritarian culture and I think it hinders their ability to reach their potential, and I think it's I hope you remember.",
            "This perspective of mine.",
            "Another story, I attended a conference some years ago in Germany again, and the speaker was a German professor, So what more senior professor and he was introduced as professor showing so well when Professor Soandso began to speak, I thought oh he's going to.",
            "He was really angry that he was not introduced as Professor, Doctor, Doctor.",
            "And he would not just ordinary professor.",
            "He was Professor, Doctor, Doctor, and it just would never happen in their own search.",
            "I don't care whether somebody calls me Rogers and some people call me really bad things, but we are not.",
            "I don't think titles are very important.",
            "And so I think in doing good research we need to leave the status distinctions at the door.",
            "Thank you very much.",
            "Thank you very much.",
            "Thank you.",
            "Thank you so much for inviting me here.",
            "Appreciate it."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "The plan we see I think it's really a great pleasure to meet, introduce today's speaker.",
                    "label": 0
                },
                {
                    "sent": "Actually, in speaker that will have selectors in the future days.",
                    "label": 0
                },
                {
                    "sent": "Professor Roger Hallieford, professor history at the University of Wisconsin.",
                    "label": 1
                },
                {
                    "sent": "In the United States, and he's quite known in Slovenian academic world.",
                    "label": 0
                },
                {
                    "sent": "Let me say something about his work so that we should see and understand he's actually park, which is actually inside his major question that is raising in his research work.",
                    "label": 0
                },
                {
                    "sent": "Two major questions are raised from here.",
                    "label": 0
                },
                {
                    "sent": "First one, why would particular institutional arrangements and specific types of organizations emerge?",
                    "label": 0
                },
                {
                    "sent": "And the second, what consequences follow from these institutional and organizational arrangements?",
                    "label": 0
                },
                {
                    "sent": "Now he works on complex research project which attempts to explain why this there is a variation across countries overtime and across research organizations in the rate at which major discoveries in biomedical science occur.",
                    "label": 0
                },
                {
                    "sent": "He's also getting another rather complex cross national Historical Research Project, which attempts to explain why countries vary in their capacity to being innovative in science based industry.",
                    "label": 0
                },
                {
                    "sent": "During the 20th century, this project brings together that are ethical perspectives of his previous work on institutional analysis, industrial sectors, major discoveries in biomedical science, and in the governance of capitalist economies.",
                    "label": 0
                },
                {
                    "sent": "Together with Karen Miller, Roger wrote an article about transdisciplinary research for our program for the 21st century, which was the basis of this project.",
                    "label": 0
                },
                {
                    "sent": "He's one of the founders of this program at the University of Louisiana, and now she's also chair of the Scientific Advisory Board.",
                    "label": 0
                },
                {
                    "sent": "So we're very pleased that he can give us several lectures at University of Louisiana, and today is the first one.",
                    "label": 0
                },
                {
                    "sent": "Undiagnosed creativity and radical breaks or breakthroughs in science resources deployed.",
                    "label": 1
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "You're of course to be here in Louisiana.",
                    "label": 0
                },
                {
                    "sent": "I think this is my fourth trip here and every time I've been here the people here have been extraordinarily gracious and hospitable.",
                    "label": 0
                },
                {
                    "sent": "Jimmy and I had a very stimulating experience each time I'm here.",
                    "label": 0
                },
                {
                    "sent": "It's true that at the University of Wisconsin I have been professor of history, but none of my colleagues think I'm a historian, Anne.",
                    "label": 0
                },
                {
                    "sent": "Actually, at University of California San Diego, I have an appointment in the Department of Physics and also an affiliation within, you know, scientists Neurosciences Institute and it was constant.",
                    "label": 0
                },
                {
                    "sent": "I'm also professor in sociology, so when people ask me what is your field, I frequently say I don't know.",
                    "label": 0
                },
                {
                    "sent": "But I do try to look at things across disciplines.",
                    "label": 0
                },
                {
                    "sent": "An IAM historian in that I really am interested in looking at problems overtime and how changes in variables influence change overtime now.",
                    "label": 0
                },
                {
                    "sent": "Last year we began to actually two years ago when I first 2 1/2 years ago when I first came to lubiano, we began to think about a new kind of research project, actually.",
                    "label": 0
                },
                {
                    "sent": "For the world.",
                    "label": 0
                },
                {
                    "sent": "That's a study of raree bands with big social consequences and rare events are indeed rare, but they really do have large social consequences.",
                    "label": 0
                },
                {
                    "sent": "Earthquakes, hurricanes, nuclear accidents, large terrorist attacks to mention a few, but also major advances in technologies and to some extent in science and without fundamental advances in science we.",
                    "label": 0
                },
                {
                    "sent": "Would not have a good many of our fundamental advances in technology.",
                    "label": 0
                },
                {
                    "sent": "If you just think I think sometimes on a day to day basis, we really don't realize the extent to which we have been living in a moment in history in which there are large numbers of rare technological innovations.",
                    "label": 0
                },
                {
                    "sent": "We take the laptop for granted the cell phone for granted and the like.",
                    "label": 0
                },
                {
                    "sent": "But if you think actually 20 years ago there were no cell phones, we make sure the clothing we wear was.",
                    "label": 0
                },
                {
                    "sent": "These are synthetic materials that they were created in part by fundamental basic science and the like.",
                    "label": 0
                },
                {
                    "sent": "Now in the last four to five years we've been living in a moment of great financial exuberance and the financial markets have been rising.",
                    "label": 0
                },
                {
                    "sent": "Housing prices have been rising globally.",
                    "label": 0
                },
                {
                    "sent": "And we've had relatively low interest rates globally, and this is also a kind of rare event.",
                    "label": 0
                },
                {
                    "sent": "We had something similar in the 1920s with this kind of.",
                    "label": 0
                },
                {
                    "sent": "Real exuberance globally and then you have another kind of rare event, and that is the collapse of financial markets and the collapse of financial markets or another kind of rare event.",
                    "label": 0
                },
                {
                    "sent": "And they really do have worldwide and global consequences and many others fear that one is now happening in the global financial markets are likely to have worldwide implications for many of us across countries.",
                    "label": 0
                },
                {
                    "sent": "For some years to come, that remains to be seen, but these are of course rare events.",
                    "label": 0
                },
                {
                    "sent": "Now I have been studying rare events for some time.",
                    "label": 0
                },
                {
                    "sent": "I want to talk to you today about a particular class of rare events.",
                    "label": 0
                },
                {
                    "sent": "It's maybe one that you don't really think so much about rare events, but it is what I call major discoveries in science.",
                    "label": 0
                },
                {
                    "sent": "And in this case an basic biomedical science.",
                    "label": 0
                },
                {
                    "sent": "And many of these are major discoveries do along the way have fundamental impacts on medical technology, clinical practice and like and some of them are yet to be realized.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So can you see this one?",
                    "label": 0
                },
                {
                    "sent": "This is when there's least readable, and this study in which I have been involved in is a multi level analysis which raises a number of methodological questions we have.",
                    "label": 0
                },
                {
                    "sent": "The larger institutional environment in which scientists and universities work, and then you have research within a country that is.",
                    "label": 0
                },
                {
                    "sent": "These institutional environments.",
                    "label": 0
                },
                {
                    "sent": "Then we have the often universities or Research Institute.",
                    "label": 0
                },
                {
                    "sent": "Department's an laboratories and finally, individual Sciences and all of these things are interacting together, and as result of these interactions we occasionally have a major discovery, but we aren't living in a world and I'll talk at another.",
                    "label": 0
                },
                {
                    "sent": "Another talked in this lecture series because actually we do live in a world that is really very nested, whether we think of our economies or our political systems where we have local politics, the national politics, the European Union or Trans, National regional politics and funding, the global level, and so we're living in a moment in history in which we really do have these.",
                    "label": 0
                },
                {
                    "sent": "Multi level effects and one of the great challenges for us.",
                    "label": 0
                },
                {
                    "sent": "It seems to me is to try to understand the way all these different levels are interacting and I'm going to talk to you about just one small part of this multi level activity going on in science Now.",
                    "label": 0
                },
                {
                    "sent": "So as I say, I'm studying major discoveries and basic biomedical science.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so forget my topic.",
                    "label": 0
                },
                {
                    "sent": "What I'm talking about for a moment and just reflect and ask yourself.",
                    "label": 0
                },
                {
                    "sent": "Well if you were going to design a study.",
                    "label": 0
                },
                {
                    "sent": "How would you define a major breakthrough?",
                    "label": 1
                },
                {
                    "sent": "And if you define a major breakthrough, how would you operationalize it?",
                    "label": 0
                },
                {
                    "sent": "Because no matter how honest you tend to be, or trying to be in defining major breakthroughs when anyone else agree with you, when you identify a major breakthrough now actually I spent about a year and a half thinking about this problem, because I will need to be able to define major breakthroughs.",
                    "label": 0
                },
                {
                    "sent": "So in the scientific community an others at least who would read my work and might be critical of it.",
                    "label": 1
                },
                {
                    "sent": "We could all agree on what a major breakthrough is.",
                    "label": 0
                },
                {
                    "sent": "So I remember that I was beginning this project and I was at a Research Institute.",
                    "label": 0
                },
                {
                    "sent": "I think for a year.",
                    "label": 0
                },
                {
                    "sent": "But anyway, many months and I was in Sweden and each year about this time or in early October, what I called the Nobel business.",
                    "label": 0
                },
                {
                    "sent": "He shot and the Nobel Prizes are awarded by the Royal Swedish Academy of Sciences in Stockholm as well as the Karolinska Institute.",
                    "label": 0
                },
                {
                    "sent": "An I was fortunate in this Institute that I had lunch several times a week with a scholar and Swedish scholar who is a member of the Royal Swedish Academy of Sciences and they were deciding who would win Nobel Prizes.",
                    "label": 0
                },
                {
                    "sent": "Now he was not, of course, at Liberty to tell me what was going on, but I was.",
                    "label": 0
                },
                {
                    "sent": "We had a lot of discussions about how they decide what a major who would get these Nobel Prizes.",
                    "label": 0
                },
                {
                    "sent": "So what I have done I've come up with is somewhat abstract and.",
                    "label": 0
                },
                {
                    "sent": "Very abstract in definition of a major discovery, but one of the keywords here is diverse.",
                    "label": 1
                },
                {
                    "sent": "In our research we have studied approximately 325 major discoveries throughout the 20th century in four countries, Britain, France, Germany and United States, and everyone of these 325 major discoveries reflect a great deal of cyantific diversity.",
                    "label": 0
                },
                {
                    "sent": "That is, the people who made made the major breakthroughs.",
                    "label": 0
                },
                {
                    "sent": "Well, first of all, they are recognized people in many different fields of science, but the site is doing them themselves internalize a great deal of scientific diversity.",
                    "label": 0
                },
                {
                    "sent": "And so this is one of the key words.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "Then, once we have this definition of a major discovery, how would you know one if someone or read about it?",
                    "label": 0
                },
                {
                    "sent": "So this is again what I came up with in Sweden.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the Swedes were extraordinarily cooperative an the they were the first to fund my project and I do appreciate their generosity.",
                    "label": 0
                },
                {
                    "sent": "One of the Swedish Research Council's now.",
                    "label": 0
                },
                {
                    "sent": "So we we we when I say we because I've had a number of assistance an my wife has worked with me and but then enormously helpful.",
                    "label": 0
                },
                {
                    "sent": "But also my most severe critic, and so this is the way we operationalize the subject of a major breakthrough.",
                    "label": 0
                },
                {
                    "sent": "First, when the running Society of London, very prestigious organization, awards prizes each year, and some of them are in basic biomedical science.",
                    "label": 0
                },
                {
                    "sent": "So since 1901, and now we're probably covers the period 1901 throughout the 20th century.",
                    "label": 0
                },
                {
                    "sent": "Whenever a scientist doing work in the basic biomedical Sciences received a coping metal, we include that one, and then there are these two kinds of Nobel Prizes and Nobel Prize in Physiology or Medicine that's awarded annually an by the Karolinska Institute and we will see in the next few weeks who received the Nobel Prize in Physiology or Medicine, and then we have the Royal Swedish Academy of Sciences and the.",
                    "label": 1
                },
                {
                    "sent": "Award prizes in a variety of fields in physics and chemistry and economics and the like, but insofar as there has been a Nobel Prize in chemistry with high relevance in basic biomedical science, we've included these for the most part, these have been in biochemistry, but not exclusively.",
                    "label": 0
                },
                {
                    "sent": "Then we've spent a great deal of time studying the archives of both the Royal Swedish Academy an the Carolines Institute, and.",
                    "label": 0
                },
                {
                    "sent": "However, those are kinds are not open for reasons of confidentiality over in the last 50 years, which is good for us because the number of people permitted to make nominations has increased dramatically in more recent years, so it was manageable for us to go back and study the archives in these earlier years, and so whenever there was a nomination for these two are kinds of prizes and a single body of research receive.",
                    "label": 0
                },
                {
                    "sent": "Our ten nominations and each of three years we include in that, and then each year at both the Karolinska in the Royal Swedish Academy.",
                    "label": 0
                },
                {
                    "sent": "They have a committee, and each one of these two who study all of these nominations, and after studying them, and sometimes they studied them for 3, four, or five years and and they end up with a list of things called prize worthy, and from that prize worthy list they end up.",
                    "label": 0
                },
                {
                    "sent": "Making making a choice for a Nobel Prize, but so we gave these committees some legitimacy and credibility.",
                    "label": 0
                },
                {
                    "sent": "And so whenever through our study of the archives, a body of work was listed as prize worthy.",
                    "label": 0
                },
                {
                    "sent": "We've included that now, as I said, the Nobel archives have been closed for the last 50 years and we didn't want this project to be just about Nobel Prizes.",
                    "label": 0
                },
                {
                    "sent": "So we have several other major international prizes and they are the Lasker Prize and Basic actually basic biomedical science, Louisa Gross Horwitz Prize, an the Crayford Prize, which happens to be also awarded by the Forest Ridge Academy of Sciences.",
                    "label": 0
                },
                {
                    "sent": "Now what we have done, we have taken these three.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In 25 major discoveries and that was relatively easy, but this has been an extraordinarily labor intensive project.",
                    "label": 0
                },
                {
                    "sent": "Once we have these major discoveries, then the question is what is the institutional and organizational environment in which they occur?",
                    "label": 0
                },
                {
                    "sent": "What was the structure of the organizations?",
                    "label": 0
                },
                {
                    "sent": "What were the laboratories about an overall?",
                    "label": 0
                },
                {
                    "sent": "We have studied approximately 750 research organizations in these four countries.",
                    "label": 0
                },
                {
                    "sent": "Britain, France, Germany and the United States throughout the 20th century there have been approximately 2000 labs that we have studied an we've conducted approximately 500 in.",
                    "label": 0
                },
                {
                    "sent": "In depth interviews with scientists.",
                    "label": 0
                },
                {
                    "sent": "A good many of them have received Nobel Prizes.",
                    "label": 0
                },
                {
                    "sent": "Obviously a few of these, some of some of the recipients and other prizes were deceased and died before we got into this project.",
                    "label": 0
                },
                {
                    "sent": "We've also worked with archives about the labs and many of these scientists, unlike so, it's been a very labor intensive project to study the the institutional organization and the department's and labs where where this research occurred and when could say will only imagine me do all this labor intensive work and again.",
                    "label": 0
                },
                {
                    "sent": "I've had a good bit of assistance in this match, but this is only another part of the problem because.",
                    "label": 0
                },
                {
                    "sent": "What about those scientists who who don't receive major discoveries?",
                    "label": 1
                },
                {
                    "sent": "Are they working in different kinds of organizations?",
                    "label": 0
                },
                {
                    "sent": "Are they working in different labs?",
                    "label": 0
                },
                {
                    "sent": "So what we have done in these four countries, we have drone samples of what we know to be distinguished.",
                    "label": 0
                },
                {
                    "sent": "Scientist, that is, they were.",
                    "label": 0
                },
                {
                    "sent": "They might be members of the National Academy of Sciences in United States or members of the Royal Society in Great Britain, and we have grown samples of those scientists.",
                    "label": 0
                },
                {
                    "sent": "Who were distinguished scientist but never received on this kind of recognition, and we've studied a good many.",
                    "label": 0
                },
                {
                    "sent": "We've studied those labs and those organizations to see.",
                    "label": 0
                },
                {
                    "sent": "Are there substantial differences.",
                    "label": 0
                },
                {
                    "sent": "This is not been a statistical analysis for complex reasons, but we have attempted to find out here.",
                    "label": 0
                },
                {
                    "sent": "Are there substantial differences?",
                    "label": 0
                },
                {
                    "sent": "An indeed they have been, and I hope through in this lecture I can begin to.",
                    "label": 0
                },
                {
                    "sent": "Talking about that now, the kinds of organizations an organizational environments in which these major discoveries occur.",
                    "label": 0
                },
                {
                    "sent": "Let me say again when I'm talking bout rare events in science I guess and forgive me, I should have said this at the outset.",
                    "label": 0
                },
                {
                    "sent": "We cannot predict where an when a major discovery such as we are talking about here.",
                    "label": 0
                },
                {
                    "sent": "We ran when one will injure.",
                    "label": 0
                },
                {
                    "sent": "I think what we can do is to what we're trying to do is to understand the.",
                    "label": 0
                },
                {
                    "sent": "Circumstances under which they do occur, and I think we can pretty well tell you the circumstances under which they are very likely unlikely.",
                    "label": 0
                },
                {
                    "sent": "It is very unlikely to occur, so the kinds of environments in which these major discoveries tend to occur is if you remember a these major discoveries reflect a good bit of scientific diversity, and so they take place in organizations in which there is a moderately high degree of scientific diversity.",
                    "label": 0
                },
                {
                    "sent": "Now what does that mean?",
                    "label": 0
                },
                {
                    "sent": "For example, if you look at Germany, they have a large number of Max Planck Institutes and these are extremely high quality institutes, and some of Germany's leading scientists are directores there.",
                    "label": 0
                },
                {
                    "sent": "But if you look at those Max Planck institutes, there's a Max Planck Institute for Genetics and Max Planck Institute for Biochemistry mods.",
                    "label": 0
                },
                {
                    "sent": "Plank Institute for Neuroscience and the like.",
                    "label": 0
                },
                {
                    "sent": "And while they do extraordinarily good science, they there.",
                    "label": 0
                },
                {
                    "sent": "They're very narrow in their research program, so they do not have a relative behind degree of scientific diversity.",
                    "label": 0
                },
                {
                    "sent": "An and these prizes if you will, or these recognitions are.",
                    "label": 0
                },
                {
                    "sent": "Reflect recognition by a diverse body of the scientific community across fields, so it's not that small institutes don't get this kind of recognition as we'll see in a few minutes, but I certain amount of of.",
                    "label": 0
                },
                {
                    "sent": "Scientific diversity in the organization as well as the individual scientist is necessary then.",
                    "label": 0
                },
                {
                    "sent": "The organization has the capacity to we recruit scientists, then, who internalize a fair amount of scientific diversity.",
                    "label": 1
                },
                {
                    "sent": "This next one is quite important.",
                    "label": 0
                },
                {
                    "sent": "This is not just important to have scientists in an organization or a setting in which there is this scientific University working in different fields, but it's absolutely necessary that there is a high degree of communication and integration among scientists in different fields.",
                    "label": 0
                },
                {
                    "sent": "Through frequent and intense interaction, I will discuss a few of these organizations in few minutes and you'll see that there is no single pathway or single prescription for how this interaction takes place.",
                    "label": 0
                },
                {
                    "sent": "But it is pretty common and they have little leaders.",
                    "label": 0
                },
                {
                    "sent": "Two points there may be leaders of a single organization that is a relatively small Institute, or there may be leaders ahead of a lab with four five, 1015, sometimes 20 leaders who.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless these labs or the organization has a fair amount of scientific diversity, but the leaders are able to integrate this scientific University.",
                    "label": 0
                },
                {
                    "sent": "The leaders are individuals who have a.",
                    "label": 0
                },
                {
                    "sent": "High capacity to understand the direction in which scientific research is moving an.",
                    "label": 1
                },
                {
                    "sent": "When I use this term nurturing environment, what does that mean?",
                    "label": 0
                },
                {
                    "sent": "I remember one of the first talks I I gave on this topic.",
                    "label": 0
                },
                {
                    "sent": "I was speaking to an audience in Germany.",
                    "label": 0
                },
                {
                    "sent": "Now, in my judgment, and I've spent a good bit of time over the years in Germany.",
                    "label": 0
                },
                {
                    "sent": "There is a fair amount of authoritarian, in contrast to say.",
                    "label": 0
                },
                {
                    "sent": "States in the labs.",
                    "label": 0
                },
                {
                    "sent": "And like they're very strong leaders and like an they're not what I call a very nurturing.",
                    "label": 0
                },
                {
                    "sent": "I don't mean by nurturing, having low standards, but in these nurturing environments we do have leaders who who interact particularly with younger people provide really rigorous criticism, but provided in a somewhat nurturing and helpful way.",
                    "label": 0
                },
                {
                    "sent": "And finally, these organizations have a high degree of flexibility.",
                    "label": 0
                },
                {
                    "sent": "That is, science is changing.",
                    "label": 0
                },
                {
                    "sent": "Rapidly all the time.",
                    "label": 0
                },
                {
                    "sent": "These are organizations that have the capacity to adapt to new trends in science, and they have a high degree of autonomy to do what they think they should do.",
                    "label": 0
                },
                {
                    "sent": "Then of course, we have organizations.",
                    "label": 0
                },
                {
                    "sent": "What kind of characteristics hamper the making?",
                    "label": 0
                },
                {
                    "sent": "A major discoveries well here.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Organizations that are really highly differentiated.",
                    "label": 0
                },
                {
                    "sent": "They have large numbers of departments, people in many, many specialties, and the right there's someone hierarchical and like, but they have very little communication across fields and that kind of social integration interaction across fields is apparent that they do have diversity, but there's a high so much diversity.",
                    "label": 0
                },
                {
                    "sent": "That it's very difficult to have effective communication among actors in different fields of science now.",
                    "label": 1
                },
                {
                    "sent": "So then.",
                    "label": 0
                },
                {
                    "sent": "We have",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "These what I call institutional environments.",
                    "label": 1
                },
                {
                    "sent": "Let's just take these four countries.",
                    "label": 0
                },
                {
                    "sent": "Britain, France, Germany and the United States throughout the 20th century.",
                    "label": 0
                },
                {
                    "sent": "Now Britain and USI have coded in my research as being relatively weak institutional environments.",
                    "label": 0
                },
                {
                    "sent": "What does that mean?",
                    "label": 0
                },
                {
                    "sent": "Well, remember, I suggested that the institution environment pretty much is focusing at the national level in which science is concerned, and whereas in France, for example, there is a high degree of centralization, largely focused in Paris.",
                    "label": 0
                },
                {
                    "sent": "Over the appointment of personnel.",
                    "label": 0
                },
                {
                    "sent": "Not in these organizations.",
                    "label": 0
                },
                {
                    "sent": "These organizations with weak institutional environments or one in which there are likely to be a multiplicity of major breakthroughs.",
                    "label": 0
                },
                {
                    "sent": "But those with.",
                    "label": 0
                },
                {
                    "sent": "They also have weak control over scientific disciplines.",
                    "label": 1
                },
                {
                    "sent": "For example in Germany.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "As you probably know, in order to become a professor, it historically it was very common to that a person have completed the ability to see Onan.",
                    "label": 0
                },
                {
                    "sent": "There is kind of general standards of fields is not easy for these fields to change very quickly, but in the US, for example, the University has high autonomy to decide whether there will be a new discipline.",
                    "label": 0
                },
                {
                    "sent": "Or not so often in the US, and to some extent in Great Britain, you see large numbers of scientific disciplines and new ones emerging.",
                    "label": 0
                },
                {
                    "sent": "There is relatively weak control over funding, though that is increasing, say in the US and to some extent in Britain, partly because of the size of the US, partly because it is amazing diversity.",
                    "label": 0
                },
                {
                    "sent": "There are literally thousands of private.",
                    "label": 0
                },
                {
                    "sent": "Foundations, so while we do have a great deal of funding and I'll come back of an increasing percentage of funding for research coming from the national government in US.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, overtime it's been much easier in the US for scientist to knock on one door and another door door until someday someone is found who will support one's research there.",
                    "label": 0
                },
                {
                    "sent": "So there's been relatively weak control of our funding, and.",
                    "label": 0
                },
                {
                    "sent": "An the lack of a say huh?",
                    "label": 0
                },
                {
                    "sent": "Billy Taxi on and like another thing only this sort of adds up to the fact that when scientists have a high degree of autonomy, there is much more around possibility for people to engage in high risk research.",
                    "label": 0
                },
                {
                    "sent": "An as we will see at the tored, the end of the talk this.",
                    "label": 1
                },
                {
                    "sent": "Ability to engage in high risk research I think has been very important.",
                    "label": 0
                },
                {
                    "sent": "When we look at these people who have made these major breakthroughs in basic biomedical science.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then strong institutional environments are pretty much at the opposite end of the continuum.",
                    "label": 1
                },
                {
                    "sent": "Highly centralized control over personnel are much stronger.",
                    "label": 1
                },
                {
                    "sent": "What would constitute an appropriate discipline and much more centralized control or funding.",
                    "label": 0
                },
                {
                    "sent": "When prescribing what this comes back to, this ability to see on and like much more on discouraging.",
                    "label": 0
                },
                {
                    "sent": "I'm really high risk research now.",
                    "label": 0
                },
                {
                    "sent": "I do want to come back and just jump ahead as we have more and more larger and larger percentage of funding in US coming from the central government you do have.",
                    "label": 0
                },
                {
                    "sent": "A.",
                    "label": 0
                },
                {
                    "sent": "It makes it increasingly difficult for scientist to engage in really high risk if you will crazy research.",
                    "label": 0
                },
                {
                    "sent": "For example, there was a time in 1920s when Niels Bohr, one of the world's great physicists, attended a AA meeting.",
                    "label": 0
                },
                {
                    "sent": "Ann Goodman, which was one of the great centers of physics in the 1920s, and Niels Bohr, of course, with one of the world's great physicists in the 20s.",
                    "label": 0
                },
                {
                    "sent": "And there was a young man by the name of Wolfgang Pauli, who would later win a Nobel Prize in Physics, and Polly gave a talk.",
                    "label": 0
                },
                {
                    "sent": "Anbur stood back and said, yeah, this is pretty good, but I'm not sure that it's good enough to be really crazy and what board meant was, you know, it's really important that a young scientist be willing to take high risk and he wasn't certain that Paul's work was really.",
                    "label": 0
                },
                {
                    "sent": "Crazy enough.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Two OK, so here is in crude way kind of summary of a good bit.",
                    "label": 0
                },
                {
                    "sent": "What I've been saying so.",
                    "label": 0
                },
                {
                    "sent": "These major breakthroughs tend to occur environments in which there is a model.",
                    "label": 0
                },
                {
                    "sent": "Degree of scientific diversity, but also in organizational settings in which there is increasing high communication.",
                    "label": 0
                },
                {
                    "sent": "An social integration an as you get up to a certain limit, a certain amount of scientific diversity.",
                    "label": 1
                },
                {
                    "sent": "An increasing level of communication across these different fields.",
                    "label": 0
                },
                {
                    "sent": "These major breakthroughs are more likely to occur.",
                    "label": 0
                },
                {
                    "sent": "They are least likely to occur as you have more, an more diversity.",
                    "label": 0
                },
                {
                    "sent": "If you remember I was talking bout hyper diversity and as you have less and less communication across different fields of science, so in one sense this is the kind of crude cartoon of a good bit of our findings.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Scientific disciplines are always changing, and it's sort of interesting.",
                    "label": 0
                },
                {
                    "sent": "The World of Science today has become extremely competitive.",
                    "label": 0
                },
                {
                    "sent": "Just to make a comment.",
                    "label": 0
                },
                {
                    "sent": "And I study a lot of scientists who are after what I call big game.",
                    "label": 0
                },
                {
                    "sent": "I mean, they really are extraordinary in competitive Anna's fields of science becomes more and more advanced and more and more competitive.",
                    "label": 0
                },
                {
                    "sent": "Scientists are increasingly reluctant to share their results.",
                    "label": 0
                },
                {
                    "sent": "This is in the not in all fields, but in the basic biomedical scientist to large extent in many fields and natural scientists.",
                    "label": 0
                },
                {
                    "sent": "That is, those who are really after the big game and.",
                    "label": 0
                },
                {
                    "sent": "I'm calling about this Nobel business and the major rewards.",
                    "label": 0
                },
                {
                    "sent": "And like once a scientific field, begins to mature.",
                    "label": 0
                },
                {
                    "sent": "Scientists are not so willing to cooperate one another.",
                    "label": 0
                },
                {
                    "sent": "There's a high degree of secrecy, an even in applying for research grants, or even in publishing papers.",
                    "label": 0
                },
                {
                    "sent": "Scientists are often reluctant to share too much of what they're doing because they don't want their competitors to get the latest information, and so, but on the other hand, they have to share enough information, say through the funding agencies.",
                    "label": 0
                },
                {
                    "sent": "Or they won't be there.",
                    "label": 0
                },
                {
                    "sent": "They research funding, but they know their competitors are among going to be among those who are reviewing their projects.",
                    "label": 0
                },
                {
                    "sent": "And I know their competitors are going to be reading their articles, but on the other hand, they also know that if a competitor say wins the Nobel Prize or something, they want to demonstrate well.",
                    "label": 0
                },
                {
                    "sent": "I was already pretty much there, so it's important that even though there is this high degree of competitiveness that people, to some extent are revealing where they are in this so called game.",
                    "label": 0
                },
                {
                    "sent": "But it's sort of interesting in the early fields.",
                    "label": 0
                },
                {
                    "sent": "Early stages of a new field.",
                    "label": 0
                },
                {
                    "sent": "It's really quite remarkable, and as you study the social interaction among scientists in the early stages of a new field, it's really quite remarkable how much cooperation and sharing and communication among people are.",
                    "label": 0
                },
                {
                    "sent": "It's like low hanging fruit.",
                    "label": 0
                },
                {
                    "sent": "I won't say it's easy, but at least with low hanging fruit it's not as difficult.",
                    "label": 0
                },
                {
                    "sent": "Or in you discover a new goldmine early on.",
                    "label": 0
                },
                {
                    "sent": "It's not that difficult to exploit some of the resources, but as you dig further and further, it becomes increasingly difficult to get the big reward.",
                    "label": 0
                },
                {
                    "sent": "So and so scientific disciplines rise and fall.",
                    "label": 0
                },
                {
                    "sent": "An in the early stages of a new field there is a high degree of sharing and cooperation, but as the field matures.",
                    "label": 0
                },
                {
                    "sent": "The fields become much more competitive.",
                    "label": 0
                },
                {
                    "sent": "There is less communication and sharing that is less.",
                    "label": 0
                },
                {
                    "sent": "Sharing among potential competitors and then finally a field shorter dies out now.",
                    "label": 0
                },
                {
                    "sent": "So for an organization that wants to make major discoveries, time and time again well.",
                    "label": 1
                },
                {
                    "sent": "Then the organization has to be able to.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To move in to adapt and be prepared to move in another field an overtime and yet another field.",
                    "label": 0
                },
                {
                    "sent": "So because academic or scientific fuels are rising and declining, an rising and declining and the like and you will see that in a few minutes that among those few organizations that have had these major discoveries, time and time again.",
                    "label": 1
                },
                {
                    "sent": "Part of it is that they had been able to move into different fields.",
                    "label": 0
                },
                {
                    "sent": "They have been really innovators at the fundamental frontiers of science.",
                    "label": 0
                },
                {
                    "sent": "Let me.",
                    "label": 0
                },
                {
                    "sent": "Elaborate a little on some of these so let me talk to you briefly about some organizations that have had multiple breakthroughs.",
                    "label": 0
                },
                {
                    "sent": "Ann measure fields of science.",
                    "label": 0
                },
                {
                    "sent": "And as I say, these are really rare events and.",
                    "label": 0
                },
                {
                    "sent": "Over these four countries and across the 20th century, now I used to as I will ask this question and that is what organization do you think worldwide?",
                    "label": 0
                },
                {
                    "sent": "Made more major breakthroughs in basic biomedical science over the last 20 century and I used to tell my audience.",
                    "label": 0
                },
                {
                    "sent": "If you can name that organization I will host you to a dinner of your choice anywhere in the world.",
                    "label": 0
                },
                {
                    "sent": "Never logs that big, but now I've published a fair amount and they don't make it anymore because some people there are number of people who know the answer, but it's sort of interesting.",
                    "label": 0
                },
                {
                    "sent": "The one organization that's had more major breakthroughs as I define major breakthroughs than any other in the world in the 20th century is a small organization in the United States, and most Americans have never heard of it.",
                    "label": 0
                },
                {
                    "sent": "This is Rockefeller University.",
                    "label": 0
                },
                {
                    "sent": "Rockefeller University is a relatively small organization.",
                    "label": 0
                },
                {
                    "sent": "It has no departments, no departments.",
                    "label": 1
                },
                {
                    "sent": "It has 70 laboratories, and they all report to a single president.",
                    "label": 0
                },
                {
                    "sent": "Now, if you remember.",
                    "label": 0
                },
                {
                    "sent": "A few minutes ago.",
                    "label": 0
                },
                {
                    "sent": "When?",
                    "label": 0
                },
                {
                    "sent": "It is I talked for a few minutes.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On a few of these organizations, keep this slide in mind so the Rockefeller is relatively small, but unlike these Max Planck Institutes and was talking about, they do have a moderate and high degree of scientific diversity, an historically they have had a.",
                    "label": 0
                },
                {
                    "sent": "The scientist they recruited invariably are scientists who internalize a great deal of scientific diversity.",
                    "label": 1
                },
                {
                    "sent": "There's a kind of self selection that takes place in the world of science.",
                    "label": 0
                },
                {
                    "sent": "I'm for many years I have spent my career at the University of Wisconsin.",
                    "label": 0
                },
                {
                    "sent": "This is this is a huge Amber City.",
                    "label": 0
                },
                {
                    "sent": "Is largest University here in new Byana, but it's a huge University with large numbers of academic departments and.",
                    "label": 0
                },
                {
                    "sent": "The scientist in them are quite good, but they are highly specialized.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "What happens is just take the field in neuroscience, for example, University, Wisconsin.",
                    "label": 0
                },
                {
                    "sent": "Madison has approximately 250 scientists who worked in neuroscience.",
                    "label": 0
                },
                {
                    "sent": "An many of them are quite good.",
                    "label": 0
                },
                {
                    "sent": "But then there is a relatively small organization in La Jolla, CA.",
                    "label": 0
                },
                {
                    "sent": "The Salk Institute they have over the years had maybe 10 scientists working in neuroscience, but but in the late 80s, if you looked at citation indices, the Salk Institute was right at the top among organizations in the world and in citation counts in Neuroscience, University of Wisconsin with many more.",
                    "label": 0
                },
                {
                    "sent": "The scientist in your science doing pretty well publishing a lot, was ranked very low in citation count.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "How do you account for that?",
                    "label": 0
                },
                {
                    "sent": "Well, the fact is that sunk Institute is a small organization and the people interact a great deal.",
                    "label": 0
                },
                {
                    "sent": "And the kinds of papers they published are in journals in which people in all kinds of fields.",
                    "label": 0
                },
                {
                    "sent": "We'd maybe the British general nature, or the American general science.",
                    "label": 0
                },
                {
                    "sent": "But generals that are read by people in many fields, whereas in many of these big universities which are quite good, they published in much more highly specialized journals.",
                    "label": 0
                },
                {
                    "sent": "They're not read.",
                    "label": 0
                },
                {
                    "sent": "The papers are not read very much by people outside the highly specialized journals.",
                    "label": 0
                },
                {
                    "sent": "So then in place like the Rockefeller, these individual scientists do internalize a good bit of diversity, and they do have a high degree of communication.",
                    "label": 0
                },
                {
                    "sent": "An interaction among them.",
                    "label": 0
                },
                {
                    "sent": "Let me just give you one story.",
                    "label": 0
                },
                {
                    "sent": "That sort of tells you a lot about the culture of Rockefeller University.",
                    "label": 0
                },
                {
                    "sent": "It's a small place and some many years ago they had a.",
                    "label": 0
                },
                {
                    "sent": "What they call a Journal club, but it was the German club met in the evening and they had a fairly good dinner and nothing elaborate in this.",
                    "label": 0
                },
                {
                    "sent": "Club and remember that a good many a number of these people were Nobel laureate, so some of the world's most distinguished scientists, and so.",
                    "label": 0
                },
                {
                    "sent": "At this Journal Club they would always have two or three presentations by one of the members of the faculty, and these were the norms.",
                    "label": 0
                },
                {
                    "sent": "The person who presided.",
                    "label": 0
                },
                {
                    "sent": "I would call on two or three of these signs to make a presentation, but no one ever knew in advance who was going to be called upon.",
                    "label": 0
                },
                {
                    "sent": "Even the people who were making the presentation.",
                    "label": 0
                },
                {
                    "sent": "They didn't know whether they would be called upon an yet.",
                    "label": 0
                },
                {
                    "sent": "Here they are in the presence of these really world class scientist.",
                    "label": 0
                },
                {
                    "sent": "The second point was one always had to be prepared to give a presentation.",
                    "label": 0
                },
                {
                    "sent": "Outside 1 field of working, it's an on a relatively on a recently developing project and so forth.",
                    "label": 0
                },
                {
                    "sent": "Now why would people at Rockefeller do this?",
                    "label": 0
                },
                {
                    "sent": "Partly because they were.",
                    "label": 0
                },
                {
                    "sent": "They knew they were pretty good and they knew that one of the reasons they were pretty good was their capacity to read journals across many fuels and to communicate with their colleagues that there was often a lot of rivalry.",
                    "label": 0
                },
                {
                    "sent": "And it's not that these people remember.",
                    "label": 0
                },
                {
                    "sent": "You know, living friends of each other, but but there was a high degree of communication.",
                    "label": 0
                },
                {
                    "sent": "This kind of interaction and also at the lunch table.",
                    "label": 0
                },
                {
                    "sent": "It's really quite remarkable that some of these very small places that perform extraordinarily well.",
                    "label": 0
                },
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "It's sort of amazing that is eating together, but usually around tables that serve only 6 to 8 people so that you can have people in diverse fields, but you can have a single conversation at these, and often in some of these organizations at the Rockefeller at another which.",
                    "label": 0
                },
                {
                    "sent": "Touch on is the discount tag and Californians to technology in Pasadena, CA.",
                    "label": 0
                },
                {
                    "sent": "There's another one of these organizations that has made major registers time and time again.",
                    "label": 0
                },
                {
                    "sent": "Again, the lunch table has been very important.",
                    "label": 0
                },
                {
                    "sent": "We're often newfields have emerged over the lunch table.",
                    "label": 0
                },
                {
                    "sent": "People carrying on informal conversations or another place in Europe.",
                    "label": 0
                },
                {
                    "sent": "We are in the 1980s.",
                    "label": 0
                },
                {
                    "sent": "Three of these major discoveries of curd and remember that there are hundreds of thousands of scientists in the basic biomedical Sciences across the world.",
                    "label": 0
                },
                {
                    "sent": "But in the 1980s there was a small Institute in Basel, Switzerland.",
                    "label": 0
                },
                {
                    "sent": "It never had more than 30 scientists, no longer operating, but it never had more than 30 scientists.",
                    "label": 0
                },
                {
                    "sent": "But on three separate occasions.",
                    "label": 0
                },
                {
                    "sent": "In the 1980s, there were three Nobel Prizes awarded.",
                    "label": 0
                },
                {
                    "sent": "Now this was a relatively small organization.",
                    "label": 0
                },
                {
                    "sent": "I spent a few known some time there and it was designed like a submarine.",
                    "label": 0
                },
                {
                    "sent": "You could see down the corridor in almost every lab.",
                    "label": 0
                },
                {
                    "sent": "What was going on, and they had three floors.",
                    "label": 0
                },
                {
                    "sent": "So like respect like you're in the submarine and you could walk down and see what's going up above and they too had a common lunchroom.",
                    "label": 0
                },
                {
                    "sent": "Nothing elaborate, an quite surprisingly they put on theatrical performances on the weekend, so there is no single formula how you have this kind of social interaction.",
                    "label": 0
                },
                {
                    "sent": "But in my judgment, that was very important as to why they had.",
                    "label": 0
                },
                {
                    "sent": "These major breakthrough now so far, and as I said, there's Caltech.",
                    "label": 0
                },
                {
                    "sent": "California Institute of Technology in Pasadena.",
                    "label": 0
                },
                {
                    "sent": "Contact has only about 1200 students.",
                    "label": 0
                },
                {
                    "sent": "It's an extraordinary, high quality organization.",
                    "label": 0
                },
                {
                    "sent": "But with that kind of smaller size, they're able to interact and so forth.",
                    "label": 0
                },
                {
                    "sent": "But it doesn't happen.",
                    "label": 0
                },
                {
                    "sent": "These kinds of things only in small research organizations.",
                    "label": 0
                },
                {
                    "sent": "Let me speak now.",
                    "label": 0
                },
                {
                    "sent": "I'm briefly about two other very large organizations.",
                    "label": 0
                },
                {
                    "sent": "One is the University of California in San Francisco and by most standards today University of California, San Francisco is certainly considered among the top two organizations in the basic biomedical Sciences, and it may well be in the top two or three worldwide.",
                    "label": 0
                },
                {
                    "sent": "It's very distinguished, but if you go back to 1960 University of California, San Francisco were so bad, hardly anyone would go there.",
                    "label": 0
                },
                {
                    "sent": "Now the point I'm trying to make sure we have a number of cases where there were really not second or third rate, but even fifth rate organizations that really made a fundamental transformation.",
                    "label": 0
                },
                {
                    "sent": "Now you see SF for the emergency in California.",
                    "label": 0
                },
                {
                    "sent": "San Francisco is, by and large the large biological.",
                    "label": 0
                },
                {
                    "sent": "Medical Center and so they had a lot of clinical signs there.",
                    "label": 0
                },
                {
                    "sent": "People in medicine and surgery and light, but they had to high standards and they were really appalled by the very low standards and that existed in the basic Sciences.",
                    "label": 0
                },
                {
                    "sent": "So they decided.",
                    "label": 0
                },
                {
                    "sent": "OK, let's try to improve the quality in the basic scientist, scientist.",
                    "label": 0
                },
                {
                    "sent": "And so they went for they tried to get a new chair in biochemistry.",
                    "label": 0
                },
                {
                    "sent": "Now they offered the head or chair of Biochemistry, 210 separate scientist.",
                    "label": 0
                },
                {
                    "sent": "They had really high taste and they offered this position to quite distinguished and everyone turned it down.",
                    "label": 0
                },
                {
                    "sent": "They didn't think the place was good enough.",
                    "label": 0
                },
                {
                    "sent": "The man who finally accepted this position was a scientist by the name of Bill Rutter Rutter and returned it down.",
                    "label": 0
                },
                {
                    "sent": "And then they offered it to him again and turn it down the second time.",
                    "label": 0
                },
                {
                    "sent": "And writer tells me that finally he and his wife thought it over and they were at the University of Washington, Seattle and they said, well, let's go down to San Francisco and give this a try.",
                    "label": 0
                },
                {
                    "sent": "So they go down to San Francisco and writer is to be the new head of biochemistry.",
                    "label": 0
                },
                {
                    "sent": "The first thing he did was to bring in one of the people who had already turned down the directorship or head of this Department.",
                    "label": 0
                },
                {
                    "sent": "And this was a man by the name of Gordon Tompkins at the National Institutes of Health.",
                    "label": 0
                },
                {
                    "sent": "Bill Reiter, in his career, he had been trained in PhD, an organic chemistry.",
                    "label": 0
                },
                {
                    "sent": "He did a postdoc at the Mercer, WI in Samala G, and then went to University of Washington, Seattle and began to learn Human Genetics.",
                    "label": 0
                },
                {
                    "sent": "So here's a scientist who internalizes a good bit of scientific diversity when he brings it in Gordon's Tompkins.",
                    "label": 0
                },
                {
                    "sent": "Tompkins is one of the world's leading biochemist, and so the two of them together.",
                    "label": 0
                },
                {
                    "sent": "They they internalize a good bit of scientific diversity, and they believe all the world is full of pretty good scientists.",
                    "label": 0
                },
                {
                    "sent": "But if we're going to have a first rate Department, we have to recruit people, not only who internalize scientific diversity, but who can really work together and get along, and so they didn't think it was enough just to look at people's papers.",
                    "label": 0
                },
                {
                    "sent": "An letters of recommendation lead believe that for people really to get along and work together.",
                    "label": 0
                },
                {
                    "sent": "In the line of personal attributes and so, runner and Tompkins.",
                    "label": 0
                },
                {
                    "sent": "Whenever they recruiting a more advanced scientists they would go and spend 3 days at the Scientist Institute because they wanted to see how do they interact with their colleagues with their students, their postdocs and like now the looking ahead jumping ahead of the story within 12 years that Department had become the Premier Department in biochemistry in the world but not.",
                    "label": 0
                },
                {
                    "sent": "Only did it become Premier in biochemistry.",
                    "label": 0
                },
                {
                    "sent": "Another thing the first one of the first things they did was to change the name of biochemistry to the Department of Biochemistry and Biophysics, and then presume they added a section in genetics.",
                    "label": 0
                },
                {
                    "sent": "But what finally happened at the University of California, San Francisco?",
                    "label": 0
                },
                {
                    "sent": "They abolished oh, basic Biological Sciences, and they became integrated, and so pretty soon.",
                    "label": 0
                },
                {
                    "sent": "They were so good that all the teaching faculty wanted to sit one of the problems began with all the teaching faculty wanted to sit in each other's lectures, and pretty soon they were having the schedule lectures at night to accommodate everyone's schedule and so, for all practical purposes, we now have in a large, relatively large University a good bit of scientific diversity.",
                    "label": 0
                },
                {
                    "sent": "An interesting enough this place that had not been very good.",
                    "label": 0
                },
                {
                    "sent": "In the early 60s, pretty soon was beginning to have a number of Nobel Prizes.",
                    "label": 0
                },
                {
                    "sent": "The later the president of the National Academy of Sciences in United States with a professor there and it really got done trying this form.",
                    "label": 0
                },
                {
                    "sent": "Now in my own University University, Wisconsin.",
                    "label": 0
                },
                {
                    "sent": "As I've already told you, this is a big University fragmented into different sizes, but one of the things the University Wisconsin did.",
                    "label": 0
                },
                {
                    "sent": "They created 2 research institutes at the University of Wisconsin.",
                    "label": 0
                },
                {
                    "sent": "Now all universities have research institutes and most research institutes people are a member of an Institute, but they also at least in in many universities.",
                    "label": 0
                },
                {
                    "sent": "The people not only are a member of the Institute, but their primary appointment is in a disciplinary based Department and the major rewards come through department's, that is, promotions, salaries.",
                    "label": 0
                },
                {
                    "sent": "It's not like here in Slovenia.",
                    "label": 0
                },
                {
                    "sent": "There's a kind of market mentality or practice that goes on and everyone's salary is different and so forth.",
                    "label": 0
                },
                {
                    "sent": "So the rewards really flow through Department.",
                    "label": 0
                },
                {
                    "sent": "But what Wisconsin did was create these two institutes and the people in them did not have appointments in departments, and these institutes were highly disciplinary and each of these.",
                    "label": 1
                },
                {
                    "sent": "Institute had not necessarily a very distinguished scientist, but leaders heads on them who could integrate scientific diversity.",
                    "label": 0
                },
                {
                    "sent": "Each of these institutes with relatively small.",
                    "label": 0
                },
                {
                    "sent": "They had a capacity to understand the direction in which science is moving and they were able to provide a kind of nurturing environment.",
                    "label": 1
                },
                {
                    "sent": "Well, actually it's sort of interesting that in this huge University and University, which constant 2 Nobel Prizes came out of that Institute, one was in the.",
                    "label": 0
                },
                {
                    "sent": "One Institute with the McArdle Cancer Institute and the other was the Institute for Entomology, just too.",
                    "label": 0
                },
                {
                    "sent": "More about the one organization.",
                    "label": 0
                },
                {
                    "sent": "The McConnell Institute for Cancer Research, a scientist by the name of Howard, Tim and TMIN, Tim, and was awarded the Nobel Prize around 1970.",
                    "label": 0
                },
                {
                    "sent": "Four 75 Tim and went to Wisconsin as a young scientist from Caltech.",
                    "label": 0
                },
                {
                    "sent": "An he was appointed in the McArdle Institute and Tim was one of these people who was willing to take high risk and the director of the Institute as I said, was not a great scientist, but he had a sense of direction in which science was moving.",
                    "label": 0
                },
                {
                    "sent": "He was able to recruit young talent and nurture it in the light and everybody for some years thought Tim was a bit crazy.",
                    "label": 0
                },
                {
                    "sent": "I was wondering these young scientist who was willing to take high risk.",
                    "label": 0
                },
                {
                    "sent": "We have what's called academic tenure in the United States and after about six years.",
                    "label": 0
                },
                {
                    "sent": "University is either award you tenure or they don't, and if they don't, you have to leave now.",
                    "label": 0
                },
                {
                    "sent": "I've often thought in Timmins case that had Tim and been in one of the leading biology departments in their states, whether it was at Harvard, wherever he probably would not have been given academic tenure because people just Tim and was.",
                    "label": 0
                },
                {
                    "sent": "Doing good research, and indeed there was a major conference at the National Institutes of Health.",
                    "label": 0
                },
                {
                    "sent": "Before Kim and was awarded the Nobel Prize and an A presentation was made that was related to Timmins Research and the presenter.",
                    "label": 0
                },
                {
                    "sent": "At the end, somebody said, well, you didn't mention Howard Timmons work at Wisconsin and the presenter said I gave it is not much attention as it deserves.",
                    "label": 0
                },
                {
                    "sent": "In other words, it didn't deserve any intention.",
                    "label": 1
                },
                {
                    "sent": "Timlin, however, published a couple of very pathbreaking papers in 1970 and within four years he was awarded the Nobel Prize.",
                    "label": 0
                },
                {
                    "sent": "Now this is an example of what can happen in a very large research University in which you have a small Institute with a the right kind of leadership and you have this scientific diversity and someone who will have the capacity to nurture.",
                    "label": 0
                },
                {
                    "sent": "An Tillman was protected if you will by this director at the McArdle.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "Let me move along quickly.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What are the things I want to make in in my concluding comments are not very encouraging.",
                    "label": 0
                },
                {
                    "sent": "Their disturbing to me they ought to be disturbing in one sense to the world of science.",
                    "label": 0
                },
                {
                    "sent": "If we look globally over some years what we've had in virtually all fields are certainly in all fields of the natural Sciences.",
                    "label": 0
                },
                {
                    "sent": "We for seven years had.",
                    "label": 0
                },
                {
                    "sent": "Countries spending an increased percentage of their gross national product for research and development.",
                    "label": 1
                },
                {
                    "sent": "We had more and more people going into science.",
                    "label": 0
                },
                {
                    "sent": "Obviously, there's an upper limit to how many people can go into the field of science, because if this were increasing exponentially, eventually everyone would be a scientist.",
                    "label": 0
                },
                {
                    "sent": "Is another amendment as to how many people can go into science?",
                    "label": 0
                },
                {
                    "sent": "So we've had over the last 3540 years.",
                    "label": 0
                },
                {
                    "sent": "Is increasing on a trend and that is some what level of some countries spend a bit more of a percent of their GNP and then others.",
                    "label": 0
                },
                {
                    "sent": "But there's not a high degree of variability among the highly industrialized countries, but the thing that is really very interesting is that.",
                    "label": 1
                },
                {
                    "sent": "The number of scientific journals has been growing almost exponentially, and the number of scientific papers published annually has been growing enormously.",
                    "label": 0
                },
                {
                    "sent": "The organization called ISI tracks the citation indices.",
                    "label": 0
                },
                {
                    "sent": "Sid are the leading 5000 maybe 5200 academic scientific journals in the world, but there are approximately 100,000.",
                    "label": 0
                },
                {
                    "sent": "Academic scientific journals in the world at large an of those that are tracked by ISI.",
                    "label": 0
                },
                {
                    "sent": "Approximately 50% practically 50% of all the papers published in this more elite set of population of better generals are never cited.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry, never cited or cited, only once, so this is interesting.",
                    "label": 0
                },
                {
                    "sent": "That and yet at the same time the world is producing more and more scientists.",
                    "label": 0
                },
                {
                    "sent": "If you look, say, at the United States, or whether it's Germany or Britain or what have you, and I suspect it's similar here in Slovenia.",
                    "label": 0
                },
                {
                    "sent": "In the career of a more senior professor, one is likely over the years to have trained at least 15 or 20.",
                    "label": 0
                },
                {
                    "sent": "Scientists so we are turning out if you will.",
                    "label": 0
                },
                {
                    "sent": "More and more scientists across the globe, and as you have more and more scientists across the globe, they're producing more and more papers which encourages the world of science to have more and more academic journals and the light and then one of the things that begins to happen.",
                    "label": 0
                },
                {
                    "sent": "Is that there is increasing competition for funds and this we're finding all over the world, so this is not a good time to be a young scientist competing.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For research grants, an universities are competing for more and more research grants.",
                    "label": 0
                },
                {
                    "sent": "It becomes increasingly difficult.",
                    "label": 0
                },
                {
                    "sent": "It becomes very, very competitive.",
                    "label": 0
                },
                {
                    "sent": "An if in some countries in which its individuals who are applying for research is not only difficult for them, but as we begin to have more and more scientists, even senior scientist who are applying for grants, it becomes increasingly difficult to be funded.",
                    "label": 0
                },
                {
                    "sent": "For example, in one of my interviews.",
                    "label": 0
                },
                {
                    "sent": "And was with a quite a distinguished scientist at Harvard University, a man by the name of Walter Gilbert.",
                    "label": 0
                },
                {
                    "sent": "Now Gilbert was awarded the Nobel Prize in chemistry seven years ago, and Gilbert is a kind of fantastic man.",
                    "label": 0
                },
                {
                    "sent": "He was trained in mathematics at Harvard as an undergraduate.",
                    "label": 0
                },
                {
                    "sent": "Then he went to the University of Cambridge and received a PhD, and he crossed his fields.",
                    "label": 0
                },
                {
                    "sent": "He went to Cambridge in England, University of Cambridge in England.",
                    "label": 0
                },
                {
                    "sent": "He received a PhD in physics.",
                    "label": 0
                },
                {
                    "sent": "He returns to Harvard and begins a young man to to be in the chemistry Department at Harvard so you can see he's changing fuels and like and then he decides on, you know, I don't really like chemistry and physics, so we moved into biology and we could never have done that in the German scene where there is the ability types young here is Gilbert and into the American environment where there is this relatively weak institutional environment and so Gilbert.",
                    "label": 0
                },
                {
                    "sent": "Moves into biology an he will later be awarded the Nobel Prize, but the point I'm about to make is that Gilbert tells me that Indian manage states that at least 50 percent, 50% of the time when he submits a research grant, he's turned down.",
                    "label": 0
                },
                {
                    "sent": "Now this is really quite interesting because from my perspective, everything that Gilbert has ever touched in science turns to gold.",
                    "label": 0
                },
                {
                    "sent": "And yet.",
                    "label": 0
                },
                {
                    "sent": "He always does high risk research, but when he applies to these granting agencies in which there are so-called specialists reviewing the grant proposals.",
                    "label": 0
                },
                {
                    "sent": "His research or his proposals are viewed as well because you have so many people who are competent and so many people doing research is not so high risk and it's easier to make some judgments about watch like it happen.",
                    "label": 0
                },
                {
                    "sent": "But here is one of the world's most creative and distinguished scientist.",
                    "label": 0
                },
                {
                    "sent": "But in America we need applies to the National Institutes of Health or National Science Foundation.",
                    "label": 0
                },
                {
                    "sent": "He is turned down about.",
                    "label": 0
                },
                {
                    "sent": "50% of more over all of these people who we've interviewed among some of the most distinguished scientist in the world in United States.",
                    "label": 0
                },
                {
                    "sent": "A high percentage tell us that they spend almost 30% of their time attempting to raise money.",
                    "label": 0
                },
                {
                    "sent": "That's a little misleading because in order to write a good grant proposal for a really good proposal, you already have to have done a good bit of research in the field.",
                    "label": 0
                },
                {
                    "sent": "Order to impress the granting agencies that research committees and the like, but people are spending an extraordinary amount of time.",
                    "label": 0
                },
                {
                    "sent": "Raising money, so I find this somewhat discouraging study because there are these diminishing returns in science we have, we are training more and more scientists and.",
                    "label": 1
                },
                {
                    "sent": "It and more and more papers and more and more papers not being read by anyone, so it's a.",
                    "label": 0
                },
                {
                    "sent": "Difficult moment, let me find your say.",
                    "label": 0
                },
                {
                    "sent": "That once more, my wife has really been a major contribu.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here to this project she's published a number of papers with me.",
                    "label": 0
                },
                {
                    "sent": "I become somewhat tearful because.",
                    "label": 0
                },
                {
                    "sent": "These people have invested so much time and energy this man David Gear gave it his work for me for 10 years.",
                    "label": 1
                },
                {
                    "sent": "David is.",
                    "label": 0
                },
                {
                    "sent": "Maybe stupidly.",
                    "label": 0
                },
                {
                    "sent": "Highly committed to me, David not only has worked for me for 10 years, but he's on call.",
                    "label": 0
                },
                {
                    "sent": "Seven days a week, 24 hours a day.",
                    "label": 0
                },
                {
                    "sent": "We talk from Ljubljana to wiscconsin almost every day of the week.",
                    "label": 0
                },
                {
                    "sent": "We have some low price telephone services from the US to Europe.",
                    "label": 0
                },
                {
                    "sent": "It caused about five or six cents a minute.",
                    "label": 0
                },
                {
                    "sent": "So David is just a wonderful person.",
                    "label": 0
                },
                {
                    "sent": "And without the help of a number of these people, we could not do.",
                    "label": 0
                },
                {
                    "sent": "I could not do the really labor intensive research, so I'm very grateful to them.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much or just for his great electric.",
                    "label": 0
                },
                {
                    "sent": "Any comments questions?",
                    "label": 0
                },
                {
                    "sent": "Sure, France money from the back of your service.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First, thanks very much for your very interesting lecture and.",
                    "label": 0
                },
                {
                    "sent": "Well, I'm very glad to listen you.",
                    "label": 0
                },
                {
                    "sent": "I thought I'd like say your letter would be instructive for the people who are created research policies for women.",
                    "label": 0
                },
                {
                    "sent": "Some sense.",
                    "label": 0
                },
                {
                    "sent": "Because because you're presented very well, how important are not only this formal procedure to create something in science and science achievement?",
                    "label": 0
                },
                {
                    "sent": "Of course, for Sabrina is difficult to talk now.",
                    "label": 0
                },
                {
                    "sent": "So that we can create maybe.",
                    "label": 0
                },
                {
                    "sent": "Prize is but you present that we can measure this week achievement also with some other indicators.",
                    "label": 0
                },
                {
                    "sent": "In that sense, I would really say it would be interesting to to have this public lecture for the people who have big influence easily cause sometimes in Slovenia it's wrong understanding or even useful as you present it as whole difficulties.",
                    "label": 0
                },
                {
                    "sent": "Procreative items to come to this to this.",
                    "label": 0
                },
                {
                    "sent": "Big achievements in that sense, I would ask you.",
                    "label": 0
                },
                {
                    "sent": "Hello, how do you assess now this endeavors in Europe?",
                    "label": 0
                },
                {
                    "sent": "Oh historical is for instance rather ask you mentioned in this venue amazes comparability between German.",
                    "label": 0
                },
                {
                    "sent": "For instance, Max Planck Institute for this particular case in United States, it is interesting history United State in Sensors or America already imported in good sense.",
                    "label": 0
                },
                {
                    "sent": "Or this experience from German?",
                    "label": 0
                },
                {
                    "sent": "If we went back to end of 19 century when you're in some sense adopted gumballs system and you use them your code I said destroy this.",
                    "label": 0
                },
                {
                    "sent": "This comparative structure of scientific organization in Germany.",
                    "label": 0
                },
                {
                    "sent": "It's very lonely this pre models or denials or auto clicker Professoren seat and then after that.",
                    "label": 0
                },
                {
                    "sent": "Who created this Department system?",
                    "label": 0
                },
                {
                    "sent": "You know?",
                    "label": 0
                },
                {
                    "sent": "Again, as I understood your electric step further in this regard, 'cause the big the best results in the smallest no more important Department.",
                    "label": 0
                },
                {
                    "sent": "But this informer.",
                    "label": 0
                },
                {
                    "sent": "Crisis of scientists.",
                    "label": 0
                },
                {
                    "sent": "Then, of course, this flexible talking and I would ask you which impacts Europe.",
                    "label": 0
                },
                {
                    "sent": "Careful this mother or is still too much by the traffic even at the level of European Union we know that we now have this European Research Council and the big talking through Europe.",
                    "label": 0
                },
                {
                    "sent": "We should now be cause he before that it was too much.",
                    "label": 0
                },
                {
                    "sent": "Say that sounds really application.",
                    "label": 0
                },
                {
                    "sent": "Now we're opening up again.",
                    "label": 0
                },
                {
                    "sent": "It seems that we need again this something basic.",
                    "label": 0
                },
                {
                    "sent": "That's a problem, you know.",
                    "label": 0
                },
                {
                    "sent": "I love.",
                    "label": 0
                },
                {
                    "sent": "United States Army.",
                    "label": 0
                },
                {
                    "sent": "It's still for America.",
                    "label": 0
                },
                {
                    "sent": "Welcome at his head community one step further in regards to Sister institution organization.",
                    "label": 0
                },
                {
                    "sent": "Let me speak to several of the questions you raise.",
                    "label": 0
                },
                {
                    "sent": "First, bomb academic institutions, in my judgment, are inherently quite conservative.",
                    "label": 0
                },
                {
                    "sent": "They are slow to change.",
                    "label": 0
                },
                {
                    "sent": "Just compare a.",
                    "label": 0
                },
                {
                    "sent": "A University with the military organizations.",
                    "label": 0
                },
                {
                    "sent": "Military organizations are driven very much by changes in technology and they really change rather rapidly across time.",
                    "label": 0
                },
                {
                    "sent": "Now, universities are really inherently quite conservative, and that's across the world.",
                    "label": 0
                },
                {
                    "sent": "In my judgment, an SEC.",
                    "label": 0
                },
                {
                    "sent": "Universities have tended to grow and become more and more larger, and his new knowledge advances.",
                    "label": 0
                },
                {
                    "sent": "We have greater and greater numbers of departments, and then it's very rare that departments get closed down.",
                    "label": 0
                },
                {
                    "sent": "There are some interesting examples in our research, the Karolinska Institute, where the Nobel Prize in Physiology or Medicine are awarded.",
                    "label": 0
                },
                {
                    "sent": "Few years ago, they closed down 17 department's.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because they found it really desirable to try to integrate the fields.",
                    "label": 0
                },
                {
                    "sent": "University, California, Berkeley?",
                    "label": 0
                },
                {
                    "sent": "One of the great universities in the world.",
                    "label": 0
                },
                {
                    "sent": "They were not.",
                    "label": 0
                },
                {
                    "sent": "They discovered by my criterion, like they were not performing so well, but they had a large number of different departments in the Biological Sciences, and they closed many of them down 2nd.",
                    "label": 0
                },
                {
                    "sent": "So it is possible, but it requires strong leadership.",
                    "label": 0
                },
                {
                    "sent": "And visionary leaders.",
                    "label": 0
                },
                {
                    "sent": "It's not easy.",
                    "label": 0
                },
                {
                    "sent": "Depends on the governance structure and the like.",
                    "label": 0
                },
                {
                    "sent": "Anna University.",
                    "label": 0
                },
                {
                    "sent": "Whether that can happen.",
                    "label": 0
                },
                {
                    "sent": "The second point, I would like to make though in This is why I think the example of the University was constant.",
                    "label": 0
                },
                {
                    "sent": "Model is worth noting and it's not only at the University of Wisconsin where that I could tell you where this is happening.",
                    "label": 0
                },
                {
                    "sent": "It is possible for a large University to create some small institutes.",
                    "label": 0
                },
                {
                    "sent": "That have a high degree of flexibility.",
                    "label": 0
                },
                {
                    "sent": "Indeed, it's been one of the things we have noticed in our research is that.",
                    "label": 0
                },
                {
                    "sent": "I knew organizations often have greater capacity to adapt to what's going on in the world than older organizations, but also, it's also when you can create a new Institute within an older organization.",
                    "label": 0
                },
                {
                    "sent": "It is possible to.",
                    "label": 0
                },
                {
                    "sent": "Really, leap forward an be up with the rest of now why am I out here and will be honored?",
                    "label": 0
                },
                {
                    "sent": "Be cause I had this idea two or so years ago, that one of the major problems of our time is to study rare events.",
                    "label": 0
                },
                {
                    "sent": "There is no other University that is really concentrating on the study of rare events across a large number of fields, and we had a conference last year and I was able to bring some very distinguished scientist here.",
                    "label": 0
                },
                {
                    "sent": "One work.",
                    "label": 0
                },
                {
                    "sent": "One is great Britain's.",
                    "label": 0
                },
                {
                    "sent": "Leading Earth scientist who works on Earthquake, San and another was one of the world's leading people in the.",
                    "label": 0
                },
                {
                    "sent": "Crash in financial markets and and one of the things is that we wanted to look at rare events across many different fields and there are a lot of similarities, so I the first time I came to lubiana I still remember it very distinctly.",
                    "label": 0
                },
                {
                    "sent": "I had dinner in the first night with Doctor Demshar.",
                    "label": 0
                },
                {
                    "sent": "Many of you know of Doctor Demshar who is head of the sleeping in Research Council and I.",
                    "label": 0
                },
                {
                    "sent": "Leader had several conversations with with the.",
                    "label": 0
                },
                {
                    "sent": "The problem is Slovenia has in fact I really get very interested in.",
                    "label": 0
                },
                {
                    "sent": "Organizations that are not necessarily performing so well globally because they're the ones who could take big risk, is those that think we're doing so well.",
                    "label": 0
                },
                {
                    "sent": "They become very inbred and there's a lot of organizational inertia.",
                    "label": 0
                },
                {
                    "sent": "I think looking at.",
                    "label": 0
                },
                {
                    "sent": "Slovenia on a worldwide scale.",
                    "label": 0
                },
                {
                    "sent": "I think there are some opportunities for a small country.",
                    "label": 0
                },
                {
                    "sent": "Do some things and because in a country the size of the United States science has become so large and so competitive in the light.",
                    "label": 0
                },
                {
                    "sent": "And it's very difficult to get to the people at the top.",
                    "label": 0
                },
                {
                    "sent": "So I'm optimistic of the potential of some small countries.",
                    "label": 0
                },
                {
                    "sent": "Now coming to another point I had with my wife and I call Mueller, we published a January coauthor in this nature paperwork.",
                    "label": 0
                },
                {
                    "sent": "We had a paper in nature in July, which is, you know, I think it is.",
                    "label": 0
                },
                {
                    "sent": "I'd be very proud to have that paper in there because I consider it the world's most prestigious Science Journal and it was about what I call hegemonic.",
                    "label": 0
                },
                {
                    "sent": "Science and the argument we made that if we look at over the last 250 years in the late 18th and early 19th centuries, France was the leading scientific power.",
                    "label": 0
                },
                {
                    "sent": "If you will, on the world and then the leadership passed Germany and eventually to Great Britain, and ultimately by the end of the second quarter the United States.",
                    "label": 0
                },
                {
                    "sent": "If you look at each of those countries at the height of their.",
                    "label": 0
                },
                {
                    "sent": "Scientific hegemony if you will, each one is a great power.",
                    "label": 0
                },
                {
                    "sent": "Each of these countries was performing extraordinarily well and US has been in great power, but its power, politically, militarily and economically, is now declining relative to the rest of the world.",
                    "label": 0
                },
                {
                    "sent": "You is still pretty significant power.",
                    "label": 0
                },
                {
                    "sent": "Militarily, economically, but its power is declining and one of the things we pointed out in our article that the scientific hegemony of the United States.",
                    "label": 0
                },
                {
                    "sent": "We can expect it, therefore, to begin declining.",
                    "label": 0
                },
                {
                    "sent": "Now one of the things that I argued in that paper is there is not likely that we will have over the next several decades another scientific hedgeman what I think we will have.",
                    "label": 0
                },
                {
                    "sent": "Increasingly is more an more networks among scientists across the world.",
                    "label": 0
                },
                {
                    "sent": "We already see that more Europeans are willing to go and do research in Singapore and South Korea and Taiwan and the People's Republic of China.",
                    "label": 0
                },
                {
                    "sent": "And we see this increasing mobility and people are reading the same scientific journals and we're having, I mean, in a sense, when we talk about globalization.",
                    "label": 0
                },
                {
                    "sent": "What globalization means in some respects is a kind of increasing standardization of what is excellent across the world, so I don't see another scientific hedgeman coming on the scene for several decades, but I really do think there is potential for greater cooperation among scientists.",
                    "label": 0
                },
                {
                    "sent": "Greater communication among scientists across the world, but I think it's very important that.",
                    "label": 0
                },
                {
                    "sent": "The young scientist in Slovenia, the young scholar in Slovenia, had opportunity to go and interact with people elsewhere and with the.",
                    "label": 0
                },
                {
                    "sent": "European Union and the Bologna process.",
                    "label": 0
                },
                {
                    "sent": "In the light.",
                    "label": 0
                },
                {
                    "sent": "I looking forward, smart, more optimistic of what the prospects are for Europe and these European countries over the next 30 years and was the case in the last 30 years.",
                    "label": 0
                },
                {
                    "sent": "Now maybe I'm an eternal optimist about and I do think of you know, what is the potential for changing the world?",
                    "label": 0
                },
                {
                    "sent": "And sometimes I'm a bit optimistic.",
                    "label": 0
                },
                {
                    "sent": "Some of my critics tell me.",
                    "label": 0
                },
                {
                    "sent": "So I believe in taking big risk and the people who take big risk, you know they fail what we really want.",
                    "label": 0
                },
                {
                    "sent": "And then they say it's one of the interesting traits about the United States.",
                    "label": 0
                },
                {
                    "sent": "Historically, it has had a culture in which it encourages people to take big risks, I know.",
                    "label": 0
                },
                {
                    "sent": "Chief executives of similar largest companies in America, and often when they hire someone if they have failed at something.",
                    "label": 0
                },
                {
                    "sent": "Those are the people they want because they have had experience in failing.",
                    "label": 0
                },
                {
                    "sent": "It's those who've never failed and who are often very arrogant.",
                    "label": 0
                },
                {
                    "sent": "But there's nothing wrong with failing one of the greatest scientist the United States produced in the 20th century with a man by the name of God Linus Pauling.",
                    "label": 0
                },
                {
                    "sent": "At Caltech one, certainly the leading perhaps of the chemist of the last century.",
                    "label": 0
                },
                {
                    "sent": "I never met calling, but I studied him so closely and calling my first name, Linus.",
                    "label": 0
                },
                {
                    "sent": "Language was willing to take big risks and hit what we call in baseball.",
                    "label": 0
                },
                {
                    "sent": "A lot of home runs, but he struck out the numbers.",
                    "label": 0
                },
                {
                    "sent": "He was a man willing to take big risks.",
                    "label": 0
                },
                {
                    "sent": "An I think it's important in science that people are encouraged to fail and they not be beaten up and destroyed for failing, but they need to be nurtured with high standards.",
                    "label": 0
                },
                {
                    "sent": "You can't let someone fell forever.",
                    "label": 0
                },
                {
                    "sent": "But we should encourage more people in my opinion, to take risk.",
                    "label": 0
                },
                {
                    "sent": "Sure, yes.",
                    "label": 0
                },
                {
                    "sent": "My name is clinical store, separated social Sciences.",
                    "label": 0
                },
                {
                    "sent": "The proposals are interesting and stimulating.",
                    "label": 0
                },
                {
                    "sent": "And then I would like to ask whether familiar with the concept of convergence in science and technology as defined by Armenians, Bainbridge and Casserole is defined by.",
                    "label": 0
                },
                {
                    "sent": "In the house here on the National Science Foundation, I don't know whether I'm familiar with that or not, but I have written over the years a good bit about convergence and divergent sunla.",
                    "label": 0
                },
                {
                    "sent": "They talk of commercial technologies or Sciences converging technologies.",
                    "label": 0
                },
                {
                    "sent": "Arise from older disciplines or Sciences, but are qualitatively different than all the disciplines, and so they also stressed the need for a price.",
                    "label": 0
                },
                {
                    "sent": "Disciplinary education for scientists or cooperation from different scientific fields which are quite far apart as necessary to form this new Sciences automated technological order on scientific breakthroughs, which is quite similar when you take the institutional approach.",
                    "label": 0
                },
                {
                    "sent": "Network fosters this.",
                    "label": 0
                },
                {
                    "sent": "So that was the first part on and I would also like to ask when you mentioned that.",
                    "label": 0
                },
                {
                    "sent": "There is an increasing number of signing papers that don't get regular science.",
                    "label": 0
                },
                {
                    "sent": "I would like to know if you have any thoughts on whether or more transdisciplinary education in scientific operating education would mitigate the problem.",
                    "label": 0
                },
                {
                    "sent": "So the researchers that.",
                    "label": 0
                },
                {
                    "sent": "They provide or systemic neuroscience with.",
                    "label": 0
                },
                {
                    "sent": "Cancel the second ones on whether you think this politicization, which will find patterns and answer whether the organization.",
                    "label": 0
                },
                {
                    "sent": "Like on computer programs or federal emissions, software will also contribute to finding similar horses or patterns between different language papers.",
                    "label": 0
                },
                {
                    "sent": "Different languages in different fields, yeah?",
                    "label": 0
                },
                {
                    "sent": "Automatisation doesn't help.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Securities.",
                    "label": 0
                },
                {
                    "sent": "Well, these are really big questions you're posing and I may not give you a very satisfactory answer, but let's begin with the first one, convergence.",
                    "label": 0
                },
                {
                    "sent": "On the one hand.",
                    "label": 0
                },
                {
                    "sent": "There really is a good bit of convergence taking place across the world.",
                    "label": 0
                },
                {
                    "sent": "When I spoke about increasing.",
                    "label": 0
                },
                {
                    "sent": "Convergence time standards across countries and people are reading the same journals and the light.",
                    "label": 0
                },
                {
                    "sent": "That's a that's one form of converging standards and in terms of what is excellent.",
                    "label": 0
                },
                {
                    "sent": "At the same time, the world is we have two opposite trends.",
                    "label": 0
                },
                {
                    "sent": "On the one hand, we have.",
                    "label": 0
                },
                {
                    "sent": "High degree of specialization and sometimes greater and greater fragmentation with more and more subspecialties going on at the same time that we have greater and greater interdisciplinarity.",
                    "label": 0
                },
                {
                    "sent": "Now I, I'm.",
                    "label": 0
                },
                {
                    "sent": "In this paper, I think that you referred to me before the talk today by myself in Carl Miller.",
                    "label": 0
                },
                {
                    "sent": "I talked a little bit and I'm writing some more about this on creativity, and I think people who are really creative, say in science they have to have done two things.",
                    "label": 0
                },
                {
                    "sent": "I think they need to be well grounded and in particular feel like kind of specificity.",
                    "label": 0
                },
                {
                    "sent": "But at the same time, one of the tricks is to have a high.",
                    "label": 0
                },
                {
                    "sent": "Range, and so there's a tradeoff.",
                    "label": 0
                },
                {
                    "sent": "If you invest too much in too much depth in a specific field.",
                    "label": 0
                },
                {
                    "sent": "Have much range and many of these scientists whom I have studied who are really highly creative.",
                    "label": 0
                },
                {
                    "sent": "They did start in a specific field.",
                    "label": 0
                },
                {
                    "sent": "I mentioned this man Norwalk, Gilbert and Gilbert starts off in mathematics and physics but then he he begins to have quite a range and so one of the problems through or really creative people.",
                    "label": 0
                },
                {
                    "sent": "I think you see we don't want to get rid of departments.",
                    "label": 0
                },
                {
                    "sent": "I think we.",
                    "label": 0
                },
                {
                    "sent": "Here sometimes in having that is scientific disciplines.",
                    "label": 0
                },
                {
                    "sent": "I think we error too much, however, often in having too much subspecialization so that people even in the same field, can't understand when I study some Department of Cardiology.",
                    "label": 0
                },
                {
                    "sent": "The people in the same in heart and vascular heart disease.",
                    "label": 0
                },
                {
                    "sent": "They can't even understand one another because each is so specialized, much less communicate with people across fields.",
                    "label": 0
                },
                {
                    "sent": "So we want to have the specialization, but not so much that people even in the same fields can understand each other.",
                    "label": 0
                },
                {
                    "sent": "And I'm sure you see sociology and like so.",
                    "label": 0
                },
                {
                    "sent": "The trick is to have.",
                    "label": 0
                },
                {
                    "sent": "So, so we do have this increasing convergence and greater interdisciplinary at the same time that in some respects we're having more and more specialization.",
                    "label": 0
                },
                {
                    "sent": "And that's just the dynamics and the way in which science is moving.",
                    "label": 1
                },
                {
                    "sent": "Now, what can we do about it?",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "So I think the major breakthroughs are indeed rare events and we can't plan.",
                    "label": 0
                },
                {
                    "sent": "We cannot specify, just we ran when they will occur.",
                    "label": 0
                },
                {
                    "sent": "But I think what I am vain enough to believe is that our research has helped us to understand where they are more likely to occur and the environments in which they are least likely to occur.",
                    "label": 1
                },
                {
                    "sent": "And I do believe that even if you have an organization.",
                    "label": 0
                },
                {
                    "sent": "By our criteria, that looks as though it's not likely to have a major breakthrough.",
                    "label": 0
                },
                {
                    "sent": "I think it's possible by creating new arrangements within the organization that has a high degree of flexibility an has the potential to make these fundamental changes.",
                    "label": 0
                },
                {
                    "sent": "You spoke something about different languages, and I wasn't certain that I quite.",
                    "label": 0
                },
                {
                    "sent": "I understood what you were saying.",
                    "label": 0
                },
                {
                    "sent": "In terms of certainly are different kinds of software, but I think I'm optimistic that we really have increasing common software and the like.",
                    "label": 0
                },
                {
                    "sent": "And I'm going to make one comment and I don't know whether it's irrelevant to your question or not.",
                    "label": 0
                },
                {
                    "sent": "And that is we have more and more people.",
                    "label": 0
                },
                {
                    "sent": "Working across fields and working across countries together.",
                    "label": 0
                },
                {
                    "sent": "So when we read.",
                    "label": 0
                },
                {
                    "sent": "You pick up the scientific journals and the leading lines.",
                    "label": 0
                },
                {
                    "sent": "You will see more and more authors in different countries.",
                    "label": 0
                },
                {
                    "sent": "One of the things that is really interesting when we look at these 325 major discoveries, which we have studied and where there are multiple authors, every single one without exception.",
                    "label": 0
                },
                {
                    "sent": "Have been people who have spent a good bit of time with one another.",
                    "label": 0
                },
                {
                    "sent": "That is, if you're working with someone in another field, there is this problem of a common language.",
                    "label": 0
                },
                {
                    "sent": "You and coming back to Bill Reader at the University of California, San Francisco, people who are in different fuels, and like if you're really talking about it fundamentally different.",
                    "label": 0
                },
                {
                    "sent": "They have to learn to speak the same language.",
                    "label": 0
                },
                {
                    "sent": "They have to be tolerant of one another so that when I'm working with someone.",
                    "label": 0
                },
                {
                    "sent": "Karl Mueller, for example, Carl is related in Vienna and he and I write papers and we come from completely different academic backgrounds.",
                    "label": 0
                },
                {
                    "sent": "But it's necessary that Carl feel comfortable in telling me that my ideas are stupid.",
                    "label": 0
                },
                {
                    "sent": "And of course I tell call some of his ideas are stupid and that we can talk openly like this.",
                    "label": 0
                },
                {
                    "sent": "And but on the Internet.",
                    "label": 0
                },
                {
                    "sent": "And when you were writing papers across countries, what is really going on is that the big breakthroughs.",
                    "label": 0
                },
                {
                    "sent": "Don't happen like that.",
                    "label": 0
                },
                {
                    "sent": "I do believe that for these big breakthroughs to occur, there has to be this kind of intense and frequent social interaction that I can look at you in the face and I can.",
                    "label": 0
                },
                {
                    "sent": "You can tell me that my ideas are really stupid and the next day and go home and I think about these things and the next day I come back and talk to you.",
                    "label": 0
                },
                {
                    "sent": "And I say, well, I thought about that and you tell me again, you know that's still stupid, but we can still.",
                    "label": 0
                },
                {
                    "sent": "Communicate, and so there's a lot of excellent research that takes place across countries and the like.",
                    "label": 0
                },
                {
                    "sent": "But it's so much of it is in more established fields and people can interact a good bit and really do good research.",
                    "label": 0
                },
                {
                    "sent": "But there really major breakthroughs and at least an hour research, requires this intense and frequent interaction.",
                    "label": 0
                },
                {
                    "sent": "It doesn't mean they have to live together all the time, but you do have to have these periodic.",
                    "label": 0
                },
                {
                    "sent": "Frequent and intense interactions.",
                    "label": 0
                },
                {
                    "sent": "At least that's what our data show.",
                    "label": 0
                },
                {
                    "sent": "The thing that's interesting.",
                    "label": 0
                },
                {
                    "sent": "So basically you are saying that it's a different kind of creativity that arises from a personal communication then that arises from other more emails or no well, depends on this is an interesting point that you're making.",
                    "label": 0
                },
                {
                    "sent": "I just gave a paper couple of weeks ago in Italy.",
                    "label": 0
                },
                {
                    "sent": "Anne on creativity.",
                    "label": 0
                },
                {
                    "sent": "The difficult problems in talking about creativity.",
                    "label": 0
                },
                {
                    "sent": "What is creativity?",
                    "label": 0
                },
                {
                    "sent": "How do we measure in the light now again, forgive me, I use our criterion for defining creativity and.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "I have known some scientist, one with whom I interacted, great, deal.",
                    "label": 0
                },
                {
                    "sent": "A great sign is that the Neurosciences Institute in La Jolla, CA and I'm affiliated with that scientists and the director is one of my better friends.",
                    "label": 0
                },
                {
                    "sent": "Gerald Edelman.",
                    "label": 0
                },
                {
                    "sent": "An Jerry is a Nobel laureate.",
                    "label": 0
                },
                {
                    "sent": "Jerry is a DVD in many respects, but Jerry is one of them.",
                    "label": 0
                },
                {
                    "sent": "Really more creative as soon as he made a major discovery many years ago in.",
                    "label": 0
                },
                {
                    "sent": "Immunology for which he was awarded Nobel Prize.",
                    "label": 0
                },
                {
                    "sent": "Then later he moves in a new field and again makes a major discovery in cell biology, and now he's been for seven years one of the world's leading people in neuroscience and Jerry, even though he has a lab and like he really works, he thinks bring much alone now he and another great scientist whom I never spend as much time.",
                    "label": 0
                },
                {
                    "sent": "Of course, with him as I have Jerry Edelman, but never another great scientist of the last century.",
                    "label": 0
                },
                {
                    "sent": "Was Francis Crick?",
                    "label": 0
                },
                {
                    "sent": "Who were Jim Watson discovered the structure of DNA and I've had the pleasure of interviewing what Creek several times and he died a couple of years ago.",
                    "label": 0
                },
                {
                    "sent": "But I studied Crick.",
                    "label": 0
                },
                {
                    "sent": "I always study people who go contrary.",
                    "label": 0
                },
                {
                    "sent": "What my user in Creek, also with the exception.",
                    "label": 0
                },
                {
                    "sent": "His work with Watson and Crick is also been kind of loner.",
                    "label": 0
                },
                {
                    "sent": "Anna, very he was very creative man and so.",
                    "label": 0
                },
                {
                    "sent": "I don't want to say.",
                    "label": 0
                },
                {
                    "sent": "You can be highly creative even by my criteria by working very much alone, but I think Rick and Edelman and a few others are really exceptions to research and that we do.",
                    "label": 0
                },
                {
                    "sent": "Maybe I would just mention your fancy and some other qualities.",
                    "label": 0
                },
                {
                    "sent": "We were working together in a broader in the project.",
                    "label": 0
                },
                {
                    "sent": "Who is the we?",
                    "label": 0
                },
                {
                    "sent": "Oh excuse me, yeah.",
                    "label": 0
                },
                {
                    "sent": "Kind of a international project.",
                    "label": 0
                },
                {
                    "sent": "Is it illogical terminology?",
                    "label": 0
                },
                {
                    "sent": "We were studying how social capital of a research girl group effects the performance of young researchers, right?",
                    "label": 0
                },
                {
                    "sent": "The story on the microlab yes, right?",
                    "label": 0
                },
                {
                    "sent": "We lived operationalizing measuring what kind of things these social capital in the research group and we had actually so similar results.",
                    "label": 0
                },
                {
                    "sent": "Grayson's what kind of research group produces a good young researcher, right?",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "Yeah, is diverse.",
                    "label": 0
                },
                {
                    "sent": "Again, this is the logic of terminology, structural pose, which means that there are people that can bridge different parts of your little group together.",
                    "label": 0
                },
                {
                    "sent": "So again, in your your points of the creative group.",
                    "label": 0
                },
                {
                    "sent": "So there are some entries, another point is.",
                    "label": 0
                },
                {
                    "sent": "Cohesiveness, you know?",
                    "label": 0
                },
                {
                    "sent": "So very low cohesive.",
                    "label": 0
                },
                {
                    "sent": "Talk right, right, right?",
                    "label": 0
                },
                {
                    "sent": "I know he's right, which then interview that there are two clues.",
                    "label": 0
                },
                {
                    "sent": "To each other, they do not go.",
                    "label": 0
                },
                {
                    "sent": "If everybody thinks the same way.",
                    "label": 0
                },
                {
                    "sent": "Low performance yes, right right?",
                    "label": 0
                },
                {
                    "sent": "Many different points that you have in your yeah here you know we we got it empirically ourselves.",
                    "label": 0
                },
                {
                    "sent": "Small research group yeah no.",
                    "label": 0
                },
                {
                    "sent": "This isn't us.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'd just as an aside when I talk about this nurturing environment.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "I think that is really very important this if I may.",
                    "label": 0
                },
                {
                    "sent": "Just as an aside, I have many many friends in Germany and the Germans have been really very supportive of my research overtime.",
                    "label": 0
                },
                {
                    "sent": "And if you look at my video you will see I been visiting professor here and there and the Germans have funded my research and I'm very grateful.",
                    "label": 0
                },
                {
                    "sent": "But there are different cultural environments.",
                    "label": 0
                },
                {
                    "sent": "An I want to spent pretty much a year in a monks punk Institute in in Germany.",
                    "label": 0
                },
                {
                    "sent": "Anne had two directores Anne.",
                    "label": 0
                },
                {
                    "sent": "Both are friends of mine and yet it's this story I'm about to tell you is really interesting because I think it says something about the difference between research organization in Germany, Anna Research Organization in the United States.",
                    "label": 0
                },
                {
                    "sent": "So one of these both directors were friends of mine, but one of them.",
                    "label": 0
                },
                {
                    "sent": "Whenever she giving way, whenever she will need to speak to one of the younger researchers who is just down the Hall, she would have her secretary called the young researcher professor suing So wants to see you.",
                    "label": 0
                },
                {
                    "sent": "Now in America, the head of our organization would go down and speak the young.",
                    "label": 0
                },
                {
                    "sent": "So it was sort of like, you know.",
                    "label": 0
                },
                {
                    "sent": "The young researcher is someone, but in the American environment, what I think is really necessary in creative environment is that there is almost no hierarchy.",
                    "label": 0
                },
                {
                    "sent": "You know, when you're in the scientific community, people know who's doing better and who knows more.",
                    "label": 0
                },
                {
                    "sent": "But there's no need to have this kind of status hierarchy.",
                    "label": 0
                },
                {
                    "sent": "We're all learning together, anwer on ignorant.",
                    "label": 0
                },
                {
                    "sent": "And I must confess that I have some Gray hairs and as I get older, I mean I realize I know less and less.",
                    "label": 0
                },
                {
                    "sent": "We have to have a good bit of humility and recognize that we can learn from everybody, and I think it really in a scientific environment.",
                    "label": 0
                },
                {
                    "sent": "It's really very important that older people and younger people can work together on first name basis and like and there is a kind of.",
                    "label": 0
                },
                {
                    "sent": "Status hierarchy and that it becomes pretty obvious sometimes.",
                    "label": 0
                },
                {
                    "sent": "Maybe a student knows more than some old fogey, but I really do need enormous amount from young people, but in the Max Planck structure there is this very hierarchical, almost authoritarian culture and I think it hinders their ability to reach their potential, and I think it's I hope you remember.",
                    "label": 0
                },
                {
                    "sent": "This perspective of mine.",
                    "label": 0
                },
                {
                    "sent": "Another story, I attended a conference some years ago in Germany again, and the speaker was a German professor, So what more senior professor and he was introduced as professor showing so well when Professor Soandso began to speak, I thought oh he's going to.",
                    "label": 0
                },
                {
                    "sent": "He was really angry that he was not introduced as Professor, Doctor, Doctor.",
                    "label": 0
                },
                {
                    "sent": "And he would not just ordinary professor.",
                    "label": 0
                },
                {
                    "sent": "He was Professor, Doctor, Doctor, and it just would never happen in their own search.",
                    "label": 0
                },
                {
                    "sent": "I don't care whether somebody calls me Rogers and some people call me really bad things, but we are not.",
                    "label": 0
                },
                {
                    "sent": "I don't think titles are very important.",
                    "label": 0
                },
                {
                    "sent": "And so I think in doing good research we need to leave the status distinctions at the door.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you so much for inviting me here.",
                    "label": 0
                },
                {
                    "sent": "Appreciate it.",
                    "label": 0
                }
            ]
        }
    }
}