{
    "id": "g2im2ld2fmw6uasstmo6w7cyhljvrsor",
    "title": "CLARIN Data, Services and Tools: What language technologies are available that might help process, analyse and explore oral history collections?",
    "info": {
        "author": [
            "Dieter van Uytvanck, CLARIN ERIC"
        ],
        "published": "Aug. 21, 2017",
        "recorded": "April 2016",
        "category": [
            "Top->Humanities->Languages",
            "Top->Computers->Digital Media",
            "Top->Humanities->History"
        ]
    },
    "url": "http://videolectures.net/clarinplusworkshop2016_uytvanck_data/",
    "segmentation": [
        [
            "But let me also."
        ],
        [
            "Think the earlier presenters, so I'm very glad I can stand on the shoulders of all the presentations which have been given this morning.",
            "I think they give kind of excellent introduction also to explaining you now what's the Clarion technical infrastructure looks like and what we're basically trying to provide in terms of services, data in tools.",
            "OK."
        ],
        [
            "Well, you've already heard to something in the introductory presentation about Clarence, so I will skip about what the acronym stands for."
        ],
        [
            "Let's go to an example.",
            "Languages providing clarity is providing access to language resources.",
            "And actually I found this example in preparation of the RDA meeting in Tokyo, Japan, but I think it's a very good illustration of how language resources are more than just linguistics and more than just the language data by itself.",
            "As you can see here, there is an example of a book from Japan which describes the tsunami of 1700 to 7.",
            "Well, it's as different dimensions that it adds to the just the pure language material.",
            "So well.",
            "First of all, it's been written down in specific transcript that needed some human interpretation.",
            "As you can see over here, it also needed some annotations since there are kind of different words which basically conceived meaning of tsunami.",
            "So it could be waves in the harbor or a high tide in the evening.",
            "Things like that.",
            "So it also.",
            "It is about combining information an adding human annotations on top of the purely linguistic material.",
            "Well, just as an illustration, there's some more information over here, including a link to the very interesting article which describes the whole.",
            "Well, kind of search in how to decipher this information, how to connect it to also other fields than just linguistics.",
            "So this is kind of information that ties into historians.",
            "This obviously telling something about the way people were living that time in Japan.",
            "So at no graffi, but it even connects in this case to geology and things like that.",
            "So it's a very multidisciplinary approach which you can derive from that language material."
        ],
        [
            "Good.",
            "How does Claire and try to give access to this kind of language data balance distributed architecture?",
            "So as you can see here, Claren exists of different centers spread all over the world, mostly currently in Europe, but we're extending and it's giving access to language data through HTTP, so the Internet protocol, through web applications and web services, everything is distributed.",
            "So that means that you as a user.",
            "Here in the UK can also make use of a repository in Germany, Finland or a web service in Greece.",
            "We called the notes in this network centers and I'll give you a bit more details about."
        ],
        [
            "That later on, this is a bit of organizational details.",
            "I think this was also already mentioned tomorrow this morning, during the introductory presentation, so I will skip."
        ],
        [
            "On that.",
            "So what's the advantages of being part of Claire?",
            "And, well, it's about having access to declare an infrastructure, and I will run you through the services which we are offering in just a few minutes.",
            "It's about having access to the expertise through what we call the Klarin knowledge sharing infrastructure, so it is really having a specialist about let's say, how to store sound recordings in sustainable way, and making sure that they can be reused later on.",
            "But also about specialists in treebanks, things like that.",
            "So it's really kind of networking.",
            "All this information and making that easily accessible to the research community.",
            "Is also it's also about embedding the humanities research community and making sure that data can be used can be reused.",
            "We just saw some very interesting.",
            "Perspectives on that on how single interview, for instance, can be purpose towards different research questions or the other way around.",
            "Of course it's also about the visibility of the language and the cultural heritage.",
            "So if you have data about such.",
            "So it starts with cultural heritage material.",
            "It's very good to be able to share it and to reuse it.",
            "And well, there's some opportunities.",
            "Obviously for cross, lingual and cross cultural research, but also to participate in research projects which can.",
            "Basically, make use of this."
        ],
        [
            "Good quick map.",
            "There are currently 33 Clarence centers.",
            "As I said, mostly spread over Europe.",
            "There's one in the US also.",
            "This is extending all the time.",
            "If you're interested in getting some more information about these centers, you can have a look at the Clarion Eric website.",
            "We have a kind of categorisation where Clarin centre can start very basic providing just some now how or just the metadata and can grow into its ambitions and into it.",
            "It's compliancy with Clarence.",
            "Standards and requirements and such being even more integrated in declaring infrastructure."
        ],
        [
            "Good then we come to some of the services which we are providing.",
            "Everything that is really the core of what I would like to tell you today about what Klaren is about.",
            "For a summary, you can always go to the website declaring dot U slash services and you will find.",
            "A bit of mirror, more background on these these services, but I would like to stress that these are these are really concrete and usable services that they do exist today.",
            "It's nothing that we intend to develop in the future.",
            "These services are available today.",
            "Fur."
        ],
        [
            "Of all, there is depositing in archiving, so in these 30 plus centers, there is the possibility to deposit your data in a way that they are compliant with the claron requirements.",
            "That means that you can provide clarity compliant metadata.",
            "They will get persistent identifiers for easy citation.",
            "They will be integrated, for instance with the content search mechanisms.",
            "The metadata will be made searchable through declaring infrastructure.",
            "ETC etc so they get a kind of long term perspective and also that deep integration into the technical infrastructure."
        ],
        [
            "There's a virtual language Observatory which is kind of search portal for metadata descriptions.",
            "Basically what we do is we harvest metadata from those Clarence centers and actually also from more centers around we index it and make it searchable.",
            "And right now we have about 800,000 metadata records.",
            "Of course there's a lot, so that also means that you need some very.",
            "Good searching mechanisms, for instance facet search to narrow down the search space and to find really important and relevant information I just did."
        ],
        [
            "An example query yesterday on interviews.",
            "Indeed, Virtual language Observatory.",
            "And as you can see here there are about what is it 27,000 records which contain in one way or the other way word interviews.",
            "Of course, that doesn't mean that now you have kind of complete overview of what is out there, but it allows you now through the use of facets to narrow down for instance to specific collection was.",
            "But if it's specific collection.",
            "Which could be recent, which could be relevant to your research question, or for instance by language or by the resource type.",
            "So let's say you really want to have an audio file from an interview.",
            "Then you can specify that just to give a kind of illustration of how to use these metadata records to find more detailed information."
        ],
        [
            "Good, we also have the Federated content search that ties in a bit to the theme that has been talked about earlier this morning.",
            "In fact, that you probably don't only want to search through the metadata, but you also want to, for instance, search through the transcripts of the interviews and try to really find for in specific keywords through the Federated content search.",
            "This is also possible.",
            "It's a kind of Federated approach where you have one search portal and if you enter a query there, there is a contact made two different.",
            "Search databases over which are spread over declaring network and the query is performed there and the answers are sent back to this kind of central overview.",
            "Yeah."
        ],
        [
            "The mechanism this is a screenshot of the Federated content search here, now interesting or good to to remember in this context is the fact that we don't aim at being a surrogate for those local search engines know it's rather being able to detect where the interesting data isn't, then jump to the local search engine, which might give you much more search possibilities.",
            "Say for instance the linkage with video material or sound material since.",
            "Of course, that's the real power horse you would like to use as a researcher, but this is a kind of first step trying to identify in which collections there could be something interesting pertaining to your RE."
        ],
        [
            "Search questions there are lots of web services and web applications also available, and again, there's there's a preliminary list on the website there, but it is both about those natural language processing tools which could allow you to, for instance, create transcriptions more easily by.",
            "Speech recognition, for instance, or phonetic alignment, part of speech tagging, etc.",
            "But it could also be bit more serving in terms towards the distance reading, so putting a large amount of data into web application or web tool and then trying to find out the big patterns which are coming out of that."
        ],
        [
            "We try also to provide easy access to protected resource is.",
            "I mean it also has been mentioned quite a few times already that specially in case of sound recordings or personal information.",
            "It's not always possible to provide or to access the information through Open Access on the website.",
            "So therefore there is what we called Federated Login which allows researchers to use their institutional credentials and so the login name and user name of the University for instance.",
            "To access remote data, so say you're interested in specific interview, which is accessible for the academic community but not really Open Access.",
            "So you need to log in.",
            "Then you just can go through that website.",
            "Use this kind of single sign-on and X is the data which is available over there.",
            "This should help a lot in lowering the hurdle to get access to such protected data sources and also the other way around.",
            "Also to make it.",
            "Possible for data depositers to share their data more easily with the academic community."
        ],
        [
            "There are the virtual collections.",
            "This is a kind of digital bookmark system by which you are allowed to create a kind of yeah of bookmark set, which then later on.",
            "So for instance, containing references to specific parts of interviews.",
            "Then later on you can side this with the persistent identifier.",
            "So with a link which will remain in place over a longer period, the metadata of this virtual collection.",
            "So what is it?",
            "What is it about will also be indexed, will be made searchable through the vlog, and we're also currently working on making this kind of collections machine processable.",
            "So say you have links to different wave files so to different text files then it will be possible to use such a virtual collection, send it to what we call language resource, which port.",
            "And then process that data automatically based on the input of what you have gathered in a virtual collection."
        ],
        [
            "Good, I think this is a slight which didn't work, so I will skip on it and there."
        ],
        [
            "This finally also consultancy very important part of course.",
            "I already mentioned it.",
            "If you have a question.",
            "If you're wondering about how to integrate things into claren.",
            "If you're wondering how Clarin could help you with your specific research question, or if you would like to set up a kind of collaboration with colleagues which could tie in with this concept, then clarinase.",
            "Very glad to help you and give some information about this.",
            "Goats."
        ],
        [
            "Quick run up of the technological pillars and I won't bore you too much with the details.",
            "First of all, this Federated identity, so logging in with your own credentials.",
            "Secondly, persistent identifiers through handles.",
            "So basically making sure that whatever you cite is also accessible tomorrow and also in a longer period of time.",
            "So say 510 years, and that can be cited in Standard Way.",
            "Same goes for fragments of language resource, so if you say I want to highlight that specific sentence in a transcript.",
            "Or in a sound recording, it's possible with these persistent identifiers.",
            "Thirdly, sustainable repositories these yeah these repositories which which make up the kind of the core of clarinet through this Federated setup, where if you are storing your resources they will also be safe on a longer period of time.",
            "We're making use of flexible metadata and concept definitions, basically allowing some flexibility since we realize that for specific purposes you might need different.",
            "Metadata descriptions, but at the same time making sure that there are also links to clear definitions so that yeah, it's clear what you're talking about and that there can be a kind of semantic harmonization.",
            "And finally well described and open protocols.",
            "As I said, we have a clear protocol, for instance, for this Federated content search, where we have a full description of how to tie into this, where we also trying to provide libraries to connect to such search tool and similarly.",
            "Also the web services.",
            "Can be can be used in such an open way so it is all a matter of being providing clear documentation and providing information about these protocols.",
            "Go."
        ],
        [
            "But yeah, it's not only.",
            "About just these pillars, I think important within the current framework is the integration.",
            "First part there is integration within Claire and making sure that those centers are not islands but are really collaborating exchange information and can reuse some of the technology provided through the other centers.",
            "So yeah, and to give some concrete examples, in the context of this workshop there so later on this afternoon, I think there will be a presentation given about a loan which is often used to create annotations for, for instance, audiovisual data alone has been integrated with two web services, one of them web clicked, which allows you to do automatic part of speech tagging, for instance, of the sentences that you have entered so that it saves you some time in when you're creating the annotations.",
            "And Secondly, also with web mouse which is a service from the Clarence Center at Munich and by his proxy, nyala, which allows you to do automatic phonetic alignment.",
            "So if you have an audio signal you have a transcript, orthographic transcript of what has been set web.",
            "This web mouse connection will allow a kind of automatic alignment of the.",
            "So first of all phoneme graphing, graphing, phonem.",
            "In conversion and then Secondly also making sure there is an automatic alignment with the timeline, so it should be able to save you a lot of time.",
            "The."
        ],
        [
            "Kind of things will also be more closely integrated through the language resource switchboard, given the restrictions of time, I will skip that for now."
        ],
        [
            "Secondly important part.",
            "Oh, and it's pretty well.",
            "There's a nice diagram missing here indicating how Clarin integrates not only within Claire in itself, but also with the outer world.",
            "So the infrastructure rule.",
            "Think about infrastructure layers like JA, and to make sure the networking level is working with you debt for large datasets, storage and safe replication with colleagues from diarrhea.",
            "With research infrastructure.",
            "Yeah, for like the Research data Alliance etc etc.",
            "And finally of course also with the researches themselves and I think that's where we are here for at this workshop trying to gather some information and trying to exchange ideas about how how, claren tools and data can be used for research, but also the other way around.",
            "What kind of questions come from your side?"
        ],
        [
            "Right and how Claren can do something about that?",
            "So yeah, what I would like to stress in that respect is that Karen is not something very static.",
            "I mean it is a dynamic research infrastructure.",
            "And while we have this kind of Federation of archives and services, it's.",
            "Kind of constantly evolving infrastructure, so that means that for us it's very important to listen to your needs to learn from your experiences, and I think they're already has combined lots of information this morning, so I'm very glad I made a lot of notes and I think that will be gratefully used in the next planning phase is for Clarence.",
            "And also to create additional bridges.",
            "So between the research infrastructures on one hand and on the other hand, potential users and data and service providers."
        ],
        [
            "Very concretely, and maybe this is already a bit too much into detail, but I thought it would be good to give some feedback to the database which was being distributed about the oral data collections.",
            "I thought that it would be very nice if it would in the end be possible to integrate that into the virtual Language Observatory so that if a researcher is searching for, I don't know specific collection from this or that country that it can be found through the vlo challenging there of course, is gathering incomparable metadata from different sources.",
            "It's always very difficult, especially if there's so many.",
            "Different countries and initiatives.",
            "But I think this is very first good step, but trying to define the fields which are necessary.",
            "And yeah, technically that could be done through either Dublin core over OOS, PMH or through specific metadata profiles.",
            "Interesting question.",
            "There is what to do with a non digitized resource is so.",
            "On the one hand, of course it's also always very important to know that these resources exist.",
            "On the other hand, which we often have experienced, is that researchers who are searching for something and they find that something doesn't exist in digital form yet.",
            "This increases the kind of frustration level and it's kind of balance to find there, and I think key there is at least providing contact information in terms when there is something interesting making sure that.",
            "There is a person to contact, or an organization which can react on queries to get access to the original data, even if it's not yet digitized yet.",
            "What to do with access restrictions?",
            "It's of course, again, very important to provide detailed information about how to access specific resources.",
            "There are some standards for that, and I was very glad to see that we have to kind of three layer classification, which is very much in line with what was presented earlier during the UK Data Services.",
            "Presentation, so there's some possibilities to standardize or trying to harmonize on that field.",
            "I think, and providing single sign on so that if you need to log in, it's convenient to do it, and it's not really.",
            "An extra hurdle to get to the data.",
            "While there are some nice portals like this for helpful Aiden site, which which have kind of starting point for that.",
            "Secondly, I thought it would also be interesting to maybe have a look at how we could connect these kind of transcript search engines to the Federated content search so that you have one portal where you can search all of them.",
            "And if you then interested and want to find out more details that you can jump to the original search engine and have a look in all depth on the original data."
        ],
        [
            "Good so far for my quick feedback around, but I think most important in this context is to gather your ideas.",
            "Your suggestions in your feedback and well concluding with these words.",
            "I'm looking very much forward to discussions this afternoon and tomorrow, where I hope we will have possibility for this kind of information."
        ],
        [
            "Change so thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But let me also.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Think the earlier presenters, so I'm very glad I can stand on the shoulders of all the presentations which have been given this morning.",
                    "label": 0
                },
                {
                    "sent": "I think they give kind of excellent introduction also to explaining you now what's the Clarion technical infrastructure looks like and what we're basically trying to provide in terms of services, data in tools.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, you've already heard to something in the introductory presentation about Clarence, so I will skip about what the acronym stands for.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's go to an example.",
                    "label": 0
                },
                {
                    "sent": "Languages providing clarity is providing access to language resources.",
                    "label": 0
                },
                {
                    "sent": "And actually I found this example in preparation of the RDA meeting in Tokyo, Japan, but I think it's a very good illustration of how language resources are more than just linguistics and more than just the language data by itself.",
                    "label": 1
                },
                {
                    "sent": "As you can see here, there is an example of a book from Japan which describes the tsunami of 1700 to 7.",
                    "label": 0
                },
                {
                    "sent": "Well, it's as different dimensions that it adds to the just the pure language material.",
                    "label": 0
                },
                {
                    "sent": "So well.",
                    "label": 0
                },
                {
                    "sent": "First of all, it's been written down in specific transcript that needed some human interpretation.",
                    "label": 0
                },
                {
                    "sent": "As you can see over here, it also needed some annotations since there are kind of different words which basically conceived meaning of tsunami.",
                    "label": 0
                },
                {
                    "sent": "So it could be waves in the harbor or a high tide in the evening.",
                    "label": 0
                },
                {
                    "sent": "Things like that.",
                    "label": 0
                },
                {
                    "sent": "So it also.",
                    "label": 0
                },
                {
                    "sent": "It is about combining information an adding human annotations on top of the purely linguistic material.",
                    "label": 0
                },
                {
                    "sent": "Well, just as an illustration, there's some more information over here, including a link to the very interesting article which describes the whole.",
                    "label": 0
                },
                {
                    "sent": "Well, kind of search in how to decipher this information, how to connect it to also other fields than just linguistics.",
                    "label": 0
                },
                {
                    "sent": "So this is kind of information that ties into historians.",
                    "label": 0
                },
                {
                    "sent": "This obviously telling something about the way people were living that time in Japan.",
                    "label": 0
                },
                {
                    "sent": "So at no graffi, but it even connects in this case to geology and things like that.",
                    "label": 0
                },
                {
                    "sent": "So it's a very multidisciplinary approach which you can derive from that language material.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good.",
                    "label": 0
                },
                {
                    "sent": "How does Claire and try to give access to this kind of language data balance distributed architecture?",
                    "label": 0
                },
                {
                    "sent": "So as you can see here, Claren exists of different centers spread all over the world, mostly currently in Europe, but we're extending and it's giving access to language data through HTTP, so the Internet protocol, through web applications and web services, everything is distributed.",
                    "label": 1
                },
                {
                    "sent": "So that means that you as a user.",
                    "label": 0
                },
                {
                    "sent": "Here in the UK can also make use of a repository in Germany, Finland or a web service in Greece.",
                    "label": 0
                },
                {
                    "sent": "We called the notes in this network centers and I'll give you a bit more details about.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That later on, this is a bit of organizational details.",
                    "label": 0
                },
                {
                    "sent": "I think this was also already mentioned tomorrow this morning, during the introductory presentation, so I will skip.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On that.",
                    "label": 0
                },
                {
                    "sent": "So what's the advantages of being part of Claire?",
                    "label": 0
                },
                {
                    "sent": "And, well, it's about having access to declare an infrastructure, and I will run you through the services which we are offering in just a few minutes.",
                    "label": 0
                },
                {
                    "sent": "It's about having access to the expertise through what we call the Klarin knowledge sharing infrastructure, so it is really having a specialist about let's say, how to store sound recordings in sustainable way, and making sure that they can be reused later on.",
                    "label": 1
                },
                {
                    "sent": "But also about specialists in treebanks, things like that.",
                    "label": 0
                },
                {
                    "sent": "So it's really kind of networking.",
                    "label": 0
                },
                {
                    "sent": "All this information and making that easily accessible to the research community.",
                    "label": 0
                },
                {
                    "sent": "Is also it's also about embedding the humanities research community and making sure that data can be used can be reused.",
                    "label": 1
                },
                {
                    "sent": "We just saw some very interesting.",
                    "label": 0
                },
                {
                    "sent": "Perspectives on that on how single interview, for instance, can be purpose towards different research questions or the other way around.",
                    "label": 1
                },
                {
                    "sent": "Of course it's also about the visibility of the language and the cultural heritage.",
                    "label": 0
                },
                {
                    "sent": "So if you have data about such.",
                    "label": 0
                },
                {
                    "sent": "So it starts with cultural heritage material.",
                    "label": 0
                },
                {
                    "sent": "It's very good to be able to share it and to reuse it.",
                    "label": 0
                },
                {
                    "sent": "And well, there's some opportunities.",
                    "label": 0
                },
                {
                    "sent": "Obviously for cross, lingual and cross cultural research, but also to participate in research projects which can.",
                    "label": 1
                },
                {
                    "sent": "Basically, make use of this.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good quick map.",
                    "label": 0
                },
                {
                    "sent": "There are currently 33 Clarence centers.",
                    "label": 0
                },
                {
                    "sent": "As I said, mostly spread over Europe.",
                    "label": 0
                },
                {
                    "sent": "There's one in the US also.",
                    "label": 0
                },
                {
                    "sent": "This is extending all the time.",
                    "label": 0
                },
                {
                    "sent": "If you're interested in getting some more information about these centers, you can have a look at the Clarion Eric website.",
                    "label": 0
                },
                {
                    "sent": "We have a kind of categorisation where Clarin centre can start very basic providing just some now how or just the metadata and can grow into its ambitions and into it.",
                    "label": 0
                },
                {
                    "sent": "It's compliancy with Clarence.",
                    "label": 0
                },
                {
                    "sent": "Standards and requirements and such being even more integrated in declaring infrastructure.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good then we come to some of the services which we are providing.",
                    "label": 0
                },
                {
                    "sent": "Everything that is really the core of what I would like to tell you today about what Klaren is about.",
                    "label": 0
                },
                {
                    "sent": "For a summary, you can always go to the website declaring dot U slash services and you will find.",
                    "label": 0
                },
                {
                    "sent": "A bit of mirror, more background on these these services, but I would like to stress that these are these are really concrete and usable services that they do exist today.",
                    "label": 1
                },
                {
                    "sent": "It's nothing that we intend to develop in the future.",
                    "label": 0
                },
                {
                    "sent": "These services are available today.",
                    "label": 0
                },
                {
                    "sent": "Fur.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of all, there is depositing in archiving, so in these 30 plus centers, there is the possibility to deposit your data in a way that they are compliant with the claron requirements.",
                    "label": 0
                },
                {
                    "sent": "That means that you can provide clarity compliant metadata.",
                    "label": 0
                },
                {
                    "sent": "They will get persistent identifiers for easy citation.",
                    "label": 0
                },
                {
                    "sent": "They will be integrated, for instance with the content search mechanisms.",
                    "label": 0
                },
                {
                    "sent": "The metadata will be made searchable through declaring infrastructure.",
                    "label": 0
                },
                {
                    "sent": "ETC etc so they get a kind of long term perspective and also that deep integration into the technical infrastructure.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There's a virtual language Observatory which is kind of search portal for metadata descriptions.",
                    "label": 1
                },
                {
                    "sent": "Basically what we do is we harvest metadata from those Clarence centers and actually also from more centers around we index it and make it searchable.",
                    "label": 0
                },
                {
                    "sent": "And right now we have about 800,000 metadata records.",
                    "label": 0
                },
                {
                    "sent": "Of course there's a lot, so that also means that you need some very.",
                    "label": 0
                },
                {
                    "sent": "Good searching mechanisms, for instance facet search to narrow down the search space and to find really important and relevant information I just did.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An example query yesterday on interviews.",
                    "label": 0
                },
                {
                    "sent": "Indeed, Virtual language Observatory.",
                    "label": 0
                },
                {
                    "sent": "And as you can see here there are about what is it 27,000 records which contain in one way or the other way word interviews.",
                    "label": 0
                },
                {
                    "sent": "Of course, that doesn't mean that now you have kind of complete overview of what is out there, but it allows you now through the use of facets to narrow down for instance to specific collection was.",
                    "label": 0
                },
                {
                    "sent": "But if it's specific collection.",
                    "label": 0
                },
                {
                    "sent": "Which could be recent, which could be relevant to your research question, or for instance by language or by the resource type.",
                    "label": 0
                },
                {
                    "sent": "So let's say you really want to have an audio file from an interview.",
                    "label": 0
                },
                {
                    "sent": "Then you can specify that just to give a kind of illustration of how to use these metadata records to find more detailed information.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good, we also have the Federated content search that ties in a bit to the theme that has been talked about earlier this morning.",
                    "label": 1
                },
                {
                    "sent": "In fact, that you probably don't only want to search through the metadata, but you also want to, for instance, search through the transcripts of the interviews and try to really find for in specific keywords through the Federated content search.",
                    "label": 0
                },
                {
                    "sent": "This is also possible.",
                    "label": 0
                },
                {
                    "sent": "It's a kind of Federated approach where you have one search portal and if you enter a query there, there is a contact made two different.",
                    "label": 0
                },
                {
                    "sent": "Search databases over which are spread over declaring network and the query is performed there and the answers are sent back to this kind of central overview.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The mechanism this is a screenshot of the Federated content search here, now interesting or good to to remember in this context is the fact that we don't aim at being a surrogate for those local search engines know it's rather being able to detect where the interesting data isn't, then jump to the local search engine, which might give you much more search possibilities.",
                    "label": 0
                },
                {
                    "sent": "Say for instance the linkage with video material or sound material since.",
                    "label": 0
                },
                {
                    "sent": "Of course, that's the real power horse you would like to use as a researcher, but this is a kind of first step trying to identify in which collections there could be something interesting pertaining to your RE.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Search questions there are lots of web services and web applications also available, and again, there's there's a preliminary list on the website there, but it is both about those natural language processing tools which could allow you to, for instance, create transcriptions more easily by.",
                    "label": 1
                },
                {
                    "sent": "Speech recognition, for instance, or phonetic alignment, part of speech tagging, etc.",
                    "label": 0
                },
                {
                    "sent": "But it could also be bit more serving in terms towards the distance reading, so putting a large amount of data into web application or web tool and then trying to find out the big patterns which are coming out of that.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We try also to provide easy access to protected resource is.",
                    "label": 1
                },
                {
                    "sent": "I mean it also has been mentioned quite a few times already that specially in case of sound recordings or personal information.",
                    "label": 0
                },
                {
                    "sent": "It's not always possible to provide or to access the information through Open Access on the website.",
                    "label": 0
                },
                {
                    "sent": "So therefore there is what we called Federated Login which allows researchers to use their institutional credentials and so the login name and user name of the University for instance.",
                    "label": 0
                },
                {
                    "sent": "To access remote data, so say you're interested in specific interview, which is accessible for the academic community but not really Open Access.",
                    "label": 0
                },
                {
                    "sent": "So you need to log in.",
                    "label": 0
                },
                {
                    "sent": "Then you just can go through that website.",
                    "label": 0
                },
                {
                    "sent": "Use this kind of single sign-on and X is the data which is available over there.",
                    "label": 0
                },
                {
                    "sent": "This should help a lot in lowering the hurdle to get access to such protected data sources and also the other way around.",
                    "label": 0
                },
                {
                    "sent": "Also to make it.",
                    "label": 0
                },
                {
                    "sent": "Possible for data depositers to share their data more easily with the academic community.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are the virtual collections.",
                    "label": 1
                },
                {
                    "sent": "This is a kind of digital bookmark system by which you are allowed to create a kind of yeah of bookmark set, which then later on.",
                    "label": 0
                },
                {
                    "sent": "So for instance, containing references to specific parts of interviews.",
                    "label": 0
                },
                {
                    "sent": "Then later on you can side this with the persistent identifier.",
                    "label": 0
                },
                {
                    "sent": "So with a link which will remain in place over a longer period, the metadata of this virtual collection.",
                    "label": 0
                },
                {
                    "sent": "So what is it?",
                    "label": 0
                },
                {
                    "sent": "What is it about will also be indexed, will be made searchable through the vlog, and we're also currently working on making this kind of collections machine processable.",
                    "label": 0
                },
                {
                    "sent": "So say you have links to different wave files so to different text files then it will be possible to use such a virtual collection, send it to what we call language resource, which port.",
                    "label": 0
                },
                {
                    "sent": "And then process that data automatically based on the input of what you have gathered in a virtual collection.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good, I think this is a slight which didn't work, so I will skip on it and there.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This finally also consultancy very important part of course.",
                    "label": 0
                },
                {
                    "sent": "I already mentioned it.",
                    "label": 0
                },
                {
                    "sent": "If you have a question.",
                    "label": 0
                },
                {
                    "sent": "If you're wondering about how to integrate things into claren.",
                    "label": 0
                },
                {
                    "sent": "If you're wondering how Clarin could help you with your specific research question, or if you would like to set up a kind of collaboration with colleagues which could tie in with this concept, then clarinase.",
                    "label": 0
                },
                {
                    "sent": "Very glad to help you and give some information about this.",
                    "label": 0
                },
                {
                    "sent": "Goats.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Quick run up of the technological pillars and I won't bore you too much with the details.",
                    "label": 0
                },
                {
                    "sent": "First of all, this Federated identity, so logging in with your own credentials.",
                    "label": 1
                },
                {
                    "sent": "Secondly, persistent identifiers through handles.",
                    "label": 1
                },
                {
                    "sent": "So basically making sure that whatever you cite is also accessible tomorrow and also in a longer period of time.",
                    "label": 1
                },
                {
                    "sent": "So say 510 years, and that can be cited in Standard Way.",
                    "label": 0
                },
                {
                    "sent": "Same goes for fragments of language resource, so if you say I want to highlight that specific sentence in a transcript.",
                    "label": 0
                },
                {
                    "sent": "Or in a sound recording, it's possible with these persistent identifiers.",
                    "label": 0
                },
                {
                    "sent": "Thirdly, sustainable repositories these yeah these repositories which which make up the kind of the core of clarinet through this Federated setup, where if you are storing your resources they will also be safe on a longer period of time.",
                    "label": 0
                },
                {
                    "sent": "We're making use of flexible metadata and concept definitions, basically allowing some flexibility since we realize that for specific purposes you might need different.",
                    "label": 1
                },
                {
                    "sent": "Metadata descriptions, but at the same time making sure that there are also links to clear definitions so that yeah, it's clear what you're talking about and that there can be a kind of semantic harmonization.",
                    "label": 1
                },
                {
                    "sent": "And finally well described and open protocols.",
                    "label": 0
                },
                {
                    "sent": "As I said, we have a clear protocol, for instance, for this Federated content search, where we have a full description of how to tie into this, where we also trying to provide libraries to connect to such search tool and similarly.",
                    "label": 0
                },
                {
                    "sent": "Also the web services.",
                    "label": 0
                },
                {
                    "sent": "Can be can be used in such an open way so it is all a matter of being providing clear documentation and providing information about these protocols.",
                    "label": 0
                },
                {
                    "sent": "Go.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But yeah, it's not only.",
                    "label": 0
                },
                {
                    "sent": "About just these pillars, I think important within the current framework is the integration.",
                    "label": 0
                },
                {
                    "sent": "First part there is integration within Claire and making sure that those centers are not islands but are really collaborating exchange information and can reuse some of the technology provided through the other centers.",
                    "label": 1
                },
                {
                    "sent": "So yeah, and to give some concrete examples, in the context of this workshop there so later on this afternoon, I think there will be a presentation given about a loan which is often used to create annotations for, for instance, audiovisual data alone has been integrated with two web services, one of them web clicked, which allows you to do automatic part of speech tagging, for instance, of the sentences that you have entered so that it saves you some time in when you're creating the annotations.",
                    "label": 0
                },
                {
                    "sent": "And Secondly, also with web mouse which is a service from the Clarence Center at Munich and by his proxy, nyala, which allows you to do automatic phonetic alignment.",
                    "label": 0
                },
                {
                    "sent": "So if you have an audio signal you have a transcript, orthographic transcript of what has been set web.",
                    "label": 0
                },
                {
                    "sent": "This web mouse connection will allow a kind of automatic alignment of the.",
                    "label": 0
                },
                {
                    "sent": "So first of all phoneme graphing, graphing, phonem.",
                    "label": 0
                },
                {
                    "sent": "In conversion and then Secondly also making sure there is an automatic alignment with the timeline, so it should be able to save you a lot of time.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Kind of things will also be more closely integrated through the language resource switchboard, given the restrictions of time, I will skip that for now.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Secondly important part.",
                    "label": 0
                },
                {
                    "sent": "Oh, and it's pretty well.",
                    "label": 0
                },
                {
                    "sent": "There's a nice diagram missing here indicating how Clarin integrates not only within Claire in itself, but also with the outer world.",
                    "label": 0
                },
                {
                    "sent": "So the infrastructure rule.",
                    "label": 0
                },
                {
                    "sent": "Think about infrastructure layers like JA, and to make sure the networking level is working with you debt for large datasets, storage and safe replication with colleagues from diarrhea.",
                    "label": 0
                },
                {
                    "sent": "With research infrastructure.",
                    "label": 0
                },
                {
                    "sent": "Yeah, for like the Research data Alliance etc etc.",
                    "label": 0
                },
                {
                    "sent": "And finally of course also with the researches themselves and I think that's where we are here for at this workshop trying to gather some information and trying to exchange ideas about how how, claren tools and data can be used for research, but also the other way around.",
                    "label": 0
                },
                {
                    "sent": "What kind of questions come from your side?",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right and how Claren can do something about that?",
                    "label": 0
                },
                {
                    "sent": "So yeah, what I would like to stress in that respect is that Karen is not something very static.",
                    "label": 0
                },
                {
                    "sent": "I mean it is a dynamic research infrastructure.",
                    "label": 1
                },
                {
                    "sent": "And while we have this kind of Federation of archives and services, it's.",
                    "label": 1
                },
                {
                    "sent": "Kind of constantly evolving infrastructure, so that means that for us it's very important to listen to your needs to learn from your experiences, and I think they're already has combined lots of information this morning, so I'm very glad I made a lot of notes and I think that will be gratefully used in the next planning phase is for Clarence.",
                    "label": 1
                },
                {
                    "sent": "And also to create additional bridges.",
                    "label": 1
                },
                {
                    "sent": "So between the research infrastructures on one hand and on the other hand, potential users and data and service providers.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Very concretely, and maybe this is already a bit too much into detail, but I thought it would be good to give some feedback to the database which was being distributed about the oral data collections.",
                    "label": 0
                },
                {
                    "sent": "I thought that it would be very nice if it would in the end be possible to integrate that into the virtual Language Observatory so that if a researcher is searching for, I don't know specific collection from this or that country that it can be found through the vlo challenging there of course, is gathering incomparable metadata from different sources.",
                    "label": 1
                },
                {
                    "sent": "It's always very difficult, especially if there's so many.",
                    "label": 0
                },
                {
                    "sent": "Different countries and initiatives.",
                    "label": 0
                },
                {
                    "sent": "But I think this is very first good step, but trying to define the fields which are necessary.",
                    "label": 0
                },
                {
                    "sent": "And yeah, technically that could be done through either Dublin core over OOS, PMH or through specific metadata profiles.",
                    "label": 0
                },
                {
                    "sent": "Interesting question.",
                    "label": 1
                },
                {
                    "sent": "There is what to do with a non digitized resource is so.",
                    "label": 0
                },
                {
                    "sent": "On the one hand, of course it's also always very important to know that these resources exist.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, which we often have experienced, is that researchers who are searching for something and they find that something doesn't exist in digital form yet.",
                    "label": 0
                },
                {
                    "sent": "This increases the kind of frustration level and it's kind of balance to find there, and I think key there is at least providing contact information in terms when there is something interesting making sure that.",
                    "label": 0
                },
                {
                    "sent": "There is a person to contact, or an organization which can react on queries to get access to the original data, even if it's not yet digitized yet.",
                    "label": 1
                },
                {
                    "sent": "What to do with access restrictions?",
                    "label": 1
                },
                {
                    "sent": "It's of course, again, very important to provide detailed information about how to access specific resources.",
                    "label": 0
                },
                {
                    "sent": "There are some standards for that, and I was very glad to see that we have to kind of three layer classification, which is very much in line with what was presented earlier during the UK Data Services.",
                    "label": 0
                },
                {
                    "sent": "Presentation, so there's some possibilities to standardize or trying to harmonize on that field.",
                    "label": 0
                },
                {
                    "sent": "I think, and providing single sign on so that if you need to log in, it's convenient to do it, and it's not really.",
                    "label": 0
                },
                {
                    "sent": "An extra hurdle to get to the data.",
                    "label": 0
                },
                {
                    "sent": "While there are some nice portals like this for helpful Aiden site, which which have kind of starting point for that.",
                    "label": 0
                },
                {
                    "sent": "Secondly, I thought it would also be interesting to maybe have a look at how we could connect these kind of transcript search engines to the Federated content search so that you have one portal where you can search all of them.",
                    "label": 1
                },
                {
                    "sent": "And if you then interested and want to find out more details that you can jump to the original search engine and have a look in all depth on the original data.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good so far for my quick feedback around, but I think most important in this context is to gather your ideas.",
                    "label": 1
                },
                {
                    "sent": "Your suggestions in your feedback and well concluding with these words.",
                    "label": 0
                },
                {
                    "sent": "I'm looking very much forward to discussions this afternoon and tomorrow, where I hope we will have possibility for this kind of information.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Change so thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}