{
    "id": "g4g3nkfo5odovu5nq67hu237wo3yo773",
    "title": "Genetic resources and plant breeding",
    "info": {
        "presenter": [
            "Lothar Frese, Julius Kühn-Institut (JKI), Federal Research Centre for Cultivated Plants"
        ],
        "published": "May 24, 2015",
        "recorded": "May 2015",
        "category": [
            "Top->Biology->Agriculture",
            "Top->Biology->Biotechnology"
        ]
    },
    "url": "http://videolectures.net/phsaconference2015_frese_plant_breeding/",
    "segmentation": [
        [
            "Good morning to everybody.",
            "So I'm from the Institute of Breeding, Research, and agricultural crops.",
            "This is part of a research institution that does research, but this also said was also set up by our ministry to provide political advice to our ministry in.",
            "Particular to in on our case, in particular to issues concerning genetic resources in plant breeding."
        ],
        [
            "My lecture will.",
            "Well, we have three major topics, so this is reading as a complex system, so I will briefly describe.",
            "How breeding functions are will describe some conditions for sustainable plant breeding.",
            "Later on.",
            "Um?",
            "Some come too."
        ],
        [
            "Do you, which we called European drum plasm system.",
            "So the challenges we meet in agriculture have already been described yesterday.",
            "By one of the keynote speakers.",
            "So this is foot in process quality, climate change, global food security, arable land means we need to produce more yield on less land, and agriculture has to respect agrobiodiversity and, well, I would add biodiversity as such.",
            "If you just look at the number of plant species we have in in Europe and which we call plant species for Food and Agriculture, and then we're talking about 7000 round about 7000 plant species in Europe, which we have to care about.",
            "So the task of plant breeding is to adapt crops to all these conditions and the indispensable basis for plant breeding.",
            "Obviously is genetic resources."
        ],
        [
            "Plant breeders utilize Blanton net resources, but they do not only utilize planting net resources, they are increasingly engaged in the conservation of plant genetic resources.",
            "Um?",
            "You know, this pyramyd genetic diversity is brought at the basis when they talk about plant species living in the in the wild.",
            "The conservation of plant species in the wild is called in situ conservation.",
            "Which is not really a task of plant breeding, but plant breeders have to talk with plant conservation sector on the conservation status of wild plants in their natural habitat.",
            "We talk about we have to consider the deployement of planting it resources in agricultural production systems is called sometimes called on farm conservation.",
            "I'm breeding institutes, so most plant breeding institutes public re institutes in Europe run gene banks.",
            "There are only very few gene banks that are completely independent.",
            "Their task is to conserve congeneric resource, sexy to serve as seeds, deep frozen seed storage or plants in the field or as individual cultures.",
            "These resources are then evaluated.",
            "The data are recorded in information systems and made publicly available.",
            "And then interesting sources and the pre breeding programs.",
            "And finally you end up in the agricultural production system which much less genetic variation than at the start of the pyramid well illustrated.",
            "You see a picture of.",
            "Partially fully aware beana.",
            "Performance.",
            "Which is the the dawn of the nematode resistance or the system at all resistance seen in sugar beet?",
            "And here is the product that you grow."
        ],
        [
            "On plant breeding is soon.",
            "It's a system with more or less connected and interdependent sectors.",
            "So.",
            "Several of you may be astonished to see that I include Environment Protection into the discipline of plant breeding, but as I explained before, so we have a keen interest.",
            "Plant breeders have a keen interest in the conservation of continental resource in their natural habitats.",
            "We have the breeding research which is depending on the country in Europe, Morissette pre competitive sector, we have the competitive sector and the crop production where the product of plant breeding is being deployed.",
            "And depending on how we how we use this product in agricultural in the agricultural practice practice, it may have positive or negative aspects on biodiversity in the natural habitat.",
            "So the this should be taken almost taken into consideration the role of plant protection research is located here, so we cooperate very closely with.",
            "With you from the plant protection sector, especially in the development of an evaluation method which I used for phenotyping, not you story."
        ],
        [
            "Need it.",
            "Um?",
            "It's very clear that sustainable agriculture can only be developed if the disciplines that are part of the agricultural systems are in it self sustainable.",
            "So this was a question that we have debated in the scientific board.",
            "Of the Ministry of Agriculture.",
            "Very intensively, I will start this discussion with a provocative statement of Australian scientist Cowling.",
            "And he said sustainable plant breeding can be defined as productive and competitive breeding that is achieved without loss of genetic diversity in the leader breeding pool during the professional career of breed.",
            "And so the emphasis is.",
            "Professional career of the Breedam.",
            "This is a bit sceptic description of what breeders do.",
            "We have tried to to define the conditions for sustainable plant breeding.",
            "And this is threefold.",
            "Sustainable plant breeding does not deplete the used resources.",
            "That is, the breeding gene pool.",
            "It operates resources as self regulatory populations with high adaptiveness.",
            "And breeding at the products of breeding have no negative impacts on other resources.",
            "These are the conditions.",
            "These conditions have been investigated.",
            "Several officer just take out on.",
            "Eastern close, a colleague of mine and he found that there is steady breeding progress in winter and spring barley breeding varieties over a range of decades.",
            "You notice to loss of genetic diversity in the reading material and varieties, but these were compensated by gains in the gains come from introgression of exotic material, including wild species.",
            "Volume meter study which was implemented by fund of also team of the Dutch GenBank found that there is no gradual narrowing of the genetic base of the varieties released by breeders in the number of crops.",
            "That is, wheat, barley, corn, or P rice and soybean.",
            "And more recent paper showed that yield progress.",
            "And wheat, barley, corn, Rye, canola, sugarbeet, perennial, ryegrass, Italian ryegrass was mainly caused by genetic enhancement during the past 20 years.",
            "And they notice a very interesting effect, namely that breeding for the genetic, genetically determined breeding progress is still still going on, but the realized yield in agriculture production system.",
            "But there is a gap between genetic progress and the yield realized in agricultural production systems.",
            "So we could stay that.",
            "Breeding in itself is sustainable provided to plant genetic resources are conserved, so are available too.",
            "To replenish the breeding pools and the Gray one."
        ],
        [
            "I'll come back later to it, but the due to the way we are living humans or living on Earth, we are jeopardizing the very plant species that would help mitigating the negative effects of our societies on the environment.",
            "And I will give only two examples.",
            "Have a look outside of Europe.",
            "South America and Middle America.",
            "Central America is the home of crop wild relatives of potato, so they're quite large.",
            "Number of species which have a number of jobs, which is very important source for virus resistance.",
            "With tough draw, investments, resistance and many more, but.",
            "Model study of Jarvis at all.",
            "It was shown that climate change will reduce the range of these 180 so long the species to a large extend and even the Patch size of the area.",
            "Basically specific species growing and to me it seems only logical that this will inevitably diminish genetic diversity available to potato breeding from now to the year 2050.",
            "So this was the time scale of the investigation.",
            "So within Europe.",
            "On a team around.",
            "The people from the from the University of Birmingham.",
            "Um?",
            "Invested the threat status of round about 570 croplands.",
            "Beijing is crop wild relative species that are distributed and in Europe.",
            "Seva homed in Europe and 11.5% of these species are threatened.",
            "This seems not to be much, but among these species were important, generous, such as asparagus, ovina, beta Brassica.",
            "So this."
        ],
        [
            "Is something we should be concerned about?",
            "I'm well just to illustrate 1 one of the general it is the party folia general, known as lead owner of nematode resistance in sugar beet breeding.",
            "The species is as we know, since recently not very well conserved.",
            "Excitement gene banks.",
            "And due to a number of biological features, the species should better be conserved in seed within the natural hobby part.",
            "Which is depicted here where it can continue as.",
            "Self regenerating.",
            "The populations.",
            "I'm."
        ],
        [
            "What I'm coming now bit too too political theme.",
            "Breeding in itself is sustainable provided that breeders have uncomplicated access to genetic resources.",
            "Access means technical access or physical access, so access to information, health information systems or to the physical sources so seeds or plantlets, or to plant material that is that exists in the natural habitat.",
            "But in particular means political access.",
            "Which is determined by international regulatory frameworks."
        ],
        [
            "The most prominent.",
            "International Agreement is the international Treaty on Plant in every sources for Food and Agriculture.",
            "The contracting parties of this international treaty have established multilateral system and the multilateral system serves two purposes it should facilitate.",
            "In access to planting native resources and associated information, but more important in the political debate is how to share the benefits arising from the utilization punctuated resources in a fair and equitable way.",
            "For that purpose, the multilateral system uses a standard material transfer agreement.",
            "So if you approach it, if you approach a GenBank and order a genetic resource, you have to sign a standard material agreement for all the sessions that are nominated as multilateral system sessions.",
            "And under certain conditions, mandatory payments into the treaties benefit sharing funds are triggered, and particularly if a breeding line or a variety that was created on the basis of a genetic resource.",
            "For which you have signed the Material Transfer agreement is patented.",
            "In that case, obligatory payments are.",
            "Triggered.",
            "But in most places, in most cases use."
        ],
        [
            "We are encouraged to make voluntary payments and you can imagine what happens if someone is asked to make a voluntary payment.",
            "Um, so breeding progress in Europe depends to a large extent on access to plant genetic resources existing outside of Europe.",
            "Showcase was potato.",
            "And the functioning of the multilateral system is for for US readers in Europe of high importance.",
            "But to date.",
            "And this is taken from a study that was initiated by Bioversity International in Rome.",
            "To date, a large number of contracting parties have failed to make all or part of their punching resources available.",
            "To the multilateral system.",
            "Europe is not not very well off, so Europe only contributes 30% of the 1.1 million recessions kept in our gene banks.",
            "And the problem that may may make what will come will come up is that the Treaties benefit sharing fund is not filled up with money.",
            "So there are model model.",
            "Modern models applied to estimate the annual income of this benefit sharing fund until the year 2080, and I doubt that we have time to wait until 2080 until we have 97 billion US dollar value annually for and this is the purpose of the benefit sharing fund for funding the maintenance of plant genetic resources in the center of origin.",
            "These centers are often located in countries that are more or less poor.",
            "Or a more conservative estimate says that we will have by the year 20 thirty 10,000,000 US dollar in the benefit sharing form.",
            "And if you, if you have once applied to U project, you know how much you project costs between 3 and 5 million.",
            "Euro then you have the relation we are talking about."
        ],
        [
            "So the problem is if the multi rattle the system fails to generate the amount of monetary benefits expected by countries located in center of the versity.",
            "Um?",
            "Then these countries may not provide their resources.",
            "Very effectively.",
            "And constraints in that will delay the creation of varieties that can cope with the challenges.",
            "Agriculture is facing today."
        ],
        [
            "On the non military benefit sharing may be a way out of this problem and a good example is the national germplasm system of the United States in.",
            "Well, it's located in Fort Collins and in Beltsville from Fort Collins to the collection and Beltsville the the Information Service.",
            "And this is a national germplasm system, is nice features so it IT services without any restrictions.",
            "The global Plantronics sources conservation use community.",
            "As already said, there is central information system.",
            "It is online.",
            "It is information about Roundabout 4, not 50,000 sessions.",
            "You can search in the in the information system, not only for the origin of material for the breeding history, but also for characterization and evaluation data in a very efficient way.",
            "And the MPGS distributes around about one or 21 or 30,000 sessions per year.",
            "250 nations worldwide.",
            "And as I said, without any restrictions.",
            "There is another interesting feature there is.",
            "They provide access to resisted.",
            "Trump wasn't releases, so this is pre bred material.",
            "And pre break material as several of you certainly know is very precious material because there is an investment of money into into this material and this these germplasm releases are made are also made available to the global user community.",
            "And.",
            "Well, it's it has never been calculated, but but Karen Williams.",
            "So the the head of the MPGS.",
            "Stated that the value of non monetary benefit sharing makes heat monitored monetary benefit arising of the commercial gains of.",
            "Variety."
        ],
        [
            "Selling.",
            "How do we do this in Europe?",
            "In Europe we we are on on the way of developing the European.",
            "System that serves D plant related resources.",
            "Use community.",
            "I mentioned already that European Genebanks national genebanks altogether hold 1.1 million sessions.",
            "I mentioned already the number of multilateral system is sessions.",
            "Um but.",
            "The creation of of a very effective and efficient European.",
            "GenBank system, which we call at the moment the virtual European gene Mangus is a very slow process as you see.",
            "As you can see from these 1 million sessions, only 50,000 a sessions have been integrated in what we call the European virtual GenBank.",
            "It's."
        ],
        [
            "We so this is a small team of colleagues from from the judging bank.",
            "The Nordic Region Bank and and, uh, set the Area Screen Institute.",
            "We were a bit of concerned about this slow development and.",
            "Performed a spot analyzes within the framework of the.",
            "You project, called PGO secure.",
            "It was in fact a series of semi structured interviews in different countries, so 120 interviews and online questionnaire.",
            "But finally and more important, we invited.",
            "We invited 80 experts from 21 countries to attend to workshop and to discuss the issues of conservation and sustainable use of punching."
        ],
        [
            "Resources in Europe.",
            "And I'm not coming almost to the end.",
            "We feel.",
            "I would not say unanimously, but a larger group of the attendant with the participants of this workshop felt that European plant room plasm system would be a great contribution to the global user community.",
            "And it may ease the often conflicting discussion or conflicting debate of the benefit sharing issue.",
            "Between the contracting parties of the treaty.",
            "The interesting thing is that we that we European, that European institutions had already created elements of European plant room plasm system which could look like similar to the one of the United States.",
            "We have a central information facility, unfortunately without.",
            "The evaluation and characterization data we have well organized jumpers and collections.",
            "We are running a lot of evaluation projects.",
            "We have um, well, the European corporative program function that resources could be could be could be developed to some sort of plant germplasm committee like in the United States.",
            "We have good taxonomy institutions in Birmingham for example, so there are many elements in Europe that could be used for building and PGS like structure in Europe, but Oh well intent.",
            "Bloody mere ask me I should be a bit provocative, so this is a bit more provocation we.",
            "We, European countries, European countries altogether spent 2 to 3 million euro to support the European cooperative program for plunging into resources.",
            "And that is in a funding.",
            "Between 2007 and 2013.",
            "From the EU, spends 22 billion euro for agro environmental measures.",
            "And if you read the reports of the court, the European Court.",
            "Um?",
            "This money is almost spent without traceable effects on biodiversity, so we would we would suggest to take a little bit of this money and to establish an European planter and pleasant system that really functions and benefits the user community."
        ],
        [
            "Yeah, so this is the summary.",
            "So, breeding research and breeding contributes to plant health and yield progress.",
            "Breeding is sustainable provided that genetic resources are available and accessible physically and politically.",
            "Access conditions are ruled by the International Treaty on Plant Genetic Resources and the failure of Multilateral System of the Treaty will constrain access to plunging it resources.",
            "Non monetary benefit sharing systems should be developed.",
            "And one of these non monetary benefit sharing systems could be a European plant replacement system.",
            "Yes, thank you for your attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good morning to everybody.",
                    "label": 0
                },
                {
                    "sent": "So I'm from the Institute of Breeding, Research, and agricultural crops.",
                    "label": 1
                },
                {
                    "sent": "This is part of a research institution that does research, but this also said was also set up by our ministry to provide political advice to our ministry in.",
                    "label": 0
                },
                {
                    "sent": "Particular to in on our case, in particular to issues concerning genetic resources in plant breeding.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "My lecture will.",
                    "label": 0
                },
                {
                    "sent": "Well, we have three major topics, so this is reading as a complex system, so I will briefly describe.",
                    "label": 1
                },
                {
                    "sent": "How breeding functions are will describe some conditions for sustainable plant breeding.",
                    "label": 1
                },
                {
                    "sent": "Later on.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Some come too.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Do you, which we called European drum plasm system.",
                    "label": 0
                },
                {
                    "sent": "So the challenges we meet in agriculture have already been described yesterday.",
                    "label": 0
                },
                {
                    "sent": "By one of the keynote speakers.",
                    "label": 0
                },
                {
                    "sent": "So this is foot in process quality, climate change, global food security, arable land means we need to produce more yield on less land, and agriculture has to respect agrobiodiversity and, well, I would add biodiversity as such.",
                    "label": 1
                },
                {
                    "sent": "If you just look at the number of plant species we have in in Europe and which we call plant species for Food and Agriculture, and then we're talking about 7000 round about 7000 plant species in Europe, which we have to care about.",
                    "label": 1
                },
                {
                    "sent": "So the task of plant breeding is to adapt crops to all these conditions and the indispensable basis for plant breeding.",
                    "label": 0
                },
                {
                    "sent": "Obviously is genetic resources.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Plant breeders utilize Blanton net resources, but they do not only utilize planting net resources, they are increasingly engaged in the conservation of plant genetic resources.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "You know, this pyramyd genetic diversity is brought at the basis when they talk about plant species living in the in the wild.",
                    "label": 1
                },
                {
                    "sent": "The conservation of plant species in the wild is called in situ conservation.",
                    "label": 1
                },
                {
                    "sent": "Which is not really a task of plant breeding, but plant breeders have to talk with plant conservation sector on the conservation status of wild plants in their natural habitat.",
                    "label": 0
                },
                {
                    "sent": "We talk about we have to consider the deployement of planting it resources in agricultural production systems is called sometimes called on farm conservation.",
                    "label": 0
                },
                {
                    "sent": "I'm breeding institutes, so most plant breeding institutes public re institutes in Europe run gene banks.",
                    "label": 0
                },
                {
                    "sent": "There are only very few gene banks that are completely independent.",
                    "label": 0
                },
                {
                    "sent": "Their task is to conserve congeneric resource, sexy to serve as seeds, deep frozen seed storage or plants in the field or as individual cultures.",
                    "label": 0
                },
                {
                    "sent": "These resources are then evaluated.",
                    "label": 0
                },
                {
                    "sent": "The data are recorded in information systems and made publicly available.",
                    "label": 1
                },
                {
                    "sent": "And then interesting sources and the pre breeding programs.",
                    "label": 0
                },
                {
                    "sent": "And finally you end up in the agricultural production system which much less genetic variation than at the start of the pyramid well illustrated.",
                    "label": 0
                },
                {
                    "sent": "You see a picture of.",
                    "label": 0
                },
                {
                    "sent": "Partially fully aware beana.",
                    "label": 0
                },
                {
                    "sent": "Performance.",
                    "label": 0
                },
                {
                    "sent": "Which is the the dawn of the nematode resistance or the system at all resistance seen in sugar beet?",
                    "label": 0
                },
                {
                    "sent": "And here is the product that you grow.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On plant breeding is soon.",
                    "label": 1
                },
                {
                    "sent": "It's a system with more or less connected and interdependent sectors.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Several of you may be astonished to see that I include Environment Protection into the discipline of plant breeding, but as I explained before, so we have a keen interest.",
                    "label": 0
                },
                {
                    "sent": "Plant breeders have a keen interest in the conservation of continental resource in their natural habitats.",
                    "label": 0
                },
                {
                    "sent": "We have the breeding research which is depending on the country in Europe, Morissette pre competitive sector, we have the competitive sector and the crop production where the product of plant breeding is being deployed.",
                    "label": 0
                },
                {
                    "sent": "And depending on how we how we use this product in agricultural in the agricultural practice practice, it may have positive or negative aspects on biodiversity in the natural habitat.",
                    "label": 0
                },
                {
                    "sent": "So the this should be taken almost taken into consideration the role of plant protection research is located here, so we cooperate very closely with.",
                    "label": 0
                },
                {
                    "sent": "With you from the plant protection sector, especially in the development of an evaluation method which I used for phenotyping, not you story.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Need it.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "It's very clear that sustainable agriculture can only be developed if the disciplines that are part of the agricultural systems are in it self sustainable.",
                    "label": 0
                },
                {
                    "sent": "So this was a question that we have debated in the scientific board.",
                    "label": 0
                },
                {
                    "sent": "Of the Ministry of Agriculture.",
                    "label": 0
                },
                {
                    "sent": "Very intensively, I will start this discussion with a provocative statement of Australian scientist Cowling.",
                    "label": 0
                },
                {
                    "sent": "And he said sustainable plant breeding can be defined as productive and competitive breeding that is achieved without loss of genetic diversity in the leader breeding pool during the professional career of breed.",
                    "label": 0
                },
                {
                    "sent": "And so the emphasis is.",
                    "label": 0
                },
                {
                    "sent": "Professional career of the Breedam.",
                    "label": 0
                },
                {
                    "sent": "This is a bit sceptic description of what breeders do.",
                    "label": 0
                },
                {
                    "sent": "We have tried to to define the conditions for sustainable plant breeding.",
                    "label": 0
                },
                {
                    "sent": "And this is threefold.",
                    "label": 0
                },
                {
                    "sent": "Sustainable plant breeding does not deplete the used resources.",
                    "label": 0
                },
                {
                    "sent": "That is, the breeding gene pool.",
                    "label": 0
                },
                {
                    "sent": "It operates resources as self regulatory populations with high adaptiveness.",
                    "label": 0
                },
                {
                    "sent": "And breeding at the products of breeding have no negative impacts on other resources.",
                    "label": 0
                },
                {
                    "sent": "These are the conditions.",
                    "label": 0
                },
                {
                    "sent": "These conditions have been investigated.",
                    "label": 0
                },
                {
                    "sent": "Several officer just take out on.",
                    "label": 0
                },
                {
                    "sent": "Eastern close, a colleague of mine and he found that there is steady breeding progress in winter and spring barley breeding varieties over a range of decades.",
                    "label": 1
                },
                {
                    "sent": "You notice to loss of genetic diversity in the reading material and varieties, but these were compensated by gains in the gains come from introgression of exotic material, including wild species.",
                    "label": 0
                },
                {
                    "sent": "Volume meter study which was implemented by fund of also team of the Dutch GenBank found that there is no gradual narrowing of the genetic base of the varieties released by breeders in the number of crops.",
                    "label": 1
                },
                {
                    "sent": "That is, wheat, barley, corn, or P rice and soybean.",
                    "label": 1
                },
                {
                    "sent": "And more recent paper showed that yield progress.",
                    "label": 0
                },
                {
                    "sent": "And wheat, barley, corn, Rye, canola, sugarbeet, perennial, ryegrass, Italian ryegrass was mainly caused by genetic enhancement during the past 20 years.",
                    "label": 1
                },
                {
                    "sent": "And they notice a very interesting effect, namely that breeding for the genetic, genetically determined breeding progress is still still going on, but the realized yield in agriculture production system.",
                    "label": 1
                },
                {
                    "sent": "But there is a gap between genetic progress and the yield realized in agricultural production systems.",
                    "label": 0
                },
                {
                    "sent": "So we could stay that.",
                    "label": 0
                },
                {
                    "sent": "Breeding in itself is sustainable provided to plant genetic resources are conserved, so are available too.",
                    "label": 0
                },
                {
                    "sent": "To replenish the breeding pools and the Gray one.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'll come back later to it, but the due to the way we are living humans or living on Earth, we are jeopardizing the very plant species that would help mitigating the negative effects of our societies on the environment.",
                    "label": 1
                },
                {
                    "sent": "And I will give only two examples.",
                    "label": 1
                },
                {
                    "sent": "Have a look outside of Europe.",
                    "label": 0
                },
                {
                    "sent": "South America and Middle America.",
                    "label": 0
                },
                {
                    "sent": "Central America is the home of crop wild relatives of potato, so they're quite large.",
                    "label": 0
                },
                {
                    "sent": "Number of species which have a number of jobs, which is very important source for virus resistance.",
                    "label": 0
                },
                {
                    "sent": "With tough draw, investments, resistance and many more, but.",
                    "label": 0
                },
                {
                    "sent": "Model study of Jarvis at all.",
                    "label": 1
                },
                {
                    "sent": "It was shown that climate change will reduce the range of these 180 so long the species to a large extend and even the Patch size of the area.",
                    "label": 1
                },
                {
                    "sent": "Basically specific species growing and to me it seems only logical that this will inevitably diminish genetic diversity available to potato breeding from now to the year 2050.",
                    "label": 0
                },
                {
                    "sent": "So this was the time scale of the investigation.",
                    "label": 0
                },
                {
                    "sent": "So within Europe.",
                    "label": 0
                },
                {
                    "sent": "On a team around.",
                    "label": 1
                },
                {
                    "sent": "The people from the from the University of Birmingham.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Invested the threat status of round about 570 croplands.",
                    "label": 1
                },
                {
                    "sent": "Beijing is crop wild relative species that are distributed and in Europe.",
                    "label": 0
                },
                {
                    "sent": "Seva homed in Europe and 11.5% of these species are threatened.",
                    "label": 0
                },
                {
                    "sent": "This seems not to be much, but among these species were important, generous, such as asparagus, ovina, beta Brassica.",
                    "label": 0
                },
                {
                    "sent": "So this.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is something we should be concerned about?",
                    "label": 0
                },
                {
                    "sent": "I'm well just to illustrate 1 one of the general it is the party folia general, known as lead owner of nematode resistance in sugar beet breeding.",
                    "label": 0
                },
                {
                    "sent": "The species is as we know, since recently not very well conserved.",
                    "label": 0
                },
                {
                    "sent": "Excitement gene banks.",
                    "label": 0
                },
                {
                    "sent": "And due to a number of biological features, the species should better be conserved in seed within the natural hobby part.",
                    "label": 0
                },
                {
                    "sent": "Which is depicted here where it can continue as.",
                    "label": 0
                },
                {
                    "sent": "Self regenerating.",
                    "label": 0
                },
                {
                    "sent": "The populations.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What I'm coming now bit too too political theme.",
                    "label": 0
                },
                {
                    "sent": "Breeding in itself is sustainable provided that breeders have uncomplicated access to genetic resources.",
                    "label": 1
                },
                {
                    "sent": "Access means technical access or physical access, so access to information, health information systems or to the physical sources so seeds or plantlets, or to plant material that is that exists in the natural habitat.",
                    "label": 0
                },
                {
                    "sent": "But in particular means political access.",
                    "label": 1
                },
                {
                    "sent": "Which is determined by international regulatory frameworks.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The most prominent.",
                    "label": 0
                },
                {
                    "sent": "International Agreement is the international Treaty on Plant in every sources for Food and Agriculture.",
                    "label": 1
                },
                {
                    "sent": "The contracting parties of this international treaty have established multilateral system and the multilateral system serves two purposes it should facilitate.",
                    "label": 1
                },
                {
                    "sent": "In access to planting native resources and associated information, but more important in the political debate is how to share the benefits arising from the utilization punctuated resources in a fair and equitable way.",
                    "label": 1
                },
                {
                    "sent": "For that purpose, the multilateral system uses a standard material transfer agreement.",
                    "label": 0
                },
                {
                    "sent": "So if you approach it, if you approach a GenBank and order a genetic resource, you have to sign a standard material agreement for all the sessions that are nominated as multilateral system sessions.",
                    "label": 0
                },
                {
                    "sent": "And under certain conditions, mandatory payments into the treaties benefit sharing funds are triggered, and particularly if a breeding line or a variety that was created on the basis of a genetic resource.",
                    "label": 0
                },
                {
                    "sent": "For which you have signed the Material Transfer agreement is patented.",
                    "label": 0
                },
                {
                    "sent": "In that case, obligatory payments are.",
                    "label": 0
                },
                {
                    "sent": "Triggered.",
                    "label": 0
                },
                {
                    "sent": "But in most places, in most cases use.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We are encouraged to make voluntary payments and you can imagine what happens if someone is asked to make a voluntary payment.",
                    "label": 0
                },
                {
                    "sent": "Um, so breeding progress in Europe depends to a large extent on access to plant genetic resources existing outside of Europe.",
                    "label": 1
                },
                {
                    "sent": "Showcase was potato.",
                    "label": 1
                },
                {
                    "sent": "And the functioning of the multilateral system is for for US readers in Europe of high importance.",
                    "label": 0
                },
                {
                    "sent": "But to date.",
                    "label": 0
                },
                {
                    "sent": "And this is taken from a study that was initiated by Bioversity International in Rome.",
                    "label": 1
                },
                {
                    "sent": "To date, a large number of contracting parties have failed to make all or part of their punching resources available.",
                    "label": 0
                },
                {
                    "sent": "To the multilateral system.",
                    "label": 0
                },
                {
                    "sent": "Europe is not not very well off, so Europe only contributes 30% of the 1.1 million recessions kept in our gene banks.",
                    "label": 0
                },
                {
                    "sent": "And the problem that may may make what will come will come up is that the Treaties benefit sharing fund is not filled up with money.",
                    "label": 0
                },
                {
                    "sent": "So there are model model.",
                    "label": 0
                },
                {
                    "sent": "Modern models applied to estimate the annual income of this benefit sharing fund until the year 2080, and I doubt that we have time to wait until 2080 until we have 97 billion US dollar value annually for and this is the purpose of the benefit sharing fund for funding the maintenance of plant genetic resources in the center of origin.",
                    "label": 0
                },
                {
                    "sent": "These centers are often located in countries that are more or less poor.",
                    "label": 0
                },
                {
                    "sent": "Or a more conservative estimate says that we will have by the year 20 thirty 10,000,000 US dollar in the benefit sharing form.",
                    "label": 0
                },
                {
                    "sent": "And if you, if you have once applied to U project, you know how much you project costs between 3 and 5 million.",
                    "label": 0
                },
                {
                    "sent": "Euro then you have the relation we are talking about.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the problem is if the multi rattle the system fails to generate the amount of monetary benefits expected by countries located in center of the versity.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Then these countries may not provide their resources.",
                    "label": 0
                },
                {
                    "sent": "Very effectively.",
                    "label": 0
                },
                {
                    "sent": "And constraints in that will delay the creation of varieties that can cope with the challenges.",
                    "label": 1
                },
                {
                    "sent": "Agriculture is facing today.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On the non military benefit sharing may be a way out of this problem and a good example is the national germplasm system of the United States in.",
                    "label": 1
                },
                {
                    "sent": "Well, it's located in Fort Collins and in Beltsville from Fort Collins to the collection and Beltsville the the Information Service.",
                    "label": 1
                },
                {
                    "sent": "And this is a national germplasm system, is nice features so it IT services without any restrictions.",
                    "label": 1
                },
                {
                    "sent": "The global Plantronics sources conservation use community.",
                    "label": 0
                },
                {
                    "sent": "As already said, there is central information system.",
                    "label": 0
                },
                {
                    "sent": "It is online.",
                    "label": 0
                },
                {
                    "sent": "It is information about Roundabout 4, not 50,000 sessions.",
                    "label": 0
                },
                {
                    "sent": "You can search in the in the information system, not only for the origin of material for the breeding history, but also for characterization and evaluation data in a very efficient way.",
                    "label": 0
                },
                {
                    "sent": "And the MPGS distributes around about one or 21 or 30,000 sessions per year.",
                    "label": 0
                },
                {
                    "sent": "250 nations worldwide.",
                    "label": 1
                },
                {
                    "sent": "And as I said, without any restrictions.",
                    "label": 0
                },
                {
                    "sent": "There is another interesting feature there is.",
                    "label": 0
                },
                {
                    "sent": "They provide access to resisted.",
                    "label": 0
                },
                {
                    "sent": "Trump wasn't releases, so this is pre bred material.",
                    "label": 1
                },
                {
                    "sent": "And pre break material as several of you certainly know is very precious material because there is an investment of money into into this material and this these germplasm releases are made are also made available to the global user community.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Well, it's it has never been calculated, but but Karen Williams.",
                    "label": 0
                },
                {
                    "sent": "So the the head of the MPGS.",
                    "label": 1
                },
                {
                    "sent": "Stated that the value of non monetary benefit sharing makes heat monitored monetary benefit arising of the commercial gains of.",
                    "label": 0
                },
                {
                    "sent": "Variety.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Selling.",
                    "label": 0
                },
                {
                    "sent": "How do we do this in Europe?",
                    "label": 0
                },
                {
                    "sent": "In Europe we we are on on the way of developing the European.",
                    "label": 0
                },
                {
                    "sent": "System that serves D plant related resources.",
                    "label": 0
                },
                {
                    "sent": "Use community.",
                    "label": 0
                },
                {
                    "sent": "I mentioned already that European Genebanks national genebanks altogether hold 1.1 million sessions.",
                    "label": 1
                },
                {
                    "sent": "I mentioned already the number of multilateral system is sessions.",
                    "label": 0
                },
                {
                    "sent": "Um but.",
                    "label": 0
                },
                {
                    "sent": "The creation of of a very effective and efficient European.",
                    "label": 0
                },
                {
                    "sent": "GenBank system, which we call at the moment the virtual European gene Mangus is a very slow process as you see.",
                    "label": 1
                },
                {
                    "sent": "As you can see from these 1 million sessions, only 50,000 a sessions have been integrated in what we call the European virtual GenBank.",
                    "label": 0
                },
                {
                    "sent": "It's.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We so this is a small team of colleagues from from the judging bank.",
                    "label": 0
                },
                {
                    "sent": "The Nordic Region Bank and and, uh, set the Area Screen Institute.",
                    "label": 0
                },
                {
                    "sent": "We were a bit of concerned about this slow development and.",
                    "label": 0
                },
                {
                    "sent": "Performed a spot analyzes within the framework of the.",
                    "label": 0
                },
                {
                    "sent": "You project, called PGO secure.",
                    "label": 0
                },
                {
                    "sent": "It was in fact a series of semi structured interviews in different countries, so 120 interviews and online questionnaire.",
                    "label": 1
                },
                {
                    "sent": "But finally and more important, we invited.",
                    "label": 0
                },
                {
                    "sent": "We invited 80 experts from 21 countries to attend to workshop and to discuss the issues of conservation and sustainable use of punching.",
                    "label": 1
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Resources in Europe.",
                    "label": 0
                },
                {
                    "sent": "And I'm not coming almost to the end.",
                    "label": 0
                },
                {
                    "sent": "We feel.",
                    "label": 0
                },
                {
                    "sent": "I would not say unanimously, but a larger group of the attendant with the participants of this workshop felt that European plant room plasm system would be a great contribution to the global user community.",
                    "label": 1
                },
                {
                    "sent": "And it may ease the often conflicting discussion or conflicting debate of the benefit sharing issue.",
                    "label": 1
                },
                {
                    "sent": "Between the contracting parties of the treaty.",
                    "label": 1
                },
                {
                    "sent": "The interesting thing is that we that we European, that European institutions had already created elements of European plant room plasm system which could look like similar to the one of the United States.",
                    "label": 0
                },
                {
                    "sent": "We have a central information facility, unfortunately without.",
                    "label": 0
                },
                {
                    "sent": "The evaluation and characterization data we have well organized jumpers and collections.",
                    "label": 1
                },
                {
                    "sent": "We are running a lot of evaluation projects.",
                    "label": 0
                },
                {
                    "sent": "We have um, well, the European corporative program function that resources could be could be could be developed to some sort of plant germplasm committee like in the United States.",
                    "label": 0
                },
                {
                    "sent": "We have good taxonomy institutions in Birmingham for example, so there are many elements in Europe that could be used for building and PGS like structure in Europe, but Oh well intent.",
                    "label": 0
                },
                {
                    "sent": "Bloody mere ask me I should be a bit provocative, so this is a bit more provocation we.",
                    "label": 0
                },
                {
                    "sent": "We, European countries, European countries altogether spent 2 to 3 million euro to support the European cooperative program for plunging into resources.",
                    "label": 0
                },
                {
                    "sent": "And that is in a funding.",
                    "label": 0
                },
                {
                    "sent": "Between 2007 and 2013.",
                    "label": 0
                },
                {
                    "sent": "From the EU, spends 22 billion euro for agro environmental measures.",
                    "label": 0
                },
                {
                    "sent": "And if you read the reports of the court, the European Court.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "This money is almost spent without traceable effects on biodiversity, so we would we would suggest to take a little bit of this money and to establish an European planter and pleasant system that really functions and benefits the user community.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, so this is the summary.",
                    "label": 0
                },
                {
                    "sent": "So, breeding research and breeding contributes to plant health and yield progress.",
                    "label": 1
                },
                {
                    "sent": "Breeding is sustainable provided that genetic resources are available and accessible physically and politically.",
                    "label": 1
                },
                {
                    "sent": "Access conditions are ruled by the International Treaty on Plant Genetic Resources and the failure of Multilateral System of the Treaty will constrain access to plunging it resources.",
                    "label": 1
                },
                {
                    "sent": "Non monetary benefit sharing systems should be developed.",
                    "label": 0
                },
                {
                    "sent": "And one of these non monetary benefit sharing systems could be a European plant replacement system.",
                    "label": 0
                },
                {
                    "sent": "Yes, thank you for your attention.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": []
        }
    }
}