{
    "id": "g5hguooqb3z4t5crr277u2jdtmq6nor6",
    "title": "Predicting Positive and Negative Links in Online Social Networks",
    "info": {
        "author": [
            "Jure Leskovec, Computer Science Department, Stanford University"
        ],
        "published": "May 17, 2010",
        "recorded": "April 2010",
        "category": [
            "Top->Computer Science->Network Analysis->Social Networks"
        ]
    },
    "url": "http://videolectures.net/www2010_leskovec_ppn/",
    "segmentation": [
        [
            "So far this is great, so you get $2 for the price of 1, so here's the."
        ],
        [
            "So this is joint work with Daniel function Market and John Kleinberg from Cornell, and the title is predicting positive and negative means in social networks.",
            "OK, so here is what we have today, right?",
            "So today there is rich social structure in online computing applications.",
            "And here I'm just showing you a few of these online or computing applications that they all exhibit reach social structures.",
            "And when you have such social structures, a natural way to model these structures is to use networks right so?",
            "This interactions in the form of a network for uniform or social network, right?",
            "And most of the analysis of social networks up-to-date focus on.",
            "Or if you disconnections are positive connections meaning.",
            "Create a connection.",
            "Which two people?",
            "If they exchange a message or if they are friends with one another or 41 follows the other and so on right?",
            "So it's A kind of positive connection but in in real life many connections are actually also negative.",
            "So in generally links can be sort of both taken way they can provide some kind of friendships or they can convey some kind of attack on terrorism.",
            "Sort of something negative."
        ],
        [
            "So the plan for this park or the plan for our work was to study social interactions on the web that are both positive and negative, right?",
            "So we want to study networks where we have positive and negative edges and I'll come to the case where where we see corrections happen and the basic question.",
            "Then you see if you have no network that have reached the kinds of edges, how do signs and the network structure?",
            "How do they interact and what kind of configurations of these positive and negative edges are plausible in real life?",
            "So in order to study this?",
            "Projects are through this might be called Epstein prediction problem where basically the here I use a detective.",
            "The idea is that you are given a network, let's say a directed network where every connection of the network as a sign associated with a positive or negative side and then we are interested you know that there is a connection between a pair of people, but we hide the sign and the question is what is the side of this edge that I would like to predict.",
            "So basically the question is can I predict the sign of an engine the network given the rest of the network and all the other signs in the network?",
            "And there are many very natural applications for this, so for example friendly combination in social media is one such example.",
            "Example of applications where this will come very handy, because right it turns out that it's sort of.",
            "It's an easier problem to predict who's a friend with whom versus to predict.",
            "What will you think of another person, right?",
            "So this is it's one level beyond the simple introduction, because it's yes it's a link.",
            "Or is it a positive or a negative thing?",
            "So it's sort of you are connecting waters.",
            "One person think of another person, not just does the person or the other person.",
            "OK, so then."
        ],
        [
            "Basically the 2nd and So what kind of datasets do we have or what kind of datasets will be looked at?",
            "So basically we look at the data sets of computing up online social computing applications or online online social networks where every edge is explicitly tagged with a sign right?",
            "So every edge has a sign associated with it and the users take these edges with science.",
            "So here are examples where this happens.",
            "So for example opinions is this big product review websites and there there is a social network that is part of this.",
            "Of this website where people create connections to other people and they say whether they trust this person's review or they don't trust these questions, right?",
            "So this is like who trash human put put, distrusts whom social network?",
            "The funny part of this network is that everyone can see or trust edges, but nobody sees your distrust edges right?",
            "So trust, trust edges are public while distrust edges are private to you and nobody else gets to see.",
            "So this is first data set.",
            "We look at the second data set we look at is actually Wikipedia.",
            "Administrative promotion process, which means that if you are a good editor then you may be at some time promoted to the level of administrator to get some additional rights and you can block articles and things like that.",
            "And in order for someone to become an administrator, there is a public problem.",
            "So basically people then come and they cast votes in support for in a pose of that candidate becoming an administrator, right?",
            "And this naturally forms now assigned network where there is a positive connection.",
            "If I voted combat person in favor of becoming an administrator.",
            "And there's a negative connection.",
            "If I was against someone being promoted to the level of administrator and then the last data set we looked at, his social network coming from other Slashdot Slashdot with Technology blog, where basically people create these friend info edges and the basic idea there is just to say, if you like someone's fallen, tag them as a friend.",
            "If you don't like someone's comments to the post that are posted on the blog that there was a problem and that's all.",
            "What this means, I should also set the better.",
            "Other examples where you naturally find positive and negative edges appearing, for example in World of Warcraft game, there are ways how we can create networks.",
            "Alphabet will have positive and negative values, but for us will focus on these three networks and basically here.",
            "Here is a quick summary.",
            "They have different 100,000 and 10,000 nodes or almost a million up to 100,000 edges and about 80% of the edges are positive in all our datasets OK?",
            "And I'm supposed to give you a preview of what you do, so here is."
        ],
        [
            "What we find or what is what I show details on.",
            "So the first thing is that is surprising is that we are able to predict the signs of these edges with 90% accuracy based on the local network structure.",
            "So basically all you need to do is you know the city of the edge you are interested in and you can predict it sign with 90%.",
            "Here's the other thing is that the models that we learn but we developed actually very nicely connect to the theories coming from the social psychology and I'll elaborate on that.",
            "And the other thing that's.",
            "Very surprising is that we get this near perfect generalization.",
            "So basically what I mean by that is that I can train my model on how people vote on one another and I can use this model to predict how people trust one another as well as if I would trade my model on the right.",
            "Basically regard for you know, I can take who is friend or foe, which up with somebody and then use this model to predict how people vote on one another and then it works as well as if I would train the model on how people.",
            "Also it seems that these models are very general or the background mechanisms help create this positive and negative edges.",
            "Are much more general than the original applications of your study.",
            "OK, so that's basically the."
        ],
        [
            "What you talk about?",
            "So here, here is how we go about the problem right?",
            "So the way we do it is you just define it as a simple binary classification problem, right?",
            "So I'm given a network and I would like to predict the sign of this ad unit right?",
            "And then I will have positive examples which are positive edges.",
            "Another have negative examples which are negative negative edges.",
            "This is my glass table.",
            "The learning algorithm will I be uses a simple logistic regression where the idea is that I will describe instead with a with a set of features like all these features access?",
            "And then my training algorithm, learning these weights be here OK. And then this is how my model reward will do what the way we will evaluate this is using classification accuracy or area 100 curve.",
            "Just for simplicity I'll show you results for classification accuracy.",
            "But if you use our OC analysis, everything is pretty much the same.",
            "There are two datasets.",
            "How we mean there anyway, one is the original data set where there are 80% of positive edges, which means that random guessing would get.",
            "Distracting and the other one is when you subsample positive measures such that random guessing would only get half of their just correct, and then the rest of.",
            "Please let us know right?",
            "So yeah, yeah, if you would randomly guess the sign of the edge then you will get 50% of them.",
            "OK so now the next question is how do we design these feature vectors that go into this logistic regression here?"
        ],
        [
            "So the first, the first is that the way we think about this.",
            "If you're interested in predicting the side of this particular edge and what you do now is, we will simply count in what kind of trials is edges embedded into right?",
            "So here are 16 possible different trials in which this match could be a better right?",
            "So why, why there are 16 be cause for each of the two other edges?",
            "For each of these edges they can take one of the two directions, and they can take one of the two signs, and there are two of them, right?",
            "So in 16, oh such trials, and.",
            "I would just create like a vector of 60 numbers, where every number saved account.",
            "If this is the edge I'm interested in predicting, how often does it occur in such tracks often?",
            "Does it occur in such right and so right?",
            "And here's the edge.",
            "So then match down here.",
            "OK, this gives me the first 16 features and the other seven features that will consider RDP, so they are just basically about signed the lease.",
            "So I'm interested in what is the positive algebra of you.",
            "So you is this person called negative.",
            "Do an activity for week which is the target to sign in degree so positive and negative.",
            "Also totally out of you and totally individual free and then embeddedness on edge.",
            "We just means in how many total prize as research participants.",
            "OK so this is the feature vectors that we wanted and if now is around my logistics regression to 10 fold cross validation and measure."
        ],
        [
            "Classification accuracy.",
            "Here are the results.",
            "So what I'm showing you here is the three datasets or this is the subsample training as data set such that the random dancing get 50% of the edges right?",
            "And these are the three sets of features.",
            "These are the 7 degree features, 16 prior features and combined 60 + 7 + 723.",
            "So all 23 features and of each bar course is trained where we're making.",
            "Here is the minimum balance, right?",
            "So the point is that.",
            "If your edge or participates in very few times, then sort of your feature vectors are very sparse and here we are just controlling for how embedded is electric.",
            "But regardless of that the main point is that if randomness 50% point 5, our methods to around 5:00 PM done right.",
            "So for special for appearance my basically we do around 95 and four Wikipedia.",
            "The classification accuracy is 80% right?",
            "And it's interesting to note that basically from this what we see is that.",
            "We're able to do these predictions quite reliably, and the science can be can be predicted based on the local network structure on.",
            "What I mean is all we need to know in what kind of trials is edge.",
            "This edge participates in, right?",
            "And basically never ate together about twice as good as if you are using.",
            "There is a kind of global trust propagation mechanism, for example, as the one from who I told in 2004.",
            "Of course, what you see also is that for example, track features perform less well one when your your future metrics are very sparse.",
            "Meaning when when your, when your edges are less well than that.",
            "OK, so that's sort of the."
        ],
        [
            "Sample result second thing is if you want to connect with some of the theories coming from the social social psychology.",
            "Here's a very nice way how you can do this right?",
            "So our goal is not just to say to previous times, but get some deeper insight in how people create these sites, right?",
            "And what we're basically doing is that what you just conversion is doing this basically for every feature it's learning.",
            "It's wait here, right?",
            "And this is exactly how I can now make this connection becausw in social psychology.",
            "There are these two theories about how this sign.",
            "Tires are being formed, then they go under the name of structural balance and the other one is.",
            "Serial statements and what is interesting is that these both theories.",
            "They also make predictions about what will be the sign of this particular edge given the neighborhood in the network, right?",
            "So these things are sort of human made and they also make predictions of this sort, which is exactly the same what logistic regression is doing.",
            "So let me know tell you what balances and what statements."
        ],
        [
            "OK, so the the probably the simplest way how to reason about positive and negative edges is to start with this very simple intuition like frame of my friend is my friend, enemy of my enemy is my friend, then my friends enemies, my enemies right now if I say OK, what kind of trials are consistent with this with this picture here and the three of them right?",
            "I'm saying if this is the edge I'm interested in predicting friend of my friend is my friend right?",
            "Or this one is saying enemy of my enemy is my friend right?",
            "And this last one is saying?",
            "My friends enemies lying right?",
            "So this is naturally.",
            "Basically it's almost like learning coefficients in the logistic regression, right?",
            "It says if you if the if the.",
            "Edge that you're interested in predicting participates in such tracks.",
            "Predict the minus if it participates in such threads.",
            "Predictor plus right?",
            "So that's one way how to produce.",
            "So there is also a ternative interpretation of this sign measures and what we call status here, right?"
        ],
        [
            "So yeah, here is that these pluses and minuses, positive and negative edges, actually meaning some kind of status relationships, right?",
            "So if no new gives a positive sign, fill out to be.",
            "This means that we have higher status than you, and similarly if they give them a negative sizes means you can because global status menu right and what is interesting is that both the two theories balancing status they give different predictions.",
            "So here's here's an example, right?",
            "So you give the negative edge 2X and gives a negative edge to read.",
            "So we're asking what would be the prediction here.",
            "So if I would apply the balance rule that says an enemy of my enemy is my friend, so I would predict the plus status.",
            "Would say you thinks is lower status than X means that B is even lower.",
            "So yes, you should think that means lower status than them, so that should be a minus here right off the bat is like there is activity status, we predict minus and then again.",
            "But if you actually make some other prediction here right and there are for example.",
            "Other cases where now in this case where clusters go the other way again, parents would say predict the plus statement would say predict the minus, and as you will see later logistic regression also same predictor minus for example.",
            "And here's the last example where you know X2.",
            "New connections in the question is what is the sudden?",
            "Again, balance would say predict the minus right?",
            "Because it says then you can locate where my friends enemy is.",
            "My enemy status would say predict the miners have adjusted version, for example cystic."
        ],
        [
            "So now if we go and train our model in this 16 triat types, here are basically the logistical regression coefficients.",
            "So what I'm showing you here is these are the 16 possible priors of my head before, so the edge that occurs between the 1st and the last, the last build, and we're interested in predicting what will be the sign of this edge right?",
            "And this would be the let's say coefficients in the logistic regression that would come from parents and are expanding in a bit.",
            "And these are the coefficients that would come from status.",
            "And, um, these are positions that we learn from our models and what is the point?",
            "The point is that this proficient naturally well right so, for example here, involved.",
            "I'm showing you 6 six largest absolute value coefficients and they match across the data center, right?",
            "So now we go into a bit more detail.",
            "Let me sort of tell you what are your."
        ],
        [
            "High level conclusions you can draw from this, so the first high level conclusion is that both of these theories, the status balance.",
            "They're very well with the models figure.",
            "The other things that we observe is for example this backward trials.",
            "So basically when at this point backward and we're interested in what happens with this connection here, such riots count plans.",
            "Then we said this point forward.",
            "So they basically their coefficients imagistic interaction are smaller, but you also find is that theory of balance basically.",
            "Ram of my friends my friend, work well in opinion since there is not.",
            "While status is a much better predictor in Wikipedia and we also find that balance is inconsistent in consistently disagrees with enemy of my enemy is my friend.",
            "So what happens in in this network is the enemy of my enemy is my enemy or something.",
            "So we had this like people that are that you had this like trials of three negative connection.",
            "So let me now go down and consider this aggregate."
        ],
        [
            "So here is what I'm showing up.",
            "So now what I'm doing is I'm throwing away edge directions and I'm just counting the.",
            "I could see that in four different run directed science projects.",
            "OK, and I'm interested in predicting this last engine based on the balance theory.",
            "This should mean friend of my friend is my friend, my friends enemies, my enemies.",
            "This is the other example and these are enemy of my enemy.",
            "Is my friend right?",
            "So if these are the features of features?",
            "Then this would be the coefficients that that logistic regression would would would use if people would operate based solely based on the structural balance theory and what I'm showing you here coefficients that we actually then learning the data and what you can see is that they match right?",
            "So here the theory says we should predict we should do something positive and my coefficients are positive.",
            "Here it says we should have something negative and yes my coefficients are negative and this last one.",
            "He says we should be positive, but my coefficients are negative, right?",
            "So this is the case of dimension before any of my enemy is not my friend, but my enemy also.",
            "OK, so this is the first case, and similarly we can do the same case where we are aggregating the 16 trials into smaller now."
        ],
        [
            "Decide which status right.",
            "So now we say this I only get predictions for when I get.",
            "You know you miss less than X axis has indeed or the other way around, and I don't say anything when I have places like that.",
            "So basically just to show you what's going on.",
            "For example for this.",
            "For this case here in the fourth try as a tablet or collapse together, right?",
            "So with all these four trials, you have higher status in because the lower status, right?",
            "Either use this like.",
            "Or if you know minus start finding the other version, but the point again is that the coefficients return are correspond very nicely to what this theory sense."
        ],
        [
            "So this is the first thing.",
            "The second thing is that I can also compare the predictive accuracy of this model, but I basically had created versus the models I learn and just to make it short, these are these different models and what you can see is that basically this deterministic models that come from the social psychology pretty much work as well as the model side playing using machine learning that are sort of they are compatible."
        ],
        [
            "Bump in the last thing that I would like to explain is the following, right?",
            "So we would like to understand how general artistic right I showed you so very very different datasets in a sense that we have this working data set.",
            "We have to transform data set and then we have this friend and foe data set right?",
            "And the question is, how generalizable are our models for our results, right?",
            "So one way to test for this is this is a simple way where we basically say let's train on one data set and let's try to make predictions from the other matrices.",
            "And for example, here are the results, so I'm training on the road because it I'm turning my logistical regression model on the temporal data set.",
            "But then I predict on the way I evaluate it on the column data set, right?",
            "So what this is saying is when I use my model on opinions Network and I test it on opinions, I get 93.",
            "But if I use the same model and use it to predict which who's friend with whom, I do 92 and you know if I do it on Wikipedia had 77 but the point is if I would now train the model on Wikipedia itself.",
            "And we only get paid right?",
            "So basically only losing about 2 percentage points when I train a model on a very different data set, and I predict the current agency right?",
            "So basically what this means is that these models are super generalized super well, even though this settings under which people were semantics of these edges are very different trustees.",
            "Friendship is whether you support someone or not, but again, the model work as well regardless of what you use for rich.",
            "Set of edges.",
            "Useful thing when you set of edges used for evaluation."
        ],
        [
            "And then the last.",
            "Find that goes to my first question.",
            "Is the following right?",
            "That's sort of does not include an enemy of cooling.",
            "Does it help even, for example, for predicting only positive edges right?",
            "So fast that I'm considering now is a little prediction task, I would like to know, is there an edge between these two people or not, so I don't get and I'm asking is there a positive edge or there is something else?",
            "OK, so I'm only interested in predicting whether there's a positive edge or something else and I'm interested in whether knowing who's an enemy of quick as this happy or not, right?",
            "So?",
            "I will train my model on the network, at least where I have positive and negative edges versus on a network like that where I remove the negative connections.",
            "And to make the domain and basically profession I'm asking, does knowing who's an enemy of whom does it can't even in predicting who knows who in some sense, and if there is, if their result that it does.",
            "And if randomly do sort of .5, we get a very significant improvement over.",
            "And when we are using now."
        ],
        [
            "Information.",
            "So, um and."
        ],
        [
            "Let me.",
            "Skip."
        ],
        [
            "And just briefly conclude.",
            "OK, so here is.",
            "Here's what we did, right?",
            "So basically we explored the sign, the structure of sign networks and they provide us some insight into how you do this, how social computing applications are being used, in particular, how do these mechanisms similar to the theories of status and balance I showed you that sign predictions can be can be done with any activity and you can do it with 90% plus precipitation accuracy.",
            "But there is this amazing generalization between.",
            "Between different data sets and also that negative information helps when you want to predict friendships and the last thing that I had to skip it.",
            "If you look at the global structure of these networks, they obeyed the status theory much more than the balance theory, right?",
            "Cause status makes your prediction that there should be some kind of global ordering from the notes from the note in the lower status will not be the higher status while balance.",
            "Nobody says that there should be this coalitions of actions where there are lots of edges between lots of friendships between.",
            "From factions and lots of negative connections across the board, and if you look at the global network structure again you find much more evidence for this status ordering of things across all three."
        ],
        [
            "So if you'd like to play with these positive and negative datasets and the data in the codes are available at this URL.",
            "So which is the first one?",
            "Thank you.",
            "Directions.",
            "OK. Metalink predicting the direction of the edge we had.",
            "So it turns out that about like only three to 5% of all the edges are reciprocals, so most of the edges are just really direction, meaning there's no backwards finding it.",
            "On one hand, we haven't looked at, but I think that's actually we have an experiment with that.",
            "We were doing this in the paper, so we looked at all, so it's in the paper.",
            "So we looked at the example.",
            "Looks like we looked at the case where we installed the direction, but we still wanted to.",
            "We didn't know the science building.",
            "You know.",
            "Directions at least wanted to predict the site, but we haven't looked at exactly predicting the direction, but it should be an easier problem because you could just workout the results from the logistic regression models, right?",
            "'cause when you do this right counts, you actually assume that the edge points from you to be right, which is the realistic exits you who's sort of pointing to you so you could easily.",
            "Yep.",
            "Generalized to specific weight on the family feud, but want to wait.",
            "So actually you should generally so the question was whether the generalization is fully across science, but also to wait.",
            "But actually it should be 2 weights also right?",
            "'cause we are talking like logistic regression is cutting that point half right?",
            "So I'm not changing this threshold, so actually I keep all the way.",
            "It's the same when I move from one data set to the other, right?",
            "So I'm keeping the model the same, so I'm actually yes I have.",
            "I should match the science and also the weights or at least relative proportions of buildings, right?",
            "So I do wedding classification accuracy.",
            "Just.",
            "OK, cool.",
            "The question was what?",
            "Wikipedia.",
            "Discuss Pop culture Department.",
            "Example demonstrations using page, so on some pages I can trust this person.",
            "Distress noted issues.",
            "So wait, you have used this kind of aggregational.",
            "I should make clear so it is not about whether you trust you or not.",
            "This is really an opinions you trust you as a user you create a connection to the person.",
            "So these are all explicit networks with explicit science.",
            "So when users create these edges, they're judging the other person, and when they when they create an edge, there is no way.",
            "Tell the site when the edges created, you have to sort of market plus or minus, so designs are created by users they're not involved in any way, and the networks again are explicitly are not inferred in anyway, so, but it's a very good question.",
            "So basically the point that was product is the following right?",
            "So whatever studying is a social network setting where nodes judge other nodes but actually the same, you could think of the same theory in at least sort of bipartite setting, where you have people judging by comes right, so we have now a bipartite graph where.",
            "People on the left are drug Lord.",
            "You know people on your right judge icons or 8 items on your right.",
            "So that's a different setting and we Even so the settings we were looking at these people judge other.",
            "So it's same entities judged other endpoints.",
            "Yes.",
            "So the question was do you do you need to go farther than two hops basically right?",
            "Given that, like I, I don't think there is a very good answer to that unless just just us to say that we know that in this online social networks more than 60% of the edges close primaries right when they move.",
            "So the first thing is probability of closing the triangle is like 2 orders of magnitude larger than linking to someone who speak up.",
            "So just if you look at how these networks evolve, so I think yes, you could extend it to paths of length three, but practically I don't think you would get it.",
            "Oh yes.",
            "How much, how much does preferential attachment?",
            "How much does preferential attachment and?",
            "Influences like that influence the model that you have with the triangles.",
            "Off be more specific, so the question was about how this preferential attachment influenced by model.",
            "Friend of a friend is also a friend of yours, but what if it is becausw that everyone is a friend of the specific user that everyone else wants to be friends with?",
            "The same user also?",
            "So that's why we had this degree features right where we didn't ask about what the context is, just how many positive edges will get from any negative edges together.",
            "And that as you see in the graphs were worse when you sort of know the directions and size of these trials.",
            "So we also the reason the degree features, which is it should be something that answers your question.",
            "OK."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So far this is great, so you get $2 for the price of 1, so here's the.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is joint work with Daniel function Market and John Kleinberg from Cornell, and the title is predicting positive and negative means in social networks.",
                    "label": 0
                },
                {
                    "sent": "OK, so here is what we have today, right?",
                    "label": 0
                },
                {
                    "sent": "So today there is rich social structure in online computing applications.",
                    "label": 1
                },
                {
                    "sent": "And here I'm just showing you a few of these online or computing applications that they all exhibit reach social structures.",
                    "label": 0
                },
                {
                    "sent": "And when you have such social structures, a natural way to model these structures is to use networks right so?",
                    "label": 0
                },
                {
                    "sent": "This interactions in the form of a network for uniform or social network, right?",
                    "label": 0
                },
                {
                    "sent": "And most of the analysis of social networks up-to-date focus on.",
                    "label": 0
                },
                {
                    "sent": "Or if you disconnections are positive connections meaning.",
                    "label": 0
                },
                {
                    "sent": "Create a connection.",
                    "label": 0
                },
                {
                    "sent": "Which two people?",
                    "label": 0
                },
                {
                    "sent": "If they exchange a message or if they are friends with one another or 41 follows the other and so on right?",
                    "label": 0
                },
                {
                    "sent": "So it's A kind of positive connection but in in real life many connections are actually also negative.",
                    "label": 0
                },
                {
                    "sent": "So in generally links can be sort of both taken way they can provide some kind of friendships or they can convey some kind of attack on terrorism.",
                    "label": 0
                },
                {
                    "sent": "Sort of something negative.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the plan for this park or the plan for our work was to study social interactions on the web that are both positive and negative, right?",
                    "label": 1
                },
                {
                    "sent": "So we want to study networks where we have positive and negative edges and I'll come to the case where where we see corrections happen and the basic question.",
                    "label": 1
                },
                {
                    "sent": "Then you see if you have no network that have reached the kinds of edges, how do signs and the network structure?",
                    "label": 0
                },
                {
                    "sent": "How do they interact and what kind of configurations of these positive and negative edges are plausible in real life?",
                    "label": 0
                },
                {
                    "sent": "So in order to study this?",
                    "label": 0
                },
                {
                    "sent": "Projects are through this might be called Epstein prediction problem where basically the here I use a detective.",
                    "label": 0
                },
                {
                    "sent": "The idea is that you are given a network, let's say a directed network where every connection of the network as a sign associated with a positive or negative side and then we are interested you know that there is a connection between a pair of people, but we hide the sign and the question is what is the side of this edge that I would like to predict.",
                    "label": 0
                },
                {
                    "sent": "So basically the question is can I predict the sign of an engine the network given the rest of the network and all the other signs in the network?",
                    "label": 0
                },
                {
                    "sent": "And there are many very natural applications for this, so for example friendly combination in social media is one such example.",
                    "label": 1
                },
                {
                    "sent": "Example of applications where this will come very handy, because right it turns out that it's sort of.",
                    "label": 1
                },
                {
                    "sent": "It's an easier problem to predict who's a friend with whom versus to predict.",
                    "label": 0
                },
                {
                    "sent": "What will you think of another person, right?",
                    "label": 0
                },
                {
                    "sent": "So this is it's one level beyond the simple introduction, because it's yes it's a link.",
                    "label": 0
                },
                {
                    "sent": "Or is it a positive or a negative thing?",
                    "label": 0
                },
                {
                    "sent": "So it's sort of you are connecting waters.",
                    "label": 0
                },
                {
                    "sent": "One person think of another person, not just does the person or the other person.",
                    "label": 0
                },
                {
                    "sent": "OK, so then.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Basically the 2nd and So what kind of datasets do we have or what kind of datasets will be looked at?",
                    "label": 0
                },
                {
                    "sent": "So basically we look at the data sets of computing up online social computing applications or online online social networks where every edge is explicitly tagged with a sign right?",
                    "label": 1
                },
                {
                    "sent": "So every edge has a sign associated with it and the users take these edges with science.",
                    "label": 0
                },
                {
                    "sent": "So here are examples where this happens.",
                    "label": 0
                },
                {
                    "sent": "So for example opinions is this big product review websites and there there is a social network that is part of this.",
                    "label": 0
                },
                {
                    "sent": "Of this website where people create connections to other people and they say whether they trust this person's review or they don't trust these questions, right?",
                    "label": 0
                },
                {
                    "sent": "So this is like who trash human put put, distrusts whom social network?",
                    "label": 0
                },
                {
                    "sent": "The funny part of this network is that everyone can see or trust edges, but nobody sees your distrust edges right?",
                    "label": 0
                },
                {
                    "sent": "So trust, trust edges are public while distrust edges are private to you and nobody else gets to see.",
                    "label": 0
                },
                {
                    "sent": "So this is first data set.",
                    "label": 0
                },
                {
                    "sent": "We look at the second data set we look at is actually Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "Administrative promotion process, which means that if you are a good editor then you may be at some time promoted to the level of administrator to get some additional rights and you can block articles and things like that.",
                    "label": 0
                },
                {
                    "sent": "And in order for someone to become an administrator, there is a public problem.",
                    "label": 0
                },
                {
                    "sent": "So basically people then come and they cast votes in support for in a pose of that candidate becoming an administrator, right?",
                    "label": 0
                },
                {
                    "sent": "And this naturally forms now assigned network where there is a positive connection.",
                    "label": 0
                },
                {
                    "sent": "If I voted combat person in favor of becoming an administrator.",
                    "label": 0
                },
                {
                    "sent": "And there's a negative connection.",
                    "label": 0
                },
                {
                    "sent": "If I was against someone being promoted to the level of administrator and then the last data set we looked at, his social network coming from other Slashdot Slashdot with Technology blog, where basically people create these friend info edges and the basic idea there is just to say, if you like someone's fallen, tag them as a friend.",
                    "label": 0
                },
                {
                    "sent": "If you don't like someone's comments to the post that are posted on the blog that there was a problem and that's all.",
                    "label": 0
                },
                {
                    "sent": "What this means, I should also set the better.",
                    "label": 1
                },
                {
                    "sent": "Other examples where you naturally find positive and negative edges appearing, for example in World of Warcraft game, there are ways how we can create networks.",
                    "label": 0
                },
                {
                    "sent": "Alphabet will have positive and negative values, but for us will focus on these three networks and basically here.",
                    "label": 0
                },
                {
                    "sent": "Here is a quick summary.",
                    "label": 0
                },
                {
                    "sent": "They have different 100,000 and 10,000 nodes or almost a million up to 100,000 edges and about 80% of the edges are positive in all our datasets OK?",
                    "label": 0
                },
                {
                    "sent": "And I'm supposed to give you a preview of what you do, so here is.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What we find or what is what I show details on.",
                    "label": 0
                },
                {
                    "sent": "So the first thing is that is surprising is that we are able to predict the signs of these edges with 90% accuracy based on the local network structure.",
                    "label": 1
                },
                {
                    "sent": "So basically all you need to do is you know the city of the edge you are interested in and you can predict it sign with 90%.",
                    "label": 0
                },
                {
                    "sent": "Here's the other thing is that the models that we learn but we developed actually very nicely connect to the theories coming from the social psychology and I'll elaborate on that.",
                    "label": 0
                },
                {
                    "sent": "And the other thing that's.",
                    "label": 1
                },
                {
                    "sent": "Very surprising is that we get this near perfect generalization.",
                    "label": 0
                },
                {
                    "sent": "So basically what I mean by that is that I can train my model on how people vote on one another and I can use this model to predict how people trust one another as well as if I would trade my model on the right.",
                    "label": 1
                },
                {
                    "sent": "Basically regard for you know, I can take who is friend or foe, which up with somebody and then use this model to predict how people vote on one another and then it works as well as if I would train the model on how people.",
                    "label": 0
                },
                {
                    "sent": "Also it seems that these models are very general or the background mechanisms help create this positive and negative edges.",
                    "label": 0
                },
                {
                    "sent": "Are much more general than the original applications of your study.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's basically the.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What you talk about?",
                    "label": 0
                },
                {
                    "sent": "So here, here is how we go about the problem right?",
                    "label": 0
                },
                {
                    "sent": "So the way we do it is you just define it as a simple binary classification problem, right?",
                    "label": 0
                },
                {
                    "sent": "So I'm given a network and I would like to predict the sign of this ad unit right?",
                    "label": 1
                },
                {
                    "sent": "And then I will have positive examples which are positive edges.",
                    "label": 0
                },
                {
                    "sent": "Another have negative examples which are negative negative edges.",
                    "label": 0
                },
                {
                    "sent": "This is my glass table.",
                    "label": 0
                },
                {
                    "sent": "The learning algorithm will I be uses a simple logistic regression where the idea is that I will describe instead with a with a set of features like all these features access?",
                    "label": 0
                },
                {
                    "sent": "And then my training algorithm, learning these weights be here OK. And then this is how my model reward will do what the way we will evaluate this is using classification accuracy or area 100 curve.",
                    "label": 0
                },
                {
                    "sent": "Just for simplicity I'll show you results for classification accuracy.",
                    "label": 0
                },
                {
                    "sent": "But if you use our OC analysis, everything is pretty much the same.",
                    "label": 0
                },
                {
                    "sent": "There are two datasets.",
                    "label": 0
                },
                {
                    "sent": "How we mean there anyway, one is the original data set where there are 80% of positive edges, which means that random guessing would get.",
                    "label": 0
                },
                {
                    "sent": "Distracting and the other one is when you subsample positive measures such that random guessing would only get half of their just correct, and then the rest of.",
                    "label": 0
                },
                {
                    "sent": "Please let us know right?",
                    "label": 0
                },
                {
                    "sent": "So yeah, yeah, if you would randomly guess the sign of the edge then you will get 50% of them.",
                    "label": 1
                },
                {
                    "sent": "OK so now the next question is how do we design these feature vectors that go into this logistic regression here?",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the first, the first is that the way we think about this.",
                    "label": 0
                },
                {
                    "sent": "If you're interested in predicting the side of this particular edge and what you do now is, we will simply count in what kind of trials is edges embedded into right?",
                    "label": 0
                },
                {
                    "sent": "So here are 16 possible different trials in which this match could be a better right?",
                    "label": 0
                },
                {
                    "sent": "So why, why there are 16 be cause for each of the two other edges?",
                    "label": 0
                },
                {
                    "sent": "For each of these edges they can take one of the two directions, and they can take one of the two signs, and there are two of them, right?",
                    "label": 0
                },
                {
                    "sent": "So in 16, oh such trials, and.",
                    "label": 0
                },
                {
                    "sent": "I would just create like a vector of 60 numbers, where every number saved account.",
                    "label": 0
                },
                {
                    "sent": "If this is the edge I'm interested in predicting, how often does it occur in such tracks often?",
                    "label": 0
                },
                {
                    "sent": "Does it occur in such right and so right?",
                    "label": 0
                },
                {
                    "sent": "And here's the edge.",
                    "label": 0
                },
                {
                    "sent": "So then match down here.",
                    "label": 0
                },
                {
                    "sent": "OK, this gives me the first 16 features and the other seven features that will consider RDP, so they are just basically about signed the lease.",
                    "label": 0
                },
                {
                    "sent": "So I'm interested in what is the positive algebra of you.",
                    "label": 0
                },
                {
                    "sent": "So you is this person called negative.",
                    "label": 0
                },
                {
                    "sent": "Do an activity for week which is the target to sign in degree so positive and negative.",
                    "label": 0
                },
                {
                    "sent": "Also totally out of you and totally individual free and then embeddedness on edge.",
                    "label": 0
                },
                {
                    "sent": "We just means in how many total prize as research participants.",
                    "label": 0
                },
                {
                    "sent": "OK so this is the feature vectors that we wanted and if now is around my logistics regression to 10 fold cross validation and measure.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Classification accuracy.",
                    "label": 0
                },
                {
                    "sent": "Here are the results.",
                    "label": 0
                },
                {
                    "sent": "So what I'm showing you here is the three datasets or this is the subsample training as data set such that the random dancing get 50% of the edges right?",
                    "label": 0
                },
                {
                    "sent": "And these are the three sets of features.",
                    "label": 0
                },
                {
                    "sent": "These are the 7 degree features, 16 prior features and combined 60 + 7 + 723.",
                    "label": 0
                },
                {
                    "sent": "So all 23 features and of each bar course is trained where we're making.",
                    "label": 0
                },
                {
                    "sent": "Here is the minimum balance, right?",
                    "label": 0
                },
                {
                    "sent": "So the point is that.",
                    "label": 0
                },
                {
                    "sent": "If your edge or participates in very few times, then sort of your feature vectors are very sparse and here we are just controlling for how embedded is electric.",
                    "label": 0
                },
                {
                    "sent": "But regardless of that the main point is that if randomness 50% point 5, our methods to around 5:00 PM done right.",
                    "label": 0
                },
                {
                    "sent": "So for special for appearance my basically we do around 95 and four Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "The classification accuracy is 80% right?",
                    "label": 0
                },
                {
                    "sent": "And it's interesting to note that basically from this what we see is that.",
                    "label": 0
                },
                {
                    "sent": "We're able to do these predictions quite reliably, and the science can be can be predicted based on the local network structure on.",
                    "label": 1
                },
                {
                    "sent": "What I mean is all we need to know in what kind of trials is edge.",
                    "label": 0
                },
                {
                    "sent": "This edge participates in, right?",
                    "label": 0
                },
                {
                    "sent": "And basically never ate together about twice as good as if you are using.",
                    "label": 0
                },
                {
                    "sent": "There is a kind of global trust propagation mechanism, for example, as the one from who I told in 2004.",
                    "label": 1
                },
                {
                    "sent": "Of course, what you see also is that for example, track features perform less well one when your your future metrics are very sparse.",
                    "label": 0
                },
                {
                    "sent": "Meaning when when your, when your edges are less well than that.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's sort of the.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sample result second thing is if you want to connect with some of the theories coming from the social social psychology.",
                    "label": 1
                },
                {
                    "sent": "Here's a very nice way how you can do this right?",
                    "label": 0
                },
                {
                    "sent": "So our goal is not just to say to previous times, but get some deeper insight in how people create these sites, right?",
                    "label": 1
                },
                {
                    "sent": "And what we're basically doing is that what you just conversion is doing this basically for every feature it's learning.",
                    "label": 0
                },
                {
                    "sent": "It's wait here, right?",
                    "label": 0
                },
                {
                    "sent": "And this is exactly how I can now make this connection becausw in social psychology.",
                    "label": 0
                },
                {
                    "sent": "There are these two theories about how this sign.",
                    "label": 0
                },
                {
                    "sent": "Tires are being formed, then they go under the name of structural balance and the other one is.",
                    "label": 1
                },
                {
                    "sent": "Serial statements and what is interesting is that these both theories.",
                    "label": 0
                },
                {
                    "sent": "They also make predictions about what will be the sign of this particular edge given the neighborhood in the network, right?",
                    "label": 0
                },
                {
                    "sent": "So these things are sort of human made and they also make predictions of this sort, which is exactly the same what logistic regression is doing.",
                    "label": 0
                },
                {
                    "sent": "So let me know tell you what balances and what statements.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so the the probably the simplest way how to reason about positive and negative edges is to start with this very simple intuition like frame of my friend is my friend, enemy of my enemy is my friend, then my friends enemies, my enemies right now if I say OK, what kind of trials are consistent with this with this picture here and the three of them right?",
                    "label": 1
                },
                {
                    "sent": "I'm saying if this is the edge I'm interested in predicting friend of my friend is my friend right?",
                    "label": 0
                },
                {
                    "sent": "Or this one is saying enemy of my enemy is my friend right?",
                    "label": 0
                },
                {
                    "sent": "And this last one is saying?",
                    "label": 0
                },
                {
                    "sent": "My friends enemies lying right?",
                    "label": 0
                },
                {
                    "sent": "So this is naturally.",
                    "label": 0
                },
                {
                    "sent": "Basically it's almost like learning coefficients in the logistic regression, right?",
                    "label": 0
                },
                {
                    "sent": "It says if you if the if the.",
                    "label": 0
                },
                {
                    "sent": "Edge that you're interested in predicting participates in such tracks.",
                    "label": 0
                },
                {
                    "sent": "Predict the minus if it participates in such threads.",
                    "label": 0
                },
                {
                    "sent": "Predictor plus right?",
                    "label": 0
                },
                {
                    "sent": "So that's one way how to produce.",
                    "label": 0
                },
                {
                    "sent": "So there is also a ternative interpretation of this sign measures and what we call status here, right?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So yeah, here is that these pluses and minuses, positive and negative edges, actually meaning some kind of status relationships, right?",
                    "label": 0
                },
                {
                    "sent": "So if no new gives a positive sign, fill out to be.",
                    "label": 0
                },
                {
                    "sent": "This means that we have higher status than you, and similarly if they give them a negative sizes means you can because global status menu right and what is interesting is that both the two theories balancing status they give different predictions.",
                    "label": 1
                },
                {
                    "sent": "So here's here's an example, right?",
                    "label": 0
                },
                {
                    "sent": "So you give the negative edge 2X and gives a negative edge to read.",
                    "label": 0
                },
                {
                    "sent": "So we're asking what would be the prediction here.",
                    "label": 0
                },
                {
                    "sent": "So if I would apply the balance rule that says an enemy of my enemy is my friend, so I would predict the plus status.",
                    "label": 1
                },
                {
                    "sent": "Would say you thinks is lower status than X means that B is even lower.",
                    "label": 0
                },
                {
                    "sent": "So yes, you should think that means lower status than them, so that should be a minus here right off the bat is like there is activity status, we predict minus and then again.",
                    "label": 0
                },
                {
                    "sent": "But if you actually make some other prediction here right and there are for example.",
                    "label": 0
                },
                {
                    "sent": "Other cases where now in this case where clusters go the other way again, parents would say predict the plus statement would say predict the minus, and as you will see later logistic regression also same predictor minus for example.",
                    "label": 0
                },
                {
                    "sent": "And here's the last example where you know X2.",
                    "label": 0
                },
                {
                    "sent": "New connections in the question is what is the sudden?",
                    "label": 0
                },
                {
                    "sent": "Again, balance would say predict the minus right?",
                    "label": 0
                },
                {
                    "sent": "Because it says then you can locate where my friends enemy is.",
                    "label": 0
                },
                {
                    "sent": "My enemy status would say predict the miners have adjusted version, for example cystic.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now if we go and train our model in this 16 triat types, here are basically the logistical regression coefficients.",
                    "label": 0
                },
                {
                    "sent": "So what I'm showing you here is these are the 16 possible priors of my head before, so the edge that occurs between the 1st and the last, the last build, and we're interested in predicting what will be the sign of this edge right?",
                    "label": 0
                },
                {
                    "sent": "And this would be the let's say coefficients in the logistic regression that would come from parents and are expanding in a bit.",
                    "label": 0
                },
                {
                    "sent": "And these are the coefficients that would come from status.",
                    "label": 0
                },
                {
                    "sent": "And, um, these are positions that we learn from our models and what is the point?",
                    "label": 0
                },
                {
                    "sent": "The point is that this proficient naturally well right so, for example here, involved.",
                    "label": 0
                },
                {
                    "sent": "I'm showing you 6 six largest absolute value coefficients and they match across the data center, right?",
                    "label": 0
                },
                {
                    "sent": "So now we go into a bit more detail.",
                    "label": 0
                },
                {
                    "sent": "Let me sort of tell you what are your.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "High level conclusions you can draw from this, so the first high level conclusion is that both of these theories, the status balance.",
                    "label": 0
                },
                {
                    "sent": "They're very well with the models figure.",
                    "label": 0
                },
                {
                    "sent": "The other things that we observe is for example this backward trials.",
                    "label": 0
                },
                {
                    "sent": "So basically when at this point backward and we're interested in what happens with this connection here, such riots count plans.",
                    "label": 0
                },
                {
                    "sent": "Then we said this point forward.",
                    "label": 0
                },
                {
                    "sent": "So they basically their coefficients imagistic interaction are smaller, but you also find is that theory of balance basically.",
                    "label": 0
                },
                {
                    "sent": "Ram of my friends my friend, work well in opinion since there is not.",
                    "label": 0
                },
                {
                    "sent": "While status is a much better predictor in Wikipedia and we also find that balance is inconsistent in consistently disagrees with enemy of my enemy is my friend.",
                    "label": 1
                },
                {
                    "sent": "So what happens in in this network is the enemy of my enemy is my enemy or something.",
                    "label": 0
                },
                {
                    "sent": "So we had this like people that are that you had this like trials of three negative connection.",
                    "label": 0
                },
                {
                    "sent": "So let me now go down and consider this aggregate.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here is what I'm showing up.",
                    "label": 0
                },
                {
                    "sent": "So now what I'm doing is I'm throwing away edge directions and I'm just counting the.",
                    "label": 0
                },
                {
                    "sent": "I could see that in four different run directed science projects.",
                    "label": 0
                },
                {
                    "sent": "OK, and I'm interested in predicting this last engine based on the balance theory.",
                    "label": 1
                },
                {
                    "sent": "This should mean friend of my friend is my friend, my friends enemies, my enemies.",
                    "label": 0
                },
                {
                    "sent": "This is the other example and these are enemy of my enemy.",
                    "label": 0
                },
                {
                    "sent": "Is my friend right?",
                    "label": 0
                },
                {
                    "sent": "So if these are the features of features?",
                    "label": 1
                },
                {
                    "sent": "Then this would be the coefficients that that logistic regression would would would use if people would operate based solely based on the structural balance theory and what I'm showing you here coefficients that we actually then learning the data and what you can see is that they match right?",
                    "label": 0
                },
                {
                    "sent": "So here the theory says we should predict we should do something positive and my coefficients are positive.",
                    "label": 0
                },
                {
                    "sent": "Here it says we should have something negative and yes my coefficients are negative and this last one.",
                    "label": 0
                },
                {
                    "sent": "He says we should be positive, but my coefficients are negative, right?",
                    "label": 0
                },
                {
                    "sent": "So this is the case of dimension before any of my enemy is not my friend, but my enemy also.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is the first case, and similarly we can do the same case where we are aggregating the 16 trials into smaller now.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Decide which status right.",
                    "label": 0
                },
                {
                    "sent": "So now we say this I only get predictions for when I get.",
                    "label": 0
                },
                {
                    "sent": "You know you miss less than X axis has indeed or the other way around, and I don't say anything when I have places like that.",
                    "label": 0
                },
                {
                    "sent": "So basically just to show you what's going on.",
                    "label": 0
                },
                {
                    "sent": "For example for this.",
                    "label": 0
                },
                {
                    "sent": "For this case here in the fourth try as a tablet or collapse together, right?",
                    "label": 0
                },
                {
                    "sent": "So with all these four trials, you have higher status in because the lower status, right?",
                    "label": 0
                },
                {
                    "sent": "Either use this like.",
                    "label": 0
                },
                {
                    "sent": "Or if you know minus start finding the other version, but the point again is that the coefficients return are correspond very nicely to what this theory sense.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is the first thing.",
                    "label": 0
                },
                {
                    "sent": "The second thing is that I can also compare the predictive accuracy of this model, but I basically had created versus the models I learn and just to make it short, these are these different models and what you can see is that basically this deterministic models that come from the social psychology pretty much work as well as the model side playing using machine learning that are sort of they are compatible.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Bump in the last thing that I would like to explain is the following, right?",
                    "label": 0
                },
                {
                    "sent": "So we would like to understand how general artistic right I showed you so very very different datasets in a sense that we have this working data set.",
                    "label": 0
                },
                {
                    "sent": "We have to transform data set and then we have this friend and foe data set right?",
                    "label": 0
                },
                {
                    "sent": "And the question is, how generalizable are our models for our results, right?",
                    "label": 1
                },
                {
                    "sent": "So one way to test for this is this is a simple way where we basically say let's train on one data set and let's try to make predictions from the other matrices.",
                    "label": 1
                },
                {
                    "sent": "And for example, here are the results, so I'm training on the road because it I'm turning my logistical regression model on the temporal data set.",
                    "label": 0
                },
                {
                    "sent": "But then I predict on the way I evaluate it on the column data set, right?",
                    "label": 0
                },
                {
                    "sent": "So what this is saying is when I use my model on opinions Network and I test it on opinions, I get 93.",
                    "label": 0
                },
                {
                    "sent": "But if I use the same model and use it to predict which who's friend with whom, I do 92 and you know if I do it on Wikipedia had 77 but the point is if I would now train the model on Wikipedia itself.",
                    "label": 0
                },
                {
                    "sent": "And we only get paid right?",
                    "label": 1
                },
                {
                    "sent": "So basically only losing about 2 percentage points when I train a model on a very different data set, and I predict the current agency right?",
                    "label": 0
                },
                {
                    "sent": "So basically what this means is that these models are super generalized super well, even though this settings under which people were semantics of these edges are very different trustees.",
                    "label": 0
                },
                {
                    "sent": "Friendship is whether you support someone or not, but again, the model work as well regardless of what you use for rich.",
                    "label": 0
                },
                {
                    "sent": "Set of edges.",
                    "label": 0
                },
                {
                    "sent": "Useful thing when you set of edges used for evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then the last.",
                    "label": 0
                },
                {
                    "sent": "Find that goes to my first question.",
                    "label": 0
                },
                {
                    "sent": "Is the following right?",
                    "label": 0
                },
                {
                    "sent": "That's sort of does not include an enemy of cooling.",
                    "label": 0
                },
                {
                    "sent": "Does it help even, for example, for predicting only positive edges right?",
                    "label": 0
                },
                {
                    "sent": "So fast that I'm considering now is a little prediction task, I would like to know, is there an edge between these two people or not, so I don't get and I'm asking is there a positive edge or there is something else?",
                    "label": 0
                },
                {
                    "sent": "OK, so I'm only interested in predicting whether there's a positive edge or something else and I'm interested in whether knowing who's an enemy of quick as this happy or not, right?",
                    "label": 1
                },
                {
                    "sent": "So?",
                    "label": 0
                },
                {
                    "sent": "I will train my model on the network, at least where I have positive and negative edges versus on a network like that where I remove the negative connections.",
                    "label": 0
                },
                {
                    "sent": "And to make the domain and basically profession I'm asking, does knowing who's an enemy of whom does it can't even in predicting who knows who in some sense, and if there is, if their result that it does.",
                    "label": 0
                },
                {
                    "sent": "And if randomly do sort of .5, we get a very significant improvement over.",
                    "label": 1
                },
                {
                    "sent": "And when we are using now.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Information.",
                    "label": 0
                },
                {
                    "sent": "So, um and.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let me.",
                    "label": 0
                },
                {
                    "sent": "Skip.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And just briefly conclude.",
                    "label": 0
                },
                {
                    "sent": "OK, so here is.",
                    "label": 0
                },
                {
                    "sent": "Here's what we did, right?",
                    "label": 0
                },
                {
                    "sent": "So basically we explored the sign, the structure of sign networks and they provide us some insight into how you do this, how social computing applications are being used, in particular, how do these mechanisms similar to the theories of status and balance I showed you that sign predictions can be can be done with any activity and you can do it with 90% plus precipitation accuracy.",
                    "label": 1
                },
                {
                    "sent": "But there is this amazing generalization between.",
                    "label": 1
                },
                {
                    "sent": "Between different data sets and also that negative information helps when you want to predict friendships and the last thing that I had to skip it.",
                    "label": 0
                },
                {
                    "sent": "If you look at the global structure of these networks, they obeyed the status theory much more than the balance theory, right?",
                    "label": 0
                },
                {
                    "sent": "Cause status makes your prediction that there should be some kind of global ordering from the notes from the note in the lower status will not be the higher status while balance.",
                    "label": 0
                },
                {
                    "sent": "Nobody says that there should be this coalitions of actions where there are lots of edges between lots of friendships between.",
                    "label": 0
                },
                {
                    "sent": "From factions and lots of negative connections across the board, and if you look at the global network structure again you find much more evidence for this status ordering of things across all three.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if you'd like to play with these positive and negative datasets and the data in the codes are available at this URL.",
                    "label": 0
                },
                {
                    "sent": "So which is the first one?",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Directions.",
                    "label": 0
                },
                {
                    "sent": "OK. Metalink predicting the direction of the edge we had.",
                    "label": 0
                },
                {
                    "sent": "So it turns out that about like only three to 5% of all the edges are reciprocals, so most of the edges are just really direction, meaning there's no backwards finding it.",
                    "label": 0
                },
                {
                    "sent": "On one hand, we haven't looked at, but I think that's actually we have an experiment with that.",
                    "label": 0
                },
                {
                    "sent": "We were doing this in the paper, so we looked at all, so it's in the paper.",
                    "label": 0
                },
                {
                    "sent": "So we looked at the example.",
                    "label": 0
                },
                {
                    "sent": "Looks like we looked at the case where we installed the direction, but we still wanted to.",
                    "label": 0
                },
                {
                    "sent": "We didn't know the science building.",
                    "label": 0
                },
                {
                    "sent": "You know.",
                    "label": 0
                },
                {
                    "sent": "Directions at least wanted to predict the site, but we haven't looked at exactly predicting the direction, but it should be an easier problem because you could just workout the results from the logistic regression models, right?",
                    "label": 0
                },
                {
                    "sent": "'cause when you do this right counts, you actually assume that the edge points from you to be right, which is the realistic exits you who's sort of pointing to you so you could easily.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "Generalized to specific weight on the family feud, but want to wait.",
                    "label": 0
                },
                {
                    "sent": "So actually you should generally so the question was whether the generalization is fully across science, but also to wait.",
                    "label": 0
                },
                {
                    "sent": "But actually it should be 2 weights also right?",
                    "label": 0
                },
                {
                    "sent": "'cause we are talking like logistic regression is cutting that point half right?",
                    "label": 0
                },
                {
                    "sent": "So I'm not changing this threshold, so actually I keep all the way.",
                    "label": 0
                },
                {
                    "sent": "It's the same when I move from one data set to the other, right?",
                    "label": 0
                },
                {
                    "sent": "So I'm keeping the model the same, so I'm actually yes I have.",
                    "label": 0
                },
                {
                    "sent": "I should match the science and also the weights or at least relative proportions of buildings, right?",
                    "label": 0
                },
                {
                    "sent": "So I do wedding classification accuracy.",
                    "label": 0
                },
                {
                    "sent": "Just.",
                    "label": 0
                },
                {
                    "sent": "OK, cool.",
                    "label": 0
                },
                {
                    "sent": "The question was what?",
                    "label": 0
                },
                {
                    "sent": "Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "Discuss Pop culture Department.",
                    "label": 0
                },
                {
                    "sent": "Example demonstrations using page, so on some pages I can trust this person.",
                    "label": 0
                },
                {
                    "sent": "Distress noted issues.",
                    "label": 0
                },
                {
                    "sent": "So wait, you have used this kind of aggregational.",
                    "label": 0
                },
                {
                    "sent": "I should make clear so it is not about whether you trust you or not.",
                    "label": 0
                },
                {
                    "sent": "This is really an opinions you trust you as a user you create a connection to the person.",
                    "label": 0
                },
                {
                    "sent": "So these are all explicit networks with explicit science.",
                    "label": 0
                },
                {
                    "sent": "So when users create these edges, they're judging the other person, and when they when they create an edge, there is no way.",
                    "label": 0
                },
                {
                    "sent": "Tell the site when the edges created, you have to sort of market plus or minus, so designs are created by users they're not involved in any way, and the networks again are explicitly are not inferred in anyway, so, but it's a very good question.",
                    "label": 0
                },
                {
                    "sent": "So basically the point that was product is the following right?",
                    "label": 0
                },
                {
                    "sent": "So whatever studying is a social network setting where nodes judge other nodes but actually the same, you could think of the same theory in at least sort of bipartite setting, where you have people judging by comes right, so we have now a bipartite graph where.",
                    "label": 0
                },
                {
                    "sent": "People on the left are drug Lord.",
                    "label": 0
                },
                {
                    "sent": "You know people on your right judge icons or 8 items on your right.",
                    "label": 0
                },
                {
                    "sent": "So that's a different setting and we Even so the settings we were looking at these people judge other.",
                    "label": 0
                },
                {
                    "sent": "So it's same entities judged other endpoints.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "So the question was do you do you need to go farther than two hops basically right?",
                    "label": 0
                },
                {
                    "sent": "Given that, like I, I don't think there is a very good answer to that unless just just us to say that we know that in this online social networks more than 60% of the edges close primaries right when they move.",
                    "label": 0
                },
                {
                    "sent": "So the first thing is probability of closing the triangle is like 2 orders of magnitude larger than linking to someone who speak up.",
                    "label": 0
                },
                {
                    "sent": "So just if you look at how these networks evolve, so I think yes, you could extend it to paths of length three, but practically I don't think you would get it.",
                    "label": 0
                },
                {
                    "sent": "Oh yes.",
                    "label": 0
                },
                {
                    "sent": "How much, how much does preferential attachment?",
                    "label": 0
                },
                {
                    "sent": "How much does preferential attachment and?",
                    "label": 0
                },
                {
                    "sent": "Influences like that influence the model that you have with the triangles.",
                    "label": 0
                },
                {
                    "sent": "Off be more specific, so the question was about how this preferential attachment influenced by model.",
                    "label": 0
                },
                {
                    "sent": "Friend of a friend is also a friend of yours, but what if it is becausw that everyone is a friend of the specific user that everyone else wants to be friends with?",
                    "label": 0
                },
                {
                    "sent": "The same user also?",
                    "label": 0
                },
                {
                    "sent": "So that's why we had this degree features right where we didn't ask about what the context is, just how many positive edges will get from any negative edges together.",
                    "label": 0
                },
                {
                    "sent": "And that as you see in the graphs were worse when you sort of know the directions and size of these trials.",
                    "label": 0
                },
                {
                    "sent": "So we also the reason the degree features, which is it should be something that answers your question.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        }
    }
}