{
    "id": "g7p57mujiswkaa44shbf3yfzmfv2ni6f",
    "title": "An Empirical Study of Reserve Price Optimisation in Display Advertising",
    "info": {
        "author": [
            "Shuai Yuan, Department of Computer Science, University College London"
        ],
        "published": "Oct. 7, 2014",
        "recorded": "August 2014",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Knowledge Extraction"
        ]
    },
    "url": "http://videolectures.net/kdd2014_yuan_display_advertising/",
    "segmentation": [
        [
            "Hello everyone, I'm showing from University College London.",
            "This work is a result of a collaboration of UCL advanced Internet Media and UK agency and Appnexus, which is one of the largest at exchanges in the world."
        ],
        [
            "So this work focus on a problem in basically real time bidding.",
            "The task is to find the optimal result prize, which is also called the hard floor.",
            "Too much is the 2nd price auction.",
            "There are three different cases of auction results.",
            "When there is a rising presence.",
            "These three cases are illustrated in the right hand part of the graph.",
            "You can see the first one is a razor, price is right in between the 1st and 2nd price.",
            "The second one is it is above and 3rd one is.",
            "It is below the second price."
        ],
        [
            "These three different cases.",
            "Each case gives different payoff to the publisher.",
            "Note that Alpha here is a reserve price and B1 and B2 the highest and second highest bids correspondingly.",
            "Well, apparently here is a preferable case where the reserve price is right in between the 1st and 2nd price gives the increase of the revenue and it directly motivates our work."
        ],
        [
            "If you're not convinced, here is an example to show how the price could increase the revenue.",
            "Suppose we have two bidders they have price value drawn from a uniform distribution from zero to 1, and you can see without surprise they expected payoff.",
            "Is there a point source Ray with different reprises?",
            "The payoff goes differently and it's generally speaking.",
            "The expected revenue is divided into 3 parts, corresponding to three cases we just listed before.",
            "And here from the last equation you can see the toolpaths.",
            "Apparently, when the auction fails, the third part, the payoff is there.",
            "Oh, which is automated from here."
        ],
        [
            "You know this is.",
            "This leads to the optimal theory.",
            "The optimal theory actually gives you the theoretical optimal reserve price when you know the proper value distribution is what.",
            "So suppose the publisher knows the parameter value distribution and the publisher has appraised value of VP.",
            "Then by using this theory you can have the reserve price given directly by this equation where the F prime stands for the probability density function of the product value distributions.",
            "Well, apparently to make the theory work, the first constraint to the publisher is to know the value distribution of all bidders.",
            "In theoretical research, we already see that uniform or lognormal distribution are used to model the parameter value distributions, but unfortunately we have seen that these two choices didn't fit very well, at least in our empirical study, as I will show you very soon, and more importantly, we need to understand.",
            "How videos are actually building and how these constraint the publisher?"
        ],
        [
            "And are they really drawing bids from a distribution?",
            "Generally speaking, no.",
            "The building is very complicated, as when I introduced this morning in the different session.",
            "In fact, I believe many of you are from industry and advertising tech companies, so you know better than me how I building algorithm is designed.",
            "Advertisers usually use a regression model as a core of the building strategy, not only the model but also the features and the values basically.",
            "Not accessible to the publisher, advertisers also could have a private value in mind, but more often they do not have one.",
            "Instead, they just want to achieve the best performance through continued exploration to make the words.",
            "There are other factors like pacing strategy, budget allocation, strategy and campaigns, lifetime.",
            "They come and go in a very fast pace.",
            "These all introduce a lot of noises.",
            "If a publisher wants to learn how each buyer.",
            "Paid."
        ],
        [
            "And Secondly, we look at the distribution.",
            "We look at the common adopted uniform and lognormal distribution and how they fit in RT practice.",
            "You see, apparently these commonly adopted assumptions do not hold in active practice either at the placement level of auction level and either the uniform or lognormal distribution do not fit very well to all the bids."
        ],
        [
            "There is a piece of relevant related work based on the optimal auction theory.",
            "In 2011, researchers from Yahoo conducted the first empirical study on there is a prize in the sponsor search contest, but you can see from the picture they seem to receive the mixed results which cannot be easily explained without looking closely at the data which is not accessible to us."
        ],
        [
            "So in our work, we actually propose something different.",
            "We propose to forget about the parameter value distribution because they are.",
            "Of course you can try to learn a private value distribution by my own method and get as accurate as possible, but we choose to go with in a different route the knowledge about the auction history and we just forget about that and we model the competition between the publisher and the auction winner as a dynamic and one shot game.",
            "In this, in this game we have two states.",
            "The auction succeeded of the last round and the auction failed because there is a price was too high.",
            "The.",
            "There are also other all available auction actions.",
            "Sorry actions for both advertisers and publishers in this game listed here.",
            "Based on these two States and all these actions, we can try to form a game and have the."
        ],
        [
            "Tree presentation of the game.",
            "First, I want to pay attention to three different things.",
            "First, there is expected payoff of the advertiser and publisher respectively.",
            "They are the leaf nodes of a tree, and second there could be negative values for the advertiser.",
            "You can imagine if the advertiser has been building at the maximum value that he can afford.",
            "Probably the price of the product.",
            "He will not increase the bidding price otherwise.",
            "That doesn't make sense, otherwise he will suffer some loss even, even if he wins, he wins the option and got the impression.",
            "So given this, the publisher have to assume a disc.",
            "Have to assume at this contest payoff.",
            "In this case, we assumed we do not look back in the history, so we have to assume the person takes the chance that the advertiser is already building the maximum price is 50%.",
            "So in this way we discount the publishers pay off by 50%.",
            "Following this path is, the publisher could easily find the actions that lead to the maximum payoff in two different cases, which gives the dominant strategy of the publisher."
        ],
        [
            "OK, So what is it?",
            "I'm going to strategy intact it.",
            "It is actually surprisingly simple.",
            "If there is a price was set too high you have to lower it.",
            "If it's too low, you have to increase it, right?",
            "If it is within the preferable range you can slightly increase it.",
            "This is derived from the from the tree of the Left rail.",
            "If it is within the preferable range, you'd better slightly higher rate.",
            "Try to make the auction to be the first price auction where you can have the maximum payoff.",
            "When actually implementing these heuristics, we made some modifications including introducing a parameter Lambda allowing the reserve price to converge overtime, as well as three different parameters HL and P. Controlling the adjustment steps which were learned from historical auction logs.",
            "I mean how much you should increase at how much you should decrease in different cases."
        ],
        [
            "Based on this model, we conducted an online experiment.",
            "This online experiment was conducted in UK from like one year ago 1/2 ago and we observed within this time round you observed 130 million impressions and we only use the 10% of impressions to actually do the calculation these impressions, or from certain replacements and these websites belong to a production or managed by production SSP in UK."
        ],
        [
            "We evaluated, we evaluated these algorithms.",
            "In this experiment we compare the zero, which is absolutely no.",
            "There's a price and weighted average.",
            "An optimal auction theory, and our heuristics and Bayesian method of trying to model the 1st and 1st and second prize distribution for details of algorithms like beige and weighted average, please refer to the paper.",
            "These algorithms would run on each.",
            "Placement and hour of day combination.",
            "And apparently they can be divided further.",
            "But if you divide them further, you receive less impressions which could make your experiment less significant.",
            "These algorithms run this scale and following the simple round Robin schedule."
        ],
        [
            "The results are actually promising.",
            "We singled improvement, comparing with the competing algorithms.",
            "The one just mentioned, and for placement with high and medium computation by computation.",
            "Actually, I mean how many buyers are participating in auctions.",
            "The results were significant and tested by the Wilcoxon signed rank test."
        ],
        [
            "Another interesting finding is actually from the demand side.",
            "As we argue when proposing the model having the reserve price optimization is actually challenging the advertiser naturally.",
            "If they are paying more here on your placement, they're building algorithms, would reallocate the budget throughout all the bidding activity, and probably just leave, right?",
            "This is very natural.",
            "But last year we showed that in an commercial ad exchange there are 45% of auctions are actually first price auction and they take 55% of all the budget.",
            "This year we're trying to push to the first price auction by using their surprise optimization, and we looked at the response or the OR the reaction from the advertiser.",
            "However, seems the advertiser do not care very much."
        ],
        [
            "Let me show you we observed and compared the building pattern before and after the optimization and we see there is no change of advertisers presence which is left bottom figure and the budget allocation which is the top right figure and the billing pattern which is a top down figure.",
            "You know there are a lot of more factors affecting the bidding activity, but there is a prize is currently not within the reader so we think the billing algorithm needs to be more cost efficient, right?",
            "If you are interested, there is a relevant paper this year presented this morning session."
        ],
        [
            "So for future work we want to improve the optimization by introducing audience data.",
            "Because you know, buyers are doing that and find a better fitting distributions could probably improve a lot of stuff and we also want to try to.",
            "We also want to come up with a unified SSP optimization framework that consider the guaranteed delivery as well."
        ],
        [
            "If there's time, I'm happy to take some questions.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello everyone, I'm showing from University College London.",
                    "label": 0
                },
                {
                    "sent": "This work is a result of a collaboration of UCL advanced Internet Media and UK agency and Appnexus, which is one of the largest at exchanges in the world.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this work focus on a problem in basically real time bidding.",
                    "label": 0
                },
                {
                    "sent": "The task is to find the optimal result prize, which is also called the hard floor.",
                    "label": 1
                },
                {
                    "sent": "Too much is the 2nd price auction.",
                    "label": 0
                },
                {
                    "sent": "There are three different cases of auction results.",
                    "label": 0
                },
                {
                    "sent": "When there is a rising presence.",
                    "label": 0
                },
                {
                    "sent": "These three cases are illustrated in the right hand part of the graph.",
                    "label": 0
                },
                {
                    "sent": "You can see the first one is a razor, price is right in between the 1st and 2nd price.",
                    "label": 0
                },
                {
                    "sent": "The second one is it is above and 3rd one is.",
                    "label": 0
                },
                {
                    "sent": "It is below the second price.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "These three different cases.",
                    "label": 0
                },
                {
                    "sent": "Each case gives different payoff to the publisher.",
                    "label": 0
                },
                {
                    "sent": "Note that Alpha here is a reserve price and B1 and B2 the highest and second highest bids correspondingly.",
                    "label": 0
                },
                {
                    "sent": "Well, apparently here is a preferable case where the reserve price is right in between the 1st and 2nd price gives the increase of the revenue and it directly motivates our work.",
                    "label": 1
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you're not convinced, here is an example to show how the price could increase the revenue.",
                    "label": 0
                },
                {
                    "sent": "Suppose we have two bidders they have price value drawn from a uniform distribution from zero to 1, and you can see without surprise they expected payoff.",
                    "label": 0
                },
                {
                    "sent": "Is there a point source Ray with different reprises?",
                    "label": 0
                },
                {
                    "sent": "The payoff goes differently and it's generally speaking.",
                    "label": 0
                },
                {
                    "sent": "The expected revenue is divided into 3 parts, corresponding to three cases we just listed before.",
                    "label": 0
                },
                {
                    "sent": "And here from the last equation you can see the toolpaths.",
                    "label": 0
                },
                {
                    "sent": "Apparently, when the auction fails, the third part, the payoff is there.",
                    "label": 0
                },
                {
                    "sent": "Oh, which is automated from here.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You know this is.",
                    "label": 0
                },
                {
                    "sent": "This leads to the optimal theory.",
                    "label": 0
                },
                {
                    "sent": "The optimal theory actually gives you the theoretical optimal reserve price when you know the proper value distribution is what.",
                    "label": 1
                },
                {
                    "sent": "So suppose the publisher knows the parameter value distribution and the publisher has appraised value of VP.",
                    "label": 0
                },
                {
                    "sent": "Then by using this theory you can have the reserve price given directly by this equation where the F prime stands for the probability density function of the product value distributions.",
                    "label": 0
                },
                {
                    "sent": "Well, apparently to make the theory work, the first constraint to the publisher is to know the value distribution of all bidders.",
                    "label": 0
                },
                {
                    "sent": "In theoretical research, we already see that uniform or lognormal distribution are used to model the parameter value distributions, but unfortunately we have seen that these two choices didn't fit very well, at least in our empirical study, as I will show you very soon, and more importantly, we need to understand.",
                    "label": 0
                },
                {
                    "sent": "How videos are actually building and how these constraint the publisher?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And are they really drawing bids from a distribution?",
                    "label": 0
                },
                {
                    "sent": "Generally speaking, no.",
                    "label": 0
                },
                {
                    "sent": "The building is very complicated, as when I introduced this morning in the different session.",
                    "label": 0
                },
                {
                    "sent": "In fact, I believe many of you are from industry and advertising tech companies, so you know better than me how I building algorithm is designed.",
                    "label": 0
                },
                {
                    "sent": "Advertisers usually use a regression model as a core of the building strategy, not only the model but also the features and the values basically.",
                    "label": 1
                },
                {
                    "sent": "Not accessible to the publisher, advertisers also could have a private value in mind, but more often they do not have one.",
                    "label": 0
                },
                {
                    "sent": "Instead, they just want to achieve the best performance through continued exploration to make the words.",
                    "label": 0
                },
                {
                    "sent": "There are other factors like pacing strategy, budget allocation, strategy and campaigns, lifetime.",
                    "label": 0
                },
                {
                    "sent": "They come and go in a very fast pace.",
                    "label": 1
                },
                {
                    "sent": "These all introduce a lot of noises.",
                    "label": 0
                },
                {
                    "sent": "If a publisher wants to learn how each buyer.",
                    "label": 0
                },
                {
                    "sent": "Paid.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And Secondly, we look at the distribution.",
                    "label": 1
                },
                {
                    "sent": "We look at the common adopted uniform and lognormal distribution and how they fit in RT practice.",
                    "label": 0
                },
                {
                    "sent": "You see, apparently these commonly adopted assumptions do not hold in active practice either at the placement level of auction level and either the uniform or lognormal distribution do not fit very well to all the bids.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There is a piece of relevant related work based on the optimal auction theory.",
                    "label": 0
                },
                {
                    "sent": "In 2011, researchers from Yahoo conducted the first empirical study on there is a prize in the sponsor search contest, but you can see from the picture they seem to receive the mixed results which cannot be easily explained without looking closely at the data which is not accessible to us.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in our work, we actually propose something different.",
                    "label": 0
                },
                {
                    "sent": "We propose to forget about the parameter value distribution because they are.",
                    "label": 0
                },
                {
                    "sent": "Of course you can try to learn a private value distribution by my own method and get as accurate as possible, but we choose to go with in a different route the knowledge about the auction history and we just forget about that and we model the competition between the publisher and the auction winner as a dynamic and one shot game.",
                    "label": 1
                },
                {
                    "sent": "In this, in this game we have two states.",
                    "label": 1
                },
                {
                    "sent": "The auction succeeded of the last round and the auction failed because there is a price was too high.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "There are also other all available auction actions.",
                    "label": 0
                },
                {
                    "sent": "Sorry actions for both advertisers and publishers in this game listed here.",
                    "label": 0
                },
                {
                    "sent": "Based on these two States and all these actions, we can try to form a game and have the.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Tree presentation of the game.",
                    "label": 0
                },
                {
                    "sent": "First, I want to pay attention to three different things.",
                    "label": 0
                },
                {
                    "sent": "First, there is expected payoff of the advertiser and publisher respectively.",
                    "label": 1
                },
                {
                    "sent": "They are the leaf nodes of a tree, and second there could be negative values for the advertiser.",
                    "label": 1
                },
                {
                    "sent": "You can imagine if the advertiser has been building at the maximum value that he can afford.",
                    "label": 0
                },
                {
                    "sent": "Probably the price of the product.",
                    "label": 0
                },
                {
                    "sent": "He will not increase the bidding price otherwise.",
                    "label": 0
                },
                {
                    "sent": "That doesn't make sense, otherwise he will suffer some loss even, even if he wins, he wins the option and got the impression.",
                    "label": 0
                },
                {
                    "sent": "So given this, the publisher have to assume a disc.",
                    "label": 0
                },
                {
                    "sent": "Have to assume at this contest payoff.",
                    "label": 0
                },
                {
                    "sent": "In this case, we assumed we do not look back in the history, so we have to assume the person takes the chance that the advertiser is already building the maximum price is 50%.",
                    "label": 0
                },
                {
                    "sent": "So in this way we discount the publishers pay off by 50%.",
                    "label": 0
                },
                {
                    "sent": "Following this path is, the publisher could easily find the actions that lead to the maximum payoff in two different cases, which gives the dominant strategy of the publisher.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, So what is it?",
                    "label": 0
                },
                {
                    "sent": "I'm going to strategy intact it.",
                    "label": 0
                },
                {
                    "sent": "It is actually surprisingly simple.",
                    "label": 0
                },
                {
                    "sent": "If there is a price was set too high you have to lower it.",
                    "label": 1
                },
                {
                    "sent": "If it's too low, you have to increase it, right?",
                    "label": 0
                },
                {
                    "sent": "If it is within the preferable range you can slightly increase it.",
                    "label": 0
                },
                {
                    "sent": "This is derived from the from the tree of the Left rail.",
                    "label": 0
                },
                {
                    "sent": "If it is within the preferable range, you'd better slightly higher rate.",
                    "label": 1
                },
                {
                    "sent": "Try to make the auction to be the first price auction where you can have the maximum payoff.",
                    "label": 1
                },
                {
                    "sent": "When actually implementing these heuristics, we made some modifications including introducing a parameter Lambda allowing the reserve price to converge overtime, as well as three different parameters HL and P. Controlling the adjustment steps which were learned from historical auction logs.",
                    "label": 0
                },
                {
                    "sent": "I mean how much you should increase at how much you should decrease in different cases.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Based on this model, we conducted an online experiment.",
                    "label": 0
                },
                {
                    "sent": "This online experiment was conducted in UK from like one year ago 1/2 ago and we observed within this time round you observed 130 million impressions and we only use the 10% of impressions to actually do the calculation these impressions, or from certain replacements and these websites belong to a production or managed by production SSP in UK.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We evaluated, we evaluated these algorithms.",
                    "label": 0
                },
                {
                    "sent": "In this experiment we compare the zero, which is absolutely no.",
                    "label": 0
                },
                {
                    "sent": "There's a price and weighted average.",
                    "label": 0
                },
                {
                    "sent": "An optimal auction theory, and our heuristics and Bayesian method of trying to model the 1st and 1st and second prize distribution for details of algorithms like beige and weighted average, please refer to the paper.",
                    "label": 1
                },
                {
                    "sent": "These algorithms would run on each.",
                    "label": 0
                },
                {
                    "sent": "Placement and hour of day combination.",
                    "label": 0
                },
                {
                    "sent": "And apparently they can be divided further.",
                    "label": 0
                },
                {
                    "sent": "But if you divide them further, you receive less impressions which could make your experiment less significant.",
                    "label": 0
                },
                {
                    "sent": "These algorithms run this scale and following the simple round Robin schedule.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The results are actually promising.",
                    "label": 0
                },
                {
                    "sent": "We singled improvement, comparing with the competing algorithms.",
                    "label": 0
                },
                {
                    "sent": "The one just mentioned, and for placement with high and medium computation by computation.",
                    "label": 0
                },
                {
                    "sent": "Actually, I mean how many buyers are participating in auctions.",
                    "label": 0
                },
                {
                    "sent": "The results were significant and tested by the Wilcoxon signed rank test.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another interesting finding is actually from the demand side.",
                    "label": 0
                },
                {
                    "sent": "As we argue when proposing the model having the reserve price optimization is actually challenging the advertiser naturally.",
                    "label": 0
                },
                {
                    "sent": "If they are paying more here on your placement, they're building algorithms, would reallocate the budget throughout all the bidding activity, and probably just leave, right?",
                    "label": 0
                },
                {
                    "sent": "This is very natural.",
                    "label": 0
                },
                {
                    "sent": "But last year we showed that in an commercial ad exchange there are 45% of auctions are actually first price auction and they take 55% of all the budget.",
                    "label": 1
                },
                {
                    "sent": "This year we're trying to push to the first price auction by using their surprise optimization, and we looked at the response or the OR the reaction from the advertiser.",
                    "label": 0
                },
                {
                    "sent": "However, seems the advertiser do not care very much.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let me show you we observed and compared the building pattern before and after the optimization and we see there is no change of advertisers presence which is left bottom figure and the budget allocation which is the top right figure and the billing pattern which is a top down figure.",
                    "label": 0
                },
                {
                    "sent": "You know there are a lot of more factors affecting the bidding activity, but there is a prize is currently not within the reader so we think the billing algorithm needs to be more cost efficient, right?",
                    "label": 0
                },
                {
                    "sent": "If you are interested, there is a relevant paper this year presented this morning session.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for future work we want to improve the optimization by introducing audience data.",
                    "label": 1
                },
                {
                    "sent": "Because you know, buyers are doing that and find a better fitting distributions could probably improve a lot of stuff and we also want to try to.",
                    "label": 0
                },
                {
                    "sent": "We also want to come up with a unified SSP optimization framework that consider the guaranteed delivery as well.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If there's time, I'm happy to take some questions.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}