{
    "id": "gen2abdrpjbraauqeqpj35szputwl5jg",
    "title": "Geometry of partial cube graphs",
    "info": {
        "author": [
            "David Eppstein, University of California, Irvine"
        ],
        "published": "Sept. 7, 2007",
        "recorded": "September 2007",
        "category": [
            "Top->Mathematics->Graph Theory"
        ]
    },
    "url": "http://videolectures.net/sicgt07_eppstein_gopcg/",
    "segmentation": [
        [
            "I'm very pleased to introduce David Epstein.",
            "Is mainly working in discrete geometry and a lot of it from algorithmic POV, and today's talks will be containing a lot of graph theory.",
            "Some applications I guess about geometry of partial groups and their base and discrete geometry in it as well.",
            "Yeah."
        ],
        [
            "OK, so.",
            "Outline start with."
        ],
        [
            "Some definitions before we go onto.",
            "The new"
        ],
        [
            "Content.",
            "So there's been a lot of work both in mathematics and computer science relating graphs.",
            "And finite metric spaces and weighted graphs and distances in graphs.",
            "I think of those as being closely related things to more uniform metric spaces, geometric spaces, Euclidean metrics, L1L Infinity metrics.",
            "For instance, Borgens theorem telling you that if you have a finite metric space with N points, think of it as a graph with N vertices.",
            "It can be embedded into an L1 space.",
            "Um?",
            "Actually a fairly low dimensional L1 space in such a way that the distances are only distorted by a log rhythmic factor, and that's important in some approx."
        ],
        [
            "Nation algorithms?",
            "I'm going to be concentrating here on unweighted graphs because this is after all, graph theory.",
            "That embed into an integer lattice with the."
        ],
        [
            "One distance, so these are the partial cubes.",
            "And the way I like to think of them, most of the time is graphs that can be embedded either into an integer lattice.",
            "Or onto a hypercube.",
            "So that all of the distances in the graph.",
            "Are the same as the distances between the vertices of the hypercube that they are mapped to, so.",
            "This is a graph here that represents the permutations of four items.",
            "I haven't shown the permutations on this figure, but.",
            "Any two permutations are adjacent if they are connected by a swap of two adjacent items.",
            "But this graph can be labeled with these 6 dimensional integer coordinates.",
            "In such a way that if you take any two vertices, say this one and this one.",
            "The distance between those two vertices in the graph is the same as the distance in the L1 metric between those coordinates, or thinking of 01 coordinates as defining a hypercube in L1 space, it's the Hamming distance, the number of positions at which the two labels differ.",
            "So that's the definition there are."
        ],
        [
            "Ways of thinking about partial cubes though.",
            "Jokovich Ann Winkler.",
            "Proved characterizations.",
            "They're slightly different, but for the purposes of this talk I'll conflate them.",
            "We can define a relationship on the edges.",
            "And edge PQ is related to an edge Rs, usually denoted by Theta.",
            "But I've used a~ here.",
            "If that inequality between the distances holds, so these two edges over on this side are related.",
            "But if, for instance, we have and a pair of edges like this where the top pair of vertices are at distance D apart in the bottom right distance D + 2, then they would not be related.",
            "And one can prove that a graph is a partial cube by the previous definition if and only if it's a bipartite graph for which this is an equivalence relationship on the edges.",
            "So.",
            "This relationship partitions the edges into equivalence classes, but each equivalence class is a cut that partitions the graph into 2 connected components.",
            "And you can recover the hypercube embedding A 01 lattice embedding by using a coordinate for each of these equivalence classes.",
            "And making that coordinate be 0 on one side of the cut and one on the other side of the cut.",
            "And in particular that tells us actually that the hypercube embedding is unique up to symmetries of the hypercube.",
            "Because it can be recovered in this way."
        ],
        [
            "From the graph structure.",
            "It's still not the only way to define partial cubes, so I with Jean Claude Farman and Sergey Sergey Ovchinnikov have been looking at a different.",
            "Characterization of essentially the same combinatorial systems.",
            "Which phone calls media theory?",
            "In this theory, a medium is a system of States and transformations on states.",
            "Satisfying certain axioms, you can think of it as a deterministic finite automaton.",
            "Uh.",
            "The axioms are listed here that that if one of the transformations changes, the state S to a State V, then it has a reverse transformation that changes V back to S. Etc.",
            "I'm.",
            "The the system is defined by this.",
            "These axioms turn out to be exactly the partial cubes from a different point of view.",
            "Which I won't consider very much in this talk, but.",
            "Is.",
            "I think this way of looking at them is was an important key to an algorithm that I recently developed for recognizing partial cubes more efficiently in N squared time, but."
        ],
        [
            "Not part of this talk.",
            "So any graph has vertices an edges and.",
            "There's two to one correspondence between undirected edges and darts, or directed edges.",
            "In a partial cube there are also these equivalence classes, Ann.",
            "Really they function as another kind of object.",
            "It just like in a map, one has not just vertices and edges, but vertices, edges and faces in a partial cube one has vertices, edges and.",
            "Equivalence classes of this relationship, or we can call them zones.",
            "In the media theory point of view, there are these transformations or input symbols to the finite automaton.",
            "In the cube embedding, they are the indexes of coordinates.",
            "And there's there's again at this two to one correspondence going on.",
            "Each zone is a set of edges, but partitions the graph into two subsets of vertices.",
            "Which I'll call semi cubes.",
            "The tokens again come in pairs corresponding to the semi cubes and so on."
        ],
        [
            "Now I wanted to go through just.",
            "Random collection of examples of systems that give you partial cubes just to show that it's not just an abstract structure we're defining.",
            "It comes from a number of applications.",
            "And then down at the end here I'll have another, bigger application of power."
        ],
        [
            "Cubes again.",
            "Since I'm interested in discrete geometry, this one is important to me.",
            "If you have a hyperplane arrangement, say an arrangement of lines in the Euclidean plane, these dashed lines in this figure.",
            "When can form a dual graph of the arrangement where there is a vertex representing each cell of the arrangement?",
            "And two vertices are adjacent in the graph.",
            "If they share a D -- 1 dimensional component of boundary.",
            "If they're adjacent, if they're separated from each other by only one of the hyperplanes in the arrangement.",
            "So.",
            "This vertex is adjacent to this vertex because the the two cells are adjacent across this line.",
            "That turns out to be a partial cube.",
            "We can label the partial cube by supplying a coordinate for each line where that coordinate is 0 for the regions below the line, an one for the regions above the line.",
            "It.",
            "We can then show that that graph distance is equal to the Hamming distance of that labeling and to find.",
            "Up to show that the graph distances.",
            "Do I have this less than greater than?",
            "Yeah.",
            "To show that the graph distance is less than or equal to the Hamming distance, you all you have to observe is that when you forming path in the graph between any two vertices.",
            "If those two vertices differ in one coordinate, then that path has to cross geometrically, the hyperplane separating them at least once.",
            "It could cross more than once.",
            "I think I have the inequality is reversed here because that shows that the graph distance is greater than or equal to the Hamming distance.",
            "But to show that the graph distance is less than or equal to the Hamming distance.",
            "We need to find a path where.",
            "It in the graph that that crosses each hyperplane exactly once, and you can find such a path just by taking the line segment between two pairs of points.",
            "Between two points, one in each of the regions.",
            "So.",
            "It's straightforward to prove that any hyperplane gives you hyperplane arrangement gives."
        ],
        [
            "Partial Cuban this way.",
            "Here's a more combinatorial example.",
            "But it can be described in terms of hypercube arrangements.",
            "Consider all the acyclic orientations of an undirected graph.",
            "So here the undirected graph is C4.",
            "And this drawing shows you.",
            "14 acyclic orientations of C4, there are 16 ways of orienting all of the four edges of C4, but two of them are cyclic.",
            "Two of these orientations are adjacent to each other.",
            "If they differ by flipping the orientation of a single edge.",
            "So this pair of orientations differs.",
            "In this case, this bottom edge goes left to right, right to left.",
            "In the other case, it goes left to right.",
            "This system of States and adjacency's.",
            "Can be translated into a hyperplane arrangement where.",
            "We have a coordinate for each vertex of our underlying undirected graph.",
            "And we have a paper plane of the Form X I = X J.",
            "Whenever we have an edge VIVJ in.",
            "Our underlying graph.",
            "And.",
            "I.",
            "A point in R to the to the D, where D is the number of vertices can represent an acyclic orientation.",
            "In which one orients.",
            "An edge from the eye to Vijay.",
            "If the.",
            "Ice coordinate of the point is less than the death coordinate of the point, and these hyperplanes exactly specify the points in R to the D for which that.",
            "Representation is not well defined, so this is exactly the right way of representing this geometrically."
        ],
        [
            "It's a partial cube.",
            "Um?",
            "Various kinds of order relationships on sets of items can be represented as partial cubes, so these are weak orders.",
            "A week order is a total ordering on an equivalence relation.",
            "Of a set.",
            "And so these 13 vertices represent all of the possible weak orderings on three items.",
            "And again, it can be represented as a partial cube.",
            "Or is a hyperplane arrangement.",
            "Which farming and others have used in so?"
        ],
        [
            "Choice theory.",
            "And.",
            "This this one.",
            "Seems kind of abstract, but it's where I came into this picture.",
            "From a concrete point of view and anti matroid is a family of sets.",
            "With two properties.",
            "If you take any two sets in the family and form their union, you get another set in the family.",
            "If you take any nonempty set in the family.",
            "You can find one element of that set that you can remove and get another set in the family.",
            "If you have those two properties, it forms a set system called an anti matroid.",
            "One of which I've drawn here.",
            "These turn out to be partial cubes, so these are the sets labeled by just their elements.",
            "Adjacency consisting of adding and removing elements.",
            "And.",
            "My colleague at UC Irvine Jean Claude Farman.",
            "Has a system for teaching kids math via computer.",
            "That involves accurately assessing what the student knows.",
            "And from that, deducing what the student is ready to learn next.",
            "In order to perform that assessment, he needs to have a model of what states of knowledge are possible for students of mass to be in what?",
            "There are too many concepts.",
            "It would be inefficient to use a model in which every possible subset of concepts as possible, but for instance.",
            "There are certain states that are just don't make any sense pedagogically.",
            "If you know how to add numbers with carrying, then you also know how to add them without carrying.",
            "And so.",
            "He has a company that sells the software that has models of all of the possible states of mathematical knowledge that these elementary school students might be in that.",
            "Have this form, they are anti matroids.",
            "They have millions or billions of states.",
            "So it's important to be able to understand the structure of these graphs.",
            "An operate on them efficiently and they turn out to be partial cubes."
        ],
        [
            "Just a number theoretic example, I don't have a lot to say about this one, but partitions of integers can be turned."
        ],
        [
            "And partial cubes.",
            "So."
        ],
        [
            "Dimension.",
            "There are a lot of different ways of defining a concept of dimension for a partial cube.",
            "The most natural and simple one is just that.",
            "The dimension of this hypercube embedding of the graph and since that embedding is, as I said, unique.",
            "This dimension is well defined and it's essentially just the number of zones.",
            "So it can be computed straightforwardly polynomial time.",
            "What I want to spend a little more time talking about is this different dimension?",
            "The minimum dimension of an embedding into an integer lattice.",
            "Which may be significantly lower than the isometric dimension.",
            "But turns out May also be computed in polynomial time.",
            "A lattice is a Cartesian product of paths.",
            "And so a path is a special case of a tree.",
            "It's natural to consider embedding partial cubes into Cartesian product of trees, which are a special case of partial cubes that dimension.",
            "Makes sense to define can be computed if the dimension is too, but is hard to compute for anything higher than that.",
            "Um?",
            "And.",
            "I think there should be some notion of dimension of a representation of a partial cube as a hyperplane arrangement, but.",
            "Such a representation doesn't always exist, and unfortunately, even for two dimensions.",
            "It's hard to tell whether something is dual to a hyperplane arrangement.",
            "Peter Shor showed that one can define arrangements of curves that look topologically like line arrangements, but.",
            "Ha.",
            "May not be and showed that it's hard to tell the difference.",
            "So.",
            "Describe these concepts out of order because I think the tree dimension one is a useful warm up for the."
        ],
        [
            "Lattice dimension.",
            "So we'd like to take our partial cube.",
            "Represented as an isometric sub graph of a product of trees.",
            "And, um.",
            "If you think about it, it turns out to mean that we're.",
            "When we represent a partial cube as a sub graph of some kind of product.",
            "That generally means that the zones of the partial cube get partitioned into the different factors of this product.",
            "And so we would like to partition the zones of our partial cube in such a way that that the part within each of these partitions forms a tree.",
            "And in order to do that, we can't.",
            "For instance, this zone and this zone could not be.",
            "Included in the same factor of the partial cube because they have these four vertices that don't form a tree and wouldn't form a tree even when projected onto that factor.",
            "So we can define a compatibility graph, also called acrossing graph.",
            "That describes.",
            "When two zones might be included in the same tree.",
            "Or cannot be included in the same tree.",
            "And essentially what we have to do is to partition the zones into independent subsets of this compatibility graph.",
            "So it's just a graph coloring problem.",
            "The tree dimension is less than or equal to K if and only if the compatibility graph are crossing graph of these zones is K chromatic and that immediately gives you a polynomial time algorithm for testing whether it's two chromatic."
        ],
        [
            "But it also immediately tells you that it's hard for any higher dimension.",
            "Because any graph can be represented as the compatibility graph of some partial Q ban in fact.",
            "We can be more specific and say it's a compatibility graph of some median graph.",
            "So finding dimensions greater than three is as hard as graph coloring, which makes it maybe a little."
        ],
        [
            "More surprising that the lattice dimension.",
            "Is so much easier.",
            "We'd like to embed a partial cube into an integer lattice with as low a dimension as possible.",
            "Here are some drawings of three dimensional embeddings of graphs.",
            "Where in each case the hypercube dimension is something higher than three.",
            "And.",
            "If we don't care about distance is just adjacency.",
            "But we want to embed a graph into a lattice in such a way that adjacent vertices in the graph are adjacent in the lattice.",
            "And no two vertices in the graph are on top of each other.",
            "That's also a hard problem.",
            "It's even hard for the two dimensional lattice an even for embedding trees into a 2 dimensional lattice.",
            "But the partial cube structure if we embed preserving distances, it reduces the class of embeddings that we allow.",
            "But that extra rigidity also allows us to find."
        ],
        [
            "The embeddings more efficiently.",
            "So for example, if we want to embed a tree into a lattice, it turns out that.",
            "The dimension that you have to use is just the number of leaves divided by two.",
            "Because there can be at most one extreme point in each dimension and those extreme points have to cover all of the leaves.",
            "And sometimes that's enough to tell us the dimension of a partial cube, at least approximately because.",
            "If you have a more general partial cube.",
            "With a degree Delta vertex.",
            "Then just that vertex and its neighbors form a smaller partial cube, just a star.",
            "That already in in that local neighborhood has dimension Delta divided by two and so that gives you a very easy.",
            "A lower bound on the dimension of any graph dimension of any partial cube is at least the maximum degree divided by two and sometimes."
        ],
        [
            "That's tight.",
            "To understand more general latista embeddings.",
            "Um?",
            "These are the semi cubes of this partial cube which I've shown with a lattice embedding.",
            "In a lattice embedding of a partial cube, each semi cube must be the set of points with some coordinate less than or equal to some bound or greater than or equal to some bound.",
            "So for instance, if we draw a vertical line through this zone.",
            "We get HD AEB on one side.",
            "That's a semi cube.",
            "We get CGFIJ on the other side.",
            "That's also a semi cube.",
            "So if we just read from left to right, we get.",
            "Let's see.",
            "HD is a semi cube and the complement of HD is a semi Q.",
            "We get the second pair of semi cubes that I told you about Abd EH?",
            "CFGIJ here we get the complement of gij and then gij itself the compliment of JJ.",
            "And I've drawn that over here.",
            "As a path.",
            "DHABCDEFGIJ etc.",
            "Just a sequence of semi cubes alternating between left and right sides.",
            "For that coordinate, and here's another path for the other coordinate.",
            "The dashed edges.",
            "Are when we alternate from left to right on the same zone and so they represent complementary pairs of semi cubes.",
            "And the solid edges represent shifting from.",
            "Say the semi cube to the right of this line versus the semi cube to the left of this line.",
            "And those represent pairs of semi cubes that together the union of them is the whole graph.",
            "So any lattice embedding represents a collection of paths of semi cubes that have this property.",
            "They alternate between these dashed and solid edges, and the solid edges represent semi cubes that aren't the compliments of each other, but the union of which is the whole graph.",
            "And it turns out that.",
            "If you can only find such a collection of paths.",
            "That will define a lattice embedding for you.",
            "So.",
            "Um?",
            "Maybe it's.",
            "The the solid edges, obviously.",
            "I mean the dashed edges.",
            "You don't have any choice which I just use their, they're just the semi cubes in their compliments, but the solid edges.",
            "There could be any set of edges that have this property, but they form a matching.",
            "Of these semi cubes and we can form a graph that there."
        ],
        [
            "A matching in.",
            "Where we just simply connect any 2 semi cubes.",
            "By an edge whenever their union is the whole graph.",
            "And what we would like to do is to find as few paths as possible and that is done by finding as many matched edges as possible so.",
            "We can prove a theorem the lattice dimension.",
            "Is the hypercube dimension the isometric dimension minus the cardinality of a maximum matching in this graph and that leads to a polynomial time algorithm?"
        ],
        [
            "Which I would like to use in order to draw these graphs."
        ],
        [
            "So there's.",
            "There's actually a fairly large research community.",
            "That studies graph drawing.",
            "Where's the visualizing graphs?",
            "It's it's an interesting area because it combines both aesthetic concerns.",
            "Does this look nice or maybe more importantly, does this drawing convey information to a human viewer that you want to convey?",
            "But in order to have drawings that look nice and convey information, we need them to satisfy mathematical properties.",
            "So there's a lot of interesting math that goes on in graph drawing.",
            "Typical properties that you would like a drawing to have include, you know keeping the edges and vertices separated from each other so that you can see where they go.",
            "Avoiding crossings crossings confuse people.",
            "It's hard to look at a drawing with crossings and understand it compared to a drawing that doesn't have crossings or keeping the whole drawing within a small amount of area.",
            "But there's another property that I think is important to, which is that if we're drawing a special class of graphs, we should draw it in such a way that makes the properties of that class apparent visually.",
            "Because if you're not doing that, then why not just use a more general purpose graph drawing algorithm?"
        ],
        [
            "So for instance.",
            "We can devise algorithms for drawing partial cubes.",
            "By first embedding them on a low dimensional lattice, low dimensional because that leads to better drawings and then projecting.",
            "That lattice onto the plane here is an orthogonal projection of a 6 dimensional hypercube.",
            "And you can see it actually.",
            "I mean, there's lots of crossings, obviously, but it's not a planar graph, so you can't avoid that.",
            "Um but the vertices are reasonably well spaced out from each other and separated from the edges, and you can sort of tell where everything goes, but also.",
            "Because we're doing an orthogonal projection.",
            "Every one of these zones.",
            "Turns into a family of congruent line segments.",
            "Translates of each other in fact.",
            "And so that the partial cube structure is actually quite well visible in this kind of drawing, it works well for the hypercube.",
            "It doesn't work as well for some other kinds of."
        ],
        [
            "Partial cubes I want to show you another kind of projection.",
            "Here's a projection of a 3 dimensional lattice embedding.",
            "But IT projects onto a planar graph.",
            "We've chosen a projection along one of the main diagonals of the integer lattice, and so when you project in that direction, you get something projected onto a hexagonal lattice.",
            "We can tell from this lattice dimension theorem that I told you about.",
            "We can tell when a high partial cube has a 3 dimensional lattice embedding.",
            "It's also easy to tell when a 3 dimensional lattice embedding has a planar projection like this.",
            "Simply try all of the four main diagonal directions and see whether one of them works.",
            "What I don't know how to solve is this.",
            "If I give you a partial cube not yet embedded in any kind of geometric space.",
            "Is there a 3 dimensional lattice embedding of that partial cube that can be projected flat like this?",
            "I don't know how to find such an embedding, if it exists, so that's an open press."
        ],
        [
            "OK, different kind of drawing of partial cubes.",
            "This works for some partial cubes, not all of them, but when it does, it produces nice drawings.",
            "You may have noticed it."
        ],
        [
            "This previous drawing.",
            "All of these faces are nice run by there some."
        ],
        [
            "Trickle.",
            "Well, we can tip.",
            "Consider more general drawings in which the faces are not congruent to each other but are symmetrical polygons centrally symmetric specifically?",
            "It turns out that if you have.",
            "Any planar drawing of this type?",
            "You can form a dual collection of curves simply by connecting pairs of opposite midpoints of each of these faces.",
            "And then extending them out to Infinity.",
            "And the curves that you get are what are called pseudo lines.",
            "There are topologically like lines.",
            "They extend out to Infinity in two directions.",
            "They partition the plane into two parts.",
            "They cross each other at most once, like lines do.",
            "And that's a very important property.",
            "And in fact, such a collection of curves is called a week pseudoline arrangement.",
            "The week there refers to the fact that they are allowed to not cross at all.",
            "But if they do cross, they have to cross at most once.",
            "And the proof that line arrangements give you partial cubes can be generalized to pseudoline arrangements.",
            "So any planar graph that has a drawing like this with symmetric faces.",
            "Must be a partial queue.",
            "And in the other direction, it's possible algorithmically to determine whether a given partial cube has a drawing of this type."
        ],
        [
            "And produce the drawing efficiently.",
            "So here are some examples of planar graphs that have centrally symmetric faces.",
            "This is a little more complicated than one would find in chemistry, but benzenoid systems from chemistry.",
            "Rhombic tilings of the plane polyominoes.",
            "And I've included this one just to show you.",
            "This is a partial cube.",
            "This is a planar drawing of the partial cube with symmetric faces.",
            "They're all squares, but this is not an isometric embedding into a lattice because these two vertices.",
            "Alright, distance one in the lattice, but there are distance three in the partial Q.",
            "So these these planar symmetric drawings allow you a little more general generality then then lattice embeddings."
        ],
        [
            "One last graph drawing technique.",
            "Here's a system of curves.",
            "Each of the curves is a wedge, and they're all translates of each other.",
            "But they're also pseudolines because they're topologically like lines.",
            "They partition the plane into two parts.",
            "And they cross each other at most once.",
            "Therefore it's a partial cube, but in fact actually one can prove.",
            "Specifically, what is a partial cube?",
            "The regions of this?",
            "With adjacency of regions.",
            "The dual graph of this arrangement.",
            "One can prove in fact, that.",
            "The partial cubes that can be represented as region graphs of arrangements of wedges like this are exactly the ante matroids that have order dimension 2."
        ],
        [
            "And in this case.",
            "One can get a very nice drawing just by putting a vertex at the upper left corner of each region.",
            "Each region has one unique maximal point.",
            "Place a vertex there except for the unbounded region and just place the point above into the.",
            "Rate of everything else and you get this drawing.",
            "This drawing of a partial cube.",
            "Has this nice property that.",
            "There is 1 lower left Vertex, 1 upper right vertex.",
            "All of the faces are convex quadrilaterals, and each of those quadrilaterals has a. Vertical left side and a horizontal bottom side, although some of their other sides may not be vertical or horizontal.",
            "It turns out that drawings of that type can only exist.",
            "When the input graph is an order to mention to anti matroid.",
            "So again we have this property that if you see a drawing like this you know exactly what kind of graph it is.",
            "The graph structure is visible in the drawing."
        ],
        [
            "I wanna move on talk about.",
            "Different problem related also related to arrangements then that's the problem of cubic partial cubes graph enumeration problem.",
            "We'd like to characterize or classify or understand."
        ],
        [
            "Partial cubes an A specific family of partial cubes that seems particularly difficult to find examples of are the cubic partial cubes.",
            "Cubic here, meaning three regular.",
            "So here are some.",
            "It's an infinite family, in fact.",
            "Of prisms over even polygons, so take an even Polygon Cartesian product with an edge.",
            "Gives you a prism, and that's a cubic partial cube.",
            "Here's another example that is hard graph.",
            "The levee graph of the dysard configuration.",
            "Hum and what was known about this was one infinite family of partial cubes.",
            "The presence and then a small number of sporadic examples, like this one.",
            "Actually this is the only known non planar cubic partial cube.",
            "The rest are all planar.",
            "I should mention it's.",
            "An easy exercise.",
            "And if you're bored with this talk, you might try thinking about it to classify the vertex, transitive, planar, cubic partial cubes.",
            "These are vertex, transitive, planar, and there's three other sporadic examples.",
            "This is also vertex transitive but non planar an I don't know whether there are any more transitive non planar cubic partial cubes.",
            "Or whether there are any other non planar cubic partial cubes at all, but I want what I want."
        ],
        [
            "Show you is a connection between this problem and one of arrangements.",
            "So.",
            "What we have here on this side is an arrangement of lines, and it's what's called a simplicial arrangement.",
            "That means that all of the faces are triangles.",
            "When you view them in the projective plane, in this case you also need to include the line at Infinity in the projective plane in order to make this simplicial.",
            "So we have four triangles in the middle, obviously.",
            "Above and below and left and to the right of them we have these 3 sided regions.",
            "Where?",
            "Two of the sides are parallel and therefore meet at that line at Infinity.",
            "In the projective plane and form a triangle in the projective plane.",
            "And then we also have diagonally coming out of this these.",
            "8 wedges and each of those wedges together with the line at Infinity, forms a triangle.",
            "So we have an arrangement.",
            "Every face is a triangle and it's tempting just to take the dual of that arrangement.",
            "The region graph of that 2 dimensional arrangement and get partial cube from it.",
            "But if you do, that happens in the Euclidean plane, not in the projective plane, and you get some degree two vertices.",
            "So to turn it into a cubic partial cube, we have to lift it to a central arrangement in 3D and arrangement of planes through the origin an that maybe seem a little abstract and geometrical, but.",
            "It's actually probably a familiar concept to all of you.",
            "If you think of your eye as the origin.",
            "And you look at that line arrangement over there with your eye at the origin.",
            "Each of those lines together with your eye determines a plane in 3D through your eye.",
            "So we have their six lines.",
            "There's another 7th one, which is the line at Infinity corresponding to the horizon of the plane that you're looking at.",
            "And.",
            "Take that system of seven planes.",
            "Formed by looking at this line arrangement.",
            "With your eye at the origin.",
            "And you get something looking like this.",
            "Very symmetrical in this case, arrangement of seven planes in 3D such that all of the chambers formed by those planes are triangular cones.",
            "And if we take the dual region graph of this arrangement.",
            "We got a cubic partial cube."
        ],
        [
            "Now what's known about simplicial arrangements.",
            "It's in a similar but slightly more advanced state to what's known about cubic partial cubes.",
            "There's a few infinite families and some sporadic examples.",
            "I think the best reference is still Green balance book from 1972.",
            "Um?",
            "One example of a simplicial arrangement is an ear pencil.",
            "That's a pencil of lines set of lines through a single point together with one line not on that point.",
            "And if you do the construction I just showed you for that arrangement, you just get the prisms again.",
            "But here's another family of.",
            "Cube of simplicial arrangements.",
            "Imagine two mirrors.",
            "Connected at a hinge.",
            "And you attach a laser to one of the mirrors perpendicularly to it.",
            "And shine it off and it bounces.",
            "And this laser will bounce several times before finally.",
            "Escaping out to Infinity.",
            "If you make the angle between these two mirrors.",
            "BA.",
            "Integer fraction of π.",
            "You get a simplicial arrangement like this because.",
            "The mirrors themselves form lines in the arrangement.",
            "But then because of the way light bounces.",
            "The the image of the reflected line through this mirror.",
            "Looks like the continuation of this line.",
            "And Anne.",
            "Then the second image of it reflected again looks like it's continuation further, and so on and.",
            "What you end up getting is patterns that look like this.",
            "These are.",
            "For examples of simplicial arrangements, simply with different angles between the mirrors, the mirrors in these pictures are.",
            "Any two of the consecutive Rays through the origin.",
            "An all of the rest of the lines in these arrangements are either the original laser beam or its reflections.",
            "So we can get infinite families of simplicial arrangements like this.",
            "And that gives us infinite families of CU."
        ],
        [
            "Cubes that weren't known before.",
            "There are some additional sporadic examples.",
            "Several families of.",
            "Arrangements and I should say that this works also for pseudoline arrangements.",
            "If you look at this example, they look sort of like lines, but they're bent."
        ],
        [
            "I don't have time to tell you a lot about this, but there's a connection to that symmetric faced planar drawing algorithm that I was telling you about last time.",
            "If you take a simplicial arrangement.",
            "Form a dual.",
            "Region graph of that and find a symmetric drawing of that dual.",
            "Connect 2 copies of that dual at the degree two vertices.",
            "It's the same graph that you just got before with this 3D construction, but done a different way that."
        ],
        [
            "It's interesting because sometimes we can connect things that aren't the same as each other.",
            "Take two arrangements that have the same overall polygonal shape, connect them to each other and we sometimes.",
            "Get a partial cube that doesn't come from a line arrangement.",
            "And this happens whenever these two symmetric drawings overlay on top of each other to produce another symmetric planar drawing.",
            "But if they don't overlay to form a planar drawing here, there's some crossings.",
            "Um?",
            "Then it may not be a partial cube."
        ],
        [
            "So.",
            "We still don't know whether there are infinitely many cubic partial cubes that don't come from line arrangements in this way, but at least this gives us more examples."
        ],
        [
            "OK.",
            "I only have a few slides left, but I wanted to tell you about some new developments.",
            "These have all been, you know, applications of geometry, two partial cube theory or partial cube drawing.",
            "I wanted to tell you about a different situation where partial cubes tell us something new about geometry, so this is."
        ],
        [
            "By way of an application.",
            "So.",
            "This this figure shows all of the.",
            "64 different ways.",
            "Of triangulate Ng a three by three grid of points.",
            "Triangulation is just a maximal set of line segments that have the points as endpoints don't contain any other points in their interior and don't cross each other.",
            "We'd like to understand all of the set of triangulations of a point set.",
            "For instance, for finite element mesh generation applications, and there's an important operation on triangulations called flipping.",
            "You can take a triangulation such as this one, pull out an edge, add in another edge, that's a flip.",
            "And what this diagram shows is the graph of all 64 triangulations of this point set.",
            "An all of the flips connecting pairs of triangulations.",
            "Some of those flips I've shown just as edges within each group.",
            "And then in order to make the diagram comprehensible, I've taken the edges connecting pairs of triangulations that go from one of these groups to another.",
            "Just connected them between the groups rather than between the individual triangulations, but this is just an undirected graph on 64 vertices.",
            "Brown in this kind of non standard way.",
            "There's been an open problem in algorithms since at least the 1980s.",
            "How can you tell what the minimum number of flips is to get from one triangulation to another?",
            "That's called the flip distance.",
            "It's just the distance in this undirected graph.",
            "But we don't know how to compute flip distances efficiently, because this graph can be very huge compared to the size of of the input.",
            "The pairs of triangulations that you're trying to compute the distance of."
        ],
        [
            "In order to understand flip distance, we need a geometrical construction called the Delonais triangulation.",
            "It's a specific triangulation that connects two points.",
            "Whenever we can find a circle that contains those two points and no others.",
            "That definition gives you a triangulation.",
            "And.",
            "If you take any triangulation.",
            "An find.",
            "Set a four points in that that are triangulated by something other than the delonais triangulation of those four points, flip them.",
            "Find some other local configuration that's not delonais.",
            "Flip that, keep going.",
            "Eventually you will reach the delonais triangulation and it will happen in at most N squared flips.",
            "Actually, at most N choose two flips because once you flip an edge away, it never comes back again.",
            "And that proves that any two triangulations have flipped distance at most N squared because.",
            "Take one triangulation, flip it to the delonais triangulation, take the other triangulation, flip it to the delonais triangulation, combine those two sequences of flips and you get a path connecting your two original triangulations."
        ],
        [
            "I wanted to find one more graph.",
            "From a point set.",
            "And that's called the quadrilateral graph we connect.",
            "We have a vertex for every edge that could be in a triangulation, an an edge for every empty quadrilateral that is every possible flip that we could make."
        ],
        [
            "And, um.",
            "I think this is my second to last slide, but.",
            "Here's a theorem.",
            "The flip graph is a partial cube.",
            "If and only if it's bipartite, which happens if and only if the quadrilateral graph is a forest if and only if the quadrilateral graph is bipartite if and only if.",
            "The point set has no empty Pentagon in it.",
            "I.",
            "It involves using using this concept of delonais flipping to show that.",
            "If there is no empty Pentagon, the flip graph must be a forest, and the quadrilateral graph must be a forest, and the flip graph can be embedded into the product of the trees in that forest.",
            "I don't have time for the proof, I just want to say that this leads to a quadratic time flip distance algorithm based on that same idea of flipping both of the triangulations towards the Delaunay triangulation and counting the number of edges that occur only in one of those two flip sequences.",
            "So this is the first progress on this old flip distance algorithm.",
            "It doesn't compute flip distance for all point sets by any means, but it computes."
        ],
        [
            "Distance for a lot of point sets.",
            "We know from old results in discrete geometry that points in general position have empty pentagons in them, but there are a lot of point sets that are not in general position and don't have any empty Pentagon.",
            "For instance in particular and by end grids."
        ],
        [
            "So.",
            "I hope I've convinced you that geometry can be useful in understanding partial cubes, but also partial cubes can be interesting and useful in understanding geometry, and that's it.",
            "Thank you for this inspiring lecture.",
            "Now we are kind of behind the schedule so I suggest to address any questions to the speaker later on and we go on with the coffee break.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm very pleased to introduce David Epstein.",
                    "label": 0
                },
                {
                    "sent": "Is mainly working in discrete geometry and a lot of it from algorithmic POV, and today's talks will be containing a lot of graph theory.",
                    "label": 0
                },
                {
                    "sent": "Some applications I guess about geometry of partial groups and their base and discrete geometry in it as well.",
                    "label": 1
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "Outline start with.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some definitions before we go onto.",
                    "label": 0
                },
                {
                    "sent": "The new",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Content.",
                    "label": 0
                },
                {
                    "sent": "So there's been a lot of work both in mathematics and computer science relating graphs.",
                    "label": 0
                },
                {
                    "sent": "And finite metric spaces and weighted graphs and distances in graphs.",
                    "label": 1
                },
                {
                    "sent": "I think of those as being closely related things to more uniform metric spaces, geometric spaces, Euclidean metrics, L1L Infinity metrics.",
                    "label": 0
                },
                {
                    "sent": "For instance, Borgens theorem telling you that if you have a finite metric space with N points, think of it as a graph with N vertices.",
                    "label": 0
                },
                {
                    "sent": "It can be embedded into an L1 space.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Actually a fairly low dimensional L1 space in such a way that the distances are only distorted by a log rhythmic factor, and that's important in some approx.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Nation algorithms?",
                    "label": 0
                },
                {
                    "sent": "I'm going to be concentrating here on unweighted graphs because this is after all, graph theory.",
                    "label": 1
                },
                {
                    "sent": "That embed into an integer lattice with the.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One distance, so these are the partial cubes.",
                    "label": 0
                },
                {
                    "sent": "And the way I like to think of them, most of the time is graphs that can be embedded either into an integer lattice.",
                    "label": 1
                },
                {
                    "sent": "Or onto a hypercube.",
                    "label": 1
                },
                {
                    "sent": "So that all of the distances in the graph.",
                    "label": 0
                },
                {
                    "sent": "Are the same as the distances between the vertices of the hypercube that they are mapped to, so.",
                    "label": 0
                },
                {
                    "sent": "This is a graph here that represents the permutations of four items.",
                    "label": 0
                },
                {
                    "sent": "I haven't shown the permutations on this figure, but.",
                    "label": 0
                },
                {
                    "sent": "Any two permutations are adjacent if they are connected by a swap of two adjacent items.",
                    "label": 0
                },
                {
                    "sent": "But this graph can be labeled with these 6 dimensional integer coordinates.",
                    "label": 0
                },
                {
                    "sent": "In such a way that if you take any two vertices, say this one and this one.",
                    "label": 0
                },
                {
                    "sent": "The distance between those two vertices in the graph is the same as the distance in the L1 metric between those coordinates, or thinking of 01 coordinates as defining a hypercube in L1 space, it's the Hamming distance, the number of positions at which the two labels differ.",
                    "label": 0
                },
                {
                    "sent": "So that's the definition there are.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ways of thinking about partial cubes though.",
                    "label": 0
                },
                {
                    "sent": "Jokovich Ann Winkler.",
                    "label": 0
                },
                {
                    "sent": "Proved characterizations.",
                    "label": 0
                },
                {
                    "sent": "They're slightly different, but for the purposes of this talk I'll conflate them.",
                    "label": 0
                },
                {
                    "sent": "We can define a relationship on the edges.",
                    "label": 0
                },
                {
                    "sent": "And edge PQ is related to an edge Rs, usually denoted by Theta.",
                    "label": 0
                },
                {
                    "sent": "But I've used a~ here.",
                    "label": 0
                },
                {
                    "sent": "If that inequality between the distances holds, so these two edges over on this side are related.",
                    "label": 0
                },
                {
                    "sent": "But if, for instance, we have and a pair of edges like this where the top pair of vertices are at distance D apart in the bottom right distance D + 2, then they would not be related.",
                    "label": 0
                },
                {
                    "sent": "And one can prove that a graph is a partial cube by the previous definition if and only if it's a bipartite graph for which this is an equivalence relationship on the edges.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This relationship partitions the edges into equivalence classes, but each equivalence class is a cut that partitions the graph into 2 connected components.",
                    "label": 1
                },
                {
                    "sent": "And you can recover the hypercube embedding A 01 lattice embedding by using a coordinate for each of these equivalence classes.",
                    "label": 1
                },
                {
                    "sent": "And making that coordinate be 0 on one side of the cut and one on the other side of the cut.",
                    "label": 0
                },
                {
                    "sent": "And in particular that tells us actually that the hypercube embedding is unique up to symmetries of the hypercube.",
                    "label": 0
                },
                {
                    "sent": "Because it can be recovered in this way.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "From the graph structure.",
                    "label": 0
                },
                {
                    "sent": "It's still not the only way to define partial cubes, so I with Jean Claude Farman and Sergey Sergey Ovchinnikov have been looking at a different.",
                    "label": 0
                },
                {
                    "sent": "Characterization of essentially the same combinatorial systems.",
                    "label": 0
                },
                {
                    "sent": "Which phone calls media theory?",
                    "label": 0
                },
                {
                    "sent": "In this theory, a medium is a system of States and transformations on states.",
                    "label": 1
                },
                {
                    "sent": "Satisfying certain axioms, you can think of it as a deterministic finite automaton.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 1
                },
                {
                    "sent": "The axioms are listed here that that if one of the transformations changes, the state S to a State V, then it has a reverse transformation that changes V back to S. Etc.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "The the system is defined by this.",
                    "label": 0
                },
                {
                    "sent": "These axioms turn out to be exactly the partial cubes from a different point of view.",
                    "label": 0
                },
                {
                    "sent": "Which I won't consider very much in this talk, but.",
                    "label": 0
                },
                {
                    "sent": "Is.",
                    "label": 0
                },
                {
                    "sent": "I think this way of looking at them is was an important key to an algorithm that I recently developed for recognizing partial cubes more efficiently in N squared time, but.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Not part of this talk.",
                    "label": 0
                },
                {
                    "sent": "So any graph has vertices an edges and.",
                    "label": 0
                },
                {
                    "sent": "There's two to one correspondence between undirected edges and darts, or directed edges.",
                    "label": 0
                },
                {
                    "sent": "In a partial cube there are also these equivalence classes, Ann.",
                    "label": 0
                },
                {
                    "sent": "Really they function as another kind of object.",
                    "label": 0
                },
                {
                    "sent": "It just like in a map, one has not just vertices and edges, but vertices, edges and faces in a partial cube one has vertices, edges and.",
                    "label": 1
                },
                {
                    "sent": "Equivalence classes of this relationship, or we can call them zones.",
                    "label": 0
                },
                {
                    "sent": "In the media theory point of view, there are these transformations or input symbols to the finite automaton.",
                    "label": 0
                },
                {
                    "sent": "In the cube embedding, they are the indexes of coordinates.",
                    "label": 0
                },
                {
                    "sent": "And there's there's again at this two to one correspondence going on.",
                    "label": 0
                },
                {
                    "sent": "Each zone is a set of edges, but partitions the graph into two subsets of vertices.",
                    "label": 0
                },
                {
                    "sent": "Which I'll call semi cubes.",
                    "label": 0
                },
                {
                    "sent": "The tokens again come in pairs corresponding to the semi cubes and so on.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now I wanted to go through just.",
                    "label": 0
                },
                {
                    "sent": "Random collection of examples of systems that give you partial cubes just to show that it's not just an abstract structure we're defining.",
                    "label": 1
                },
                {
                    "sent": "It comes from a number of applications.",
                    "label": 0
                },
                {
                    "sent": "And then down at the end here I'll have another, bigger application of power.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Cubes again.",
                    "label": 0
                },
                {
                    "sent": "Since I'm interested in discrete geometry, this one is important to me.",
                    "label": 0
                },
                {
                    "sent": "If you have a hyperplane arrangement, say an arrangement of lines in the Euclidean plane, these dashed lines in this figure.",
                    "label": 1
                },
                {
                    "sent": "When can form a dual graph of the arrangement where there is a vertex representing each cell of the arrangement?",
                    "label": 0
                },
                {
                    "sent": "And two vertices are adjacent in the graph.",
                    "label": 0
                },
                {
                    "sent": "If they share a D -- 1 dimensional component of boundary.",
                    "label": 1
                },
                {
                    "sent": "If they're adjacent, if they're separated from each other by only one of the hyperplanes in the arrangement.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This vertex is adjacent to this vertex because the the two cells are adjacent across this line.",
                    "label": 0
                },
                {
                    "sent": "That turns out to be a partial cube.",
                    "label": 0
                },
                {
                    "sent": "We can label the partial cube by supplying a coordinate for each line where that coordinate is 0 for the regions below the line, an one for the regions above the line.",
                    "label": 1
                },
                {
                    "sent": "It.",
                    "label": 1
                },
                {
                    "sent": "We can then show that that graph distance is equal to the Hamming distance of that labeling and to find.",
                    "label": 0
                },
                {
                    "sent": "Up to show that the graph distances.",
                    "label": 0
                },
                {
                    "sent": "Do I have this less than greater than?",
                    "label": 1
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "To show that the graph distance is less than or equal to the Hamming distance, you all you have to observe is that when you forming path in the graph between any two vertices.",
                    "label": 0
                },
                {
                    "sent": "If those two vertices differ in one coordinate, then that path has to cross geometrically, the hyperplane separating them at least once.",
                    "label": 0
                },
                {
                    "sent": "It could cross more than once.",
                    "label": 0
                },
                {
                    "sent": "I think I have the inequality is reversed here because that shows that the graph distance is greater than or equal to the Hamming distance.",
                    "label": 1
                },
                {
                    "sent": "But to show that the graph distance is less than or equal to the Hamming distance.",
                    "label": 0
                },
                {
                    "sent": "We need to find a path where.",
                    "label": 0
                },
                {
                    "sent": "It in the graph that that crosses each hyperplane exactly once, and you can find such a path just by taking the line segment between two pairs of points.",
                    "label": 0
                },
                {
                    "sent": "Between two points, one in each of the regions.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "It's straightforward to prove that any hyperplane gives you hyperplane arrangement gives.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Partial Cuban this way.",
                    "label": 0
                },
                {
                    "sent": "Here's a more combinatorial example.",
                    "label": 0
                },
                {
                    "sent": "But it can be described in terms of hypercube arrangements.",
                    "label": 0
                },
                {
                    "sent": "Consider all the acyclic orientations of an undirected graph.",
                    "label": 1
                },
                {
                    "sent": "So here the undirected graph is C4.",
                    "label": 0
                },
                {
                    "sent": "And this drawing shows you.",
                    "label": 0
                },
                {
                    "sent": "14 acyclic orientations of C4, there are 16 ways of orienting all of the four edges of C4, but two of them are cyclic.",
                    "label": 0
                },
                {
                    "sent": "Two of these orientations are adjacent to each other.",
                    "label": 1
                },
                {
                    "sent": "If they differ by flipping the orientation of a single edge.",
                    "label": 0
                },
                {
                    "sent": "So this pair of orientations differs.",
                    "label": 0
                },
                {
                    "sent": "In this case, this bottom edge goes left to right, right to left.",
                    "label": 0
                },
                {
                    "sent": "In the other case, it goes left to right.",
                    "label": 0
                },
                {
                    "sent": "This system of States and adjacency's.",
                    "label": 0
                },
                {
                    "sent": "Can be translated into a hyperplane arrangement where.",
                    "label": 0
                },
                {
                    "sent": "We have a coordinate for each vertex of our underlying undirected graph.",
                    "label": 1
                },
                {
                    "sent": "And we have a paper plane of the Form X I = X J.",
                    "label": 0
                },
                {
                    "sent": "Whenever we have an edge VIVJ in.",
                    "label": 0
                },
                {
                    "sent": "Our underlying graph.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "A point in R to the to the D, where D is the number of vertices can represent an acyclic orientation.",
                    "label": 0
                },
                {
                    "sent": "In which one orients.",
                    "label": 0
                },
                {
                    "sent": "An edge from the eye to Vijay.",
                    "label": 0
                },
                {
                    "sent": "If the.",
                    "label": 0
                },
                {
                    "sent": "Ice coordinate of the point is less than the death coordinate of the point, and these hyperplanes exactly specify the points in R to the D for which that.",
                    "label": 0
                },
                {
                    "sent": "Representation is not well defined, so this is exactly the right way of representing this geometrically.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's a partial cube.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Various kinds of order relationships on sets of items can be represented as partial cubes, so these are weak orders.",
                    "label": 0
                },
                {
                    "sent": "A week order is a total ordering on an equivalence relation.",
                    "label": 0
                },
                {
                    "sent": "Of a set.",
                    "label": 0
                },
                {
                    "sent": "And so these 13 vertices represent all of the possible weak orderings on three items.",
                    "label": 0
                },
                {
                    "sent": "And again, it can be represented as a partial cube.",
                    "label": 0
                },
                {
                    "sent": "Or is a hyperplane arrangement.",
                    "label": 0
                },
                {
                    "sent": "Which farming and others have used in so?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Choice theory.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "This this one.",
                    "label": 0
                },
                {
                    "sent": "Seems kind of abstract, but it's where I came into this picture.",
                    "label": 0
                },
                {
                    "sent": "From a concrete point of view and anti matroid is a family of sets.",
                    "label": 1
                },
                {
                    "sent": "With two properties.",
                    "label": 0
                },
                {
                    "sent": "If you take any two sets in the family and form their union, you get another set in the family.",
                    "label": 1
                },
                {
                    "sent": "If you take any nonempty set in the family.",
                    "label": 0
                },
                {
                    "sent": "You can find one element of that set that you can remove and get another set in the family.",
                    "label": 0
                },
                {
                    "sent": "If you have those two properties, it forms a set system called an anti matroid.",
                    "label": 0
                },
                {
                    "sent": "One of which I've drawn here.",
                    "label": 0
                },
                {
                    "sent": "These turn out to be partial cubes, so these are the sets labeled by just their elements.",
                    "label": 1
                },
                {
                    "sent": "Adjacency consisting of adding and removing elements.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "My colleague at UC Irvine Jean Claude Farman.",
                    "label": 0
                },
                {
                    "sent": "Has a system for teaching kids math via computer.",
                    "label": 0
                },
                {
                    "sent": "That involves accurately assessing what the student knows.",
                    "label": 0
                },
                {
                    "sent": "And from that, deducing what the student is ready to learn next.",
                    "label": 1
                },
                {
                    "sent": "In order to perform that assessment, he needs to have a model of what states of knowledge are possible for students of mass to be in what?",
                    "label": 0
                },
                {
                    "sent": "There are too many concepts.",
                    "label": 0
                },
                {
                    "sent": "It would be inefficient to use a model in which every possible subset of concepts as possible, but for instance.",
                    "label": 0
                },
                {
                    "sent": "There are certain states that are just don't make any sense pedagogically.",
                    "label": 0
                },
                {
                    "sent": "If you know how to add numbers with carrying, then you also know how to add them without carrying.",
                    "label": 0
                },
                {
                    "sent": "And so.",
                    "label": 0
                },
                {
                    "sent": "He has a company that sells the software that has models of all of the possible states of mathematical knowledge that these elementary school students might be in that.",
                    "label": 0
                },
                {
                    "sent": "Have this form, they are anti matroids.",
                    "label": 0
                },
                {
                    "sent": "They have millions or billions of states.",
                    "label": 0
                },
                {
                    "sent": "So it's important to be able to understand the structure of these graphs.",
                    "label": 0
                },
                {
                    "sent": "An operate on them efficiently and they turn out to be partial cubes.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just a number theoretic example, I don't have a lot to say about this one, but partitions of integers can be turned.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And partial cubes.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Dimension.",
                    "label": 0
                },
                {
                    "sent": "There are a lot of different ways of defining a concept of dimension for a partial cube.",
                    "label": 1
                },
                {
                    "sent": "The most natural and simple one is just that.",
                    "label": 1
                },
                {
                    "sent": "The dimension of this hypercube embedding of the graph and since that embedding is, as I said, unique.",
                    "label": 1
                },
                {
                    "sent": "This dimension is well defined and it's essentially just the number of zones.",
                    "label": 1
                },
                {
                    "sent": "So it can be computed straightforwardly polynomial time.",
                    "label": 0
                },
                {
                    "sent": "What I want to spend a little more time talking about is this different dimension?",
                    "label": 0
                },
                {
                    "sent": "The minimum dimension of an embedding into an integer lattice.",
                    "label": 1
                },
                {
                    "sent": "Which may be significantly lower than the isometric dimension.",
                    "label": 0
                },
                {
                    "sent": "But turns out May also be computed in polynomial time.",
                    "label": 1
                },
                {
                    "sent": "A lattice is a Cartesian product of paths.",
                    "label": 0
                },
                {
                    "sent": "And so a path is a special case of a tree.",
                    "label": 1
                },
                {
                    "sent": "It's natural to consider embedding partial cubes into Cartesian product of trees, which are a special case of partial cubes that dimension.",
                    "label": 0
                },
                {
                    "sent": "Makes sense to define can be computed if the dimension is too, but is hard to compute for anything higher than that.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "I think there should be some notion of dimension of a representation of a partial cube as a hyperplane arrangement, but.",
                    "label": 0
                },
                {
                    "sent": "Such a representation doesn't always exist, and unfortunately, even for two dimensions.",
                    "label": 0
                },
                {
                    "sent": "It's hard to tell whether something is dual to a hyperplane arrangement.",
                    "label": 0
                },
                {
                    "sent": "Peter Shor showed that one can define arrangements of curves that look topologically like line arrangements, but.",
                    "label": 0
                },
                {
                    "sent": "Ha.",
                    "label": 0
                },
                {
                    "sent": "May not be and showed that it's hard to tell the difference.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Describe these concepts out of order because I think the tree dimension one is a useful warm up for the.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Lattice dimension.",
                    "label": 0
                },
                {
                    "sent": "So we'd like to take our partial cube.",
                    "label": 0
                },
                {
                    "sent": "Represented as an isometric sub graph of a product of trees.",
                    "label": 1
                },
                {
                    "sent": "And, um.",
                    "label": 0
                },
                {
                    "sent": "If you think about it, it turns out to mean that we're.",
                    "label": 0
                },
                {
                    "sent": "When we represent a partial cube as a sub graph of some kind of product.",
                    "label": 0
                },
                {
                    "sent": "That generally means that the zones of the partial cube get partitioned into the different factors of this product.",
                    "label": 0
                },
                {
                    "sent": "And so we would like to partition the zones of our partial cube in such a way that that the part within each of these partitions forms a tree.",
                    "label": 0
                },
                {
                    "sent": "And in order to do that, we can't.",
                    "label": 0
                },
                {
                    "sent": "For instance, this zone and this zone could not be.",
                    "label": 0
                },
                {
                    "sent": "Included in the same factor of the partial cube because they have these four vertices that don't form a tree and wouldn't form a tree even when projected onto that factor.",
                    "label": 0
                },
                {
                    "sent": "So we can define a compatibility graph, also called acrossing graph.",
                    "label": 0
                },
                {
                    "sent": "That describes.",
                    "label": 0
                },
                {
                    "sent": "When two zones might be included in the same tree.",
                    "label": 0
                },
                {
                    "sent": "Or cannot be included in the same tree.",
                    "label": 0
                },
                {
                    "sent": "And essentially what we have to do is to partition the zones into independent subsets of this compatibility graph.",
                    "label": 0
                },
                {
                    "sent": "So it's just a graph coloring problem.",
                    "label": 0
                },
                {
                    "sent": "The tree dimension is less than or equal to K if and only if the compatibility graph are crossing graph of these zones is K chromatic and that immediately gives you a polynomial time algorithm for testing whether it's two chromatic.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But it also immediately tells you that it's hard for any higher dimension.",
                    "label": 0
                },
                {
                    "sent": "Because any graph can be represented as the compatibility graph of some partial Q ban in fact.",
                    "label": 1
                },
                {
                    "sent": "We can be more specific and say it's a compatibility graph of some median graph.",
                    "label": 1
                },
                {
                    "sent": "So finding dimensions greater than three is as hard as graph coloring, which makes it maybe a little.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "More surprising that the lattice dimension.",
                    "label": 0
                },
                {
                    "sent": "Is so much easier.",
                    "label": 0
                },
                {
                    "sent": "We'd like to embed a partial cube into an integer lattice with as low a dimension as possible.",
                    "label": 1
                },
                {
                    "sent": "Here are some drawings of three dimensional embeddings of graphs.",
                    "label": 0
                },
                {
                    "sent": "Where in each case the hypercube dimension is something higher than three.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "If we don't care about distance is just adjacency.",
                    "label": 0
                },
                {
                    "sent": "But we want to embed a graph into a lattice in such a way that adjacent vertices in the graph are adjacent in the lattice.",
                    "label": 0
                },
                {
                    "sent": "And no two vertices in the graph are on top of each other.",
                    "label": 0
                },
                {
                    "sent": "That's also a hard problem.",
                    "label": 0
                },
                {
                    "sent": "It's even hard for the two dimensional lattice an even for embedding trees into a 2 dimensional lattice.",
                    "label": 0
                },
                {
                    "sent": "But the partial cube structure if we embed preserving distances, it reduces the class of embeddings that we allow.",
                    "label": 0
                },
                {
                    "sent": "But that extra rigidity also allows us to find.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The embeddings more efficiently.",
                    "label": 0
                },
                {
                    "sent": "So for example, if we want to embed a tree into a lattice, it turns out that.",
                    "label": 0
                },
                {
                    "sent": "The dimension that you have to use is just the number of leaves divided by two.",
                    "label": 0
                },
                {
                    "sent": "Because there can be at most one extreme point in each dimension and those extreme points have to cover all of the leaves.",
                    "label": 1
                },
                {
                    "sent": "And sometimes that's enough to tell us the dimension of a partial cube, at least approximately because.",
                    "label": 0
                },
                {
                    "sent": "If you have a more general partial cube.",
                    "label": 0
                },
                {
                    "sent": "With a degree Delta vertex.",
                    "label": 0
                },
                {
                    "sent": "Then just that vertex and its neighbors form a smaller partial cube, just a star.",
                    "label": 0
                },
                {
                    "sent": "That already in in that local neighborhood has dimension Delta divided by two and so that gives you a very easy.",
                    "label": 1
                },
                {
                    "sent": "A lower bound on the dimension of any graph dimension of any partial cube is at least the maximum degree divided by two and sometimes.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's tight.",
                    "label": 0
                },
                {
                    "sent": "To understand more general latista embeddings.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "These are the semi cubes of this partial cube which I've shown with a lattice embedding.",
                    "label": 0
                },
                {
                    "sent": "In a lattice embedding of a partial cube, each semi cube must be the set of points with some coordinate less than or equal to some bound or greater than or equal to some bound.",
                    "label": 1
                },
                {
                    "sent": "So for instance, if we draw a vertical line through this zone.",
                    "label": 0
                },
                {
                    "sent": "We get HD AEB on one side.",
                    "label": 0
                },
                {
                    "sent": "That's a semi cube.",
                    "label": 0
                },
                {
                    "sent": "We get CGFIJ on the other side.",
                    "label": 0
                },
                {
                    "sent": "That's also a semi cube.",
                    "label": 0
                },
                {
                    "sent": "So if we just read from left to right, we get.",
                    "label": 0
                },
                {
                    "sent": "Let's see.",
                    "label": 0
                },
                {
                    "sent": "HD is a semi cube and the complement of HD is a semi Q.",
                    "label": 1
                },
                {
                    "sent": "We get the second pair of semi cubes that I told you about Abd EH?",
                    "label": 0
                },
                {
                    "sent": "CFGIJ here we get the complement of gij and then gij itself the compliment of JJ.",
                    "label": 0
                },
                {
                    "sent": "And I've drawn that over here.",
                    "label": 0
                },
                {
                    "sent": "As a path.",
                    "label": 0
                },
                {
                    "sent": "DHABCDEFGIJ etc.",
                    "label": 0
                },
                {
                    "sent": "Just a sequence of semi cubes alternating between left and right sides.",
                    "label": 0
                },
                {
                    "sent": "For that coordinate, and here's another path for the other coordinate.",
                    "label": 0
                },
                {
                    "sent": "The dashed edges.",
                    "label": 1
                },
                {
                    "sent": "Are when we alternate from left to right on the same zone and so they represent complementary pairs of semi cubes.",
                    "label": 0
                },
                {
                    "sent": "And the solid edges represent shifting from.",
                    "label": 0
                },
                {
                    "sent": "Say the semi cube to the right of this line versus the semi cube to the left of this line.",
                    "label": 0
                },
                {
                    "sent": "And those represent pairs of semi cubes that together the union of them is the whole graph.",
                    "label": 0
                },
                {
                    "sent": "So any lattice embedding represents a collection of paths of semi cubes that have this property.",
                    "label": 0
                },
                {
                    "sent": "They alternate between these dashed and solid edges, and the solid edges represent semi cubes that aren't the compliments of each other, but the union of which is the whole graph.",
                    "label": 0
                },
                {
                    "sent": "And it turns out that.",
                    "label": 0
                },
                {
                    "sent": "If you can only find such a collection of paths.",
                    "label": 0
                },
                {
                    "sent": "That will define a lattice embedding for you.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 1
                },
                {
                    "sent": "Maybe it's.",
                    "label": 0
                },
                {
                    "sent": "The the solid edges, obviously.",
                    "label": 0
                },
                {
                    "sent": "I mean the dashed edges.",
                    "label": 0
                },
                {
                    "sent": "You don't have any choice which I just use their, they're just the semi cubes in their compliments, but the solid edges.",
                    "label": 0
                },
                {
                    "sent": "There could be any set of edges that have this property, but they form a matching.",
                    "label": 0
                },
                {
                    "sent": "Of these semi cubes and we can form a graph that there.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A matching in.",
                    "label": 0
                },
                {
                    "sent": "Where we just simply connect any 2 semi cubes.",
                    "label": 0
                },
                {
                    "sent": "By an edge whenever their union is the whole graph.",
                    "label": 0
                },
                {
                    "sent": "And what we would like to do is to find as few paths as possible and that is done by finding as many matched edges as possible so.",
                    "label": 0
                },
                {
                    "sent": "We can prove a theorem the lattice dimension.",
                    "label": 1
                },
                {
                    "sent": "Is the hypercube dimension the isometric dimension minus the cardinality of a maximum matching in this graph and that leads to a polynomial time algorithm?",
                    "label": 1
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which I would like to use in order to draw these graphs.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So there's.",
                    "label": 0
                },
                {
                    "sent": "There's actually a fairly large research community.",
                    "label": 0
                },
                {
                    "sent": "That studies graph drawing.",
                    "label": 0
                },
                {
                    "sent": "Where's the visualizing graphs?",
                    "label": 0
                },
                {
                    "sent": "It's it's an interesting area because it combines both aesthetic concerns.",
                    "label": 0
                },
                {
                    "sent": "Does this look nice or maybe more importantly, does this drawing convey information to a human viewer that you want to convey?",
                    "label": 0
                },
                {
                    "sent": "But in order to have drawings that look nice and convey information, we need them to satisfy mathematical properties.",
                    "label": 0
                },
                {
                    "sent": "So there's a lot of interesting math that goes on in graph drawing.",
                    "label": 1
                },
                {
                    "sent": "Typical properties that you would like a drawing to have include, you know keeping the edges and vertices separated from each other so that you can see where they go.",
                    "label": 1
                },
                {
                    "sent": "Avoiding crossings crossings confuse people.",
                    "label": 0
                },
                {
                    "sent": "It's hard to look at a drawing with crossings and understand it compared to a drawing that doesn't have crossings or keeping the whole drawing within a small amount of area.",
                    "label": 1
                },
                {
                    "sent": "But there's another property that I think is important to, which is that if we're drawing a special class of graphs, we should draw it in such a way that makes the properties of that class apparent visually.",
                    "label": 0
                },
                {
                    "sent": "Because if you're not doing that, then why not just use a more general purpose graph drawing algorithm?",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for instance.",
                    "label": 0
                },
                {
                    "sent": "We can devise algorithms for drawing partial cubes.",
                    "label": 1
                },
                {
                    "sent": "By first embedding them on a low dimensional lattice, low dimensional because that leads to better drawings and then projecting.",
                    "label": 0
                },
                {
                    "sent": "That lattice onto the plane here is an orthogonal projection of a 6 dimensional hypercube.",
                    "label": 0
                },
                {
                    "sent": "And you can see it actually.",
                    "label": 0
                },
                {
                    "sent": "I mean, there's lots of crossings, obviously, but it's not a planar graph, so you can't avoid that.",
                    "label": 0
                },
                {
                    "sent": "Um but the vertices are reasonably well spaced out from each other and separated from the edges, and you can sort of tell where everything goes, but also.",
                    "label": 0
                },
                {
                    "sent": "Because we're doing an orthogonal projection.",
                    "label": 0
                },
                {
                    "sent": "Every one of these zones.",
                    "label": 0
                },
                {
                    "sent": "Turns into a family of congruent line segments.",
                    "label": 0
                },
                {
                    "sent": "Translates of each other in fact.",
                    "label": 0
                },
                {
                    "sent": "And so that the partial cube structure is actually quite well visible in this kind of drawing, it works well for the hypercube.",
                    "label": 1
                },
                {
                    "sent": "It doesn't work as well for some other kinds of.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Partial cubes I want to show you another kind of projection.",
                    "label": 0
                },
                {
                    "sent": "Here's a projection of a 3 dimensional lattice embedding.",
                    "label": 1
                },
                {
                    "sent": "But IT projects onto a planar graph.",
                    "label": 1
                },
                {
                    "sent": "We've chosen a projection along one of the main diagonals of the integer lattice, and so when you project in that direction, you get something projected onto a hexagonal lattice.",
                    "label": 0
                },
                {
                    "sent": "We can tell from this lattice dimension theorem that I told you about.",
                    "label": 0
                },
                {
                    "sent": "We can tell when a high partial cube has a 3 dimensional lattice embedding.",
                    "label": 0
                },
                {
                    "sent": "It's also easy to tell when a 3 dimensional lattice embedding has a planar projection like this.",
                    "label": 1
                },
                {
                    "sent": "Simply try all of the four main diagonal directions and see whether one of them works.",
                    "label": 0
                },
                {
                    "sent": "What I don't know how to solve is this.",
                    "label": 0
                },
                {
                    "sent": "If I give you a partial cube not yet embedded in any kind of geometric space.",
                    "label": 0
                },
                {
                    "sent": "Is there a 3 dimensional lattice embedding of that partial cube that can be projected flat like this?",
                    "label": 1
                },
                {
                    "sent": "I don't know how to find such an embedding, if it exists, so that's an open press.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, different kind of drawing of partial cubes.",
                    "label": 0
                },
                {
                    "sent": "This works for some partial cubes, not all of them, but when it does, it produces nice drawings.",
                    "label": 0
                },
                {
                    "sent": "You may have noticed it.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This previous drawing.",
                    "label": 0
                },
                {
                    "sent": "All of these faces are nice run by there some.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Trickle.",
                    "label": 0
                },
                {
                    "sent": "Well, we can tip.",
                    "label": 0
                },
                {
                    "sent": "Consider more general drawings in which the faces are not congruent to each other but are symmetrical polygons centrally symmetric specifically?",
                    "label": 0
                },
                {
                    "sent": "It turns out that if you have.",
                    "label": 0
                },
                {
                    "sent": "Any planar drawing of this type?",
                    "label": 0
                },
                {
                    "sent": "You can form a dual collection of curves simply by connecting pairs of opposite midpoints of each of these faces.",
                    "label": 0
                },
                {
                    "sent": "And then extending them out to Infinity.",
                    "label": 0
                },
                {
                    "sent": "And the curves that you get are what are called pseudo lines.",
                    "label": 0
                },
                {
                    "sent": "There are topologically like lines.",
                    "label": 0
                },
                {
                    "sent": "They extend out to Infinity in two directions.",
                    "label": 0
                },
                {
                    "sent": "They partition the plane into two parts.",
                    "label": 0
                },
                {
                    "sent": "They cross each other at most once, like lines do.",
                    "label": 0
                },
                {
                    "sent": "And that's a very important property.",
                    "label": 0
                },
                {
                    "sent": "And in fact, such a collection of curves is called a week pseudoline arrangement.",
                    "label": 0
                },
                {
                    "sent": "The week there refers to the fact that they are allowed to not cross at all.",
                    "label": 0
                },
                {
                    "sent": "But if they do cross, they have to cross at most once.",
                    "label": 1
                },
                {
                    "sent": "And the proof that line arrangements give you partial cubes can be generalized to pseudoline arrangements.",
                    "label": 0
                },
                {
                    "sent": "So any planar graph that has a drawing like this with symmetric faces.",
                    "label": 0
                },
                {
                    "sent": "Must be a partial queue.",
                    "label": 0
                },
                {
                    "sent": "And in the other direction, it's possible algorithmically to determine whether a given partial cube has a drawing of this type.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And produce the drawing efficiently.",
                    "label": 0
                },
                {
                    "sent": "So here are some examples of planar graphs that have centrally symmetric faces.",
                    "label": 1
                },
                {
                    "sent": "This is a little more complicated than one would find in chemistry, but benzenoid systems from chemistry.",
                    "label": 0
                },
                {
                    "sent": "Rhombic tilings of the plane polyominoes.",
                    "label": 0
                },
                {
                    "sent": "And I've included this one just to show you.",
                    "label": 0
                },
                {
                    "sent": "This is a partial cube.",
                    "label": 0
                },
                {
                    "sent": "This is a planar drawing of the partial cube with symmetric faces.",
                    "label": 0
                },
                {
                    "sent": "They're all squares, but this is not an isometric embedding into a lattice because these two vertices.",
                    "label": 0
                },
                {
                    "sent": "Alright, distance one in the lattice, but there are distance three in the partial Q.",
                    "label": 0
                },
                {
                    "sent": "So these these planar symmetric drawings allow you a little more general generality then then lattice embeddings.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One last graph drawing technique.",
                    "label": 0
                },
                {
                    "sent": "Here's a system of curves.",
                    "label": 0
                },
                {
                    "sent": "Each of the curves is a wedge, and they're all translates of each other.",
                    "label": 1
                },
                {
                    "sent": "But they're also pseudolines because they're topologically like lines.",
                    "label": 0
                },
                {
                    "sent": "They partition the plane into two parts.",
                    "label": 0
                },
                {
                    "sent": "And they cross each other at most once.",
                    "label": 0
                },
                {
                    "sent": "Therefore it's a partial cube, but in fact actually one can prove.",
                    "label": 1
                },
                {
                    "sent": "Specifically, what is a partial cube?",
                    "label": 0
                },
                {
                    "sent": "The regions of this?",
                    "label": 0
                },
                {
                    "sent": "With adjacency of regions.",
                    "label": 0
                },
                {
                    "sent": "The dual graph of this arrangement.",
                    "label": 1
                },
                {
                    "sent": "One can prove in fact, that.",
                    "label": 0
                },
                {
                    "sent": "The partial cubes that can be represented as region graphs of arrangements of wedges like this are exactly the ante matroids that have order dimension 2.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And in this case.",
                    "label": 0
                },
                {
                    "sent": "One can get a very nice drawing just by putting a vertex at the upper left corner of each region.",
                    "label": 1
                },
                {
                    "sent": "Each region has one unique maximal point.",
                    "label": 0
                },
                {
                    "sent": "Place a vertex there except for the unbounded region and just place the point above into the.",
                    "label": 0
                },
                {
                    "sent": "Rate of everything else and you get this drawing.",
                    "label": 0
                },
                {
                    "sent": "This drawing of a partial cube.",
                    "label": 0
                },
                {
                    "sent": "Has this nice property that.",
                    "label": 0
                },
                {
                    "sent": "There is 1 lower left Vertex, 1 upper right vertex.",
                    "label": 0
                },
                {
                    "sent": "All of the faces are convex quadrilaterals, and each of those quadrilaterals has a. Vertical left side and a horizontal bottom side, although some of their other sides may not be vertical or horizontal.",
                    "label": 0
                },
                {
                    "sent": "It turns out that drawings of that type can only exist.",
                    "label": 0
                },
                {
                    "sent": "When the input graph is an order to mention to anti matroid.",
                    "label": 0
                },
                {
                    "sent": "So again we have this property that if you see a drawing like this you know exactly what kind of graph it is.",
                    "label": 0
                },
                {
                    "sent": "The graph structure is visible in the drawing.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I wanna move on talk about.",
                    "label": 0
                },
                {
                    "sent": "Different problem related also related to arrangements then that's the problem of cubic partial cubes graph enumeration problem.",
                    "label": 1
                },
                {
                    "sent": "We'd like to characterize or classify or understand.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Partial cubes an A specific family of partial cubes that seems particularly difficult to find examples of are the cubic partial cubes.",
                    "label": 0
                },
                {
                    "sent": "Cubic here, meaning three regular.",
                    "label": 0
                },
                {
                    "sent": "So here are some.",
                    "label": 0
                },
                {
                    "sent": "It's an infinite family, in fact.",
                    "label": 0
                },
                {
                    "sent": "Of prisms over even polygons, so take an even Polygon Cartesian product with an edge.",
                    "label": 1
                },
                {
                    "sent": "Gives you a prism, and that's a cubic partial cube.",
                    "label": 0
                },
                {
                    "sent": "Here's another example that is hard graph.",
                    "label": 0
                },
                {
                    "sent": "The levee graph of the dysard configuration.",
                    "label": 0
                },
                {
                    "sent": "Hum and what was known about this was one infinite family of partial cubes.",
                    "label": 1
                },
                {
                    "sent": "The presence and then a small number of sporadic examples, like this one.",
                    "label": 1
                },
                {
                    "sent": "Actually this is the only known non planar cubic partial cube.",
                    "label": 0
                },
                {
                    "sent": "The rest are all planar.",
                    "label": 0
                },
                {
                    "sent": "I should mention it's.",
                    "label": 0
                },
                {
                    "sent": "An easy exercise.",
                    "label": 0
                },
                {
                    "sent": "And if you're bored with this talk, you might try thinking about it to classify the vertex, transitive, planar, cubic partial cubes.",
                    "label": 0
                },
                {
                    "sent": "These are vertex, transitive, planar, and there's three other sporadic examples.",
                    "label": 0
                },
                {
                    "sent": "This is also vertex transitive but non planar an I don't know whether there are any more transitive non planar cubic partial cubes.",
                    "label": 0
                },
                {
                    "sent": "Or whether there are any other non planar cubic partial cubes at all, but I want what I want.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Show you is a connection between this problem and one of arrangements.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What we have here on this side is an arrangement of lines, and it's what's called a simplicial arrangement.",
                    "label": 0
                },
                {
                    "sent": "That means that all of the faces are triangles.",
                    "label": 0
                },
                {
                    "sent": "When you view them in the projective plane, in this case you also need to include the line at Infinity in the projective plane in order to make this simplicial.",
                    "label": 0
                },
                {
                    "sent": "So we have four triangles in the middle, obviously.",
                    "label": 0
                },
                {
                    "sent": "Above and below and left and to the right of them we have these 3 sided regions.",
                    "label": 0
                },
                {
                    "sent": "Where?",
                    "label": 0
                },
                {
                    "sent": "Two of the sides are parallel and therefore meet at that line at Infinity.",
                    "label": 0
                },
                {
                    "sent": "In the projective plane and form a triangle in the projective plane.",
                    "label": 0
                },
                {
                    "sent": "And then we also have diagonally coming out of this these.",
                    "label": 0
                },
                {
                    "sent": "8 wedges and each of those wedges together with the line at Infinity, forms a triangle.",
                    "label": 0
                },
                {
                    "sent": "So we have an arrangement.",
                    "label": 0
                },
                {
                    "sent": "Every face is a triangle and it's tempting just to take the dual of that arrangement.",
                    "label": 0
                },
                {
                    "sent": "The region graph of that 2 dimensional arrangement and get partial cube from it.",
                    "label": 0
                },
                {
                    "sent": "But if you do, that happens in the Euclidean plane, not in the projective plane, and you get some degree two vertices.",
                    "label": 0
                },
                {
                    "sent": "So to turn it into a cubic partial cube, we have to lift it to a central arrangement in 3D and arrangement of planes through the origin an that maybe seem a little abstract and geometrical, but.",
                    "label": 1
                },
                {
                    "sent": "It's actually probably a familiar concept to all of you.",
                    "label": 0
                },
                {
                    "sent": "If you think of your eye as the origin.",
                    "label": 0
                },
                {
                    "sent": "And you look at that line arrangement over there with your eye at the origin.",
                    "label": 0
                },
                {
                    "sent": "Each of those lines together with your eye determines a plane in 3D through your eye.",
                    "label": 0
                },
                {
                    "sent": "So we have their six lines.",
                    "label": 0
                },
                {
                    "sent": "There's another 7th one, which is the line at Infinity corresponding to the horizon of the plane that you're looking at.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Take that system of seven planes.",
                    "label": 0
                },
                {
                    "sent": "Formed by looking at this line arrangement.",
                    "label": 0
                },
                {
                    "sent": "With your eye at the origin.",
                    "label": 0
                },
                {
                    "sent": "And you get something looking like this.",
                    "label": 0
                },
                {
                    "sent": "Very symmetrical in this case, arrangement of seven planes in 3D such that all of the chambers formed by those planes are triangular cones.",
                    "label": 0
                },
                {
                    "sent": "And if we take the dual region graph of this arrangement.",
                    "label": 0
                },
                {
                    "sent": "We got a cubic partial cube.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now what's known about simplicial arrangements.",
                    "label": 0
                },
                {
                    "sent": "It's in a similar but slightly more advanced state to what's known about cubic partial cubes.",
                    "label": 1
                },
                {
                    "sent": "There's a few infinite families and some sporadic examples.",
                    "label": 0
                },
                {
                    "sent": "I think the best reference is still Green balance book from 1972.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "One example of a simplicial arrangement is an ear pencil.",
                    "label": 0
                },
                {
                    "sent": "That's a pencil of lines set of lines through a single point together with one line not on that point.",
                    "label": 0
                },
                {
                    "sent": "And if you do the construction I just showed you for that arrangement, you just get the prisms again.",
                    "label": 0
                },
                {
                    "sent": "But here's another family of.",
                    "label": 0
                },
                {
                    "sent": "Cube of simplicial arrangements.",
                    "label": 0
                },
                {
                    "sent": "Imagine two mirrors.",
                    "label": 0
                },
                {
                    "sent": "Connected at a hinge.",
                    "label": 0
                },
                {
                    "sent": "And you attach a laser to one of the mirrors perpendicularly to it.",
                    "label": 0
                },
                {
                    "sent": "And shine it off and it bounces.",
                    "label": 0
                },
                {
                    "sent": "And this laser will bounce several times before finally.",
                    "label": 0
                },
                {
                    "sent": "Escaping out to Infinity.",
                    "label": 0
                },
                {
                    "sent": "If you make the angle between these two mirrors.",
                    "label": 0
                },
                {
                    "sent": "BA.",
                    "label": 0
                },
                {
                    "sent": "Integer fraction of π.",
                    "label": 0
                },
                {
                    "sent": "You get a simplicial arrangement like this because.",
                    "label": 0
                },
                {
                    "sent": "The mirrors themselves form lines in the arrangement.",
                    "label": 0
                },
                {
                    "sent": "But then because of the way light bounces.",
                    "label": 0
                },
                {
                    "sent": "The the image of the reflected line through this mirror.",
                    "label": 0
                },
                {
                    "sent": "Looks like the continuation of this line.",
                    "label": 0
                },
                {
                    "sent": "And Anne.",
                    "label": 0
                },
                {
                    "sent": "Then the second image of it reflected again looks like it's continuation further, and so on and.",
                    "label": 0
                },
                {
                    "sent": "What you end up getting is patterns that look like this.",
                    "label": 0
                },
                {
                    "sent": "These are.",
                    "label": 0
                },
                {
                    "sent": "For examples of simplicial arrangements, simply with different angles between the mirrors, the mirrors in these pictures are.",
                    "label": 0
                },
                {
                    "sent": "Any two of the consecutive Rays through the origin.",
                    "label": 0
                },
                {
                    "sent": "An all of the rest of the lines in these arrangements are either the original laser beam or its reflections.",
                    "label": 0
                },
                {
                    "sent": "So we can get infinite families of simplicial arrangements like this.",
                    "label": 1
                },
                {
                    "sent": "And that gives us infinite families of CU.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Cubes that weren't known before.",
                    "label": 0
                },
                {
                    "sent": "There are some additional sporadic examples.",
                    "label": 1
                },
                {
                    "sent": "Several families of.",
                    "label": 0
                },
                {
                    "sent": "Arrangements and I should say that this works also for pseudoline arrangements.",
                    "label": 1
                },
                {
                    "sent": "If you look at this example, they look sort of like lines, but they're bent.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I don't have time to tell you a lot about this, but there's a connection to that symmetric faced planar drawing algorithm that I was telling you about last time.",
                    "label": 1
                },
                {
                    "sent": "If you take a simplicial arrangement.",
                    "label": 1
                },
                {
                    "sent": "Form a dual.",
                    "label": 0
                },
                {
                    "sent": "Region graph of that and find a symmetric drawing of that dual.",
                    "label": 0
                },
                {
                    "sent": "Connect 2 copies of that dual at the degree two vertices.",
                    "label": 0
                },
                {
                    "sent": "It's the same graph that you just got before with this 3D construction, but done a different way that.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's interesting because sometimes we can connect things that aren't the same as each other.",
                    "label": 0
                },
                {
                    "sent": "Take two arrangements that have the same overall polygonal shape, connect them to each other and we sometimes.",
                    "label": 0
                },
                {
                    "sent": "Get a partial cube that doesn't come from a line arrangement.",
                    "label": 0
                },
                {
                    "sent": "And this happens whenever these two symmetric drawings overlay on top of each other to produce another symmetric planar drawing.",
                    "label": 0
                },
                {
                    "sent": "But if they don't overlay to form a planar drawing here, there's some crossings.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Then it may not be a partial cube.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We still don't know whether there are infinitely many cubic partial cubes that don't come from line arrangements in this way, but at least this gives us more examples.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "I only have a few slides left, but I wanted to tell you about some new developments.",
                    "label": 0
                },
                {
                    "sent": "These have all been, you know, applications of geometry, two partial cube theory or partial cube drawing.",
                    "label": 0
                },
                {
                    "sent": "I wanted to tell you about a different situation where partial cubes tell us something new about geometry, so this is.",
                    "label": 1
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "By way of an application.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This this figure shows all of the.",
                    "label": 0
                },
                {
                    "sent": "64 different ways.",
                    "label": 0
                },
                {
                    "sent": "Of triangulate Ng a three by three grid of points.",
                    "label": 0
                },
                {
                    "sent": "Triangulation is just a maximal set of line segments that have the points as endpoints don't contain any other points in their interior and don't cross each other.",
                    "label": 0
                },
                {
                    "sent": "We'd like to understand all of the set of triangulations of a point set.",
                    "label": 0
                },
                {
                    "sent": "For instance, for finite element mesh generation applications, and there's an important operation on triangulations called flipping.",
                    "label": 0
                },
                {
                    "sent": "You can take a triangulation such as this one, pull out an edge, add in another edge, that's a flip.",
                    "label": 0
                },
                {
                    "sent": "And what this diagram shows is the graph of all 64 triangulations of this point set.",
                    "label": 0
                },
                {
                    "sent": "An all of the flips connecting pairs of triangulations.",
                    "label": 0
                },
                {
                    "sent": "Some of those flips I've shown just as edges within each group.",
                    "label": 0
                },
                {
                    "sent": "And then in order to make the diagram comprehensible, I've taken the edges connecting pairs of triangulations that go from one of these groups to another.",
                    "label": 0
                },
                {
                    "sent": "Just connected them between the groups rather than between the individual triangulations, but this is just an undirected graph on 64 vertices.",
                    "label": 0
                },
                {
                    "sent": "Brown in this kind of non standard way.",
                    "label": 0
                },
                {
                    "sent": "There's been an open problem in algorithms since at least the 1980s.",
                    "label": 1
                },
                {
                    "sent": "How can you tell what the minimum number of flips is to get from one triangulation to another?",
                    "label": 1
                },
                {
                    "sent": "That's called the flip distance.",
                    "label": 0
                },
                {
                    "sent": "It's just the distance in this undirected graph.",
                    "label": 0
                },
                {
                    "sent": "But we don't know how to compute flip distances efficiently, because this graph can be very huge compared to the size of of the input.",
                    "label": 0
                },
                {
                    "sent": "The pairs of triangulations that you're trying to compute the distance of.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In order to understand flip distance, we need a geometrical construction called the Delonais triangulation.",
                    "label": 0
                },
                {
                    "sent": "It's a specific triangulation that connects two points.",
                    "label": 0
                },
                {
                    "sent": "Whenever we can find a circle that contains those two points and no others.",
                    "label": 1
                },
                {
                    "sent": "That definition gives you a triangulation.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "If you take any triangulation.",
                    "label": 0
                },
                {
                    "sent": "An find.",
                    "label": 0
                },
                {
                    "sent": "Set a four points in that that are triangulated by something other than the delonais triangulation of those four points, flip them.",
                    "label": 0
                },
                {
                    "sent": "Find some other local configuration that's not delonais.",
                    "label": 0
                },
                {
                    "sent": "Flip that, keep going.",
                    "label": 0
                },
                {
                    "sent": "Eventually you will reach the delonais triangulation and it will happen in at most N squared flips.",
                    "label": 0
                },
                {
                    "sent": "Actually, at most N choose two flips because once you flip an edge away, it never comes back again.",
                    "label": 1
                },
                {
                    "sent": "And that proves that any two triangulations have flipped distance at most N squared because.",
                    "label": 0
                },
                {
                    "sent": "Take one triangulation, flip it to the delonais triangulation, take the other triangulation, flip it to the delonais triangulation, combine those two sequences of flips and you get a path connecting your two original triangulations.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I wanted to find one more graph.",
                    "label": 0
                },
                {
                    "sent": "From a point set.",
                    "label": 0
                },
                {
                    "sent": "And that's called the quadrilateral graph we connect.",
                    "label": 1
                },
                {
                    "sent": "We have a vertex for every edge that could be in a triangulation, an an edge for every empty quadrilateral that is every possible flip that we could make.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And, um.",
                    "label": 0
                },
                {
                    "sent": "I think this is my second to last slide, but.",
                    "label": 0
                },
                {
                    "sent": "Here's a theorem.",
                    "label": 0
                },
                {
                    "sent": "The flip graph is a partial cube.",
                    "label": 1
                },
                {
                    "sent": "If and only if it's bipartite, which happens if and only if the quadrilateral graph is a forest if and only if the quadrilateral graph is bipartite if and only if.",
                    "label": 0
                },
                {
                    "sent": "The point set has no empty Pentagon in it.",
                    "label": 1
                },
                {
                    "sent": "I.",
                    "label": 1
                },
                {
                    "sent": "It involves using using this concept of delonais flipping to show that.",
                    "label": 0
                },
                {
                    "sent": "If there is no empty Pentagon, the flip graph must be a forest, and the quadrilateral graph must be a forest, and the flip graph can be embedded into the product of the trees in that forest.",
                    "label": 1
                },
                {
                    "sent": "I don't have time for the proof, I just want to say that this leads to a quadratic time flip distance algorithm based on that same idea of flipping both of the triangulations towards the Delaunay triangulation and counting the number of edges that occur only in one of those two flip sequences.",
                    "label": 0
                },
                {
                    "sent": "So this is the first progress on this old flip distance algorithm.",
                    "label": 0
                },
                {
                    "sent": "It doesn't compute flip distance for all point sets by any means, but it computes.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Distance for a lot of point sets.",
                    "label": 0
                },
                {
                    "sent": "We know from old results in discrete geometry that points in general position have empty pentagons in them, but there are a lot of point sets that are not in general position and don't have any empty Pentagon.",
                    "label": 1
                },
                {
                    "sent": "For instance in particular and by end grids.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I hope I've convinced you that geometry can be useful in understanding partial cubes, but also partial cubes can be interesting and useful in understanding geometry, and that's it.",
                    "label": 1
                },
                {
                    "sent": "Thank you for this inspiring lecture.",
                    "label": 0
                },
                {
                    "sent": "Now we are kind of behind the schedule so I suggest to address any questions to the speaker later on and we go on with the coffee break.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}