{
    "id": "ggwk3muyy2uycuwv2foy5itse3gettvy",
    "title": "Freightwise Framework and e-Freight",
    "info": {
        "author": [
            "Ronald Jorna, Mobycon"
        ],
        "published": "June 3, 2011",
        "recorded": "May 2011",
        "category": [
            "Top->Business->Transportation and Logistics"
        ]
    },
    "url": "http://videolectures.net/efreight2011_jorna_framework/",
    "segmentation": [
        [
            "OK, thank you very much.",
            "I will make a brief presentation about the Freight Vice framework, but especially about the fella Dacian of the Freight Vice framework.",
            "If I look backwards this afternoon, I think I should have effect spoken before young tour Becausw he effect talked about this right.",
            "This is the follow up of freight wise, but it doesn't really matter.",
            "Sorry, our paper was written by Thomas Endo, Young Turla Homes, Westerheim and myself."
        ],
        [
            "So briefly, I will introduce the freight wise project very shortly.",
            "Then I give her very rough description of the freight price framework, not into details, and then I will mainly focus on the validation of this freight Vice framework."
        ],
        [
            "And some conclusions.",
            "So the aim of the freight price framework was, first of all a common understanding about the freight issues about the roles, functionality, information, work processes.",
            "About contribution to the harmonization across the transport modes to enable interoperability.",
            "And of course, to create or to contribute to the Intermodal framework architecture.",
            "And, as you have heard already, this afternoon freight wise is not yet it is in fact just the process towards Nowe Freight and whatever might follow."
        ],
        [
            "The reference model it's establishing the context in which the intermodal freight transport can be understood.",
            "It gives, in fact, the border picture.",
            "And already mentioned freight ycs their reference model with my this arc trance minus rising.",
            "But also I think smart rate integrity and so on.",
            "They all work on the same base."
        ],
        [
            "Is.",
            "In fact, there are four to five main area cities.",
            "The transport demands the Transport service management, which is affected transport profession the transport network and you can say the transport network infrastructure, but also utilization and regulation enforcement."
        ],
        [
            "This picture you have already seen you see here the four main roles that rent producer.",
            "I think now they have a slightly different name in new freight, but the principle is the same.",
            "The transfer juicer you could say.",
            "This consignor.",
            "Consignee the transport service provider, mainly the transport company.",
            "The traffic manager and transferred regulator, but the transport service provider can effect also acts as a transfer user if user subcontractors.",
            "For example, a company who is doing business.",
            "This, let's say you never so doing the transfer for Yuna Lever might ship contact its own transport to another one, and in that case he becomes the transfer user.",
            "But in fact he uses the same type of messages."
        ],
        [
            "Then if you look at the processes, processes show how invent information is exchanged between the various roles, and then you can see the is already shown the planning, the execution and the completion phase.",
            "And all the exchanges of information.",
            "Uh, defined, or in fact our information packages you could say also messages, but in French fries you call them information packages."
        ],
        [
            "And.",
            "If you look at the total picture you can see on the left hand side the three phases completion execution of planning on the top you can see the transport user, the transport service provider, the regulator and Network Manager.",
            "And then in between you see those functions and then the messages are the information packages like DSD, DNS and so on."
        ],
        [
            "There are functions.",
            "The whole model effect in fact is broken down into functions, and they're on a very high level.",
            "In fact, you could say they are transferred amount transferred service management, infrastructure management and transferred regulation.",
            "And these are of course in the details Mr Broken down, but I don't sell them here.",
            "But you have seen a similar picture of young Torah this, let's say waterfall type of picture, which in fact has the four same main functions."
        ],
        [
            "And then we define it.",
            "I think that one of the most important parts, the information packages.",
            "And where possible or needed, we made the fields mandatori where this was useful or necessary.",
            "Of course, this packages have a certain amount of minimum information that should be included, and it should be complete.",
            "And we don't exactly say how does information is.",
            "Information packages should be used there.",
            "You use them, of course, but you can use them in different ways."
        ],
        [
            "And these are the six main information packages, the transport service description also mentioned value in both of our on the logic project infected discount.",
            "I always see it as a kind of an advertisement of the transport services of a transport company.",
            "Like you are doing a from A to be a rail surface or an invite surface.",
            "Or you could surf this a trick or a number of tricks and whole area in northwest Europe or something like that.",
            "Or it could also be a terminal operation.",
            "The transfer execution plan is mainly A is in fact the kind of transport order transport execution status.",
            "I think speaks for itself.",
            "It shows you the status of the progress of the transport.",
            "Good item itinerary is more like the roots and the specifics of the of the codes that the route I follow.",
            "The traffic and network status relates to the condition of the roads.",
            "Or the network, and it's not necessarily the right.",
            "It could be also in the River Information Services on the waterways or on the rail network and transport operation state this case more the information on the specific vehicles or load units."
        ],
        [
            "And then you get this picture which you have already seen.",
            "I think now for the third time, but it's time in a slightly different context.",
            "But these are the four messages, so the transport user can look at the transport service description of the transport service provider and make a selection.",
            "Then he gets back transport information.",
            "Sorry, the transport Execution Plan, transit execution stages, the GI.",
            "And you see also from the transport Network Manager, the DNS and the toss, which is mainly this state is information on the traffic and vehicles.",
            "So this is mainly had very briefly the fried rice framework.",
            "I do it now in what is it?",
            "Maybe 510 minutes?",
            "I can spend 3 hours or three days to explain it in detail, but I don't think you are waiting for that, but I think it is essential to know this very basic knowledge in order to understand."
        ],
        [
            "Validation.",
            "Potential uses of this framework.",
            "Of course, the transfer juices, the service providers, traffic managers, regulators.",
            "But also the software providers of course, and the authorities.",
            "And these are also the people that we interviewed or where we demonstrated pieces of the update last framework."
        ],
        [
            "And that brings me to the validation of the Freightways framework.",
            "We carried it out in 2009 and a 2009 beginning of 2010.",
            "First of all, of course, through the business cases, but also through interviews with external parties.",
            "So both from inside the Freight plus Consortium and outside the fried Rice consortium.",
            "So the validation consisted of application of pieces of the phrase framework.",
            "Nobody showed, nobody proved.",
            "Let's say the whole framework with some more focused on the transport.",
            "Execution plan or the transport execution status, or there's more focus on the DNS.",
            "And we checked the colored modified days in part the checking of the completeness of the framework.",
            "The coverage of the framework, whether everything is inside.",
            "We carried out the SWOT analysis and the looked at the impact of potential impacts in fact."
        ],
        [
            "SA Framework has been demonstrated, I think in seven or eight, even 9 maybe business cases.",
            "For example, the rail case in the Balkan region, inland waterway, for example in the album broke transport in the Netherlands and Finland, and shorter shipping is pain in Norway.",
            "So as I mentioned already, the main information packages that were not nobody showed the full framework, but pieces were shown in the area are demonstrated in the business cases and the main focus was on the the distribution plan, the execution status and.",
            "Transferred operating status and to a lesser extent, the other street.",
            "And in those demonstrators, also software was of course, developed.",
            "Otherwise you cannot demonstrate it, and these are now, let's say, on the market of course already improved in the in the recent over in the past.",
            "I think 3 or 4, two or three companies at least provided really software."
        ],
        [
            "Then we did the number of interviews with parties inside the construction also outside the construction, and especially for the completeness, you really have to go really into detail into this whole framework.",
            "And in general they were positive, but of course nobody's perfect, and also the freight was framework was not perfect, and.",
            "They found, for example, that the role of the regulator was not yet detailed enough.",
            "Also, the completion phase should be worked out in more detail.",
            "The the coverage of the information flows could be improved, and as you have seen, you made it in the meantime in the East Freight Project.",
            "This has been taken up and will be improved continuously.",
            "Standardization, I think it was mentioned already this morning is very important.",
            "We already started in freight twice to pick up the standardization and less if you've seen now in the DS one this end and so on.",
            "Full efforts are made to continue that process."
        ],
        [
            "Compatibility, of course, is very important.",
            "There were some people who said that not everything was really fitting together completely.",
            "So that needed some improvements and they gave also all kinds of suggestions.",
            "How to improve it and these are taken into account in the fight framework.",
            "And what they found very important, you could say the unique selling points of the freight wise framework, which of course also then the freight framework is the technology independence.",
            "The fact that it has a Comodo focus, which is really unique.",
            "Many of the earlier frameworks were unimodal.",
            "And also that it fits both small companies and the large companies.",
            "And all of it almost unanimously.",
            "People said there is a need for such a framework and for standardization in this field becausw all those so called standards as they are now, are not really standards because there are too many of them.",
            "A warning was made, I would say about the compliance with the legal and security issues and also I think that was an issue discussed this morning.",
            "If those legal and security issues are not really tackled well in our framework, it might be a hindrance to acceptance by the companies by organizations."
        ],
        [
            "Also however good the framework might be, you are still dependent on the acceptance by the companies.",
            "And that has to do with you.",
            "Benefit company for example, and you want to use a framework that's nice, but if nobody else uses it, it is useless.",
            "And that means you need this critical mass of users to get the acceptance of the overall framework.",
            "And there are a lot of external factors which in fact are in favor of such a framework.",
            "For example, the pressure on the road transport network.",
            "This is very much a faithful towards intermodal transport.",
            "The increasing traveling distances for freight everything is mobile at the moment, sourced globally not locally.",
            "So distances are increasing and that means also there is.",
            "Yeah, a more need for intermodal transport.",
            "Intermodal transit is more beneficial at longer distances.",
            "Just in time logistics, but also all kinds of new tracking and tracing technologies.",
            "The new application, the smartphone sensor on it all adds to the need for this kind of standardization.",
            "But I think it was also mentioned by Krista.",
            "We have and also by another speaker.",
            "I can't remember exactly at a certain moment, project stops and how do you guarantee that the syncs with our developed in the project don't Stop.",
            "So we are lucky that at least the fight project was accepted and this is a very natural continuation.",
            "But also after if rate we have to make sure that things are taken care of.",
            "That somebody takes care of continuation of further development.",
            "And so on."
        ],
        [
            "Then if you look at the impacts impacts of a framework, it's very difficult to measure.",
            "So what we did is we split this the freight wise.",
            "Let's say product into three.",
            "We have this conceptual model or framework.",
            "We have the IT projects which are really applications interfaces but also specifications and implementation guide how to use it.",
            "And finally we measured it.",
            "In those days the plug and play transportation management system affected is very close to what was presented by your own about the European Intermodal Route Finder or planning tool, but then including also at the end booking management so we have distinguished these three, let's say endproducts of freight wise."
        ],
        [
            "And then if you look at the conceptual model.",
            "This really helps her to do a common understanding of the data exchange between the actors in the transfer chain and about the things in sensor on and for that reason also it will reduce the risk of developers of IT systems and developers of interfaces that they take the wrong standards or that they make.",
            "I bet the interfaces or I have to redo it again afterwards, so at the end of the deal, help really to use the developer."
        ],
        [
            "Costs.",
            "Then the so called IT projects at the interface of the API's.",
            "I think those are very much in line with the presentation made by Michael this morning about the benefits of the electronic freight management.",
            "Yeah, you also mentioned the time savings, better utilization of equipment.",
            "About the service profession.",
            "Lower friction costs due to very cumbersome integration processes of independent IT systems.",
            "So these are really the benefits of the of the real products."
        ],
        [
            "And finally the so called Plug and Play Transfer J management to allow the intermodal route Finder, but then in a decentralized type of version.",
            "Would allow the transport service providers to market the transport services in a much better way that it can be found easily by the transport users.",
            "And that would is more.",
            "Let's say, make it easier, feasible all those intermodal options that you have.",
            "Instead of that, you have to go to all kinds of separate websites or make to have to make your own combinations."
        ],
        [
            "So my conclusions only Freightways framework.",
            "It actually fairly dated.",
            "At that time.",
            "It was not perfect, I think even now it is not perfect, but the progress is there and we are really going into the right direction.",
            "It's also starting point has been as its starting point for further developments, as many potential benefits both for, let's say, understanding each other and understanding the systems, but also for standardizing the ICT projects and interfaces.",
            "Many factors which can influence the success or the non success often of a framework like this.",
            "An estimated already before and I think it was proved by by the presentation of your door afraid wise was not the end, but it was in fact just the beginning and I think we continue that process for the next few years.",
            "That is what I had in mind."
        ],
        [
            "Any information?",
            "And see right there.",
            "I I'm fully supportive of conceptual intermodal and multimodal framework and I noticed that in your pilots you had four or five of them.",
            "That seemed to be single mode and I'm somewhat concerned as we go into the multimodal environments, that the fundamental terminology in each mode.",
            "Sometimes is totally in conflicts with them.",
            "Other modal representations of those information.",
            "Had an intermodal pilot, did you experience any of the problems of terminology not being totally synchronized?",
            "Harmonized so that everyone understood what it meant to have a delivery date or a delivery time, or a pick up or whatever?",
            "The terminology they use in a particular mode?",
            "It's most distressing because I've noticed that it's a lot of our work.",
            "Yeah, now I think that was a clear difference between the different modes and within this framework we have tried to come to kind of harmonized.",
            "Approach for those for those terms.",
            "Has there been any any discussions of any kind of initiatives to have a date of registration process or harmonization process that synchronizes the terminology in between the different modes?",
            "I know, for example, there is the fundamental Bible in the UN trade data element directory and there is an ongoing maintenance agency that does that, but but that that directory still is?",
            "Unique in that different modes are still using their own terms.",
            "I think you you might pass the maybe the microphone to your neighbor if that is alright, be 'cause I was not personally involved in those developments things, so I was more involved in you validation part, but as far as I know there was a repository of all the terminology and all the data elements.",
            "Order neighbor disable this.",
            "It's on the bottom mode.",
            "OK?",
            "Well we need we have a data Dictionary of all the information on the scene in the models and they were very, very much moved by mobile descriptions of each other.",
            "So no question about that.",
            "Block City picked up since.",
            "I've basically at the top.",
            "He might put a container.",
            "From a customer in the next suburb on rail and move it 1000 kilometres and take it off and put it in physical logical transport.",
            "If that's in the Bible that wants rail.",
            "How people use.",
            "Happens to be the 100 meter Rd end on each side, then called relative or they called intermodal where you are doing genuine long distance connections with two or more modes.",
            "This really needs the whole of the usdata and I won't say the suck to the rail industry of the USUS, but because it happens to be a container that has the potential to go on three or maybe even four modes, it is called intermodal with the almost with the prefix potential future model being put in front of it.",
            "However, if it travels 100 meters by road 4000 kilometers by rail at 100 meters, 5 by Rd is considered intermodal when then watch while.",
            "I think in the general European context, intermodal means unitized loads.",
            "Using more than one operational perspective, that's wrong.",
            "I've had this discussion before, I think 18 years now.",
            "As long as I'm in the in the business.",
            "What is intermodal, what disco mode or what this sensor on an?",
            "The inside of ministers are Rd is bad into models.",
            "Great when they actually mean rail is great but not invited back above sorry.",
            "Like my comment was a lot of people basically push ministers in the same heroes bad Intermodals great on mobile is wonderful, but they actually Meanwhile forward stop.",
            "Not true the model.",
            "Can I get respond to this and say that yes, we do have dictionaries.",
            "However, one thing is to have the information on East information in projects being organized in the relatively cohesive way.",
            "The other is to learn to teach people to use it, and to act to actually get people to use what we know is a decent utilization of terminology.",
            "And that takes a little longer than just doing a project.",
            "Takes 80 years.",
            "Are you that also?",
            "OK, any other questions for Ronald?",
            "Well, thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, thank you very much.",
                    "label": 0
                },
                {
                    "sent": "I will make a brief presentation about the Freight Vice framework, but especially about the fella Dacian of the Freight Vice framework.",
                    "label": 1
                },
                {
                    "sent": "If I look backwards this afternoon, I think I should have effect spoken before young tour Becausw he effect talked about this right.",
                    "label": 0
                },
                {
                    "sent": "This is the follow up of freight wise, but it doesn't really matter.",
                    "label": 0
                },
                {
                    "sent": "Sorry, our paper was written by Thomas Endo, Young Turla Homes, Westerheim and myself.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So briefly, I will introduce the freight wise project very shortly.",
                    "label": 0
                },
                {
                    "sent": "Then I give her very rough description of the freight price framework, not into details, and then I will mainly focus on the validation of this freight Vice framework.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And some conclusions.",
                    "label": 0
                },
                {
                    "sent": "So the aim of the freight price framework was, first of all a common understanding about the freight issues about the roles, functionality, information, work processes.",
                    "label": 1
                },
                {
                    "sent": "About contribution to the harmonization across the transport modes to enable interoperability.",
                    "label": 1
                },
                {
                    "sent": "And of course, to create or to contribute to the Intermodal framework architecture.",
                    "label": 0
                },
                {
                    "sent": "And, as you have heard already, this afternoon freight wise is not yet it is in fact just the process towards Nowe Freight and whatever might follow.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The reference model it's establishing the context in which the intermodal freight transport can be understood.",
                    "label": 1
                },
                {
                    "sent": "It gives, in fact, the border picture.",
                    "label": 0
                },
                {
                    "sent": "And already mentioned freight ycs their reference model with my this arc trance minus rising.",
                    "label": 0
                },
                {
                    "sent": "But also I think smart rate integrity and so on.",
                    "label": 0
                },
                {
                    "sent": "They all work on the same base.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is.",
                    "label": 0
                },
                {
                    "sent": "In fact, there are four to five main area cities.",
                    "label": 0
                },
                {
                    "sent": "The transport demands the Transport service management, which is affected transport profession the transport network and you can say the transport network infrastructure, but also utilization and regulation enforcement.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This picture you have already seen you see here the four main roles that rent producer.",
                    "label": 0
                },
                {
                    "sent": "I think now they have a slightly different name in new freight, but the principle is the same.",
                    "label": 0
                },
                {
                    "sent": "The transfer juicer you could say.",
                    "label": 0
                },
                {
                    "sent": "This consignor.",
                    "label": 0
                },
                {
                    "sent": "Consignee the transport service provider, mainly the transport company.",
                    "label": 1
                },
                {
                    "sent": "The traffic manager and transferred regulator, but the transport service provider can effect also acts as a transfer user if user subcontractors.",
                    "label": 0
                },
                {
                    "sent": "For example, a company who is doing business.",
                    "label": 0
                },
                {
                    "sent": "This, let's say you never so doing the transfer for Yuna Lever might ship contact its own transport to another one, and in that case he becomes the transfer user.",
                    "label": 0
                },
                {
                    "sent": "But in fact he uses the same type of messages.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then if you look at the processes, processes show how invent information is exchanged between the various roles, and then you can see the is already shown the planning, the execution and the completion phase.",
                    "label": 1
                },
                {
                    "sent": "And all the exchanges of information.",
                    "label": 0
                },
                {
                    "sent": "Uh, defined, or in fact our information packages you could say also messages, but in French fries you call them information packages.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "If you look at the total picture you can see on the left hand side the three phases completion execution of planning on the top you can see the transport user, the transport service provider, the regulator and Network Manager.",
                    "label": 0
                },
                {
                    "sent": "And then in between you see those functions and then the messages are the information packages like DSD, DNS and so on.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are functions.",
                    "label": 0
                },
                {
                    "sent": "The whole model effect in fact is broken down into functions, and they're on a very high level.",
                    "label": 1
                },
                {
                    "sent": "In fact, you could say they are transferred amount transferred service management, infrastructure management and transferred regulation.",
                    "label": 1
                },
                {
                    "sent": "And these are of course in the details Mr Broken down, but I don't sell them here.",
                    "label": 0
                },
                {
                    "sent": "But you have seen a similar picture of young Torah this, let's say waterfall type of picture, which in fact has the four same main functions.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then we define it.",
                    "label": 0
                },
                {
                    "sent": "I think that one of the most important parts, the information packages.",
                    "label": 0
                },
                {
                    "sent": "And where possible or needed, we made the fields mandatori where this was useful or necessary.",
                    "label": 0
                },
                {
                    "sent": "Of course, this packages have a certain amount of minimum information that should be included, and it should be complete.",
                    "label": 1
                },
                {
                    "sent": "And we don't exactly say how does information is.",
                    "label": 1
                },
                {
                    "sent": "Information packages should be used there.",
                    "label": 1
                },
                {
                    "sent": "You use them, of course, but you can use them in different ways.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And these are the six main information packages, the transport service description also mentioned value in both of our on the logic project infected discount.",
                    "label": 1
                },
                {
                    "sent": "I always see it as a kind of an advertisement of the transport services of a transport company.",
                    "label": 0
                },
                {
                    "sent": "Like you are doing a from A to be a rail surface or an invite surface.",
                    "label": 0
                },
                {
                    "sent": "Or you could surf this a trick or a number of tricks and whole area in northwest Europe or something like that.",
                    "label": 0
                },
                {
                    "sent": "Or it could also be a terminal operation.",
                    "label": 0
                },
                {
                    "sent": "The transfer execution plan is mainly A is in fact the kind of transport order transport execution status.",
                    "label": 1
                },
                {
                    "sent": "I think speaks for itself.",
                    "label": 0
                },
                {
                    "sent": "It shows you the status of the progress of the transport.",
                    "label": 1
                },
                {
                    "sent": "Good item itinerary is more like the roots and the specifics of the of the codes that the route I follow.",
                    "label": 0
                },
                {
                    "sent": "The traffic and network status relates to the condition of the roads.",
                    "label": 1
                },
                {
                    "sent": "Or the network, and it's not necessarily the right.",
                    "label": 0
                },
                {
                    "sent": "It could be also in the River Information Services on the waterways or on the rail network and transport operation state this case more the information on the specific vehicles or load units.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then you get this picture which you have already seen.",
                    "label": 0
                },
                {
                    "sent": "I think now for the third time, but it's time in a slightly different context.",
                    "label": 0
                },
                {
                    "sent": "But these are the four messages, so the transport user can look at the transport service description of the transport service provider and make a selection.",
                    "label": 1
                },
                {
                    "sent": "Then he gets back transport information.",
                    "label": 1
                },
                {
                    "sent": "Sorry, the transport Execution Plan, transit execution stages, the GI.",
                    "label": 1
                },
                {
                    "sent": "And you see also from the transport Network Manager, the DNS and the toss, which is mainly this state is information on the traffic and vehicles.",
                    "label": 0
                },
                {
                    "sent": "So this is mainly had very briefly the fried rice framework.",
                    "label": 0
                },
                {
                    "sent": "I do it now in what is it?",
                    "label": 0
                },
                {
                    "sent": "Maybe 510 minutes?",
                    "label": 0
                },
                {
                    "sent": "I can spend 3 hours or three days to explain it in detail, but I don't think you are waiting for that, but I think it is essential to know this very basic knowledge in order to understand.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Validation.",
                    "label": 0
                },
                {
                    "sent": "Potential uses of this framework.",
                    "label": 0
                },
                {
                    "sent": "Of course, the transfer juices, the service providers, traffic managers, regulators.",
                    "label": 1
                },
                {
                    "sent": "But also the software providers of course, and the authorities.",
                    "label": 0
                },
                {
                    "sent": "And these are also the people that we interviewed or where we demonstrated pieces of the update last framework.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And that brings me to the validation of the Freightways framework.",
                    "label": 0
                },
                {
                    "sent": "We carried it out in 2009 and a 2009 beginning of 2010.",
                    "label": 0
                },
                {
                    "sent": "First of all, of course, through the business cases, but also through interviews with external parties.",
                    "label": 1
                },
                {
                    "sent": "So both from inside the Freight plus Consortium and outside the fried Rice consortium.",
                    "label": 0
                },
                {
                    "sent": "So the validation consisted of application of pieces of the phrase framework.",
                    "label": 1
                },
                {
                    "sent": "Nobody showed, nobody proved.",
                    "label": 0
                },
                {
                    "sent": "Let's say the whole framework with some more focused on the transport.",
                    "label": 0
                },
                {
                    "sent": "Execution plan or the transport execution status, or there's more focus on the DNS.",
                    "label": 1
                },
                {
                    "sent": "And we checked the colored modified days in part the checking of the completeness of the framework.",
                    "label": 1
                },
                {
                    "sent": "The coverage of the framework, whether everything is inside.",
                    "label": 0
                },
                {
                    "sent": "We carried out the SWOT analysis and the looked at the impact of potential impacts in fact.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "SA Framework has been demonstrated, I think in seven or eight, even 9 maybe business cases.",
                    "label": 1
                },
                {
                    "sent": "For example, the rail case in the Balkan region, inland waterway, for example in the album broke transport in the Netherlands and Finland, and shorter shipping is pain in Norway.",
                    "label": 1
                },
                {
                    "sent": "So as I mentioned already, the main information packages that were not nobody showed the full framework, but pieces were shown in the area are demonstrated in the business cases and the main focus was on the the distribution plan, the execution status and.",
                    "label": 1
                },
                {
                    "sent": "Transferred operating status and to a lesser extent, the other street.",
                    "label": 0
                },
                {
                    "sent": "And in those demonstrators, also software was of course, developed.",
                    "label": 0
                },
                {
                    "sent": "Otherwise you cannot demonstrate it, and these are now, let's say, on the market of course already improved in the in the recent over in the past.",
                    "label": 0
                },
                {
                    "sent": "I think 3 or 4, two or three companies at least provided really software.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then we did the number of interviews with parties inside the construction also outside the construction, and especially for the completeness, you really have to go really into detail into this whole framework.",
                    "label": 0
                },
                {
                    "sent": "And in general they were positive, but of course nobody's perfect, and also the freight was framework was not perfect, and.",
                    "label": 1
                },
                {
                    "sent": "They found, for example, that the role of the regulator was not yet detailed enough.",
                    "label": 1
                },
                {
                    "sent": "Also, the completion phase should be worked out in more detail.",
                    "label": 1
                },
                {
                    "sent": "The the coverage of the information flows could be improved, and as you have seen, you made it in the meantime in the East Freight Project.",
                    "label": 0
                },
                {
                    "sent": "This has been taken up and will be improved continuously.",
                    "label": 0
                },
                {
                    "sent": "Standardization, I think it was mentioned already this morning is very important.",
                    "label": 0
                },
                {
                    "sent": "We already started in freight twice to pick up the standardization and less if you've seen now in the DS one this end and so on.",
                    "label": 0
                },
                {
                    "sent": "Full efforts are made to continue that process.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Compatibility, of course, is very important.",
                    "label": 0
                },
                {
                    "sent": "There were some people who said that not everything was really fitting together completely.",
                    "label": 0
                },
                {
                    "sent": "So that needed some improvements and they gave also all kinds of suggestions.",
                    "label": 0
                },
                {
                    "sent": "How to improve it and these are taken into account in the fight framework.",
                    "label": 0
                },
                {
                    "sent": "And what they found very important, you could say the unique selling points of the freight wise framework, which of course also then the freight framework is the technology independence.",
                    "label": 1
                },
                {
                    "sent": "The fact that it has a Comodo focus, which is really unique.",
                    "label": 1
                },
                {
                    "sent": "Many of the earlier frameworks were unimodal.",
                    "label": 1
                },
                {
                    "sent": "And also that it fits both small companies and the large companies.",
                    "label": 0
                },
                {
                    "sent": "And all of it almost unanimously.",
                    "label": 1
                },
                {
                    "sent": "People said there is a need for such a framework and for standardization in this field becausw all those so called standards as they are now, are not really standards because there are too many of them.",
                    "label": 0
                },
                {
                    "sent": "A warning was made, I would say about the compliance with the legal and security issues and also I think that was an issue discussed this morning.",
                    "label": 0
                },
                {
                    "sent": "If those legal and security issues are not really tackled well in our framework, it might be a hindrance to acceptance by the companies by organizations.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also however good the framework might be, you are still dependent on the acceptance by the companies.",
                    "label": 0
                },
                {
                    "sent": "And that has to do with you.",
                    "label": 0
                },
                {
                    "sent": "Benefit company for example, and you want to use a framework that's nice, but if nobody else uses it, it is useless.",
                    "label": 1
                },
                {
                    "sent": "And that means you need this critical mass of users to get the acceptance of the overall framework.",
                    "label": 1
                },
                {
                    "sent": "And there are a lot of external factors which in fact are in favor of such a framework.",
                    "label": 1
                },
                {
                    "sent": "For example, the pressure on the road transport network.",
                    "label": 0
                },
                {
                    "sent": "This is very much a faithful towards intermodal transport.",
                    "label": 0
                },
                {
                    "sent": "The increasing traveling distances for freight everything is mobile at the moment, sourced globally not locally.",
                    "label": 0
                },
                {
                    "sent": "So distances are increasing and that means also there is.",
                    "label": 0
                },
                {
                    "sent": "Yeah, a more need for intermodal transport.",
                    "label": 0
                },
                {
                    "sent": "Intermodal transit is more beneficial at longer distances.",
                    "label": 1
                },
                {
                    "sent": "Just in time logistics, but also all kinds of new tracking and tracing technologies.",
                    "label": 1
                },
                {
                    "sent": "The new application, the smartphone sensor on it all adds to the need for this kind of standardization.",
                    "label": 0
                },
                {
                    "sent": "But I think it was also mentioned by Krista.",
                    "label": 0
                },
                {
                    "sent": "We have and also by another speaker.",
                    "label": 0
                },
                {
                    "sent": "I can't remember exactly at a certain moment, project stops and how do you guarantee that the syncs with our developed in the project don't Stop.",
                    "label": 1
                },
                {
                    "sent": "So we are lucky that at least the fight project was accepted and this is a very natural continuation.",
                    "label": 0
                },
                {
                    "sent": "But also after if rate we have to make sure that things are taken care of.",
                    "label": 0
                },
                {
                    "sent": "That somebody takes care of continuation of further development.",
                    "label": 0
                },
                {
                    "sent": "And so on.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then if you look at the impacts impacts of a framework, it's very difficult to measure.",
                    "label": 1
                },
                {
                    "sent": "So what we did is we split this the freight wise.",
                    "label": 0
                },
                {
                    "sent": "Let's say product into three.",
                    "label": 1
                },
                {
                    "sent": "We have this conceptual model or framework.",
                    "label": 1
                },
                {
                    "sent": "We have the IT projects which are really applications interfaces but also specifications and implementation guide how to use it.",
                    "label": 0
                },
                {
                    "sent": "And finally we measured it.",
                    "label": 0
                },
                {
                    "sent": "In those days the plug and play transportation management system affected is very close to what was presented by your own about the European Intermodal Route Finder or planning tool, but then including also at the end booking management so we have distinguished these three, let's say endproducts of freight wise.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then if you look at the conceptual model.",
                    "label": 0
                },
                {
                    "sent": "This really helps her to do a common understanding of the data exchange between the actors in the transfer chain and about the things in sensor on and for that reason also it will reduce the risk of developers of IT systems and developers of interfaces that they take the wrong standards or that they make.",
                    "label": 1
                },
                {
                    "sent": "I bet the interfaces or I have to redo it again afterwards, so at the end of the deal, help really to use the developer.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Costs.",
                    "label": 0
                },
                {
                    "sent": "Then the so called IT projects at the interface of the API's.",
                    "label": 0
                },
                {
                    "sent": "I think those are very much in line with the presentation made by Michael this morning about the benefits of the electronic freight management.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you also mentioned the time savings, better utilization of equipment.",
                    "label": 1
                },
                {
                    "sent": "About the service profession.",
                    "label": 0
                },
                {
                    "sent": "Lower friction costs due to very cumbersome integration processes of independent IT systems.",
                    "label": 1
                },
                {
                    "sent": "So these are really the benefits of the of the real products.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And finally the so called Plug and Play Transfer J management to allow the intermodal route Finder, but then in a decentralized type of version.",
                    "label": 0
                },
                {
                    "sent": "Would allow the transport service providers to market the transport services in a much better way that it can be found easily by the transport users.",
                    "label": 1
                },
                {
                    "sent": "And that would is more.",
                    "label": 0
                },
                {
                    "sent": "Let's say, make it easier, feasible all those intermodal options that you have.",
                    "label": 1
                },
                {
                    "sent": "Instead of that, you have to go to all kinds of separate websites or make to have to make your own combinations.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So my conclusions only Freightways framework.",
                    "label": 0
                },
                {
                    "sent": "It actually fairly dated.",
                    "label": 0
                },
                {
                    "sent": "At that time.",
                    "label": 0
                },
                {
                    "sent": "It was not perfect, I think even now it is not perfect, but the progress is there and we are really going into the right direction.",
                    "label": 1
                },
                {
                    "sent": "It's also starting point has been as its starting point for further developments, as many potential benefits both for, let's say, understanding each other and understanding the systems, but also for standardizing the ICT projects and interfaces.",
                    "label": 1
                },
                {
                    "sent": "Many factors which can influence the success or the non success often of a framework like this.",
                    "label": 1
                },
                {
                    "sent": "An estimated already before and I think it was proved by by the presentation of your door afraid wise was not the end, but it was in fact just the beginning and I think we continue that process for the next few years.",
                    "label": 0
                },
                {
                    "sent": "That is what I had in mind.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Any information?",
                    "label": 0
                },
                {
                    "sent": "And see right there.",
                    "label": 0
                },
                {
                    "sent": "I I'm fully supportive of conceptual intermodal and multimodal framework and I noticed that in your pilots you had four or five of them.",
                    "label": 0
                },
                {
                    "sent": "That seemed to be single mode and I'm somewhat concerned as we go into the multimodal environments, that the fundamental terminology in each mode.",
                    "label": 0
                },
                {
                    "sent": "Sometimes is totally in conflicts with them.",
                    "label": 0
                },
                {
                    "sent": "Other modal representations of those information.",
                    "label": 0
                },
                {
                    "sent": "Had an intermodal pilot, did you experience any of the problems of terminology not being totally synchronized?",
                    "label": 0
                },
                {
                    "sent": "Harmonized so that everyone understood what it meant to have a delivery date or a delivery time, or a pick up or whatever?",
                    "label": 0
                },
                {
                    "sent": "The terminology they use in a particular mode?",
                    "label": 0
                },
                {
                    "sent": "It's most distressing because I've noticed that it's a lot of our work.",
                    "label": 0
                },
                {
                    "sent": "Yeah, now I think that was a clear difference between the different modes and within this framework we have tried to come to kind of harmonized.",
                    "label": 0
                },
                {
                    "sent": "Approach for those for those terms.",
                    "label": 0
                },
                {
                    "sent": "Has there been any any discussions of any kind of initiatives to have a date of registration process or harmonization process that synchronizes the terminology in between the different modes?",
                    "label": 0
                },
                {
                    "sent": "I know, for example, there is the fundamental Bible in the UN trade data element directory and there is an ongoing maintenance agency that does that, but but that that directory still is?",
                    "label": 0
                },
                {
                    "sent": "Unique in that different modes are still using their own terms.",
                    "label": 0
                },
                {
                    "sent": "I think you you might pass the maybe the microphone to your neighbor if that is alright, be 'cause I was not personally involved in those developments things, so I was more involved in you validation part, but as far as I know there was a repository of all the terminology and all the data elements.",
                    "label": 0
                },
                {
                    "sent": "Order neighbor disable this.",
                    "label": 0
                },
                {
                    "sent": "It's on the bottom mode.",
                    "label": 0
                },
                {
                    "sent": "OK?",
                    "label": 0
                },
                {
                    "sent": "Well we need we have a data Dictionary of all the information on the scene in the models and they were very, very much moved by mobile descriptions of each other.",
                    "label": 0
                },
                {
                    "sent": "So no question about that.",
                    "label": 0
                },
                {
                    "sent": "Block City picked up since.",
                    "label": 0
                },
                {
                    "sent": "I've basically at the top.",
                    "label": 0
                },
                {
                    "sent": "He might put a container.",
                    "label": 0
                },
                {
                    "sent": "From a customer in the next suburb on rail and move it 1000 kilometres and take it off and put it in physical logical transport.",
                    "label": 0
                },
                {
                    "sent": "If that's in the Bible that wants rail.",
                    "label": 0
                },
                {
                    "sent": "How people use.",
                    "label": 0
                },
                {
                    "sent": "Happens to be the 100 meter Rd end on each side, then called relative or they called intermodal where you are doing genuine long distance connections with two or more modes.",
                    "label": 0
                },
                {
                    "sent": "This really needs the whole of the usdata and I won't say the suck to the rail industry of the USUS, but because it happens to be a container that has the potential to go on three or maybe even four modes, it is called intermodal with the almost with the prefix potential future model being put in front of it.",
                    "label": 0
                },
                {
                    "sent": "However, if it travels 100 meters by road 4000 kilometers by rail at 100 meters, 5 by Rd is considered intermodal when then watch while.",
                    "label": 0
                },
                {
                    "sent": "I think in the general European context, intermodal means unitized loads.",
                    "label": 0
                },
                {
                    "sent": "Using more than one operational perspective, that's wrong.",
                    "label": 0
                },
                {
                    "sent": "I've had this discussion before, I think 18 years now.",
                    "label": 0
                },
                {
                    "sent": "As long as I'm in the in the business.",
                    "label": 0
                },
                {
                    "sent": "What is intermodal, what disco mode or what this sensor on an?",
                    "label": 0
                },
                {
                    "sent": "The inside of ministers are Rd is bad into models.",
                    "label": 0
                },
                {
                    "sent": "Great when they actually mean rail is great but not invited back above sorry.",
                    "label": 0
                },
                {
                    "sent": "Like my comment was a lot of people basically push ministers in the same heroes bad Intermodals great on mobile is wonderful, but they actually Meanwhile forward stop.",
                    "label": 0
                },
                {
                    "sent": "Not true the model.",
                    "label": 0
                },
                {
                    "sent": "Can I get respond to this and say that yes, we do have dictionaries.",
                    "label": 0
                },
                {
                    "sent": "However, one thing is to have the information on East information in projects being organized in the relatively cohesive way.",
                    "label": 0
                },
                {
                    "sent": "The other is to learn to teach people to use it, and to act to actually get people to use what we know is a decent utilization of terminology.",
                    "label": 0
                },
                {
                    "sent": "And that takes a little longer than just doing a project.",
                    "label": 0
                },
                {
                    "sent": "Takes 80 years.",
                    "label": 0
                },
                {
                    "sent": "Are you that also?",
                    "label": 0
                },
                {
                    "sent": "OK, any other questions for Ronald?",
                    "label": 0
                },
                {
                    "sent": "Well, thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}