{
    "id": "gpmi5y3gdmnfnypgae2jxin7yejvl3ex",
    "title": "Popularising the science and researchers of PASCAL",
    "info": {
        "author": [
            "Peter Bentley, Department of Computer Science, University College London"
        ],
        "published": "Feb. 15, 2008",
        "recorded": "January 2008",
        "category": [
            "Top->Science"
        ]
    },
    "url": "http://videolectures.net/psm08_bentley_psr/",
    "segmentation": [
        [
            "OK, I can't guarantee you're going to like the talk, 'cause I'm probably going to insult you, but that's sort of traditional for me.",
            "I I think the nerd factor in this field is high.",
            "I can say that 'cause I'm not.",
            "You see, that's needle going high I if I say that 'cause I'm not directly enough in your field, I'm I'm a computer scientist, but I sort of mainly working by inspired computation an my other career is Popular Science.",
            "So I'm a Popular Science author.",
            "And I say you're a bunch of nerds.",
            "Or in the language you may understand if you measure it in terms of a function of the number of people still attending towards the end of a symposium.",
            "And the function of the number of laptops open.",
            "And perhaps the reception.",
            "So what I'm going to say, I'd say the needles in the red for nerds.",
            "So I'm here to address what I think we had no say earlier.",
            "The need that's been identified to try and promote some of your research to the general public.",
            "I do this for a living.",
            "I actually kind of do research funded by my Popular Science writing, so theoretically I know a little bit about this.",
            "You're welcome to contradict me."
        ],
        [
            "So why do I do it?",
            "Well, hopefully none of you disagree with the things on this slide here.",
            "As far as I'm concerned.",
            "Communication is essential and I don't just mean communication to your peers.",
            "I mean communication to a broad audience.",
            "If you can't communicate effectively.",
            "Why are you doing the research?",
            "We can all lock ourselves up in our bedrooms or our little offices, or in Johns case are big officers and do some.",
            "In a spectacular research, but if no one ever hears about it, well.",
            "You know what's the point?",
            "Anne.",
            "But there's a problem, of course.",
            "How do you actually get your message out there?",
            "We're well aware of how the media works.",
            "The media is the mechanism for getting information out really to the eyes and ears of everybody.",
            "Unless you want to use the Internet, which I think now is idea was excellent.",
            "Um?",
            "But generally, conventional documentaries, news channels, books.",
            "There are barriers there, and as I say there, the barriers are kind of imposed by the commercial nature of this media.",
            "Today it's 24 hour news and.",
            "That means unfortunately, they like things fast.",
            "I guess I can give you an anecdote about this.",
            "I was once in a conference dedicated to introducing scientists to the media and we had a bunch of scientists and we had some newspaper editors from some of the UK's best newspapers and one of the editors was talking to us and saying, well, there's a common question that's asked in journalism.",
            "Do you want it right or do you want it now?",
            "And the answer in journalism?",
            "We want it now.",
            "And all the scientists in the audience.",
            "There was a gasp.",
            "'cause of course this is not how we work.",
            "We're trained to do it right.",
            "Even if it takes longer, we're trying to get it right.",
            "We're trained to disseminate in such a way that the message is right.",
            "We will use the deadlines, yes, but fundamentally.",
            "As long as we're doing our jobs properly with, we should miss the deadline in order to make sure the science is correct.",
            "Perhaps not everybody does that, but let's let's pretend that they do.",
            "How many people have submitted this paper within 5 minutes of the next deadline?",
            "I think perhaps that's that's the difference between leaving things to the last minute and.",
            "In accuracies.",
            "So anyway, what I'm trying to say is there's there are barriers here.",
            "Journalists as part of their jobs, have to meet their deadlines.",
            "It's not in their job description to make things true, they just have to get things in on time.",
            "Anne, this is this is a problem for us and This is why when journalists talk to us they find us very annoying because we often use long, complicated sentences because they're the right sentence is to use and they want the quick sentence is they can broadcast and let everybody understand.",
            "So how do we get past this?"
        ],
        [
            "Well.",
            "Before I tell you how.",
            "If you do get past this.",
            "There are actually some rewards here.",
            "It's actually very clear that if you can popularize your research, if you can capture the imagination of the general public.",
            "You do get real rewards and I speak from experience 'cause I'm a researcher.",
            "I sit on both sides of this fence.",
            "I'm a researcher who's had his work popularized and I popularize other peoples research.",
            "So for example, you really can see growth in a particular field of research if it's promoted well.",
            "And for the general public.",
            "You really can attract new researchers to it, and if your particular group or your particular topic is mentioned, you'll get lots of people interested in joining you.",
            "It really happens.",
            "And we all like to hear about funding.",
            "Well, it's perhaps a sad fact, but our funders pay just as much attention to what's in the news and in the newspapers as they do to what we write.",
            "So if it is publicized properly, you do get more cash too."
        ],
        [
            "So how can you do it?",
            "Well, there are lots of ways you can do it.",
            "One is to expand traditional outputs which we have been hearing about.",
            "So for example, you can.",
            "Invite delegates from alternate fields to the normal ones to work show and Pascal has been doing this a little bit.",
            "Well, you can produce nicer webpages with better interfaces, which I've got to say Pascal needs to do and hopefully it will do before long.",
            "Or indeed we can have more exciting things I think.",
            "An obvious thing is to link up with some of the popular social networking websites such as Facebook and you guys should be writing plugins for Facebook and then you'll become a hit overnight.",
            "But of course, there's the downside of the traditional methods science writers operate in particular ways.",
            "Science journalists rarely have time to attend scientific events.",
            "Even the best science journalists from New Scientist, for example, they may turn up for one day in the large conference if you're lucky.",
            "But they haven't got a lot of time.",
            "They don't have time to read a broad range of different publications, and even if they did, it's normally one science journalist for a whole huge area.",
            "So you might have a technology journalist, not a computer science one.",
            "Certainly not a machine learning 1A technology one.",
            "This means that even if they do read your paper, they may not really understand it."
        ],
        [
            "But what are they looking for?",
            "OK, well, the way they work is, they're looking for something that seems like news.",
            "In science, there's often a kind of delay.",
            "We may have an amazing breakthrough in our labs, but we can hardly tell a journalist.",
            "Hey, yesterday I did something that no one's ever done before, so quite rightly the journalists wait until it's published.",
            "So for them it becomes news when the papers become accepted, or if there's an embargo on news stories as there is in nature and science.",
            "Wait until it actually appears and it's being presented in a conference or it appears in a Journal, so that's when it becomes official news, so they do have some sense.",
            "These journalists they recognize it's a breakthrough.",
            "If it has been peer reviewed, OK?",
            "So.",
            "What else they interested in?",
            "Well, I guess this is something that you guys might have a slight problem with.",
            "It's not just when it happens, it's what it's about.",
            "And what it's about has to relate to ordinary people.",
            "Now it's very easy to put this big divide up, there's us.",
            "And then there's everybody else.",
            "And we're not normal at all.",
            "But let's face it, we are normal.",
            "We go to the shops like everybody else.",
            "We buy food, we drive cars, we do stuff that everybody else does.",
            "We just happen to know about a lot about one particular thing.",
            "It's not really that difficult to figure out what relates to ordinary people, OK?",
            "If you find it particularly difficult, just think.",
            "Imagine telling your mother or your neighbor or somebody in your your non work life about what you do.",
            "If you think they'll find it interesting, well, you'll probably find lots of other people find it interesting to, and so that's the kind of thing at science journalist is looking for, something that's just happened just come out an is.",
            "Other people can relate to.",
            "So the work I'm here to talk about is as a quick bit of work that exploits the services of an experienced science communicator.",
            "That's me.",
            "In order to improve the visibility of Pascal.",
            "Research and researchers, and that is you guys.",
            "What?"
        ],
        [
            "Oh, I know about it.",
            "Well, as I said before, I have had stuff written about me.",
            "This is me on the front cover of magazine and they wrote about me.",
            "My student annoying, right?",
            "It was rather annoying.",
            "He had to look over my shoulder for that one."
        ],
        [
            "You scientist does indeed write about my stuff."
        ],
        [
            "And I write a few books.",
            "Those are some of my books."
        ],
        [
            "I also appear in.",
            "General Festival's, and this was something I did last summer.",
            "This is me sharing a public debate with Lewis Wolpert, Steve Jones, and Richard Dawkins.",
            "This was in the we hired at the Great Wall of the Natural History Museum and our audience of 600 was sitting around the big Dinosaur."
        ],
        [
            "I also write for new scientists now and again, and for some of the science columns."
        ],
        [
            "OK, so I'm also writing for you guys.",
            "I'm trying to pick out some of the work that I think is relevant to the general public.",
            "I'm trying to write this in a way that when they appear on the Pascal webpages, if anyone in general is interested, or indeed if a science journalist is interested, they can go straight to it.",
            "They can understand what you've done instantly.",
            "They'll be links to the detailed stuff, links to you guys that they can actually get the quotes from themselves, so I'm providing this interface.",
            "Between your work and the outside world, as best as I can, is different.",
            "It's difficult to talk about articles you've written, because really, you kind of need to read them.",
            "I can't kind of just read it out for you.",
            "Might be a little bit boring, so all I can do really say, well, this is what one of them looks like and it's about relevance of text from my movements.",
            "Involving some of these people who I'm sure you know.",
            "And yes, I am able to write about some more complicated things like neural networks, SVM's, and of course we've got a PIN view project that's come through."
        ],
        [
            "This is another one.",
            "Notice how the titles are not really the same as a as a Journal paper title.",
            "This one is called the mind reading Wizards with an interesting image just to capture the imagination.",
            "Why did I call it that?",
            "Well, 'cause it's about a program called Hexose Spell.",
            "An obvious easy way of.",
            "Capturing someones interest through a title and this is about analysis of ECG signals combined with a hex shaped interface.",
            "Hence the name, the software hexose spell, and yes, it's kind of like reading minds.",
            "It's using EEG signals to figure out.",
            "Exactly where you're looking so that you can kind of type.",
            "And this this one involves those people, and indeed I'm talking about those particular techniques, common spatial patterns, linear, discriminate, and now."
        ],
        [
            "This here's another one called the desktop Doctor.",
            "It's not that difficult to figure out why I picked it.",
            "Obviously it's relevant to people.",
            "It's about medicine, it's about.",
            "Promed US, which is a probabilistic medical diagnostic advisory system.",
            "To do with those people.",
            "And yes, I was able to talk about Bayesian inference rules for all those Bayesian nests out there.",
            "And."
        ],
        [
            "This is the one I'm currently working on, which I'm calling provisional title letting stones go unturned.",
            "This is about Mogo.",
            "This is the Monte Carlo go playing program which has been very successful involving all of those people and it uses upper confidence St.",
            "So it really is possible to talk about some of the detailed techniques you're using.",
            "It's really possible to talk about you guys, and it's really possible to make it interesting for the general public.",
            "It's not that difficult."
        ],
        [
            "Now I won't always be here to help you.",
            "We may carry on with this in Pascal too, but there's a limit to the number of articles I can do.",
            "So what can you do?",
            "Well, some advice that I try and follow myself.",
            "Try and make yourself available and be friendly to journalists.",
            "They do have tight deadlines.",
            "The chances are if they've called you on the telephone, they're probably working to a deadline that afternoon and they really need to talk to you.",
            "They may send you an email if they've got a bit more time, but if they're calling you and and you say, well, I'm sorry, you know I'm with this student.",
            "Call me next week.",
            "They'll probably never talk to you again.",
            "If you try and make yourself available in your friendly to them, then they'll come back to you.",
            "From experience this this is what happens to me now.",
            "They call me up if they want me to give them a quote about someone else is work, and indeed every six months and you scientist journalist, just calls me up to ask me what's going on.",
            "Do I know of anything interesting happening?",
            "Also provide general information on websites these journalists don't have time, you've gotta.",
            "They're not crazy.",
            "They're not stupid people.",
            "They're just busy people.",
            "So try and provide general information on websites.",
            "Try and provide your biography in an easy to read format.",
            "They don't need to know how many students you supervised to completion or how many papers you published.",
            "They need in a slightly more general things.",
            "So have a kind of general biography available.",
            "Have summaries of your research and easy to understand language.",
            "OK, if you have done some important new research that people may be interested in, provide pointers to it.",
            "Make sure it's there online.",
            "A really important one is is simple learning how to communicate.",
            "It's it's amazing how many scientists simply can't talk without using all of the terminology that they write in their papers.",
            "It's very easy to hide behind terminology and you'll find if you can speak without that terminology.",
            "You'll find all of your ideas become much clearer in your own mind.",
            "It's a very useful skill to have, and I'm sure we've all written or we've all hopefully handle written.",
            "But we've all read papers where it does seem as though people are just.",
            "Hiding behind the terminology and trying to make themselves look clever just because of all the clever words they know there's there's a big difference between really understanding a concept and.",
            "Speaking clearly about it.",
            "And also think about your work.",
            "Is it newsworthy?",
            "If you have just published a new discovery and you think it does relate somehow to ordinary people and you are ordinary people, don't forget.",
            "Then think about it as a potential news event.",
            "All of your universities will have press offices.",
            "They will all be able to help you.",
            "Do press releases.",
            "They all have Contacts with the media they can push out these press releases to the right places and that can generate.",
            "A huge amount of interest.",
            "So."
        ],
        [
            "To end with.",
            "Really, I'm I'm doing is as best as I can with these articles.",
            "Hopefully you'll enjoy them when you read them.",
            "Hopefully the general public will enjoy them when they read them with pushing them out to general magazines as well, but you really will benefit if you think about doing this for yourself.",
            "Think about how to do it.",
            "Think about communicating with the general audience.",
            "It will benefit you.",
            "It's always nice to have friendly groups appears.",
            "We're all used to going and meeting the same twenty 5000.",
            "Appears in our conferences, but there's a whole world out there.",
            "There are millions of people who are potentially interested in what you do.",
            "Thank you."
        ],
        [
            "His audience.",
            "Back to what we have usually do, cyantific more serious, but what kind of feedback do you get from your audience?",
            "So what's?",
            "I'm sure you must have some kind of communication then.",
            "Which audience you talk about.",
            "I have many audiences.",
            "What?",
            "What would be the feedback, please?",
            "Popular Science.",
            "That that entirely depends on the readership.",
            "So so for new scientists, for example, you'll get letters from enthusiastic amateurs who may be in any kind of job saying, I always thought that was possible, but you've proven me right?",
            "Or that's the coolest thing I've ever heard or you might get one that saying why you wasting your time?",
            "That's entirely pointless.",
            "Or you've got that wrong.",
            "And then you may get letters or communications from people saying I work in this particular field, and I. I never knew this was possible.",
            "Can we collaborate so all different areas you can get this and indeed from my Popular Science books and a surprising number of scientists in completely different fields.",
            "Pick up these books.",
            "And under absolutely fine and wonderful and and start collaborations because of them that it's a way of getting not just the normal sort of general public, but to other scientists in other fields.",
            "I'll kiss him.",
            "When they.",
            "Published by someone.",
            "And are you following that?",
            "I.",
            "As much as as you can with any of these things, yeah.",
            "It's it's a I've gotta say, it's easier with books with books, you know exactly how many are sold and you say you know exactly the extent of your readership.",
            "With these kind of magazines.",
            "People just kind of read them and and you can't guarantee they will read every article in a in a magazine.",
            "Hopefully though, yes.",
            "Just publish their magazine that we had about that published one of those three.",
            "Not not your general.",
            "The Pascal.",
            "We're still we're still waiting to play some of them, so I'm hoping to place at least one in something like New Scientist.",
            "But New Scientist is very picky and.",
            "In the mall until you finish a collection and then I've had one in a in a kind of London based magazine which is actually asking for more, but I'm not sure it's wise to stick them all in the same thing.",
            "But as I say, something like New Scientist is the best because it's used as source material for the world, and indeed the world's immediate.",
            "Magazine publishes an article.",
            "It decreases the chances that this article goes.",
            "Well, no, they they usually uses source material.",
            "So for example, a New Scientist article will then be picked up by papers and then will be picked up by other other magazines and it can.",
            "Just it just keeps going so they they typically there are different.",
            "There are different.",
            "Quality of of journalist.",
            "So the specialist science journalists that that work for the specialist magazines like New Scientist and they are often the ones that do the work and get the stories together and then the non specialist journalists who use those.",
            "GNU Scientist style articles for their own material.",
            "So they're essentially consulting water.",
            "A journalist thinks together get their stuff which which they find easier because they are not scientists at all, and then their material goes on and goes on.",
            "It's because of the barriers of communication they do that they simply don't know how to talk to us.",
            "They don't know how to get to our material in a way that is understandable, so they use their own stories as source material.",
            "So we all have departments or universities that have their own web pages with their own publicity Department.",
            "So when people are patient apartments.",
            "What's your feeling on the kind of ratio effort that's required for individuals as opposed to effort required by the publicity Department?",
            "Anne.",
            "Bring our stories to the Department that deals with that.",
            "Well no, no.",
            "I mean I mean.",
            "It it depends on University and often that the press office of the University may want to help you write the press release.",
            "They may even want to feel the phone calls, so they may want to be the one that's the first contact.",
            "That's not always a great thing.",
            "It's often better if the calls come to you direct because the press Department often get a lot of things wrong and then it gets a bit messy.",
            "It's nicer if you can talk with the people yourself.",
            "If you've got the time.",
            "The other side of it is in newspaper land.",
            "They get hundreds of press releases every day, so it's important that you've actually got a good press officer who knows not just the right Department, but the right person to push this press release 2 'cause if they can push it to the right person who they know will be able to write something about it that'll bypass all of these stuff that goes straight in the garbage.",
            "This is why writing a press release is also very important if you just write a very technical looking thing, it'll go straight in the garbage.",
            "It's gotta really captured the imagination.",
            "Resources I don't know Science Journal or something monitor large universities press release websites for information they get sent to them.",
            "Yeah, yeah.",
            "1 + 1.",
            "Decide when you want to talk to the person that you're saying you think you're flying.",
            "Sometimes, given it quick heads himself.",
            "If you're probably Monday, but then the yeah, yeah and then.",
            "What's the right time touch?",
            "The person is interesting?",
            "20 or 30 other journalists?",
            "Well, the problem is it's very hard to artificially set the time.",
            "You can now and again you can get away with saying, well, I did the work a year ago, but I'm going to the press release now, but generally they prefer it to be news.",
            "They prefer it to be.",
            "He's published it today or it's coming out tomorrow.",
            "This is news and and they really treat it like news you know, for for a period of maybe 2430, six, 48 hours.",
            "If it goes well, you can be on the 24 hour news channels.",
            "You know this can sweep around the world.",
            "In that period.",
            "Two days later, they've forgotten about it again, so it's a very narrow window, something.",
            "Really ready for the science is even really done.",
            "Much more complete story.",
            "We shot that and again, this is if you think it's good to sort of make the press release and site you know this paper is coming out at a time when you do have the backup.",
            "So maybe this won't be the first paper you've done on the area.",
            "Maybe this will be the 2nd or the 3rd and you've got enough material to really show that it's something.",
            "Website.",
            "Public relations online.",
            "So definitely all of these things.",
            "Michelle will.",
            "I had just a comment you were you were saying you should be clear, OK and and of course this is common sense knowledge, but are you?",
            "Are you saying that we we do it on purpose?",
            "I mean to be unclear.",
            "I mean, if it's if it's it's it's as easy as saying.",
            "Just be clear this.",
            "I mean we would do this.",
            "So I had a constructive suggestion which might be also perhaps we might use.",
            "Bit of training into simplicity.",
            "And perhaps we might have some kind of I don't know.",
            "Corruption through choosing, of course.",
            "There's there's certainly there's no reason why you shouldn't have some kind of tool that measures the the clarity in the, perhaps in terms of the use of terminology and things like that.",
            "It's quite easy to.",
            "Amazon released books at least also that forgiveness proficient.",
            "How many pennies per page?",
            "How many pages?",
            "The world?",
            "And I think that's a coefficient.",
            "Well, I've got I've gotta say, part of it is practice.",
            "And of course part of it is learning how to do it.",
            "You know there's a culture of.",
            "Being precise, yes, but using.",
            "Using perhaps over precise language and getting a little bit too obsessive about the terminology when.",
            "Yes, you can use the terminology, but you don't always need to.",
            "You know there's often simpler words and simpler ways of explaining things, and there's nothing wrong with a nice analogy and a metaphor, and just these sorts of methods just require a little bit of practice, and they make the world of difference.",
            "Maybe after they move out next week, could you?",
            "OK, so you talking very much about conventional press press release things like that.",
            "What about logs?",
            "What about demos that people think are really cool?",
            "All these kinds of things as yes, as I say at the moment that there are kind of developing 2 forms of media, there's the traditional stuff which we have to deal with because it's it's the establishment and that that is the media.",
            "That's the newspapers and magazines and stuff.",
            "But yeah, the new media is the Internet.",
            "And as I say, I, I think if you want to reach.",
            "The young audience do plug into Facebook.",
            "Do things like that.",
            "You know these these programs are being used, but every day sometimes every hour by these people.",
            "If you've got little tools or you just press releases.",
            "Results in the hope that they will be picked up by Commission immediately.",
            "There's not a lot that I mean.",
            "Yes, there's a lot of conventional media is using online resource and of course things like Wired is great for that sort of thing, but.",
            "But blogs haven't quite reached that maturity yet, and they're not.",
            "They're not currently, maybe in another two or three years, five or six years, they will become more mainstream, but but right now there are millions of blogs out there, and.",
            "Who's to say which is good and who's to say a popular one is good?",
            "Or a you know it's it's still under development I guess.",
            "I guess my my feeling is you something that already is successful.",
            "This is why you know.",
            "Facebook, YouTube, that kind of thing.",
            "It's it's successful now."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I can't guarantee you're going to like the talk, 'cause I'm probably going to insult you, but that's sort of traditional for me.",
                    "label": 0
                },
                {
                    "sent": "I I think the nerd factor in this field is high.",
                    "label": 0
                },
                {
                    "sent": "I can say that 'cause I'm not.",
                    "label": 0
                },
                {
                    "sent": "You see, that's needle going high I if I say that 'cause I'm not directly enough in your field, I'm I'm a computer scientist, but I sort of mainly working by inspired computation an my other career is Popular Science.",
                    "label": 0
                },
                {
                    "sent": "So I'm a Popular Science author.",
                    "label": 0
                },
                {
                    "sent": "And I say you're a bunch of nerds.",
                    "label": 0
                },
                {
                    "sent": "Or in the language you may understand if you measure it in terms of a function of the number of people still attending towards the end of a symposium.",
                    "label": 0
                },
                {
                    "sent": "And the function of the number of laptops open.",
                    "label": 0
                },
                {
                    "sent": "And perhaps the reception.",
                    "label": 0
                },
                {
                    "sent": "So what I'm going to say, I'd say the needles in the red for nerds.",
                    "label": 0
                },
                {
                    "sent": "So I'm here to address what I think we had no say earlier.",
                    "label": 0
                },
                {
                    "sent": "The need that's been identified to try and promote some of your research to the general public.",
                    "label": 0
                },
                {
                    "sent": "I do this for a living.",
                    "label": 0
                },
                {
                    "sent": "I actually kind of do research funded by my Popular Science writing, so theoretically I know a little bit about this.",
                    "label": 0
                },
                {
                    "sent": "You're welcome to contradict me.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So why do I do it?",
                    "label": 0
                },
                {
                    "sent": "Well, hopefully none of you disagree with the things on this slide here.",
                    "label": 0
                },
                {
                    "sent": "As far as I'm concerned.",
                    "label": 0
                },
                {
                    "sent": "Communication is essential and I don't just mean communication to your peers.",
                    "label": 1
                },
                {
                    "sent": "I mean communication to a broad audience.",
                    "label": 0
                },
                {
                    "sent": "If you can't communicate effectively.",
                    "label": 0
                },
                {
                    "sent": "Why are you doing the research?",
                    "label": 0
                },
                {
                    "sent": "We can all lock ourselves up in our bedrooms or our little offices, or in Johns case are big officers and do some.",
                    "label": 0
                },
                {
                    "sent": "In a spectacular research, but if no one ever hears about it, well.",
                    "label": 0
                },
                {
                    "sent": "You know what's the point?",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "But there's a problem, of course.",
                    "label": 0
                },
                {
                    "sent": "How do you actually get your message out there?",
                    "label": 0
                },
                {
                    "sent": "We're well aware of how the media works.",
                    "label": 0
                },
                {
                    "sent": "The media is the mechanism for getting information out really to the eyes and ears of everybody.",
                    "label": 0
                },
                {
                    "sent": "Unless you want to use the Internet, which I think now is idea was excellent.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "But generally, conventional documentaries, news channels, books.",
                    "label": 0
                },
                {
                    "sent": "There are barriers there, and as I say there, the barriers are kind of imposed by the commercial nature of this media.",
                    "label": 0
                },
                {
                    "sent": "Today it's 24 hour news and.",
                    "label": 0
                },
                {
                    "sent": "That means unfortunately, they like things fast.",
                    "label": 0
                },
                {
                    "sent": "I guess I can give you an anecdote about this.",
                    "label": 0
                },
                {
                    "sent": "I was once in a conference dedicated to introducing scientists to the media and we had a bunch of scientists and we had some newspaper editors from some of the UK's best newspapers and one of the editors was talking to us and saying, well, there's a common question that's asked in journalism.",
                    "label": 1
                },
                {
                    "sent": "Do you want it right or do you want it now?",
                    "label": 0
                },
                {
                    "sent": "And the answer in journalism?",
                    "label": 0
                },
                {
                    "sent": "We want it now.",
                    "label": 0
                },
                {
                    "sent": "And all the scientists in the audience.",
                    "label": 0
                },
                {
                    "sent": "There was a gasp.",
                    "label": 0
                },
                {
                    "sent": "'cause of course this is not how we work.",
                    "label": 0
                },
                {
                    "sent": "We're trained to do it right.",
                    "label": 0
                },
                {
                    "sent": "Even if it takes longer, we're trying to get it right.",
                    "label": 0
                },
                {
                    "sent": "We're trained to disseminate in such a way that the message is right.",
                    "label": 0
                },
                {
                    "sent": "We will use the deadlines, yes, but fundamentally.",
                    "label": 0
                },
                {
                    "sent": "As long as we're doing our jobs properly with, we should miss the deadline in order to make sure the science is correct.",
                    "label": 0
                },
                {
                    "sent": "Perhaps not everybody does that, but let's let's pretend that they do.",
                    "label": 0
                },
                {
                    "sent": "How many people have submitted this paper within 5 minutes of the next deadline?",
                    "label": 0
                },
                {
                    "sent": "I think perhaps that's that's the difference between leaving things to the last minute and.",
                    "label": 0
                },
                {
                    "sent": "In accuracies.",
                    "label": 0
                },
                {
                    "sent": "So anyway, what I'm trying to say is there's there are barriers here.",
                    "label": 0
                },
                {
                    "sent": "Journalists as part of their jobs, have to meet their deadlines.",
                    "label": 0
                },
                {
                    "sent": "It's not in their job description to make things true, they just have to get things in on time.",
                    "label": 0
                },
                {
                    "sent": "Anne, this is this is a problem for us and This is why when journalists talk to us they find us very annoying because we often use long, complicated sentences because they're the right sentence is to use and they want the quick sentence is they can broadcast and let everybody understand.",
                    "label": 0
                },
                {
                    "sent": "So how do we get past this?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "Before I tell you how.",
                    "label": 0
                },
                {
                    "sent": "If you do get past this.",
                    "label": 0
                },
                {
                    "sent": "There are actually some rewards here.",
                    "label": 0
                },
                {
                    "sent": "It's actually very clear that if you can popularize your research, if you can capture the imagination of the general public.",
                    "label": 1
                },
                {
                    "sent": "You do get real rewards and I speak from experience 'cause I'm a researcher.",
                    "label": 0
                },
                {
                    "sent": "I sit on both sides of this fence.",
                    "label": 0
                },
                {
                    "sent": "I'm a researcher who's had his work popularized and I popularize other peoples research.",
                    "label": 1
                },
                {
                    "sent": "So for example, you really can see growth in a particular field of research if it's promoted well.",
                    "label": 0
                },
                {
                    "sent": "And for the general public.",
                    "label": 0
                },
                {
                    "sent": "You really can attract new researchers to it, and if your particular group or your particular topic is mentioned, you'll get lots of people interested in joining you.",
                    "label": 1
                },
                {
                    "sent": "It really happens.",
                    "label": 0
                },
                {
                    "sent": "And we all like to hear about funding.",
                    "label": 0
                },
                {
                    "sent": "Well, it's perhaps a sad fact, but our funders pay just as much attention to what's in the news and in the newspapers as they do to what we write.",
                    "label": 0
                },
                {
                    "sent": "So if it is publicized properly, you do get more cash too.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So how can you do it?",
                    "label": 0
                },
                {
                    "sent": "Well, there are lots of ways you can do it.",
                    "label": 0
                },
                {
                    "sent": "One is to expand traditional outputs which we have been hearing about.",
                    "label": 1
                },
                {
                    "sent": "So for example, you can.",
                    "label": 0
                },
                {
                    "sent": "Invite delegates from alternate fields to the normal ones to work show and Pascal has been doing this a little bit.",
                    "label": 0
                },
                {
                    "sent": "Well, you can produce nicer webpages with better interfaces, which I've got to say Pascal needs to do and hopefully it will do before long.",
                    "label": 0
                },
                {
                    "sent": "Or indeed we can have more exciting things I think.",
                    "label": 0
                },
                {
                    "sent": "An obvious thing is to link up with some of the popular social networking websites such as Facebook and you guys should be writing plugins for Facebook and then you'll become a hit overnight.",
                    "label": 0
                },
                {
                    "sent": "But of course, there's the downside of the traditional methods science writers operate in particular ways.",
                    "label": 0
                },
                {
                    "sent": "Science journalists rarely have time to attend scientific events.",
                    "label": 1
                },
                {
                    "sent": "Even the best science journalists from New Scientist, for example, they may turn up for one day in the large conference if you're lucky.",
                    "label": 0
                },
                {
                    "sent": "But they haven't got a lot of time.",
                    "label": 1
                },
                {
                    "sent": "They don't have time to read a broad range of different publications, and even if they did, it's normally one science journalist for a whole huge area.",
                    "label": 0
                },
                {
                    "sent": "So you might have a technology journalist, not a computer science one.",
                    "label": 0
                },
                {
                    "sent": "Certainly not a machine learning 1A technology one.",
                    "label": 0
                },
                {
                    "sent": "This means that even if they do read your paper, they may not really understand it.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But what are they looking for?",
                    "label": 0
                },
                {
                    "sent": "OK, well, the way they work is, they're looking for something that seems like news.",
                    "label": 0
                },
                {
                    "sent": "In science, there's often a kind of delay.",
                    "label": 0
                },
                {
                    "sent": "We may have an amazing breakthrough in our labs, but we can hardly tell a journalist.",
                    "label": 0
                },
                {
                    "sent": "Hey, yesterday I did something that no one's ever done before, so quite rightly the journalists wait until it's published.",
                    "label": 0
                },
                {
                    "sent": "So for them it becomes news when the papers become accepted, or if there's an embargo on news stories as there is in nature and science.",
                    "label": 0
                },
                {
                    "sent": "Wait until it actually appears and it's being presented in a conference or it appears in a Journal, so that's when it becomes official news, so they do have some sense.",
                    "label": 0
                },
                {
                    "sent": "These journalists they recognize it's a breakthrough.",
                    "label": 0
                },
                {
                    "sent": "If it has been peer reviewed, OK?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What else they interested in?",
                    "label": 0
                },
                {
                    "sent": "Well, I guess this is something that you guys might have a slight problem with.",
                    "label": 0
                },
                {
                    "sent": "It's not just when it happens, it's what it's about.",
                    "label": 0
                },
                {
                    "sent": "And what it's about has to relate to ordinary people.",
                    "label": 0
                },
                {
                    "sent": "Now it's very easy to put this big divide up, there's us.",
                    "label": 0
                },
                {
                    "sent": "And then there's everybody else.",
                    "label": 0
                },
                {
                    "sent": "And we're not normal at all.",
                    "label": 0
                },
                {
                    "sent": "But let's face it, we are normal.",
                    "label": 0
                },
                {
                    "sent": "We go to the shops like everybody else.",
                    "label": 0
                },
                {
                    "sent": "We buy food, we drive cars, we do stuff that everybody else does.",
                    "label": 0
                },
                {
                    "sent": "We just happen to know about a lot about one particular thing.",
                    "label": 0
                },
                {
                    "sent": "It's not really that difficult to figure out what relates to ordinary people, OK?",
                    "label": 0
                },
                {
                    "sent": "If you find it particularly difficult, just think.",
                    "label": 0
                },
                {
                    "sent": "Imagine telling your mother or your neighbor or somebody in your your non work life about what you do.",
                    "label": 0
                },
                {
                    "sent": "If you think they'll find it interesting, well, you'll probably find lots of other people find it interesting to, and so that's the kind of thing at science journalist is looking for, something that's just happened just come out an is.",
                    "label": 0
                },
                {
                    "sent": "Other people can relate to.",
                    "label": 0
                },
                {
                    "sent": "So the work I'm here to talk about is as a quick bit of work that exploits the services of an experienced science communicator.",
                    "label": 1
                },
                {
                    "sent": "That's me.",
                    "label": 1
                },
                {
                    "sent": "In order to improve the visibility of Pascal.",
                    "label": 1
                },
                {
                    "sent": "Research and researchers, and that is you guys.",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Oh, I know about it.",
                    "label": 0
                },
                {
                    "sent": "Well, as I said before, I have had stuff written about me.",
                    "label": 0
                },
                {
                    "sent": "This is me on the front cover of magazine and they wrote about me.",
                    "label": 0
                },
                {
                    "sent": "My student annoying, right?",
                    "label": 0
                },
                {
                    "sent": "It was rather annoying.",
                    "label": 0
                },
                {
                    "sent": "He had to look over my shoulder for that one.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You scientist does indeed write about my stuff.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I write a few books.",
                    "label": 0
                },
                {
                    "sent": "Those are some of my books.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I also appear in.",
                    "label": 0
                },
                {
                    "sent": "General Festival's, and this was something I did last summer.",
                    "label": 0
                },
                {
                    "sent": "This is me sharing a public debate with Lewis Wolpert, Steve Jones, and Richard Dawkins.",
                    "label": 0
                },
                {
                    "sent": "This was in the we hired at the Great Wall of the Natural History Museum and our audience of 600 was sitting around the big Dinosaur.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I also write for new scientists now and again, and for some of the science columns.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so I'm also writing for you guys.",
                    "label": 0
                },
                {
                    "sent": "I'm trying to pick out some of the work that I think is relevant to the general public.",
                    "label": 0
                },
                {
                    "sent": "I'm trying to write this in a way that when they appear on the Pascal webpages, if anyone in general is interested, or indeed if a science journalist is interested, they can go straight to it.",
                    "label": 0
                },
                {
                    "sent": "They can understand what you've done instantly.",
                    "label": 0
                },
                {
                    "sent": "They'll be links to the detailed stuff, links to you guys that they can actually get the quotes from themselves, so I'm providing this interface.",
                    "label": 0
                },
                {
                    "sent": "Between your work and the outside world, as best as I can, is different.",
                    "label": 0
                },
                {
                    "sent": "It's difficult to talk about articles you've written, because really, you kind of need to read them.",
                    "label": 0
                },
                {
                    "sent": "I can't kind of just read it out for you.",
                    "label": 0
                },
                {
                    "sent": "Might be a little bit boring, so all I can do really say, well, this is what one of them looks like and it's about relevance of text from my movements.",
                    "label": 1
                },
                {
                    "sent": "Involving some of these people who I'm sure you know.",
                    "label": 1
                },
                {
                    "sent": "And yes, I am able to write about some more complicated things like neural networks, SVM's, and of course we've got a PIN view project that's come through.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is another one.",
                    "label": 0
                },
                {
                    "sent": "Notice how the titles are not really the same as a as a Journal paper title.",
                    "label": 0
                },
                {
                    "sent": "This one is called the mind reading Wizards with an interesting image just to capture the imagination.",
                    "label": 0
                },
                {
                    "sent": "Why did I call it that?",
                    "label": 0
                },
                {
                    "sent": "Well, 'cause it's about a program called Hexose Spell.",
                    "label": 0
                },
                {
                    "sent": "An obvious easy way of.",
                    "label": 0
                },
                {
                    "sent": "Capturing someones interest through a title and this is about analysis of ECG signals combined with a hex shaped interface.",
                    "label": 1
                },
                {
                    "sent": "Hence the name, the software hexose spell, and yes, it's kind of like reading minds.",
                    "label": 1
                },
                {
                    "sent": "It's using EEG signals to figure out.",
                    "label": 0
                },
                {
                    "sent": "Exactly where you're looking so that you can kind of type.",
                    "label": 0
                },
                {
                    "sent": "And this this one involves those people, and indeed I'm talking about those particular techniques, common spatial patterns, linear, discriminate, and now.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This here's another one called the desktop Doctor.",
                    "label": 0
                },
                {
                    "sent": "It's not that difficult to figure out why I picked it.",
                    "label": 0
                },
                {
                    "sent": "Obviously it's relevant to people.",
                    "label": 0
                },
                {
                    "sent": "It's about medicine, it's about.",
                    "label": 0
                },
                {
                    "sent": "Promed US, which is a probabilistic medical diagnostic advisory system.",
                    "label": 1
                },
                {
                    "sent": "To do with those people.",
                    "label": 0
                },
                {
                    "sent": "And yes, I was able to talk about Bayesian inference rules for all those Bayesian nests out there.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the one I'm currently working on, which I'm calling provisional title letting stones go unturned.",
                    "label": 0
                },
                {
                    "sent": "This is about Mogo.",
                    "label": 0
                },
                {
                    "sent": "This is the Monte Carlo go playing program which has been very successful involving all of those people and it uses upper confidence St.",
                    "label": 1
                },
                {
                    "sent": "So it really is possible to talk about some of the detailed techniques you're using.",
                    "label": 0
                },
                {
                    "sent": "It's really possible to talk about you guys, and it's really possible to make it interesting for the general public.",
                    "label": 0
                },
                {
                    "sent": "It's not that difficult.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now I won't always be here to help you.",
                    "label": 0
                },
                {
                    "sent": "We may carry on with this in Pascal too, but there's a limit to the number of articles I can do.",
                    "label": 0
                },
                {
                    "sent": "So what can you do?",
                    "label": 0
                },
                {
                    "sent": "Well, some advice that I try and follow myself.",
                    "label": 0
                },
                {
                    "sent": "Try and make yourself available and be friendly to journalists.",
                    "label": 1
                },
                {
                    "sent": "They do have tight deadlines.",
                    "label": 0
                },
                {
                    "sent": "The chances are if they've called you on the telephone, they're probably working to a deadline that afternoon and they really need to talk to you.",
                    "label": 0
                },
                {
                    "sent": "They may send you an email if they've got a bit more time, but if they're calling you and and you say, well, I'm sorry, you know I'm with this student.",
                    "label": 1
                },
                {
                    "sent": "Call me next week.",
                    "label": 0
                },
                {
                    "sent": "They'll probably never talk to you again.",
                    "label": 0
                },
                {
                    "sent": "If you try and make yourself available in your friendly to them, then they'll come back to you.",
                    "label": 0
                },
                {
                    "sent": "From experience this this is what happens to me now.",
                    "label": 0
                },
                {
                    "sent": "They call me up if they want me to give them a quote about someone else is work, and indeed every six months and you scientist journalist, just calls me up to ask me what's going on.",
                    "label": 0
                },
                {
                    "sent": "Do I know of anything interesting happening?",
                    "label": 0
                },
                {
                    "sent": "Also provide general information on websites these journalists don't have time, you've gotta.",
                    "label": 0
                },
                {
                    "sent": "They're not crazy.",
                    "label": 0
                },
                {
                    "sent": "They're not stupid people.",
                    "label": 0
                },
                {
                    "sent": "They're just busy people.",
                    "label": 1
                },
                {
                    "sent": "So try and provide general information on websites.",
                    "label": 0
                },
                {
                    "sent": "Try and provide your biography in an easy to read format.",
                    "label": 0
                },
                {
                    "sent": "They don't need to know how many students you supervised to completion or how many papers you published.",
                    "label": 1
                },
                {
                    "sent": "They need in a slightly more general things.",
                    "label": 0
                },
                {
                    "sent": "So have a kind of general biography available.",
                    "label": 0
                },
                {
                    "sent": "Have summaries of your research and easy to understand language.",
                    "label": 0
                },
                {
                    "sent": "OK, if you have done some important new research that people may be interested in, provide pointers to it.",
                    "label": 0
                },
                {
                    "sent": "Make sure it's there online.",
                    "label": 0
                },
                {
                    "sent": "A really important one is is simple learning how to communicate.",
                    "label": 0
                },
                {
                    "sent": "It's it's amazing how many scientists simply can't talk without using all of the terminology that they write in their papers.",
                    "label": 1
                },
                {
                    "sent": "It's very easy to hide behind terminology and you'll find if you can speak without that terminology.",
                    "label": 0
                },
                {
                    "sent": "You'll find all of your ideas become much clearer in your own mind.",
                    "label": 0
                },
                {
                    "sent": "It's a very useful skill to have, and I'm sure we've all written or we've all hopefully handle written.",
                    "label": 1
                },
                {
                    "sent": "But we've all read papers where it does seem as though people are just.",
                    "label": 1
                },
                {
                    "sent": "Hiding behind the terminology and trying to make themselves look clever just because of all the clever words they know there's there's a big difference between really understanding a concept and.",
                    "label": 0
                },
                {
                    "sent": "Speaking clearly about it.",
                    "label": 0
                },
                {
                    "sent": "And also think about your work.",
                    "label": 0
                },
                {
                    "sent": "Is it newsworthy?",
                    "label": 0
                },
                {
                    "sent": "If you have just published a new discovery and you think it does relate somehow to ordinary people and you are ordinary people, don't forget.",
                    "label": 0
                },
                {
                    "sent": "Then think about it as a potential news event.",
                    "label": 0
                },
                {
                    "sent": "All of your universities will have press offices.",
                    "label": 0
                },
                {
                    "sent": "They will all be able to help you.",
                    "label": 0
                },
                {
                    "sent": "Do press releases.",
                    "label": 0
                },
                {
                    "sent": "They all have Contacts with the media they can push out these press releases to the right places and that can generate.",
                    "label": 0
                },
                {
                    "sent": "A huge amount of interest.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To end with.",
                    "label": 0
                },
                {
                    "sent": "Really, I'm I'm doing is as best as I can with these articles.",
                    "label": 0
                },
                {
                    "sent": "Hopefully you'll enjoy them when you read them.",
                    "label": 0
                },
                {
                    "sent": "Hopefully the general public will enjoy them when they read them with pushing them out to general magazines as well, but you really will benefit if you think about doing this for yourself.",
                    "label": 0
                },
                {
                    "sent": "Think about how to do it.",
                    "label": 1
                },
                {
                    "sent": "Think about communicating with the general audience.",
                    "label": 0
                },
                {
                    "sent": "It will benefit you.",
                    "label": 0
                },
                {
                    "sent": "It's always nice to have friendly groups appears.",
                    "label": 0
                },
                {
                    "sent": "We're all used to going and meeting the same twenty 5000.",
                    "label": 0
                },
                {
                    "sent": "Appears in our conferences, but there's a whole world out there.",
                    "label": 1
                },
                {
                    "sent": "There are millions of people who are potentially interested in what you do.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "His audience.",
                    "label": 0
                },
                {
                    "sent": "Back to what we have usually do, cyantific more serious, but what kind of feedback do you get from your audience?",
                    "label": 0
                },
                {
                    "sent": "So what's?",
                    "label": 0
                },
                {
                    "sent": "I'm sure you must have some kind of communication then.",
                    "label": 0
                },
                {
                    "sent": "Which audience you talk about.",
                    "label": 0
                },
                {
                    "sent": "I have many audiences.",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                },
                {
                    "sent": "What would be the feedback, please?",
                    "label": 0
                },
                {
                    "sent": "Popular Science.",
                    "label": 0
                },
                {
                    "sent": "That that entirely depends on the readership.",
                    "label": 0
                },
                {
                    "sent": "So so for new scientists, for example, you'll get letters from enthusiastic amateurs who may be in any kind of job saying, I always thought that was possible, but you've proven me right?",
                    "label": 0
                },
                {
                    "sent": "Or that's the coolest thing I've ever heard or you might get one that saying why you wasting your time?",
                    "label": 0
                },
                {
                    "sent": "That's entirely pointless.",
                    "label": 0
                },
                {
                    "sent": "Or you've got that wrong.",
                    "label": 0
                },
                {
                    "sent": "And then you may get letters or communications from people saying I work in this particular field, and I. I never knew this was possible.",
                    "label": 0
                },
                {
                    "sent": "Can we collaborate so all different areas you can get this and indeed from my Popular Science books and a surprising number of scientists in completely different fields.",
                    "label": 0
                },
                {
                    "sent": "Pick up these books.",
                    "label": 0
                },
                {
                    "sent": "And under absolutely fine and wonderful and and start collaborations because of them that it's a way of getting not just the normal sort of general public, but to other scientists in other fields.",
                    "label": 0
                },
                {
                    "sent": "I'll kiss him.",
                    "label": 0
                },
                {
                    "sent": "When they.",
                    "label": 0
                },
                {
                    "sent": "Published by someone.",
                    "label": 0
                },
                {
                    "sent": "And are you following that?",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "As much as as you can with any of these things, yeah.",
                    "label": 0
                },
                {
                    "sent": "It's it's a I've gotta say, it's easier with books with books, you know exactly how many are sold and you say you know exactly the extent of your readership.",
                    "label": 0
                },
                {
                    "sent": "With these kind of magazines.",
                    "label": 0
                },
                {
                    "sent": "People just kind of read them and and you can't guarantee they will read every article in a in a magazine.",
                    "label": 0
                },
                {
                    "sent": "Hopefully though, yes.",
                    "label": 0
                },
                {
                    "sent": "Just publish their magazine that we had about that published one of those three.",
                    "label": 0
                },
                {
                    "sent": "Not not your general.",
                    "label": 0
                },
                {
                    "sent": "The Pascal.",
                    "label": 0
                },
                {
                    "sent": "We're still we're still waiting to play some of them, so I'm hoping to place at least one in something like New Scientist.",
                    "label": 0
                },
                {
                    "sent": "But New Scientist is very picky and.",
                    "label": 0
                },
                {
                    "sent": "In the mall until you finish a collection and then I've had one in a in a kind of London based magazine which is actually asking for more, but I'm not sure it's wise to stick them all in the same thing.",
                    "label": 0
                },
                {
                    "sent": "But as I say, something like New Scientist is the best because it's used as source material for the world, and indeed the world's immediate.",
                    "label": 0
                },
                {
                    "sent": "Magazine publishes an article.",
                    "label": 0
                },
                {
                    "sent": "It decreases the chances that this article goes.",
                    "label": 0
                },
                {
                    "sent": "Well, no, they they usually uses source material.",
                    "label": 0
                },
                {
                    "sent": "So for example, a New Scientist article will then be picked up by papers and then will be picked up by other other magazines and it can.",
                    "label": 0
                },
                {
                    "sent": "Just it just keeps going so they they typically there are different.",
                    "label": 0
                },
                {
                    "sent": "There are different.",
                    "label": 0
                },
                {
                    "sent": "Quality of of journalist.",
                    "label": 0
                },
                {
                    "sent": "So the specialist science journalists that that work for the specialist magazines like New Scientist and they are often the ones that do the work and get the stories together and then the non specialist journalists who use those.",
                    "label": 0
                },
                {
                    "sent": "GNU Scientist style articles for their own material.",
                    "label": 0
                },
                {
                    "sent": "So they're essentially consulting water.",
                    "label": 0
                },
                {
                    "sent": "A journalist thinks together get their stuff which which they find easier because they are not scientists at all, and then their material goes on and goes on.",
                    "label": 0
                },
                {
                    "sent": "It's because of the barriers of communication they do that they simply don't know how to talk to us.",
                    "label": 0
                },
                {
                    "sent": "They don't know how to get to our material in a way that is understandable, so they use their own stories as source material.",
                    "label": 0
                },
                {
                    "sent": "So we all have departments or universities that have their own web pages with their own publicity Department.",
                    "label": 0
                },
                {
                    "sent": "So when people are patient apartments.",
                    "label": 0
                },
                {
                    "sent": "What's your feeling on the kind of ratio effort that's required for individuals as opposed to effort required by the publicity Department?",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Bring our stories to the Department that deals with that.",
                    "label": 0
                },
                {
                    "sent": "Well no, no.",
                    "label": 0
                },
                {
                    "sent": "I mean I mean.",
                    "label": 0
                },
                {
                    "sent": "It it depends on University and often that the press office of the University may want to help you write the press release.",
                    "label": 0
                },
                {
                    "sent": "They may even want to feel the phone calls, so they may want to be the one that's the first contact.",
                    "label": 0
                },
                {
                    "sent": "That's not always a great thing.",
                    "label": 0
                },
                {
                    "sent": "It's often better if the calls come to you direct because the press Department often get a lot of things wrong and then it gets a bit messy.",
                    "label": 0
                },
                {
                    "sent": "It's nicer if you can talk with the people yourself.",
                    "label": 0
                },
                {
                    "sent": "If you've got the time.",
                    "label": 0
                },
                {
                    "sent": "The other side of it is in newspaper land.",
                    "label": 0
                },
                {
                    "sent": "They get hundreds of press releases every day, so it's important that you've actually got a good press officer who knows not just the right Department, but the right person to push this press release 2 'cause if they can push it to the right person who they know will be able to write something about it that'll bypass all of these stuff that goes straight in the garbage.",
                    "label": 0
                },
                {
                    "sent": "This is why writing a press release is also very important if you just write a very technical looking thing, it'll go straight in the garbage.",
                    "label": 0
                },
                {
                    "sent": "It's gotta really captured the imagination.",
                    "label": 0
                },
                {
                    "sent": "Resources I don't know Science Journal or something monitor large universities press release websites for information they get sent to them.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah.",
                    "label": 0
                },
                {
                    "sent": "1 + 1.",
                    "label": 0
                },
                {
                    "sent": "Decide when you want to talk to the person that you're saying you think you're flying.",
                    "label": 0
                },
                {
                    "sent": "Sometimes, given it quick heads himself.",
                    "label": 0
                },
                {
                    "sent": "If you're probably Monday, but then the yeah, yeah and then.",
                    "label": 0
                },
                {
                    "sent": "What's the right time touch?",
                    "label": 0
                },
                {
                    "sent": "The person is interesting?",
                    "label": 0
                },
                {
                    "sent": "20 or 30 other journalists?",
                    "label": 0
                },
                {
                    "sent": "Well, the problem is it's very hard to artificially set the time.",
                    "label": 0
                },
                {
                    "sent": "You can now and again you can get away with saying, well, I did the work a year ago, but I'm going to the press release now, but generally they prefer it to be news.",
                    "label": 0
                },
                {
                    "sent": "They prefer it to be.",
                    "label": 0
                },
                {
                    "sent": "He's published it today or it's coming out tomorrow.",
                    "label": 0
                },
                {
                    "sent": "This is news and and they really treat it like news you know, for for a period of maybe 2430, six, 48 hours.",
                    "label": 0
                },
                {
                    "sent": "If it goes well, you can be on the 24 hour news channels.",
                    "label": 0
                },
                {
                    "sent": "You know this can sweep around the world.",
                    "label": 0
                },
                {
                    "sent": "In that period.",
                    "label": 0
                },
                {
                    "sent": "Two days later, they've forgotten about it again, so it's a very narrow window, something.",
                    "label": 0
                },
                {
                    "sent": "Really ready for the science is even really done.",
                    "label": 0
                },
                {
                    "sent": "Much more complete story.",
                    "label": 0
                },
                {
                    "sent": "We shot that and again, this is if you think it's good to sort of make the press release and site you know this paper is coming out at a time when you do have the backup.",
                    "label": 0
                },
                {
                    "sent": "So maybe this won't be the first paper you've done on the area.",
                    "label": 0
                },
                {
                    "sent": "Maybe this will be the 2nd or the 3rd and you've got enough material to really show that it's something.",
                    "label": 0
                },
                {
                    "sent": "Website.",
                    "label": 0
                },
                {
                    "sent": "Public relations online.",
                    "label": 0
                },
                {
                    "sent": "So definitely all of these things.",
                    "label": 0
                },
                {
                    "sent": "Michelle will.",
                    "label": 0
                },
                {
                    "sent": "I had just a comment you were you were saying you should be clear, OK and and of course this is common sense knowledge, but are you?",
                    "label": 0
                },
                {
                    "sent": "Are you saying that we we do it on purpose?",
                    "label": 0
                },
                {
                    "sent": "I mean to be unclear.",
                    "label": 0
                },
                {
                    "sent": "I mean, if it's if it's it's it's as easy as saying.",
                    "label": 0
                },
                {
                    "sent": "Just be clear this.",
                    "label": 0
                },
                {
                    "sent": "I mean we would do this.",
                    "label": 0
                },
                {
                    "sent": "So I had a constructive suggestion which might be also perhaps we might use.",
                    "label": 0
                },
                {
                    "sent": "Bit of training into simplicity.",
                    "label": 0
                },
                {
                    "sent": "And perhaps we might have some kind of I don't know.",
                    "label": 0
                },
                {
                    "sent": "Corruption through choosing, of course.",
                    "label": 0
                },
                {
                    "sent": "There's there's certainly there's no reason why you shouldn't have some kind of tool that measures the the clarity in the, perhaps in terms of the use of terminology and things like that.",
                    "label": 0
                },
                {
                    "sent": "It's quite easy to.",
                    "label": 0
                },
                {
                    "sent": "Amazon released books at least also that forgiveness proficient.",
                    "label": 0
                },
                {
                    "sent": "How many pennies per page?",
                    "label": 0
                },
                {
                    "sent": "How many pages?",
                    "label": 0
                },
                {
                    "sent": "The world?",
                    "label": 0
                },
                {
                    "sent": "And I think that's a coefficient.",
                    "label": 0
                },
                {
                    "sent": "Well, I've got I've gotta say, part of it is practice.",
                    "label": 0
                },
                {
                    "sent": "And of course part of it is learning how to do it.",
                    "label": 0
                },
                {
                    "sent": "You know there's a culture of.",
                    "label": 0
                },
                {
                    "sent": "Being precise, yes, but using.",
                    "label": 0
                },
                {
                    "sent": "Using perhaps over precise language and getting a little bit too obsessive about the terminology when.",
                    "label": 0
                },
                {
                    "sent": "Yes, you can use the terminology, but you don't always need to.",
                    "label": 0
                },
                {
                    "sent": "You know there's often simpler words and simpler ways of explaining things, and there's nothing wrong with a nice analogy and a metaphor, and just these sorts of methods just require a little bit of practice, and they make the world of difference.",
                    "label": 0
                },
                {
                    "sent": "Maybe after they move out next week, could you?",
                    "label": 0
                },
                {
                    "sent": "OK, so you talking very much about conventional press press release things like that.",
                    "label": 0
                },
                {
                    "sent": "What about logs?",
                    "label": 0
                },
                {
                    "sent": "What about demos that people think are really cool?",
                    "label": 0
                },
                {
                    "sent": "All these kinds of things as yes, as I say at the moment that there are kind of developing 2 forms of media, there's the traditional stuff which we have to deal with because it's it's the establishment and that that is the media.",
                    "label": 0
                },
                {
                    "sent": "That's the newspapers and magazines and stuff.",
                    "label": 0
                },
                {
                    "sent": "But yeah, the new media is the Internet.",
                    "label": 0
                },
                {
                    "sent": "And as I say, I, I think if you want to reach.",
                    "label": 0
                },
                {
                    "sent": "The young audience do plug into Facebook.",
                    "label": 0
                },
                {
                    "sent": "Do things like that.",
                    "label": 0
                },
                {
                    "sent": "You know these these programs are being used, but every day sometimes every hour by these people.",
                    "label": 0
                },
                {
                    "sent": "If you've got little tools or you just press releases.",
                    "label": 0
                },
                {
                    "sent": "Results in the hope that they will be picked up by Commission immediately.",
                    "label": 0
                },
                {
                    "sent": "There's not a lot that I mean.",
                    "label": 0
                },
                {
                    "sent": "Yes, there's a lot of conventional media is using online resource and of course things like Wired is great for that sort of thing, but.",
                    "label": 0
                },
                {
                    "sent": "But blogs haven't quite reached that maturity yet, and they're not.",
                    "label": 0
                },
                {
                    "sent": "They're not currently, maybe in another two or three years, five or six years, they will become more mainstream, but but right now there are millions of blogs out there, and.",
                    "label": 0
                },
                {
                    "sent": "Who's to say which is good and who's to say a popular one is good?",
                    "label": 0
                },
                {
                    "sent": "Or a you know it's it's still under development I guess.",
                    "label": 0
                },
                {
                    "sent": "I guess my my feeling is you something that already is successful.",
                    "label": 0
                },
                {
                    "sent": "This is why you know.",
                    "label": 0
                },
                {
                    "sent": "Facebook, YouTube, that kind of thing.",
                    "label": 0
                },
                {
                    "sent": "It's it's successful now.",
                    "label": 0
                }
            ]
        }
    }
}