{
    "id": "gqog74olmbkdfxnjd344vqzmekzwgwq5",
    "title": "ELP: Tractable Rules for OWL 2",
    "info": {
        "author": [
            "Markus Krötzsch, Institute of Applied Informatics and Formal Description Methods (AIFB), Karlsruhe Institute of Technology (KIT)"
        ],
        "published": "Nov. 24, 2008",
        "recorded": "October 2008",
        "category": [
            "Top->Computer Science->Semantic Web->OWL - Web Ontology Language"
        ]
    },
    "url": "http://videolectures.net/iswc08_krotzsch_elptr/",
    "segmentation": [
        [
            "Thank you and well, I'm impressed by someone being able to pronounce my name right?",
            "So indeed, so this is joint work with.",
            "Very good.",
            "This is joint work with Sebastian Rudolph and Pascal Hitzler, all of us from Karlsruhe and we have what do I have to press?"
        ],
        [
            "This one, so what's the?",
            "What's the purpose of that work, really?",
            "So where do we want to go to?",
            "Well, what we set out to do really hear what?"
        ],
        [
            "To create a semantic web language in a way that is focused on data as opposed to being focused on schema As for example, LDL is often perceived to be which is also rule oriented.",
            "If you have a lot of data, it's often very natural to model stuff using rules, right?",
            "Till we wanted it to be able to express a certain amount of schematic knowledge as well and.",
            "Maybe beyond those expressive characteristics, it should also, of course be easy to implement because that's something which often hinders the adoption of a language and practice that people have significant difficulties implementing semantics properly, so that should be easy.",
            "And in this sense it's also clear that it should probably be of polynomial worst case complexity becausw anything which is worse than polynomial certainly is not easy to implement in a very efficient way.",
            "You have to do very smart optimizations which you can do anyway in this case as well, but.",
            "Might fill work without them, and last but not least, it should also be compatible with our big cause.",
            "For one thing, there's a lot of machinery's that you can use on our compatible things, and second, because we can make it that way, and it's certainly no use in wasting that feature if you can get.",
            "So that's what we really tried to achieve here and.",
            "In the, in a way, this is also what I'm going to present throughout the talk, but I'm going to ghost."
        ],
        [
            "By step, I guess, and since I'm not sure here in this session, I don't see so many old faces.",
            "I guess it's better to start with recalling some basic things about our land description logics, right?",
            "So no offense meant without face right?",
            "So I'll let description logics.",
            "As you know, all of the Web Ontology language.",
            "It's based on description logics and to users.",
            "Of course you have to explain that in a very basic way, but."
        ],
        [
            "To academics, it's usually easiest to explain it by saying, well, that's just a fragment of 1st order logic with some equality.",
            "So semantically we can view our description logics in general like that, and from this perspective, at least, to people who are familiar with first order logic, it doesn't seem all that complicated."
        ],
        [
            "After all, so this talk is going to be driven by examples mostly, and I'm starting with some very simple modeling.",
            "I want to do here, which is the sentence Sebastian ordered some Thai Curry and I can say that in all or I use description logic syntax here because my slides are only that big.",
            "So here's a short description, logic notation sayings that Sebastian the object identified by that string, or that said name here, is belonging to the class of things.",
            "Which have all that a dish that is a Thai Curry.",
            "So there is some Thai Curry in first order logic.",
            "I would say it like that.",
            "Some Thai Curry X which has been ordered by the best team.",
            "So that's something I can say and it also shows a particular typical feature of our names that you can have such existential things which often kind of clash with what you have in a rule based implementation of the rule based."
        ],
        [
            "Of the world.",
            "Now another example here is.",
            "This is actually just arrange axiom saying that everything all it doesn't dish is really a dish.",
            "So in description logic syntax it looks a little bit confusing like that if you think about it, it really says this in first order logic.",
            "So whenever X or does a dish, why well why is it?"
        ],
        [
            "And finally I have this example here saying that, well, for the sake of the example you will see why this is needed.",
            "Every Thai Curry dish actually contains peanut oil, and here you have a concrete individual in a class.",
            "Frame, so to speak.",
            "A nominal and it says every Thai Curry or the subclass of Thai.",
            "Curry's is a subclass of things which contain peanut oil, and again in first order logic this becomes a little bit easier.",
            "Especially you can see here the existential quantification is not really there because you just.",
            "There is something, and there's something exactly.",
            "Is this peanut oil so you don't need to quantify here.",
            "You just say every Thai Curry contains peanut butter."
        ],
        [
            "OK, so these are some examples on description logics and I'll and I'm continuing with my notion of rules here.",
            "As you know, rules as such are a very very general field and certainly an overloaded term.",
            "So in this talk I'm going to focus on rules which are still having a first order logic semantics, so non monotonicity for the time being for example.",
            "And still those rules are pretty handy and useful in applet."
        ],
        [
            "Nations and one very simple fragment that comes to mind.",
            "There is data log, so Datalog is just first order logic horn logic without function symbols essentially of course Datalog can also be endowed with non 1st order semantics, but in the end if you only look at Datalog consequences, it's pretty equivalent and many logical rule languages somehow have Datalog as it's 'cause it's a nice basis to start with.",
            "So."
        ],
        [
            "Again, I'll show you some examples from this domain I have chosen here that allergics dislike not product.",
            "So here you say whenever X is not allergic and why is it not products and we have since dislikes relationship and already here you can see this wouldn't quite be so easy to model in.",
            "Alright so in fact this can be done with some feature combinations but for non initiated user it's really hard to come up with a solution for for describing this in and out ontology even though it seems to be a very simple statement.",
            "If you have a rule language."
        ],
        [
            "Here another rule.",
            "People who order Additionally dislike unhappy, at least in this example.",
            "So you have here the order dish XY and dislikes XY makes you unhappy.",
            "A conjunction of properties again."
        ],
        [
            "You cannot do that easily in description logics.",
            "And then here's a little more complicated rule saying if someone dislikes an ingredient of a dish, she will also discuss."
        ],
        [
            "It's a dish.",
            "OK, finally to complete our example 2 facts, Sebastian is in fact not allergic and peanut oil is really a nut product."
        ],
        [
            "So after this brief introduction into the various formalism, we're dealing with, the obvious question is, can we combine those things to work with them together?",
            "Does it actually?"
        ],
        [
            "Make sense to say something like this here.",
            "I have C3 on to logical DL axioms.",
            "I have these five rules here is it?",
            "Has it any obvious meaning to say that?",
            "And of course we know it has been cause of this first."
        ],
        [
            "Logic embedding set both things enjoy and away.",
            "So if I consider those together, I can still say well in the most general sense, it's always a first order logic theory, and I know what is concluded from those, so it's at least well defined.",
            "What kind of meaning this would have and if you have been very observant, you will notice that there are some interesting conclusions we could draw across this knowledge base.",
            "I will come to that later.",
            "Now this graphic shows that not only both are in first order logic, but in fact they have some.",
            "Intersection very roughly speaking here, which was called Description Logic program.",
            "So something which is both Datalog and description logic expressible, and if you look at what."
        ],
        [
            "Description Logic programs can express.",
            "Looking at our example, you can see well they can express some description, logic, axioms and some basic facts here in the rule side as well, which could be modeled in our List 2, but they cannot express all description logic things because not all of them are in Datalog and they cannot express Datalog rules which are not in description logics.",
            "So you can only express part of what you would like to say now after if you can do that.",
            "Of course you can also look at the dual approach and say well.",
            "Let's just take the Union intuitive."
        ],
        [
            "Speaking of our land Datalog, and this is what has been called Swirl, the Semantic Web rule language in a syntactic variant at least essentially semantic as well.",
            "You can do both in unrestricted, weighs more or less, so you can have any set of Datalog rules with any out on Dollar Tree and combine the two.",
            "Now this all seems to be very nice already at models all that we wanted to say here, but unfortunately as."
        ],
        [
            "Also, I'm sure no this well is undecidable, so it seems that we have modeled a very simple problem here about preferences regarding food and we certainly could draw some conclusions.",
            "But if we want to implement it as.",
            "To use as well tool for that that we couldn't even be sure whether the tool would be able to cope with that, because there must be some cases where any small tool is not terminating, because it's it's undecidable and on the other hand it seems to be such an easy problem here, so maybe it's not the right tool after all.",
            "So the question is what can we do instead of just taking the stupid union or intersection of things, but rather to find a middle ground where we can have some as well but still remain decidable in a way."
        ],
        [
            "And one thing that has been proposed to this end is an approach called DL safe rules.",
            "And the elseif rules essentially are based on."
        ],
        [
            "Again, very intuitively speaking, the idea to restrict rules Datalog rules to apply only to named individuals.",
            "Now, why is this restriction after all?",
            "Well, 'cause if you have an old ontology then there might be something some objects in your semantic domain which must exist which are there but which do not have a name.",
            "For example, there was this one axiom saying that Sebastian order the Thai Curry, but we don't know what exactly this Thai Curry was and we don't have a constant or individual name or your eye referring to the Thai Curry.",
            "So we just know there is something and exactly to those things DL safe rules could not be applied DLC.",
            "Those are restricted to only this finite set of things which you could name explicitly, and this is what makes them decidable."
        ],
        [
            "In the end and in our example, we could just say, well, this is still description logic expressible, and then we could add those rules with this restriction of safety sayings that well, they are not really 1st order now in the way I write them, but rather they are restricted to apply to things which are named in this case to apply to the best Jen and peanut oil and nothing else.",
            "Now this is 1 approach that you can take in order to obtain its decidable subset of swirl and a second somewhat."
        ],
        [
            "To re approach that we have explored recently is called the L Rules.",
            "So first thing was it safe rules and now we have the our rules and the idea about the arrows really is that these are just the rules that you can express with some."
        ],
        [
            "Tricks in description.",
            "Logics anyway.",
            "So as I say, it is possible to consider description logic as a fragment of 1st order logic, so naturally you arrive at the question.",
            "If I am free to use any kind of macros and any kind of additional axioms, which rules in first order logic, could I model indirectly with description logics?",
            "And it turns out that these are just so description logic rules, and in fact these can be identified as rules which.",
            "Intuitively speaking again."
        ],
        [
            "Have tree shaped bodies and with this I mean something like that here.",
            "So here you have if somebody dislikes an ingredient and a dish contains ingredients then he will dislike the dish and you see if you draw the relationships in the body of this rules that yes, this looks very much tree shaped and this is already enough.",
            "Basically to ensure that this can somehow be encoded in the description logic underlying our tool.",
            "So in fact there are such rules which seem to be pretty rule like and.",
            "Very much unlike and still you can kind of encode them in a way in.",
            "Also, they are actually really reconciled in that language, so these are the rules and well, say complementary elseif rules in that they are applicable to everything, but they are not allowed to have arbitrary shapes.",
            "So you have DL safe rules that have arbitrary shapes but are only applicable to some things you have DL rules which are applicable to everything but not in arbitrary."
        ],
        [
            "Shapes and question is can oops yeah.",
            "So this is just the example again here you see.",
            "That we can actually also express this rule here.",
            "It's not really one tree, but two trees of just one root node is.",
            "You can see just one variable X1Y, and there's no relationship, and I explained that you can express this.",
            "You cannot express roll conjunction because here you see there are two paths from X to Y.",
            "So the question."
        ],
        [
            "Now obviously, is whether we can combine the two things.",
            "And of course we can be 'cause the arrows are just another way to write down and out ontology innocence and DL safe rules."
        ],
        [
            "Can be combined freely with them, so we could actually do that here.",
            "Now the question is, if you see that here it seems we have almost achieved all the expressivity we want to have, and if you look at the example you find that there should be some consequences from it, right?",
            "Sebastian is not allergic and peanut orders are not product, so it's certain that Sebastian dislikes peanut oil.",
            "Now Sebastian ordered some Thai Curry which must also contain peanut oil and which also must be a dish.",
            "And so we can conclude that.",
            "Well, we can conclude that if Sebastian dislikes peanut oil and there's this dish which contains, it sends a bus changes likes also this Thai Curry, but there it stops because now we have a problem we can't explain.",
            "Apply this safe rule here.",
            "'cause well, X is probably the bus down who ordered the dish, but there's no name for the dish, so we can't conclude the Boston is unhappy even though we know he ordered a dish that he doesn't like.",
            "So in fact, even in this case."
        ],
        [
            "We don't get the desired conclusions and what is more, it is still computationally rather expensive in the general case.",
            "So if we was to consider just an engine which can do deal with the full expressivity of DL safe rules, and there are rules, then we need some very powerful algorithm to do that.",
            "So the outside rules alone, RX time complete combined complexity here and DL rules are just as complex as the description logic.",
            "For example next time completed.",
            "In LDL, and worse, if you go to L2.",
            "So it seems that it's not quite the right approach and the question is, could we maybe look at this other aspect here if we want to avoid computational?",
            "Blow up and look for something which is more."
        ],
        [
            "Tractable, and indeed again, I'll two offers features here.",
            "You may have heard of those tractable profiles of our two, which are very restricted sub languages of the whole thing, which are much simpler and disallow many constructs and."
        ],
        [
            "Two of those I want to mention here.",
            "One is called LRL, which stems from rule language I guess to some extent it is essentially what I described to you as DLP, with additional extensions that come with all two, but essentially it is very much a horn logic fragmente and it's still all representable.",
            "It doesn't have existentials.",
            "And then there's our El which includes existentials, but which disallows some things which are in RL.",
            "For example is no inverses and it's called that way because it's based on this description logic.",
            "All."
        ],
        [
            "Now looking at that, it turns out that most of the description logic axioms we have in our example are already in this tractable fragments, so this looks kind of promising.",
            "It seems that this could be done handled much simpler than with the full power of an L2."
        ],
        [
            "Even though and well with our RLI get one rule less.",
            "But as I said, there would also be something small you could do, but not in this."
        ],
        [
            "Example, now that I think about so small fragments, is they also both polynomial time complete so you can implement them with rather simple approaches in still have a practical system which which works on larger scales and since very complex, all systems that could deal with all of it, now you may ask why does the all working group do such two different profiles which are both simpler?",
            "Why can't they just make one simple profile which maximizes the benefits here but."
        ],
        [
            "Of course, the reason it sets the problem emerges when you try to combine the two and take all of the features then, well, the thing explodes and and you can essentially model all of our two, which would be in two X time complete.",
            "So these are kind of maximal ways of getting more expensive ITI which you cannot."
        ],
        [
            "Extent.",
            "So after this kind of lengthy walks through different features and approaches that have been explored so far, I'm going to very simply explain to you what we did in that paper.",
            "Namely, we just bought all of that together in a way it's called LP, deriving from DLP and combining it with this El."
        ],
        [
            "Idea dear.",
            "What it is is essentially this.",
            "You take description, logic rules, but only for the description logic hourly L. And as I said, they are just as complex as the description logics they use.",
            "So in this case they would still be polynomial.",
            "You add conjunctions of roles simply because we can.",
            "You can also omit those if you like to have something which works completely without 2.",
            "But, well, we can take some in.",
            "It doesn't hurt, and we allow the elseif variables.",
            "Now.",
            "I will explain shortly what that really means.",
            "It's for the moment.",
            "Just imagine we allow some DL safe rules, because as I said, the elseif rules as such are already exptime complete, so it would be no longer attractable fragmente if we even allow all of them.",
            "So there must be some restriction.",
            "And we throw all of that together and quality LP and give it a rule based syntax in the paper.",
            "But you could also give it a description logic based syntax if you prefer."
        ],
        [
            "OK, theorem inferencing in this.",
            "Logic is P time complete, so that was certainly something we wanted."
        ],
        [
            "Achievement when creating it now as you see in the example, all of it.",
            "Well surprisingly, I mean I wouldn't have chosen this example otherwise, but now this.",
            "In this case you see that all of the features that were not available fully or only partial in other things are now kind of available.",
            "You see here that there are still see small locks and this is what I mean with a DL safe variable.",
            "Now I say well in general the rule applies to everything but this variable Z here.",
            "Is restricted to apply only to named individuals, so I do not longer say all the variables in the rule have to have this restriction, but I can say only this one variable must have this restriction, otherwise it won't work anymore.",
            "And.",
            "Well, I should probably tell you now how this reasoning works in this particular case.",
            "I already explained before that we can derive a lot about Sebastian here, for example, that he dislikes this peanut oil, and he ordered this dish and now it comes to applying this rule here.",
            "And we know that the bus scientist likes peanut oil and there is this Thai Curry which we don't know a name for.",
            "And this Thai Curry contains peanut oil.",
            "And since peanut oil is a named variable, we can actually apply it.",
            "And we obtain that Sebastian dislike the Unamed Thai Curry.",
            "And though because of this rule also being fully applicable due to sequence junctions, the role conjunctions that I mentioned, we can really conclude in the end."
        ],
        [
            "This example sets of Austin is unhappy which see kind of purpose offset.",
            "OK, so you see that it works together and it's all still in there."
        ],
        [
            "Polynomial fragmente cool.",
            "Now an important note here is that.",
            "Yelp Ian away supports influencing both in L&NRL as I mentioned.",
            "Well, how can that be all NRL combined are blowing up so there is much more complexity there, but still, what you can do is you can support all of our emails that is just included in the language and for SRL becausw of our being a language without existential quantifiers.",
            "See consequences that you can draw from all our L. Actually only referring to named individuals.",
            "So when you take an LRL knowledge base.",
            "And you.",
            "Postulate that all of the variables occurring in the rule version of it are safe.",
            "You still get the consequences that you would have obtained from the oil knowledge base, so you can assume our our parts to be safe and our El parts to be unsafe.",
            "General rules here.",
            "Of course, when you do that, you do no longer get all of the consequences in the conclusion.",
            "If you wanted to have all it would be N 2X time completes.",
            "That would be a different story, but at least you get some of them.",
            "And my example just shows that it.",
            "Can really give a meaningful.",
            "There can be a meaningful interaction between both worlds which you wouldn't have got in a separate approach where you kind of have a more shallow interface.",
            "So in a way anyone who builds an ELP reason I would also have a reason for those two fragments at least."
        ],
        [
            "Now.",
            "Here's a slight variation of this.",
            "Which says Thai Curry's contain not just peanut oil, but some fish product.",
            "And Marcus ordered such a Thai Curry and vegetarians don't like fish products and Marcus is ineffective, vegetarian and now the situation is slightly different.",
            "Now I know there is some fish product but I don't know which one and in this case the rule no longer can be applied because see now would have to represent this fish product and that's really the difference where we lose conclusions as opposed to just combining our land."
        ],
        [
            "Well, so that's for you to understand a little bit intuitively where the restrictions are.",
            "There are still cases where we won't get all first order logic conclusions from the knowledge base, so unhappy markets cannot be concluded.",
            "Even though Markus himself might be a fit."
        ],
        [
            "Logic, reason and so he can conclude set himself.",
            "Now towards implementation.",
            "I mentioned whoever has such a reason I had support for all of the old profiles, which would be nice."
        ],
        [
            "So how hard is that?",
            "Well, theorem inferencing and LP can be reduced in linear time to inferencing in three variable data log.",
            "So that's very nice.",
            "You have a Datalog engine and you can just take this ERP and you can even take start off with an hour ontology which represents an early lol part and you can apply."
        ],
        [
            "Is that linear time transformation and what this gives you is, well, first of all, the transformation is very easy to do because it's a completely syntactic thing.",
            "You take one axiom at a time, you transform it a little bit and it gives you a set of Datalog rules and.",
            "Then you can use the Datalog engine as a back black box, and you can even do both instance checking and subsumption based on this Datalog program in polynomial time, because it's three variable data log, it's a polynomial algorithms that you need.",
            "So OK, so this basically finished."
        ],
        [
            "My talk and summing up, I can just say well there is this LP which is a DL based tractable rule language that we described.",
            "You confuse few it as a subset of data lock with extended with existentials or you can view it as a subset of our two extended.",
            "With this role conjunctions, it's almost completely expressible in L2, so you could use our two syntax to communicate if you like.",
            "It supports both of those profiles, and there's a third similar profile which could also be treated.",
            "This linear time conversion, which is very nice for implementers who already have a rule engine and we want to Add all support on top of it.",
            "OK, so thank you very much."
        ],
        [
            "So you have L plus plus and then if I understood you have rules from Eureka Paper I assume.",
            "And then you also have some kind of deal save, well, partially DLC.",
            "Yes, is that correct, right?",
            "And then you probably also have some way of requiring certain variables to BDL safe, right?",
            "Yeah, well.",
            "If you mean certain way you mean the question, how do you declare that?",
            "Or how do you?",
            "Well, yeah, I mean.",
            "So what is the restriction there?",
            "Yeah alright?",
            "So first part of this can be seen like as this basic language El Extended with this rule version where you need some additional features in the El ROL conjunction is added to L. So that's all the L part.",
            "And in order for this to still work you must require that the rules you have have since 3 shaped bodies.",
            "So you must not have cycles.",
            "And these cycles, however, all the nodes in the tree that you consider only variables.",
            "If you have a constant at some position, it doesn't take part in the graph, you would draw it is.",
            "So if you have a constant, you can make it into two nodes.",
            "If you draw this graph, so to say.",
            "So cycles which go across constants in full body would not count as violating the tree like condition and so the elseif variable sent behave more less like constants instead of behaving like unsafe variables.",
            "And that's where you can.",
            "Raise some of the restrictions, but you still have remaining restrictions on tree shape now.",
            "OK, so does this mean if I treat DLC variables as constants, the rest has to be 3 shape?",
            "That is the Rep.",
            "Essentially, that would be the shapes that you get.",
            "OK, it's still somewhat nontrivial becausw.",
            "Well, you can look at the paper.",
            "We have the transformation in there, it's it's less trivial than one would expect to get from this deal safe extension to the Datalog version simply be cause.",
            "If you just substitute all the DLC variables in all possible ways, grounding them, then you would have a blow up, so you have to first kind of decompose it in a way that works, but you could.",
            "Also you could also add such rules to general our right, not just yell.",
            "Oh yeah, sure sure, sure.",
            "I mean we have.",
            "Yeah yeah, exactly so.",
            "This works again without in general 2, but we focus here on destructible application because it seems also in this conference many people want to have something which works for data which is.",
            "Easy to implement and maybe which still works with alright."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you and well, I'm impressed by someone being able to pronounce my name right?",
                    "label": 0
                },
                {
                    "sent": "So indeed, so this is joint work with.",
                    "label": 0
                },
                {
                    "sent": "Very good.",
                    "label": 0
                },
                {
                    "sent": "This is joint work with Sebastian Rudolph and Pascal Hitzler, all of us from Karlsruhe and we have what do I have to press?",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This one, so what's the?",
                    "label": 0
                },
                {
                    "sent": "What's the purpose of that work, really?",
                    "label": 0
                },
                {
                    "sent": "So where do we want to go to?",
                    "label": 1
                },
                {
                    "sent": "Well, what we set out to do really hear what?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To create a semantic web language in a way that is focused on data as opposed to being focused on schema As for example, LDL is often perceived to be which is also rule oriented.",
                    "label": 1
                },
                {
                    "sent": "If you have a lot of data, it's often very natural to model stuff using rules, right?",
                    "label": 1
                },
                {
                    "sent": "Till we wanted it to be able to express a certain amount of schematic knowledge as well and.",
                    "label": 1
                },
                {
                    "sent": "Maybe beyond those expressive characteristics, it should also, of course be easy to implement because that's something which often hinders the adoption of a language and practice that people have significant difficulties implementing semantics properly, so that should be easy.",
                    "label": 0
                },
                {
                    "sent": "And in this sense it's also clear that it should probably be of polynomial worst case complexity becausw anything which is worse than polynomial certainly is not easy to implement in a very efficient way.",
                    "label": 0
                },
                {
                    "sent": "You have to do very smart optimizations which you can do anyway in this case as well, but.",
                    "label": 0
                },
                {
                    "sent": "Might fill work without them, and last but not least, it should also be compatible with our big cause.",
                    "label": 0
                },
                {
                    "sent": "For one thing, there's a lot of machinery's that you can use on our compatible things, and second, because we can make it that way, and it's certainly no use in wasting that feature if you can get.",
                    "label": 0
                },
                {
                    "sent": "So that's what we really tried to achieve here and.",
                    "label": 0
                },
                {
                    "sent": "In the, in a way, this is also what I'm going to present throughout the talk, but I'm going to ghost.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "By step, I guess, and since I'm not sure here in this session, I don't see so many old faces.",
                    "label": 0
                },
                {
                    "sent": "I guess it's better to start with recalling some basic things about our land description logics, right?",
                    "label": 0
                },
                {
                    "sent": "So no offense meant without face right?",
                    "label": 0
                },
                {
                    "sent": "So I'll let description logics.",
                    "label": 0
                },
                {
                    "sent": "As you know, all of the Web Ontology language.",
                    "label": 0
                },
                {
                    "sent": "It's based on description logics and to users.",
                    "label": 0
                },
                {
                    "sent": "Of course you have to explain that in a very basic way, but.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To academics, it's usually easiest to explain it by saying, well, that's just a fragment of 1st order logic with some equality.",
                    "label": 0
                },
                {
                    "sent": "So semantically we can view our description logics in general like that, and from this perspective, at least, to people who are familiar with first order logic, it doesn't seem all that complicated.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "After all, so this talk is going to be driven by examples mostly, and I'm starting with some very simple modeling.",
                    "label": 0
                },
                {
                    "sent": "I want to do here, which is the sentence Sebastian ordered some Thai Curry and I can say that in all or I use description logic syntax here because my slides are only that big.",
                    "label": 0
                },
                {
                    "sent": "So here's a short description, logic notation sayings that Sebastian the object identified by that string, or that said name here, is belonging to the class of things.",
                    "label": 0
                },
                {
                    "sent": "Which have all that a dish that is a Thai Curry.",
                    "label": 0
                },
                {
                    "sent": "So there is some Thai Curry in first order logic.",
                    "label": 1
                },
                {
                    "sent": "I would say it like that.",
                    "label": 0
                },
                {
                    "sent": "Some Thai Curry X which has been ordered by the best team.",
                    "label": 0
                },
                {
                    "sent": "So that's something I can say and it also shows a particular typical feature of our names that you can have such existential things which often kind of clash with what you have in a rule based implementation of the rule based.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of the world.",
                    "label": 0
                },
                {
                    "sent": "Now another example here is.",
                    "label": 0
                },
                {
                    "sent": "This is actually just arrange axiom saying that everything all it doesn't dish is really a dish.",
                    "label": 1
                },
                {
                    "sent": "So in description logic syntax it looks a little bit confusing like that if you think about it, it really says this in first order logic.",
                    "label": 0
                },
                {
                    "sent": "So whenever X or does a dish, why well why is it?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And finally I have this example here saying that, well, for the sake of the example you will see why this is needed.",
                    "label": 0
                },
                {
                    "sent": "Every Thai Curry dish actually contains peanut oil, and here you have a concrete individual in a class.",
                    "label": 1
                },
                {
                    "sent": "Frame, so to speak.",
                    "label": 0
                },
                {
                    "sent": "A nominal and it says every Thai Curry or the subclass of Thai.",
                    "label": 0
                },
                {
                    "sent": "Curry's is a subclass of things which contain peanut oil, and again in first order logic this becomes a little bit easier.",
                    "label": 0
                },
                {
                    "sent": "Especially you can see here the existential quantification is not really there because you just.",
                    "label": 0
                },
                {
                    "sent": "There is something, and there's something exactly.",
                    "label": 0
                },
                {
                    "sent": "Is this peanut oil so you don't need to quantify here.",
                    "label": 0
                },
                {
                    "sent": "You just say every Thai Curry contains peanut butter.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so these are some examples on description logics and I'll and I'm continuing with my notion of rules here.",
                    "label": 0
                },
                {
                    "sent": "As you know, rules as such are a very very general field and certainly an overloaded term.",
                    "label": 0
                },
                {
                    "sent": "So in this talk I'm going to focus on rules which are still having a first order logic semantics, so non monotonicity for the time being for example.",
                    "label": 0
                },
                {
                    "sent": "And still those rules are pretty handy and useful in applet.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nations and one very simple fragment that comes to mind.",
                    "label": 0
                },
                {
                    "sent": "There is data log, so Datalog is just first order logic horn logic without function symbols essentially of course Datalog can also be endowed with non 1st order semantics, but in the end if you only look at Datalog consequences, it's pretty equivalent and many logical rule languages somehow have Datalog as it's 'cause it's a nice basis to start with.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Again, I'll show you some examples from this domain I have chosen here that allergics dislike not product.",
                    "label": 1
                },
                {
                    "sent": "So here you say whenever X is not allergic and why is it not products and we have since dislikes relationship and already here you can see this wouldn't quite be so easy to model in.",
                    "label": 0
                },
                {
                    "sent": "Alright so in fact this can be done with some feature combinations but for non initiated user it's really hard to come up with a solution for for describing this in and out ontology even though it seems to be a very simple statement.",
                    "label": 0
                },
                {
                    "sent": "If you have a rule language.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here another rule.",
                    "label": 0
                },
                {
                    "sent": "People who order Additionally dislike unhappy, at least in this example.",
                    "label": 1
                },
                {
                    "sent": "So you have here the order dish XY and dislikes XY makes you unhappy.",
                    "label": 0
                },
                {
                    "sent": "A conjunction of properties again.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You cannot do that easily in description logics.",
                    "label": 0
                },
                {
                    "sent": "And then here's a little more complicated rule saying if someone dislikes an ingredient of a dish, she will also discuss.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's a dish.",
                    "label": 0
                },
                {
                    "sent": "OK, finally to complete our example 2 facts, Sebastian is in fact not allergic and peanut oil is really a nut product.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So after this brief introduction into the various formalism, we're dealing with, the obvious question is, can we combine those things to work with them together?",
                    "label": 0
                },
                {
                    "sent": "Does it actually?",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Make sense to say something like this here.",
                    "label": 0
                },
                {
                    "sent": "I have C3 on to logical DL axioms.",
                    "label": 0
                },
                {
                    "sent": "I have these five rules here is it?",
                    "label": 0
                },
                {
                    "sent": "Has it any obvious meaning to say that?",
                    "label": 0
                },
                {
                    "sent": "And of course we know it has been cause of this first.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Logic embedding set both things enjoy and away.",
                    "label": 0
                },
                {
                    "sent": "So if I consider those together, I can still say well in the most general sense, it's always a first order logic theory, and I know what is concluded from those, so it's at least well defined.",
                    "label": 0
                },
                {
                    "sent": "What kind of meaning this would have and if you have been very observant, you will notice that there are some interesting conclusions we could draw across this knowledge base.",
                    "label": 0
                },
                {
                    "sent": "I will come to that later.",
                    "label": 0
                },
                {
                    "sent": "Now this graphic shows that not only both are in first order logic, but in fact they have some.",
                    "label": 0
                },
                {
                    "sent": "Intersection very roughly speaking here, which was called Description Logic program.",
                    "label": 0
                },
                {
                    "sent": "So something which is both Datalog and description logic expressible, and if you look at what.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Description Logic programs can express.",
                    "label": 0
                },
                {
                    "sent": "Looking at our example, you can see well they can express some description, logic, axioms and some basic facts here in the rule side as well, which could be modeled in our List 2, but they cannot express all description logic things because not all of them are in Datalog and they cannot express Datalog rules which are not in description logics.",
                    "label": 0
                },
                {
                    "sent": "So you can only express part of what you would like to say now after if you can do that.",
                    "label": 0
                },
                {
                    "sent": "Of course you can also look at the dual approach and say well.",
                    "label": 0
                },
                {
                    "sent": "Let's just take the Union intuitive.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Speaking of our land Datalog, and this is what has been called Swirl, the Semantic Web rule language in a syntactic variant at least essentially semantic as well.",
                    "label": 0
                },
                {
                    "sent": "You can do both in unrestricted, weighs more or less, so you can have any set of Datalog rules with any out on Dollar Tree and combine the two.",
                    "label": 0
                },
                {
                    "sent": "Now this all seems to be very nice already at models all that we wanted to say here, but unfortunately as.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, I'm sure no this well is undecidable, so it seems that we have modeled a very simple problem here about preferences regarding food and we certainly could draw some conclusions.",
                    "label": 0
                },
                {
                    "sent": "But if we want to implement it as.",
                    "label": 0
                },
                {
                    "sent": "To use as well tool for that that we couldn't even be sure whether the tool would be able to cope with that, because there must be some cases where any small tool is not terminating, because it's it's undecidable and on the other hand it seems to be such an easy problem here, so maybe it's not the right tool after all.",
                    "label": 0
                },
                {
                    "sent": "So the question is what can we do instead of just taking the stupid union or intersection of things, but rather to find a middle ground where we can have some as well but still remain decidable in a way.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And one thing that has been proposed to this end is an approach called DL safe rules.",
                    "label": 0
                },
                {
                    "sent": "And the elseif rules essentially are based on.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Again, very intuitively speaking, the idea to restrict rules Datalog rules to apply only to named individuals.",
                    "label": 1
                },
                {
                    "sent": "Now, why is this restriction after all?",
                    "label": 0
                },
                {
                    "sent": "Well, 'cause if you have an old ontology then there might be something some objects in your semantic domain which must exist which are there but which do not have a name.",
                    "label": 0
                },
                {
                    "sent": "For example, there was this one axiom saying that Sebastian order the Thai Curry, but we don't know what exactly this Thai Curry was and we don't have a constant or individual name or your eye referring to the Thai Curry.",
                    "label": 0
                },
                {
                    "sent": "So we just know there is something and exactly to those things DL safe rules could not be applied DLC.",
                    "label": 0
                },
                {
                    "sent": "Those are restricted to only this finite set of things which you could name explicitly, and this is what makes them decidable.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the end and in our example, we could just say, well, this is still description logic expressible, and then we could add those rules with this restriction of safety sayings that well, they are not really 1st order now in the way I write them, but rather they are restricted to apply to things which are named in this case to apply to the best Jen and peanut oil and nothing else.",
                    "label": 0
                },
                {
                    "sent": "Now this is 1 approach that you can take in order to obtain its decidable subset of swirl and a second somewhat.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To re approach that we have explored recently is called the L Rules.",
                    "label": 0
                },
                {
                    "sent": "So first thing was it safe rules and now we have the our rules and the idea about the arrows really is that these are just the rules that you can express with some.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tricks in description.",
                    "label": 0
                },
                {
                    "sent": "Logics anyway.",
                    "label": 0
                },
                {
                    "sent": "So as I say, it is possible to consider description logic as a fragment of 1st order logic, so naturally you arrive at the question.",
                    "label": 0
                },
                {
                    "sent": "If I am free to use any kind of macros and any kind of additional axioms, which rules in first order logic, could I model indirectly with description logics?",
                    "label": 0
                },
                {
                    "sent": "And it turns out that these are just so description logic rules, and in fact these can be identified as rules which.",
                    "label": 0
                },
                {
                    "sent": "Intuitively speaking again.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Have tree shaped bodies and with this I mean something like that here.",
                    "label": 0
                },
                {
                    "sent": "So here you have if somebody dislikes an ingredient and a dish contains ingredients then he will dislike the dish and you see if you draw the relationships in the body of this rules that yes, this looks very much tree shaped and this is already enough.",
                    "label": 0
                },
                {
                    "sent": "Basically to ensure that this can somehow be encoded in the description logic underlying our tool.",
                    "label": 0
                },
                {
                    "sent": "So in fact there are such rules which seem to be pretty rule like and.",
                    "label": 0
                },
                {
                    "sent": "Very much unlike and still you can kind of encode them in a way in.",
                    "label": 0
                },
                {
                    "sent": "Also, they are actually really reconciled in that language, so these are the rules and well, say complementary elseif rules in that they are applicable to everything, but they are not allowed to have arbitrary shapes.",
                    "label": 0
                },
                {
                    "sent": "So you have DL safe rules that have arbitrary shapes but are only applicable to some things you have DL rules which are applicable to everything but not in arbitrary.",
                    "label": 1
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Shapes and question is can oops yeah.",
                    "label": 0
                },
                {
                    "sent": "So this is just the example again here you see.",
                    "label": 0
                },
                {
                    "sent": "That we can actually also express this rule here.",
                    "label": 0
                },
                {
                    "sent": "It's not really one tree, but two trees of just one root node is.",
                    "label": 0
                },
                {
                    "sent": "You can see just one variable X1Y, and there's no relationship, and I explained that you can express this.",
                    "label": 0
                },
                {
                    "sent": "You cannot express roll conjunction because here you see there are two paths from X to Y.",
                    "label": 0
                },
                {
                    "sent": "So the question.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now obviously, is whether we can combine the two things.",
                    "label": 0
                },
                {
                    "sent": "And of course we can be 'cause the arrows are just another way to write down and out ontology innocence and DL safe rules.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can be combined freely with them, so we could actually do that here.",
                    "label": 0
                },
                {
                    "sent": "Now the question is, if you see that here it seems we have almost achieved all the expressivity we want to have, and if you look at the example you find that there should be some consequences from it, right?",
                    "label": 0
                },
                {
                    "sent": "Sebastian is not allergic and peanut orders are not product, so it's certain that Sebastian dislikes peanut oil.",
                    "label": 0
                },
                {
                    "sent": "Now Sebastian ordered some Thai Curry which must also contain peanut oil and which also must be a dish.",
                    "label": 0
                },
                {
                    "sent": "And so we can conclude that.",
                    "label": 0
                },
                {
                    "sent": "Well, we can conclude that if Sebastian dislikes peanut oil and there's this dish which contains, it sends a bus changes likes also this Thai Curry, but there it stops because now we have a problem we can't explain.",
                    "label": 0
                },
                {
                    "sent": "Apply this safe rule here.",
                    "label": 0
                },
                {
                    "sent": "'cause well, X is probably the bus down who ordered the dish, but there's no name for the dish, so we can't conclude the Boston is unhappy even though we know he ordered a dish that he doesn't like.",
                    "label": 0
                },
                {
                    "sent": "So in fact, even in this case.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We don't get the desired conclusions and what is more, it is still computationally rather expensive in the general case.",
                    "label": 1
                },
                {
                    "sent": "So if we was to consider just an engine which can do deal with the full expressivity of DL safe rules, and there are rules, then we need some very powerful algorithm to do that.",
                    "label": 0
                },
                {
                    "sent": "So the outside rules alone, RX time complete combined complexity here and DL rules are just as complex as the description logic.",
                    "label": 0
                },
                {
                    "sent": "For example next time completed.",
                    "label": 0
                },
                {
                    "sent": "In LDL, and worse, if you go to L2.",
                    "label": 0
                },
                {
                    "sent": "So it seems that it's not quite the right approach and the question is, could we maybe look at this other aspect here if we want to avoid computational?",
                    "label": 0
                },
                {
                    "sent": "Blow up and look for something which is more.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tractable, and indeed again, I'll two offers features here.",
                    "label": 0
                },
                {
                    "sent": "You may have heard of those tractable profiles of our two, which are very restricted sub languages of the whole thing, which are much simpler and disallow many constructs and.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Two of those I want to mention here.",
                    "label": 0
                },
                {
                    "sent": "One is called LRL, which stems from rule language I guess to some extent it is essentially what I described to you as DLP, with additional extensions that come with all two, but essentially it is very much a horn logic fragmente and it's still all representable.",
                    "label": 0
                },
                {
                    "sent": "It doesn't have existentials.",
                    "label": 0
                },
                {
                    "sent": "And then there's our El which includes existentials, but which disallows some things which are in RL.",
                    "label": 1
                },
                {
                    "sent": "For example is no inverses and it's called that way because it's based on this description logic.",
                    "label": 0
                },
                {
                    "sent": "All.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now looking at that, it turns out that most of the description logic axioms we have in our example are already in this tractable fragments, so this looks kind of promising.",
                    "label": 0
                },
                {
                    "sent": "It seems that this could be done handled much simpler than with the full power of an L2.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Even though and well with our RLI get one rule less.",
                    "label": 0
                },
                {
                    "sent": "But as I said, there would also be something small you could do, but not in this.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Example, now that I think about so small fragments, is they also both polynomial time complete so you can implement them with rather simple approaches in still have a practical system which which works on larger scales and since very complex, all systems that could deal with all of it, now you may ask why does the all working group do such two different profiles which are both simpler?",
                    "label": 0
                },
                {
                    "sent": "Why can't they just make one simple profile which maximizes the benefits here but.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course, the reason it sets the problem emerges when you try to combine the two and take all of the features then, well, the thing explodes and and you can essentially model all of our two, which would be in two X time complete.",
                    "label": 0
                },
                {
                    "sent": "So these are kind of maximal ways of getting more expensive ITI which you cannot.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Extent.",
                    "label": 0
                },
                {
                    "sent": "So after this kind of lengthy walks through different features and approaches that have been explored so far, I'm going to very simply explain to you what we did in that paper.",
                    "label": 0
                },
                {
                    "sent": "Namely, we just bought all of that together in a way it's called LP, deriving from DLP and combining it with this El.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Idea dear.",
                    "label": 0
                },
                {
                    "sent": "What it is is essentially this.",
                    "label": 0
                },
                {
                    "sent": "You take description, logic rules, but only for the description logic hourly L. And as I said, they are just as complex as the description logics they use.",
                    "label": 0
                },
                {
                    "sent": "So in this case they would still be polynomial.",
                    "label": 0
                },
                {
                    "sent": "You add conjunctions of roles simply because we can.",
                    "label": 1
                },
                {
                    "sent": "You can also omit those if you like to have something which works completely without 2.",
                    "label": 0
                },
                {
                    "sent": "But, well, we can take some in.",
                    "label": 0
                },
                {
                    "sent": "It doesn't hurt, and we allow the elseif variables.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "I will explain shortly what that really means.",
                    "label": 0
                },
                {
                    "sent": "It's for the moment.",
                    "label": 0
                },
                {
                    "sent": "Just imagine we allow some DL safe rules, because as I said, the elseif rules as such are already exptime complete, so it would be no longer attractable fragmente if we even allow all of them.",
                    "label": 0
                },
                {
                    "sent": "So there must be some restriction.",
                    "label": 0
                },
                {
                    "sent": "And we throw all of that together and quality LP and give it a rule based syntax in the paper.",
                    "label": 0
                },
                {
                    "sent": "But you could also give it a description logic based syntax if you prefer.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, theorem inferencing in this.",
                    "label": 0
                },
                {
                    "sent": "Logic is P time complete, so that was certainly something we wanted.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Achievement when creating it now as you see in the example, all of it.",
                    "label": 0
                },
                {
                    "sent": "Well surprisingly, I mean I wouldn't have chosen this example otherwise, but now this.",
                    "label": 0
                },
                {
                    "sent": "In this case you see that all of the features that were not available fully or only partial in other things are now kind of available.",
                    "label": 0
                },
                {
                    "sent": "You see here that there are still see small locks and this is what I mean with a DL safe variable.",
                    "label": 0
                },
                {
                    "sent": "Now I say well in general the rule applies to everything but this variable Z here.",
                    "label": 0
                },
                {
                    "sent": "Is restricted to apply only to named individuals, so I do not longer say all the variables in the rule have to have this restriction, but I can say only this one variable must have this restriction, otherwise it won't work anymore.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Well, I should probably tell you now how this reasoning works in this particular case.",
                    "label": 0
                },
                {
                    "sent": "I already explained before that we can derive a lot about Sebastian here, for example, that he dislikes this peanut oil, and he ordered this dish and now it comes to applying this rule here.",
                    "label": 0
                },
                {
                    "sent": "And we know that the bus scientist likes peanut oil and there is this Thai Curry which we don't know a name for.",
                    "label": 0
                },
                {
                    "sent": "And this Thai Curry contains peanut oil.",
                    "label": 0
                },
                {
                    "sent": "And since peanut oil is a named variable, we can actually apply it.",
                    "label": 0
                },
                {
                    "sent": "And we obtain that Sebastian dislike the Unamed Thai Curry.",
                    "label": 0
                },
                {
                    "sent": "And though because of this rule also being fully applicable due to sequence junctions, the role conjunctions that I mentioned, we can really conclude in the end.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This example sets of Austin is unhappy which see kind of purpose offset.",
                    "label": 0
                },
                {
                    "sent": "OK, so you see that it works together and it's all still in there.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Polynomial fragmente cool.",
                    "label": 0
                },
                {
                    "sent": "Now an important note here is that.",
                    "label": 0
                },
                {
                    "sent": "Yelp Ian away supports influencing both in L&NRL as I mentioned.",
                    "label": 0
                },
                {
                    "sent": "Well, how can that be all NRL combined are blowing up so there is much more complexity there, but still, what you can do is you can support all of our emails that is just included in the language and for SRL becausw of our being a language without existential quantifiers.",
                    "label": 0
                },
                {
                    "sent": "See consequences that you can draw from all our L. Actually only referring to named individuals.",
                    "label": 0
                },
                {
                    "sent": "So when you take an LRL knowledge base.",
                    "label": 0
                },
                {
                    "sent": "And you.",
                    "label": 0
                },
                {
                    "sent": "Postulate that all of the variables occurring in the rule version of it are safe.",
                    "label": 0
                },
                {
                    "sent": "You still get the consequences that you would have obtained from the oil knowledge base, so you can assume our our parts to be safe and our El parts to be unsafe.",
                    "label": 0
                },
                {
                    "sent": "General rules here.",
                    "label": 0
                },
                {
                    "sent": "Of course, when you do that, you do no longer get all of the consequences in the conclusion.",
                    "label": 0
                },
                {
                    "sent": "If you wanted to have all it would be N 2X time completes.",
                    "label": 0
                },
                {
                    "sent": "That would be a different story, but at least you get some of them.",
                    "label": 0
                },
                {
                    "sent": "And my example just shows that it.",
                    "label": 0
                },
                {
                    "sent": "Can really give a meaningful.",
                    "label": 0
                },
                {
                    "sent": "There can be a meaningful interaction between both worlds which you wouldn't have got in a separate approach where you kind of have a more shallow interface.",
                    "label": 0
                },
                {
                    "sent": "So in a way anyone who builds an ELP reason I would also have a reason for those two fragments at least.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "Here's a slight variation of this.",
                    "label": 0
                },
                {
                    "sent": "Which says Thai Curry's contain not just peanut oil, but some fish product.",
                    "label": 0
                },
                {
                    "sent": "And Marcus ordered such a Thai Curry and vegetarians don't like fish products and Marcus is ineffective, vegetarian and now the situation is slightly different.",
                    "label": 0
                },
                {
                    "sent": "Now I know there is some fish product but I don't know which one and in this case the rule no longer can be applied because see now would have to represent this fish product and that's really the difference where we lose conclusions as opposed to just combining our land.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, so that's for you to understand a little bit intuitively where the restrictions are.",
                    "label": 0
                },
                {
                    "sent": "There are still cases where we won't get all first order logic conclusions from the knowledge base, so unhappy markets cannot be concluded.",
                    "label": 1
                },
                {
                    "sent": "Even though Markus himself might be a fit.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Logic, reason and so he can conclude set himself.",
                    "label": 0
                },
                {
                    "sent": "Now towards implementation.",
                    "label": 0
                },
                {
                    "sent": "I mentioned whoever has such a reason I had support for all of the old profiles, which would be nice.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So how hard is that?",
                    "label": 0
                },
                {
                    "sent": "Well, theorem inferencing and LP can be reduced in linear time to inferencing in three variable data log.",
                    "label": 1
                },
                {
                    "sent": "So that's very nice.",
                    "label": 0
                },
                {
                    "sent": "You have a Datalog engine and you can just take this ERP and you can even take start off with an hour ontology which represents an early lol part and you can apply.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is that linear time transformation and what this gives you is, well, first of all, the transformation is very easy to do because it's a completely syntactic thing.",
                    "label": 0
                },
                {
                    "sent": "You take one axiom at a time, you transform it a little bit and it gives you a set of Datalog rules and.",
                    "label": 0
                },
                {
                    "sent": "Then you can use the Datalog engine as a back black box, and you can even do both instance checking and subsumption based on this Datalog program in polynomial time, because it's three variable data log, it's a polynomial algorithms that you need.",
                    "label": 0
                },
                {
                    "sent": "So OK, so this basically finished.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "My talk and summing up, I can just say well there is this LP which is a DL based tractable rule language that we described.",
                    "label": 1
                },
                {
                    "sent": "You confuse few it as a subset of data lock with extended with existentials or you can view it as a subset of our two extended.",
                    "label": 0
                },
                {
                    "sent": "With this role conjunctions, it's almost completely expressible in L2, so you could use our two syntax to communicate if you like.",
                    "label": 1
                },
                {
                    "sent": "It supports both of those profiles, and there's a third similar profile which could also be treated.",
                    "label": 0
                },
                {
                    "sent": "This linear time conversion, which is very nice for implementers who already have a rule engine and we want to Add all support on top of it.",
                    "label": 0
                },
                {
                    "sent": "OK, so thank you very much.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So you have L plus plus and then if I understood you have rules from Eureka Paper I assume.",
                    "label": 0
                },
                {
                    "sent": "And then you also have some kind of deal save, well, partially DLC.",
                    "label": 0
                },
                {
                    "sent": "Yes, is that correct, right?",
                    "label": 0
                },
                {
                    "sent": "And then you probably also have some way of requiring certain variables to BDL safe, right?",
                    "label": 0
                },
                {
                    "sent": "Yeah, well.",
                    "label": 0
                },
                {
                    "sent": "If you mean certain way you mean the question, how do you declare that?",
                    "label": 0
                },
                {
                    "sent": "Or how do you?",
                    "label": 0
                },
                {
                    "sent": "Well, yeah, I mean.",
                    "label": 0
                },
                {
                    "sent": "So what is the restriction there?",
                    "label": 0
                },
                {
                    "sent": "Yeah alright?",
                    "label": 0
                },
                {
                    "sent": "So first part of this can be seen like as this basic language El Extended with this rule version where you need some additional features in the El ROL conjunction is added to L. So that's all the L part.",
                    "label": 0
                },
                {
                    "sent": "And in order for this to still work you must require that the rules you have have since 3 shaped bodies.",
                    "label": 0
                },
                {
                    "sent": "So you must not have cycles.",
                    "label": 0
                },
                {
                    "sent": "And these cycles, however, all the nodes in the tree that you consider only variables.",
                    "label": 0
                },
                {
                    "sent": "If you have a constant at some position, it doesn't take part in the graph, you would draw it is.",
                    "label": 0
                },
                {
                    "sent": "So if you have a constant, you can make it into two nodes.",
                    "label": 0
                },
                {
                    "sent": "If you draw this graph, so to say.",
                    "label": 0
                },
                {
                    "sent": "So cycles which go across constants in full body would not count as violating the tree like condition and so the elseif variable sent behave more less like constants instead of behaving like unsafe variables.",
                    "label": 0
                },
                {
                    "sent": "And that's where you can.",
                    "label": 0
                },
                {
                    "sent": "Raise some of the restrictions, but you still have remaining restrictions on tree shape now.",
                    "label": 0
                },
                {
                    "sent": "OK, so does this mean if I treat DLC variables as constants, the rest has to be 3 shape?",
                    "label": 0
                },
                {
                    "sent": "That is the Rep.",
                    "label": 0
                },
                {
                    "sent": "Essentially, that would be the shapes that you get.",
                    "label": 0
                },
                {
                    "sent": "OK, it's still somewhat nontrivial becausw.",
                    "label": 0
                },
                {
                    "sent": "Well, you can look at the paper.",
                    "label": 0
                },
                {
                    "sent": "We have the transformation in there, it's it's less trivial than one would expect to get from this deal safe extension to the Datalog version simply be cause.",
                    "label": 0
                },
                {
                    "sent": "If you just substitute all the DLC variables in all possible ways, grounding them, then you would have a blow up, so you have to first kind of decompose it in a way that works, but you could.",
                    "label": 0
                },
                {
                    "sent": "Also you could also add such rules to general our right, not just yell.",
                    "label": 0
                },
                {
                    "sent": "Oh yeah, sure sure, sure.",
                    "label": 0
                },
                {
                    "sent": "I mean we have.",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah, exactly so.",
                    "label": 0
                },
                {
                    "sent": "This works again without in general 2, but we focus here on destructible application because it seems also in this conference many people want to have something which works for data which is.",
                    "label": 0
                },
                {
                    "sent": "Easy to implement and maybe which still works with alright.",
                    "label": 0
                }
            ]
        }
    }
}