{
    "id": "gxpmniswj4g3vik6hp6twm2n6dgqjycv",
    "title": "Natural Language Processing to the Rescue? Extracting \"Situational Awareness\" Tweets during Mass Emergency",
    "info": {
        "author": [
            "Sudha Verma, Department of Computer Science, University of Colorado Boulder"
        ],
        "published": "Aug. 18, 2011",
        "recorded": "July 2011",
        "category": [
            "Top->Computer Science->Natural Language Processing"
        ]
    },
    "url": "http://videolectures.net/icwsm2011_verma_awareness/",
    "segmentation": [
        [
            "Hi I'm Suda Verma anima, PhD student at University of Colorado Boulder and today I'll be presenting the work that I did with Sarah viewing and will Kobe along with Laser Palin, Jim Martin, Martha Palmer, Aaron Shriman, Ken Anderson."
        ],
        [
            "So Twitter has become a popular tool used during emergencies.",
            "It's readily available.",
            "It provides near real time information and it's well integrated with cell phones and provides.",
            "Broadcasting abilities so that makes it very useful during emergency."
        ],
        [
            "It's been playing a significant role during emergencies.",
            "As an example, last year in San Bruno, CA, there was a huge explosion, followed by fires and flames that reached about 200, three 100 feet high.",
            "So immediately following that explosion there was a lot of confusion on what was the cause of explosion, whether it was an earthquake, whether it was an airline crash or a terrorist attack.",
            "So Craig, when Craig Fugate, who is the head of US Federal Emergency Management Agency.",
            "Heard about the explosion.",
            "He logged on to Twitter and looked at the tweets that were coming from that area to determine how big of an impact it was.",
            "An get a preliminary picture of the event.",
            "So ultimately, the explosion was actually tracked to a gas line and after the incident when Craig Fugate.",
            "So after the explosion when Craig Fugate was interviewed, he said that he got better situational awareness from Twitter an.",
            "He got better, a better picture of the event and faster information more than he when he went.",
            "Got the official word."
        ],
        [
            "So Craig Fugate mentioned all situational awareness.",
            "What is situational awareness?",
            "It's a state of understanding the big picture in time and safety critical situation.",
            "So one can assess the situation and determine what action to take an in terms of Twitter Annemasse emergencies.",
            "This means information that can help people form a picture of the event.",
            "For example what roads are closed, what areas are being evacuated?",
            "How far is the fire damage and so forth?"
        ],
        [
            "So there's a lot of lots of tweets that come across Twitter doing during emergencies, and some of these are tactical and actionable in nature.",
            "For example, here I have a tweet that we collected from Red River floods and is talking about the Red River at Fargo North.",
            "North Dakota is at 30, three point 15 feet.",
            "So this tweet is actionable for the people that are impacted by the floods.",
            "And there are other types of messages that come across Twitter during emergencies as well.",
            "And as an example, you have the empathetic and supportive messages, so these messages are important as well.",
            "'cause they help build a sense of.",
            "Community, but they don't necessarily provide actionable information.",
            "So here I have an example tweet that's talking about thinking of everyone working so hard to hold back the Red River, so it's it's providing sympathies to the people who are impacted and thinking, you know, the workers that are helping."
        ],
        [
            "So in our research we were interested in tweets with actionable information and more particularly, we are interested in tweets with information contributing to situational awareness and the questions that we explore are can these tweets be categorized automatically?"
        ],
        [
            "Are there good linguistic indicators for detecting the tweets?"
        ],
        [
            "And can automatic classification scale across different events?"
        ],
        [
            "So as we did some qualitative analysis of the tweets that we had collected over various crisis events, we formed the hypothesis that during disasters, tweets written in objective language, with formal and impersonal styles are typically used to convey tactical information."
        ],
        [
            "So that hypothesis in mind, goals of our research were to identify the linguistic features that can aid in locating tweets with information contributing to situational awareness and those tweets we call essay tweets and ultimately we want to be able to classify the essay tweets automatically."
        ],
        [
            "And the approach we took so far first step was to collect the data from various crisis events."
        ],
        [
            "And then annotate the data for situational awareness as well as key linguistic feature."
        ],
        [
            "Race.",
            "And then we build a supervised classifier to classify tweets that contribute to situational awareness."
        ],
        [
            "And ultimately, we evaluate our results.",
            "So in the next set of slides, I'll walk through each one of these steps in more detail."
        ],
        [
            "So our first step was to collect the data.",
            "And we collected data from Twitter using our in-house cloud data collection architecture and we collected from 4 different events to get to get the breadth of different types of emergencies that occur.",
            "So our first one was from Red River floods of 2009 and 10 and then Oklahoma fires of 2009 and the Haiti earthquake of 2010."
        ],
        [
            "So the first set of data that we collected came from Red River floods and right over is one of the few rivers in North America that flows North from US to Canada.",
            "So every spring the southern part in the US, the ice, tends to melt and the water backs up on the Canada side.",
            "So pretty much every spring some of these regions tend to be on a seasonal flu flood alert, and in 2009 there was record flooding.",
            "In 2010 there was also moderate flood."
        ],
        [
            "Our next data set came from Oklahoma fires of 2009 and these fires happen April 9th and 10th of 2009.",
            "An impacted.",
            "Central and southern Oklahoma of US, and because when the after the fire started, the weather was a little unpredictable, so there was a lot of tweeting about what areas would get evacuated and how far the fire was."
        ],
        [
            "And then our last data set came from the Haiti earthquake, which you probably remember any current January of last year and caused a lot of casualties and damage, and generated a large international response."
        ],
        [
            "So now we've collected the data from different events.",
            "Our next step was to annotate data and for annotation we selected a set of 500 tweets.",
            "Per event and we annotated those tweets by two annotators in dependently for contribution to situational awareness and whether or not tweets were subjective or objective in nature.",
            "Whether they were written in informal or formal style, or whether they were personal or impersonal."
        ],
        [
            "So a tweet was so the first annotation was on situational awareness.",
            "The tweet was annotated as an essay tweet.",
            "If it had information that can be used to gauge the situation.",
            "An informed decision making processes.",
            "So here I have an example tweet collected from Haiti, Haiti rent an it's talking bout team of doctors leaving for Knoxville for Haiti on a certain date and needing certain donations and supplies.",
            "So this tweet is definitely actionable in nature.",
            "And he gets labeled as a SA tweet."
        ],
        [
            "On the other hand, I tweet that did not provide any actionable information, was labeled as an non SA tweet.",
            "So as an example, here's a tweet that's talking about Haiti earthquake as well, but it's inaccurate and non actionable."
        ],
        [
            "So now that I've annotated for situational awareness, I'm going to annotate for the linguistic features that we think contribute to essay.",
            "So first, linguistic feature that we looked into was subjectivity and a tweet was subjective if it contained opinion words or conveyed sentiment.",
            "So have a tweet here that's from Oklahoma fires and is talking about what are they crazy fires so many people without homes so it's got some sentiment bearing words and it gets labeled as subjective tweet."
        ],
        [
            "Now the other hand, tweet is an objective tweet.",
            "If it contained factual information and did not express opinion.",
            "Come as an example.",
            "Here's a tweet also from Oklahoma fires, and it's talking about the gas line that's on fire is 15th and Anderson Road, so here, this tweet does not have any opinion words, so it gets labeled as objective tweet."
        ],
        [
            "So now I've annotated for situational awareness and subjectivity.",
            "Next thing I annotated for was register.",
            "So a tweet was labeled as a formal tweet.",
            "If it was grammatically clear and it expressed complete thoughts.",
            "As an example, we have a tweet from Haiti earthquake and it's talking about.",
            "It's got complete sentences like Parliament has collapsed, tax offices collapsed, so this one gets labeled as a formal tweet."
        ],
        [
            "Whereas an informal tweet contained fragments anet lack context and tended to have grammatical errors, so some showing an example also from the Haiti earthquake, where it's obviously has sentence fragments."
        ],
        [
            "So now over for the linguistic features I've annotated for subjectivity formal register.",
            "The last linguistic feature that I looked at that we looked at was style, and a tweet was labeled as a personal tweet.",
            "If the author injected him or herself into the situation.",
            "So as an example, we have a tweet here.",
            "From the Red River floods and the author is talking about relaxing after a whole day of sandbagging and being exhausted.",
            "So since they're injecting themselves into the situation, the tweet gets labeled as a personal tweet."
        ],
        [
            "And on the other hand, an impersonal tweet displayed emotional distance from the event.",
            "As an example, there's a tweet from the Red River floods as well, and it's talking about just the water levels, and there's no mention of the author."
        ],
        [
            "So now we've collected the data.",
            "We have energy to the data and the next step is to classify.",
            "So from classification POV, we're in the questions that we're interested in are can the essay tweets be categorized automatically?",
            "Can linguistic features that Co occur with essay tweets be classified and do these additional linguistic feature help improve classification of essay tweets?"
        ],
        [
            "So for the for classification, the technique we used, we used naive Bayes and maximum entropy, and we use the mallet implementation.",
            "We've tenfold cross validation with 90% of the data for training and 10% for testing an.",
            "For our accuracy, we took the average accuracy over 10 runs for each event."
        ],
        [
            "So far, training data we had roughly about 500 tweets per event and that's about 2000 tweets in total."
        ],
        [
            "And this is a picture that's showing.",
            "Just that overall classification process.",
            "So we had a tweet that comes in.",
            "And then we extract simple features from that tweet.",
            "For example, we extract and grants and do part of speech tagging on the tweet and then it goes through a pipeline of linguistic classifiers at the bottom, and those classifiers predict the linguistic tag for that tweet and all those become input features into the situational awareness classifier on the right hand side."
        ],
        [
            "So, so we have an input tweetin.",
            "Our first step was to extract the simple features for extracting the simple feature.",
            "We preprocess a tweet.",
            "First, we normalize it and take out the Twitter symbols in the URLs for example.",
            "Then we stem the tweet and tokenize it.",
            "And once we've done that, we extract unigrams and their frequency and bigrams and their frequency.",
            "Then we also use the standard part of speech tagger to part of speech.",
            "Tag the tweets."
        ],
        [
            "So now we have our simple features and then that week goes to a pipeline of classifiers and the subjectivity classifier, for example predicts whether a tweet is subjective or objective.",
            "So then we have a.",
            "We have that as input feature and the register classifier is predicting whether it's formal or informal and the style classifier is predicting whether it's written in personal or impersonal style."
        ],
        [
            "So now we have a classification model.",
            "Next step is to look at our results.",
            "So the first question that we asked ourselves in our goals was Ken essay tweets.",
            "Be categorized automatically."
        ],
        [
            "And here's a slide that's showing the results.",
            "That's basically the accuracy and divided on prevent basis of applying naive Bayes and maximum entropy.",
            "So the Gray bar is our baseline for that event.",
            "With baseline is the most popular guests and the Orange Bar is the results of applying naive Bayes and the Blue Bar is are the results of applying maximum entropy.",
            "So, um.",
            "As you can see that the maximum entropy gave us pretty much good results throughout each event and we reach about accuracy of about 87% when we used all features with Maxent."
        ],
        [
            "So now we know that.",
            "Yes, we can classify the essay tweets automatically.",
            "Next question that we were interested in is are the linguistic indicators that we identified useful for detecting essay tweets?",
            "And in order to evaluate that, we created a balanced data set of essay 500 essay tweets and 500 non essay tweets across all events."
        ],
        [
            "And then we looked at the result of each feature independently.",
            "So in this picture, the baseline is actually 50% 'cause we're starting out with a balanced data set and just by using unigrams alone for classification of essay tweet, we reach about roughly 78% accuracy, and that's that.",
            "Makes some intuitive sense, 'cause when doing emergencies when people are talking about actionable or tactical.",
            "Information a certain vocabulary emerges.",
            "For example, when I'm talking about floods, the actionable information tends to have tends to talk about water levels, rivers, so there's a certain vocabulary.",
            "And then there's also a certain vocabulary around emergencies like evacuation and road closures, so the unigrams.",
            "Do contribute pretty well.",
            "To the."
        ],
        [
            "All is off.",
            "And then the next thing we did was we applied by grams to the problem with bigrams we saw some improvement on the balanced data set, but nothing significant.",
            "Which makes sense 'cause the pair words tend not to be that frequent tweets 'cause they're short."
        ],
        [
            "And then we applied part of speech tags to the tweet and part of speech tag actually boosted our accuracy quite a bit.",
            "And that also makes sense, 'cause the way the language is formed.",
            "It does tend to, you know, does tend to sort out whether the information is tactical or non technical in nature."
        ],
        [
            "Then we the applied subjectivity an that improved or unigrams, but not quite as much as part of speech and for some."
        ],
        [
            "Activity we also looked into applying opinion Finder, which is done by University of Pittsburgh and it's just it's based on contextual and lexical analysis to predict subjectivity.",
            "So that was tempting.",
            "'cause then you don't have to annotate your own data.",
            "And opinion Finder tended not to perform as well as our own classifier that was trained on tweets."
        ],
        [
            "And here are the results from applying.",
            "Looking at the register alone."
        ],
        [
            "And then the style.",
            "And then when you put all these features to go together, the simple features as well as the linguistic feed."
        ],
        [
            "Others.",
            "Our performance goes up quite a bit."
        ],
        [
            "So, so those were the results in the balanced data set and then the last question that we were interested in looking into was whole.",
            "Well, do these feature perform across various types of events?"
        ],
        [
            "So this is the graph that we looked at on the balanced data set and."
        ],
        [
            "Then we applied basically the same analysis to all events.",
            "And the blue graph or the blue bar is the result of applying maximum entropy over the different events.",
            "And as you can see in Haiti, for example, it made quite a bit of difference when we went from unigrams to applying all all the linguistic features, whereas in Red River Nine or ten, I would rather wear 10.",
            "It didn't make that much of a difference.",
            "Unigrams perform just as well, and that makes some sense when you look at the different types of emergencies that we're looking into.",
            "So Haiti generated a lot of Twitter traffic and there was a large signal to noise ratio.",
            "So in those cases of complex analysis with the linguistic features helped, whereas in Red River 9 in 2009 there was record flooding.",
            "An in 2010 there was just moderate amount of flooding with no casualties.",
            "So so in 2010 as a reaction to 2009 event, there were lots of warnings.",
            "So pretty much all the tweets that were coming out or tended to be tactical and actionable in nature and only the small portion of the people that were in Red River were tweeting about the event."
        ],
        [
            "So in conclusion, our results in classification of essay tweets are promising and we've shown that essay tweets can be classified automatically with good accuracy.",
            "And this can be very useful to the emergency workers and to the general public to sort through information and get to the tactical and actionable stuff fast during an emergency."
        ],
        [
            "And this project is one of the little smaller projects under bigger picture on emergency, an information research that's going on in University of Colorado.",
            "And to get more information and say I pick.cs.colorado.edu now thanks for your attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hi I'm Suda Verma anima, PhD student at University of Colorado Boulder and today I'll be presenting the work that I did with Sarah viewing and will Kobe along with Laser Palin, Jim Martin, Martha Palmer, Aaron Shriman, Ken Anderson.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So Twitter has become a popular tool used during emergencies.",
                    "label": 1
                },
                {
                    "sent": "It's readily available.",
                    "label": 0
                },
                {
                    "sent": "It provides near real time information and it's well integrated with cell phones and provides.",
                    "label": 0
                },
                {
                    "sent": "Broadcasting abilities so that makes it very useful during emergency.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's been playing a significant role during emergencies.",
                    "label": 0
                },
                {
                    "sent": "As an example, last year in San Bruno, CA, there was a huge explosion, followed by fires and flames that reached about 200, three 100 feet high.",
                    "label": 0
                },
                {
                    "sent": "So immediately following that explosion there was a lot of confusion on what was the cause of explosion, whether it was an earthquake, whether it was an airline crash or a terrorist attack.",
                    "label": 0
                },
                {
                    "sent": "So Craig, when Craig Fugate, who is the head of US Federal Emergency Management Agency.",
                    "label": 0
                },
                {
                    "sent": "Heard about the explosion.",
                    "label": 0
                },
                {
                    "sent": "He logged on to Twitter and looked at the tweets that were coming from that area to determine how big of an impact it was.",
                    "label": 0
                },
                {
                    "sent": "An get a preliminary picture of the event.",
                    "label": 0
                },
                {
                    "sent": "So ultimately, the explosion was actually tracked to a gas line and after the incident when Craig Fugate.",
                    "label": 0
                },
                {
                    "sent": "So after the explosion when Craig Fugate was interviewed, he said that he got better situational awareness from Twitter an.",
                    "label": 1
                },
                {
                    "sent": "He got better, a better picture of the event and faster information more than he when he went.",
                    "label": 0
                },
                {
                    "sent": "Got the official word.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So Craig Fugate mentioned all situational awareness.",
                    "label": 0
                },
                {
                    "sent": "What is situational awareness?",
                    "label": 0
                },
                {
                    "sent": "It's a state of understanding the big picture in time and safety critical situation.",
                    "label": 1
                },
                {
                    "sent": "So one can assess the situation and determine what action to take an in terms of Twitter Annemasse emergencies.",
                    "label": 1
                },
                {
                    "sent": "This means information that can help people form a picture of the event.",
                    "label": 0
                },
                {
                    "sent": "For example what roads are closed, what areas are being evacuated?",
                    "label": 0
                },
                {
                    "sent": "How far is the fire damage and so forth?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So there's a lot of lots of tweets that come across Twitter doing during emergencies, and some of these are tactical and actionable in nature.",
                    "label": 0
                },
                {
                    "sent": "For example, here I have a tweet that we collected from Red River floods and is talking about the Red River at Fargo North.",
                    "label": 1
                },
                {
                    "sent": "North Dakota is at 30, three point 15 feet.",
                    "label": 0
                },
                {
                    "sent": "So this tweet is actionable for the people that are impacted by the floods.",
                    "label": 0
                },
                {
                    "sent": "And there are other types of messages that come across Twitter during emergencies as well.",
                    "label": 0
                },
                {
                    "sent": "And as an example, you have the empathetic and supportive messages, so these messages are important as well.",
                    "label": 0
                },
                {
                    "sent": "'cause they help build a sense of.",
                    "label": 0
                },
                {
                    "sent": "Community, but they don't necessarily provide actionable information.",
                    "label": 0
                },
                {
                    "sent": "So here I have an example tweet that's talking about thinking of everyone working so hard to hold back the Red River, so it's it's providing sympathies to the people who are impacted and thinking, you know, the workers that are helping.",
                    "label": 1
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in our research we were interested in tweets with actionable information and more particularly, we are interested in tweets with information contributing to situational awareness and the questions that we explore are can these tweets be categorized automatically?",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are there good linguistic indicators for detecting the tweets?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And can automatic classification scale across different events?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So as we did some qualitative analysis of the tweets that we had collected over various crisis events, we formed the hypothesis that during disasters, tweets written in objective language, with formal and impersonal styles are typically used to convey tactical information.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that hypothesis in mind, goals of our research were to identify the linguistic features that can aid in locating tweets with information contributing to situational awareness and those tweets we call essay tweets and ultimately we want to be able to classify the essay tweets automatically.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the approach we took so far first step was to collect the data from various crisis events.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then annotate the data for situational awareness as well as key linguistic feature.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Race.",
                    "label": 0
                },
                {
                    "sent": "And then we build a supervised classifier to classify tweets that contribute to situational awareness.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And ultimately, we evaluate our results.",
                    "label": 0
                },
                {
                    "sent": "So in the next set of slides, I'll walk through each one of these steps in more detail.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So our first step was to collect the data.",
                    "label": 0
                },
                {
                    "sent": "And we collected data from Twitter using our in-house cloud data collection architecture and we collected from 4 different events to get to get the breadth of different types of emergencies that occur.",
                    "label": 0
                },
                {
                    "sent": "So our first one was from Red River floods of 2009 and 10 and then Oklahoma fires of 2009 and the Haiti earthquake of 2010.",
                    "label": 1
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the first set of data that we collected came from Red River floods and right over is one of the few rivers in North America that flows North from US to Canada.",
                    "label": 1
                },
                {
                    "sent": "So every spring the southern part in the US, the ice, tends to melt and the water backs up on the Canada side.",
                    "label": 0
                },
                {
                    "sent": "So pretty much every spring some of these regions tend to be on a seasonal flu flood alert, and in 2009 there was record flooding.",
                    "label": 0
                },
                {
                    "sent": "In 2010 there was also moderate flood.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our next data set came from Oklahoma fires of 2009 and these fires happen April 9th and 10th of 2009.",
                    "label": 1
                },
                {
                    "sent": "An impacted.",
                    "label": 0
                },
                {
                    "sent": "Central and southern Oklahoma of US, and because when the after the fire started, the weather was a little unpredictable, so there was a lot of tweeting about what areas would get evacuated and how far the fire was.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then our last data set came from the Haiti earthquake, which you probably remember any current January of last year and caused a lot of casualties and damage, and generated a large international response.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now we've collected the data from different events.",
                    "label": 0
                },
                {
                    "sent": "Our next step was to annotate data and for annotation we selected a set of 500 tweets.",
                    "label": 1
                },
                {
                    "sent": "Per event and we annotated those tweets by two annotators in dependently for contribution to situational awareness and whether or not tweets were subjective or objective in nature.",
                    "label": 1
                },
                {
                    "sent": "Whether they were written in informal or formal style, or whether they were personal or impersonal.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So a tweet was so the first annotation was on situational awareness.",
                    "label": 0
                },
                {
                    "sent": "The tweet was annotated as an essay tweet.",
                    "label": 0
                },
                {
                    "sent": "If it had information that can be used to gauge the situation.",
                    "label": 1
                },
                {
                    "sent": "An informed decision making processes.",
                    "label": 0
                },
                {
                    "sent": "So here I have an example tweet collected from Haiti, Haiti rent an it's talking bout team of doctors leaving for Knoxville for Haiti on a certain date and needing certain donations and supplies.",
                    "label": 0
                },
                {
                    "sent": "So this tweet is definitely actionable in nature.",
                    "label": 1
                },
                {
                    "sent": "And he gets labeled as a SA tweet.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the other hand, I tweet that did not provide any actionable information, was labeled as an non SA tweet.",
                    "label": 0
                },
                {
                    "sent": "So as an example, here's a tweet that's talking about Haiti earthquake as well, but it's inaccurate and non actionable.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now that I've annotated for situational awareness, I'm going to annotate for the linguistic features that we think contribute to essay.",
                    "label": 0
                },
                {
                    "sent": "So first, linguistic feature that we looked into was subjectivity and a tweet was subjective if it contained opinion words or conveyed sentiment.",
                    "label": 0
                },
                {
                    "sent": "So have a tweet here that's from Oklahoma fires and is talking about what are they crazy fires so many people without homes so it's got some sentiment bearing words and it gets labeled as subjective tweet.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now the other hand, tweet is an objective tweet.",
                    "label": 0
                },
                {
                    "sent": "If it contained factual information and did not express opinion.",
                    "label": 1
                },
                {
                    "sent": "Come as an example.",
                    "label": 0
                },
                {
                    "sent": "Here's a tweet also from Oklahoma fires, and it's talking about the gas line that's on fire is 15th and Anderson Road, so here, this tweet does not have any opinion words, so it gets labeled as objective tweet.",
                    "label": 1
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now I've annotated for situational awareness and subjectivity.",
                    "label": 0
                },
                {
                    "sent": "Next thing I annotated for was register.",
                    "label": 0
                },
                {
                    "sent": "So a tweet was labeled as a formal tweet.",
                    "label": 0
                },
                {
                    "sent": "If it was grammatically clear and it expressed complete thoughts.",
                    "label": 0
                },
                {
                    "sent": "As an example, we have a tweet from Haiti earthquake and it's talking about.",
                    "label": 0
                },
                {
                    "sent": "It's got complete sentences like Parliament has collapsed, tax offices collapsed, so this one gets labeled as a formal tweet.",
                    "label": 1
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Whereas an informal tweet contained fragments anet lack context and tended to have grammatical errors, so some showing an example also from the Haiti earthquake, where it's obviously has sentence fragments.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now over for the linguistic features I've annotated for subjectivity formal register.",
                    "label": 0
                },
                {
                    "sent": "The last linguistic feature that I looked at that we looked at was style, and a tweet was labeled as a personal tweet.",
                    "label": 0
                },
                {
                    "sent": "If the author injected him or herself into the situation.",
                    "label": 1
                },
                {
                    "sent": "So as an example, we have a tweet here.",
                    "label": 1
                },
                {
                    "sent": "From the Red River floods and the author is talking about relaxing after a whole day of sandbagging and being exhausted.",
                    "label": 0
                },
                {
                    "sent": "So since they're injecting themselves into the situation, the tweet gets labeled as a personal tweet.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And on the other hand, an impersonal tweet displayed emotional distance from the event.",
                    "label": 0
                },
                {
                    "sent": "As an example, there's a tweet from the Red River floods as well, and it's talking about just the water levels, and there's no mention of the author.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now we've collected the data.",
                    "label": 0
                },
                {
                    "sent": "We have energy to the data and the next step is to classify.",
                    "label": 0
                },
                {
                    "sent": "So from classification POV, we're in the questions that we're interested in are can the essay tweets be categorized automatically?",
                    "label": 0
                },
                {
                    "sent": "Can linguistic features that Co occur with essay tweets be classified and do these additional linguistic feature help improve classification of essay tweets?",
                    "label": 1
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for the for classification, the technique we used, we used naive Bayes and maximum entropy, and we use the mallet implementation.",
                    "label": 0
                },
                {
                    "sent": "We've tenfold cross validation with 90% of the data for training and 10% for testing an.",
                    "label": 1
                },
                {
                    "sent": "For our accuracy, we took the average accuracy over 10 runs for each event.",
                    "label": 1
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So far, training data we had roughly about 500 tweets per event and that's about 2000 tweets in total.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is a picture that's showing.",
                    "label": 0
                },
                {
                    "sent": "Just that overall classification process.",
                    "label": 0
                },
                {
                    "sent": "So we had a tweet that comes in.",
                    "label": 0
                },
                {
                    "sent": "And then we extract simple features from that tweet.",
                    "label": 1
                },
                {
                    "sent": "For example, we extract and grants and do part of speech tagging on the tweet and then it goes through a pipeline of linguistic classifiers at the bottom, and those classifiers predict the linguistic tag for that tweet and all those become input features into the situational awareness classifier on the right hand side.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So, so we have an input tweetin.",
                    "label": 0
                },
                {
                    "sent": "Our first step was to extract the simple features for extracting the simple feature.",
                    "label": 1
                },
                {
                    "sent": "We preprocess a tweet.",
                    "label": 0
                },
                {
                    "sent": "First, we normalize it and take out the Twitter symbols in the URLs for example.",
                    "label": 0
                },
                {
                    "sent": "Then we stem the tweet and tokenize it.",
                    "label": 0
                },
                {
                    "sent": "And once we've done that, we extract unigrams and their frequency and bigrams and their frequency.",
                    "label": 1
                },
                {
                    "sent": "Then we also use the standard part of speech tagger to part of speech.",
                    "label": 0
                },
                {
                    "sent": "Tag the tweets.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now we have our simple features and then that week goes to a pipeline of classifiers and the subjectivity classifier, for example predicts whether a tweet is subjective or objective.",
                    "label": 0
                },
                {
                    "sent": "So then we have a.",
                    "label": 0
                },
                {
                    "sent": "We have that as input feature and the register classifier is predicting whether it's formal or informal and the style classifier is predicting whether it's written in personal or impersonal style.",
                    "label": 1
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now we have a classification model.",
                    "label": 0
                },
                {
                    "sent": "Next step is to look at our results.",
                    "label": 0
                },
                {
                    "sent": "So the first question that we asked ourselves in our goals was Ken essay tweets.",
                    "label": 0
                },
                {
                    "sent": "Be categorized automatically.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And here's a slide that's showing the results.",
                    "label": 0
                },
                {
                    "sent": "That's basically the accuracy and divided on prevent basis of applying naive Bayes and maximum entropy.",
                    "label": 1
                },
                {
                    "sent": "So the Gray bar is our baseline for that event.",
                    "label": 0
                },
                {
                    "sent": "With baseline is the most popular guests and the Orange Bar is the results of applying naive Bayes and the Blue Bar is are the results of applying maximum entropy.",
                    "label": 0
                },
                {
                    "sent": "So, um.",
                    "label": 0
                },
                {
                    "sent": "As you can see that the maximum entropy gave us pretty much good results throughout each event and we reach about accuracy of about 87% when we used all features with Maxent.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now we know that.",
                    "label": 0
                },
                {
                    "sent": "Yes, we can classify the essay tweets automatically.",
                    "label": 0
                },
                {
                    "sent": "Next question that we were interested in is are the linguistic indicators that we identified useful for detecting essay tweets?",
                    "label": 1
                },
                {
                    "sent": "And in order to evaluate that, we created a balanced data set of essay 500 essay tweets and 500 non essay tweets across all events.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we looked at the result of each feature independently.",
                    "label": 0
                },
                {
                    "sent": "So in this picture, the baseline is actually 50% 'cause we're starting out with a balanced data set and just by using unigrams alone for classification of essay tweet, we reach about roughly 78% accuracy, and that's that.",
                    "label": 0
                },
                {
                    "sent": "Makes some intuitive sense, 'cause when doing emergencies when people are talking about actionable or tactical.",
                    "label": 0
                },
                {
                    "sent": "Information a certain vocabulary emerges.",
                    "label": 0
                },
                {
                    "sent": "For example, when I'm talking about floods, the actionable information tends to have tends to talk about water levels, rivers, so there's a certain vocabulary.",
                    "label": 0
                },
                {
                    "sent": "And then there's also a certain vocabulary around emergencies like evacuation and road closures, so the unigrams.",
                    "label": 0
                },
                {
                    "sent": "Do contribute pretty well.",
                    "label": 0
                },
                {
                    "sent": "To the.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All is off.",
                    "label": 0
                },
                {
                    "sent": "And then the next thing we did was we applied by grams to the problem with bigrams we saw some improvement on the balanced data set, but nothing significant.",
                    "label": 0
                },
                {
                    "sent": "Which makes sense 'cause the pair words tend not to be that frequent tweets 'cause they're short.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we applied part of speech tags to the tweet and part of speech tag actually boosted our accuracy quite a bit.",
                    "label": 0
                },
                {
                    "sent": "And that also makes sense, 'cause the way the language is formed.",
                    "label": 0
                },
                {
                    "sent": "It does tend to, you know, does tend to sort out whether the information is tactical or non technical in nature.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then we the applied subjectivity an that improved or unigrams, but not quite as much as part of speech and for some.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Activity we also looked into applying opinion Finder, which is done by University of Pittsburgh and it's just it's based on contextual and lexical analysis to predict subjectivity.",
                    "label": 0
                },
                {
                    "sent": "So that was tempting.",
                    "label": 0
                },
                {
                    "sent": "'cause then you don't have to annotate your own data.",
                    "label": 0
                },
                {
                    "sent": "And opinion Finder tended not to perform as well as our own classifier that was trained on tweets.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here are the results from applying.",
                    "label": 0
                },
                {
                    "sent": "Looking at the register alone.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then the style.",
                    "label": 0
                },
                {
                    "sent": "And then when you put all these features to go together, the simple features as well as the linguistic feed.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Others.",
                    "label": 0
                },
                {
                    "sent": "Our performance goes up quite a bit.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So, so those were the results in the balanced data set and then the last question that we were interested in looking into was whole.",
                    "label": 0
                },
                {
                    "sent": "Well, do these feature perform across various types of events?",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is the graph that we looked at on the balanced data set and.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then we applied basically the same analysis to all events.",
                    "label": 0
                },
                {
                    "sent": "And the blue graph or the blue bar is the result of applying maximum entropy over the different events.",
                    "label": 0
                },
                {
                    "sent": "And as you can see in Haiti, for example, it made quite a bit of difference when we went from unigrams to applying all all the linguistic features, whereas in Red River Nine or ten, I would rather wear 10.",
                    "label": 0
                },
                {
                    "sent": "It didn't make that much of a difference.",
                    "label": 0
                },
                {
                    "sent": "Unigrams perform just as well, and that makes some sense when you look at the different types of emergencies that we're looking into.",
                    "label": 0
                },
                {
                    "sent": "So Haiti generated a lot of Twitter traffic and there was a large signal to noise ratio.",
                    "label": 0
                },
                {
                    "sent": "So in those cases of complex analysis with the linguistic features helped, whereas in Red River 9 in 2009 there was record flooding.",
                    "label": 0
                },
                {
                    "sent": "An in 2010 there was just moderate amount of flooding with no casualties.",
                    "label": 0
                },
                {
                    "sent": "So so in 2010 as a reaction to 2009 event, there were lots of warnings.",
                    "label": 0
                },
                {
                    "sent": "So pretty much all the tweets that were coming out or tended to be tactical and actionable in nature and only the small portion of the people that were in Red River were tweeting about the event.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in conclusion, our results in classification of essay tweets are promising and we've shown that essay tweets can be classified automatically with good accuracy.",
                    "label": 0
                },
                {
                    "sent": "And this can be very useful to the emergency workers and to the general public to sort through information and get to the tactical and actionable stuff fast during an emergency.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this project is one of the little smaller projects under bigger picture on emergency, an information research that's going on in University of Colorado.",
                    "label": 0
                },
                {
                    "sent": "And to get more information and say I pick.cs.colorado.edu now thanks for your attention.",
                    "label": 0
                }
            ]
        }
    }
}