{
    "id": "h3qotj3xrlqxtt62fhvqsjoxc7w5ulse",
    "title": "Talent Edge 2020: Blueprints for the new normal",
    "info": {
        "author": [
            "Emil Cvitan, Deloitte LLP"
        ],
        "introducer": [
            "Edita Krajnović, Mediade d.o.o."
        ],
        "published": "Oct. 20, 2011",
        "recorded": "September 2011",
        "category": [
            "Top->Business->Management"
        ]
    },
    "url": "http://videolectures.net/managerskikongres2011_cvitan_talent/",
    "segmentation": [
        [
            "Membership to him on a prey in Stevens Achilla Swiss Stavic Naveed Nizza in sitter.",
            "But protect rustier below management, tourist visa versa or ODI modello impressed APO downsizing.",
            "Alec cartoonist Roszko outsourcing prowling its alot.",
            "Nico Steve Analisa economics grid know Steve primary anapra swirly benchmarking arrange an earring.",
            "Stock quote D. Herodian, March no.",
            "Rodeo Toda there is Niko outsourcing are in range in Eringer Soussana, meaning not emo.",
            "The true Gotcha, dealer Moto Courage approach Nimmo Sutic women of Anna how to or Odia Toda what to do.",
            "Kind of duty now Mr. Cocoon aridity post style traditional pretium management to cornets.",
            "Naveed needs the query was one day locally to Virginia.",
            "The P souma Little Vida management Peter Drucker Wichita goes why would reach them go over on the new to the Laddy manager lit Advertisin Russianized cause both young commedia key to The Donnas Nami resultantly Deloitte over discover Talent Edge what is such a citrus?",
            "Cryoprobe Rosemary.",
            "Soreness, Tina Chi Chi Billag Launa Scump managerial lead that is such divides Nirvanix Trusco Sepultura steam over literati, such deceit, Paramus New Journal Evrope Ski manager, Eeswar Possono Spruce mirror proves mirror is Connie in result Talento in two.",
            "D2 petrucci nasuti.",
            "Rayappa Studios result Arthur's discovered Doctor Peterson Anik with team Slovenes exhaust I'ma risultati.",
            "North of the risk of an ambush style, you guys put emails with and Quadro ski directores with only goes through June at Deloitte.",
            "A key match could see discussion of the unique address.",
            "Key functions are in bigger gospel that sweetener colourpop of Abla now order.",
            "Haha is a Ledger Ledger.",
            "Casassa.",
            "Mile is menial.",
            "Anchise could be a group scheme Algerian.",
            "Priscilla was pulled.",
            "It's written order number Provido predominant group of Adams in Needham is equals Miranda Kerr, who got really the nipple may block action on a recheck action glass.",
            "My attic.",
            "Is it the number of Radava outstrike English singing gospel sweet and it worked.",
            "Thank you.",
            "Good good morning.",
            "When I was asked to speak to this gathering, I looked at the report which came out last year in December and I thought, OK, how do I make this interesting?",
            "The.",
            "I've been with Deloitte now for the last five years.",
            "Before that I've been working in HR roles in FMCG's and in construction, and the one thing that.",
            "I've realized is that without a doubt.",
            "It doesn't make a difference which industry it is.",
            "It doesn't make a difference which country it is.",
            "The trends are global and this report shows that many of the things that are worrying people in Europe in Central Europe are worrying.",
            "People in Asia are worrying people in the Americas.",
            "This report came out of a survey.",
            "There some 300 business and talent leaders around the world were requested to respond to a questionnaire."
        ],
        [
            "The key findings basically were that talent strategies needed to be changed, and the reason they needed to be changed is there was something called the new normal.",
            "In the past we had identified what?",
            "What motivates people?",
            "What attracts people?",
            "And that has been changing most importantly.",
            "Even before the down of the downturn in the economy, three years ago, that was, those changes were accelerating.",
            "People had thought that perhaps that would slow down with the downturn in the air."
        ],
        [
            "To me, what has been found is that it has continued to accelerate and the marketplace.",
            "The talent marketplace is much different than it was several years ago.",
            "One would expect with the current levels of high unemployment that we would have a talent surplus.",
            "It's not there.",
            "I know from my role my role is actually I'm the HR director for.",
            "Pan and Adria, which is the former Yugoslavia and Hungary.",
            "I'm having more and more difficult difficulty keeping the top talent.",
            "I'm having more and more difficulty finding talent to replace them.",
            "What we will see in part of the report is that there are certain areas that are proving to be more.",
            "Problematic than others."
        ],
        [
            "We need to develop leadership leaders from within our own firms and.",
            "We keep on saying that and we keep on looking at where is the next generation of leaders coming from and we look down and we invest a lot of money in various leadership programs.",
            "I've just come back from 3 days in Bratislava where we had 80 of our top talents on a three day phase, two of a two year journey in development in leadership development.",
            "And when I look at.",
            "At the the The the body of people we have all I can say is we need more people and we're constantly looking.",
            "And if we're looking for people, I know that you are also looking for people."
        ],
        [
            "Retention plans well.",
            "Deloitte as a firm is famous for its high turnover rates.",
            "In 2007 we had voluntary turnover levels of between 23 and 27% depending in which country we're looking at.",
            "Over the last couple of years we have not had difficulties in retaining the top talent because there haven't been all that many jobs out there.",
            "However, next Wednesday I will be getting my monthly report from the finance people and I am.",
            "I believe that I will see a number which reflects the numbers that we had three years ago.",
            "People jobs are beginning to be created.",
            "People are hiring talents and they are picking off the best from their surrounds.",
            "If they don't have talent within their enough talents within their own organizations, people are looking at improving financial and non financial incentives but we need to understand what?",
            "Are those financial and non financial incentives, especially the non financial incentives that are going to keep our people with our firms for longer than four or five years, which is becoming the trend globally where three to five years seems to be a a regular job burst swap for top talent?"
        ],
        [
            "OK, the great re balance.",
            "We are still not out of the Woods in terms of the economic downturn, and we all hope that we won't go back into the Woods before we get out of them.",
            "But we have been addressing.",
            "Where?",
            "How do we?",
            "Makes the right balance between keeping ourselves afloat at this moment and looking towards the future.",
            "So."
        ],
        [
            "This is the first graph and I do apologize for the quality of the slide.",
            "Unfortunately, we had to take that out of the report proper and so it's a bit blurry, but what we're looking at here is what are the global global business and talent leaders thinking, and whatever they think the current strategic issues.",
            "And the green line.",
            "The green bars are results from December in 2009.",
            "The blue is October of last year.",
            "Now the first thing that comes to to view is whoops, this has been slightly changed, so this is going to be.",
            "This is going to be fun.",
            "OK, that's supposed to be a little bit higher, and perhaps I'll take it back.",
            "If you look at the 2nd and the 3rd area.",
            "In December 2009, the Great focus was cutting and managing costs and we all did it and the second one was acquiring servicing and retaining customers, which led to in many industries price cutting and a whole new array of difficulties for managing the business.",
            "Cost cutting most of us have come to the bone and if we go any further we will cause damage.",
            "So between December 2009 and October 2010.",
            "Leadership around the world realized that.",
            "That wasn't that wasn't a sustainable strategy, and I'm going to have to do this, and I'm hoping, OK. OK, the other thing that has changed in that 10 month period is where the focus where that focus that was being used on cutting costs and maintaining clients.",
            "Where has it shifted to?",
            "Expanding into global and new markets went from 14% to 28%.",
            "Investing in innovation and research and development, which went from 11 to 27%.",
            "And then the final one is leveraging technology from 10 to 20.",
            "Now from my own, from my own experience.",
            "We have just opened our China desk.",
            "Because we realize at the moment we don't have a market that we can expand and develop locally at this stage.",
            "And we're looking for the new markets.",
            "So Deloitte has done that one, so we're part of that 14 to 28% shift.",
            "Invent investing in innovation.",
            "About 12 months ago, Deloitte had its first innovation cafe in each of our officers on a regular basis, we have a coffee with the leadership of the firm.",
            "All employees are invited.",
            "We get about a 10% turn up and we discuss how the business is going, what's happening, we identify where we think we could do better.",
            "But we can't think of it, and we're asking our staff who are working with these issues on a daily basis to give US ideas.",
            "Our innovation Cafe has produced almost 400 ideas of which we have implemented about 30 of them, which is pretty good going for ideas in a time where most ideas need some money.",
            "Thank you OK and fine.",
            "Finally, leveraging technology Deloitte Deloitte, works with information we we pride ourselves on having databases on almost any topic in any place in the world.",
            "We had several systems where we were running it.",
            "One of the things that we have changed is, well, we've introduced a new system that gets all the information from the various technologies that we already had in place and have that now working for us.",
            "Much more efficiently, the last rollout will be finished by the end of this calendar year.",
            "OK, we can go through the highlights, OK?"
        ],
        [
            "Talent paradox we're going back to what we were speaking about earlier, and I hope these highlights work because I'll be a little bit lost.",
            "What are the most pressing talent concerns and if we look at the graph, there are a lot of topics and I've identified three groups of them and that's not it.",
            "OK, the top three.",
            "PowerPoint sometimes do this when they get made large and we didn't check.",
            "Sorry about that.",
            "OK, competing for talent globally is at the top of the agenda.",
            "We are.",
            "I've had people in the past leave my firm and not only Deloitte, but when I was in other industries.",
            "And they were going to competitors.",
            "They were going to clients.",
            "They were going to Germany.",
            "I now have people regularly going to Canada, going to Brazil, going to NZ.",
            "I also have people coming from more and more places.",
            "We are part of the global community.",
            "People talent is all over the place and the demands are becoming more and more specific and therefore we are really having to look wider than our own backyards to find the people to do those tasks.",
            "Developing leaders and succession planning.",
            "Also high ranks.",
            "Highly.",
            "Like I said, we all know that if we this document is called.",
            "You know, take talent age 2020 we're looking 10 years ahead of ourselves and in 10 years time.",
            "There will be many people who are now at junior manager level who will be hopefully be the leaders of our firms in 10 years time.",
            "But to be leaders we need to invest money in them.",
            "We need to look after them.",
            "We need to nurture them and we need to keep them retaining employees at all levels.",
            "Now if you look at this whole presentation, you will find that there there seems to be some.",
            "Illogical little comments, but for this one, retaining people is basically becoming more and more difficult, and the turn around time for an employee is becoming shorter and shorter and the return on investment when you take on a new employee is is not being achieved and we're spending more and more money in that area so that needs to be a focus.",
            "In the middle here somewhere we have a couple of interesting areas.",
            "Sustaining Employee engagement is.",
            "Is is there directly beneath that you will find providing competitive compensation and #3 in the middle is recruiting hard to find the skill sets.",
            "Those three have.",
            "Thank you, that's fine.",
            "Those three are always somewhere in the middle.",
            "We do people surveys or they might be called engagement surveys or commitment surveys or satisfaction surveys of our employees.",
            "We get the feedback.",
            "We look at the results.",
            "We look where we are weakest.",
            "We.",
            "Try to work out how do we fix it.",
            "And often we just say, well, we just don't have the money for it.",
            "And we're not very inventive in trying to address those sort of issues, but the IRA member as a child.",
            "Many years ago, I don't know if the series of films were showing in this region.",
            "There was an American series of films called Manpower Kettle, Two People from the back, the backwaters of Oregon in the US, and in one of the sessions that one of the films they went to Hawaii, and they visited a.",
            "A packaging plant pineapple packaging plant.",
            "They turned on the water.",
            "They turned on some music and the packaging just went.",
            "Quicker and quicker and more efficiently, and they are the little things that do make a difference.",
            "An park kettle is my great leader of the 20th century, because he he didn't know, he just did something and.",
            "We need to be a little bit more.",
            "We need to realize throwing money at the problem is not going to solve it, not it's not going to search solve it short term or long term.",
            "The recruitment.",
            "For the hard skill sets and I'll get to this in a bit more detail, what, what?",
            "How do we recruit?",
            "What is the message we're sending out there?",
            "Do we just put the ad on on where there or into the newspaper and hope for the best?",
            "Or do we have a strategy because?",
            "When this ship start sailing again, we are going to need people urgently and the top people when they go they might go and visit my Adela unless they recognize the brand unless they know who you are.",
            "They're not even going to read your ad.",
            "So we need to get a strategy to make sure that when the need requires that person is going the person we want is going to.",
            "Click and have a look and send us their CV, but hopefully if we are really good we will have had that CV already in Deloitte.",
            "We have for the last five years had a special incentive plan called The Stars Referral.",
            "We invite our employees to refer friends colleagues for vacancies within our firm.",
            "In some of our countries, 80% of our hires come through the internal referral system because our employees know the culture.",
            "Of Deloitte, they know who we are, what we are, what the conditions are, and they also know their friends.",
            "They know the quality of their friends and they are the best filter.",
            "It makes hey, Charles, life.",
            "So much simpler.",
            "The head hunting agencies hate us for it.",
            "But it it works, but we need each each firm has to find its own solution to filling the gap I'll go on.",
            "Papa and these are the arrows, the bottom three and actually the bottom 3 point to the right three.",
            "The bottom 3.2 something that I call it a job well done.",
            "3rd from the bottom is providing flexible work arrangements.",
            "I don't think we we are very yet.",
            "But I think we are a hell of a lot closer than 10 years ago or 20 years ago when I started working.",
            "We have down down dialing your career.",
            "We have up dialing your career.",
            "We have people working from home.",
            "We have people with all kinds of arrangements.",
            "If it fits in, the job, gets done and we are, we deploy to bliss because we have a job that we can basically do from anywhere as long as I have a connection to the Internet.",
            "But and other firms do have more difficulty.",
            "But we we we know the issue when we are doing something about it and that's why it's down at the bottom of the list.",
            "The other, the second from the bottom, is evaluating implementing HR technologies and systems also way down at the bottom of the List 10 years ago, in eight years ago in my the second HR roll.",
            "We did a global rollout of a whole pile of HR technology.",
            "There was a whole pile of good work being done by HR units, but we couldn't analyze it.",
            "So the investment in the technologies has been done, and again, that's why it's down there.",
            "My favorite, and I am very proud of this one.",
            "Only 3% of people.",
            "The.",
            "I asked thoughts that.",
            "HR and the aligning HR and talent with the business priorities.",
            "Many years ago I remember that we had issues that HR leaders often didn't know how to read a P&L.",
            "And that caused significant difficulties because the role of HR was not fully understood.",
            "It was something that was emerging.",
            "But now we have something that is significantly better.",
            "We have leaders focusing on it more significantly.",
            "More and more companies are putting the Chief HR officer.",
            "In the top of the management and strategy strategic thinking.",
            "And that's that is.",
            "A lot of hard work over the last 10 or 15 years by people who were still trying to get their their brains around it.",
            "How are we going?"
        ],
        [
            "Good OK. Now in one of the early slides I mentioned that there were certain areas where business leaders feared that there would be a talent shortage.",
            "This slide is fairly short and sweet.",
            "At the top and with 72% of business leaders globally, consider research and development as being.",
            "The top problem area for finding new people directly beneath it is executive leadership.",
            "Executive leadership.",
            "And and research and development interesting.",
            "Lee at the top.",
            "And when I looked at this slide the first time, I said OK, why?",
            "Why are these two areas at the top of the questionnaire?",
            "And the answer I came up with was they are the sources of innovation.",
            "Basically leaders and research and development are innovating and innovation is the only way we can go forward.",
            "We need to make things better, quicker, more efficient and so those areas is where there's going to be a lot of demand and and the people who are good at it harder and harder to find.",
            "Now we do have a slight this.",
            "This particular slide is the global results.",
            "There are other Ripper tables in the report.",
            "And one of the points to a difference that we will find in Europe.",
            "Europe has some other areas where they need to get rid of that where they need to, where they fear that they will have a shortage and it's a bit surprising when I looked at it and I and I'm going to ask you guys to consider why is Europe?",
            "Two to three points higher than the global on sales on HR and Talents on procurement and supply chain and customer service.",
            "Those four areas are still.",
            "Considered in Europe to be.",
            "Worse off then on the global picture.",
            "Are we behind?",
            "Are we catching up or are we looking into the future and realizing a demand that Asia and the Americas haven't seen yet?",
            "OK, this is a big slide with."
        ],
        [
            "I have small print so.",
            "OK there the core talent management priorities again and I slide I do not have the time or the inclination to go through them one by one, but at the top again, performance management, merging leaders, high potentials at the bottom.",
            "Well.",
            "At the bottom we have.",
            "Offshored the hires so.",
            "There is a trend and it's global and most of these things it doesn't really make a difference where you are.",
            "You've got the focus areas and that we need to identify.",
            "And address again complicated company country to country.",
            "There are specifics depending on where the particular economy and in particular company is at that point in time.",
            "But what we need to do each and everyone of us and I have no answers for anyone here today.",
            "I'm purely saying this is what the world top leadership is saying.",
            "Where do we find ourselves in that scenario?",
            "So we need to identify what it is and then start doing the strategies because our workforce is no longer the workforce of 20 or 30 years ago or where people got a job and then retired there.",
            "OK."
        ],
        [
            "Retention.",
            "In a new playing field and it's the strategies we have are not working.",
            "Like I said next week, I fear that I will be back to 2007 levels of turnover.",
            "So what am I doing wrong?",
            "Why is this happening?",
            "Obviously I haven't got.",
            "The I haven't got the the right thing are I haven't identified things correctly, so I've got a job for the next couple of years and that that makes me happy, but.",
            "If your turnover is not controlled.",
            "Then we need to look at why isn't it controlled?",
            "What's changing in the workplace?",
            "That strategies that used to work aren't working any longer.",
            "OK, basically if you have retention strategy."
        ],
        [
            "These need to focus.",
            "And this is these are the thoughts of global leadership.",
            "We need to be focusing on emerging leaders.",
            "That is investing time and money in people that we've identified as potential leaders and.",
            "There's a huge difference, and we all know it between the leader and the manager, and we need to find those leaders and we need to develop them and we need to have them there because they are the ones who are going to take us forward.",
            "We need to focus on gender and generation an I said gender and generation even though it says generation and gender.",
            "Gender and generation was what I was introduced to 20 something years ago when I had my first involvement with HR issues.",
            "Now it's become generation and gender.",
            "The number of women in this room is a significant.",
            "Uh.",
            "Is a significant turn around from what we had in the past and a lot of the issues that had to be dealt with.",
            "For industry to stop losing talented women.",
            "Have been addressed.",
            "We've got a long, long way to go.",
            "But we we we, we know it's a problem.",
            "We're focusing on it and we're going forward.",
            "However, the reason generation is first is because there is a new issue out there in the marketplace.",
            "It is the generation gap that's happening.",
            "It happens every 20 or 30 years and the whole world panics about it and the older generation considers, well, it's all going to pot.",
            "We know it isn't going to go to pot because the hippies of the 60s are today's business leaders and today's generation will be the business leaders.",
            "It's a natural progression, but we need to focus on generation to make sure that we keep them active.",
            "We keep them in our firms, we keep them.",
            "The motivated so that they can become leaders because the big ingredient for leadership is time and wisdom that comes out of time.",
            "Focus on employer brands.",
            "I mentioned that earlier with the recruitment employer branding has become a major major issue in getting getting the right people.",
            "At the moment I spend 10 times more money per graduate recruit in Hungary than I do in any other country in my region.",
            "The reason is their labor market has become very sophisticated.",
            "At that level, at the graduate level, the universities aren't producing enough people.",
            "I'm hungry, is flooded with service centers which is swallowing and spitting out people every year and they don't.",
            "The type of career path that those companies are offering our short-term and firms that need long term solutions cannot afford to hire the person.",
            "Pay him top dollar and invest in him at the same time so.",
            "Because the generations are changing, the brand is very important and we will see that as we go through the further focus on incentives.",
            "We're always looking at the incentives.",
            "What makes people click on it.",
            "And when I say incentives, it's non financial that we really need to focus on.",
            "What makes your company different to all the other companies in Slovenia?",
            "To all the other companies in the world position one is the company culture.",
            "You've got to know what the you have.",
            "A company culture.",
            "Have you identified it?",
            "And when you've identified it, does the rest of Slovenia know what it means to?",
            "What does that brand mean compensation?",
            "Always has to be there, but more and more importantly, future opportunities is where we're headed."
        ],
        [
            "I will close on this slide.",
            "Well, I won't there's one more slide that I wanted to do, but.",
            "If you look at this Generation Y and all of this is going to be on the website Generation Y has its own number one position for attention.",
            "Company culture is most important Generation X, baby boomers veterans.",
            "None of them even consider that to be an issue.",
            "#2 flexible work hours.",
            "The only other person that thinks of it are the veterans.",
            "So the mindset of the new generation of the future leaders of our firms has changed significantly and.",
            "I'll leave you with this thing."
        ],
        [
            "What a wise man once said.",
            "Thank you.",
            "Mr Tipton thank you Anna cloud.",
            "Mr Twit and you know there were some surprises in this presentation for me too, yeah, but like Petra said, you know they always challenged that adept at that exactly only 14% of people are able to adapt by some researches.",
            "So you are one of the 14%.",
            "Yeah Gratulation, thank you very much.",
            "Thank you.",
            "Equipment at super.",
            "Say resume it on email.",
            "Mineola, Slovenia banaszak his Kushner Hannastown are chassis Cremation and we monitor wall Talento Slovenie needed walls non yet couldn't Miss Magas car window to uni in total progression with Slovenia Kowalik Melody Hosti Adama name establish leave between Oso Bridgwood.",
            "In dubious took Williams Marketing Manager, Museum director, and swagger, podia TE Stopper Shinies, Akai slow, Encino poet one in Naples, gas station, Prosonic girls to be more alpacca chewed and cognition petina Leto domanico vent and waste appearance of grass, Coutinho provision in Astana.",
            "Grim Sydney.",
            "Punkass Amir Sodoma chair premium or emerged Regina Aleenan for member near the Wish Casey Douma.",
            "Cancel akubra, Josh.",
            "Keep at it deluge in Kayla Cooper Nelson's Iowa demos Romuva Slovenia Triple Membean Soda Miata Casanovas we're missing some remote prayed printable brow."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Membership to him on a prey in Stevens Achilla Swiss Stavic Naveed Nizza in sitter.",
                    "label": 0
                },
                {
                    "sent": "But protect rustier below management, tourist visa versa or ODI modello impressed APO downsizing.",
                    "label": 0
                },
                {
                    "sent": "Alec cartoonist Roszko outsourcing prowling its alot.",
                    "label": 0
                },
                {
                    "sent": "Nico Steve Analisa economics grid know Steve primary anapra swirly benchmarking arrange an earring.",
                    "label": 0
                },
                {
                    "sent": "Stock quote D. Herodian, March no.",
                    "label": 0
                },
                {
                    "sent": "Rodeo Toda there is Niko outsourcing are in range in Eringer Soussana, meaning not emo.",
                    "label": 0
                },
                {
                    "sent": "The true Gotcha, dealer Moto Courage approach Nimmo Sutic women of Anna how to or Odia Toda what to do.",
                    "label": 0
                },
                {
                    "sent": "Kind of duty now Mr. Cocoon aridity post style traditional pretium management to cornets.",
                    "label": 0
                },
                {
                    "sent": "Naveed needs the query was one day locally to Virginia.",
                    "label": 0
                },
                {
                    "sent": "The P souma Little Vida management Peter Drucker Wichita goes why would reach them go over on the new to the Laddy manager lit Advertisin Russianized cause both young commedia key to The Donnas Nami resultantly Deloitte over discover Talent Edge what is such a citrus?",
                    "label": 0
                },
                {
                    "sent": "Cryoprobe Rosemary.",
                    "label": 0
                },
                {
                    "sent": "Soreness, Tina Chi Chi Billag Launa Scump managerial lead that is such divides Nirvanix Trusco Sepultura steam over literati, such deceit, Paramus New Journal Evrope Ski manager, Eeswar Possono Spruce mirror proves mirror is Connie in result Talento in two.",
                    "label": 0
                },
                {
                    "sent": "D2 petrucci nasuti.",
                    "label": 0
                },
                {
                    "sent": "Rayappa Studios result Arthur's discovered Doctor Peterson Anik with team Slovenes exhaust I'ma risultati.",
                    "label": 0
                },
                {
                    "sent": "North of the risk of an ambush style, you guys put emails with and Quadro ski directores with only goes through June at Deloitte.",
                    "label": 0
                },
                {
                    "sent": "A key match could see discussion of the unique address.",
                    "label": 0
                },
                {
                    "sent": "Key functions are in bigger gospel that sweetener colourpop of Abla now order.",
                    "label": 0
                },
                {
                    "sent": "Haha is a Ledger Ledger.",
                    "label": 0
                },
                {
                    "sent": "Casassa.",
                    "label": 0
                },
                {
                    "sent": "Mile is menial.",
                    "label": 0
                },
                {
                    "sent": "Anchise could be a group scheme Algerian.",
                    "label": 0
                },
                {
                    "sent": "Priscilla was pulled.",
                    "label": 0
                },
                {
                    "sent": "It's written order number Provido predominant group of Adams in Needham is equals Miranda Kerr, who got really the nipple may block action on a recheck action glass.",
                    "label": 0
                },
                {
                    "sent": "My attic.",
                    "label": 0
                },
                {
                    "sent": "Is it the number of Radava outstrike English singing gospel sweet and it worked.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Good good morning.",
                    "label": 0
                },
                {
                    "sent": "When I was asked to speak to this gathering, I looked at the report which came out last year in December and I thought, OK, how do I make this interesting?",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "I've been with Deloitte now for the last five years.",
                    "label": 1
                },
                {
                    "sent": "Before that I've been working in HR roles in FMCG's and in construction, and the one thing that.",
                    "label": 0
                },
                {
                    "sent": "I've realized is that without a doubt.",
                    "label": 0
                },
                {
                    "sent": "It doesn't make a difference which industry it is.",
                    "label": 0
                },
                {
                    "sent": "It doesn't make a difference which country it is.",
                    "label": 0
                },
                {
                    "sent": "The trends are global and this report shows that many of the things that are worrying people in Europe in Central Europe are worrying.",
                    "label": 0
                },
                {
                    "sent": "People in Asia are worrying people in the Americas.",
                    "label": 0
                },
                {
                    "sent": "This report came out of a survey.",
                    "label": 0
                },
                {
                    "sent": "There some 300 business and talent leaders around the world were requested to respond to a questionnaire.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The key findings basically were that talent strategies needed to be changed, and the reason they needed to be changed is there was something called the new normal.",
                    "label": 1
                },
                {
                    "sent": "In the past we had identified what?",
                    "label": 0
                },
                {
                    "sent": "What motivates people?",
                    "label": 0
                },
                {
                    "sent": "What attracts people?",
                    "label": 0
                },
                {
                    "sent": "And that has been changing most importantly.",
                    "label": 0
                },
                {
                    "sent": "Even before the down of the downturn in the economy, three years ago, that was, those changes were accelerating.",
                    "label": 0
                },
                {
                    "sent": "People had thought that perhaps that would slow down with the downturn in the air.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To me, what has been found is that it has continued to accelerate and the marketplace.",
                    "label": 0
                },
                {
                    "sent": "The talent marketplace is much different than it was several years ago.",
                    "label": 0
                },
                {
                    "sent": "One would expect with the current levels of high unemployment that we would have a talent surplus.",
                    "label": 1
                },
                {
                    "sent": "It's not there.",
                    "label": 0
                },
                {
                    "sent": "I know from my role my role is actually I'm the HR director for.",
                    "label": 0
                },
                {
                    "sent": "Pan and Adria, which is the former Yugoslavia and Hungary.",
                    "label": 0
                },
                {
                    "sent": "I'm having more and more difficult difficulty keeping the top talent.",
                    "label": 0
                },
                {
                    "sent": "I'm having more and more difficulty finding talent to replace them.",
                    "label": 0
                },
                {
                    "sent": "What we will see in part of the report is that there are certain areas that are proving to be more.",
                    "label": 0
                },
                {
                    "sent": "Problematic than others.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We need to develop leadership leaders from within our own firms and.",
                    "label": 1
                },
                {
                    "sent": "We keep on saying that and we keep on looking at where is the next generation of leaders coming from and we look down and we invest a lot of money in various leadership programs.",
                    "label": 1
                },
                {
                    "sent": "I've just come back from 3 days in Bratislava where we had 80 of our top talents on a three day phase, two of a two year journey in development in leadership development.",
                    "label": 1
                },
                {
                    "sent": "And when I look at.",
                    "label": 0
                },
                {
                    "sent": "At the the The the body of people we have all I can say is we need more people and we're constantly looking.",
                    "label": 0
                },
                {
                    "sent": "And if we're looking for people, I know that you are also looking for people.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Retention plans well.",
                    "label": 0
                },
                {
                    "sent": "Deloitte as a firm is famous for its high turnover rates.",
                    "label": 0
                },
                {
                    "sent": "In 2007 we had voluntary turnover levels of between 23 and 27% depending in which country we're looking at.",
                    "label": 0
                },
                {
                    "sent": "Over the last couple of years we have not had difficulties in retaining the top talent because there haven't been all that many jobs out there.",
                    "label": 0
                },
                {
                    "sent": "However, next Wednesday I will be getting my monthly report from the finance people and I am.",
                    "label": 0
                },
                {
                    "sent": "I believe that I will see a number which reflects the numbers that we had three years ago.",
                    "label": 0
                },
                {
                    "sent": "People jobs are beginning to be created.",
                    "label": 0
                },
                {
                    "sent": "People are hiring talents and they are picking off the best from their surrounds.",
                    "label": 0
                },
                {
                    "sent": "If they don't have talent within their enough talents within their own organizations, people are looking at improving financial and non financial incentives but we need to understand what?",
                    "label": 1
                },
                {
                    "sent": "Are those financial and non financial incentives, especially the non financial incentives that are going to keep our people with our firms for longer than four or five years, which is becoming the trend globally where three to five years seems to be a a regular job burst swap for top talent?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, the great re balance.",
                    "label": 1
                },
                {
                    "sent": "We are still not out of the Woods in terms of the economic downturn, and we all hope that we won't go back into the Woods before we get out of them.",
                    "label": 0
                },
                {
                    "sent": "But we have been addressing.",
                    "label": 0
                },
                {
                    "sent": "Where?",
                    "label": 0
                },
                {
                    "sent": "How do we?",
                    "label": 0
                },
                {
                    "sent": "Makes the right balance between keeping ourselves afloat at this moment and looking towards the future.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the first graph and I do apologize for the quality of the slide.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, we had to take that out of the report proper and so it's a bit blurry, but what we're looking at here is what are the global global business and talent leaders thinking, and whatever they think the current strategic issues.",
                    "label": 0
                },
                {
                    "sent": "And the green line.",
                    "label": 0
                },
                {
                    "sent": "The green bars are results from December in 2009.",
                    "label": 0
                },
                {
                    "sent": "The blue is October of last year.",
                    "label": 0
                },
                {
                    "sent": "Now the first thing that comes to to view is whoops, this has been slightly changed, so this is going to be.",
                    "label": 0
                },
                {
                    "sent": "This is going to be fun.",
                    "label": 0
                },
                {
                    "sent": "OK, that's supposed to be a little bit higher, and perhaps I'll take it back.",
                    "label": 0
                },
                {
                    "sent": "If you look at the 2nd and the 3rd area.",
                    "label": 0
                },
                {
                    "sent": "In December 2009, the Great focus was cutting and managing costs and we all did it and the second one was acquiring servicing and retaining customers, which led to in many industries price cutting and a whole new array of difficulties for managing the business.",
                    "label": 0
                },
                {
                    "sent": "Cost cutting most of us have come to the bone and if we go any further we will cause damage.",
                    "label": 0
                },
                {
                    "sent": "So between December 2009 and October 2010.",
                    "label": 0
                },
                {
                    "sent": "Leadership around the world realized that.",
                    "label": 0
                },
                {
                    "sent": "That wasn't that wasn't a sustainable strategy, and I'm going to have to do this, and I'm hoping, OK. OK, the other thing that has changed in that 10 month period is where the focus where that focus that was being used on cutting costs and maintaining clients.",
                    "label": 0
                },
                {
                    "sent": "Where has it shifted to?",
                    "label": 0
                },
                {
                    "sent": "Expanding into global and new markets went from 14% to 28%.",
                    "label": 0
                },
                {
                    "sent": "Investing in innovation and research and development, which went from 11 to 27%.",
                    "label": 0
                },
                {
                    "sent": "And then the final one is leveraging technology from 10 to 20.",
                    "label": 0
                },
                {
                    "sent": "Now from my own, from my own experience.",
                    "label": 0
                },
                {
                    "sent": "We have just opened our China desk.",
                    "label": 0
                },
                {
                    "sent": "Because we realize at the moment we don't have a market that we can expand and develop locally at this stage.",
                    "label": 0
                },
                {
                    "sent": "And we're looking for the new markets.",
                    "label": 0
                },
                {
                    "sent": "So Deloitte has done that one, so we're part of that 14 to 28% shift.",
                    "label": 0
                },
                {
                    "sent": "Invent investing in innovation.",
                    "label": 0
                },
                {
                    "sent": "About 12 months ago, Deloitte had its first innovation cafe in each of our officers on a regular basis, we have a coffee with the leadership of the firm.",
                    "label": 0
                },
                {
                    "sent": "All employees are invited.",
                    "label": 0
                },
                {
                    "sent": "We get about a 10% turn up and we discuss how the business is going, what's happening, we identify where we think we could do better.",
                    "label": 0
                },
                {
                    "sent": "But we can't think of it, and we're asking our staff who are working with these issues on a daily basis to give US ideas.",
                    "label": 0
                },
                {
                    "sent": "Our innovation Cafe has produced almost 400 ideas of which we have implemented about 30 of them, which is pretty good going for ideas in a time where most ideas need some money.",
                    "label": 0
                },
                {
                    "sent": "Thank you OK and fine.",
                    "label": 0
                },
                {
                    "sent": "Finally, leveraging technology Deloitte Deloitte, works with information we we pride ourselves on having databases on almost any topic in any place in the world.",
                    "label": 0
                },
                {
                    "sent": "We had several systems where we were running it.",
                    "label": 0
                },
                {
                    "sent": "One of the things that we have changed is, well, we've introduced a new system that gets all the information from the various technologies that we already had in place and have that now working for us.",
                    "label": 0
                },
                {
                    "sent": "Much more efficiently, the last rollout will be finished by the end of this calendar year.",
                    "label": 0
                },
                {
                    "sent": "OK, we can go through the highlights, OK?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Talent paradox we're going back to what we were speaking about earlier, and I hope these highlights work because I'll be a little bit lost.",
                    "label": 0
                },
                {
                    "sent": "What are the most pressing talent concerns and if we look at the graph, there are a lot of topics and I've identified three groups of them and that's not it.",
                    "label": 0
                },
                {
                    "sent": "OK, the top three.",
                    "label": 0
                },
                {
                    "sent": "PowerPoint sometimes do this when they get made large and we didn't check.",
                    "label": 0
                },
                {
                    "sent": "Sorry about that.",
                    "label": 0
                },
                {
                    "sent": "OK, competing for talent globally is at the top of the agenda.",
                    "label": 0
                },
                {
                    "sent": "We are.",
                    "label": 0
                },
                {
                    "sent": "I've had people in the past leave my firm and not only Deloitte, but when I was in other industries.",
                    "label": 0
                },
                {
                    "sent": "And they were going to competitors.",
                    "label": 0
                },
                {
                    "sent": "They were going to clients.",
                    "label": 0
                },
                {
                    "sent": "They were going to Germany.",
                    "label": 0
                },
                {
                    "sent": "I now have people regularly going to Canada, going to Brazil, going to NZ.",
                    "label": 0
                },
                {
                    "sent": "I also have people coming from more and more places.",
                    "label": 0
                },
                {
                    "sent": "We are part of the global community.",
                    "label": 0
                },
                {
                    "sent": "People talent is all over the place and the demands are becoming more and more specific and therefore we are really having to look wider than our own backyards to find the people to do those tasks.",
                    "label": 0
                },
                {
                    "sent": "Developing leaders and succession planning.",
                    "label": 0
                },
                {
                    "sent": "Also high ranks.",
                    "label": 0
                },
                {
                    "sent": "Highly.",
                    "label": 0
                },
                {
                    "sent": "Like I said, we all know that if we this document is called.",
                    "label": 0
                },
                {
                    "sent": "You know, take talent age 2020 we're looking 10 years ahead of ourselves and in 10 years time.",
                    "label": 0
                },
                {
                    "sent": "There will be many people who are now at junior manager level who will be hopefully be the leaders of our firms in 10 years time.",
                    "label": 0
                },
                {
                    "sent": "But to be leaders we need to invest money in them.",
                    "label": 0
                },
                {
                    "sent": "We need to look after them.",
                    "label": 0
                },
                {
                    "sent": "We need to nurture them and we need to keep them retaining employees at all levels.",
                    "label": 0
                },
                {
                    "sent": "Now if you look at this whole presentation, you will find that there there seems to be some.",
                    "label": 0
                },
                {
                    "sent": "Illogical little comments, but for this one, retaining people is basically becoming more and more difficult, and the turn around time for an employee is becoming shorter and shorter and the return on investment when you take on a new employee is is not being achieved and we're spending more and more money in that area so that needs to be a focus.",
                    "label": 0
                },
                {
                    "sent": "In the middle here somewhere we have a couple of interesting areas.",
                    "label": 0
                },
                {
                    "sent": "Sustaining Employee engagement is.",
                    "label": 0
                },
                {
                    "sent": "Is is there directly beneath that you will find providing competitive compensation and #3 in the middle is recruiting hard to find the skill sets.",
                    "label": 0
                },
                {
                    "sent": "Those three have.",
                    "label": 0
                },
                {
                    "sent": "Thank you, that's fine.",
                    "label": 0
                },
                {
                    "sent": "Those three are always somewhere in the middle.",
                    "label": 0
                },
                {
                    "sent": "We do people surveys or they might be called engagement surveys or commitment surveys or satisfaction surveys of our employees.",
                    "label": 0
                },
                {
                    "sent": "We get the feedback.",
                    "label": 0
                },
                {
                    "sent": "We look at the results.",
                    "label": 0
                },
                {
                    "sent": "We look where we are weakest.",
                    "label": 0
                },
                {
                    "sent": "We.",
                    "label": 0
                },
                {
                    "sent": "Try to work out how do we fix it.",
                    "label": 0
                },
                {
                    "sent": "And often we just say, well, we just don't have the money for it.",
                    "label": 0
                },
                {
                    "sent": "And we're not very inventive in trying to address those sort of issues, but the IRA member as a child.",
                    "label": 0
                },
                {
                    "sent": "Many years ago, I don't know if the series of films were showing in this region.",
                    "label": 0
                },
                {
                    "sent": "There was an American series of films called Manpower Kettle, Two People from the back, the backwaters of Oregon in the US, and in one of the sessions that one of the films they went to Hawaii, and they visited a.",
                    "label": 0
                },
                {
                    "sent": "A packaging plant pineapple packaging plant.",
                    "label": 0
                },
                {
                    "sent": "They turned on the water.",
                    "label": 0
                },
                {
                    "sent": "They turned on some music and the packaging just went.",
                    "label": 0
                },
                {
                    "sent": "Quicker and quicker and more efficiently, and they are the little things that do make a difference.",
                    "label": 0
                },
                {
                    "sent": "An park kettle is my great leader of the 20th century, because he he didn't know, he just did something and.",
                    "label": 0
                },
                {
                    "sent": "We need to be a little bit more.",
                    "label": 0
                },
                {
                    "sent": "We need to realize throwing money at the problem is not going to solve it, not it's not going to search solve it short term or long term.",
                    "label": 0
                },
                {
                    "sent": "The recruitment.",
                    "label": 0
                },
                {
                    "sent": "For the hard skill sets and I'll get to this in a bit more detail, what, what?",
                    "label": 0
                },
                {
                    "sent": "How do we recruit?",
                    "label": 0
                },
                {
                    "sent": "What is the message we're sending out there?",
                    "label": 0
                },
                {
                    "sent": "Do we just put the ad on on where there or into the newspaper and hope for the best?",
                    "label": 0
                },
                {
                    "sent": "Or do we have a strategy because?",
                    "label": 0
                },
                {
                    "sent": "When this ship start sailing again, we are going to need people urgently and the top people when they go they might go and visit my Adela unless they recognize the brand unless they know who you are.",
                    "label": 0
                },
                {
                    "sent": "They're not even going to read your ad.",
                    "label": 0
                },
                {
                    "sent": "So we need to get a strategy to make sure that when the need requires that person is going the person we want is going to.",
                    "label": 0
                },
                {
                    "sent": "Click and have a look and send us their CV, but hopefully if we are really good we will have had that CV already in Deloitte.",
                    "label": 0
                },
                {
                    "sent": "We have for the last five years had a special incentive plan called The Stars Referral.",
                    "label": 0
                },
                {
                    "sent": "We invite our employees to refer friends colleagues for vacancies within our firm.",
                    "label": 0
                },
                {
                    "sent": "In some of our countries, 80% of our hires come through the internal referral system because our employees know the culture.",
                    "label": 0
                },
                {
                    "sent": "Of Deloitte, they know who we are, what we are, what the conditions are, and they also know their friends.",
                    "label": 0
                },
                {
                    "sent": "They know the quality of their friends and they are the best filter.",
                    "label": 0
                },
                {
                    "sent": "It makes hey, Charles, life.",
                    "label": 0
                },
                {
                    "sent": "So much simpler.",
                    "label": 0
                },
                {
                    "sent": "The head hunting agencies hate us for it.",
                    "label": 1
                },
                {
                    "sent": "But it it works, but we need each each firm has to find its own solution to filling the gap I'll go on.",
                    "label": 0
                },
                {
                    "sent": "Papa and these are the arrows, the bottom three and actually the bottom 3 point to the right three.",
                    "label": 0
                },
                {
                    "sent": "The bottom 3.2 something that I call it a job well done.",
                    "label": 1
                },
                {
                    "sent": "3rd from the bottom is providing flexible work arrangements.",
                    "label": 0
                },
                {
                    "sent": "I don't think we we are very yet.",
                    "label": 0
                },
                {
                    "sent": "But I think we are a hell of a lot closer than 10 years ago or 20 years ago when I started working.",
                    "label": 0
                },
                {
                    "sent": "We have down down dialing your career.",
                    "label": 0
                },
                {
                    "sent": "We have up dialing your career.",
                    "label": 0
                },
                {
                    "sent": "We have people working from home.",
                    "label": 0
                },
                {
                    "sent": "We have people with all kinds of arrangements.",
                    "label": 0
                },
                {
                    "sent": "If it fits in, the job, gets done and we are, we deploy to bliss because we have a job that we can basically do from anywhere as long as I have a connection to the Internet.",
                    "label": 0
                },
                {
                    "sent": "But and other firms do have more difficulty.",
                    "label": 0
                },
                {
                    "sent": "But we we we know the issue when we are doing something about it and that's why it's down at the bottom of the list.",
                    "label": 0
                },
                {
                    "sent": "The other, the second from the bottom, is evaluating implementing HR technologies and systems also way down at the bottom of the List 10 years ago, in eight years ago in my the second HR roll.",
                    "label": 0
                },
                {
                    "sent": "We did a global rollout of a whole pile of HR technology.",
                    "label": 0
                },
                {
                    "sent": "There was a whole pile of good work being done by HR units, but we couldn't analyze it.",
                    "label": 0
                },
                {
                    "sent": "So the investment in the technologies has been done, and again, that's why it's down there.",
                    "label": 0
                },
                {
                    "sent": "My favorite, and I am very proud of this one.",
                    "label": 0
                },
                {
                    "sent": "Only 3% of people.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "I asked thoughts that.",
                    "label": 0
                },
                {
                    "sent": "HR and the aligning HR and talent with the business priorities.",
                    "label": 0
                },
                {
                    "sent": "Many years ago I remember that we had issues that HR leaders often didn't know how to read a P&L.",
                    "label": 0
                },
                {
                    "sent": "And that caused significant difficulties because the role of HR was not fully understood.",
                    "label": 0
                },
                {
                    "sent": "It was something that was emerging.",
                    "label": 0
                },
                {
                    "sent": "But now we have something that is significantly better.",
                    "label": 0
                },
                {
                    "sent": "We have leaders focusing on it more significantly.",
                    "label": 0
                },
                {
                    "sent": "More and more companies are putting the Chief HR officer.",
                    "label": 0
                },
                {
                    "sent": "In the top of the management and strategy strategic thinking.",
                    "label": 0
                },
                {
                    "sent": "And that's that is.",
                    "label": 0
                },
                {
                    "sent": "A lot of hard work over the last 10 or 15 years by people who were still trying to get their their brains around it.",
                    "label": 0
                },
                {
                    "sent": "How are we going?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good OK. Now in one of the early slides I mentioned that there were certain areas where business leaders feared that there would be a talent shortage.",
                    "label": 0
                },
                {
                    "sent": "This slide is fairly short and sweet.",
                    "label": 0
                },
                {
                    "sent": "At the top and with 72% of business leaders globally, consider research and development as being.",
                    "label": 0
                },
                {
                    "sent": "The top problem area for finding new people directly beneath it is executive leadership.",
                    "label": 0
                },
                {
                    "sent": "Executive leadership.",
                    "label": 0
                },
                {
                    "sent": "And and research and development interesting.",
                    "label": 0
                },
                {
                    "sent": "Lee at the top.",
                    "label": 0
                },
                {
                    "sent": "And when I looked at this slide the first time, I said OK, why?",
                    "label": 0
                },
                {
                    "sent": "Why are these two areas at the top of the questionnaire?",
                    "label": 0
                },
                {
                    "sent": "And the answer I came up with was they are the sources of innovation.",
                    "label": 1
                },
                {
                    "sent": "Basically leaders and research and development are innovating and innovation is the only way we can go forward.",
                    "label": 0
                },
                {
                    "sent": "We need to make things better, quicker, more efficient and so those areas is where there's going to be a lot of demand and and the people who are good at it harder and harder to find.",
                    "label": 0
                },
                {
                    "sent": "Now we do have a slight this.",
                    "label": 0
                },
                {
                    "sent": "This particular slide is the global results.",
                    "label": 0
                },
                {
                    "sent": "There are other Ripper tables in the report.",
                    "label": 0
                },
                {
                    "sent": "And one of the points to a difference that we will find in Europe.",
                    "label": 0
                },
                {
                    "sent": "Europe has some other areas where they need to get rid of that where they need to, where they fear that they will have a shortage and it's a bit surprising when I looked at it and I and I'm going to ask you guys to consider why is Europe?",
                    "label": 0
                },
                {
                    "sent": "Two to three points higher than the global on sales on HR and Talents on procurement and supply chain and customer service.",
                    "label": 0
                },
                {
                    "sent": "Those four areas are still.",
                    "label": 0
                },
                {
                    "sent": "Considered in Europe to be.",
                    "label": 0
                },
                {
                    "sent": "Worse off then on the global picture.",
                    "label": 0
                },
                {
                    "sent": "Are we behind?",
                    "label": 0
                },
                {
                    "sent": "Are we catching up or are we looking into the future and realizing a demand that Asia and the Americas haven't seen yet?",
                    "label": 0
                },
                {
                    "sent": "OK, this is a big slide with.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I have small print so.",
                    "label": 0
                },
                {
                    "sent": "OK there the core talent management priorities again and I slide I do not have the time or the inclination to go through them one by one, but at the top again, performance management, merging leaders, high potentials at the bottom.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "At the bottom we have.",
                    "label": 0
                },
                {
                    "sent": "Offshored the hires so.",
                    "label": 0
                },
                {
                    "sent": "There is a trend and it's global and most of these things it doesn't really make a difference where you are.",
                    "label": 0
                },
                {
                    "sent": "You've got the focus areas and that we need to identify.",
                    "label": 0
                },
                {
                    "sent": "And address again complicated company country to country.",
                    "label": 0
                },
                {
                    "sent": "There are specifics depending on where the particular economy and in particular company is at that point in time.",
                    "label": 0
                },
                {
                    "sent": "But what we need to do each and everyone of us and I have no answers for anyone here today.",
                    "label": 0
                },
                {
                    "sent": "I'm purely saying this is what the world top leadership is saying.",
                    "label": 0
                },
                {
                    "sent": "Where do we find ourselves in that scenario?",
                    "label": 0
                },
                {
                    "sent": "So we need to identify what it is and then start doing the strategies because our workforce is no longer the workforce of 20 or 30 years ago or where people got a job and then retired there.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Retention.",
                    "label": 0
                },
                {
                    "sent": "In a new playing field and it's the strategies we have are not working.",
                    "label": 1
                },
                {
                    "sent": "Like I said next week, I fear that I will be back to 2007 levels of turnover.",
                    "label": 0
                },
                {
                    "sent": "So what am I doing wrong?",
                    "label": 0
                },
                {
                    "sent": "Why is this happening?",
                    "label": 0
                },
                {
                    "sent": "Obviously I haven't got.",
                    "label": 0
                },
                {
                    "sent": "The I haven't got the the right thing are I haven't identified things correctly, so I've got a job for the next couple of years and that that makes me happy, but.",
                    "label": 0
                },
                {
                    "sent": "If your turnover is not controlled.",
                    "label": 0
                },
                {
                    "sent": "Then we need to look at why isn't it controlled?",
                    "label": 0
                },
                {
                    "sent": "What's changing in the workplace?",
                    "label": 0
                },
                {
                    "sent": "That strategies that used to work aren't working any longer.",
                    "label": 0
                },
                {
                    "sent": "OK, basically if you have retention strategy.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "These need to focus.",
                    "label": 0
                },
                {
                    "sent": "And this is these are the thoughts of global leadership.",
                    "label": 0
                },
                {
                    "sent": "We need to be focusing on emerging leaders.",
                    "label": 1
                },
                {
                    "sent": "That is investing time and money in people that we've identified as potential leaders and.",
                    "label": 0
                },
                {
                    "sent": "There's a huge difference, and we all know it between the leader and the manager, and we need to find those leaders and we need to develop them and we need to have them there because they are the ones who are going to take us forward.",
                    "label": 0
                },
                {
                    "sent": "We need to focus on gender and generation an I said gender and generation even though it says generation and gender.",
                    "label": 1
                },
                {
                    "sent": "Gender and generation was what I was introduced to 20 something years ago when I had my first involvement with HR issues.",
                    "label": 0
                },
                {
                    "sent": "Now it's become generation and gender.",
                    "label": 0
                },
                {
                    "sent": "The number of women in this room is a significant.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "Is a significant turn around from what we had in the past and a lot of the issues that had to be dealt with.",
                    "label": 0
                },
                {
                    "sent": "For industry to stop losing talented women.",
                    "label": 0
                },
                {
                    "sent": "Have been addressed.",
                    "label": 0
                },
                {
                    "sent": "We've got a long, long way to go.",
                    "label": 0
                },
                {
                    "sent": "But we we we, we know it's a problem.",
                    "label": 0
                },
                {
                    "sent": "We're focusing on it and we're going forward.",
                    "label": 0
                },
                {
                    "sent": "However, the reason generation is first is because there is a new issue out there in the marketplace.",
                    "label": 0
                },
                {
                    "sent": "It is the generation gap that's happening.",
                    "label": 0
                },
                {
                    "sent": "It happens every 20 or 30 years and the whole world panics about it and the older generation considers, well, it's all going to pot.",
                    "label": 1
                },
                {
                    "sent": "We know it isn't going to go to pot because the hippies of the 60s are today's business leaders and today's generation will be the business leaders.",
                    "label": 0
                },
                {
                    "sent": "It's a natural progression, but we need to focus on generation to make sure that we keep them active.",
                    "label": 0
                },
                {
                    "sent": "We keep them in our firms, we keep them.",
                    "label": 0
                },
                {
                    "sent": "The motivated so that they can become leaders because the big ingredient for leadership is time and wisdom that comes out of time.",
                    "label": 0
                },
                {
                    "sent": "Focus on employer brands.",
                    "label": 0
                },
                {
                    "sent": "I mentioned that earlier with the recruitment employer branding has become a major major issue in getting getting the right people.",
                    "label": 0
                },
                {
                    "sent": "At the moment I spend 10 times more money per graduate recruit in Hungary than I do in any other country in my region.",
                    "label": 0
                },
                {
                    "sent": "The reason is their labor market has become very sophisticated.",
                    "label": 0
                },
                {
                    "sent": "At that level, at the graduate level, the universities aren't producing enough people.",
                    "label": 0
                },
                {
                    "sent": "I'm hungry, is flooded with service centers which is swallowing and spitting out people every year and they don't.",
                    "label": 0
                },
                {
                    "sent": "The type of career path that those companies are offering our short-term and firms that need long term solutions cannot afford to hire the person.",
                    "label": 0
                },
                {
                    "sent": "Pay him top dollar and invest in him at the same time so.",
                    "label": 0
                },
                {
                    "sent": "Because the generations are changing, the brand is very important and we will see that as we go through the further focus on incentives.",
                    "label": 0
                },
                {
                    "sent": "We're always looking at the incentives.",
                    "label": 0
                },
                {
                    "sent": "What makes people click on it.",
                    "label": 0
                },
                {
                    "sent": "And when I say incentives, it's non financial that we really need to focus on.",
                    "label": 0
                },
                {
                    "sent": "What makes your company different to all the other companies in Slovenia?",
                    "label": 0
                },
                {
                    "sent": "To all the other companies in the world position one is the company culture.",
                    "label": 0
                },
                {
                    "sent": "You've got to know what the you have.",
                    "label": 0
                },
                {
                    "sent": "A company culture.",
                    "label": 0
                },
                {
                    "sent": "Have you identified it?",
                    "label": 0
                },
                {
                    "sent": "And when you've identified it, does the rest of Slovenia know what it means to?",
                    "label": 0
                },
                {
                    "sent": "What does that brand mean compensation?",
                    "label": 0
                },
                {
                    "sent": "Always has to be there, but more and more importantly, future opportunities is where we're headed.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will close on this slide.",
                    "label": 0
                },
                {
                    "sent": "Well, I won't there's one more slide that I wanted to do, but.",
                    "label": 0
                },
                {
                    "sent": "If you look at this Generation Y and all of this is going to be on the website Generation Y has its own number one position for attention.",
                    "label": 0
                },
                {
                    "sent": "Company culture is most important Generation X, baby boomers veterans.",
                    "label": 0
                },
                {
                    "sent": "None of them even consider that to be an issue.",
                    "label": 0
                },
                {
                    "sent": "#2 flexible work hours.",
                    "label": 0
                },
                {
                    "sent": "The only other person that thinks of it are the veterans.",
                    "label": 0
                },
                {
                    "sent": "So the mindset of the new generation of the future leaders of our firms has changed significantly and.",
                    "label": 0
                },
                {
                    "sent": "I'll leave you with this thing.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What a wise man once said.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Mr Tipton thank you Anna cloud.",
                    "label": 0
                },
                {
                    "sent": "Mr Twit and you know there were some surprises in this presentation for me too, yeah, but like Petra said, you know they always challenged that adept at that exactly only 14% of people are able to adapt by some researches.",
                    "label": 0
                },
                {
                    "sent": "So you are one of the 14%.",
                    "label": 1
                },
                {
                    "sent": "Yeah Gratulation, thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Equipment at super.",
                    "label": 0
                },
                {
                    "sent": "Say resume it on email.",
                    "label": 0
                },
                {
                    "sent": "Mineola, Slovenia banaszak his Kushner Hannastown are chassis Cremation and we monitor wall Talento Slovenie needed walls non yet couldn't Miss Magas car window to uni in total progression with Slovenia Kowalik Melody Hosti Adama name establish leave between Oso Bridgwood.",
                    "label": 0
                },
                {
                    "sent": "In dubious took Williams Marketing Manager, Museum director, and swagger, podia TE Stopper Shinies, Akai slow, Encino poet one in Naples, gas station, Prosonic girls to be more alpacca chewed and cognition petina Leto domanico vent and waste appearance of grass, Coutinho provision in Astana.",
                    "label": 0
                },
                {
                    "sent": "Grim Sydney.",
                    "label": 0
                },
                {
                    "sent": "Punkass Amir Sodoma chair premium or emerged Regina Aleenan for member near the Wish Casey Douma.",
                    "label": 0
                },
                {
                    "sent": "Cancel akubra, Josh.",
                    "label": 0
                },
                {
                    "sent": "Keep at it deluge in Kayla Cooper Nelson's Iowa demos Romuva Slovenia Triple Membean Soda Miata Casanovas we're missing some remote prayed printable brow.",
                    "label": 0
                }
            ]
        }
    }
}