{
    "id": "h4hp2ugu4gmfrlhehrtw4rubphrzubjr",
    "title": "Non-Conformant Harmonization: The Real Book in the Style of Take 6",
    "info": {
        "author": [
            "François Pachet, Sony Computer Science Laboratory (CSL) Paris"
        ],
        "published": "Aug. 8, 2014",
        "recorded": "June 2014",
        "category": [
            "Top->Arts",
            "Top->Philosophy",
            "Top->Social Sciences->Psychology",
            "Top->Computer Science->Artificial Intelligence",
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/iccc2014_pachet_real_book/",
    "segmentation": [
        [
            "So we talk about the harmonization an it's a subproject within the larger project about this style and creativity called flow machines."
        ],
        [
            "And there is a nice video we made that Simon's put on the yes somewhere there that tries to explain the vision and everything you know behind this project.",
            "Basically what's interesting, interesting.",
            "I think in the context of this conference, the idea that creation very often is about is done by people who play with different styles and try to combine stuff together.",
            "And there are many examples that have been already today.",
            "But the way we approach it is."
        ],
        [
            "Is by looking at a bit more specifically, basically the idea that what we want to do is we want to take a style that we consider the texture.",
            "So if you want the texture of the skin of a leopard is a texture, you know we take, we say creators very often that I want to take this style and then I want to have another context context structure constraint.",
            "Whatever you know, I want to draw a rhino, but I want to do it with that style and what's interesting very often that is when the style on the left and the constraint, the structure, the the other thing on the right.",
            "Come from different domains or not.",
            "Typical of each other.",
            "I know if you want to create a melody in the style of Paul McCartney that hires as stars by AC major and has email minor inside.",
            "OK, it's nice, but the most of them have it already but will try.",
            "You start to be creative often when you play with that try to push the style to the to its boundaries and so you get something.",
            "OK, so is this interesting?",
            "Is this creative?",
            "Not my.",
            "Problem is I think society tells what I'm interested is the implementation of the operation upstairs, the plus the whatever is not a plus, not change it.",
            "The more I get convolution thing well, anyway it's hard to do and the tools I want to build try to implement this.",
            "And we."
        ],
        [
            "Talking about sequential stuff, music, text and style is Markov.",
            "Then it's really hard to escape this guy this thing, by the way, was invented in 1913.",
            "So more than one century ago and the idea, the main idea that when trying to address that you can build Markov models of all sorts.",
            "But as soon as you want to put some constraints you are dead, you are stuck.",
            "The only thing you can do is generate contest precollege we say.",
            "Tinkering, you know, hoping thing with work, forgetting about complexity.",
            "You know pretending there is none, no one talks about complexity.",
            "Here is really interesting if it's complex and usually it's NP, and if it's NP, there is no solution and so we have also shown clearly that random walk is non controllable by definition and the reason is because control and constraints what they do is they violate the Markov hypothesis.",
            "OK"
        ],
        [
            "So This is why we have proposed proposed well really working to propose another approach in Markov chain estimation and generation that can cope with lot of constraints and is not the goal of this paper is to talk about everything.",
            "I will focus on this result that was published already three years ago.",
            "That's a kind of magical thing that if you we have shown that if you have what we call unary constraints constraints on holding on specific items in a sequence.",
            "Then there are polynomial.",
            "There is a polynomial algorithm that transforms your Markov model into another one so that you can do random walk in this other model and the constraints are satisfied and you have guarantee that you have all the solutions and the solution with the right probabilities.",
            "So you are not doing generating test, you are not doing tinkering with collage, you know exactly what you are doing.",
            "OK is a great thing we have used for a lot of stuff."
        ],
        [
            "Well above harmonization, this is the paper is about trying to apply this in harmonization.",
            "So harmonization problem is very old.",
            "So the one and a lot of variations, the one we're trying to address is you have a lead sheet.",
            "There was a lead sheet in the preceding Polish.",
            "It is a melody with chord sequence specified usually as labels strength like a minor E flat major 7.",
            "Whatever that kind of thing.",
            "So you have.",
            "It's a double sequence one with notes, one with strings denoting codes.",
            "And the goal of the problem is to produce a harmonization that is an end path series."
        ],
        [
            "Invoices, so if it's four parts, we have four voices that fit with the lead sheet of course, and that is in the style of a given some style, you know, so there's lots of different ways to do that.",
            "This is very old.",
            "I found this paper by Luke Steel by the way, dating from 1986, which is more or less 30 years ago.",
            "I mean this terrible.",
            "And it was already.",
            "I mean, it's a very old thing there the problem."
        ],
        [
            "So this is what you want to basically do a soprano upstairs you have called labels that didn't show and anyone to produce that."
        ],
        [
            "OK, the problem is that all these papers, including some by myself actually and Pierre 20 years ago.",
            "Everyone you know use every possible technology and the problem is it's extremely boring what you get and I'm talking now to the authors of these papers, myself included.",
            "Would you dare places examples to musicians you admire?",
            "You know.",
            "No guarantee was one of these guys.",
            "I know you did stuff on harmonization at some point.",
            "Well, not you, maybe your students.",
            "OK, so I've never seen any paper with many of them don't have any examples, but when they have, it's really boring.",
            "It's not something you can show, I mean talking about the evaluation.",
            "In my case evaluation is OK.",
            "I'm confident that my examples I can show them to some guy, you know I'm not ashamed.",
            "And this is boring.",
            "In the paper I'm trying to you know to claim that because mainly mainly because it's conforming, because basically people try to satisfy the constraint and in some sense harmonization is what you call a well defined problem, but has a Russell said some time ago.",
            "You know the problem is actually been defined away.",
            "So what do I mean by that is that you know the interesting bits have been removed by the very definition of the problem and which in fact it's not saying the problem itself is easy.",
            "Is actually combinatorially quite hard, but it's not the point.",
            "So what I want to say."
        ],
        [
            "Later, why do I mean by Nonconformance?",
            "So I'm taking this example, but it takes 6.",
            "It's a group.",
            "I like very much, it's 6 voice harmonization.",
            "Thinking how this song is hard.",
            "The Herald.",
            "Sorry Angel things which is a well known traditional song.",
            "And then at some point they do that.",
            "So I'm just highlighting the part which I think is interesting.",
            "And I have more sound, sorry.",
            "Doesn't work if I don't have this, not kind of.",
            "Let's play again, sorry, just the next track.",
            "So actually the little shit I estimated because of course these guys didn't have a lead sheet.",
            "You know the song is in the head, but I estimated the lead sheet I think is a reasonable estimation that alternative other than others to be flat.",
            "Here's a B flat chord, actually.",
            "And then it goes.",
            "Do a C7, but then what they do here is this is basically a E7 augmented 9.",
            "It's very nice.",
            "I mean it does something.",
            "I mean to be made at least OK, this is non conformant.",
            "There is no way you can do that if your problem is to harmonize conformative way.",
            "OK, so this is the kind of thing trying to graph to capture.",
            "Yeah, yeah, I can play it forever.",
            "So I mean, it's.",
            "The trampoline zombies?",
            "Quiet."
        ],
        [
            "So what is this thing?",
            "How can I model it?",
            "I think it's interesting because it's precisely where creativity lies in.",
            "Harmonization is exactly where the problems of the well defined problems have escaped random.",
            "Don't talk about random.",
            "To me, it's like Garen don't talk about Cobra.",
            "So there is a solution Markov constraint.",
            "It turned out that it worked very well to model non conformance.",
            "Basically the idea I will show you a few seconds.",
            "The idea that you know you can unleash the style by doing a kind of random walk, but it works only if you constrain it very very tightly on the extremities and extremes.",
            "In the example I showed it was completely conformal.",
            "Actually on the left and on the right, but in the middle something happens but not random.",
            "Something happened is which is typical of take six, so the style random walk OK but with constraints.",
            "OK, no one can do this as far as I know today without those tech."
        ],
        [
            "Thanks.",
            "So the example I'm taking here is this song by John Coltrane.",
            "Which is chosen is quieter, is quite difficult, and it's sign a love note letter, harmonies called changes at each node, and the goal is."
        ],
        [
            "OK. How to harmonize this so you could say I mean the paper?",
            "A lot of discussions about ways to do that, but the the conformant harmonization would be something like this, you know.",
            "Dubled perfect.",
            "My mistake and you can say well that harmonic that distance here is optimal.",
            "We use dynamic programming.",
            "Very large copies stop, so let's use.",
            "You know harmonic distance a bit more loose, you know.",
            "Let's try to find calls that are not really G. Several first one is CB major.",
            "Let's do something more.",
            "Bit strange.",
            "You know you can do this easily.",
            "This one is a bit strange.",
            "Yeah, OK, that is not very very very interesting and this one is let's let's lose a bit more.",
            "All these called by the way our from the corpus, I mean even the transitions from the corpus, so it doesn't work.",
            "I mean it doesn't work.",
            "You go directly from conformance to junk.",
            "There is nothing.",
            "There is no sweet spot in the middle.",
            "And this is exactly what I'm trying to say.",
            "In this product.",
            "The sweet spot you need.",
            "Combinatorial optimization is very hard to find actually."
        ],
        [
            "So the idea is very simple.",
            "Short sure is an Italian word means decoration, you know so, so the idea is that you are going to do some random walk controlled at some precise moment in the melody.",
            "For instance, I take this example.",
            "I want to harmonize this thing AE going to see to DA Minor going to D7, you know.",
            "And so I want.",
            "But then I want I want to have.",
            "I let the system explore a little bit during this node because it's very long.",
            "You know, it's 4 bits, so with three nodes.",
            "So it added a kind of chromaticism.",
            "These four notes OK in the style of techniques.",
            "This one is nice.",
            "Again.",
            "So this was perfectly a minor, perfectly discovered, and you see there is a very coherent, consistent walk in there, but completely constrained.",
            "And I can do this.",
            "With.",
            "Typical takes it kind of very dishonest.",
            "Well, nodes and so forth.",
            "And so forth.",
            "Nice, OK and I can generate this, including meal time.",
            "That is real time.",
            "If your machine is fast enough."
        ],
        [
            "So I can do giant step by bagner so you remember the song data.",
            "So I put the cord labels here.",
            "The soprano is somewhere there.",
            "I should have put it in red and then the here.",
            "The long notes.",
            "I do some random walk with a kind of random number of nodes, sometimes only two 34 nodes and I take rhythms.",
            "I have to invent rhythms.",
            "I take them from the real book.",
            "We have a large database with all the rhythms, so this is by Wagner.",
            "Goodnight both love.",
            "OK, OK."
        ],
        [
            "It's on the paper on the web OK, Why take six?",
            "I want to talk about techniques because someone in the reviewer told me you know what about this guy?",
            "OK, I think they are the best in the world.",
            "I mean, if you're interested in tonal harmony, jazz, complex, dissonant stuff, it's these guys are magicians.",
            "And so I said, I want to understand is really hard to to probably was about to say to program like them really hard and I I'm too shy to even."
        ],
        [
            "Think about seeing them so this is what I get with their style.",
            "Recognize the harmonies are very, very crappy channel sound OK."
        ],
        [
            "So what did I do?",
            "I didn't.",
            "I didn't go to see them, but I met this guy in Rio last year, even Lynn.",
            "So this guy is the most famous composer to alive today in Brazil.",
            "He's as famous as Robin in Brazil and he made the song which is the most re recorded song in history is great guy.",
            "I made an interview of him and he did this song.",
            "It compose a very famous song called Novel Translated in English by the island.",
            "Sad no.",
            "Can we have a little bit of sound for.",
            "It's a very slow.",
            "Can we have just a bit more sound please?",
            "Better my aceto.",
            "Town repeated with love.",
            "Interesting owing one.",
            "Staff met there about 10.",
            "And this guy is a is a is."
        ],
        [
            "Is a star the Super Mega Star and I went to interview him and at the end I told him OK.",
            "I'm going to play your song in the style of take six and take six is is friends and then when he told me oh they are my friends I thought OK I will not do that.",
            "So and this was, yeah, I'm almost done and this is the harmonization I played.",
            "So you can recognize.",
            "I mean, I don't have the time to do that in the Big Six, is there?",
            "I'm just going to show you the reaction, which is fun.",
            "Thank you, OK and so forth.",
            "I was."
        ],
        [
            "Happy you know it's a good evaluation.",
            "Come back to my first question, do you dare showing your example to the guy that's trying to imitate?",
            "You know?",
            "In that case, yes, lots of examples.",
            "I want to show you this one solar very well known song jazz standard data.",
            "This this is one with short chairs.",
            "Sorry again, just to show you.",
            "I mean pushed a bit to the extreme you know, can we have more sound?",
            "Kate.",
            "Oh no, so you can OK."
        ],
        [
            "So it's able to capture this idea of nonconformance in the claim doing it actually amount of constraints really make make the job very very well and you can actually turn this idea into creative devices, not only for imitation, yeah, but it's also for doing something new.",
            "So what I've done here is a general thing.",
            "I mean, I take a style, I take a constraint.",
            "And I apply one to the other and I create something.",
            "Not saying that is creating something interesting each time, but I think the basic mechanism for discovery basically.",
            "Of course, then you need a filter or you need a society.",
            "You need people to tell you it's good or not, but this operation with sequence is actually very complex, so we have done this.",
            "We can do this with what's nice in this approach with what the only thing we need is a lead sheet and we have all the treats in jazz now and a composer.",
            "The composer is given just buy a set.",
            "Of polyphonic scores, like a MIDI files.",
            "Even with errors non annotated.",
            "I don't need the annotation in there.",
            "I have harmonic distance that does the job right, so even files modified you find on the on the streets on the web is OK.",
            "I've learned some interesting experiments with all these guys and Luke also has composed Ng paraan so we can do that."
        ],
        [
            "It's an instance here of what we do engine in general.",
            "We have done this for core progression this Boulez Blues.",
            "Charlie Parker Blues with all different constraints and the most probable of them we have."
        ],
        [
            "On this with lyrics.",
            "You take yesterday by The Beatles.",
            "You keep the Ryman, the property applied to Bob Dylan and to whatever and the same operation here uses the same kind of technique."
        ],
        [
            "So conclusion is really that one.",
            "I mean, I'm very, very close to many things that people say here, but my viewpoint is that there are problems which are simple.",
            "You know.",
            "I mean, technically, combinatorially.",
            "And so I don't think I don't see really the point of discussing them to be.",
            "I mean, I'm a bit extreme here, but what is the complexity?",
            "I mean, when the problem is really hard, let's talk about it.",
            "You know, is it NP?",
            "Is it NP?",
            "Is it P?",
            "Is it pseudo polynomial?",
            "Is it I don't know?",
            "Is it whatever you know, no one talks about complexity is really a shame, because what we have shown in this work is that there are classes of constraints for which you can have a guarantee of complete search.",
            "So you don't do generating test, you just go directly to the result and then you can do more.",
            "You can optimize.",
            "You can do lots of.",
            "Stuff.",
            "OK, so and there is also the last sentence of the.",
            "Of the paper reviewer also said he didn't understand what I meant, so I I feel I have to explain, you know, I say that future is a is a enable is a device for style expression.",
            "It's a paradox.",
            "Why it's a paradox?",
            "Because in principle a future is a decoration, so it's not important.",
            "OK, what's important is are the right the strong notes of the melody.",
            "The rest is just, you know decorations and what I'm saying is that if you apply this idea of strong nodes plus style.",
            "You don't, you don't.",
            "You cannot actually harm.",
            "You cannot recognize this style because all the composers have used the same course, basically more or less.",
            "But if you use futures was really paradox that suddenly you recognize this time, so it's a paradox in that in that sense it's also a creative device and I have 0 minutes.",
            "There is lots of stuff on the web, but I want just to try to see it because I think a few minutes ago.",
            "Or first radio.",
            "Not sure if it was going to work, maybe not.",
            "Well, OK, I will fire them.",
            "OK so we decided where the problem of evaluation I might talk is finished.",
            "I just answering to my question.",
            "I just asked myself now.",
            "Yeah, don't don't waste my time.",
            "Yeah, I mean it's important when you do papers to have millions of examples, not one or two, you know.",
            "So This is why we're doing this radio.",
            "You will have indefinite infinite number of examples in each generation.",
            "Harmonization in the style of and virtuoso solos, and you will be able to listen to this day and night without stopping ever.",
            "Sorry.",
            "I wonder if you.",
            "Started to address the part harmonization problem, so I mean the.",
            "The code label from just the melody, so you could argue that you you're doing the Harmony visai realization because you already have record label.",
            "So for example, you could generate the code labels.",
            "And then realized Harmony in another.",
            "So yeah, we do it already because we have this.",
            "As you know the lead generation system generates a lead sheet with constraint without constraints.",
            "So you can generate a lead sheet saying you know I want to flat minor somewhere and I want this and I want that generously cheat and then you can harmonize the lead sheet directly.",
            "So to me it's not a hardware problem, it's a different problem.",
            "OK. To imitate the styles you Strat features from a millions miles of records of 1 composer.",
            "For example, Wagner isn't it, not billions of act now we use a trailer technology.",
            "Just extract, extract, extract products.",
            "But what algorithms do you use to extract the features?",
            "Or what procedure?",
            "Buy some paper.",
            "We just say we segment.",
            "We analyze accord the harmonic structure of the vertical structures and then put them in a kind of database and then we have a harmonic distance that tell us you know a flat major where is where all the things that are candidates.",
            "But this is the easy part.",
            "The difficult part is a mark of the Markovian aspect.",
            "To have code that actually follow each other.",
            "And this is where the constraint market constraints popular.",
            "Spend less in the room who have never written a paper with the word optimize or optimization, and probably never will like me.",
            "You're looking at to the extent that harmonization can be framed as a problem solving task, so therefore large amounts of AI, including constraint solving, is available to you, whereas some of other more interested in getting software to invent new problems and in tasks like text generation.",
            "Sometimes it's just not possible to phrase it as a problem, I just wanted to kind of defend those were not doing optimization, 'cause we're not really doing problem solving, I'm not doing.",
            "Optimization here I'm not doing.",
            "I created a problem that you cannot solve.",
            "And The thing is, you know when you when I say use not U is a community.",
            "Sure I mean many of the things people do here, they do it with generate and test.",
            "So and then they add up lots of stuck stuff you know and then stack up with other things.",
            "So in the end you don't really know what's working, what's not working, you cannot evaluate, you know to which extend the fact of having added an emotional agent actually compensates mistakes or problems from coming from another layer.",
            "What I'm saying that lots of problems have to do is control Markov chains and this problem.",
            "I mean, many of them have been solved, so you can just build more robust systems in which you understand more what's going on.",
            "I'm not saying creativity is problem solving.",
            "OK, but yeah OK.",
            "So thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we talk about the harmonization an it's a subproject within the larger project about this style and creativity called flow machines.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there is a nice video we made that Simon's put on the yes somewhere there that tries to explain the vision and everything you know behind this project.",
                    "label": 0
                },
                {
                    "sent": "Basically what's interesting, interesting.",
                    "label": 0
                },
                {
                    "sent": "I think in the context of this conference, the idea that creation very often is about is done by people who play with different styles and try to combine stuff together.",
                    "label": 0
                },
                {
                    "sent": "And there are many examples that have been already today.",
                    "label": 0
                },
                {
                    "sent": "But the way we approach it is.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is by looking at a bit more specifically, basically the idea that what we want to do is we want to take a style that we consider the texture.",
                    "label": 0
                },
                {
                    "sent": "So if you want the texture of the skin of a leopard is a texture, you know we take, we say creators very often that I want to take this style and then I want to have another context context structure constraint.",
                    "label": 0
                },
                {
                    "sent": "Whatever you know, I want to draw a rhino, but I want to do it with that style and what's interesting very often that is when the style on the left and the constraint, the structure, the the other thing on the right.",
                    "label": 0
                },
                {
                    "sent": "Come from different domains or not.",
                    "label": 0
                },
                {
                    "sent": "Typical of each other.",
                    "label": 0
                },
                {
                    "sent": "I know if you want to create a melody in the style of Paul McCartney that hires as stars by AC major and has email minor inside.",
                    "label": 0
                },
                {
                    "sent": "OK, it's nice, but the most of them have it already but will try.",
                    "label": 0
                },
                {
                    "sent": "You start to be creative often when you play with that try to push the style to the to its boundaries and so you get something.",
                    "label": 0
                },
                {
                    "sent": "OK, so is this interesting?",
                    "label": 0
                },
                {
                    "sent": "Is this creative?",
                    "label": 0
                },
                {
                    "sent": "Not my.",
                    "label": 0
                },
                {
                    "sent": "Problem is I think society tells what I'm interested is the implementation of the operation upstairs, the plus the whatever is not a plus, not change it.",
                    "label": 0
                },
                {
                    "sent": "The more I get convolution thing well, anyway it's hard to do and the tools I want to build try to implement this.",
                    "label": 0
                },
                {
                    "sent": "And we.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Talking about sequential stuff, music, text and style is Markov.",
                    "label": 0
                },
                {
                    "sent": "Then it's really hard to escape this guy this thing, by the way, was invented in 1913.",
                    "label": 0
                },
                {
                    "sent": "So more than one century ago and the idea, the main idea that when trying to address that you can build Markov models of all sorts.",
                    "label": 0
                },
                {
                    "sent": "But as soon as you want to put some constraints you are dead, you are stuck.",
                    "label": 0
                },
                {
                    "sent": "The only thing you can do is generate contest precollege we say.",
                    "label": 0
                },
                {
                    "sent": "Tinkering, you know, hoping thing with work, forgetting about complexity.",
                    "label": 0
                },
                {
                    "sent": "You know pretending there is none, no one talks about complexity.",
                    "label": 0
                },
                {
                    "sent": "Here is really interesting if it's complex and usually it's NP, and if it's NP, there is no solution and so we have also shown clearly that random walk is non controllable by definition and the reason is because control and constraints what they do is they violate the Markov hypothesis.",
                    "label": 1
                },
                {
                    "sent": "OK",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So This is why we have proposed proposed well really working to propose another approach in Markov chain estimation and generation that can cope with lot of constraints and is not the goal of this paper is to talk about everything.",
                    "label": 0
                },
                {
                    "sent": "I will focus on this result that was published already three years ago.",
                    "label": 0
                },
                {
                    "sent": "That's a kind of magical thing that if you we have shown that if you have what we call unary constraints constraints on holding on specific items in a sequence.",
                    "label": 0
                },
                {
                    "sent": "Then there are polynomial.",
                    "label": 0
                },
                {
                    "sent": "There is a polynomial algorithm that transforms your Markov model into another one so that you can do random walk in this other model and the constraints are satisfied and you have guarantee that you have all the solutions and the solution with the right probabilities.",
                    "label": 0
                },
                {
                    "sent": "So you are not doing generating test, you are not doing tinkering with collage, you know exactly what you are doing.",
                    "label": 0
                },
                {
                    "sent": "OK is a great thing we have used for a lot of stuff.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well above harmonization, this is the paper is about trying to apply this in harmonization.",
                    "label": 0
                },
                {
                    "sent": "So harmonization problem is very old.",
                    "label": 0
                },
                {
                    "sent": "So the one and a lot of variations, the one we're trying to address is you have a lead sheet.",
                    "label": 0
                },
                {
                    "sent": "There was a lead sheet in the preceding Polish.",
                    "label": 1
                },
                {
                    "sent": "It is a melody with chord sequence specified usually as labels strength like a minor E flat major 7.",
                    "label": 1
                },
                {
                    "sent": "Whatever that kind of thing.",
                    "label": 0
                },
                {
                    "sent": "So you have.",
                    "label": 0
                },
                {
                    "sent": "It's a double sequence one with notes, one with strings denoting codes.",
                    "label": 0
                },
                {
                    "sent": "And the goal of the problem is to produce a harmonization that is an end path series.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Invoices, so if it's four parts, we have four voices that fit with the lead sheet of course, and that is in the style of a given some style, you know, so there's lots of different ways to do that.",
                    "label": 0
                },
                {
                    "sent": "This is very old.",
                    "label": 0
                },
                {
                    "sent": "I found this paper by Luke Steel by the way, dating from 1986, which is more or less 30 years ago.",
                    "label": 0
                },
                {
                    "sent": "I mean this terrible.",
                    "label": 0
                },
                {
                    "sent": "And it was already.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's a very old thing there the problem.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is what you want to basically do a soprano upstairs you have called labels that didn't show and anyone to produce that.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, the problem is that all these papers, including some by myself actually and Pierre 20 years ago.",
                    "label": 0
                },
                {
                    "sent": "Everyone you know use every possible technology and the problem is it's extremely boring what you get and I'm talking now to the authors of these papers, myself included.",
                    "label": 0
                },
                {
                    "sent": "Would you dare places examples to musicians you admire?",
                    "label": 1
                },
                {
                    "sent": "You know.",
                    "label": 0
                },
                {
                    "sent": "No guarantee was one of these guys.",
                    "label": 0
                },
                {
                    "sent": "I know you did stuff on harmonization at some point.",
                    "label": 0
                },
                {
                    "sent": "Well, not you, maybe your students.",
                    "label": 0
                },
                {
                    "sent": "OK, so I've never seen any paper with many of them don't have any examples, but when they have, it's really boring.",
                    "label": 0
                },
                {
                    "sent": "It's not something you can show, I mean talking about the evaluation.",
                    "label": 0
                },
                {
                    "sent": "In my case evaluation is OK.",
                    "label": 0
                },
                {
                    "sent": "I'm confident that my examples I can show them to some guy, you know I'm not ashamed.",
                    "label": 0
                },
                {
                    "sent": "And this is boring.",
                    "label": 0
                },
                {
                    "sent": "In the paper I'm trying to you know to claim that because mainly mainly because it's conforming, because basically people try to satisfy the constraint and in some sense harmonization is what you call a well defined problem, but has a Russell said some time ago.",
                    "label": 1
                },
                {
                    "sent": "You know the problem is actually been defined away.",
                    "label": 0
                },
                {
                    "sent": "So what do I mean by that is that you know the interesting bits have been removed by the very definition of the problem and which in fact it's not saying the problem itself is easy.",
                    "label": 0
                },
                {
                    "sent": "Is actually combinatorially quite hard, but it's not the point.",
                    "label": 0
                },
                {
                    "sent": "So what I want to say.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Later, why do I mean by Nonconformance?",
                    "label": 1
                },
                {
                    "sent": "So I'm taking this example, but it takes 6.",
                    "label": 0
                },
                {
                    "sent": "It's a group.",
                    "label": 0
                },
                {
                    "sent": "I like very much, it's 6 voice harmonization.",
                    "label": 0
                },
                {
                    "sent": "Thinking how this song is hard.",
                    "label": 0
                },
                {
                    "sent": "The Herald.",
                    "label": 0
                },
                {
                    "sent": "Sorry Angel things which is a well known traditional song.",
                    "label": 0
                },
                {
                    "sent": "And then at some point they do that.",
                    "label": 0
                },
                {
                    "sent": "So I'm just highlighting the part which I think is interesting.",
                    "label": 0
                },
                {
                    "sent": "And I have more sound, sorry.",
                    "label": 0
                },
                {
                    "sent": "Doesn't work if I don't have this, not kind of.",
                    "label": 0
                },
                {
                    "sent": "Let's play again, sorry, just the next track.",
                    "label": 0
                },
                {
                    "sent": "So actually the little shit I estimated because of course these guys didn't have a lead sheet.",
                    "label": 0
                },
                {
                    "sent": "You know the song is in the head, but I estimated the lead sheet I think is a reasonable estimation that alternative other than others to be flat.",
                    "label": 0
                },
                {
                    "sent": "Here's a B flat chord, actually.",
                    "label": 0
                },
                {
                    "sent": "And then it goes.",
                    "label": 0
                },
                {
                    "sent": "Do a C7, but then what they do here is this is basically a E7 augmented 9.",
                    "label": 0
                },
                {
                    "sent": "It's very nice.",
                    "label": 0
                },
                {
                    "sent": "I mean it does something.",
                    "label": 0
                },
                {
                    "sent": "I mean to be made at least OK, this is non conformant.",
                    "label": 0
                },
                {
                    "sent": "There is no way you can do that if your problem is to harmonize conformative way.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is the kind of thing trying to graph to capture.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, I can play it forever.",
                    "label": 0
                },
                {
                    "sent": "So I mean, it's.",
                    "label": 0
                },
                {
                    "sent": "The trampoline zombies?",
                    "label": 0
                },
                {
                    "sent": "Quiet.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is this thing?",
                    "label": 0
                },
                {
                    "sent": "How can I model it?",
                    "label": 0
                },
                {
                    "sent": "I think it's interesting because it's precisely where creativity lies in.",
                    "label": 0
                },
                {
                    "sent": "Harmonization is exactly where the problems of the well defined problems have escaped random.",
                    "label": 0
                },
                {
                    "sent": "Don't talk about random.",
                    "label": 0
                },
                {
                    "sent": "To me, it's like Garen don't talk about Cobra.",
                    "label": 0
                },
                {
                    "sent": "So there is a solution Markov constraint.",
                    "label": 0
                },
                {
                    "sent": "It turned out that it worked very well to model non conformance.",
                    "label": 1
                },
                {
                    "sent": "Basically the idea I will show you a few seconds.",
                    "label": 0
                },
                {
                    "sent": "The idea that you know you can unleash the style by doing a kind of random walk, but it works only if you constrain it very very tightly on the extremities and extremes.",
                    "label": 0
                },
                {
                    "sent": "In the example I showed it was completely conformal.",
                    "label": 0
                },
                {
                    "sent": "Actually on the left and on the right, but in the middle something happens but not random.",
                    "label": 0
                },
                {
                    "sent": "Something happened is which is typical of take six, so the style random walk OK but with constraints.",
                    "label": 0
                },
                {
                    "sent": "OK, no one can do this as far as I know today without those tech.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "So the example I'm taking here is this song by John Coltrane.",
                    "label": 0
                },
                {
                    "sent": "Which is chosen is quieter, is quite difficult, and it's sign a love note letter, harmonies called changes at each node, and the goal is.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK. How to harmonize this so you could say I mean the paper?",
                    "label": 0
                },
                {
                    "sent": "A lot of discussions about ways to do that, but the the conformant harmonization would be something like this, you know.",
                    "label": 0
                },
                {
                    "sent": "Dubled perfect.",
                    "label": 0
                },
                {
                    "sent": "My mistake and you can say well that harmonic that distance here is optimal.",
                    "label": 0
                },
                {
                    "sent": "We use dynamic programming.",
                    "label": 0
                },
                {
                    "sent": "Very large copies stop, so let's use.",
                    "label": 0
                },
                {
                    "sent": "You know harmonic distance a bit more loose, you know.",
                    "label": 1
                },
                {
                    "sent": "Let's try to find calls that are not really G. Several first one is CB major.",
                    "label": 0
                },
                {
                    "sent": "Let's do something more.",
                    "label": 0
                },
                {
                    "sent": "Bit strange.",
                    "label": 0
                },
                {
                    "sent": "You know you can do this easily.",
                    "label": 0
                },
                {
                    "sent": "This one is a bit strange.",
                    "label": 0
                },
                {
                    "sent": "Yeah, OK, that is not very very very interesting and this one is let's let's lose a bit more.",
                    "label": 0
                },
                {
                    "sent": "All these called by the way our from the corpus, I mean even the transitions from the corpus, so it doesn't work.",
                    "label": 0
                },
                {
                    "sent": "I mean it doesn't work.",
                    "label": 0
                },
                {
                    "sent": "You go directly from conformance to junk.",
                    "label": 0
                },
                {
                    "sent": "There is nothing.",
                    "label": 0
                },
                {
                    "sent": "There is no sweet spot in the middle.",
                    "label": 0
                },
                {
                    "sent": "And this is exactly what I'm trying to say.",
                    "label": 0
                },
                {
                    "sent": "In this product.",
                    "label": 0
                },
                {
                    "sent": "The sweet spot you need.",
                    "label": 0
                },
                {
                    "sent": "Combinatorial optimization is very hard to find actually.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the idea is very simple.",
                    "label": 0
                },
                {
                    "sent": "Short sure is an Italian word means decoration, you know so, so the idea is that you are going to do some random walk controlled at some precise moment in the melody.",
                    "label": 0
                },
                {
                    "sent": "For instance, I take this example.",
                    "label": 0
                },
                {
                    "sent": "I want to harmonize this thing AE going to see to DA Minor going to D7, you know.",
                    "label": 0
                },
                {
                    "sent": "And so I want.",
                    "label": 0
                },
                {
                    "sent": "But then I want I want to have.",
                    "label": 0
                },
                {
                    "sent": "I let the system explore a little bit during this node because it's very long.",
                    "label": 0
                },
                {
                    "sent": "You know, it's 4 bits, so with three nodes.",
                    "label": 0
                },
                {
                    "sent": "So it added a kind of chromaticism.",
                    "label": 0
                },
                {
                    "sent": "These four notes OK in the style of techniques.",
                    "label": 0
                },
                {
                    "sent": "This one is nice.",
                    "label": 0
                },
                {
                    "sent": "Again.",
                    "label": 0
                },
                {
                    "sent": "So this was perfectly a minor, perfectly discovered, and you see there is a very coherent, consistent walk in there, but completely constrained.",
                    "label": 0
                },
                {
                    "sent": "And I can do this.",
                    "label": 0
                },
                {
                    "sent": "With.",
                    "label": 0
                },
                {
                    "sent": "Typical takes it kind of very dishonest.",
                    "label": 0
                },
                {
                    "sent": "Well, nodes and so forth.",
                    "label": 0
                },
                {
                    "sent": "And so forth.",
                    "label": 0
                },
                {
                    "sent": "Nice, OK and I can generate this, including meal time.",
                    "label": 0
                },
                {
                    "sent": "That is real time.",
                    "label": 0
                },
                {
                    "sent": "If your machine is fast enough.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I can do giant step by bagner so you remember the song data.",
                    "label": 0
                },
                {
                    "sent": "So I put the cord labels here.",
                    "label": 0
                },
                {
                    "sent": "The soprano is somewhere there.",
                    "label": 0
                },
                {
                    "sent": "I should have put it in red and then the here.",
                    "label": 0
                },
                {
                    "sent": "The long notes.",
                    "label": 0
                },
                {
                    "sent": "I do some random walk with a kind of random number of nodes, sometimes only two 34 nodes and I take rhythms.",
                    "label": 0
                },
                {
                    "sent": "I have to invent rhythms.",
                    "label": 0
                },
                {
                    "sent": "I take them from the real book.",
                    "label": 0
                },
                {
                    "sent": "We have a large database with all the rhythms, so this is by Wagner.",
                    "label": 1
                },
                {
                    "sent": "Goodnight both love.",
                    "label": 0
                },
                {
                    "sent": "OK, OK.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's on the paper on the web OK, Why take six?",
                    "label": 1
                },
                {
                    "sent": "I want to talk about techniques because someone in the reviewer told me you know what about this guy?",
                    "label": 0
                },
                {
                    "sent": "OK, I think they are the best in the world.",
                    "label": 1
                },
                {
                    "sent": "I mean, if you're interested in tonal harmony, jazz, complex, dissonant stuff, it's these guys are magicians.",
                    "label": 0
                },
                {
                    "sent": "And so I said, I want to understand is really hard to to probably was about to say to program like them really hard and I I'm too shy to even.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Think about seeing them so this is what I get with their style.",
                    "label": 0
                },
                {
                    "sent": "Recognize the harmonies are very, very crappy channel sound OK.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what did I do?",
                    "label": 0
                },
                {
                    "sent": "I didn't.",
                    "label": 0
                },
                {
                    "sent": "I didn't go to see them, but I met this guy in Rio last year, even Lynn.",
                    "label": 0
                },
                {
                    "sent": "So this guy is the most famous composer to alive today in Brazil.",
                    "label": 0
                },
                {
                    "sent": "He's as famous as Robin in Brazil and he made the song which is the most re recorded song in history is great guy.",
                    "label": 0
                },
                {
                    "sent": "I made an interview of him and he did this song.",
                    "label": 0
                },
                {
                    "sent": "It compose a very famous song called Novel Translated in English by the island.",
                    "label": 0
                },
                {
                    "sent": "Sad no.",
                    "label": 0
                },
                {
                    "sent": "Can we have a little bit of sound for.",
                    "label": 0
                },
                {
                    "sent": "It's a very slow.",
                    "label": 0
                },
                {
                    "sent": "Can we have just a bit more sound please?",
                    "label": 0
                },
                {
                    "sent": "Better my aceto.",
                    "label": 0
                },
                {
                    "sent": "Town repeated with love.",
                    "label": 0
                },
                {
                    "sent": "Interesting owing one.",
                    "label": 0
                },
                {
                    "sent": "Staff met there about 10.",
                    "label": 0
                },
                {
                    "sent": "And this guy is a is a is.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is a star the Super Mega Star and I went to interview him and at the end I told him OK.",
                    "label": 0
                },
                {
                    "sent": "I'm going to play your song in the style of take six and take six is is friends and then when he told me oh they are my friends I thought OK I will not do that.",
                    "label": 1
                },
                {
                    "sent": "So and this was, yeah, I'm almost done and this is the harmonization I played.",
                    "label": 0
                },
                {
                    "sent": "So you can recognize.",
                    "label": 0
                },
                {
                    "sent": "I mean, I don't have the time to do that in the Big Six, is there?",
                    "label": 0
                },
                {
                    "sent": "I'm just going to show you the reaction, which is fun.",
                    "label": 0
                },
                {
                    "sent": "Thank you, OK and so forth.",
                    "label": 0
                },
                {
                    "sent": "I was.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Happy you know it's a good evaluation.",
                    "label": 0
                },
                {
                    "sent": "Come back to my first question, do you dare showing your example to the guy that's trying to imitate?",
                    "label": 0
                },
                {
                    "sent": "You know?",
                    "label": 0
                },
                {
                    "sent": "In that case, yes, lots of examples.",
                    "label": 0
                },
                {
                    "sent": "I want to show you this one solar very well known song jazz standard data.",
                    "label": 0
                },
                {
                    "sent": "This this is one with short chairs.",
                    "label": 0
                },
                {
                    "sent": "Sorry again, just to show you.",
                    "label": 0
                },
                {
                    "sent": "I mean pushed a bit to the extreme you know, can we have more sound?",
                    "label": 0
                },
                {
                    "sent": "Kate.",
                    "label": 0
                },
                {
                    "sent": "Oh no, so you can OK.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So it's able to capture this idea of nonconformance in the claim doing it actually amount of constraints really make make the job very very well and you can actually turn this idea into creative devices, not only for imitation, yeah, but it's also for doing something new.",
                    "label": 0
                },
                {
                    "sent": "So what I've done here is a general thing.",
                    "label": 0
                },
                {
                    "sent": "I mean, I take a style, I take a constraint.",
                    "label": 0
                },
                {
                    "sent": "And I apply one to the other and I create something.",
                    "label": 0
                },
                {
                    "sent": "Not saying that is creating something interesting each time, but I think the basic mechanism for discovery basically.",
                    "label": 0
                },
                {
                    "sent": "Of course, then you need a filter or you need a society.",
                    "label": 0
                },
                {
                    "sent": "You need people to tell you it's good or not, but this operation with sequence is actually very complex, so we have done this.",
                    "label": 1
                },
                {
                    "sent": "We can do this with what's nice in this approach with what the only thing we need is a lead sheet and we have all the treats in jazz now and a composer.",
                    "label": 0
                },
                {
                    "sent": "The composer is given just buy a set.",
                    "label": 0
                },
                {
                    "sent": "Of polyphonic scores, like a MIDI files.",
                    "label": 1
                },
                {
                    "sent": "Even with errors non annotated.",
                    "label": 0
                },
                {
                    "sent": "I don't need the annotation in there.",
                    "label": 0
                },
                {
                    "sent": "I have harmonic distance that does the job right, so even files modified you find on the on the streets on the web is OK.",
                    "label": 0
                },
                {
                    "sent": "I've learned some interesting experiments with all these guys and Luke also has composed Ng paraan so we can do that.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's an instance here of what we do engine in general.",
                    "label": 0
                },
                {
                    "sent": "We have done this for core progression this Boulez Blues.",
                    "label": 0
                },
                {
                    "sent": "Charlie Parker Blues with all different constraints and the most probable of them we have.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On this with lyrics.",
                    "label": 0
                },
                {
                    "sent": "You take yesterday by The Beatles.",
                    "label": 0
                },
                {
                    "sent": "You keep the Ryman, the property applied to Bob Dylan and to whatever and the same operation here uses the same kind of technique.",
                    "label": 1
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So conclusion is really that one.",
                    "label": 0
                },
                {
                    "sent": "I mean, I'm very, very close to many things that people say here, but my viewpoint is that there are problems which are simple.",
                    "label": 0
                },
                {
                    "sent": "You know.",
                    "label": 0
                },
                {
                    "sent": "I mean, technically, combinatorially.",
                    "label": 0
                },
                {
                    "sent": "And so I don't think I don't see really the point of discussing them to be.",
                    "label": 0
                },
                {
                    "sent": "I mean, I'm a bit extreme here, but what is the complexity?",
                    "label": 0
                },
                {
                    "sent": "I mean, when the problem is really hard, let's talk about it.",
                    "label": 0
                },
                {
                    "sent": "You know, is it NP?",
                    "label": 0
                },
                {
                    "sent": "Is it NP?",
                    "label": 0
                },
                {
                    "sent": "Is it P?",
                    "label": 0
                },
                {
                    "sent": "Is it pseudo polynomial?",
                    "label": 0
                },
                {
                    "sent": "Is it I don't know?",
                    "label": 0
                },
                {
                    "sent": "Is it whatever you know, no one talks about complexity is really a shame, because what we have shown in this work is that there are classes of constraints for which you can have a guarantee of complete search.",
                    "label": 0
                },
                {
                    "sent": "So you don't do generating test, you just go directly to the result and then you can do more.",
                    "label": 0
                },
                {
                    "sent": "You can optimize.",
                    "label": 0
                },
                {
                    "sent": "You can do lots of.",
                    "label": 0
                },
                {
                    "sent": "Stuff.",
                    "label": 0
                },
                {
                    "sent": "OK, so and there is also the last sentence of the.",
                    "label": 0
                },
                {
                    "sent": "Of the paper reviewer also said he didn't understand what I meant, so I I feel I have to explain, you know, I say that future is a is a enable is a device for style expression.",
                    "label": 1
                },
                {
                    "sent": "It's a paradox.",
                    "label": 0
                },
                {
                    "sent": "Why it's a paradox?",
                    "label": 0
                },
                {
                    "sent": "Because in principle a future is a decoration, so it's not important.",
                    "label": 0
                },
                {
                    "sent": "OK, what's important is are the right the strong notes of the melody.",
                    "label": 0
                },
                {
                    "sent": "The rest is just, you know decorations and what I'm saying is that if you apply this idea of strong nodes plus style.",
                    "label": 0
                },
                {
                    "sent": "You don't, you don't.",
                    "label": 0
                },
                {
                    "sent": "You cannot actually harm.",
                    "label": 0
                },
                {
                    "sent": "You cannot recognize this style because all the composers have used the same course, basically more or less.",
                    "label": 0
                },
                {
                    "sent": "But if you use futures was really paradox that suddenly you recognize this time, so it's a paradox in that in that sense it's also a creative device and I have 0 minutes.",
                    "label": 0
                },
                {
                    "sent": "There is lots of stuff on the web, but I want just to try to see it because I think a few minutes ago.",
                    "label": 0
                },
                {
                    "sent": "Or first radio.",
                    "label": 0
                },
                {
                    "sent": "Not sure if it was going to work, maybe not.",
                    "label": 0
                },
                {
                    "sent": "Well, OK, I will fire them.",
                    "label": 0
                },
                {
                    "sent": "OK so we decided where the problem of evaluation I might talk is finished.",
                    "label": 0
                },
                {
                    "sent": "I just answering to my question.",
                    "label": 0
                },
                {
                    "sent": "I just asked myself now.",
                    "label": 0
                },
                {
                    "sent": "Yeah, don't don't waste my time.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I mean it's important when you do papers to have millions of examples, not one or two, you know.",
                    "label": 0
                },
                {
                    "sent": "So This is why we're doing this radio.",
                    "label": 0
                },
                {
                    "sent": "You will have indefinite infinite number of examples in each generation.",
                    "label": 1
                },
                {
                    "sent": "Harmonization in the style of and virtuoso solos, and you will be able to listen to this day and night without stopping ever.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "I wonder if you.",
                    "label": 0
                },
                {
                    "sent": "Started to address the part harmonization problem, so I mean the.",
                    "label": 0
                },
                {
                    "sent": "The code label from just the melody, so you could argue that you you're doing the Harmony visai realization because you already have record label.",
                    "label": 0
                },
                {
                    "sent": "So for example, you could generate the code labels.",
                    "label": 0
                },
                {
                    "sent": "And then realized Harmony in another.",
                    "label": 0
                },
                {
                    "sent": "So yeah, we do it already because we have this.",
                    "label": 0
                },
                {
                    "sent": "As you know the lead generation system generates a lead sheet with constraint without constraints.",
                    "label": 0
                },
                {
                    "sent": "So you can generate a lead sheet saying you know I want to flat minor somewhere and I want this and I want that generously cheat and then you can harmonize the lead sheet directly.",
                    "label": 0
                },
                {
                    "sent": "So to me it's not a hardware problem, it's a different problem.",
                    "label": 0
                },
                {
                    "sent": "OK. To imitate the styles you Strat features from a millions miles of records of 1 composer.",
                    "label": 0
                },
                {
                    "sent": "For example, Wagner isn't it, not billions of act now we use a trailer technology.",
                    "label": 0
                },
                {
                    "sent": "Just extract, extract, extract products.",
                    "label": 0
                },
                {
                    "sent": "But what algorithms do you use to extract the features?",
                    "label": 0
                },
                {
                    "sent": "Or what procedure?",
                    "label": 0
                },
                {
                    "sent": "Buy some paper.",
                    "label": 0
                },
                {
                    "sent": "We just say we segment.",
                    "label": 0
                },
                {
                    "sent": "We analyze accord the harmonic structure of the vertical structures and then put them in a kind of database and then we have a harmonic distance that tell us you know a flat major where is where all the things that are candidates.",
                    "label": 0
                },
                {
                    "sent": "But this is the easy part.",
                    "label": 0
                },
                {
                    "sent": "The difficult part is a mark of the Markovian aspect.",
                    "label": 0
                },
                {
                    "sent": "To have code that actually follow each other.",
                    "label": 0
                },
                {
                    "sent": "And this is where the constraint market constraints popular.",
                    "label": 0
                },
                {
                    "sent": "Spend less in the room who have never written a paper with the word optimize or optimization, and probably never will like me.",
                    "label": 0
                },
                {
                    "sent": "You're looking at to the extent that harmonization can be framed as a problem solving task, so therefore large amounts of AI, including constraint solving, is available to you, whereas some of other more interested in getting software to invent new problems and in tasks like text generation.",
                    "label": 0
                },
                {
                    "sent": "Sometimes it's just not possible to phrase it as a problem, I just wanted to kind of defend those were not doing optimization, 'cause we're not really doing problem solving, I'm not doing.",
                    "label": 0
                },
                {
                    "sent": "Optimization here I'm not doing.",
                    "label": 0
                },
                {
                    "sent": "I created a problem that you cannot solve.",
                    "label": 0
                },
                {
                    "sent": "And The thing is, you know when you when I say use not U is a community.",
                    "label": 0
                },
                {
                    "sent": "Sure I mean many of the things people do here, they do it with generate and test.",
                    "label": 0
                },
                {
                    "sent": "So and then they add up lots of stuck stuff you know and then stack up with other things.",
                    "label": 0
                },
                {
                    "sent": "So in the end you don't really know what's working, what's not working, you cannot evaluate, you know to which extend the fact of having added an emotional agent actually compensates mistakes or problems from coming from another layer.",
                    "label": 0
                },
                {
                    "sent": "What I'm saying that lots of problems have to do is control Markov chains and this problem.",
                    "label": 0
                },
                {
                    "sent": "I mean, many of them have been solved, so you can just build more robust systems in which you understand more what's going on.",
                    "label": 0
                },
                {
                    "sent": "I'm not saying creativity is problem solving.",
                    "label": 0
                },
                {
                    "sent": "OK, but yeah OK.",
                    "label": 0
                },
                {
                    "sent": "So thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}