{
    "id": "h6bns5yae32fzxmxzeff56mhvixrdapa",
    "title": "Semantic Concept Discovery Over Event Data",
    "info": {
        "author": [
            "Oktie Hassanzadeh, IBM Thomas J. Watson Research Center"
        ],
        "published": "Nov. 28, 2017",
        "recorded": "November 2017",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2017_hassanzadeh_data/",
    "segmentation": [
        [
            "Hello everyone, so I'm going to talk about a project we have at IBM Research AI with the high level goal of helping analysts with their job and this could be different kinds of analysts.",
            "This could be business analysts, financial analysts, risk analysts within an enterprise and this is a relatively large project.",
            "What I'm going to talk about today."
        ],
        [
            "Day is 1 component of this project which is about the very first step of.",
            "Of the task, basically where the analyst start their job and and basically the high level goal here is to help the analysts to create high quality report given a question or or or a topic right.",
            "Basically a set of entities and concepts that is in in that question and I have an example.",
            "That I updated just this morning to make it a bit more local.",
            "The previous example I had was from Brazil, but this example is basically the question is what are the consequences of Brexit on London's financial markets, right?",
            "So if if an analyst wants to write a report on this to give advice to an enterprise decision makers what he or she needs to know is?",
            "The key topics that needs to be covered in this report there are there could be broad topics such as financial markets, economy and so on.",
            "And then there are more specific topics such as Brexit and the Brexit divorce bill and then the other aspect that needs to be covered is basically key entities, key people and organizations.",
            "Any decision makers that could affect the negotiations that are going on about.",
            "The Brexit and also all the related events, right negotiation, meetings and parliamentary elections.",
            "All the elections that could affect the basically the decision makers and that decision process, right?",
            "So what's the?"
        ],
        [
            "Process right now for.",
            "For typical analysts, how do they do this?",
            "Usually this first phase, the discovery phase, is an isolated process, right?",
            "That it happens in a very classic way.",
            "It could be just looking into several sources of information, just going on news media and there of course tools that assist the analyst about this to find out what's going on.",
            "There are also tools that.",
            "Alerts the analyst about what's going on and if certain people or topics are mentioned.",
            "But then often, what happens next is that you need to do something else on top of that, right?",
            "The report is not just talking mentioning these concepts, but you need to do some deeper analysis, for example.",
            "You need to do forecasts, right?",
            "You need to try to predict what is going to happen in the future.",
            "So there are two problems in this classic way of doing things.",
            "One is this isolated process can result in.",
            "In information Dad is is biased an incomplete.",
            "So one thing is that analysts and humans in general could be very bias, right?",
            "They trust their own sources, they are already usually experts in a given topic and and that expertise can actually produce by us right?",
            "And the other thing is this isolation, right when you do your search and then you do your analysis on completely different sources of information that can result in again."
        ],
        [
            "In this process and one particular type of analysis that is usually done is through the so-called event databases.",
            "I'm covering three prominent ones.",
            "This is not a comprehensive list, but these are three that we have been using in this project.",
            "Two of them did Elton Iqs.",
            "These are done mostly by political scientists, so they have a very specific definition of what an event is.",
            "So an event is basically an action that has opted to actors right?",
            "And then another one is the event registry.",
            "That is the start up in Slovenia and I see the co-founder here sitting in the front.",
            "So event Registry has a more generic notion of events, right?",
            "It's basically a cluster of articles on the same topic that's more in line with what we understand as events."
        ],
        [
            "And you can see they vary a lot, so in terms of coverage in terms of the size you can see they can be quite huge and and also in terms of so event registry is one that already uses semantic technologies.",
            "So it comes with concept annotations with your eyes that you can link.",
            "But detailed and Iqs are not like that."
        ],
        [
            "So what is our solution to this discovery aspect, right?",
            "So what we do is we build a unified index for all our events, databases and also our background knowledge that includes some of the general domain knowledge bases such as wiki data in DB pedia as well.",
            "And on top of that we built this semantic embeddings engine that helps us analyze the semantic similarity between all the values and fields and basically entities and concepts that are covered in these event databases.",
            "So the process is, very briefly, is that from the question you need to do natural language understanding to go to a set of topics and concepts mentioned in the question, and then you do you use those to query our back end API?",
            "Our concept discovery API.",
            "So I'm going to use some screenshots of."
        ],
        [
            "After prototype we have built.",
            "I can show you a live demo later on.",
            "You can find me in our IBM research booth or at the poster sessions at the Semantic Web Challenge section.",
            "So the process here and this is a very basic prototype to just show this component right so the analyst can enter a question which could be."
        ],
        [
            "The natural language question?",
            "Or just the set of?"
        ],
        [
            "Entities and topics.",
            "And as you can see we have ingested GDL team and registry and IQ's here."
        ],
        [
            "And then one use of semantic technologies we have is basically for data integration.",
            "So the box you see on top we call it global context."
        ],
        [
            "Those are things that you can click on them and you will see the facts coming from a background knowledge base.",
            "We call it fact based API.",
            "So, so the concepts that are mentioned in the question are basically can be looked up from our Knowledge base index, Knowledge Graph API and and then those concepts can also be found across these sources, right event registry and an IQ zonji dealt."
        ],
        [
            "And then this is one other view that we are showing here.",
            "This view is generated using the semantic embeddings engine, so just in a very high level this is something that the results that you see here is the results of analyzing 157 million due dealt GCG records right?",
            "And you can do the same.",
            "We have the same for human registry as well and and this is a super fast engine that.",
            "The engine is done also by Michael Glass who is sitting right there.",
            "So I can show you a live demo so under in a millisecond time you can do this retrieval."
        ],
        [
            "And and all of these these components are built through microservices.",
            "We have swagger API's in the back end that power this.",
            "So this is an example of how the this API work that we call it deep."
        ],
        [
            "And we have a similar.",
            "We also have basically a baseline as well, right?",
            "So the result is to here is based on event registry and an for this one.",
            "Basically you query the index for those concepts that are found in the question and get all the events that mention those concepts right and and then what you can do is a very basic Co occurrence.",
            "Basically frequency analysis right?",
            "Finding the most frequently.",
            "Carrying concepts in those set of events, and for this one you you can adjust the time, the number of events you have retrieved.",
            "And so on, right?"
        ],
        [
            "And again, this comes with its own API, so now there is this question of how well these works, right?",
            "How well the semantic embeddings is helping us discover concepts.",
            "So what we did was we created a benchmark.",
            "So this is a very difficult task to evaluate.",
            "So what we did was that we took a couple of reports that are created by human experts on certain topics.",
            "Some of them were reports generated by Human Rights Watch organization.",
            "And some are Wikipedia articles that are written on a certain topic.",
            "For example, there could be one on Brexit.",
            "There could be an, for example, impeachment of Dilma Rousseff, right.",
            "And an out of these we created different kinds of benchmarks.",
            "The one is that we manually did the annotation and make sure we're covering all the entities and another one automatically, basically by through NLP entity extraction, making sure that.",
            "What our APIs return are mentioned in the text, right?",
            "And our results so far suggests that a combination approach works best.",
            "So basically using.",
            "One of the frequency based indexes and then refining or re ranking based on the deep similarity engine.",
            "Or why swears that it is something that works best.",
            "So in summary."
        ],
        [
            "This is the engine we have built so far and and you can see there are a lot of components that I I haven't mentioned in this talk.",
            "In the interest of time, but we have also a number of interesting future directions, so one aspect is that you can also have an extended event extraction engine right?",
            "This could be something that on top of an event database like event registry you may have, for example a structured sources that mention events.",
            "Right, for example, it could be economic factors.",
            "It could be food prices, other things that are going on that are captured in a structured databases and and maybe not mentioned in the media or mentioned in a different way, right?",
            "So that's something that we need help with and we're working on and the other part is extending the semantic embeddings engine and another part is also of course the evaluation, and the benchmark is something we want to extend on and also."
        ],
        [
            "We are working on visualization, right?",
            "Something that this semantic embeddings engine enables is that you can just enter your concepts and entities and turn them into, for example, geographical latitude in lanja tude, and that's something quite exciting because everything basically has a semantic vector and you can do semantic similarity across concepts of different types and a very quick commercial break that we're hiring."
        ],
        [
            "Come and find us in our booth and job fair and we also very much welcome collaborations, academic collaborations.",
            "So if you are interested in any of these topics, please come talk to us and we would be happy to work together, thanks."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hello everyone, so I'm going to talk about a project we have at IBM Research AI with the high level goal of helping analysts with their job and this could be different kinds of analysts.",
                    "label": 1
                },
                {
                    "sent": "This could be business analysts, financial analysts, risk analysts within an enterprise and this is a relatively large project.",
                    "label": 0
                },
                {
                    "sent": "What I'm going to talk about today.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Day is 1 component of this project which is about the very first step of.",
                    "label": 0
                },
                {
                    "sent": "Of the task, basically where the analyst start their job and and basically the high level goal here is to help the analysts to create high quality report given a question or or or a topic right.",
                    "label": 0
                },
                {
                    "sent": "Basically a set of entities and concepts that is in in that question and I have an example.",
                    "label": 0
                },
                {
                    "sent": "That I updated just this morning to make it a bit more local.",
                    "label": 0
                },
                {
                    "sent": "The previous example I had was from Brazil, but this example is basically the question is what are the consequences of Brexit on London's financial markets, right?",
                    "label": 1
                },
                {
                    "sent": "So if if an analyst wants to write a report on this to give advice to an enterprise decision makers what he or she needs to know is?",
                    "label": 0
                },
                {
                    "sent": "The key topics that needs to be covered in this report there are there could be broad topics such as financial markets, economy and so on.",
                    "label": 0
                },
                {
                    "sent": "And then there are more specific topics such as Brexit and the Brexit divorce bill and then the other aspect that needs to be covered is basically key entities, key people and organizations.",
                    "label": 0
                },
                {
                    "sent": "Any decision makers that could affect the negotiations that are going on about.",
                    "label": 0
                },
                {
                    "sent": "The Brexit and also all the related events, right negotiation, meetings and parliamentary elections.",
                    "label": 0
                },
                {
                    "sent": "All the elections that could affect the basically the decision makers and that decision process, right?",
                    "label": 0
                },
                {
                    "sent": "So what's the?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Process right now for.",
                    "label": 0
                },
                {
                    "sent": "For typical analysts, how do they do this?",
                    "label": 0
                },
                {
                    "sent": "Usually this first phase, the discovery phase, is an isolated process, right?",
                    "label": 0
                },
                {
                    "sent": "That it happens in a very classic way.",
                    "label": 0
                },
                {
                    "sent": "It could be just looking into several sources of information, just going on news media and there of course tools that assist the analyst about this to find out what's going on.",
                    "label": 0
                },
                {
                    "sent": "There are also tools that.",
                    "label": 0
                },
                {
                    "sent": "Alerts the analyst about what's going on and if certain people or topics are mentioned.",
                    "label": 0
                },
                {
                    "sent": "But then often, what happens next is that you need to do something else on top of that, right?",
                    "label": 0
                },
                {
                    "sent": "The report is not just talking mentioning these concepts, but you need to do some deeper analysis, for example.",
                    "label": 0
                },
                {
                    "sent": "You need to do forecasts, right?",
                    "label": 0
                },
                {
                    "sent": "You need to try to predict what is going to happen in the future.",
                    "label": 0
                },
                {
                    "sent": "So there are two problems in this classic way of doing things.",
                    "label": 0
                },
                {
                    "sent": "One is this isolated process can result in.",
                    "label": 0
                },
                {
                    "sent": "In information Dad is is biased an incomplete.",
                    "label": 0
                },
                {
                    "sent": "So one thing is that analysts and humans in general could be very bias, right?",
                    "label": 0
                },
                {
                    "sent": "They trust their own sources, they are already usually experts in a given topic and and that expertise can actually produce by us right?",
                    "label": 0
                },
                {
                    "sent": "And the other thing is this isolation, right when you do your search and then you do your analysis on completely different sources of information that can result in again.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this process and one particular type of analysis that is usually done is through the so-called event databases.",
                    "label": 0
                },
                {
                    "sent": "I'm covering three prominent ones.",
                    "label": 0
                },
                {
                    "sent": "This is not a comprehensive list, but these are three that we have been using in this project.",
                    "label": 0
                },
                {
                    "sent": "Two of them did Elton Iqs.",
                    "label": 0
                },
                {
                    "sent": "These are done mostly by political scientists, so they have a very specific definition of what an event is.",
                    "label": 0
                },
                {
                    "sent": "So an event is basically an action that has opted to actors right?",
                    "label": 0
                },
                {
                    "sent": "And then another one is the event registry.",
                    "label": 0
                },
                {
                    "sent": "That is the start up in Slovenia and I see the co-founder here sitting in the front.",
                    "label": 0
                },
                {
                    "sent": "So event Registry has a more generic notion of events, right?",
                    "label": 0
                },
                {
                    "sent": "It's basically a cluster of articles on the same topic that's more in line with what we understand as events.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you can see they vary a lot, so in terms of coverage in terms of the size you can see they can be quite huge and and also in terms of so event registry is one that already uses semantic technologies.",
                    "label": 0
                },
                {
                    "sent": "So it comes with concept annotations with your eyes that you can link.",
                    "label": 0
                },
                {
                    "sent": "But detailed and Iqs are not like that.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is our solution to this discovery aspect, right?",
                    "label": 1
                },
                {
                    "sent": "So what we do is we build a unified index for all our events, databases and also our background knowledge that includes some of the general domain knowledge bases such as wiki data in DB pedia as well.",
                    "label": 1
                },
                {
                    "sent": "And on top of that we built this semantic embeddings engine that helps us analyze the semantic similarity between all the values and fields and basically entities and concepts that are covered in these event databases.",
                    "label": 0
                },
                {
                    "sent": "So the process is, very briefly, is that from the question you need to do natural language understanding to go to a set of topics and concepts mentioned in the question, and then you do you use those to query our back end API?",
                    "label": 0
                },
                {
                    "sent": "Our concept discovery API.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to use some screenshots of.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "After prototype we have built.",
                    "label": 0
                },
                {
                    "sent": "I can show you a live demo later on.",
                    "label": 0
                },
                {
                    "sent": "You can find me in our IBM research booth or at the poster sessions at the Semantic Web Challenge section.",
                    "label": 1
                },
                {
                    "sent": "So the process here and this is a very basic prototype to just show this component right so the analyst can enter a question which could be.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The natural language question?",
                    "label": 0
                },
                {
                    "sent": "Or just the set of?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Entities and topics.",
                    "label": 0
                },
                {
                    "sent": "And as you can see we have ingested GDL team and registry and IQ's here.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then one use of semantic technologies we have is basically for data integration.",
                    "label": 0
                },
                {
                    "sent": "So the box you see on top we call it global context.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Those are things that you can click on them and you will see the facts coming from a background knowledge base.",
                    "label": 0
                },
                {
                    "sent": "We call it fact based API.",
                    "label": 0
                },
                {
                    "sent": "So, so the concepts that are mentioned in the question are basically can be looked up from our Knowledge base index, Knowledge Graph API and and then those concepts can also be found across these sources, right event registry and an IQ zonji dealt.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then this is one other view that we are showing here.",
                    "label": 0
                },
                {
                    "sent": "This view is generated using the semantic embeddings engine, so just in a very high level this is something that the results that you see here is the results of analyzing 157 million due dealt GCG records right?",
                    "label": 0
                },
                {
                    "sent": "And you can do the same.",
                    "label": 0
                },
                {
                    "sent": "We have the same for human registry as well and and this is a super fast engine that.",
                    "label": 0
                },
                {
                    "sent": "The engine is done also by Michael Glass who is sitting right there.",
                    "label": 0
                },
                {
                    "sent": "So I can show you a live demo so under in a millisecond time you can do this retrieval.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And and all of these these components are built through microservices.",
                    "label": 0
                },
                {
                    "sent": "We have swagger API's in the back end that power this.",
                    "label": 0
                },
                {
                    "sent": "So this is an example of how the this API work that we call it deep.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we have a similar.",
                    "label": 0
                },
                {
                    "sent": "We also have basically a baseline as well, right?",
                    "label": 0
                },
                {
                    "sent": "So the result is to here is based on event registry and an for this one.",
                    "label": 1
                },
                {
                    "sent": "Basically you query the index for those concepts that are found in the question and get all the events that mention those concepts right and and then what you can do is a very basic Co occurrence.",
                    "label": 0
                },
                {
                    "sent": "Basically frequency analysis right?",
                    "label": 0
                },
                {
                    "sent": "Finding the most frequently.",
                    "label": 0
                },
                {
                    "sent": "Carrying concepts in those set of events, and for this one you you can adjust the time, the number of events you have retrieved.",
                    "label": 0
                },
                {
                    "sent": "And so on, right?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And again, this comes with its own API, so now there is this question of how well these works, right?",
                    "label": 0
                },
                {
                    "sent": "How well the semantic embeddings is helping us discover concepts.",
                    "label": 0
                },
                {
                    "sent": "So what we did was we created a benchmark.",
                    "label": 0
                },
                {
                    "sent": "So this is a very difficult task to evaluate.",
                    "label": 0
                },
                {
                    "sent": "So what we did was that we took a couple of reports that are created by human experts on certain topics.",
                    "label": 0
                },
                {
                    "sent": "Some of them were reports generated by Human Rights Watch organization.",
                    "label": 1
                },
                {
                    "sent": "And some are Wikipedia articles that are written on a certain topic.",
                    "label": 0
                },
                {
                    "sent": "For example, there could be one on Brexit.",
                    "label": 0
                },
                {
                    "sent": "There could be an, for example, impeachment of Dilma Rousseff, right.",
                    "label": 0
                },
                {
                    "sent": "And an out of these we created different kinds of benchmarks.",
                    "label": 0
                },
                {
                    "sent": "The one is that we manually did the annotation and make sure we're covering all the entities and another one automatically, basically by through NLP entity extraction, making sure that.",
                    "label": 0
                },
                {
                    "sent": "What our APIs return are mentioned in the text, right?",
                    "label": 0
                },
                {
                    "sent": "And our results so far suggests that a combination approach works best.",
                    "label": 0
                },
                {
                    "sent": "So basically using.",
                    "label": 0
                },
                {
                    "sent": "One of the frequency based indexes and then refining or re ranking based on the deep similarity engine.",
                    "label": 0
                },
                {
                    "sent": "Or why swears that it is something that works best.",
                    "label": 0
                },
                {
                    "sent": "So in summary.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the engine we have built so far and and you can see there are a lot of components that I I haven't mentioned in this talk.",
                    "label": 0
                },
                {
                    "sent": "In the interest of time, but we have also a number of interesting future directions, so one aspect is that you can also have an extended event extraction engine right?",
                    "label": 1
                },
                {
                    "sent": "This could be something that on top of an event database like event registry you may have, for example a structured sources that mention events.",
                    "label": 0
                },
                {
                    "sent": "Right, for example, it could be economic factors.",
                    "label": 0
                },
                {
                    "sent": "It could be food prices, other things that are going on that are captured in a structured databases and and maybe not mentioned in the media or mentioned in a different way, right?",
                    "label": 1
                },
                {
                    "sent": "So that's something that we need help with and we're working on and the other part is extending the semantic embeddings engine and another part is also of course the evaluation, and the benchmark is something we want to extend on and also.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We are working on visualization, right?",
                    "label": 0
                },
                {
                    "sent": "Something that this semantic embeddings engine enables is that you can just enter your concepts and entities and turn them into, for example, geographical latitude in lanja tude, and that's something quite exciting because everything basically has a semantic vector and you can do semantic similarity across concepts of different types and a very quick commercial break that we're hiring.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Come and find us in our booth and job fair and we also very much welcome collaborations, academic collaborations.",
                    "label": 0
                },
                {
                    "sent": "So if you are interested in any of these topics, please come talk to us and we would be happy to work together, thanks.",
                    "label": 0
                }
            ]
        }
    }
}