{
    "id": "haym4yl7ubpkxfcf6wxxuouv6a52h5yc",
    "title": "High throughput network analysis",
    "info": {
        "author": [
            "Sumeet Agarwal, Department of Physics, University of Oxford"
        ],
        "published": "Nov. 8, 2010",
        "recorded": "October 2010",
        "category": [
            "Top->Computer Science->Machine Learning->Structured Data",
            "Top->Computer Science->Bioinformatics->Computational Systems Biology"
        ]
    },
    "url": "http://videolectures.net/mlsb2010_agarwal_htn/",
    "segmentation": [
        [
            "This is we're essentially looking at the problem of.",
            "Analyzing.",
            "Large network datasets, and so it doesn't in principle have anything to do with biology.",
            "The project as such, but will, but obviously networks or other things that are particularly relevant to systems biology and so after describing the basic ideas, I will focus on one specific application to biology, which I hope will demonstrate how this sort of thing can be useful, and so this is work done with another PhD student, Gabriel Miller and Nick Jones, who is our supervisor at Oxford."
        ],
        [
            "So.",
            "To motivate what we're trying to do, and of course I haven't explained what exactly you mean by by the title, which is high throughput network analysis.",
            "I'll come to that on the next slide, but the idea basically is that networks or graphs are something that have been studied now for several centuries, starting probably with the with the famous seven bridges of Konigsberg problem that Euler looked at back in the 17th century.",
            "That was perhaps the first time that mathematical formalization of.",
            "Of a graph was done an since then models network or graph models have been used in a very wide range of disciplines, particularly in the last few decades socialogy and engineering, computer science, physics statisticians have all been studying these objects and have have very often.",
            "Reinvented concepts that already existed, and the fact that a lot of different people have been thinking about these things is led to a certain amount of fragmentation.",
            "The literature, and some confusion in terminology and concepts.",
            "So one of the.",
            "Aims of this is to perhaps start to try and attempt to unify some of these things using a sort of data driven approach to see well, we have all these different ways of thinking about networks.",
            "Can we find relationships between them?",
            "And can we detect are certain ways of thinking about networks or quantifying certain properties of network structure essentially equivalent to one another?",
            "And therefore reduce sort of the OR at least consolidate in some sense.",
            "The vast body of literature on these objects that exists in so many different domains.",
            "And then some of the more specific applications that we have in mind for.",
            "This overall approach is doing things like feature selection, so we consider a large number of structural network features and using a sort of machine learning approach can allow you to identify relevant features to particular sorts of tasks.",
            "And again, I'll.",
            "Sort of go into more detail about this motivating generative models for networks and.",
            "Most generally, perhaps we can think of this as an attempt to answer the question.",
            "What are the best ways of thinking about networks in a particular context?"
        ],
        [
            "OK, So what then is this high throughput network analysis?",
            "So the term comes from analogy to sort of high throughput methods in biology micro areas for example, where the idea is that as opposed to kind of low throughput methods where traditionally biologist might have focused on one particular signaling pathway, one particular system of interest at a time you sort of are looking at a large number of different.",
            "Objects and you know, measuring many properties of those objects simultaneously are kind of constructing a big array of objects versus some properties of those objects.",
            "And so here are objects.",
            "Essentially, our networks from a large number of different domains, and they could be real networks, or we consider synthetic networks generated from various models, But so essentially a large number of networks, and then we are computing a large number of properties of these networks which are various sorts of structural.",
            "Properties that I'll again come to give examples of these, but so the basic object that we construct is a matrix like this, where each row is a single network.",
            "Each column is a particular property, and once we have this thing which we call the data matrix, then this actually becomes the object on which you can start to do various sorts of interesting data mining and machine learning.",
            "Type things to detect patterns and go into some of the applications I mentioned on the previous slide.",
            "And you know just the simplest examples of this is to construct these correlation matrices, and you know these are, for example, just ordered by.",
            "Networks that are more similar to each other in terms of the features that we have.",
            "So correlation is higher, a sort of darker in this network sources networks matrix and you see the kind of block diagonal structure that is.",
            "Typical of data set where you have kind of meaningful clusters of some sort, and we'll see that these clusters do in fact correspond to some sort of meaningful real world properties of these networks.",
            "And you can do the same sort of thing for the metrics as well, which which are the different properties of networks you're looking at."
        ],
        [
            "OK, So what?",
            "What are the various networks we're looking at?",
            "So we're trying to collect as many different kinds of networks as we can, and as I said, so many.",
            "The different disciplines of science have have used network models.",
            "So you know we of course have many kinds of biological networks which are.",
            "Focus on in particular here in my examples, but also we have social networks, information, networks, infrastructure, networks and yes, so the idea is to try and collect as many different examples as possible and then see what sorts of patterns and common principles."
        ],
        [
            "Be detected within these and then what are the actual properties or metrics we're looking at?",
            "So again, the idea is to try and collect as many different possible ones as we can from the literature, and perhaps add in any ones over on that.",
            "We might think of.",
            "But broadly we can group them into these categories.",
            "So we have simple.",
            "Features like so just like the number of nodes and links the network, the average path length between nodes, things.",
            "So some single number.",
            "Essentially that captures some global property of the network, so that's the first category.",
            "A second category is.",
            "You can think of measures specific to an individual node or link in the network.",
            "Something like.",
            "What is the degree of the node, the number of links going out of it?",
            "What is the centrality of the nodes?",
            "Measures like how many shortest paths go through it between us and then.",
            "So you get a distribution over all nodes or links in the network, and we then summarize this distribution by taking statistics like the average and the standard deviation.",
            "So summaries of distributions over the nodes or links is a second category.",
            "3rd category is metrics to do with the modular or sort of clustered structure community structure in the network.",
            "So there are a large number of algorithms that are designed to detect sort of densely connected subgraphs or subnetworks within a network, and the output of these algorithms.",
            "Again, we attempt to summarize in various ways by, for example, just counting the number of communities or counting the entropy of the partition.",
            "So all of these are just real numbers that we can keep on adding, essentially to our big feature vector that we're constructing for each network.",
            "4th Category model fits so.",
            "Again, large number of generative models.",
            "We can take a model, try and fit a given network to it, see how well it fits, have some measure of goodness of fit or likelihood of it, which we are in, and then we have other quantities which are sort of less conventional in network science but have been looked at in particular.",
            "For example graph theory, linear algebra.",
            "So I mean the mathematically our representation of a network is just as an adjacency matrix, and so then essentially any sort of operation.",
            "Which is meaningful for matrices and taking things like eigenvectors, or looking at the Laplacian, which are things that have been shown to capture interesting properties of graph structure?",
            "Are all things that we also try and add onto this set of features."
        ],
        [
            "OK, so I've described the kinds of things that are going into constructing this matrix.",
            "So now let's return to this example I showed.",
            "So this is a.",
            "This is the output of this of doing this for for data set of about.",
            "200 networks in this case and approximately 400 features.",
            "And so, as I said, these blocks that we get show some sort of clustering an.",
            "So here in this data set we had networks from a number of different domains and the colors there are showing sort of high level kind of grouping into about 12 different categories.",
            "And So what this shows is that the color for each row is what category it belongs to and many of many of the blocks you sort of see along the diagonal do correspond to quite coherent communities that mostly consist of networks in one of those categories and perhaps."
        ],
        [
            "Next figure shows this a bit better, so we've done principle component analysis on this same data set an so again, you see that so these essentially out of these 400 dimensions that we had, we're showing just the two with the largest variation and.",
            "Many of these categories of networks are very tightly constrained in terms of where they are in the space.",
            "So you see things like metabolic networks all in this cluster fungal networks, which are sort of networks of.",
            "You know fungal growth in forests are all here.",
            "Certain kinds of political networks like these are like networks of Co. Voting in the British Parliament and the US Congress, etc.",
            "So that we're so similar kinds are quite tightly clustered in many cases, and while this may not come as a surprise because naturally many of these are are such different domains that.",
            "You sort of expect them to have different properties, but in a way it's from the point of view of.",
            "Physical scientist, it's it's quite interesting that we have these systems that are all highly complex.",
            "You know, consisting of so many different interacting agents or components and all these dynamic processes that are going on within them.",
            "If you think of what the actual system is, what we've done is to strip away.",
            "Such a large part of that complexity just take essentially a very bare bones representation of the thing, right?",
            "Which is just these nodes and links and nothing else.",
            "And then just look at a few relatively simple structural properties, and that alone is telling us quite a lot about many of these categories.",
            "So it's saying that if it's a metabolic network, it has to sort of live within this very small region of the entire network structural space, and similarly for many other categories.",
            "So in that sense, I think it's sort of.",
            "Sort of nice."
        ],
        [
            "Anne.",
            "We also tried building a simple classifier again for the same data set, so this is just showing Decision Tree which is able to on this 12 class classification problem put about 80% of the networks in the right categories using a sort of cross validation approach.",
            "So testing on things which haven't been used for training the model and.",
            "It does this using so as you can see there are about maybe 10 to 15 features in this tree.",
            "So quite a small subset of the 400 that we had in total, so it's able to select relevant features quite well, so again, this.",
            "Relates to something I mentioned earlier, which is that there's probably a lot of redundancy in the different ways of thinking about networks that people have an quite a small subset of them is able to capture.",
            "Perhaps most of the relevant information that that is there in the full set."
        ],
        [
            "OK, so then in the last few minutes I'll.",
            "Talk about this specific example and try and relate this a bit more to.",
            "Biological questions of interest.",
            "So this is where we are trying to use this method to.",
            "Analyze in particular metabolic networks, and the idea is that.",
            "We have metabolic network, some number of different species, and what we'd like to try and do is find if there are certain features of these networks that are particularly.",
            "Meaningful biologically, so can we find a relationship between.",
            "Metabolic network features and some kind of.",
            "Biological.",
            "Categorization of of the Organism to which that network belongs, and so the approach we're trying to take to this is we.",
            "Take a phylogenetic tree like this which is just.",
            "Yes, starting from a common ancestor.",
            "How different species have evolved?",
            "And so this particular plot.",
            "The three colors are showing the Three Kingdoms which are.",
            "Archaea, Eukarya and bacteria and.",
            "So the idea is for for a tree like this we have we have a number of metabolic networks that lie at the leaves, so each leaf in this tree is a different species, and for many of these we have a few metabolic networks, so we essentially have some.",
            "Cluster of networks at the leaves and we want to see are there properties of these networks that sort of Co evolved with the structure of the phylogeny itself so that you know, for example, things that are closer together, have more similar networks or certain properties of those networks are closer together.",
            "If those two are actually closer in.",
            "Hey, in terms of their evolutionary history.",
            "And the way we do this is very simple.",
            "I mean you think.",
            "What we are doing this would be to have a sort of model of how the metabolic network itself evolves and then try and fit that onto this kind of structure.",
            "But to start with we just tried a very simple thing which is.",
            "Pick individual properties, so take something like, let's say the average degree of the network.",
            "One of those 400 features that we had and just look at that single number.",
            "How it's distributed across the leaves and then try and fit just a random drift or Brownian motion model to it.",
            "So I'll try and."
        ],
        [
            "Say what sort of thing, so this is the standard approach is used in this area of phylogenetic comparative methods where people try to relate some sort of phenotypic property to.",
            "Do a phylogeny and the idea is that you.",
            "So you assume that there's a random drift Brownian motion type process that's happening so so you start from the root and then you have some create some characteristic which in our case is going to be just some feature of the network and then it's drifting and then at each point where you have a branching point then it begins to you know.",
            "Evolve independently along the branches, and so you get basically the property of this thing which is of interest to us.",
            "Here is simply that if two things have branched off from each other very recently, then up until that point they were evolving in common and so the time that they've had to drift separately is very small.",
            "So so the simple property is just that the closer two things are biologically, the closer their rate will be as well.",
            "Under this, this kind of evolutionary model.",
            "And so our idea is to try and see if the actual properties that we're getting from these networks.",
            "Are explained by this model.",
            "How well are they fit by just this very naive sort of Brownian motion model?",
            "And."
        ],
        [
            "Yes so.",
            "So these are these are the results where we try to do this.",
            "So then what the Brownian motion model is?",
            "If I can just."
        ],
        [
            "Yeah, so it's just.",
            "That the variance between 2 two species is some constant multiplied by the time that they've had to diverge plus plus an error, and so that's what we are fitting just by linear regression."
        ],
        [
            "Go to the data that we have."
        ],
        [
            "Yeah, so and so on.",
            "This plot on these plots we're showing this beta parameter and then this is a measure of how well the model actually fits the data and so the point here is to try and compare how well actual features.",
            "From the networks are fit by the Brownian motion model versus.",
            "Synthetic data that actually comes from a Brownian motion process, so we take the phylogeny that we have the picture I showed.",
            "Just run this random process forward starting from the root.",
            "Do that a large number of times and we get this cloud of points in dark blue.",
            "So this is the region in which actual distributions from that process lie.",
            "And so in this particular case you can see that the red points, which are the actual features don't overlap very much with that.",
            "And then we also take sort of a null model, which is we take the actual features, but shuffle them around at random.",
            "So if there's any correlation between the features and the tree structure, you expect that to be lost when you when you shuffle things.",
            "So the light blue is the shuffled version, and so you can see that there isn't a clear distinction.",
            "So for this phylogeny, which was we knew, was sort of a bad phylogeny, in that we hadn't accounted for the sort of length of the branches, but just assumed the model to be the same.",
            "We didn't get a signal, so the key thing is the difference between this and that one, which is a more realistic phylogeny where we've tried to wait the tree such that you know different branch lengths more closely reflect what we know about how long things have had to evolve away.",
            "And here you see that, so the blue is the actual Brownian motion features, and the real network features.",
            "Many of them sit in that space of that part of the parameter space, whereas there.",
            "Quite well separated from the shuffle versions, suggesting that there is some.",
            "Some biological relevance to too many."
        ],
        [
            "These features and when we look specifically at which which features are.",
            "The best fit by this model.",
            "And compare them to sort of shuffled version.",
            "So this is showing for the bad phylogeny and essentially that there isn't a big difference between the sort of fitting the actual feature and shuffling it around, whereas for the.",
            "A more realistic one.",
            "You get these these blue bars which are so the lower this deviance is, the better.",
            "The model fits an.",
            "So for these actual features you get a much better fit with that with the actual version of it.",
            "Then when you shuffle it around, which is which is the green bars and the red one is sort of comparison to sort of equally ranked shuffled feature.",
            "So like the best non shuffle versus best shuffle and.",
            "So even even after allowing for sort of.",
            "Some features getting better after shuffling.",
            "We still see a big effect in.",
            "In terms of how well the actual features are fit, OK, so I."
        ],
        [
            "Wrap up there, I guess if we saw the same sorts of results on on a more specific sort of tree as well, which sort was a higher quality."
        ],
        [
            "So so overall.",
            "We can conclude that we are getting some some interesting signals in some of these network features, even using this very naive kind of approach.",
            "OK, so I've tried to present this kind of framework for network analysis where we hope to use a data driven machine learning type methodology too.",
            "Pick out interesting features of networks and find relationships between different categories of networks and one particular biological application might be to relate features of biological networks to some sort of phenotypic or functional properties of the organisms they come from.",
            "And of course, this is very much work in progress and we're looking to revisit some of the examples I mentioned in the earlier part of the talk about fitting generative models and.",
            "Map.",
            "Feature selection, which hopefully well, so any of these questions sort of have to be framed in the context of a particular scientific problem you're looking at, but hopefully, given a particular task, this kind of tool can be useful to find the appropriate ways of thinking about about networks in that context.",
            "So."
        ],
        [
            "Just like to thank all of these people at Oxford who have been very helpful in in this work and various people who have funded and supported us.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is we're essentially looking at the problem of.",
                    "label": 0
                },
                {
                    "sent": "Analyzing.",
                    "label": 0
                },
                {
                    "sent": "Large network datasets, and so it doesn't in principle have anything to do with biology.",
                    "label": 0
                },
                {
                    "sent": "The project as such, but will, but obviously networks or other things that are particularly relevant to systems biology and so after describing the basic ideas, I will focus on one specific application to biology, which I hope will demonstrate how this sort of thing can be useful, and so this is work done with another PhD student, Gabriel Miller and Nick Jones, who is our supervisor at Oxford.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "To motivate what we're trying to do, and of course I haven't explained what exactly you mean by by the title, which is high throughput network analysis.",
                    "label": 0
                },
                {
                    "sent": "I'll come to that on the next slide, but the idea basically is that networks or graphs are something that have been studied now for several centuries, starting probably with the with the famous seven bridges of Konigsberg problem that Euler looked at back in the 17th century.",
                    "label": 0
                },
                {
                    "sent": "That was perhaps the first time that mathematical formalization of.",
                    "label": 0
                },
                {
                    "sent": "Of a graph was done an since then models network or graph models have been used in a very wide range of disciplines, particularly in the last few decades socialogy and engineering, computer science, physics statisticians have all been studying these objects and have have very often.",
                    "label": 0
                },
                {
                    "sent": "Reinvented concepts that already existed, and the fact that a lot of different people have been thinking about these things is led to a certain amount of fragmentation.",
                    "label": 0
                },
                {
                    "sent": "The literature, and some confusion in terminology and concepts.",
                    "label": 1
                },
                {
                    "sent": "So one of the.",
                    "label": 0
                },
                {
                    "sent": "Aims of this is to perhaps start to try and attempt to unify some of these things using a sort of data driven approach to see well, we have all these different ways of thinking about networks.",
                    "label": 0
                },
                {
                    "sent": "Can we find relationships between them?",
                    "label": 1
                },
                {
                    "sent": "And can we detect are certain ways of thinking about networks or quantifying certain properties of network structure essentially equivalent to one another?",
                    "label": 0
                },
                {
                    "sent": "And therefore reduce sort of the OR at least consolidate in some sense.",
                    "label": 0
                },
                {
                    "sent": "The vast body of literature on these objects that exists in so many different domains.",
                    "label": 0
                },
                {
                    "sent": "And then some of the more specific applications that we have in mind for.",
                    "label": 0
                },
                {
                    "sent": "This overall approach is doing things like feature selection, so we consider a large number of structural network features and using a sort of machine learning approach can allow you to identify relevant features to particular sorts of tasks.",
                    "label": 0
                },
                {
                    "sent": "And again, I'll.",
                    "label": 0
                },
                {
                    "sent": "Sort of go into more detail about this motivating generative models for networks and.",
                    "label": 0
                },
                {
                    "sent": "Most generally, perhaps we can think of this as an attempt to answer the question.",
                    "label": 1
                },
                {
                    "sent": "What are the best ways of thinking about networks in a particular context?",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, So what then is this high throughput network analysis?",
                    "label": 1
                },
                {
                    "sent": "So the term comes from analogy to sort of high throughput methods in biology micro areas for example, where the idea is that as opposed to kind of low throughput methods where traditionally biologist might have focused on one particular signaling pathway, one particular system of interest at a time you sort of are looking at a large number of different.",
                    "label": 0
                },
                {
                    "sent": "Objects and you know, measuring many properties of those objects simultaneously are kind of constructing a big array of objects versus some properties of those objects.",
                    "label": 0
                },
                {
                    "sent": "And so here are objects.",
                    "label": 0
                },
                {
                    "sent": "Essentially, our networks from a large number of different domains, and they could be real networks, or we consider synthetic networks generated from various models, But so essentially a large number of networks, and then we are computing a large number of properties of these networks which are various sorts of structural.",
                    "label": 1
                },
                {
                    "sent": "Properties that I'll again come to give examples of these, but so the basic object that we construct is a matrix like this, where each row is a single network.",
                    "label": 1
                },
                {
                    "sent": "Each column is a particular property, and once we have this thing which we call the data matrix, then this actually becomes the object on which you can start to do various sorts of interesting data mining and machine learning.",
                    "label": 0
                },
                {
                    "sent": "Type things to detect patterns and go into some of the applications I mentioned on the previous slide.",
                    "label": 1
                },
                {
                    "sent": "And you know just the simplest examples of this is to construct these correlation matrices, and you know these are, for example, just ordered by.",
                    "label": 0
                },
                {
                    "sent": "Networks that are more similar to each other in terms of the features that we have.",
                    "label": 0
                },
                {
                    "sent": "So correlation is higher, a sort of darker in this network sources networks matrix and you see the kind of block diagonal structure that is.",
                    "label": 0
                },
                {
                    "sent": "Typical of data set where you have kind of meaningful clusters of some sort, and we'll see that these clusters do in fact correspond to some sort of meaningful real world properties of these networks.",
                    "label": 0
                },
                {
                    "sent": "And you can do the same sort of thing for the metrics as well, which which are the different properties of networks you're looking at.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, So what?",
                    "label": 0
                },
                {
                    "sent": "What are the various networks we're looking at?",
                    "label": 0
                },
                {
                    "sent": "So we're trying to collect as many different kinds of networks as we can, and as I said, so many.",
                    "label": 1
                },
                {
                    "sent": "The different disciplines of science have have used network models.",
                    "label": 1
                },
                {
                    "sent": "So you know we of course have many kinds of biological networks which are.",
                    "label": 0
                },
                {
                    "sent": "Focus on in particular here in my examples, but also we have social networks, information, networks, infrastructure, networks and yes, so the idea is to try and collect as many different examples as possible and then see what sorts of patterns and common principles.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Be detected within these and then what are the actual properties or metrics we're looking at?",
                    "label": 0
                },
                {
                    "sent": "So again, the idea is to try and collect as many different possible ones as we can from the literature, and perhaps add in any ones over on that.",
                    "label": 0
                },
                {
                    "sent": "We might think of.",
                    "label": 0
                },
                {
                    "sent": "But broadly we can group them into these categories.",
                    "label": 0
                },
                {
                    "sent": "So we have simple.",
                    "label": 0
                },
                {
                    "sent": "Features like so just like the number of nodes and links the network, the average path length between nodes, things.",
                    "label": 0
                },
                {
                    "sent": "So some single number.",
                    "label": 0
                },
                {
                    "sent": "Essentially that captures some global property of the network, so that's the first category.",
                    "label": 0
                },
                {
                    "sent": "A second category is.",
                    "label": 0
                },
                {
                    "sent": "You can think of measures specific to an individual node or link in the network.",
                    "label": 0
                },
                {
                    "sent": "Something like.",
                    "label": 0
                },
                {
                    "sent": "What is the degree of the node, the number of links going out of it?",
                    "label": 0
                },
                {
                    "sent": "What is the centrality of the nodes?",
                    "label": 0
                },
                {
                    "sent": "Measures like how many shortest paths go through it between us and then.",
                    "label": 0
                },
                {
                    "sent": "So you get a distribution over all nodes or links in the network, and we then summarize this distribution by taking statistics like the average and the standard deviation.",
                    "label": 0
                },
                {
                    "sent": "So summaries of distributions over the nodes or links is a second category.",
                    "label": 1
                },
                {
                    "sent": "3rd category is metrics to do with the modular or sort of clustered structure community structure in the network.",
                    "label": 0
                },
                {
                    "sent": "So there are a large number of algorithms that are designed to detect sort of densely connected subgraphs or subnetworks within a network, and the output of these algorithms.",
                    "label": 0
                },
                {
                    "sent": "Again, we attempt to summarize in various ways by, for example, just counting the number of communities or counting the entropy of the partition.",
                    "label": 1
                },
                {
                    "sent": "So all of these are just real numbers that we can keep on adding, essentially to our big feature vector that we're constructing for each network.",
                    "label": 0
                },
                {
                    "sent": "4th Category model fits so.",
                    "label": 1
                },
                {
                    "sent": "Again, large number of generative models.",
                    "label": 0
                },
                {
                    "sent": "We can take a model, try and fit a given network to it, see how well it fits, have some measure of goodness of fit or likelihood of it, which we are in, and then we have other quantities which are sort of less conventional in network science but have been looked at in particular.",
                    "label": 1
                },
                {
                    "sent": "For example graph theory, linear algebra.",
                    "label": 0
                },
                {
                    "sent": "So I mean the mathematically our representation of a network is just as an adjacency matrix, and so then essentially any sort of operation.",
                    "label": 0
                },
                {
                    "sent": "Which is meaningful for matrices and taking things like eigenvectors, or looking at the Laplacian, which are things that have been shown to capture interesting properties of graph structure?",
                    "label": 0
                },
                {
                    "sent": "Are all things that we also try and add onto this set of features.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so I've described the kinds of things that are going into constructing this matrix.",
                    "label": 0
                },
                {
                    "sent": "So now let's return to this example I showed.",
                    "label": 0
                },
                {
                    "sent": "So this is a.",
                    "label": 0
                },
                {
                    "sent": "This is the output of this of doing this for for data set of about.",
                    "label": 0
                },
                {
                    "sent": "200 networks in this case and approximately 400 features.",
                    "label": 0
                },
                {
                    "sent": "And so, as I said, these blocks that we get show some sort of clustering an.",
                    "label": 0
                },
                {
                    "sent": "So here in this data set we had networks from a number of different domains and the colors there are showing sort of high level kind of grouping into about 12 different categories.",
                    "label": 0
                },
                {
                    "sent": "And So what this shows is that the color for each row is what category it belongs to and many of many of the blocks you sort of see along the diagonal do correspond to quite coherent communities that mostly consist of networks in one of those categories and perhaps.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Next figure shows this a bit better, so we've done principle component analysis on this same data set an so again, you see that so these essentially out of these 400 dimensions that we had, we're showing just the two with the largest variation and.",
                    "label": 0
                },
                {
                    "sent": "Many of these categories of networks are very tightly constrained in terms of where they are in the space.",
                    "label": 0
                },
                {
                    "sent": "So you see things like metabolic networks all in this cluster fungal networks, which are sort of networks of.",
                    "label": 0
                },
                {
                    "sent": "You know fungal growth in forests are all here.",
                    "label": 0
                },
                {
                    "sent": "Certain kinds of political networks like these are like networks of Co. Voting in the British Parliament and the US Congress, etc.",
                    "label": 0
                },
                {
                    "sent": "So that we're so similar kinds are quite tightly clustered in many cases, and while this may not come as a surprise because naturally many of these are are such different domains that.",
                    "label": 0
                },
                {
                    "sent": "You sort of expect them to have different properties, but in a way it's from the point of view of.",
                    "label": 0
                },
                {
                    "sent": "Physical scientist, it's it's quite interesting that we have these systems that are all highly complex.",
                    "label": 0
                },
                {
                    "sent": "You know, consisting of so many different interacting agents or components and all these dynamic processes that are going on within them.",
                    "label": 0
                },
                {
                    "sent": "If you think of what the actual system is, what we've done is to strip away.",
                    "label": 0
                },
                {
                    "sent": "Such a large part of that complexity just take essentially a very bare bones representation of the thing, right?",
                    "label": 0
                },
                {
                    "sent": "Which is just these nodes and links and nothing else.",
                    "label": 0
                },
                {
                    "sent": "And then just look at a few relatively simple structural properties, and that alone is telling us quite a lot about many of these categories.",
                    "label": 0
                },
                {
                    "sent": "So it's saying that if it's a metabolic network, it has to sort of live within this very small region of the entire network structural space, and similarly for many other categories.",
                    "label": 0
                },
                {
                    "sent": "So in that sense, I think it's sort of.",
                    "label": 0
                },
                {
                    "sent": "Sort of nice.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "We also tried building a simple classifier again for the same data set, so this is just showing Decision Tree which is able to on this 12 class classification problem put about 80% of the networks in the right categories using a sort of cross validation approach.",
                    "label": 0
                },
                {
                    "sent": "So testing on things which haven't been used for training the model and.",
                    "label": 0
                },
                {
                    "sent": "It does this using so as you can see there are about maybe 10 to 15 features in this tree.",
                    "label": 0
                },
                {
                    "sent": "So quite a small subset of the 400 that we had in total, so it's able to select relevant features quite well, so again, this.",
                    "label": 0
                },
                {
                    "sent": "Relates to something I mentioned earlier, which is that there's probably a lot of redundancy in the different ways of thinking about networks that people have an quite a small subset of them is able to capture.",
                    "label": 0
                },
                {
                    "sent": "Perhaps most of the relevant information that that is there in the full set.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so then in the last few minutes I'll.",
                    "label": 0
                },
                {
                    "sent": "Talk about this specific example and try and relate this a bit more to.",
                    "label": 0
                },
                {
                    "sent": "Biological questions of interest.",
                    "label": 0
                },
                {
                    "sent": "So this is where we are trying to use this method to.",
                    "label": 0
                },
                {
                    "sent": "Analyze in particular metabolic networks, and the idea is that.",
                    "label": 0
                },
                {
                    "sent": "We have metabolic network, some number of different species, and what we'd like to try and do is find if there are certain features of these networks that are particularly.",
                    "label": 1
                },
                {
                    "sent": "Meaningful biologically, so can we find a relationship between.",
                    "label": 0
                },
                {
                    "sent": "Metabolic network features and some kind of.",
                    "label": 0
                },
                {
                    "sent": "Biological.",
                    "label": 0
                },
                {
                    "sent": "Categorization of of the Organism to which that network belongs, and so the approach we're trying to take to this is we.",
                    "label": 0
                },
                {
                    "sent": "Take a phylogenetic tree like this which is just.",
                    "label": 0
                },
                {
                    "sent": "Yes, starting from a common ancestor.",
                    "label": 0
                },
                {
                    "sent": "How different species have evolved?",
                    "label": 0
                },
                {
                    "sent": "And so this particular plot.",
                    "label": 0
                },
                {
                    "sent": "The three colors are showing the Three Kingdoms which are.",
                    "label": 0
                },
                {
                    "sent": "Archaea, Eukarya and bacteria and.",
                    "label": 0
                },
                {
                    "sent": "So the idea is for for a tree like this we have we have a number of metabolic networks that lie at the leaves, so each leaf in this tree is a different species, and for many of these we have a few metabolic networks, so we essentially have some.",
                    "label": 1
                },
                {
                    "sent": "Cluster of networks at the leaves and we want to see are there properties of these networks that sort of Co evolved with the structure of the phylogeny itself so that you know, for example, things that are closer together, have more similar networks or certain properties of those networks are closer together.",
                    "label": 0
                },
                {
                    "sent": "If those two are actually closer in.",
                    "label": 0
                },
                {
                    "sent": "Hey, in terms of their evolutionary history.",
                    "label": 0
                },
                {
                    "sent": "And the way we do this is very simple.",
                    "label": 0
                },
                {
                    "sent": "I mean you think.",
                    "label": 0
                },
                {
                    "sent": "What we are doing this would be to have a sort of model of how the metabolic network itself evolves and then try and fit that onto this kind of structure.",
                    "label": 1
                },
                {
                    "sent": "But to start with we just tried a very simple thing which is.",
                    "label": 1
                },
                {
                    "sent": "Pick individual properties, so take something like, let's say the average degree of the network.",
                    "label": 0
                },
                {
                    "sent": "One of those 400 features that we had and just look at that single number.",
                    "label": 0
                },
                {
                    "sent": "How it's distributed across the leaves and then try and fit just a random drift or Brownian motion model to it.",
                    "label": 0
                },
                {
                    "sent": "So I'll try and.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Say what sort of thing, so this is the standard approach is used in this area of phylogenetic comparative methods where people try to relate some sort of phenotypic property to.",
                    "label": 0
                },
                {
                    "sent": "Do a phylogeny and the idea is that you.",
                    "label": 0
                },
                {
                    "sent": "So you assume that there's a random drift Brownian motion type process that's happening so so you start from the root and then you have some create some characteristic which in our case is going to be just some feature of the network and then it's drifting and then at each point where you have a branching point then it begins to you know.",
                    "label": 0
                },
                {
                    "sent": "Evolve independently along the branches, and so you get basically the property of this thing which is of interest to us.",
                    "label": 0
                },
                {
                    "sent": "Here is simply that if two things have branched off from each other very recently, then up until that point they were evolving in common and so the time that they've had to drift separately is very small.",
                    "label": 0
                },
                {
                    "sent": "So so the simple property is just that the closer two things are biologically, the closer their rate will be as well.",
                    "label": 0
                },
                {
                    "sent": "Under this, this kind of evolutionary model.",
                    "label": 0
                },
                {
                    "sent": "And so our idea is to try and see if the actual properties that we're getting from these networks.",
                    "label": 0
                },
                {
                    "sent": "Are explained by this model.",
                    "label": 0
                },
                {
                    "sent": "How well are they fit by just this very naive sort of Brownian motion model?",
                    "label": 1
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yes so.",
                    "label": 0
                },
                {
                    "sent": "So these are these are the results where we try to do this.",
                    "label": 0
                },
                {
                    "sent": "So then what the Brownian motion model is?",
                    "label": 0
                },
                {
                    "sent": "If I can just.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, so it's just.",
                    "label": 0
                },
                {
                    "sent": "That the variance between 2 two species is some constant multiplied by the time that they've had to diverge plus plus an error, and so that's what we are fitting just by linear regression.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Go to the data that we have.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, so and so on.",
                    "label": 0
                },
                {
                    "sent": "This plot on these plots we're showing this beta parameter and then this is a measure of how well the model actually fits the data and so the point here is to try and compare how well actual features.",
                    "label": 1
                },
                {
                    "sent": "From the networks are fit by the Brownian motion model versus.",
                    "label": 0
                },
                {
                    "sent": "Synthetic data that actually comes from a Brownian motion process, so we take the phylogeny that we have the picture I showed.",
                    "label": 0
                },
                {
                    "sent": "Just run this random process forward starting from the root.",
                    "label": 0
                },
                {
                    "sent": "Do that a large number of times and we get this cloud of points in dark blue.",
                    "label": 0
                },
                {
                    "sent": "So this is the region in which actual distributions from that process lie.",
                    "label": 0
                },
                {
                    "sent": "And so in this particular case you can see that the red points, which are the actual features don't overlap very much with that.",
                    "label": 0
                },
                {
                    "sent": "And then we also take sort of a null model, which is we take the actual features, but shuffle them around at random.",
                    "label": 0
                },
                {
                    "sent": "So if there's any correlation between the features and the tree structure, you expect that to be lost when you when you shuffle things.",
                    "label": 0
                },
                {
                    "sent": "So the light blue is the shuffled version, and so you can see that there isn't a clear distinction.",
                    "label": 0
                },
                {
                    "sent": "So for this phylogeny, which was we knew, was sort of a bad phylogeny, in that we hadn't accounted for the sort of length of the branches, but just assumed the model to be the same.",
                    "label": 1
                },
                {
                    "sent": "We didn't get a signal, so the key thing is the difference between this and that one, which is a more realistic phylogeny where we've tried to wait the tree such that you know different branch lengths more closely reflect what we know about how long things have had to evolve away.",
                    "label": 1
                },
                {
                    "sent": "And here you see that, so the blue is the actual Brownian motion features, and the real network features.",
                    "label": 0
                },
                {
                    "sent": "Many of them sit in that space of that part of the parameter space, whereas there.",
                    "label": 0
                },
                {
                    "sent": "Quite well separated from the shuffle versions, suggesting that there is some.",
                    "label": 0
                },
                {
                    "sent": "Some biological relevance to too many.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These features and when we look specifically at which which features are.",
                    "label": 0
                },
                {
                    "sent": "The best fit by this model.",
                    "label": 0
                },
                {
                    "sent": "And compare them to sort of shuffled version.",
                    "label": 0
                },
                {
                    "sent": "So this is showing for the bad phylogeny and essentially that there isn't a big difference between the sort of fitting the actual feature and shuffling it around, whereas for the.",
                    "label": 0
                },
                {
                    "sent": "A more realistic one.",
                    "label": 0
                },
                {
                    "sent": "You get these these blue bars which are so the lower this deviance is, the better.",
                    "label": 0
                },
                {
                    "sent": "The model fits an.",
                    "label": 0
                },
                {
                    "sent": "So for these actual features you get a much better fit with that with the actual version of it.",
                    "label": 0
                },
                {
                    "sent": "Then when you shuffle it around, which is which is the green bars and the red one is sort of comparison to sort of equally ranked shuffled feature.",
                    "label": 0
                },
                {
                    "sent": "So like the best non shuffle versus best shuffle and.",
                    "label": 0
                },
                {
                    "sent": "So even even after allowing for sort of.",
                    "label": 0
                },
                {
                    "sent": "Some features getting better after shuffling.",
                    "label": 0
                },
                {
                    "sent": "We still see a big effect in.",
                    "label": 0
                },
                {
                    "sent": "In terms of how well the actual features are fit, OK, so I.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Wrap up there, I guess if we saw the same sorts of results on on a more specific sort of tree as well, which sort was a higher quality.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So so overall.",
                    "label": 0
                },
                {
                    "sent": "We can conclude that we are getting some some interesting signals in some of these network features, even using this very naive kind of approach.",
                    "label": 0
                },
                {
                    "sent": "OK, so I've tried to present this kind of framework for network analysis where we hope to use a data driven machine learning type methodology too.",
                    "label": 0
                },
                {
                    "sent": "Pick out interesting features of networks and find relationships between different categories of networks and one particular biological application might be to relate features of biological networks to some sort of phenotypic or functional properties of the organisms they come from.",
                    "label": 1
                },
                {
                    "sent": "And of course, this is very much work in progress and we're looking to revisit some of the examples I mentioned in the earlier part of the talk about fitting generative models and.",
                    "label": 0
                },
                {
                    "sent": "Map.",
                    "label": 1
                },
                {
                    "sent": "Feature selection, which hopefully well, so any of these questions sort of have to be framed in the context of a particular scientific problem you're looking at, but hopefully, given a particular task, this kind of tool can be useful to find the appropriate ways of thinking about about networks in that context.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just like to thank all of these people at Oxford who have been very helpful in in this work and various people who have funded and supported us.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}