{
    "id": "hdheucbnxr3acanl7kqpldclpuiosivi",
    "title": "Conversion and Annotation Web Services for Spoken Language Data in CLARIN",
    "info": {
        "author": [
            "Thomas Schmidt, Institut für Deutsche Sprache (IDS)"
        ],
        "published": "Aug. 21, 2017",
        "recorded": "October 2016",
        "category": [
            "Top->Humanities",
            "Top->Social Sciences"
        ]
    },
    "url": "http://videolectures.net/clarinannualconference2016_schmidt_web_services/",
    "segmentation": [
        [
            "So."
        ],
        [
            "This is joint work between two German Clarence centers and myself and from the.",
            "Archival spoken German at the Institute for the German Language and Ireland who is here in the audience somewhere, and Daniel, yet car from the Hamburg Center for Language Corpus."
        ],
        [
            "OK, so this is about web services web services in Clarin Clarin Deforest.",
            "Start by which I mean the usual suspects such as services for lemma, teising, part of speech tagging, named entity recognition, passing and so on.",
            "And especially the type of web services that web published allows you to chain and annotation chains, as many of you will know.",
            "Weblist operates on the text corpus format as the underlying data model, which is.",
            "And most of these services services are built with and also meant to operate on Canonical written language data.",
            "Meaning typically newspaper takes.",
            "There are other other kinds of modern written text, and the question we were.",
            "Working on is.",
            "How can these be used with transcriptions of spoken?"
        ],
        [
            "Language.",
            "Yeah, spoken language data comes in.",
            "A usually comes in one of a few widely used formats.",
            "There actually was a guide on interoperability and standards in the first klaring phase, which identified some.",
            "I don't know exactly 7 to 12 widely used form.",
            "It's the most important ones are probably chat, which Brian just introduced.",
            "The Elan annotation format X Marada Transcriber, and proud.",
            "And one of the challenges here is that these formats are more than what you usually have for text there more than or they are different from a simple stream of tokens.",
            "You have things like nonspeech tokens.",
            "You have transcriptions of pauses of nonverbal activities.",
            "Of other vocal active activities like breathing, you have parallel structures all over the place.",
            "Especially overlaps, but also things like alternative transcriptions.",
            "You typically have time alignment in these data, which is also piece of information you do not find in the Canonical written language.",
            "You often do not have sentence is you do not have a strict document hierarchy, which is also a kind of silent assumption for many models that work with written language and you have things like incomplete or imperfect defect tokens like incomprehensible speech, incomplete words, disfluencies and so on for all of these reasons, TCF is actually not.",
            "Sufficient to accommodate all the information that you find in spoken language transcriptions.",
            "So."
        ],
        [
            "Our general approach was to start from a common format to represent transcriptions, which is a nice or standard.",
            "Very recently published and.",
            "To have conversion web services that will turn the tool formats into that common format, and then there are two ways of going about the web service question.",
            "One is to try to encode.",
            "This common form into TCF then use the existing services and decode again to return to the original format, which somehow means you hide the spoken language.",
            "Specific features of the data.",
            "And the other way is to develop specific services that operate specifically on that common farm it, and maybe that are also specific to this type of data like orthographic normalization, forced word alignment, prosodic annotation, things that only makes sense for spoken language data.",
            "Or you think of part of speech tagging that is aware of transcribed pauses, or something like that.",
            "Yeah, look."
        ],
        [
            "General architecture within look something like this.",
            "You start with one of the tool formats.",
            "You have one web service for converting that to isot I and then you either get go along the uppers route via TCF encoder decoder pair and use the existing web list services or you go directly into web services that operate on that ISO TI format.",
            "In either case, what you'll get in the end is a nice OTI document.",
            "Plus the annotations that the web service has provided."
        ],
        [
            "So a few words about the isoline standard has actually rather long history.",
            "Yeah, I made some first suggestions on how to use TI for transcriptions of spoken language in 2005.",
            "We had a common a joint effort between different tool developers on interoperability between the transcription tools.",
            "Then there was this Clarion guide I already mentioned and further refinement of the TI proposal and since 2012 this has become an official ISO project which was concluded in August 2016 with the publication of that.",
            "I I so standard transcription of spoken language I have to say that the scope of this standard is clearly on orthographic transcription, not on phonetic transcription, and it's clearly on verbal behavior, not on multimodal aspects of interaction.",
            "You can probably make use of the standard for these things also, but you'll probably find that it's under specified in terms of phonetic features an in terms of multimodal.",
            "Things in any way.",
            "It is ready to use now.",
            "It is completely compatible with all the data we have at our two centers, so we would be ready to simply deliver our data in that format.",
            "There are existing converters, general purpose converters for X, meralda, folker, transcriber and chat.",
            "There's a we've tested it with Ellen Files on a corpus for couple spaces because as you know, Alan is one of the most complex format, so it's difficult to write a generic converter in that case.",
            "And it's also possible to convert brought, although you need an intermediate step here because Brad doesn't have a concept for speaker assignment, and that's crucial in that.",
            "Data model here."
        ],
        [
            "Yeah, what does it look like for the macro structure?",
            "We simply took the element that the GI guidelines already defined.",
            "You have speakers.",
            "You have a timeline and the main structures in a sequence of U elements with start and end points and you can have additional anchors inside the use for arbitrary alignment or alignment of arbitrary chunks of your transcription, and then underneath that you can have microstructure you don't.",
            "You don't have to, you can Simply put.",
            "Character data underneath that you probably can't really read that, but the first example is simply character data.",
            "The second one has an additional anchor inside the utterance, and the numbers three and four have additional structure, or most importantly tokenization.",
            "Meaning, word segments, past segments, vocal segments, and the last one also has a segmentation underneath EU element and.",
            "Above the word elements into.",
            "In this case, intonation phrases or more general sort of sentence equivalents of spoken language."
        ],
        [
            "Yeah, one thing we had to add, which is crucial to the annotation web services is a mechanism for standard annotation.",
            "There already is a generic mechanism defined in T which consists of spam groups and spend which refer to things that have ideas and we.",
            "Additionally introduced a so called annotation block to group utterances with their annotations.",
            "We borrowed this mechanism from the TI stand off proposal by local Marie, Piotr Banski and others, which was.",
            "Recently introduced at the TI Conference in Vienna."
        ],
        [
            "So the process now is like that.",
            "The first step is we convert from a given tool format to that ice OTII standard, which is done.",
            "Through stylesheet, forex, Marada, Transcriber and Foelker and by proxy by first converting.",
            "But the user doesn't need to know that through 2X Marada and then applying the stylesheet for chat and prod.",
            "And this is realized already as import and export filters in the tools we provide to the Community X Marada infocore.",
            "It is also realized as functionality of a so called Droplet Desktop application where you can simply drag and drop files on your local system, and then they'll get converted automatically.",
            "You may notice from from MP3 converters like lame drop or something and they also realized, and this is the important thing here as web services.",
            "At the Hamburg Center for example.",
            "I think that one is the X meralda converter, which already has a PID which is described with Cindy Meta data.",
            "So you can also find it through vlog.",
            "What's important is that.",
            "In most cases, the original formats don't have any explicit markup of microstructure except for folker, but tokenization is absolutely obligatory if you want to use TCF, because the token is the basic unit there, so included in that process is what we call a segmentation, which is a sort of tokenization algorithm that is built on the regular cheese of transcription conventions, and that will automatically.",
            "Move.",
            "Past the character data and at the microstructure markup."
        ],
        [
            "Yes, Step 2 then is to map this isot I format to the TCF input.",
            "The encoding step.",
            "Basically what we do here is we map what can be mapped and we ignore the rest.",
            "Basically this means we map word elements to tokens.",
            "Also, sometimes punctuation elements tokens, but that's not very common in spoken language transcription.",
            "And we use either U or if it exists, the more fine grained segmentation elements act as the sentence equivalent which which is also important for many annotation web services.",
            "We keep the original document in the textiles element of the TCF file, which is important because we want stateless processing of these data.",
            "So after it has been processed in web list, we have the original document, so to speak.",
            "In the resulting file.",
            "And since we keep the original IDs also in the TCF file, we are then able to merge the documents again and insert the new annotations into the.",
            "Input document."
        ],
        [
            "Yeah, then comes a weblist train where you can do basically anything that were published allows you so I won't go into any details here.",
            "You can tokenize, you can.",
            "Recognized named entertains.",
            "You can do constituent passing and so on.",
            "Resulting in a TCF file."
        ],
        [
            "It can then, in the last step, be decoded again into TI.",
            "I saw meaning.",
            "Most importantly that the TCF annotation layers, like the part of speech tags on the left hand side here, will be mapped to spans and span groups as prescribed by the.",
            "By the."
        ],
        [
            "Standard, yeah, that's one way of doing it.",
            "More elegant way would probably be to cut out the middleman that is not to go via.",
            "TCF but too.",
            "Use tii so directly, which means you wouldn't lose all the information that doesn't fit into TCF.",
            "So what we'd really like to have is Web services operating directly on the.",
            "T ISO format for example.",
            "One thing that we couldn't already provide is.",
            "A web service for adding a normalization layer.",
            "We have lots of data that is transcribed in modified orthography, also called literary transcription, and for many processing purposes you need an additional layer with standard orthography.",
            "We have methods to do that automatically, and we could turn that into a web service operating on TII.",
            "So likewise we have adapted the shortcut to being in text that.",
            "Um?",
            "2.",
            "Be more suitable for interaction data.",
            "We have a parameter file for tree Tiger for that now that would also be a candidate for web service directly operating on this transcription format and what would also be interesting is services which do not just operate on the transcription text but which also make use of the corresponding audio or video signal one.",
            "Point in case would be fast word alignment for web mouse.",
            "So you give web malls transcription.",
            "In that format you give it the.",
            "You give it the corresponding audio signal and what you get in return is alignment anchors for each in front of each word or something like that.",
            "There's actually no appropriate training tool for this kind of task at the moment.",
            "I thought that maybe switch port would be something like that, but as I learned yesterday, it's not really intended as a real training tool like web list, but just as a switchboard."
        ],
        [
            "Yeah, the status of implementation is.",
            "We've had a proof of concept in X meralda for quite some time, which doesn't operate on web published as a web application, but on Web list as a service.",
            "What you have on the right hand side here is the.",
            "For dialogue where you specify parameters for that proof of concept implementation, we also have all the converters ready.",
            "And yeah it took us some time to coordinate the Weblist integration.",
            "The big problem, or actually not that big, but really a bit hard to coordinate was.",
            "That we need to tell Web list in different steps what kind of form it's it is dealing with.",
            "That is done through MIME types and there was quite a lot of discussion in declaring developer forums and so on on how to agree on mine times, at least in German Clarence enters, but actually Claire in white.",
            "This is on the way.",
            "Now I think the standard committee will have something to say about this as well.",
            "So now we're actually ready and the web services are under construction.",
            "We wanted to have them ready for today, which didn't workout, but will probably have them ready.",
            "Once the.",
            "Um, the full versions of the papers are required.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is joint work between two German Clarence centers and myself and from the.",
                    "label": 0
                },
                {
                    "sent": "Archival spoken German at the Institute for the German Language and Ireland who is here in the audience somewhere, and Daniel, yet car from the Hamburg Center for Language Corpus.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so this is about web services web services in Clarin Clarin Deforest.",
                    "label": 0
                },
                {
                    "sent": "Start by which I mean the usual suspects such as services for lemma, teising, part of speech tagging, named entity recognition, passing and so on.",
                    "label": 0
                },
                {
                    "sent": "And especially the type of web services that web published allows you to chain and annotation chains, as many of you will know.",
                    "label": 0
                },
                {
                    "sent": "Weblist operates on the text corpus format as the underlying data model, which is.",
                    "label": 1
                },
                {
                    "sent": "And most of these services services are built with and also meant to operate on Canonical written language data.",
                    "label": 1
                },
                {
                    "sent": "Meaning typically newspaper takes.",
                    "label": 0
                },
                {
                    "sent": "There are other other kinds of modern written text, and the question we were.",
                    "label": 1
                },
                {
                    "sent": "Working on is.",
                    "label": 0
                },
                {
                    "sent": "How can these be used with transcriptions of spoken?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Language.",
                    "label": 0
                },
                {
                    "sent": "Yeah, spoken language data comes in.",
                    "label": 1
                },
                {
                    "sent": "A usually comes in one of a few widely used formats.",
                    "label": 1
                },
                {
                    "sent": "There actually was a guide on interoperability and standards in the first klaring phase, which identified some.",
                    "label": 0
                },
                {
                    "sent": "I don't know exactly 7 to 12 widely used form.",
                    "label": 0
                },
                {
                    "sent": "It's the most important ones are probably chat, which Brian just introduced.",
                    "label": 1
                },
                {
                    "sent": "The Elan annotation format X Marada Transcriber, and proud.",
                    "label": 1
                },
                {
                    "sent": "And one of the challenges here is that these formats are more than what you usually have for text there more than or they are different from a simple stream of tokens.",
                    "label": 1
                },
                {
                    "sent": "You have things like nonspeech tokens.",
                    "label": 0
                },
                {
                    "sent": "You have transcriptions of pauses of nonverbal activities.",
                    "label": 0
                },
                {
                    "sent": "Of other vocal active activities like breathing, you have parallel structures all over the place.",
                    "label": 0
                },
                {
                    "sent": "Especially overlaps, but also things like alternative transcriptions.",
                    "label": 0
                },
                {
                    "sent": "You typically have time alignment in these data, which is also piece of information you do not find in the Canonical written language.",
                    "label": 0
                },
                {
                    "sent": "You often do not have sentence is you do not have a strict document hierarchy, which is also a kind of silent assumption for many models that work with written language and you have things like incomplete or imperfect defect tokens like incomprehensible speech, incomplete words, disfluencies and so on for all of these reasons, TCF is actually not.",
                    "label": 1
                },
                {
                    "sent": "Sufficient to accommodate all the information that you find in spoken language transcriptions.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our general approach was to start from a common format to represent transcriptions, which is a nice or standard.",
                    "label": 1
                },
                {
                    "sent": "Very recently published and.",
                    "label": 1
                },
                {
                    "sent": "To have conversion web services that will turn the tool formats into that common format, and then there are two ways of going about the web service question.",
                    "label": 0
                },
                {
                    "sent": "One is to try to encode.",
                    "label": 0
                },
                {
                    "sent": "This common form into TCF then use the existing services and decode again to return to the original format, which somehow means you hide the spoken language.",
                    "label": 0
                },
                {
                    "sent": "Specific features of the data.",
                    "label": 0
                },
                {
                    "sent": "And the other way is to develop specific services that operate specifically on that common farm it, and maybe that are also specific to this type of data like orthographic normalization, forced word alignment, prosodic annotation, things that only makes sense for spoken language data.",
                    "label": 0
                },
                {
                    "sent": "Or you think of part of speech tagging that is aware of transcribed pauses, or something like that.",
                    "label": 0
                },
                {
                    "sent": "Yeah, look.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "General architecture within look something like this.",
                    "label": 0
                },
                {
                    "sent": "You start with one of the tool formats.",
                    "label": 0
                },
                {
                    "sent": "You have one web service for converting that to isot I and then you either get go along the uppers route via TCF encoder decoder pair and use the existing web list services or you go directly into web services that operate on that ISO TI format.",
                    "label": 0
                },
                {
                    "sent": "In either case, what you'll get in the end is a nice OTI document.",
                    "label": 0
                },
                {
                    "sent": "Plus the annotations that the web service has provided.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So a few words about the isoline standard has actually rather long history.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I made some first suggestions on how to use TI for transcriptions of spoken language in 2005.",
                    "label": 0
                },
                {
                    "sent": "We had a common a joint effort between different tool developers on interoperability between the transcription tools.",
                    "label": 0
                },
                {
                    "sent": "Then there was this Clarion guide I already mentioned and further refinement of the TI proposal and since 2012 this has become an official ISO project which was concluded in August 2016 with the publication of that.",
                    "label": 1
                },
                {
                    "sent": "I I so standard transcription of spoken language I have to say that the scope of this standard is clearly on orthographic transcription, not on phonetic transcription, and it's clearly on verbal behavior, not on multimodal aspects of interaction.",
                    "label": 1
                },
                {
                    "sent": "You can probably make use of the standard for these things also, but you'll probably find that it's under specified in terms of phonetic features an in terms of multimodal.",
                    "label": 0
                },
                {
                    "sent": "Things in any way.",
                    "label": 1
                },
                {
                    "sent": "It is ready to use now.",
                    "label": 0
                },
                {
                    "sent": "It is completely compatible with all the data we have at our two centers, so we would be ready to simply deliver our data in that format.",
                    "label": 1
                },
                {
                    "sent": "There are existing converters, general purpose converters for X, meralda, folker, transcriber and chat.",
                    "label": 0
                },
                {
                    "sent": "There's a we've tested it with Ellen Files on a corpus for couple spaces because as you know, Alan is one of the most complex format, so it's difficult to write a generic converter in that case.",
                    "label": 0
                },
                {
                    "sent": "And it's also possible to convert brought, although you need an intermediate step here because Brad doesn't have a concept for speaker assignment, and that's crucial in that.",
                    "label": 0
                },
                {
                    "sent": "Data model here.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, what does it look like for the macro structure?",
                    "label": 1
                },
                {
                    "sent": "We simply took the element that the GI guidelines already defined.",
                    "label": 0
                },
                {
                    "sent": "You have speakers.",
                    "label": 0
                },
                {
                    "sent": "You have a timeline and the main structures in a sequence of U elements with start and end points and you can have additional anchors inside the use for arbitrary alignment or alignment of arbitrary chunks of your transcription, and then underneath that you can have microstructure you don't.",
                    "label": 1
                },
                {
                    "sent": "You don't have to, you can Simply put.",
                    "label": 0
                },
                {
                    "sent": "Character data underneath that you probably can't really read that, but the first example is simply character data.",
                    "label": 0
                },
                {
                    "sent": "The second one has an additional anchor inside the utterance, and the numbers three and four have additional structure, or most importantly tokenization.",
                    "label": 0
                },
                {
                    "sent": "Meaning, word segments, past segments, vocal segments, and the last one also has a segmentation underneath EU element and.",
                    "label": 0
                },
                {
                    "sent": "Above the word elements into.",
                    "label": 1
                },
                {
                    "sent": "In this case, intonation phrases or more general sort of sentence equivalents of spoken language.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, one thing we had to add, which is crucial to the annotation web services is a mechanism for standard annotation.",
                    "label": 0
                },
                {
                    "sent": "There already is a generic mechanism defined in T which consists of spam groups and spend which refer to things that have ideas and we.",
                    "label": 0
                },
                {
                    "sent": "Additionally introduced a so called annotation block to group utterances with their annotations.",
                    "label": 1
                },
                {
                    "sent": "We borrowed this mechanism from the TI stand off proposal by local Marie, Piotr Banski and others, which was.",
                    "label": 0
                },
                {
                    "sent": "Recently introduced at the TI Conference in Vienna.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the process now is like that.",
                    "label": 0
                },
                {
                    "sent": "The first step is we convert from a given tool format to that ice OTII standard, which is done.",
                    "label": 1
                },
                {
                    "sent": "Through stylesheet, forex, Marada, Transcriber and Foelker and by proxy by first converting.",
                    "label": 0
                },
                {
                    "sent": "But the user doesn't need to know that through 2X Marada and then applying the stylesheet for chat and prod.",
                    "label": 0
                },
                {
                    "sent": "And this is realized already as import and export filters in the tools we provide to the Community X Marada infocore.",
                    "label": 1
                },
                {
                    "sent": "It is also realized as functionality of a so called Droplet Desktop application where you can simply drag and drop files on your local system, and then they'll get converted automatically.",
                    "label": 0
                },
                {
                    "sent": "You may notice from from MP3 converters like lame drop or something and they also realized, and this is the important thing here as web services.",
                    "label": 0
                },
                {
                    "sent": "At the Hamburg Center for example.",
                    "label": 0
                },
                {
                    "sent": "I think that one is the X meralda converter, which already has a PID which is described with Cindy Meta data.",
                    "label": 0
                },
                {
                    "sent": "So you can also find it through vlog.",
                    "label": 0
                },
                {
                    "sent": "What's important is that.",
                    "label": 0
                },
                {
                    "sent": "In most cases, the original formats don't have any explicit markup of microstructure except for folker, but tokenization is absolutely obligatory if you want to use TCF, because the token is the basic unit there, so included in that process is what we call a segmentation, which is a sort of tokenization algorithm that is built on the regular cheese of transcription conventions, and that will automatically.",
                    "label": 1
                },
                {
                    "sent": "Move.",
                    "label": 0
                },
                {
                    "sent": "Past the character data and at the microstructure markup.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yes, Step 2 then is to map this isot I format to the TCF input.",
                    "label": 1
                },
                {
                    "sent": "The encoding step.",
                    "label": 0
                },
                {
                    "sent": "Basically what we do here is we map what can be mapped and we ignore the rest.",
                    "label": 1
                },
                {
                    "sent": "Basically this means we map word elements to tokens.",
                    "label": 0
                },
                {
                    "sent": "Also, sometimes punctuation elements tokens, but that's not very common in spoken language transcription.",
                    "label": 0
                },
                {
                    "sent": "And we use either U or if it exists, the more fine grained segmentation elements act as the sentence equivalent which which is also important for many annotation web services.",
                    "label": 0
                },
                {
                    "sent": "We keep the original document in the textiles element of the TCF file, which is important because we want stateless processing of these data.",
                    "label": 0
                },
                {
                    "sent": "So after it has been processed in web list, we have the original document, so to speak.",
                    "label": 0
                },
                {
                    "sent": "In the resulting file.",
                    "label": 0
                },
                {
                    "sent": "And since we keep the original IDs also in the TCF file, we are then able to merge the documents again and insert the new annotations into the.",
                    "label": 0
                },
                {
                    "sent": "Input document.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, then comes a weblist train where you can do basically anything that were published allows you so I won't go into any details here.",
                    "label": 0
                },
                {
                    "sent": "You can tokenize, you can.",
                    "label": 0
                },
                {
                    "sent": "Recognized named entertains.",
                    "label": 0
                },
                {
                    "sent": "You can do constituent passing and so on.",
                    "label": 0
                },
                {
                    "sent": "Resulting in a TCF file.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It can then, in the last step, be decoded again into TI.",
                    "label": 0
                },
                {
                    "sent": "I saw meaning.",
                    "label": 0
                },
                {
                    "sent": "Most importantly that the TCF annotation layers, like the part of speech tags on the left hand side here, will be mapped to spans and span groups as prescribed by the.",
                    "label": 0
                },
                {
                    "sent": "By the.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Standard, yeah, that's one way of doing it.",
                    "label": 0
                },
                {
                    "sent": "More elegant way would probably be to cut out the middleman that is not to go via.",
                    "label": 1
                },
                {
                    "sent": "TCF but too.",
                    "label": 0
                },
                {
                    "sent": "Use tii so directly, which means you wouldn't lose all the information that doesn't fit into TCF.",
                    "label": 0
                },
                {
                    "sent": "So what we'd really like to have is Web services operating directly on the.",
                    "label": 1
                },
                {
                    "sent": "T ISO format for example.",
                    "label": 0
                },
                {
                    "sent": "One thing that we couldn't already provide is.",
                    "label": 0
                },
                {
                    "sent": "A web service for adding a normalization layer.",
                    "label": 0
                },
                {
                    "sent": "We have lots of data that is transcribed in modified orthography, also called literary transcription, and for many processing purposes you need an additional layer with standard orthography.",
                    "label": 0
                },
                {
                    "sent": "We have methods to do that automatically, and we could turn that into a web service operating on TII.",
                    "label": 0
                },
                {
                    "sent": "So likewise we have adapted the shortcut to being in text that.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 1
                },
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "Be more suitable for interaction data.",
                    "label": 0
                },
                {
                    "sent": "We have a parameter file for tree Tiger for that now that would also be a candidate for web service directly operating on this transcription format and what would also be interesting is services which do not just operate on the transcription text but which also make use of the corresponding audio or video signal one.",
                    "label": 0
                },
                {
                    "sent": "Point in case would be fast word alignment for web mouse.",
                    "label": 0
                },
                {
                    "sent": "So you give web malls transcription.",
                    "label": 0
                },
                {
                    "sent": "In that format you give it the.",
                    "label": 0
                },
                {
                    "sent": "You give it the corresponding audio signal and what you get in return is alignment anchors for each in front of each word or something like that.",
                    "label": 0
                },
                {
                    "sent": "There's actually no appropriate training tool for this kind of task at the moment.",
                    "label": 0
                },
                {
                    "sent": "I thought that maybe switch port would be something like that, but as I learned yesterday, it's not really intended as a real training tool like web list, but just as a switchboard.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, the status of implementation is.",
                    "label": 0
                },
                {
                    "sent": "We've had a proof of concept in X meralda for quite some time, which doesn't operate on web published as a web application, but on Web list as a service.",
                    "label": 0
                },
                {
                    "sent": "What you have on the right hand side here is the.",
                    "label": 0
                },
                {
                    "sent": "For dialogue where you specify parameters for that proof of concept implementation, we also have all the converters ready.",
                    "label": 1
                },
                {
                    "sent": "And yeah it took us some time to coordinate the Weblist integration.",
                    "label": 0
                },
                {
                    "sent": "The big problem, or actually not that big, but really a bit hard to coordinate was.",
                    "label": 0
                },
                {
                    "sent": "That we need to tell Web list in different steps what kind of form it's it is dealing with.",
                    "label": 0
                },
                {
                    "sent": "That is done through MIME types and there was quite a lot of discussion in declaring developer forums and so on on how to agree on mine times, at least in German Clarence enters, but actually Claire in white.",
                    "label": 0
                },
                {
                    "sent": "This is on the way.",
                    "label": 0
                },
                {
                    "sent": "Now I think the standard committee will have something to say about this as well.",
                    "label": 1
                },
                {
                    "sent": "So now we're actually ready and the web services are under construction.",
                    "label": 0
                },
                {
                    "sent": "We wanted to have them ready for today, which didn't workout, but will probably have them ready.",
                    "label": 0
                },
                {
                    "sent": "Once the.",
                    "label": 0
                },
                {
                    "sent": "Um, the full versions of the papers are required.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": []
        }
    }
}