{
    "id": "hdtzhf6jjqjzgvk6x3qherfewnzpverq",
    "title": "Complex Patterns in Reactive-Wetting Interface Dynamics",
    "info": {
        "author": [
            "Haim Taitelbaum, Bar-Ilan University"
        ],
        "published": "Oct. 17, 2008",
        "recorded": "September 2008",
        "category": [
            "Top->Science->Complexity Science"
        ]
    },
    "url": "http://videolectures.net/eccs08_taitelbaum_cpirwid/",
    "segmentation": [
        [
            "This is this is the case."
        ],
        [
            "How it is done practically well?",
            "You take the interface and then which has length of L 0 divided into some windows of length as one L1.",
            "And then you look inside this window.",
            "What is the height from one side to the other side?",
            "What is the effective height and you take the second moment of it so we have W the width.",
            "Then you repeat this for larger Windows L2 and then you average."
        ],
        [
            "Over the whole thing.",
            "Now the type of the result that you expect to obtain falling family Vicic is something of this kind that when you plot the log of the width versus log of the time you expect to find a straight line indicating the T to the power beta, which is the scaling glow in earlier times predicted by family check and then it should saturate and when it saturates, namely the defective, which does not grow anymore, then you can look how.",
            "It is rough and along the change.",
            "What is that?",
            "Say the correlation special correlation along the chain after the effective which has stopped to grow.",
            "So for example, our results for silver thickness 2000 Angstrom you see here.",
            "This is the result for the growth exponent, which is just the beta exponent.",
            "Here we got beta around 1/2, which was kind of a new new exponent which nobody saw in experiments.",
            "And this context of growing interfaces, but then more interesting is that you have the roughness exponent Alpha again, as I said, as a function of flanks, and here once you plug this reflects exponent Alpha, namely, you look at the width of the interface as a function of L. The length of it, the lateral length of the interface.",
            "It grows that way.",
            "Then it turns out that you get a crossover behavior.",
            "You get Alpha which is close to .8 Point 76, but then it crosses over to about 1/2.",
            "One half means that it is completely random, namely that by this crossover you can extract the correlation length and for example here in this figure that you see here, the correlation lengths is about at that point OK, which means that up to that distance from here to here.",
            "The interface moves or advances it kind of collective behavior, but after that distance the roughness exponent across is over two 1/2, which means that it becomes random that points on the interface in lengths above this length do not know each other and it is completely random.",
            "So at least you have some kind of measure of this complex pattern, namely to identify the correlation length of the lateral."
        ],
        [
            "Relation lengths of the interface.",
            "So this is summary of typical results that we got both on silver and one gold in various thickness is and then when you see this.",
            "Zoo experiments I should I say then he stopped.",
            "Look hey, what's going on?",
            "Is there any universality here?",
            "What is the universality class so?",
            "What you can say is that, for example, for Alpha, the roughness exponent, which is stored measured at later times.",
            "It's more or less around point .8.",
            ".8 + .8 minus.",
            "So the special special picture is quite consistent.",
            "However, for the beta you have a whole range of values and better let me remind you this is in the growing process in the area.",
            "Earlier times what might be the reason to that there is to that may have to do which?",
            "What drives the process, which is the noise, the substrate roughness, the silver.",
            "Or the gold.",
            "They are not smooth, they are not flat really.",
            "They have kind of substance, roughness and this different types of noise may.",
            "This is a conjecture may.",
            "Yeah, explain whi the initial process is characterized by different beta, however it's interesting to say that all of these exponent within some error bars or Bay the scaling relation AA over beta equals two 'cause there is kind of correlation when Alpha is higher, beta is is higher and will offer is smaller, better smaller so it's more or less in the same isotropic relation.",
            "But as I promised you, we want we would like to.",
            "Figure out the correlation length and here there is out of the correlation lengths measured.",
            "As I said from the crossover point in the figure of Alpha.",
            "So you see the correlation length is of order of several microns in each of the system.",
            "You can identify a different correlation length, and we believe that this has to do with the also with the."
        ],
        [
            "Substrate roughness Now an interesting feature is that when you look at a single interface, you don't really get directly the parallel predicted by family.",
            "We check it is only.",
            "Proximation this parallel but you get some fluctuations, which means that the width grows and then shrinks, grows, and shrinks.",
            "As a."
        ],
        [
            "Function of time and if you see here a series of patterns you see, for example that here on.",
            "Snapshot #14 and then #15.",
            "Whoops, you see that where does just a minute?",
            "OK, you see that the width is large, but then you go to number 19.",
            "Then it's small again.",
            "So you have some kind of non monotonic growth."
        ],
        [
            "Of the weights, which can be explained on the basis of kind of competition.",
            "So if we take some nonlinear equations that we at several points in our research believe this to describe more or less our system, we have we start from a flat interface as shown below.",
            "And then there are a few terms in this Q KPZ equation and 1st you have to have noise.",
            "You have to have a little bump in order to initiate the process.",
            "Then once there is a bump you have a Delta H. The Delta HH is the height of the interface, namely the young.",
            "As I showed you before.",
            "So once you have Delta H, then the nonlinear term can start to act because up to that point, no noise, no Delta H, no growth.",
            "So then the nonlinear grows, grows non linearly as predicted by QKPC.",
            "But then comes the surface tension term to bring it back.",
            "So we believe this competition between nonlinear growth and surface tension is the result.",
            "Is the reason for the resulting non monotonic behavior of the."
        ],
        [
            "Actuaciones yes.",
            "OK, there is a way to extract something and this is what I'm going to show that a quantitative analysis of this fluctuation.",
            "If you work we suggested a new measure to work on the distances on the log log plot because the fluctuations are seen on the log log scale.",
            "So this new measure takes the differences between the log values OK and this is the measure that we did."
        ],
        [
            "Fine and using this measure, it turns out that these fluctuations and hide behind them the googled correlation length, namely that you remember the correlation lengths, the lateral corrections that I showed you before we extracted it from the roughness exponent Alpha measurements.",
            "Here it is shown that once you plot this measure fluctuations that we showed before as a function of the length, you see some kind of maximum and this maximum occurs exactly.",
            "Where the correlation length is there and this is very a very nice because in order to extract the correlation length you have to wait until the very end of the process from Alpha, while here this is a way to extract the correlation length from the fluctuations which occur."
        ],
        [
            "Earlier times.",
            "This is what we got.",
            "Also in simulation results, namely, when we do it on the single interface.",
            "This is what you get.",
            "You don't get a single line, but you get."
        ],
        [
            "Situations.",
            "And the size of the fluctuations verifies this competition scheme becausw.",
            "If we plot the fluctuations 5 square that the measure of operations versus knee over Lambda Nueva Lambda are the coefficients of the surface tension versus the non linear growth.",
            "It turns out that the overall size of fluctuation is the highest when the ratio is about when Lambda equals more lesney, namely when the competition is the strongest one, while in any other case one of the mechanism dominates in the fluctuate."
        ],
        [
            "These are smaller.",
            "And indeed, this is a single interface phenomena, because when you average over many interface, the fluctuations tend to disappear, leading towards eventually to the."
        ],
        [
            "Richard Scaling now here is an example how we extract this crossover length.",
            "Here for example the same 8 millimeters from the fluctuations and from the Roughnecks exponent, but this?"
        ],
        [
            "This method works.",
            "We looked in the literature, there were some results.",
            "Will pictures of interfaces were plot of water, water spreading on paper by family in 1992.",
            "So we took this data and worked it out with our method because there is very few data of the dynamics of the process.",
            "Most of this kinetic roughening refer to Alpha the roughness.",
            "It's very difficult to work on the initial regime, so we took this data where he showed a series of growing interfaces.",
            "And indeed, the same.",
            "We found the same that the crossover links can be extracted either from the earlier stages through these fluctuations or from the variance with roughness.",
            "And here the correlation is 9 millimeter which is re order of magnitude higher than our reactive voting system.",
            "Just to tell you that."
        ],
        [
            "This system works now.",
            "Uh.",
            "Was this picture in mind?",
            "Recall that we believe that the noise has to do a lot with this process, So what we did in order to get this surface?",
            "Substrate roughness by AFM.",
            "We decided that we're going to design the roughness."
        ],
        [
            "Of ourselves using lithography techniques.",
            "So what we did is we took firms and we patterned them, either isotropic or anisotropic, and these patterns are doing using lithography and resolution of a few microns which is more or less around the correlation length.",
            "And I'll show I'll show you a few movies, But the interesting result is that the roughness exponent is always around .8, it does doesn't have any effect, so namely that.",
            "It's very robust with respect to this roughness, and the roughness may influence the initial growth."
        ],
        [
            "But not the eventual state.",
            "So for example, this is the isotropic roughness.",
            "Let me show you a little movie.",
            "OK, you see, the distance between the.",
            "Cube so hose is 4 microns.",
            "Something of this kind.",
            "You see how it evolves?",
            "Um, the over velocity of the front is different than in the seemingly smooth case, but the roughness they are for roughness is the same.",
            "It was very difficult to measure here the growth exponent because of technical reasons, so we know here only the roughness."
        ],
        [
            "And if we go to spreading into the anisotropic samples which have like channels like motion.",
            "So for example this is spreading along these channels that we that we created.",
            "You see finger legs.",
            "But surprisingly enough when we do the statistics, even in the finger like behavior, it was a kind of surprise when you do the analysis you get Alpha around .8 the same occurs.",
            "When?"
        ],
        [
            "When you do it.",
            "Where the spreading OK when the spreading is perpendicular to the channels direction and here it's very nice to see that spreading is perpendicular.",
            "This channels you see different velocity uphill and then down here and then uphill and then down here this is velocity.",
            "But you see this complex patterns when you analyze them doesn't matter .8.",
            "OK so the point is is OK."
        ],
        [
            "Another thing that is that we that we did is to examine some temperature effects around room temperature.",
            "We have some heating stage that can vary the temperature from minus 15 Celsius up to 25, so we got.",
            "Different shapes we invested in."
        ],
        [
            "Investigated them and then we find that again Alpha is always around.",
            "This .8 almost does not change as a function of temperature.",
            "However, the beta, the gross.",
            "Exponent increases with temperature significantly, and this is something that we.",
            "One may say that it is intuitive that once you hit it up then it grows, but there are data in the lift, torture in many models of kinetic roughening, in simulations, etc.",
            "In some others, the beta increases and in some others the beta decreases it depending on the underlying mechanisms of the process.",
            "OK, so it breaks and we don't understand it yet.",
            "Perhaps perhaps we don't understand it yet because it breaks the scaling?",
            "Or did the scaling is not really?",
            "I mean, maybe this scaling creation is not valid in any temperature.",
            "So OK, so this gives a motivation to work first."
        ],
        [
            "So what really happens in the growth regime?",
            "What happens there?",
            "So when you look at the data how the real data looks like, it does not obey this simple picture of growth and then situation, which is the picture that is predicted by a family, we check data and then the situation from which we extract Alpha.",
            "But whether you get some kind of noisy data of this kind, the different different curves are related to different sizes of Windows, which you do the analysis, but all of them.",
            "Follow the same patterns so we see we identify this region as the growth regime and this region as the situation, and we have some kind of initial process before all of this is going on.",
            "So this is the picture that we have in mind, namely it is quite different it quite difficult to identify when the gross really starts.",
            "And the experiments are very different from one another, and it was very difficult to get a set of, let's say, 15 experiments and to try to see the same pattern in 10 of them and to take the other five.",
            "It's very non reproducible because this is a very complex system which is affected probably by."
        ],
        [
            "Many, many parameters, so we employed the persistence measure and the persistence measure is the last thing that I want to talk about it today.",
            "And the persistent probability is the probability that a certain fluctuated variable never crosses a chosen reference level within time interval T. So we have a plot.",
            "Some arbitrary measure A as a function of time.",
            "So you take a reference level.",
            "This is your reference level and then you take a time interval.",
            "You take the time interval and you ask yourself, does the.",
            "Yeah, variable, cross it or not.",
            "So here in this small interval it does not cross it in both both along the interval it is below this reference level.",
            "However when you increase.",
            "The interval, of course there's a more higher probability that it will cross this level, as we can see here that indeed it crosses the variable, crosses it here, and almost causes it here again, namely the probability not to cross it decays in time, and the scaling for that was suggested by the reader was here in this conference was T to the minus Theta, where Theta is called the persistence experiment."
        ],
        [
            "Now, what is the persistence in our case in the reactive working interface?",
            "Let's go back to our growing interfaces and let's follow dot along this interface.",
            "So for example, this is a point on the interface.",
            "This sets the.",
            "Our reference level.",
            "The reference level is the height at some given time, which is the the the initial time of the time interval which you look at.",
            "So you see on the left side that if we look all the time, we extract the average of the interface in order to normalize it, so to speak.",
            "So if you see here that.",
            "This is the height at time T0.",
            "You see that they're red.",
            "Point here is above and here it also above.",
            "Namely, it is persistent.",
            "However, on the right side you see that it starts the same, but here it's above the line, while here it's billable lines so it crossed the lever.",
            "It's not persistent anymore, so this is the finish."
        ],
        [
            "Persistence.",
            "So what you do there is a complicated algorithm to calculate the persistence probability.",
            "What you have to do is to create a trajectory of a single point, say this red point on the interface, and to plot its location or its height versus time.",
            "So here we have time series typical too many, many, many plots that we've seen in this conference, and in many cases I would recommend to try to play with this persistence.",
            "So you take a given interval, say.",
            "An interval of this length and the reference level is the location of the point in the initial of kindervelt.",
            "So here it does not cross it, while here it does cross it and then you do the algorithm you run over all intervals and measure the persistence.",
            "Then you over overall points and overall initial times an it's a.",
            "It's a lot of work.",
            "This is the algorithm and eventually you end up with in with an exponent.",
            "Now just to say something that.",
            "Within these first questions, passage kind of problems.",
            "There's also what is called survival probability, which is almost the same apart from the fact that the reference level is not in the beginning of the interval, but it's fixed along the process.",
            "The reference level is constant.",
            "For example, it is just the average of the line, not below as before, but on the average here and then.",
            "The interesting thing about it that why?",
            "The survival exhibits an exponential decay, that persistence, which is measured from a given point, shows a power law decay and one can think about it.",
            "Why does it happen?",
            "It's not, it's not."
        ],
        [
            "Immediately intuitive now with respect to persistence.",
            "What you can get from it.",
            "There are lots of results of persistence.",
            "Exponents in the literature in last decade, and you see again, many many exponents and you don't know if it's going to help you or not.",
            "But let's focus for example on this data .30 seven of four Ising model in one dimension firm magnett for magnetic, where the fluctuation variable, the location of the of the spins at the boundaries.",
            "Um?",
            "Interesting relation in linear Langevin equations is that this data is related to the beta to the growth exponent in nonillion equations.",
            "You have two types of persistence exponent to distinguish between systems where you cross the reference level from below or from above."
        ],
        [
            "Also experimental results many many theaters.",
            "So once we entered this, we understood that perhaps it's going to complicate things rather than to explain to us what happens in the in the growing regime.",
            "And we so many.",
            "We looked at many.",
            "Results, for example, something which is quite similar to our system combustion fronts in paper, which is described by nonlinear equation, but their relation faith out equals 1 minus beta, which is valid in linear system.",
            "Does hold there.",
            "The persistence is not really understood."
        ],
        [
            "To the very end.",
            "Now in our case, the results for our reactive wetting are as follows.",
            "Recall that I showed you that for this is W as a function of time.",
            "There is the initial regime, then the growth, then the situation.",
            "This is typical as I showed you before, so when you put the persistence, you get an persistent exponent, which is 55, which is almost like like random walk.",
            "Almost like random walk and.",
            "This is for the initial regime, so the persistence in for the persistence in the growth regime here in this area.",
            "Here you have to start a new calculation because as I told you, the persistence has to do with the time interval and the giver given reference level, which is the initial location of the point at this time.",
            "So you cannot rely on the calculations from the very beginning of the process.",
            "But you have to start a new calculation where the growth."
        ],
        [
            "Start so you do that and then, surprisingly you get a result fatal.",
            "Point 37, which we already met in the Ising model.",
            "Interestingly enough, in this growth regime, starting as you see here, the right arrow, we got that the beta, the growth exponent and Theta the persistence.",
            "Do away the relation which is expected to be in linear systems within the aerobars.",
            "That Theta equals one man."
        ],
        [
            "It's better then for the situation regime.",
            "You against have to start a new calculation and here again you get results, which is kind of 1/2 which."
        ],
        [
            "Is kind of random walk, so our global interpretation.",
            "If you recall, the local interpretation that before is that in the very earlier stage growth the width does not grow, it just plays around, but effectively does not grow.",
            "It is constant at this very step.",
            "The persistence goal is 1/2 because it is just random.",
            "Then in the nonlinear growth you see here how a few snapshots, how do it grows and grows and grows here?",
            "The persistence is the point 37, and then when it stops the growth, the which remains constant, which represent the effect of the overall surface tension, which tends to borrow things and to stop the process.",
            "So you again get the."
        ],
        [
            "Five, which is kind of fun to work.",
            "So then we after this picture we wanted to see what happens in simulations.",
            "So we took the QKPC and.",
            "We got exponents which are not like in the experiment for the Theta for the persistence, and then we took a chain of Ising spins in order to create kind of an artificial interface.",
            "And here we did get the results predicted in the literature point 37.38, exactly like in."
        ],
        [
            "The growth regime in the experiment.",
            "So now we can't even know, confused.",
            "And now if we summarize the Alpha, beta, Theta and the QK present in the Ising trying to figure out what to do or what to understand.",
            "So this is our current understanding of the things that the beta growth exponent is more or less like PC within the error bars.",
            "The figure.",
            "Do not belong to QK busy.",
            "However, the Ising the persistence measure is more like Ising model.",
            "So now think about the suggestion that maybe the macroscopic behavior which is reflected by the growth, which is a different kind of exponent, say from the persistence.",
            "It does not look at the minute details as persistent does.",
            "Maybe the macroscopic is QKPC and the microscopic is Ising, and we still this is work, which is still."
        ],
        [
            "The progress with respect to the persistence.",
            "So just to summarize this portion, we had sweet kinetic regimes.",
            "Random walk then grows obeying the Theta plus beta equals one and then random walk again the macroscopic is.",
            "The growth exponent is more like UWP, is it why the microscopic exactly Ising?"
        ],
        [
            "We still work on that.",
            "In summary, I told you what is reactive voting.",
            "So do this our system where we get side view from top view and we spoke a little about bulk spreading in this reactive wedding general and then we spoke about the complex patterns.",
            "I'm sorry.",
            "This spectral temporal reflected by the roughness of growth exponent and with respect to special properties.",
            "We spoke about the ability to extract the lateral correlation lengths in two ways, and the persistent measures which adds new information and hopefully new insights which will emerge.",
            "And this is the reference to the another model which we worked out about continuous fear."
        ],
        [
            "Invasion model and this is the list of all our works in this field.",
            "Thank you very much.",
            "OK, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is this is the case.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How it is done practically well?",
                    "label": 0
                },
                {
                    "sent": "You take the interface and then which has length of L 0 divided into some windows of length as one L1.",
                    "label": 0
                },
                {
                    "sent": "And then you look inside this window.",
                    "label": 0
                },
                {
                    "sent": "What is the height from one side to the other side?",
                    "label": 0
                },
                {
                    "sent": "What is the effective height and you take the second moment of it so we have W the width.",
                    "label": 0
                },
                {
                    "sent": "Then you repeat this for larger Windows L2 and then you average.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Over the whole thing.",
                    "label": 0
                },
                {
                    "sent": "Now the type of the result that you expect to obtain falling family Vicic is something of this kind that when you plot the log of the width versus log of the time you expect to find a straight line indicating the T to the power beta, which is the scaling glow in earlier times predicted by family check and then it should saturate and when it saturates, namely the defective, which does not grow anymore, then you can look how.",
                    "label": 0
                },
                {
                    "sent": "It is rough and along the change.",
                    "label": 0
                },
                {
                    "sent": "What is that?",
                    "label": 0
                },
                {
                    "sent": "Say the correlation special correlation along the chain after the effective which has stopped to grow.",
                    "label": 0
                },
                {
                    "sent": "So for example, our results for silver thickness 2000 Angstrom you see here.",
                    "label": 0
                },
                {
                    "sent": "This is the result for the growth exponent, which is just the beta exponent.",
                    "label": 0
                },
                {
                    "sent": "Here we got beta around 1/2, which was kind of a new new exponent which nobody saw in experiments.",
                    "label": 0
                },
                {
                    "sent": "And this context of growing interfaces, but then more interesting is that you have the roughness exponent Alpha again, as I said, as a function of flanks, and here once you plug this reflects exponent Alpha, namely, you look at the width of the interface as a function of L. The length of it, the lateral length of the interface.",
                    "label": 0
                },
                {
                    "sent": "It grows that way.",
                    "label": 0
                },
                {
                    "sent": "Then it turns out that you get a crossover behavior.",
                    "label": 1
                },
                {
                    "sent": "You get Alpha which is close to .8 Point 76, but then it crosses over to about 1/2.",
                    "label": 0
                },
                {
                    "sent": "One half means that it is completely random, namely that by this crossover you can extract the correlation length and for example here in this figure that you see here, the correlation lengths is about at that point OK, which means that up to that distance from here to here.",
                    "label": 0
                },
                {
                    "sent": "The interface moves or advances it kind of collective behavior, but after that distance the roughness exponent across is over two 1/2, which means that it becomes random that points on the interface in lengths above this length do not know each other and it is completely random.",
                    "label": 0
                },
                {
                    "sent": "So at least you have some kind of measure of this complex pattern, namely to identify the correlation length of the lateral.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Relation lengths of the interface.",
                    "label": 0
                },
                {
                    "sent": "So this is summary of typical results that we got both on silver and one gold in various thickness is and then when you see this.",
                    "label": 1
                },
                {
                    "sent": "Zoo experiments I should I say then he stopped.",
                    "label": 0
                },
                {
                    "sent": "Look hey, what's going on?",
                    "label": 0
                },
                {
                    "sent": "Is there any universality here?",
                    "label": 0
                },
                {
                    "sent": "What is the universality class so?",
                    "label": 1
                },
                {
                    "sent": "What you can say is that, for example, for Alpha, the roughness exponent, which is stored measured at later times.",
                    "label": 0
                },
                {
                    "sent": "It's more or less around point .8.",
                    "label": 0
                },
                {
                    "sent": ".8 + .8 minus.",
                    "label": 0
                },
                {
                    "sent": "So the special special picture is quite consistent.",
                    "label": 0
                },
                {
                    "sent": "However, for the beta you have a whole range of values and better let me remind you this is in the growing process in the area.",
                    "label": 0
                },
                {
                    "sent": "Earlier times what might be the reason to that there is to that may have to do which?",
                    "label": 0
                },
                {
                    "sent": "What drives the process, which is the noise, the substrate roughness, the silver.",
                    "label": 0
                },
                {
                    "sent": "Or the gold.",
                    "label": 0
                },
                {
                    "sent": "They are not smooth, they are not flat really.",
                    "label": 0
                },
                {
                    "sent": "They have kind of substance, roughness and this different types of noise may.",
                    "label": 0
                },
                {
                    "sent": "This is a conjecture may.",
                    "label": 0
                },
                {
                    "sent": "Yeah, explain whi the initial process is characterized by different beta, however it's interesting to say that all of these exponent within some error bars or Bay the scaling relation AA over beta equals two 'cause there is kind of correlation when Alpha is higher, beta is is higher and will offer is smaller, better smaller so it's more or less in the same isotropic relation.",
                    "label": 0
                },
                {
                    "sent": "But as I promised you, we want we would like to.",
                    "label": 1
                },
                {
                    "sent": "Figure out the correlation length and here there is out of the correlation lengths measured.",
                    "label": 0
                },
                {
                    "sent": "As I said from the crossover point in the figure of Alpha.",
                    "label": 0
                },
                {
                    "sent": "So you see the correlation length is of order of several microns in each of the system.",
                    "label": 0
                },
                {
                    "sent": "You can identify a different correlation length, and we believe that this has to do with the also with the.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Substrate roughness Now an interesting feature is that when you look at a single interface, you don't really get directly the parallel predicted by family.",
                    "label": 1
                },
                {
                    "sent": "We check it is only.",
                    "label": 0
                },
                {
                    "sent": "Proximation this parallel but you get some fluctuations, which means that the width grows and then shrinks, grows, and shrinks.",
                    "label": 0
                },
                {
                    "sent": "As a.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Function of time and if you see here a series of patterns you see, for example that here on.",
                    "label": 0
                },
                {
                    "sent": "Snapshot #14 and then #15.",
                    "label": 0
                },
                {
                    "sent": "Whoops, you see that where does just a minute?",
                    "label": 0
                },
                {
                    "sent": "OK, you see that the width is large, but then you go to number 19.",
                    "label": 0
                },
                {
                    "sent": "Then it's small again.",
                    "label": 0
                },
                {
                    "sent": "So you have some kind of non monotonic growth.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of the weights, which can be explained on the basis of kind of competition.",
                    "label": 0
                },
                {
                    "sent": "So if we take some nonlinear equations that we at several points in our research believe this to describe more or less our system, we have we start from a flat interface as shown below.",
                    "label": 0
                },
                {
                    "sent": "And then there are a few terms in this Q KPZ equation and 1st you have to have noise.",
                    "label": 0
                },
                {
                    "sent": "You have to have a little bump in order to initiate the process.",
                    "label": 0
                },
                {
                    "sent": "Then once there is a bump you have a Delta H. The Delta HH is the height of the interface, namely the young.",
                    "label": 0
                },
                {
                    "sent": "As I showed you before.",
                    "label": 0
                },
                {
                    "sent": "So once you have Delta H, then the nonlinear term can start to act because up to that point, no noise, no Delta H, no growth.",
                    "label": 0
                },
                {
                    "sent": "So then the nonlinear grows, grows non linearly as predicted by QKPC.",
                    "label": 0
                },
                {
                    "sent": "But then comes the surface tension term to bring it back.",
                    "label": 0
                },
                {
                    "sent": "So we believe this competition between nonlinear growth and surface tension is the result.",
                    "label": 1
                },
                {
                    "sent": "Is the reason for the resulting non monotonic behavior of the.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Actuaciones yes.",
                    "label": 0
                },
                {
                    "sent": "OK, there is a way to extract something and this is what I'm going to show that a quantitative analysis of this fluctuation.",
                    "label": 1
                },
                {
                    "sent": "If you work we suggested a new measure to work on the distances on the log log plot because the fluctuations are seen on the log log scale.",
                    "label": 0
                },
                {
                    "sent": "So this new measure takes the differences between the log values OK and this is the measure that we did.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fine and using this measure, it turns out that these fluctuations and hide behind them the googled correlation length, namely that you remember the correlation lengths, the lateral corrections that I showed you before we extracted it from the roughness exponent Alpha measurements.",
                    "label": 0
                },
                {
                    "sent": "Here it is shown that once you plot this measure fluctuations that we showed before as a function of the length, you see some kind of maximum and this maximum occurs exactly.",
                    "label": 0
                },
                {
                    "sent": "Where the correlation length is there and this is very a very nice because in order to extract the correlation length you have to wait until the very end of the process from Alpha, while here this is a way to extract the correlation length from the fluctuations which occur.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Earlier times.",
                    "label": 0
                },
                {
                    "sent": "This is what we got.",
                    "label": 0
                },
                {
                    "sent": "Also in simulation results, namely, when we do it on the single interface.",
                    "label": 1
                },
                {
                    "sent": "This is what you get.",
                    "label": 1
                },
                {
                    "sent": "You don't get a single line, but you get.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Situations.",
                    "label": 0
                },
                {
                    "sent": "And the size of the fluctuations verifies this competition scheme becausw.",
                    "label": 0
                },
                {
                    "sent": "If we plot the fluctuations 5 square that the measure of operations versus knee over Lambda Nueva Lambda are the coefficients of the surface tension versus the non linear growth.",
                    "label": 0
                },
                {
                    "sent": "It turns out that the overall size of fluctuation is the highest when the ratio is about when Lambda equals more lesney, namely when the competition is the strongest one, while in any other case one of the mechanism dominates in the fluctuate.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These are smaller.",
                    "label": 0
                },
                {
                    "sent": "And indeed, this is a single interface phenomena, because when you average over many interface, the fluctuations tend to disappear, leading towards eventually to the.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Richard Scaling now here is an example how we extract this crossover length.",
                    "label": 0
                },
                {
                    "sent": "Here for example the same 8 millimeters from the fluctuations and from the Roughnecks exponent, but this?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This method works.",
                    "label": 0
                },
                {
                    "sent": "We looked in the literature, there were some results.",
                    "label": 0
                },
                {
                    "sent": "Will pictures of interfaces were plot of water, water spreading on paper by family in 1992.",
                    "label": 1
                },
                {
                    "sent": "So we took this data and worked it out with our method because there is very few data of the dynamics of the process.",
                    "label": 0
                },
                {
                    "sent": "Most of this kinetic roughening refer to Alpha the roughness.",
                    "label": 0
                },
                {
                    "sent": "It's very difficult to work on the initial regime, so we took this data where he showed a series of growing interfaces.",
                    "label": 0
                },
                {
                    "sent": "And indeed, the same.",
                    "label": 0
                },
                {
                    "sent": "We found the same that the crossover links can be extracted either from the earlier stages through these fluctuations or from the variance with roughness.",
                    "label": 0
                },
                {
                    "sent": "And here the correlation is 9 millimeter which is re order of magnitude higher than our reactive voting system.",
                    "label": 0
                },
                {
                    "sent": "Just to tell you that.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This system works now.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "Was this picture in mind?",
                    "label": 0
                },
                {
                    "sent": "Recall that we believe that the noise has to do a lot with this process, So what we did in order to get this surface?",
                    "label": 0
                },
                {
                    "sent": "Substrate roughness by AFM.",
                    "label": 0
                },
                {
                    "sent": "We decided that we're going to design the roughness.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of ourselves using lithography techniques.",
                    "label": 1
                },
                {
                    "sent": "So what we did is we took firms and we patterned them, either isotropic or anisotropic, and these patterns are doing using lithography and resolution of a few microns which is more or less around the correlation length.",
                    "label": 0
                },
                {
                    "sent": "And I'll show I'll show you a few movies, But the interesting result is that the roughness exponent is always around .8, it does doesn't have any effect, so namely that.",
                    "label": 1
                },
                {
                    "sent": "It's very robust with respect to this roughness, and the roughness may influence the initial growth.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But not the eventual state.",
                    "label": 0
                },
                {
                    "sent": "So for example, this is the isotropic roughness.",
                    "label": 1
                },
                {
                    "sent": "Let me show you a little movie.",
                    "label": 0
                },
                {
                    "sent": "OK, you see, the distance between the.",
                    "label": 0
                },
                {
                    "sent": "Cube so hose is 4 microns.",
                    "label": 0
                },
                {
                    "sent": "Something of this kind.",
                    "label": 0
                },
                {
                    "sent": "You see how it evolves?",
                    "label": 1
                },
                {
                    "sent": "Um, the over velocity of the front is different than in the seemingly smooth case, but the roughness they are for roughness is the same.",
                    "label": 0
                },
                {
                    "sent": "It was very difficult to measure here the growth exponent because of technical reasons, so we know here only the roughness.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And if we go to spreading into the anisotropic samples which have like channels like motion.",
                    "label": 0
                },
                {
                    "sent": "So for example this is spreading along these channels that we that we created.",
                    "label": 1
                },
                {
                    "sent": "You see finger legs.",
                    "label": 0
                },
                {
                    "sent": "But surprisingly enough when we do the statistics, even in the finger like behavior, it was a kind of surprise when you do the analysis you get Alpha around .8 the same occurs.",
                    "label": 0
                },
                {
                    "sent": "When?",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "When you do it.",
                    "label": 0
                },
                {
                    "sent": "Where the spreading OK when the spreading is perpendicular to the channels direction and here it's very nice to see that spreading is perpendicular.",
                    "label": 1
                },
                {
                    "sent": "This channels you see different velocity uphill and then down here and then uphill and then down here this is velocity.",
                    "label": 0
                },
                {
                    "sent": "But you see this complex patterns when you analyze them doesn't matter .8.",
                    "label": 0
                },
                {
                    "sent": "OK so the point is is OK.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another thing that is that we that we did is to examine some temperature effects around room temperature.",
                    "label": 0
                },
                {
                    "sent": "We have some heating stage that can vary the temperature from minus 15 Celsius up to 25, so we got.",
                    "label": 0
                },
                {
                    "sent": "Different shapes we invested in.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Investigated them and then we find that again Alpha is always around.",
                    "label": 0
                },
                {
                    "sent": "This .8 almost does not change as a function of temperature.",
                    "label": 0
                },
                {
                    "sent": "However, the beta, the gross.",
                    "label": 0
                },
                {
                    "sent": "Exponent increases with temperature significantly, and this is something that we.",
                    "label": 0
                },
                {
                    "sent": "One may say that it is intuitive that once you hit it up then it grows, but there are data in the lift, torture in many models of kinetic roughening, in simulations, etc.",
                    "label": 0
                },
                {
                    "sent": "In some others, the beta increases and in some others the beta decreases it depending on the underlying mechanisms of the process.",
                    "label": 0
                },
                {
                    "sent": "OK, so it breaks and we don't understand it yet.",
                    "label": 0
                },
                {
                    "sent": "Perhaps perhaps we don't understand it yet because it breaks the scaling?",
                    "label": 0
                },
                {
                    "sent": "Or did the scaling is not really?",
                    "label": 0
                },
                {
                    "sent": "I mean, maybe this scaling creation is not valid in any temperature.",
                    "label": 0
                },
                {
                    "sent": "So OK, so this gives a motivation to work first.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what really happens in the growth regime?",
                    "label": 1
                },
                {
                    "sent": "What happens there?",
                    "label": 0
                },
                {
                    "sent": "So when you look at the data how the real data looks like, it does not obey this simple picture of growth and then situation, which is the picture that is predicted by a family, we check data and then the situation from which we extract Alpha.",
                    "label": 0
                },
                {
                    "sent": "But whether you get some kind of noisy data of this kind, the different different curves are related to different sizes of Windows, which you do the analysis, but all of them.",
                    "label": 0
                },
                {
                    "sent": "Follow the same patterns so we see we identify this region as the growth regime and this region as the situation, and we have some kind of initial process before all of this is going on.",
                    "label": 0
                },
                {
                    "sent": "So this is the picture that we have in mind, namely it is quite different it quite difficult to identify when the gross really starts.",
                    "label": 0
                },
                {
                    "sent": "And the experiments are very different from one another, and it was very difficult to get a set of, let's say, 15 experiments and to try to see the same pattern in 10 of them and to take the other five.",
                    "label": 0
                },
                {
                    "sent": "It's very non reproducible because this is a very complex system which is affected probably by.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Many, many parameters, so we employed the persistence measure and the persistence measure is the last thing that I want to talk about it today.",
                    "label": 0
                },
                {
                    "sent": "And the persistent probability is the probability that a certain fluctuated variable never crosses a chosen reference level within time interval T. So we have a plot.",
                    "label": 1
                },
                {
                    "sent": "Some arbitrary measure A as a function of time.",
                    "label": 0
                },
                {
                    "sent": "So you take a reference level.",
                    "label": 0
                },
                {
                    "sent": "This is your reference level and then you take a time interval.",
                    "label": 0
                },
                {
                    "sent": "You take the time interval and you ask yourself, does the.",
                    "label": 0
                },
                {
                    "sent": "Yeah, variable, cross it or not.",
                    "label": 0
                },
                {
                    "sent": "So here in this small interval it does not cross it in both both along the interval it is below this reference level.",
                    "label": 0
                },
                {
                    "sent": "However when you increase.",
                    "label": 0
                },
                {
                    "sent": "The interval, of course there's a more higher probability that it will cross this level, as we can see here that indeed it crosses the variable, crosses it here, and almost causes it here again, namely the probability not to cross it decays in time, and the scaling for that was suggested by the reader was here in this conference was T to the minus Theta, where Theta is called the persistence experiment.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now, what is the persistence in our case in the reactive working interface?",
                    "label": 0
                },
                {
                    "sent": "Let's go back to our growing interfaces and let's follow dot along this interface.",
                    "label": 0
                },
                {
                    "sent": "So for example, this is a point on the interface.",
                    "label": 0
                },
                {
                    "sent": "This sets the.",
                    "label": 0
                },
                {
                    "sent": "Our reference level.",
                    "label": 0
                },
                {
                    "sent": "The reference level is the height at some given time, which is the the the initial time of the time interval which you look at.",
                    "label": 0
                },
                {
                    "sent": "So you see on the left side that if we look all the time, we extract the average of the interface in order to normalize it, so to speak.",
                    "label": 0
                },
                {
                    "sent": "So if you see here that.",
                    "label": 0
                },
                {
                    "sent": "This is the height at time T0.",
                    "label": 1
                },
                {
                    "sent": "You see that they're red.",
                    "label": 0
                },
                {
                    "sent": "Point here is above and here it also above.",
                    "label": 0
                },
                {
                    "sent": "Namely, it is persistent.",
                    "label": 0
                },
                {
                    "sent": "However, on the right side you see that it starts the same, but here it's above the line, while here it's billable lines so it crossed the lever.",
                    "label": 0
                },
                {
                    "sent": "It's not persistent anymore, so this is the finish.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Persistence.",
                    "label": 0
                },
                {
                    "sent": "So what you do there is a complicated algorithm to calculate the persistence probability.",
                    "label": 0
                },
                {
                    "sent": "What you have to do is to create a trajectory of a single point, say this red point on the interface, and to plot its location or its height versus time.",
                    "label": 1
                },
                {
                    "sent": "So here we have time series typical too many, many, many plots that we've seen in this conference, and in many cases I would recommend to try to play with this persistence.",
                    "label": 0
                },
                {
                    "sent": "So you take a given interval, say.",
                    "label": 0
                },
                {
                    "sent": "An interval of this length and the reference level is the location of the point in the initial of kindervelt.",
                    "label": 0
                },
                {
                    "sent": "So here it does not cross it, while here it does cross it and then you do the algorithm you run over all intervals and measure the persistence.",
                    "label": 0
                },
                {
                    "sent": "Then you over overall points and overall initial times an it's a.",
                    "label": 0
                },
                {
                    "sent": "It's a lot of work.",
                    "label": 1
                },
                {
                    "sent": "This is the algorithm and eventually you end up with in with an exponent.",
                    "label": 0
                },
                {
                    "sent": "Now just to say something that.",
                    "label": 0
                },
                {
                    "sent": "Within these first questions, passage kind of problems.",
                    "label": 0
                },
                {
                    "sent": "There's also what is called survival probability, which is almost the same apart from the fact that the reference level is not in the beginning of the interval, but it's fixed along the process.",
                    "label": 1
                },
                {
                    "sent": "The reference level is constant.",
                    "label": 0
                },
                {
                    "sent": "For example, it is just the average of the line, not below as before, but on the average here and then.",
                    "label": 0
                },
                {
                    "sent": "The interesting thing about it that why?",
                    "label": 0
                },
                {
                    "sent": "The survival exhibits an exponential decay, that persistence, which is measured from a given point, shows a power law decay and one can think about it.",
                    "label": 1
                },
                {
                    "sent": "Why does it happen?",
                    "label": 0
                },
                {
                    "sent": "It's not, it's not.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Immediately intuitive now with respect to persistence.",
                    "label": 0
                },
                {
                    "sent": "What you can get from it.",
                    "label": 0
                },
                {
                    "sent": "There are lots of results of persistence.",
                    "label": 0
                },
                {
                    "sent": "Exponents in the literature in last decade, and you see again, many many exponents and you don't know if it's going to help you or not.",
                    "label": 0
                },
                {
                    "sent": "But let's focus for example on this data .30 seven of four Ising model in one dimension firm magnett for magnetic, where the fluctuation variable, the location of the of the spins at the boundaries.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Interesting relation in linear Langevin equations is that this data is related to the beta to the growth exponent in nonillion equations.",
                    "label": 0
                },
                {
                    "sent": "You have two types of persistence exponent to distinguish between systems where you cross the reference level from below or from above.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also experimental results many many theaters.",
                    "label": 1
                },
                {
                    "sent": "So once we entered this, we understood that perhaps it's going to complicate things rather than to explain to us what happens in the in the growing regime.",
                    "label": 0
                },
                {
                    "sent": "And we so many.",
                    "label": 0
                },
                {
                    "sent": "We looked at many.",
                    "label": 0
                },
                {
                    "sent": "Results, for example, something which is quite similar to our system combustion fronts in paper, which is described by nonlinear equation, but their relation faith out equals 1 minus beta, which is valid in linear system.",
                    "label": 1
                },
                {
                    "sent": "Does hold there.",
                    "label": 0
                },
                {
                    "sent": "The persistence is not really understood.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To the very end.",
                    "label": 0
                },
                {
                    "sent": "Now in our case, the results for our reactive wetting are as follows.",
                    "label": 1
                },
                {
                    "sent": "Recall that I showed you that for this is W as a function of time.",
                    "label": 0
                },
                {
                    "sent": "There is the initial regime, then the growth, then the situation.",
                    "label": 0
                },
                {
                    "sent": "This is typical as I showed you before, so when you put the persistence, you get an persistent exponent, which is 55, which is almost like like random walk.",
                    "label": 0
                },
                {
                    "sent": "Almost like random walk and.",
                    "label": 1
                },
                {
                    "sent": "This is for the initial regime, so the persistence in for the persistence in the growth regime here in this area.",
                    "label": 1
                },
                {
                    "sent": "Here you have to start a new calculation because as I told you, the persistence has to do with the time interval and the giver given reference level, which is the initial location of the point at this time.",
                    "label": 1
                },
                {
                    "sent": "So you cannot rely on the calculations from the very beginning of the process.",
                    "label": 0
                },
                {
                    "sent": "But you have to start a new calculation where the growth.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Start so you do that and then, surprisingly you get a result fatal.",
                    "label": 0
                },
                {
                    "sent": "Point 37, which we already met in the Ising model.",
                    "label": 0
                },
                {
                    "sent": "Interestingly enough, in this growth regime, starting as you see here, the right arrow, we got that the beta, the growth exponent and Theta the persistence.",
                    "label": 0
                },
                {
                    "sent": "Do away the relation which is expected to be in linear systems within the aerobars.",
                    "label": 0
                },
                {
                    "sent": "That Theta equals one man.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's better then for the situation regime.",
                    "label": 0
                },
                {
                    "sent": "You against have to start a new calculation and here again you get results, which is kind of 1/2 which.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is kind of random walk, so our global interpretation.",
                    "label": 1
                },
                {
                    "sent": "If you recall, the local interpretation that before is that in the very earlier stage growth the width does not grow, it just plays around, but effectively does not grow.",
                    "label": 0
                },
                {
                    "sent": "It is constant at this very step.",
                    "label": 0
                },
                {
                    "sent": "The persistence goal is 1/2 because it is just random.",
                    "label": 1
                },
                {
                    "sent": "Then in the nonlinear growth you see here how a few snapshots, how do it grows and grows and grows here?",
                    "label": 0
                },
                {
                    "sent": "The persistence is the point 37, and then when it stops the growth, the which remains constant, which represent the effect of the overall surface tension, which tends to borrow things and to stop the process.",
                    "label": 0
                },
                {
                    "sent": "So you again get the.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Five, which is kind of fun to work.",
                    "label": 0
                },
                {
                    "sent": "So then we after this picture we wanted to see what happens in simulations.",
                    "label": 0
                },
                {
                    "sent": "So we took the QKPC and.",
                    "label": 0
                },
                {
                    "sent": "We got exponents which are not like in the experiment for the Theta for the persistence, and then we took a chain of Ising spins in order to create kind of an artificial interface.",
                    "label": 0
                },
                {
                    "sent": "And here we did get the results predicted in the literature point 37.38, exactly like in.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The growth regime in the experiment.",
                    "label": 0
                },
                {
                    "sent": "So now we can't even know, confused.",
                    "label": 0
                },
                {
                    "sent": "And now if we summarize the Alpha, beta, Theta and the QK present in the Ising trying to figure out what to do or what to understand.",
                    "label": 0
                },
                {
                    "sent": "So this is our current understanding of the things that the beta growth exponent is more or less like PC within the error bars.",
                    "label": 0
                },
                {
                    "sent": "The figure.",
                    "label": 0
                },
                {
                    "sent": "Do not belong to QK busy.",
                    "label": 0
                },
                {
                    "sent": "However, the Ising the persistence measure is more like Ising model.",
                    "label": 0
                },
                {
                    "sent": "So now think about the suggestion that maybe the macroscopic behavior which is reflected by the growth, which is a different kind of exponent, say from the persistence.",
                    "label": 0
                },
                {
                    "sent": "It does not look at the minute details as persistent does.",
                    "label": 0
                },
                {
                    "sent": "Maybe the macroscopic is QKPC and the microscopic is Ising, and we still this is work, which is still.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The progress with respect to the persistence.",
                    "label": 0
                },
                {
                    "sent": "So just to summarize this portion, we had sweet kinetic regimes.",
                    "label": 0
                },
                {
                    "sent": "Random walk then grows obeying the Theta plus beta equals one and then random walk again the macroscopic is.",
                    "label": 1
                },
                {
                    "sent": "The growth exponent is more like UWP, is it why the microscopic exactly Ising?",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We still work on that.",
                    "label": 0
                },
                {
                    "sent": "In summary, I told you what is reactive voting.",
                    "label": 1
                },
                {
                    "sent": "So do this our system where we get side view from top view and we spoke a little about bulk spreading in this reactive wedding general and then we spoke about the complex patterns.",
                    "label": 1
                },
                {
                    "sent": "I'm sorry.",
                    "label": 0
                },
                {
                    "sent": "This spectral temporal reflected by the roughness of growth exponent and with respect to special properties.",
                    "label": 0
                },
                {
                    "sent": "We spoke about the ability to extract the lateral correlation lengths in two ways, and the persistent measures which adds new information and hopefully new insights which will emerge.",
                    "label": 0
                },
                {
                    "sent": "And this is the reference to the another model which we worked out about continuous fear.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Invasion model and this is the list of all our works in this field.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you.",
                    "label": 0
                }
            ]
        }
    }
}