{
    "id": "he6scdftg4vghl3hbkzhf7g3zfqikkfc",
    "title": "Compressed Sensing and Bayesian Experimental Design",
    "info": {
        "author": [
            "Hannes Nickisch, Max Planck Institute for Biological Cybernetics, Max Planck Institute",
            "Matthias W. Seeger, Laboratory for Probabilistic Machine Learning, École Polytechnique Fédérale de Lausanne"
        ],
        "published": "Aug. 29, 2008",
        "recorded": "July 2008",
        "category": [
            "Top->Computer Science->Machine Learning->Bayesian Learning"
        ]
    },
    "url": "http://videolectures.net/icml08_seeger_csbed/",
    "segmentation": [
        [
            "OK, this will be.",
            "It will be joined talk so I'm hunnis and after half of the talk my teeth."
        ],
        [
            "Will take over.",
            "The task we will consider in this talk is we want to measure natural images.",
            "Natural images are denoted by you.",
            "Think of them as a long vector.",
            "Normally they have a matrix structure, but they are along vector having end components and we want to reconstruct them from noisy linear measurements.",
            "Again, why contains the noisy linear measurements and X is the design matrix.",
            "Every row of X corresponds to little to little filter applied to the image.",
            "And then there's some noise term edit.",
            "As we saw their applications in digital photography.",
            "And also in magnetic resonance imaging.",
            "It's an interesting problem too.",
            "From given a fixed measurement architecture X to reconstruct the image U but.",
            "The problem we're going to tackle here is how to choose the measurement design.",
            "If you look at the Lena here and if you transform them in some domain, you see it as before.",
            "You see that there's some structure, some sparsity structure, and the theory of compressed sensing suggests that if you do a reconstruction with the sparseness enforcing penalty, then you should use randomized measurement architecture.",
            "However, if you look closer to the image, then you see that most of the energy is concentrated at some at some point, and if you have a DCT then the concentration of energy is also very striking.",
            "So researchers from computer vision and low level low level vision they have argued that random X maybe it's not."
        ],
        [
            "Not so good and our contributions here.",
            "We perform a study on several natural images and we propose a fully Bayesian method for optimizing the measurement design.",
            "Namely, we want to tackle the problem of learned compressed sensing.",
            "Really, we want to investigate how the design affects the reconstr."
        ],
        [
            "OK, what properties are we going to exploit?",
            "Um?",
            "We know that image is as far as what does it mean.",
            "If you look at the pixels, this is the gradient of the image.",
            "That means you take the neighboring differences and.",
            "At their squares up, you see that many of them are zero.",
            "That means in the histogram, it's centered at zero, and it's really has a sharp peak, and many of them are zero.",
            "But occasionally if there are edges, then they can also.",
            "Then they are allowed to take bigger values.",
            "That means the black histogram has heavier tails, then say sensei Gaussian.",
            "In our model we are concentrating on Laplace potential, which is a reasonable fit to histogram.",
            "How how will the optimization go on?",
            "We will apply greedy strategy.",
            "We will optimize one row of these measurement matrix after the other.",
            "That means we will compute a Bayesian posterior over over the image and then we'll select the row which maximizes the uncertainty.",
            "That means the direction of maximum variance and the idea is to really shrink the entropy of this distribution and the algorithm we're going to use this expectation propagation.",
            "I mean, I skipped many details which are in the paper and the poster, and if you're really interested in the algorithm and how we how we make it fast and so then I invite you to come to the poster session."
        ],
        [
            "To get an intuition on how this this procedure this sequential procedure works, we have got a video.",
            "You have 3, three different panels.",
            "On the upper left you see.",
            "Our expectation propagation algorithm.",
            "At work, but it needs the reconstruction is done by by expectation propagation and the design of the measurement architecture is done by expectation propagation.",
            "In the middle you see random measurements by the way, the measurement filters are visualized in those windows here.",
            "MM this is like the standard way of compressed sensing to do.",
            "You have sparsity enforcing penalty.",
            "And it's like the like the lasso and on the right you see a simple heuristic.",
            "Remember the wavelet decomposition of the image and we just measure wavelet coefficients top down from coarse to fine scale, and when I'm plotting, here is the reconstruction error over the number of measurements.",
            "The images are 64 by 64 pixels only."
        ],
        [
            "And what can you see?",
            "So you see, like the top down localized nature of these wavelet measurement, that means.",
            "They have also scaling behavior.",
            "You see, these are the our optimized measurement filters and they also change their scale at the beginning.",
            "They have really a core scale and then they go to find scale and these random measurements.",
            "They don't.",
            "They don't really change.",
            "OK, looking at the reconstruction errors we have the random random measurement architecture has a quite high reconstruction error.",
            "This simple baseline heuristic we have just measuring the wavelet coefficients.",
            "I mean, reflecting the knowledge we have of images performs better, however, I mean they come close in the end.",
            "And if you really go and design the measurement filters, then you can.",
            "You can gain a bit.",
            "OK, this worked."
        ],
        [
            "And we don't only look at it at one image.",
            "We have a database of 75 images which you can see see there.",
            "Here we have the curves average over those over those 75 images you see.",
            "The little shade corresponds to the standard error with four algorithms and the blue curve is sparse.",
            "Bayesian learning as proposed by by Jean Kerr and last year I CML.",
            "I'm.",
            "Well it it gives a gives a quite a bad reconstruction error and this is this is due to the algorithm.",
            "I mean this we can discuss in the poster session.",
            "We just use the code which was available.",
            "Then this is the lasso reconstruction.",
            "Of course, in the middle using randomized measurements, which gives a given improvement and you want to go further then then you can see that the heuristic of selecting the wavelet coefficients and using a simple least square reconstruction gives you kind of a difference and even further if you go and really optimize the measurements then you can.",
            "Gain a bit more."
        ],
        [
            "OK, let me let me make that very clear.",
            "This is the heuristic that we're going to that we used.",
            "Actually, that was the second best curve in the previous plot.",
            "It's an extremely simple method.",
            "That's what you should note, and we're basically fixing an ordering of the wavelet coefficients, which is really just going from coarse to fine scale.",
            "We didn't even optimize that.",
            "It's basic recursive thing from upper left to lower right, and then we're just measuring these wavelet coefficients, and the reconstruction is basically trivial.",
            "It's a single wavelet transform.",
            "So it's very."
        ],
        [
            "Very efficient, I guess that the fact that this really simple method actually outperforms random measurements after which then you have to do a penalized map reconstruction, really shows me one thing that for natural images it seems that it's actually much more important how you measure these images.",
            "So the choice of X, then how you reconstruct after you've actually fixed that measurement architecture.",
            "And that may be picking them at random is not such a good."
        ],
        [
            "Idea for natural images.",
            "I'm.",
            "You might say OK, so we've actually been dealing in our study, which basically actually did many more.",
            "Different combinations you can see that the poster than what we've just seen.",
            "We looked at 64 by 64 images I mean.",
            "But the phenomenon that we see that actually random measurements are significantly, I guess, worse than if you actually do them up to state of the art.",
            "And then again, you can gain by optimizing them.",
            "This is actually a stable phenomenon.",
            "It doesn't change when you go to bigger images over here, you just see the basically the same experiments on the same images, just taking them to a higher resolution.",
            "Again, we have the lawsuit with random measurements.",
            "Lasu is this convex?",
            "AQP reconstruction, but the measurements are just random.",
            "If you go to measurements that make more sense for natural images, you gain.",
            "Although the reconstruction is really trivial if you then based on these measurements, try to do penalize map reconstruction, you gain a little bit I, but I guess the big difference is really in how you measure if you go to bigger images.",
            "This is even more obvious that it's really the way in which you measure them is more important, I guess.",
            "For natural images then."
        ],
        [
            "Wait, how you reconstruct?",
            "So what's going on?",
            "I mean, shouldn't it be optimal to randomly measure images and then reconstructing widell assume?",
            "Well yeah, you have to go to the theory and really look at it what it means.",
            "So for example here just plotted.",
            "I mean this is of course just.",
            "Not really up to scale.",
            "This is the set of all sparse signals within that set of all sparse signals we have an extremely tiny subset, which basically I would say are which we would consider to be sensible natural images.",
            "Don't know how you would actually measure the relative scale here, But anyway.",
            "So then we've had some really exciting results.",
            "There's a really nice beautiful results in the last years, a lot of activity, which gave us some some new upper bounds for, basically which talk about sparse signal reconstruction.",
            "Basically, the form is like that there should be a constant here if you make more than measure more measurements than something which is basically linear in the number of nonzeros, and then log arhythmic in the number of coefficients at all.",
            "And then you basically draw your measurement architecture from a very simple ensemble at.",
            "Basically you have to make sure that X satisfies certain theoretical properties like restricted isometry.",
            "Then you can show something that's really nice.",
            "OK, so whatever sparse signal you have, I mean, that's what you reconstruct.",
            "You don't know it, but whatever it is, you can actually reconstruct it just by solving a convex program that's really neat with very very high probability, and the probability in that in that case is over the drawing of that measurement architecture.",
            "Basically you just have to make sure that you're not actually picking a really bad X.",
            "But but these results of the upper bound type OK."
        ],
        [
            "So now these upper boundaries are in a sense they are matched by by corresponding lower bound results, which is basically if you read these papers.",
            "That is basically the paragraphs where they say our results are tight, 'cause something.",
            "If you look at what this really means is then you notice that these lower bound results are often kind of a very different flavor than the upper bound ones because they look something like that.",
            "So really your method if you do less than measurements, like what I just had up there, then it cannot really work for all S bar signals.",
            "OK, what that means is there's at least one S pass signal for which it doesn't work.",
            "Now it's you know nothing in that theory suggests that this should actually be a natural image."
        ],
        [
            "Or we have another type?",
            "I mean, this is basically almost equivalent if you look at the theory.",
            "Although this seems a little bit weaker here.",
            "Where you basically say let's think about the true underlying vector to be basically randomly drawn from the big set of all sparse signals.",
            "Again, the natural images is a tiny part in there, and then you're looking at something like the average error randomly averaged over all sparse signals and you say, well, that you cannot really be small in that average error, which again probably doesn't really capture the average error on natural."
        ],
        [
            "Images.",
            "So it's actually true.",
            "I mean, if you draw your X from a basically very simple distribution, like a uniform over the rows, and then you do lasu reconstruction, this is optimal.",
            "You cannot do better, but but the kind of optimality is over minimax type.",
            "And assumptions behind that minimax results are that signals are sparse, but apart from being sparse, everything else is random, completely unstructured."
        ],
        [
            "Random.",
            "Now if we look at images, so let's just look at whether images are, you know uniformly sparse at random.",
            "So here's an image.",
            "This Lane are wavelet transform, and the energy is really up there.",
            "OK, in the core scales.",
            "I mean, of course it's also defined scales, but statistically speaking it's a very strong indication.",
            "If you look at the natural images in energy is going to be."
        ],
        [
            "The cost scales.",
            "Other image again, it's up there in the."
        ],
        [
            "Call scales.",
            "I guess you can do that forever for all over 75 images.",
            "It's always going to be most of the energy is going to be in the core scales.",
            "So this just gives you an indication that there are some more structure and images that just you know that the energy is just randomly distributed, being sparse."
        ],
        [
            "I guess you can even realize that even better so I don't know if you recognize Lena.",
            "This is sort of the information is in there.",
            "So what I did here is I just took Lena.",
            "I transformed it to the wavelet domain.",
            "Then I randomly permute it.",
            "All the indexes in the wavelet domain are transformed it back.",
            "That's what you get.",
            "And this is basically."
        ],
        [
            "In a sense, this is also the guy with the hair."
        ],
        [
            "And this is the cafe.",
            "I mean, I would argue this not really natural images.",
            "What we see here we see something here where basically the energy is distributed at random.",
            "And in a sense, if you want to be optimal on that these things, of course.",
            "I mean this is completely true that the lasuen random measurements are in a sense really meet the lower bounds here.",
            "But they really do that on signals like that.",
            "And there are natural images are just."
        ],
        [
            "It's not like that.",
            "So I guess that was the whole argumentation actually attributes to is a bit of an ironic fact.",
            "Innocence.",
            "There's a maybe one of the most notorious minimax theorems there is is the Nyquist limit, which basically says if you sing this band limited, but otherwise it's completely unstructured random and you cannot really do better than than this.",
            "This is some error or something or you need to space your measurements closer than that.",
            "Otherwise really it's not going to work, which of course is completely true if you don't have any structure."
        ],
        [
            "Signals.",
            "Well, but then of course we have structure in our signals which some of that structure can be extremely robust and stable.",
            "I mean, it's not going to be that you're going to be, you have to be just very very unlucky not to meet that structure.",
            "And if you exploit that structure then you can be more efficient so you can be better than X1.",
            "So one particular type of structure you might want to have is bandlimited is always good, but you could also be sparse in some domain.",
            "Now, Nyquist version #2 would then be to say, oh, let me be bandlimited, sparse, but otherwise, let us be completely random, so only sparse, no other structure.",
            "And then again, you really cannot do better than X2.",
            "Now this is smaller than X1 and this is a really nice and important result."
        ],
        [
            "But I would argue that I guess we're not quite there yet, because natural images and probably also all sorts of other real world signals.",
            "I mean, they're probably bandlimited.",
            "I mean at least you're going to ignore the information that is beyond the band.",
            "They are also approximately sparse.",
            "That's why many.",
            "You know a coding algorithms work.",
            "But I'm beyond that.",
            "They really have much more exploitable structure, and that's what you can probably also use to then even do better than X2, for example, and natural images.",
            "OK, and if you want to show how this works and you just cannot prove it at the moment, then you can also do a sound empirical evaluation and then you know if you don't favor your method in a way that I probably you can convince people that this works.",
            "I guess that's what we did in."
        ],
        [
            "To study.",
            "Let me conclude.",
            "If we measure real world signals like natural images, we are, we should really be sure that you know if we draw our design at random using some distribution like uniform that we actually avoid these decor and taxes and then we do a convex simple convex reconstruction.",
            "I mean we took the lawsuit, but you can also take basis pursuit or that unselect or maybe a couple of other methods.",
            "Then it's really true.",
            "They are optimal in the sense that they meet minimax lower bounds.",
            "Which have been proven for sparse signals or other things completely random."
        ],
        [
            "Um?",
            "But then if you really working with natural images, then you.",
            "I mean you can go to the net field of natural image statistics and they basically figure out yet they are sparse approximately.",
            "But actually there's much else beyond sparsity which is not random and which is actually pretty robust and that allows you to.",
            "Do something which is basically impossible, namely, to robustly choose a filter set are much better than the X2."
        ],
        [
            "For example.",
            "So here's one very important thing.",
            "I don't know whether that really came across so far.",
            "Our method.",
            "It's not that I'm just giving it all these prior information that people know about images.",
            "Our method starts from exactly the same prior estimation information.",
            "Then the lasso reconstruction OK.",
            "It's exactly the same prior then what these guys take the lock prior for reconstruction.",
            "But the important difference is that it just takes that prior together with the likelihood, and it does more with it.",
            "It's it's not only maximizing the posterior just a little bit more.",
            "It's using the posterior to actually choose a good measurement architecture."
        ],
        [
            "And I would say I mean I would conclude from this study that it can really help a lot if you optimize the measurement architecture for your domain of interest.",
            "I guess whether I can really only say that for natural images that's my domain of interest, but I would conjecture that that holds true for other domains.",
            "You can do that with very little firm prior knowledge.",
            "But but that really needs a little bit more than uniform random sampling.",
            "You need to do something which is experimental design.",
            "I mean, you just need to spend a little bit more work thinking about how you optimize that thing.",
            "And."
        ],
        [
            "My last line.",
            "Is that OK?",
            "We did this on 64 by 64 images.",
            "You can scale this up.",
            "We have some recent algorithms that work on say images to fit 256 by 256 using some new I mean again remember that our design really needs inference to be driven.",
            "The inference is computationally hard, but you can actually scale it up to that size.",
            "So thanks for your attention.",
            "Metrics.",
            "Randomly.",
            "Satisfied what you do at the end is it X, which is better for the images or this happens to verify the condition from the bigger bigger spots?",
            "Do you mean that?",
            "OK, so you mean whether our axis actually means these these restricted isometry conditions are, we should check it.",
            "I would conjecture, but I didn't check it.",
            "I didn't check it, but we I should note one thing for people who are interested is that I mean, think about not about our experts.",
            "Think about these this rifle touristic.",
            "It's actually measuring where fit coefficients and the wavelet transform is also penalized.",
            "So basically these are innocence.",
            "Completely coherent measurements OK?",
            "So.",
            "OK, so I guess one thing to take away from this is that this incoherent or this decoder and or restricted isometry.",
            "It's really something that gives you a very, very strong result, right?",
            "No matter where the energy is, you're going to find it with probability almost one.",
            "This is way, way, way stronger than what you need from natural images.",
            "That's basically one of the things to take away from here.",
            "If you don't want to be as strong, you can also design your X.",
            "And actually, if you ask me, I would probably say this might actually fail if you give it a randomly.",
            "If you give it images like what I had earlier on.",
            "So I would hope that does not happen, but we don't have other people optimize that thing to be minimally different.",
            "It's just that I'm saying that this is not the only design principle there is.",
            "Values.",
            "Random for that assumption or UX is better than random for natural images.",
            "Eggs is also good for other types of.",
            "Actually what we did is we.",
            "Basically it's in the paper.",
            "Also the poster, so this axis.",
            "So you could say this is a specific to the one image it was designed on.",
            "We of course we try to measure other images with it and you get almost the same improvement.",
            "It's a little bit less so it learns something about the image.",
            "I mean we should maybe I don't know.",
            "We don't have time, but if you look very closely at the video it's very nice.",
            "So you see that it's doing something which basically just goes down at the right scale.",
            "But you also see some flickering at the edges.",
            "So that's basically the kind of stuff that you get that really goes down for the one image.",
            "So where where where this image has edges?",
            "It puts more effort.",
            "OK, this would be something that doesn't transfer, but the global scale of that filter is actually transferable, so you can measure other images for that thing, but I'm not sure if it's actually minimax optimal choice here.",
            "So I mean, you might be able to get something that does both, but we didn't put a lot of effort into that should check it.",
            "Yeah.",
            "OK, so we had that citation up so if you.",
            "I mean that gave us basically the idea to try it out right.",
            "I mean actually so our interest is not really in the theory, but in applications of that actually to MRI anyway.",
            "So yeah, gave that very nice arguments.",
            "Why random measurements are not very good?",
            "We had the citation update beginning.",
            "We basically you can think about that being a study that really shows it, but also think about the second part.",
            "We actually provide a method that is sufficient enough even now.",
            "Our new version on big images, the method that Yair proposed in that node is not.",
            "Trying to scale up, I think it basically looked at 8 by 8 patches.",
            "So in a sense it's true.",
            "I mean, this is basically I guess you know, the confirmation in practice that yes, it's really true.",
            "But I mean really, if you want to understand why you know random measurements are not good, you should really look at his arguments.",
            "They're really nice.",
            "Components.",
            "I mean, I think actually I mean I, I read that paper, I would say our method is basically somehow solving that problem, because if you apply our method to a signal class that's not images.",
            "OK, I didn't do that, so I don't want to claim anything, but it has all the ingredients in there to basically be successful learning a good filter for another image class as well.",
            "But let me not.",
            "You know, we did this for images and it seemed to work so.",
            "But I mean it has the ingredients in there.",
            "It looks at the posterior.",
            "It has some prior at this prior.",
            "Doesn't have to tell you a good ordering for wavelet coefficients.",
            "It figures that out as it goes.",
            "It's basically I mean, I guess that you can from little prior knowledge.",
            "You can still learn about the single class.",
            "But I mean, I am not sure whether this is minimax optimal."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, this will be.",
                    "label": 0
                },
                {
                    "sent": "It will be joined talk so I'm hunnis and after half of the talk my teeth.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Will take over.",
                    "label": 0
                },
                {
                    "sent": "The task we will consider in this talk is we want to measure natural images.",
                    "label": 0
                },
                {
                    "sent": "Natural images are denoted by you.",
                    "label": 1
                },
                {
                    "sent": "Think of them as a long vector.",
                    "label": 0
                },
                {
                    "sent": "Normally they have a matrix structure, but they are along vector having end components and we want to reconstruct them from noisy linear measurements.",
                    "label": 0
                },
                {
                    "sent": "Again, why contains the noisy linear measurements and X is the design matrix.",
                    "label": 1
                },
                {
                    "sent": "Every row of X corresponds to little to little filter applied to the image.",
                    "label": 0
                },
                {
                    "sent": "And then there's some noise term edit.",
                    "label": 0
                },
                {
                    "sent": "As we saw their applications in digital photography.",
                    "label": 0
                },
                {
                    "sent": "And also in magnetic resonance imaging.",
                    "label": 1
                },
                {
                    "sent": "It's an interesting problem too.",
                    "label": 1
                },
                {
                    "sent": "From given a fixed measurement architecture X to reconstruct the image U but.",
                    "label": 0
                },
                {
                    "sent": "The problem we're going to tackle here is how to choose the measurement design.",
                    "label": 0
                },
                {
                    "sent": "If you look at the Lena here and if you transform them in some domain, you see it as before.",
                    "label": 0
                },
                {
                    "sent": "You see that there's some structure, some sparsity structure, and the theory of compressed sensing suggests that if you do a reconstruction with the sparseness enforcing penalty, then you should use randomized measurement architecture.",
                    "label": 0
                },
                {
                    "sent": "However, if you look closer to the image, then you see that most of the energy is concentrated at some at some point, and if you have a DCT then the concentration of energy is also very striking.",
                    "label": 0
                },
                {
                    "sent": "So researchers from computer vision and low level low level vision they have argued that random X maybe it's not.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Not so good and our contributions here.",
                    "label": 0
                },
                {
                    "sent": "We perform a study on several natural images and we propose a fully Bayesian method for optimizing the measurement design.",
                    "label": 1
                },
                {
                    "sent": "Namely, we want to tackle the problem of learned compressed sensing.",
                    "label": 0
                },
                {
                    "sent": "Really, we want to investigate how the design affects the reconstr.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, what properties are we going to exploit?",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "We know that image is as far as what does it mean.",
                    "label": 0
                },
                {
                    "sent": "If you look at the pixels, this is the gradient of the image.",
                    "label": 0
                },
                {
                    "sent": "That means you take the neighboring differences and.",
                    "label": 0
                },
                {
                    "sent": "At their squares up, you see that many of them are zero.",
                    "label": 0
                },
                {
                    "sent": "That means in the histogram, it's centered at zero, and it's really has a sharp peak, and many of them are zero.",
                    "label": 0
                },
                {
                    "sent": "But occasionally if there are edges, then they can also.",
                    "label": 0
                },
                {
                    "sent": "Then they are allowed to take bigger values.",
                    "label": 0
                },
                {
                    "sent": "That means the black histogram has heavier tails, then say sensei Gaussian.",
                    "label": 0
                },
                {
                    "sent": "In our model we are concentrating on Laplace potential, which is a reasonable fit to histogram.",
                    "label": 0
                },
                {
                    "sent": "How how will the optimization go on?",
                    "label": 0
                },
                {
                    "sent": "We will apply greedy strategy.",
                    "label": 0
                },
                {
                    "sent": "We will optimize one row of these measurement matrix after the other.",
                    "label": 0
                },
                {
                    "sent": "That means we will compute a Bayesian posterior over over the image and then we'll select the row which maximizes the uncertainty.",
                    "label": 0
                },
                {
                    "sent": "That means the direction of maximum variance and the idea is to really shrink the entropy of this distribution and the algorithm we're going to use this expectation propagation.",
                    "label": 0
                },
                {
                    "sent": "I mean, I skipped many details which are in the paper and the poster, and if you're really interested in the algorithm and how we how we make it fast and so then I invite you to come to the poster session.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To get an intuition on how this this procedure this sequential procedure works, we have got a video.",
                    "label": 0
                },
                {
                    "sent": "You have 3, three different panels.",
                    "label": 0
                },
                {
                    "sent": "On the upper left you see.",
                    "label": 0
                },
                {
                    "sent": "Our expectation propagation algorithm.",
                    "label": 0
                },
                {
                    "sent": "At work, but it needs the reconstruction is done by by expectation propagation and the design of the measurement architecture is done by expectation propagation.",
                    "label": 0
                },
                {
                    "sent": "In the middle you see random measurements by the way, the measurement filters are visualized in those windows here.",
                    "label": 0
                },
                {
                    "sent": "MM this is like the standard way of compressed sensing to do.",
                    "label": 0
                },
                {
                    "sent": "You have sparsity enforcing penalty.",
                    "label": 0
                },
                {
                    "sent": "And it's like the like the lasso and on the right you see a simple heuristic.",
                    "label": 0
                },
                {
                    "sent": "Remember the wavelet decomposition of the image and we just measure wavelet coefficients top down from coarse to fine scale, and when I'm plotting, here is the reconstruction error over the number of measurements.",
                    "label": 0
                },
                {
                    "sent": "The images are 64 by 64 pixels only.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what can you see?",
                    "label": 0
                },
                {
                    "sent": "So you see, like the top down localized nature of these wavelet measurement, that means.",
                    "label": 0
                },
                {
                    "sent": "They have also scaling behavior.",
                    "label": 0
                },
                {
                    "sent": "You see, these are the our optimized measurement filters and they also change their scale at the beginning.",
                    "label": 0
                },
                {
                    "sent": "They have really a core scale and then they go to find scale and these random measurements.",
                    "label": 0
                },
                {
                    "sent": "They don't.",
                    "label": 0
                },
                {
                    "sent": "They don't really change.",
                    "label": 0
                },
                {
                    "sent": "OK, looking at the reconstruction errors we have the random random measurement architecture has a quite high reconstruction error.",
                    "label": 0
                },
                {
                    "sent": "This simple baseline heuristic we have just measuring the wavelet coefficients.",
                    "label": 0
                },
                {
                    "sent": "I mean, reflecting the knowledge we have of images performs better, however, I mean they come close in the end.",
                    "label": 0
                },
                {
                    "sent": "And if you really go and design the measurement filters, then you can.",
                    "label": 0
                },
                {
                    "sent": "You can gain a bit.",
                    "label": 0
                },
                {
                    "sent": "OK, this worked.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we don't only look at it at one image.",
                    "label": 0
                },
                {
                    "sent": "We have a database of 75 images which you can see see there.",
                    "label": 0
                },
                {
                    "sent": "Here we have the curves average over those over those 75 images you see.",
                    "label": 0
                },
                {
                    "sent": "The little shade corresponds to the standard error with four algorithms and the blue curve is sparse.",
                    "label": 0
                },
                {
                    "sent": "Bayesian learning as proposed by by Jean Kerr and last year I CML.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "Well it it gives a gives a quite a bad reconstruction error and this is this is due to the algorithm.",
                    "label": 0
                },
                {
                    "sent": "I mean this we can discuss in the poster session.",
                    "label": 0
                },
                {
                    "sent": "We just use the code which was available.",
                    "label": 0
                },
                {
                    "sent": "Then this is the lasso reconstruction.",
                    "label": 0
                },
                {
                    "sent": "Of course, in the middle using randomized measurements, which gives a given improvement and you want to go further then then you can see that the heuristic of selecting the wavelet coefficients and using a simple least square reconstruction gives you kind of a difference and even further if you go and really optimize the measurements then you can.",
                    "label": 0
                },
                {
                    "sent": "Gain a bit more.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, let me let me make that very clear.",
                    "label": 0
                },
                {
                    "sent": "This is the heuristic that we're going to that we used.",
                    "label": 0
                },
                {
                    "sent": "Actually, that was the second best curve in the previous plot.",
                    "label": 0
                },
                {
                    "sent": "It's an extremely simple method.",
                    "label": 0
                },
                {
                    "sent": "That's what you should note, and we're basically fixing an ordering of the wavelet coefficients, which is really just going from coarse to fine scale.",
                    "label": 0
                },
                {
                    "sent": "We didn't even optimize that.",
                    "label": 0
                },
                {
                    "sent": "It's basic recursive thing from upper left to lower right, and then we're just measuring these wavelet coefficients, and the reconstruction is basically trivial.",
                    "label": 0
                },
                {
                    "sent": "It's a single wavelet transform.",
                    "label": 0
                },
                {
                    "sent": "So it's very.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Very efficient, I guess that the fact that this really simple method actually outperforms random measurements after which then you have to do a penalized map reconstruction, really shows me one thing that for natural images it seems that it's actually much more important how you measure these images.",
                    "label": 1
                },
                {
                    "sent": "So the choice of X, then how you reconstruct after you've actually fixed that measurement architecture.",
                    "label": 0
                },
                {
                    "sent": "And that may be picking them at random is not such a good.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Idea for natural images.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "You might say OK, so we've actually been dealing in our study, which basically actually did many more.",
                    "label": 0
                },
                {
                    "sent": "Different combinations you can see that the poster than what we've just seen.",
                    "label": 0
                },
                {
                    "sent": "We looked at 64 by 64 images I mean.",
                    "label": 0
                },
                {
                    "sent": "But the phenomenon that we see that actually random measurements are significantly, I guess, worse than if you actually do them up to state of the art.",
                    "label": 0
                },
                {
                    "sent": "And then again, you can gain by optimizing them.",
                    "label": 0
                },
                {
                    "sent": "This is actually a stable phenomenon.",
                    "label": 0
                },
                {
                    "sent": "It doesn't change when you go to bigger images over here, you just see the basically the same experiments on the same images, just taking them to a higher resolution.",
                    "label": 0
                },
                {
                    "sent": "Again, we have the lawsuit with random measurements.",
                    "label": 0
                },
                {
                    "sent": "Lasu is this convex?",
                    "label": 0
                },
                {
                    "sent": "AQP reconstruction, but the measurements are just random.",
                    "label": 0
                },
                {
                    "sent": "If you go to measurements that make more sense for natural images, you gain.",
                    "label": 0
                },
                {
                    "sent": "Although the reconstruction is really trivial if you then based on these measurements, try to do penalize map reconstruction, you gain a little bit I, but I guess the big difference is really in how you measure if you go to bigger images.",
                    "label": 0
                },
                {
                    "sent": "This is even more obvious that it's really the way in which you measure them is more important, I guess.",
                    "label": 0
                },
                {
                    "sent": "For natural images then.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Wait, how you reconstruct?",
                    "label": 0
                },
                {
                    "sent": "So what's going on?",
                    "label": 0
                },
                {
                    "sent": "I mean, shouldn't it be optimal to randomly measure images and then reconstructing widell assume?",
                    "label": 0
                },
                {
                    "sent": "Well yeah, you have to go to the theory and really look at it what it means.",
                    "label": 0
                },
                {
                    "sent": "So for example here just plotted.",
                    "label": 0
                },
                {
                    "sent": "I mean this is of course just.",
                    "label": 0
                },
                {
                    "sent": "Not really up to scale.",
                    "label": 0
                },
                {
                    "sent": "This is the set of all sparse signals within that set of all sparse signals we have an extremely tiny subset, which basically I would say are which we would consider to be sensible natural images.",
                    "label": 0
                },
                {
                    "sent": "Don't know how you would actually measure the relative scale here, But anyway.",
                    "label": 0
                },
                {
                    "sent": "So then we've had some really exciting results.",
                    "label": 0
                },
                {
                    "sent": "There's a really nice beautiful results in the last years, a lot of activity, which gave us some some new upper bounds for, basically which talk about sparse signal reconstruction.",
                    "label": 0
                },
                {
                    "sent": "Basically, the form is like that there should be a constant here if you make more than measure more measurements than something which is basically linear in the number of nonzeros, and then log arhythmic in the number of coefficients at all.",
                    "label": 0
                },
                {
                    "sent": "And then you basically draw your measurement architecture from a very simple ensemble at.",
                    "label": 0
                },
                {
                    "sent": "Basically you have to make sure that X satisfies certain theoretical properties like restricted isometry.",
                    "label": 0
                },
                {
                    "sent": "Then you can show something that's really nice.",
                    "label": 0
                },
                {
                    "sent": "OK, so whatever sparse signal you have, I mean, that's what you reconstruct.",
                    "label": 0
                },
                {
                    "sent": "You don't know it, but whatever it is, you can actually reconstruct it just by solving a convex program that's really neat with very very high probability, and the probability in that in that case is over the drawing of that measurement architecture.",
                    "label": 0
                },
                {
                    "sent": "Basically you just have to make sure that you're not actually picking a really bad X.",
                    "label": 0
                },
                {
                    "sent": "But but these results of the upper bound type OK.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now these upper boundaries are in a sense they are matched by by corresponding lower bound results, which is basically if you read these papers.",
                    "label": 0
                },
                {
                    "sent": "That is basically the paragraphs where they say our results are tight, 'cause something.",
                    "label": 0
                },
                {
                    "sent": "If you look at what this really means is then you notice that these lower bound results are often kind of a very different flavor than the upper bound ones because they look something like that.",
                    "label": 0
                },
                {
                    "sent": "So really your method if you do less than measurements, like what I just had up there, then it cannot really work for all S bar signals.",
                    "label": 0
                },
                {
                    "sent": "OK, what that means is there's at least one S pass signal for which it doesn't work.",
                    "label": 0
                },
                {
                    "sent": "Now it's you know nothing in that theory suggests that this should actually be a natural image.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or we have another type?",
                    "label": 0
                },
                {
                    "sent": "I mean, this is basically almost equivalent if you look at the theory.",
                    "label": 0
                },
                {
                    "sent": "Although this seems a little bit weaker here.",
                    "label": 0
                },
                {
                    "sent": "Where you basically say let's think about the true underlying vector to be basically randomly drawn from the big set of all sparse signals.",
                    "label": 0
                },
                {
                    "sent": "Again, the natural images is a tiny part in there, and then you're looking at something like the average error randomly averaged over all sparse signals and you say, well, that you cannot really be small in that average error, which again probably doesn't really capture the average error on natural.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Images.",
                    "label": 0
                },
                {
                    "sent": "So it's actually true.",
                    "label": 0
                },
                {
                    "sent": "I mean, if you draw your X from a basically very simple distribution, like a uniform over the rows, and then you do lasu reconstruction, this is optimal.",
                    "label": 0
                },
                {
                    "sent": "You cannot do better, but but the kind of optimality is over minimax type.",
                    "label": 0
                },
                {
                    "sent": "And assumptions behind that minimax results are that signals are sparse, but apart from being sparse, everything else is random, completely unstructured.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Random.",
                    "label": 0
                },
                {
                    "sent": "Now if we look at images, so let's just look at whether images are, you know uniformly sparse at random.",
                    "label": 0
                },
                {
                    "sent": "So here's an image.",
                    "label": 0
                },
                {
                    "sent": "This Lane are wavelet transform, and the energy is really up there.",
                    "label": 1
                },
                {
                    "sent": "OK, in the core scales.",
                    "label": 0
                },
                {
                    "sent": "I mean, of course it's also defined scales, but statistically speaking it's a very strong indication.",
                    "label": 0
                },
                {
                    "sent": "If you look at the natural images in energy is going to be.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The cost scales.",
                    "label": 0
                },
                {
                    "sent": "Other image again, it's up there in the.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Call scales.",
                    "label": 0
                },
                {
                    "sent": "I guess you can do that forever for all over 75 images.",
                    "label": 0
                },
                {
                    "sent": "It's always going to be most of the energy is going to be in the core scales.",
                    "label": 1
                },
                {
                    "sent": "So this just gives you an indication that there are some more structure and images that just you know that the energy is just randomly distributed, being sparse.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I guess you can even realize that even better so I don't know if you recognize Lena.",
                    "label": 0
                },
                {
                    "sent": "This is sort of the information is in there.",
                    "label": 0
                },
                {
                    "sent": "So what I did here is I just took Lena.",
                    "label": 0
                },
                {
                    "sent": "I transformed it to the wavelet domain.",
                    "label": 0
                },
                {
                    "sent": "Then I randomly permute it.",
                    "label": 0
                },
                {
                    "sent": "All the indexes in the wavelet domain are transformed it back.",
                    "label": 0
                },
                {
                    "sent": "That's what you get.",
                    "label": 0
                },
                {
                    "sent": "And this is basically.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In a sense, this is also the guy with the hair.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is the cafe.",
                    "label": 0
                },
                {
                    "sent": "I mean, I would argue this not really natural images.",
                    "label": 0
                },
                {
                    "sent": "What we see here we see something here where basically the energy is distributed at random.",
                    "label": 0
                },
                {
                    "sent": "And in a sense, if you want to be optimal on that these things, of course.",
                    "label": 0
                },
                {
                    "sent": "I mean this is completely true that the lasuen random measurements are in a sense really meet the lower bounds here.",
                    "label": 0
                },
                {
                    "sent": "But they really do that on signals like that.",
                    "label": 0
                },
                {
                    "sent": "And there are natural images are just.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's not like that.",
                    "label": 0
                },
                {
                    "sent": "So I guess that was the whole argumentation actually attributes to is a bit of an ironic fact.",
                    "label": 0
                },
                {
                    "sent": "Innocence.",
                    "label": 0
                },
                {
                    "sent": "There's a maybe one of the most notorious minimax theorems there is is the Nyquist limit, which basically says if you sing this band limited, but otherwise it's completely unstructured random and you cannot really do better than than this.",
                    "label": 1
                },
                {
                    "sent": "This is some error or something or you need to space your measurements closer than that.",
                    "label": 0
                },
                {
                    "sent": "Otherwise really it's not going to work, which of course is completely true if you don't have any structure.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Signals.",
                    "label": 0
                },
                {
                    "sent": "Well, but then of course we have structure in our signals which some of that structure can be extremely robust and stable.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's not going to be that you're going to be, you have to be just very very unlucky not to meet that structure.",
                    "label": 0
                },
                {
                    "sent": "And if you exploit that structure then you can be more efficient so you can be better than X1.",
                    "label": 1
                },
                {
                    "sent": "So one particular type of structure you might want to have is bandlimited is always good, but you could also be sparse in some domain.",
                    "label": 0
                },
                {
                    "sent": "Now, Nyquist version #2 would then be to say, oh, let me be bandlimited, sparse, but otherwise, let us be completely random, so only sparse, no other structure.",
                    "label": 0
                },
                {
                    "sent": "And then again, you really cannot do better than X2.",
                    "label": 1
                },
                {
                    "sent": "Now this is smaller than X1 and this is a really nice and important result.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But I would argue that I guess we're not quite there yet, because natural images and probably also all sorts of other real world signals.",
                    "label": 0
                },
                {
                    "sent": "I mean, they're probably bandlimited.",
                    "label": 0
                },
                {
                    "sent": "I mean at least you're going to ignore the information that is beyond the band.",
                    "label": 0
                },
                {
                    "sent": "They are also approximately sparse.",
                    "label": 0
                },
                {
                    "sent": "That's why many.",
                    "label": 0
                },
                {
                    "sent": "You know a coding algorithms work.",
                    "label": 0
                },
                {
                    "sent": "But I'm beyond that.",
                    "label": 0
                },
                {
                    "sent": "They really have much more exploitable structure, and that's what you can probably also use to then even do better than X2, for example, and natural images.",
                    "label": 1
                },
                {
                    "sent": "OK, and if you want to show how this works and you just cannot prove it at the moment, then you can also do a sound empirical evaluation and then you know if you don't favor your method in a way that I probably you can convince people that this works.",
                    "label": 0
                },
                {
                    "sent": "I guess that's what we did in.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To study.",
                    "label": 0
                },
                {
                    "sent": "Let me conclude.",
                    "label": 0
                },
                {
                    "sent": "If we measure real world signals like natural images, we are, we should really be sure that you know if we draw our design at random using some distribution like uniform that we actually avoid these decor and taxes and then we do a convex simple convex reconstruction.",
                    "label": 0
                },
                {
                    "sent": "I mean we took the lawsuit, but you can also take basis pursuit or that unselect or maybe a couple of other methods.",
                    "label": 1
                },
                {
                    "sent": "Then it's really true.",
                    "label": 0
                },
                {
                    "sent": "They are optimal in the sense that they meet minimax lower bounds.",
                    "label": 1
                },
                {
                    "sent": "Which have been proven for sparse signals or other things completely random.",
                    "label": 1
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "But then if you really working with natural images, then you.",
                    "label": 0
                },
                {
                    "sent": "I mean you can go to the net field of natural image statistics and they basically figure out yet they are sparse approximately.",
                    "label": 1
                },
                {
                    "sent": "But actually there's much else beyond sparsity which is not random and which is actually pretty robust and that allows you to.",
                    "label": 1
                },
                {
                    "sent": "Do something which is basically impossible, namely, to robustly choose a filter set are much better than the X2.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For example.",
                    "label": 0
                },
                {
                    "sent": "So here's one very important thing.",
                    "label": 0
                },
                {
                    "sent": "I don't know whether that really came across so far.",
                    "label": 0
                },
                {
                    "sent": "Our method.",
                    "label": 0
                },
                {
                    "sent": "It's not that I'm just giving it all these prior information that people know about images.",
                    "label": 0
                },
                {
                    "sent": "Our method starts from exactly the same prior estimation information.",
                    "label": 1
                },
                {
                    "sent": "Then the lasso reconstruction OK.",
                    "label": 0
                },
                {
                    "sent": "It's exactly the same prior then what these guys take the lock prior for reconstruction.",
                    "label": 0
                },
                {
                    "sent": "But the important difference is that it just takes that prior together with the likelihood, and it does more with it.",
                    "label": 1
                },
                {
                    "sent": "It's it's not only maximizing the posterior just a little bit more.",
                    "label": 0
                },
                {
                    "sent": "It's using the posterior to actually choose a good measurement architecture.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I would say I mean I would conclude from this study that it can really help a lot if you optimize the measurement architecture for your domain of interest.",
                    "label": 1
                },
                {
                    "sent": "I guess whether I can really only say that for natural images that's my domain of interest, but I would conjecture that that holds true for other domains.",
                    "label": 0
                },
                {
                    "sent": "You can do that with very little firm prior knowledge.",
                    "label": 1
                },
                {
                    "sent": "But but that really needs a little bit more than uniform random sampling.",
                    "label": 0
                },
                {
                    "sent": "You need to do something which is experimental design.",
                    "label": 0
                },
                {
                    "sent": "I mean, you just need to spend a little bit more work thinking about how you optimize that thing.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "My last line.",
                    "label": 0
                },
                {
                    "sent": "Is that OK?",
                    "label": 0
                },
                {
                    "sent": "We did this on 64 by 64 images.",
                    "label": 0
                },
                {
                    "sent": "You can scale this up.",
                    "label": 0
                },
                {
                    "sent": "We have some recent algorithms that work on say images to fit 256 by 256 using some new I mean again remember that our design really needs inference to be driven.",
                    "label": 0
                },
                {
                    "sent": "The inference is computationally hard, but you can actually scale it up to that size.",
                    "label": 0
                },
                {
                    "sent": "So thanks for your attention.",
                    "label": 1
                },
                {
                    "sent": "Metrics.",
                    "label": 0
                },
                {
                    "sent": "Randomly.",
                    "label": 0
                },
                {
                    "sent": "Satisfied what you do at the end is it X, which is better for the images or this happens to verify the condition from the bigger bigger spots?",
                    "label": 0
                },
                {
                    "sent": "Do you mean that?",
                    "label": 0
                },
                {
                    "sent": "OK, so you mean whether our axis actually means these these restricted isometry conditions are, we should check it.",
                    "label": 0
                },
                {
                    "sent": "I would conjecture, but I didn't check it.",
                    "label": 0
                },
                {
                    "sent": "I didn't check it, but we I should note one thing for people who are interested is that I mean, think about not about our experts.",
                    "label": 0
                },
                {
                    "sent": "Think about these this rifle touristic.",
                    "label": 0
                },
                {
                    "sent": "It's actually measuring where fit coefficients and the wavelet transform is also penalized.",
                    "label": 0
                },
                {
                    "sent": "So basically these are innocence.",
                    "label": 0
                },
                {
                    "sent": "Completely coherent measurements OK?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "OK, so I guess one thing to take away from this is that this incoherent or this decoder and or restricted isometry.",
                    "label": 0
                },
                {
                    "sent": "It's really something that gives you a very, very strong result, right?",
                    "label": 0
                },
                {
                    "sent": "No matter where the energy is, you're going to find it with probability almost one.",
                    "label": 0
                },
                {
                    "sent": "This is way, way, way stronger than what you need from natural images.",
                    "label": 0
                },
                {
                    "sent": "That's basically one of the things to take away from here.",
                    "label": 0
                },
                {
                    "sent": "If you don't want to be as strong, you can also design your X.",
                    "label": 0
                },
                {
                    "sent": "And actually, if you ask me, I would probably say this might actually fail if you give it a randomly.",
                    "label": 0
                },
                {
                    "sent": "If you give it images like what I had earlier on.",
                    "label": 0
                },
                {
                    "sent": "So I would hope that does not happen, but we don't have other people optimize that thing to be minimally different.",
                    "label": 0
                },
                {
                    "sent": "It's just that I'm saying that this is not the only design principle there is.",
                    "label": 0
                },
                {
                    "sent": "Values.",
                    "label": 0
                },
                {
                    "sent": "Random for that assumption or UX is better than random for natural images.",
                    "label": 0
                },
                {
                    "sent": "Eggs is also good for other types of.",
                    "label": 0
                },
                {
                    "sent": "Actually what we did is we.",
                    "label": 0
                },
                {
                    "sent": "Basically it's in the paper.",
                    "label": 0
                },
                {
                    "sent": "Also the poster, so this axis.",
                    "label": 0
                },
                {
                    "sent": "So you could say this is a specific to the one image it was designed on.",
                    "label": 1
                },
                {
                    "sent": "We of course we try to measure other images with it and you get almost the same improvement.",
                    "label": 0
                },
                {
                    "sent": "It's a little bit less so it learns something about the image.",
                    "label": 0
                },
                {
                    "sent": "I mean we should maybe I don't know.",
                    "label": 0
                },
                {
                    "sent": "We don't have time, but if you look very closely at the video it's very nice.",
                    "label": 0
                },
                {
                    "sent": "So you see that it's doing something which basically just goes down at the right scale.",
                    "label": 0
                },
                {
                    "sent": "But you also see some flickering at the edges.",
                    "label": 0
                },
                {
                    "sent": "So that's basically the kind of stuff that you get that really goes down for the one image.",
                    "label": 0
                },
                {
                    "sent": "So where where where this image has edges?",
                    "label": 0
                },
                {
                    "sent": "It puts more effort.",
                    "label": 0
                },
                {
                    "sent": "OK, this would be something that doesn't transfer, but the global scale of that filter is actually transferable, so you can measure other images for that thing, but I'm not sure if it's actually minimax optimal choice here.",
                    "label": 0
                },
                {
                    "sent": "So I mean, you might be able to get something that does both, but we didn't put a lot of effort into that should check it.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "OK, so we had that citation up so if you.",
                    "label": 0
                },
                {
                    "sent": "I mean that gave us basically the idea to try it out right.",
                    "label": 0
                },
                {
                    "sent": "I mean actually so our interest is not really in the theory, but in applications of that actually to MRI anyway.",
                    "label": 0
                },
                {
                    "sent": "So yeah, gave that very nice arguments.",
                    "label": 0
                },
                {
                    "sent": "Why random measurements are not very good?",
                    "label": 0
                },
                {
                    "sent": "We had the citation update beginning.",
                    "label": 0
                },
                {
                    "sent": "We basically you can think about that being a study that really shows it, but also think about the second part.",
                    "label": 0
                },
                {
                    "sent": "We actually provide a method that is sufficient enough even now.",
                    "label": 0
                },
                {
                    "sent": "Our new version on big images, the method that Yair proposed in that node is not.",
                    "label": 0
                },
                {
                    "sent": "Trying to scale up, I think it basically looked at 8 by 8 patches.",
                    "label": 0
                },
                {
                    "sent": "So in a sense it's true.",
                    "label": 1
                },
                {
                    "sent": "I mean, this is basically I guess you know, the confirmation in practice that yes, it's really true.",
                    "label": 0
                },
                {
                    "sent": "But I mean really, if you want to understand why you know random measurements are not good, you should really look at his arguments.",
                    "label": 0
                },
                {
                    "sent": "They're really nice.",
                    "label": 0
                },
                {
                    "sent": "Components.",
                    "label": 0
                },
                {
                    "sent": "I mean, I think actually I mean I, I read that paper, I would say our method is basically somehow solving that problem, because if you apply our method to a signal class that's not images.",
                    "label": 0
                },
                {
                    "sent": "OK, I didn't do that, so I don't want to claim anything, but it has all the ingredients in there to basically be successful learning a good filter for another image class as well.",
                    "label": 0
                },
                {
                    "sent": "But let me not.",
                    "label": 0
                },
                {
                    "sent": "You know, we did this for images and it seemed to work so.",
                    "label": 0
                },
                {
                    "sent": "But I mean it has the ingredients in there.",
                    "label": 1
                },
                {
                    "sent": "It looks at the posterior.",
                    "label": 0
                },
                {
                    "sent": "It has some prior at this prior.",
                    "label": 0
                },
                {
                    "sent": "Doesn't have to tell you a good ordering for wavelet coefficients.",
                    "label": 0
                },
                {
                    "sent": "It figures that out as it goes.",
                    "label": 0
                },
                {
                    "sent": "It's basically I mean, I guess that you can from little prior knowledge.",
                    "label": 1
                },
                {
                    "sent": "You can still learn about the single class.",
                    "label": 0
                },
                {
                    "sent": "But I mean, I am not sure whether this is minimax optimal.",
                    "label": 0
                }
            ]
        }
    }
}