{
    "id": "hk52kirbsvemdlt56pwrm37537a57bxj",
    "title": "Predicting Elections with Twitter: What 140 Characters Reveal about Political Sentiment",
    "info": {
        "author": [
            "Timm O. Sprenger, Fakultät für Wirtschaftswissenschaften, TU Munich"
        ],
        "published": "June 29, 2010",
        "recorded": "May 2010",
        "category": [
            "Top->Computer Science->Data Mining->Social Content",
            "Top->Social Sciences->Society->Politics",
            "Top->Computer Science->Network Analysis->Social Networks"
        ]
    },
    "url": "http://videolectures.net/icwsm2010_sprenger_pet/",
    "segmentation": [
        [
            "So once again and welcome to our presentation predicting elections with Twitter.",
            "I'm very glad to be presenting this research here in Washington, only a couple of blocks from the White House, couple of miles from Capitol Hill.",
            "So I think this is the perfect venue to talk about this subject."
        ],
        [
            "I've divided my presentation into three parts.",
            "I'll first introduce you to the political phase of Twitter.",
            "Then I'll go through our data set and explain the methodology that we've used.",
            "And finally, of course show you some of the results and discuss their implications."
        ],
        [
            "Just this morning I came here before I came.",
            "I watched CNN and it was just announced that the Republican Party launched a new website.",
            "Today it's called the virtual town Hall.",
            "I think it was down for most of the morning.",
            "But anyways, I think it's Needless to say, and it goes without saying, actually, the successful use of social media in the last presidential campaign.",
            "Both Facebook, Myspace, Twitter, they've really established social media as a serious tool in the campaign toolbox.",
            "Right, and some analysts even say that or attribute to a large extent.",
            "Obama's victory to his use of his of online media of social media as such, and some of you may have heard or seen his very famous Twitter quote which he posted or published a couple of minutes after he got elected.",
            "We said this is history.",
            "So I think all of this demonstrates that social media have really become a serious and integral part of political communication.",
            "And all of this is also triggered.",
            "Numerous attempts to better aggregate and understand this information, and there's just a couple of examples here, ranging from analysis of Twitter accounts of Beltway politicians.",
            "There are a number of tweet aggregators that filter all kinds of political tweets, so I think this is really an issue that's coming to people's attention, and so in addition, one other thing that I've seen is more and more references to political tweets.",
            "In commentaries, journalists are using the Twitter sphere as an indicator of political opinion.",
            "Yet at the same time, there are very few scientific studies that cover this subject.",
            "So as a result."
        ],
        [
            "We've asked ourselves three questions.",
            "The first is, does Twitter provide a platform for political deliberation or discussion online?",
            "The second is if it does, then how accurately can Twitter actually inform us about the about the political sentiment of the electorate?",
            "And then finally, maybe, can we even use Twitter as a predictor of the election result or outcome?",
            "So to set the stage here."
        ],
        [
            "I'll talk a little bit about related research and some of the research gaps that result with respect to the liberation.",
            "There are a number of studies that have looked at microblogging usage and community structure, for instance, Honeycutt and Herring have found that 31% of all tweets contain an @ and most of the ad signs are used to address a specific addressee.",
            "So Twitter is not just used for one way communication.",
            "It remains to be seen whether that also applies to specific context, such as the political debate online, because this is just informing us about microblogging uses usage in general, but not any specific area right.",
            "There have been some studies of political message boards and traditional weblogs Coop and Jensen, for example.",
            "They've studied message boards in Canada and they found them to be highly dominated by very few heavy users, so it remains to be seen and will look at this.",
            "Whether the same goes for microblogging or weather, Twitter turns out to be more Democratic in a sense with respect to sentiment, most of the research has been done in a corporate context, so Jensen, for example, in others they found that 19% of a random sample of tweets contained a reference to a brand or a product, and they were able to extract significantly different sentiment towards these brands from the tweets, so gives reason to believe that, or hope to believe, that the same would go for political tweets.",
            "That sentiment is embedded in those as well.",
            "But that has to be has to be seen, and we've addressed this in our in our research here, and it is actually interesting question whether we can use the Twittersphere as an indication of public opinion.",
            "Because some people are actually very, very pessimistic and skeptical Sunstein.",
            "For example, it said that blogs in general, they can't really aggregate dispersed bits of information, right?",
            "So this might address some of this.",
            "Some of this issue and then finally, with respect to prediction, there are some studies that have explored the reflection of the political landscape.",
            "In traditional social media, so weblogs again, or or message boards, etc.",
            "Facebook for example, the number of Facebook supporters have been found to be a pretty good predictor of election outcomes in US primaries and so forth, so we'll see if that applies to microblogging as well, and there are some even much more simple methods.",
            "For example, a French researcher has just counted the number of candidate mentions in the press, and that was a better predictor of the election result than official election polls.",
            "So we look at some of this in the in the context of Twitter here, but to summarize, so there are some studies that have looked at traditional social media.",
            "Have looked at the political landscape online and found it to reflect some of the things that are going on offline, but the focus is on.",
            "It's a traditional web logs and message boards."
        ],
        [
            "So let's look at that."
        ],
        [
            "To sit here, we've collected 100 and 4000 political political tweets prior to the German federal election last September.",
            "So this is between August 13th and September 19th.",
            "So six week window, and we've collected all tweets that contain the name of either one of the main, the six main political parties or one of a selected number of candidates.",
            "Main politicians that were mentioned in those tweets and then to extract sentiment from the tweets we apply we use.",
            "Look, we've been given a great introduction today, so I don't have to say too much about it.",
            "For those who haven't been here this morning, linguistic inquiry and word count is a text analysis software that is using a pre specified or predefined dictionary, and then it calculates the share of words in a given text sample that are applied to a certain category.",
            "So if the text contains words like maybe perhaps, guess, then those are taken as representatives of the construct tentativeness and that's rated higher.",
            "For for that given text sample and this, this tool has been used widely in psychology and linguistics, but also to study US Senatorial speeches and actually James Pennebaker and his team has also have also profiled politicians, Twitter accounts using using Luke.",
            "So I think some of this might might be relevant to these tweets that we're looking at too."
        ],
        [
            "Just to provide you with a little bit of background here on the German fair on the German party system, these are the parties that I'll mention at some point in our research, and they're roughly ordered in long the political spectrum, so the socialist linker on the very left and then up to the Christian Democrats.",
            "The more conservative end of the political spectrum on the right.",
            "I won't go into too much detail, just one noteworthy detail.",
            "Might be that there are two parties here.",
            "The Christian Democrats are composed of two parties, the CDU and CSU.",
            "Their sister sister parties that field candidates in different parts of the country, but they're essentially one party that they form one faction in the German German parliament, and that detail will be of interest later on in the CDU or the Union parties as both of them are called together.",
            "They're headed by then Chancellor Angela Merkel and she was she was running for reelection.",
            "She was had been in a grand coalition with the Social Democrats for four years, but was favoring a new coalition with the.",
            "With the Liberals, the FTP and on the other hand, the Social Democrats, that sort of been between a rock and a hard place because the candidate for Chancellor Steinmeier had publicly rejected the Socialists.",
            "The link as a possible coalition partner, so he was left without really viable options there.",
            "Most polls before the election is actually called the FTP of the Liberals and the Christian Democrats ahead by a slight majority, and ultimately they were able to form a center right government?",
            "So much for the back."
        ],
        [
            "Around here."
        ],
        [
            "So let's look at some of the results first.",
            "First question was whether Twitter is used as a forum for public deliberation, right?",
            "And there are two widely accepted benchmarks of political, political or deliberation political deliberation online that was applied to message boards and so forth defined by Janssen and Cooper have cited, and that's the exchange of substantive issues.",
            "And then Secondly, equality of participation.",
            "So let's look at substantive issues here.",
            "First, in this panel on the left we see a number of sample quotes for each of the parties.",
            "It's a very cursory reading, very exploratory, and so you know.",
            "But still you can see despite the brevity lot of political opinion can be conveyed through those tweets, right?",
            "So that's just an indication that I think substantive issues can be exchanged, even though the.",
            "The space for it is very very small.",
            "Despite this we also looked at the address city and the level of retweets in the sample, and we also found 31% of the messages contained an @ in line with previous research.",
            "So again we see people are not just posting opinions, not just posting links, but they're exchanging ideas that are discussing things in the high level of retweets.",
            "Actually is a sign that they're finding interesting information, noteworthy information that they're sharing with their friends, right?",
            "So then let's move on to participation because that's an interesting issue with with Jensen Coop, but they found in their in their message board in Canada.",
            "I think was that 3% of all of the users responsible for 1/3 of the messages, so it was a highly skewed distribution.",
            "And when we look at our distribution, we have different categories of user groups or one time use users that have only posted one political message in that time frame and then up to heavy users with more than 80 messages.",
            "And that is a categorization that we adopt from.",
            "That other study and what's interesting, the distribution of users is the exact same that they found on message boards, and so that's almost one to one.",
            "But then if you look at the distribution of messages, it's even more more unequal.",
            "So we see .6% of all users the very heavy users to be responsible for more than 21% of the messages and then heavy users.",
            "Again, they make up about 3% another 20%.",
            "So 4% of the users are actually posting 40% of the messages.",
            "The political messages prior to the election, so.",
            "Very unequal distribution.",
            "So while we find evidence of deliberation of discussion online, it's dominated by a few number of heavy users political junkies.",
            "So to sort of say right and maybe just as a footnote.",
            "Additionally, we've analyzed formats of communication across these user groups.",
            "There were no big differences but was interesting.",
            "We were able to assign party affiliation to some of those accounts, and when you do that you find that the volume of messages and the sentiment contained in the messages.",
            "Is actually biased towards the party that the account is affiliated with, so just as a footnote, it would go beyond the scope of this presentation.",
            "But if somebody is interested, we can talk about this offline."
        ],
        [
            "So the fact that we see people discussing political issues on Twitter, it doesn't necessarily mean that we can extract meaningful information from it, right?",
            "So to explore this issue, what we've done is we've constructed these multi dimensional charts or profiles for both politicians and parties.",
            "We were showing the politicians here.",
            "So what this is is we've decided on 12 dimensions or chosen 12 dimensions that we deemed most relevant to the political discussion too.",
            "Political issues, some of some of them are content related, some of them are emotions like positive emotions, negative emotions.",
            "And so here we see how the Luke profile, the percentage of words in each category lines up for a number of candidates.",
            "So if we look at the leading candidates on the left, we see profiles are very very similar and I only put.",
            "I'll point out only a couple of very strident examples, and there are more in the paper because what we've done is we've compared these profiles with the with the anecdotal evidence and press coverage from the campaign trail.",
            "So I only give you a couple of examples here for if we look at the leading candidates, we see that.",
            "Positive emotion and negative emotion are higher for vest, rovella, and Lafontaine.",
            "The names don't matter, but these are the opposition candidates from the Social Socialist Party an from the market free market Liberal Party.",
            "So we're at the extreme ends of the political spectrum.",
            "Both opposition leaders and we see both of these people have the most polarizing profile on Twitter or in the eyes of the Twitter users.",
            "Another aspect maybe if we look at tentativeness Steinmeier, the Social Democratic candidate for Chancellor, is by far the most tentative of all candidates.",
            "If you remember he didn't have much options about coalition partner, he was wavering about who he would potentially coalition with.",
            "And again, that's reflected in the messages that people are writing about him.",
            "And if we look at the other politicians here, we see, for example, the economics and finance Minister, so Gutenberg and Steinbrook are associated most closely with the issues, money and work again, reflecting their role in the government.",
            "So these are only a couple of examples and I agree.",
            "And we all we found this.",
            "It's very hard to tell differences from these radar."
        ],
        [
            "So we went ahead and quantified some of this.",
            "So what this is is we defined a distance measure that looks at the average distance of a group of people from there from their average.",
            "So you take a group of politicians, create the average profile of that radar chart that we've just seen, and then calculate the average distance across all categories.",
            "So the lower the distance measure, the closer those profiles are.",
            "It's somewhat similar to what James Pennebaker described earlier, with style matching, and again, I only point out a couple of interesting examples here, but there are very.",
            "Consistent trends, but for example, we look at the politicians who overall have less consistency or less convergence then the parties.",
            "But we look at the politicians.",
            "We see that the leading candidates Shine Myron Merkel.",
            "They're actually very very close.",
            "The distance is .02, and that's very much in line with the consensus driven style of their grand coalition.",
            "They were actually coalition partners at the time that the campaign was going on, so they couldn't detect each other, right?",
            "Reflected here.",
            "When we look at the parties remember, I pointed out that the CSU and CDU, those two conservative parties, are actually one the sister parties one faction, and you see that here, very tight, very close fit of the Union factions.",
            "If you look at the Twitter sentiment profiles so those are just a couple of examples that I think show that the sentiment on Twitter are the sentiment in the messages reflects the political proximity quite quite well."
        ],
        [
            "So then now the question is, can we actually draw information about the election outcome from those messages, right?",
            "So what we see here is on the on the left, then the number of messages for each that each party was mentioned in and we computed the share of messages that these parties were attributed with or attributed to, and we take.",
            "If we take that as a predictor of the election result, right?",
            "It's awfully, awfully crude and simple.",
            "Measure agree, but still only if we do.",
            "If we take this very simple approach, then what we see is, for example, 30% of the messages contained the the party CDU, 26% contained the Social Democrats, and so forth.",
            "And now if we compare that to the election result, we find this surprising correlation, right?",
            "So across all parties, if we take the number of mentions as the predictor and compare it to the election result.",
            "We see that the mean average error is only 1.6% or percentage points actually.",
            "Maybe to better appreciate into to see how this compares to traditional polling methods down here.",
            "At the bottom you see a couple of research institutes that have done pulls a week or two prior to the election and you can see that the Twitter prediction actually comes awfully close to some of these.",
            "Some of these, some of these accepted benchmarks.",
            "Some of these polling institutions here have also had the mean average error of 1.5, one point, 4 percentage points the week prior to the election.",
            "So it's quite interesting that Twitter or the number of messages on Twitter reflect the election results so so well.",
            "This only talks about absolute strength and none of the parties were close to gaining a majority in the election.",
            "So another aspect that's interesting is the relationship between the parties, right?",
            "Because their coalition government was on the horizon prior to the election, there was no doubt about it.",
            "So what we do next is.",
            "Any tweet can mention more than one party, right?",
            "So by if we look at the probability that any one party is mentioned in a tweet, we can compute a conditional probability that two parties are mentioned together, right?",
            "And then if we compare this conditional probability with the actual observed joint mentions of two parties and we can see OK. Are these parties mentioned together more frequently than pure chance would suggest, so this relative frequency, this measure is what we've computed for all.",
            "Combinations of two parties.",
            "So yeah, relative frequency of 1.5, for instance, would mean that these two parties are mentioned together 50% more than pure pure chance would suggest.",
            "And here we see these relative frequency for all parties.",
            "Obviously the governing coalition at the time of CDU and SPD is mentioned together quite frequently with 1.23.",
            "Then the most closely associated parties again, our cou in the CSU.",
            "Those sister parties, so those are maybe pretty obvious effects.",
            "But then beyond that we see that the two parties most closely associated are the CDU and the FTP.",
            "The two parties that eventually came to form the new government.",
            "We see that across party lines there's very little Association of the right end of the political spectrum.",
            "CSU for instance with the left end of the political spectrum SPD linker.",
            "And the Green Party there all those red red areas over there.",
            "So again, I think we can see that it's not only absolute strength or absolute share of vote that Twitter might be able to give us or to inform us about, but also the relationship between parties, right?",
            "Um?",
            "So, um, maybe maybe to summarize."
        ],
        [
            "Along those three questions with respect to deliberation, we find that there is a lively political debate on Twitter, but it is dominated by a large number of small number of heavy users with a big number of messages.",
            "So 4% of the users were responsible for 40% of the messages with respect to sentiment.",
            "We see that those sentiment profiles that we were able to construct with very simple methodologies they reflect very nuanced differences of the campaign trail.",
            "Similarity of the profiles actually matched the political ties or political proximity of the parties and then finally with respect to prediction, we saw that the number of messages mentioning the party could be quite a good proxy for the election result and the joint mentioning of two parties actually informs us about their political ties and potential coalitions after after a after the election.",
            "So all of this together shows that maybe you know the Twittersphere.",
            "Maybe quite a good tool to aggregate diverse information, unlike what Sunstein says that you know, it's hard to do that with a very Democratic space.",
            "No market mechanism, but we find that this is a very encouraging to further explore other ways to use Twitter.",
            "the Twitter sphere, as an information market to aggregate, dispersed dispersed information.",
            "So maybe who knows at some?"
        ],
        [
            "Point in the near future, we may see a interpoles become more important than exit polls."
        ],
        [
            "Thank you very much and help you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So once again and welcome to our presentation predicting elections with Twitter.",
                    "label": 1
                },
                {
                    "sent": "I'm very glad to be presenting this research here in Washington, only a couple of blocks from the White House, couple of miles from Capitol Hill.",
                    "label": 0
                },
                {
                    "sent": "So I think this is the perfect venue to talk about this subject.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I've divided my presentation into three parts.",
                    "label": 0
                },
                {
                    "sent": "I'll first introduce you to the political phase of Twitter.",
                    "label": 0
                },
                {
                    "sent": "Then I'll go through our data set and explain the methodology that we've used.",
                    "label": 1
                },
                {
                    "sent": "And finally, of course show you some of the results and discuss their implications.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just this morning I came here before I came.",
                    "label": 0
                },
                {
                    "sent": "I watched CNN and it was just announced that the Republican Party launched a new website.",
                    "label": 0
                },
                {
                    "sent": "Today it's called the virtual town Hall.",
                    "label": 0
                },
                {
                    "sent": "I think it was down for most of the morning.",
                    "label": 0
                },
                {
                    "sent": "But anyways, I think it's Needless to say, and it goes without saying, actually, the successful use of social media in the last presidential campaign.",
                    "label": 1
                },
                {
                    "sent": "Both Facebook, Myspace, Twitter, they've really established social media as a serious tool in the campaign toolbox.",
                    "label": 0
                },
                {
                    "sent": "Right, and some analysts even say that or attribute to a large extent.",
                    "label": 0
                },
                {
                    "sent": "Obama's victory to his use of his of online media of social media as such, and some of you may have heard or seen his very famous Twitter quote which he posted or published a couple of minutes after he got elected.",
                    "label": 0
                },
                {
                    "sent": "We said this is history.",
                    "label": 1
                },
                {
                    "sent": "So I think all of this demonstrates that social media have really become a serious and integral part of political communication.",
                    "label": 1
                },
                {
                    "sent": "And all of this is also triggered.",
                    "label": 0
                },
                {
                    "sent": "Numerous attempts to better aggregate and understand this information, and there's just a couple of examples here, ranging from analysis of Twitter accounts of Beltway politicians.",
                    "label": 0
                },
                {
                    "sent": "There are a number of tweet aggregators that filter all kinds of political tweets, so I think this is really an issue that's coming to people's attention, and so in addition, one other thing that I've seen is more and more references to political tweets.",
                    "label": 0
                },
                {
                    "sent": "In commentaries, journalists are using the Twitter sphere as an indicator of political opinion.",
                    "label": 0
                },
                {
                    "sent": "Yet at the same time, there are very few scientific studies that cover this subject.",
                    "label": 0
                },
                {
                    "sent": "So as a result.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We've asked ourselves three questions.",
                    "label": 0
                },
                {
                    "sent": "The first is, does Twitter provide a platform for political deliberation or discussion online?",
                    "label": 1
                },
                {
                    "sent": "The second is if it does, then how accurately can Twitter actually inform us about the about the political sentiment of the electorate?",
                    "label": 0
                },
                {
                    "sent": "And then finally, maybe, can we even use Twitter as a predictor of the election result or outcome?",
                    "label": 0
                },
                {
                    "sent": "So to set the stage here.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'll talk a little bit about related research and some of the research gaps that result with respect to the liberation.",
                    "label": 0
                },
                {
                    "sent": "There are a number of studies that have looked at microblogging usage and community structure, for instance, Honeycutt and Herring have found that 31% of all tweets contain an @ and most of the ad signs are used to address a specific addressee.",
                    "label": 1
                },
                {
                    "sent": "So Twitter is not just used for one way communication.",
                    "label": 0
                },
                {
                    "sent": "It remains to be seen whether that also applies to specific context, such as the political debate online, because this is just informing us about microblogging uses usage in general, but not any specific area right.",
                    "label": 0
                },
                {
                    "sent": "There have been some studies of political message boards and traditional weblogs Coop and Jensen, for example.",
                    "label": 0
                },
                {
                    "sent": "They've studied message boards in Canada and they found them to be highly dominated by very few heavy users, so it remains to be seen and will look at this.",
                    "label": 0
                },
                {
                    "sent": "Whether the same goes for microblogging or weather, Twitter turns out to be more Democratic in a sense with respect to sentiment, most of the research has been done in a corporate context, so Jensen, for example, in others they found that 19% of a random sample of tweets contained a reference to a brand or a product, and they were able to extract significantly different sentiment towards these brands from the tweets, so gives reason to believe that, or hope to believe, that the same would go for political tweets.",
                    "label": 0
                },
                {
                    "sent": "That sentiment is embedded in those as well.",
                    "label": 0
                },
                {
                    "sent": "But that has to be has to be seen, and we've addressed this in our in our research here, and it is actually interesting question whether we can use the Twittersphere as an indication of public opinion.",
                    "label": 0
                },
                {
                    "sent": "Because some people are actually very, very pessimistic and skeptical Sunstein.",
                    "label": 1
                },
                {
                    "sent": "For example, it said that blogs in general, they can't really aggregate dispersed bits of information, right?",
                    "label": 0
                },
                {
                    "sent": "So this might address some of this.",
                    "label": 1
                },
                {
                    "sent": "Some of this issue and then finally, with respect to prediction, there are some studies that have explored the reflection of the political landscape.",
                    "label": 0
                },
                {
                    "sent": "In traditional social media, so weblogs again, or or message boards, etc.",
                    "label": 1
                },
                {
                    "sent": "Facebook for example, the number of Facebook supporters have been found to be a pretty good predictor of election outcomes in US primaries and so forth, so we'll see if that applies to microblogging as well, and there are some even much more simple methods.",
                    "label": 0
                },
                {
                    "sent": "For example, a French researcher has just counted the number of candidate mentions in the press, and that was a better predictor of the election result than official election polls.",
                    "label": 1
                },
                {
                    "sent": "So we look at some of this in the in the context of Twitter here, but to summarize, so there are some studies that have looked at traditional social media.",
                    "label": 0
                },
                {
                    "sent": "Have looked at the political landscape online and found it to reflect some of the things that are going on offline, but the focus is on.",
                    "label": 0
                },
                {
                    "sent": "It's a traditional web logs and message boards.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's look at that.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To sit here, we've collected 100 and 4000 political political tweets prior to the German federal election last September.",
                    "label": 0
                },
                {
                    "sent": "So this is between August 13th and September 19th.",
                    "label": 1
                },
                {
                    "sent": "So six week window, and we've collected all tweets that contain the name of either one of the main, the six main political parties or one of a selected number of candidates.",
                    "label": 0
                },
                {
                    "sent": "Main politicians that were mentioned in those tweets and then to extract sentiment from the tweets we apply we use.",
                    "label": 0
                },
                {
                    "sent": "Look, we've been given a great introduction today, so I don't have to say too much about it.",
                    "label": 0
                },
                {
                    "sent": "For those who haven't been here this morning, linguistic inquiry and word count is a text analysis software that is using a pre specified or predefined dictionary, and then it calculates the share of words in a given text sample that are applied to a certain category.",
                    "label": 1
                },
                {
                    "sent": "So if the text contains words like maybe perhaps, guess, then those are taken as representatives of the construct tentativeness and that's rated higher.",
                    "label": 1
                },
                {
                    "sent": "For for that given text sample and this, this tool has been used widely in psychology and linguistics, but also to study US Senatorial speeches and actually James Pennebaker and his team has also have also profiled politicians, Twitter accounts using using Luke.",
                    "label": 0
                },
                {
                    "sent": "So I think some of this might might be relevant to these tweets that we're looking at too.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just to provide you with a little bit of background here on the German fair on the German party system, these are the parties that I'll mention at some point in our research, and they're roughly ordered in long the political spectrum, so the socialist linker on the very left and then up to the Christian Democrats.",
                    "label": 0
                },
                {
                    "sent": "The more conservative end of the political spectrum on the right.",
                    "label": 0
                },
                {
                    "sent": "I won't go into too much detail, just one noteworthy detail.",
                    "label": 0
                },
                {
                    "sent": "Might be that there are two parties here.",
                    "label": 0
                },
                {
                    "sent": "The Christian Democrats are composed of two parties, the CDU and CSU.",
                    "label": 0
                },
                {
                    "sent": "Their sister sister parties that field candidates in different parts of the country, but they're essentially one party that they form one faction in the German German parliament, and that detail will be of interest later on in the CDU or the Union parties as both of them are called together.",
                    "label": 1
                },
                {
                    "sent": "They're headed by then Chancellor Angela Merkel and she was she was running for reelection.",
                    "label": 1
                },
                {
                    "sent": "She was had been in a grand coalition with the Social Democrats for four years, but was favoring a new coalition with the.",
                    "label": 0
                },
                {
                    "sent": "With the Liberals, the FTP and on the other hand, the Social Democrats, that sort of been between a rock and a hard place because the candidate for Chancellor Steinmeier had publicly rejected the Socialists.",
                    "label": 1
                },
                {
                    "sent": "The link as a possible coalition partner, so he was left without really viable options there.",
                    "label": 0
                },
                {
                    "sent": "Most polls before the election is actually called the FTP of the Liberals and the Christian Democrats ahead by a slight majority, and ultimately they were able to form a center right government?",
                    "label": 0
                },
                {
                    "sent": "So much for the back.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Around here.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's look at some of the results first.",
                    "label": 0
                },
                {
                    "sent": "First question was whether Twitter is used as a forum for public deliberation, right?",
                    "label": 1
                },
                {
                    "sent": "And there are two widely accepted benchmarks of political, political or deliberation political deliberation online that was applied to message boards and so forth defined by Janssen and Cooper have cited, and that's the exchange of substantive issues.",
                    "label": 1
                },
                {
                    "sent": "And then Secondly, equality of participation.",
                    "label": 0
                },
                {
                    "sent": "So let's look at substantive issues here.",
                    "label": 0
                },
                {
                    "sent": "First, in this panel on the left we see a number of sample quotes for each of the parties.",
                    "label": 0
                },
                {
                    "sent": "It's a very cursory reading, very exploratory, and so you know.",
                    "label": 0
                },
                {
                    "sent": "But still you can see despite the brevity lot of political opinion can be conveyed through those tweets, right?",
                    "label": 0
                },
                {
                    "sent": "So that's just an indication that I think substantive issues can be exchanged, even though the.",
                    "label": 0
                },
                {
                    "sent": "The space for it is very very small.",
                    "label": 0
                },
                {
                    "sent": "Despite this we also looked at the address city and the level of retweets in the sample, and we also found 31% of the messages contained an @ in line with previous research.",
                    "label": 0
                },
                {
                    "sent": "So again we see people are not just posting opinions, not just posting links, but they're exchanging ideas that are discussing things in the high level of retweets.",
                    "label": 0
                },
                {
                    "sent": "Actually is a sign that they're finding interesting information, noteworthy information that they're sharing with their friends, right?",
                    "label": 0
                },
                {
                    "sent": "So then let's move on to participation because that's an interesting issue with with Jensen Coop, but they found in their in their message board in Canada.",
                    "label": 0
                },
                {
                    "sent": "I think was that 3% of all of the users responsible for 1/3 of the messages, so it was a highly skewed distribution.",
                    "label": 0
                },
                {
                    "sent": "And when we look at our distribution, we have different categories of user groups or one time use users that have only posted one political message in that time frame and then up to heavy users with more than 80 messages.",
                    "label": 1
                },
                {
                    "sent": "And that is a categorization that we adopt from.",
                    "label": 1
                },
                {
                    "sent": "That other study and what's interesting, the distribution of users is the exact same that they found on message boards, and so that's almost one to one.",
                    "label": 1
                },
                {
                    "sent": "But then if you look at the distribution of messages, it's even more more unequal.",
                    "label": 1
                },
                {
                    "sent": "So we see .6% of all users the very heavy users to be responsible for more than 21% of the messages and then heavy users.",
                    "label": 0
                },
                {
                    "sent": "Again, they make up about 3% another 20%.",
                    "label": 0
                },
                {
                    "sent": "So 4% of the users are actually posting 40% of the messages.",
                    "label": 0
                },
                {
                    "sent": "The political messages prior to the election, so.",
                    "label": 0
                },
                {
                    "sent": "Very unequal distribution.",
                    "label": 0
                },
                {
                    "sent": "So while we find evidence of deliberation of discussion online, it's dominated by a few number of heavy users political junkies.",
                    "label": 0
                },
                {
                    "sent": "So to sort of say right and maybe just as a footnote.",
                    "label": 0
                },
                {
                    "sent": "Additionally, we've analyzed formats of communication across these user groups.",
                    "label": 0
                },
                {
                    "sent": "There were no big differences but was interesting.",
                    "label": 0
                },
                {
                    "sent": "We were able to assign party affiliation to some of those accounts, and when you do that you find that the volume of messages and the sentiment contained in the messages.",
                    "label": 0
                },
                {
                    "sent": "Is actually biased towards the party that the account is affiliated with, so just as a footnote, it would go beyond the scope of this presentation.",
                    "label": 0
                },
                {
                    "sent": "But if somebody is interested, we can talk about this offline.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the fact that we see people discussing political issues on Twitter, it doesn't necessarily mean that we can extract meaningful information from it, right?",
                    "label": 0
                },
                {
                    "sent": "So to explore this issue, what we've done is we've constructed these multi dimensional charts or profiles for both politicians and parties.",
                    "label": 0
                },
                {
                    "sent": "We were showing the politicians here.",
                    "label": 0
                },
                {
                    "sent": "So what this is is we've decided on 12 dimensions or chosen 12 dimensions that we deemed most relevant to the political discussion too.",
                    "label": 0
                },
                {
                    "sent": "Political issues, some of some of them are content related, some of them are emotions like positive emotions, negative emotions.",
                    "label": 1
                },
                {
                    "sent": "And so here we see how the Luke profile, the percentage of words in each category lines up for a number of candidates.",
                    "label": 0
                },
                {
                    "sent": "So if we look at the leading candidates on the left, we see profiles are very very similar and I only put.",
                    "label": 1
                },
                {
                    "sent": "I'll point out only a couple of very strident examples, and there are more in the paper because what we've done is we've compared these profiles with the with the anecdotal evidence and press coverage from the campaign trail.",
                    "label": 0
                },
                {
                    "sent": "So I only give you a couple of examples here for if we look at the leading candidates, we see that.",
                    "label": 0
                },
                {
                    "sent": "Positive emotion and negative emotion are higher for vest, rovella, and Lafontaine.",
                    "label": 0
                },
                {
                    "sent": "The names don't matter, but these are the opposition candidates from the Social Socialist Party an from the market free market Liberal Party.",
                    "label": 0
                },
                {
                    "sent": "So we're at the extreme ends of the political spectrum.",
                    "label": 0
                },
                {
                    "sent": "Both opposition leaders and we see both of these people have the most polarizing profile on Twitter or in the eyes of the Twitter users.",
                    "label": 0
                },
                {
                    "sent": "Another aspect maybe if we look at tentativeness Steinmeier, the Social Democratic candidate for Chancellor, is by far the most tentative of all candidates.",
                    "label": 0
                },
                {
                    "sent": "If you remember he didn't have much options about coalition partner, he was wavering about who he would potentially coalition with.",
                    "label": 0
                },
                {
                    "sent": "And again, that's reflected in the messages that people are writing about him.",
                    "label": 0
                },
                {
                    "sent": "And if we look at the other politicians here, we see, for example, the economics and finance Minister, so Gutenberg and Steinbrook are associated most closely with the issues, money and work again, reflecting their role in the government.",
                    "label": 1
                },
                {
                    "sent": "So these are only a couple of examples and I agree.",
                    "label": 0
                },
                {
                    "sent": "And we all we found this.",
                    "label": 0
                },
                {
                    "sent": "It's very hard to tell differences from these radar.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we went ahead and quantified some of this.",
                    "label": 0
                },
                {
                    "sent": "So what this is is we defined a distance measure that looks at the average distance of a group of people from there from their average.",
                    "label": 1
                },
                {
                    "sent": "So you take a group of politicians, create the average profile of that radar chart that we've just seen, and then calculate the average distance across all categories.",
                    "label": 0
                },
                {
                    "sent": "So the lower the distance measure, the closer those profiles are.",
                    "label": 0
                },
                {
                    "sent": "It's somewhat similar to what James Pennebaker described earlier, with style matching, and again, I only point out a couple of interesting examples here, but there are very.",
                    "label": 0
                },
                {
                    "sent": "Consistent trends, but for example, we look at the politicians who overall have less consistency or less convergence then the parties.",
                    "label": 0
                },
                {
                    "sent": "But we look at the politicians.",
                    "label": 0
                },
                {
                    "sent": "We see that the leading candidates Shine Myron Merkel.",
                    "label": 1
                },
                {
                    "sent": "They're actually very very close.",
                    "label": 0
                },
                {
                    "sent": "The distance is .02, and that's very much in line with the consensus driven style of their grand coalition.",
                    "label": 1
                },
                {
                    "sent": "They were actually coalition partners at the time that the campaign was going on, so they couldn't detect each other, right?",
                    "label": 0
                },
                {
                    "sent": "Reflected here.",
                    "label": 1
                },
                {
                    "sent": "When we look at the parties remember, I pointed out that the CSU and CDU, those two conservative parties, are actually one the sister parties one faction, and you see that here, very tight, very close fit of the Union factions.",
                    "label": 1
                },
                {
                    "sent": "If you look at the Twitter sentiment profiles so those are just a couple of examples that I think show that the sentiment on Twitter are the sentiment in the messages reflects the political proximity quite quite well.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So then now the question is, can we actually draw information about the election outcome from those messages, right?",
                    "label": 0
                },
                {
                    "sent": "So what we see here is on the on the left, then the number of messages for each that each party was mentioned in and we computed the share of messages that these parties were attributed with or attributed to, and we take.",
                    "label": 0
                },
                {
                    "sent": "If we take that as a predictor of the election result, right?",
                    "label": 1
                },
                {
                    "sent": "It's awfully, awfully crude and simple.",
                    "label": 0
                },
                {
                    "sent": "Measure agree, but still only if we do.",
                    "label": 0
                },
                {
                    "sent": "If we take this very simple approach, then what we see is, for example, 30% of the messages contained the the party CDU, 26% contained the Social Democrats, and so forth.",
                    "label": 0
                },
                {
                    "sent": "And now if we compare that to the election result, we find this surprising correlation, right?",
                    "label": 0
                },
                {
                    "sent": "So across all parties, if we take the number of mentions as the predictor and compare it to the election result.",
                    "label": 0
                },
                {
                    "sent": "We see that the mean average error is only 1.6% or percentage points actually.",
                    "label": 0
                },
                {
                    "sent": "Maybe to better appreciate into to see how this compares to traditional polling methods down here.",
                    "label": 0
                },
                {
                    "sent": "At the bottom you see a couple of research institutes that have done pulls a week or two prior to the election and you can see that the Twitter prediction actually comes awfully close to some of these.",
                    "label": 0
                },
                {
                    "sent": "Some of these, some of these accepted benchmarks.",
                    "label": 0
                },
                {
                    "sent": "Some of these polling institutions here have also had the mean average error of 1.5, one point, 4 percentage points the week prior to the election.",
                    "label": 0
                },
                {
                    "sent": "So it's quite interesting that Twitter or the number of messages on Twitter reflect the election results so so well.",
                    "label": 1
                },
                {
                    "sent": "This only talks about absolute strength and none of the parties were close to gaining a majority in the election.",
                    "label": 0
                },
                {
                    "sent": "So another aspect that's interesting is the relationship between the parties, right?",
                    "label": 1
                },
                {
                    "sent": "Because their coalition government was on the horizon prior to the election, there was no doubt about it.",
                    "label": 0
                },
                {
                    "sent": "So what we do next is.",
                    "label": 0
                },
                {
                    "sent": "Any tweet can mention more than one party, right?",
                    "label": 0
                },
                {
                    "sent": "So by if we look at the probability that any one party is mentioned in a tweet, we can compute a conditional probability that two parties are mentioned together, right?",
                    "label": 0
                },
                {
                    "sent": "And then if we compare this conditional probability with the actual observed joint mentions of two parties and we can see OK. Are these parties mentioned together more frequently than pure chance would suggest, so this relative frequency, this measure is what we've computed for all.",
                    "label": 0
                },
                {
                    "sent": "Combinations of two parties.",
                    "label": 0
                },
                {
                    "sent": "So yeah, relative frequency of 1.5, for instance, would mean that these two parties are mentioned together 50% more than pure pure chance would suggest.",
                    "label": 1
                },
                {
                    "sent": "And here we see these relative frequency for all parties.",
                    "label": 0
                },
                {
                    "sent": "Obviously the governing coalition at the time of CDU and SPD is mentioned together quite frequently with 1.23.",
                    "label": 0
                },
                {
                    "sent": "Then the most closely associated parties again, our cou in the CSU.",
                    "label": 1
                },
                {
                    "sent": "Those sister parties, so those are maybe pretty obvious effects.",
                    "label": 0
                },
                {
                    "sent": "But then beyond that we see that the two parties most closely associated are the CDU and the FTP.",
                    "label": 0
                },
                {
                    "sent": "The two parties that eventually came to form the new government.",
                    "label": 0
                },
                {
                    "sent": "We see that across party lines there's very little Association of the right end of the political spectrum.",
                    "label": 0
                },
                {
                    "sent": "CSU for instance with the left end of the political spectrum SPD linker.",
                    "label": 0
                },
                {
                    "sent": "And the Green Party there all those red red areas over there.",
                    "label": 0
                },
                {
                    "sent": "So again, I think we can see that it's not only absolute strength or absolute share of vote that Twitter might be able to give us or to inform us about, but also the relationship between parties, right?",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So, um, maybe maybe to summarize.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Along those three questions with respect to deliberation, we find that there is a lively political debate on Twitter, but it is dominated by a large number of small number of heavy users with a big number of messages.",
                    "label": 1
                },
                {
                    "sent": "So 4% of the users were responsible for 40% of the messages with respect to sentiment.",
                    "label": 1
                },
                {
                    "sent": "We see that those sentiment profiles that we were able to construct with very simple methodologies they reflect very nuanced differences of the campaign trail.",
                    "label": 0
                },
                {
                    "sent": "Similarity of the profiles actually matched the political ties or political proximity of the parties and then finally with respect to prediction, we saw that the number of messages mentioning the party could be quite a good proxy for the election result and the joint mentioning of two parties actually informs us about their political ties and potential coalitions after after a after the election.",
                    "label": 0
                },
                {
                    "sent": "So all of this together shows that maybe you know the Twittersphere.",
                    "label": 0
                },
                {
                    "sent": "Maybe quite a good tool to aggregate diverse information, unlike what Sunstein says that you know, it's hard to do that with a very Democratic space.",
                    "label": 0
                },
                {
                    "sent": "No market mechanism, but we find that this is a very encouraging to further explore other ways to use Twitter.",
                    "label": 0
                },
                {
                    "sent": "the Twitter sphere, as an information market to aggregate, dispersed dispersed information.",
                    "label": 0
                },
                {
                    "sent": "So maybe who knows at some?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Point in the near future, we may see a interpoles become more important than exit polls.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you very much and help you.",
                    "label": 0
                }
            ]
        }
    }
}