{
    "id": "hmdphj2fd5tjw2vzo4g7bwxdx3pp4f6r",
    "title": "On Stochastic and Worst-case Models for Investing",
    "info": {
        "author": [
            "Elad Hazan, Technion - Israel Institute of Technology"
        ],
        "published": "Jan. 19, 2010",
        "recorded": "December 2009",
        "category": [
            "Top->Mathematics->Analysis",
            "Top->Social Sciences->Economics"
        ]
    },
    "url": "http://videolectures.net/nips09_hazan_swc/",
    "segmentation": [
        [
            "So I'm a lot has am and this is.",
            "I'll talk about joint work with my colleagues.",
            "So 10 color with that Yahoo.",
            "I'm at IBM.",
            "And I'll talk about investing this way."
        ],
        [
            "Is about interpolating models for investing in stochastic and a worst case model?",
            "So let's start with the older theory, which is a stochastic model for investing.",
            "And as early as the 1900s.",
            "It was considered to model the prices of stocks as well.",
            "The book a type of random walk.",
            "This is given by the differential equation over here.",
            "Essentially, this is called your metal band in motion, and it is if it is a random walk which is step size is infinitesimally small.",
            "With parameters which are adrift.",
            "And variation.",
            "So."
        ],
        [
            "This pricing model was used by Black and Scholes in the Nobel Prize winning work to price options.",
            "And is used for what I call average case investing.",
            "So if you assume that stock prices behave in such a way, what you can do is observe historical data.",
            "Try to extract the parameters the mu and Sigma here, which are the drift in the valuation and according to that building portfolio.",
            "The trouble is, of course, that it doesn't.",
            "This is only an approximation to reality, so geometric bounding motion does not always hold what we see here is the 1987 market crash, highlighted in this blue ellipse.",
            "The market lost approximately 40% of its value in a few couple of days, so there's a discontinuity here, which is, of course.",
            "Not explained by geometric Brownian motion.",
            "And this is what motivated the statistician Tom Koehler in 89 to propose the worst case model.",
            "So this is the second model that we consider.",
            "And here Comer assume nothing statistical about the market, so prices can vary arbitrarily.",
            "So to illustrate the model considered an investor, she distributes her wealth."
        ],
        [
            "And in the form of a distribution over these four.",
            "Assets.",
            "Which will denoted by X and of course doesn't know how the market is going to behave.",
            "And.",
            "After committing to distribution so she puts her wealth in the dollar another half in the yen.",
            "Then at the end of the trading.",
            "We get to see how the market reacted.",
            "And this is in the form of a price relative vector.",
            "So for every asset we have.",
            "Price relative this is the closing price divided by the opening price.",
            "So in this simple example over here, the change of wealth is half of it multiplied 1.5, another half did nothing of the whole 25% increase.",
            "Right, so the world change in one day in this model is multiplicative and it changed by a factor, which is the inner product between the investors distribution and the price relative vector."
        ],
        [
            "And suppose, OK, it's within a day here, but doesn't have to be.",
            "A date can be any trading.",
            "In our second etc.",
            "So although many trading periods, the final wealth is whatever initially we started off with multiplied by all the increased factor intermediate increasing factors.",
            "And our objective is of course to maximize the worth or maximize this.",
            "This product of product here.",
            "And for mathematical convenience, it is of course.",
            "And much nicer to take the logo with them.",
            "So we would like to maximize this sum of logarithms of inner products.",
            "But recall within it assumed anything about the market.",
            "The market here is modeled by these by salty vectors are submitting which can be arbitrary.",
            "An handful cannot say anything absolute, So what we do measure is regret.",
            "A relative performance to some benchmark.",
            "The benchmark that was chosen in this case that was proposed by Tom Kover is called the Constant a balanced portfolio.",
            "So let me just illustrate what this is.",
            "So consider two assets.",
            "A constant rebalanced portfolio.",
            "Every iteration, rebalancing."
        ],
        [
            "Is according to a fixed unchanging distribution.",
            "So in this simple example, if we rebalanced everyday evenly amongst the two assets, then every day we make 5% because half of it multiplies by two and I don't have my .1.",
            "But every single currency here depreciates exponentially fast.",
            "So this is just a simple distillation of water content.",
            "Balanced portfolio is an shows you that it is a powerful notion.",
            "In fact, it's the optimal portfolio if you assume that prices behave independently according to some distribution.",
            "And regret that something that I hope you have seen today or in previous days is measures the performance of our algorithm to the best offline fixed strategy.",
            "In this case, we measure the log wealth of the optimum constant robust portfolio.",
            "The difference between this and the wealth of our algorithm and this is what we have in mathematical here.",
            "Textile is their optimal fixed, constantly balanced portfolio.",
            "So a cover proposed this model.",
            "He gave an algorithm whose regret behaves like logarithmic in the number of trading iterations.",
            "And here is the number of facets so linear in the number of facets.",
            "And this is actually optimal."
        ],
        [
            "Approved by him to be optimal.",
            "The implication is is very interesting.",
            "It means that on the average, the average daily return given by his book algorithm approaches that of the best concentr balanced portfolio.",
            "And the downside of this algorithm was its running time.",
            "It was exponential.",
            "TT is the number of trading iterations to the number of assets.",
            "In the 2000 Colombian, Paula gave a polynomial time implementation.",
            "Randomized implementation of coral's algorithm.",
            "Who's running time is still quite large.",
            "Helmbold champions England Valmouth gave you 96 six very nice algorithm that is.",
            "Based on multiplicative updates, the regret is.",
            "Wolf on some respect.",
            "It is only proportional to square root of the number of turning iterations, but nicer in other respects, logarithmic in the number of assets and the running time is optimal linear running time.",
            "One final word was given when joint work with Adam Kalai, 13: Amit Agarwal, 2006.",
            "An algorithm based on Newtons method which has almost the same regretted Stamkos algorithm.",
            "So it's almost optimal.",
            "And the running time is also good.",
            "It is in cube for iteration.",
            "So we combine sort of the best of."
        ],
        [
            "Previous algorithms.",
            "In some experiments that were conducted and shown in ACNL 2006.",
            "And also previous experience experience prior to that some interesting phenomena were observed.",
            "For one interesting aspect was that if you increase the training frequency, the performance of these algorithms improves.",
            "And there is no upper with reason why this should be true, because they regret increases with the number of training iterations increases to Infinity.",
            "That's one.",
            "One in the property that was observed.",
            "Other properties were that the Newton based algorithm seem to perform much, much better than other algorithms, both in terms of return and also in terms.",
            "This little graphs here on the side which indicate risk risk performance that was also superior in terms of risk."
        ],
        [
            "And at that time we didn't know why.",
            "Why was it so much better?",
            "And why is it?",
            "Why is it good at all, given that they regret goes to Infinity?",
            "And the more interesting how do these results relate to standard economic theory?",
            "Which model the price of efforts by geometric Brownian motion?"
        ],
        [
            "So finally I can tell you what is the result of the paper that we present and the main result is an algorithm with the title regret bound.",
            "Now I mentioned that Kovels regret bound was tight, so it is a title in certain respects which I will describe shortly.",
            "It is what is called the variational regret bound.",
            "And it is an efficient algorithm, so that's the main result.",
            "Main technical result and will couple it with some observations on geometric Brownian motion.",
            "Such that looking at these properties of geometric bounding motion and looking at the regret bound to obtain, we can.",
            "We can produce some interesting implication of the performance of algorithms of this algorithm, assuming geometric bounding motion, and we can relate the models.",
            "And explain this theoretical results which I have briefly shown in the previous slide."
        ],
        [
            "So let me start by explaining what I'll in what sense is the regret bound title and water variational regret bounds at all?",
            "So consider two asset market simple to asset market that we have here.",
            "We can see iteratively the multiplicative return of both assets and they behave.",
            "These are just arbitrary numbers, but what cover showed?",
            "If the regret of his algorithm is bounded by logarithm, the number of trading iterations.",
            "And this is tight.",
            "What if we consider a diff?"
        ],
        [
            "Current market, which is B9 such as the one we have here.",
            "So one asset in you know.",
            "Appreciates by factor of two daily and the other doesn't do anything, so there are very simple behavior.",
            "So there is no Apple.",
            "Isn't that in this simple behavior?",
            "In the log it is tight.",
            "In the worst case for this simple market there is no reason that the regression grow to Infinity, right?",
            "We should be able to figure out that the first asset is much better and put all our money on it and that's it.",
            "Occur constant regret if any.",
            "And generalizing this question, it is a bouncy sublime came on so installs ask can we design?",
            "And algorithms.",
            "Whose regret what I called variational or they call it fundamental regret bounds which depend on the variation of the data.",
            "So not only on the number of training iterations, which is sort of a rough bound, but something more delicate that takes the data into account.",
            "The motivation came from statistics that actually if we do assume some statistical assumptions on how the data is formed, how these these returns of market are formed in this case, then we can actually come up with tighter bounds or step known statistical algorithms that can come up with tighter bounds and regret as we know it handles.",
            "The worst case makes no assumptions at all.",
            "So that was the motivation to interpolate somehow between stochastic and worst case.",
            "And indeed I mean theorem.",
            "Move such a bound so if we."
        ],
        [
            "So there are some TR return vectors as I defined previously.",
            "And then we give you an efficient algorithm for which the regret is bounded by the logarithm of the total quadratic variation of this return vectors.",
            "Which are denoted by Q4 quadratic variation somew.",
            "Here is the mean of all these.",
            "These returns in the special case that other is fixed the same vector all the time, as in the benign example that we saw them.",
            "This is 0 so it's not log of 0 then maybe there is a plus one inside there, but it's a constant nevertheless, so indeed in benign settings we get constant regret.",
            "And more generally, it's logarithm for the quality collaboration, which is always better than log of the number of iterations and hence this is a title regret bound.",
            "I'll just remark that.",
            "Actually, our result holds more generally for a setting of online convex optimization, but for the sake of this talk we only consider these."
        ],
        [
            "Folder management application.",
            "Right?",
            "So let me say a few words about the algorithm that actually achieves this bound.",
            "And the intuition is simple.",
            "If a sequence has no variation, then we should be able to predict the future very well based upon the fact based upon the past.",
            "Simply because there is no valuation, right?",
            "We do not expect a lot of changes in the future.",
            "So more formally.",
            "An algorithm which is called fictitious play in economics.",
            "So follow the leader in machine learning so the following at time T the portfolio we should use is the best portfolio.",
            "In hindsight, adapting to the data we have seen.",
            "Plus a small Euclidean regularization which I added here and it's not.",
            "Completely necessary, it's not necessary actually, but intuitively.",
            "Use the best portfolio in hindsight, that sort of the algorithm will consider."
        ],
        [
            "Let us just say so.",
            "This is the algorithm that actually achieves the title bound.",
            "There is simple and intuitive algorithm.",
            "And let us just get give a little glimpse into the analysis.",
            "The key to bounding regret for this type of algorithm is stability.",
            "Namely, how much?",
            "5 minutes OK. How much does the portfolio change from iteration to iteration Becausw?",
            "So just intuitively, if it doesn't change at all, it means that we are doing the correct thing and we should not modify the portfolio from one iteration to the next and hence I regret would be very low overall.",
            "So this is the key.",
            "Formally the regret can be bounded by some of differences of logarithms of returns.",
            "The first term is to use the grid.",
            "The first steps to the gradient bound.",
            "So here I'll submit the return vector is the gradient rough proportional to the gradient of the logarithmic reward function?",
            "And then you can even add.",
            "With a one family to get something proportional to the valuation, not to the returns themselves, so we can subtract the mean of all return vectors and easily see that everything telescopes.",
            "So just just by adding the mean, everything telescopes.",
            "So here I did not to mean itself because I do not know it ahead of time, but the mean up to time T. But this doesn't make a big difference, so we have some additional lower order terms.",
            "So after using this gradient.",
            "Approximation we can reason about the difference between two consecutive portfolios by their definition.",
            "So I defined the algorithm.",
            "It is followed a little type algorithm.",
            "Do the best in hindsight.",
            "And using optimality conditions, codes come to call on accepted, which is the result of an optimization problem.",
            "We can reason about the difference between two consecutive portfolios and show it is proportional.",
            "Again, to do an inner product between an invocation here and.",
            "Something that looks like the return vector of the market or the valuation in it.",
            "I just remarked that the Hessian of these functions is proportional to the son of all outer products of cost vectors so far.",
            "So this is a nice structure that comes out.",
            "And using the structure, the sum of quadratic terms here that we see in Step 2, it can actually be written as a generalization of something well known harmonic series.",
            "So it's a vector generalization of it, and harmonic series behave like logarithms, so.",
            "So that's something that helps us finally get the logarithm in there.",
            "Um?",
            "So this is just in one line.",
            "For those of you who are interested in more details, please approach me this or my coauthor this evening in the Postal session.",
            "So the next part is to observe the geometric Brownian motion model.",
            "And the first observation is that if we fix a trading.",
            "Let's say one year.",
            "Then"
        ],
        [
            "Because of the way the bounding this random walk behaves, the original motion behaves, sampling the prices of a certain asset, no matter how frequently you sample it.",
            "The valuation is going to remain constant.",
            "If the total duration is fixed, let's say one year.",
            "So this means that quadratic variation.",
            "Is almost I can say independent of the trading frequency is the first observation.",
            "And the second observation is that in assuming, again, this geometric bounding motion model.",
            "Increasing the trading frequency actually increases the performance of the best constant advanced portfolio.",
            "So even though it cost about portfolio, therapy was defined generally for the worst case model.",
            "If we of course it applies to this special case, stochastic assumptions and it improves as we improve as we increase the training frequency, this SLP creature improves its performance.",
            "And the conclusion is that combining the stronger regret bound and this observation from geometry bounding motion, the conclusions that there existed an efficient portfolio selection algorithm."
        ],
        [
            "Touch that.",
            "If we assume prices behave according to genetic bound in motion.",
            "It's regret is independent of the operating frequency completely, because of course the regret is logarithmic logarithmic in the quadratic variation, and that's fixed.",
            "For the relative constant in effect.",
            "And what what happens if we have a market crash like 1987?",
            "Well then we still have the worst case bound that doesn't go away.",
            "That always remains valid and we're still at most logarithmic away logarithmic in the quadratic location away from the best SLP.",
            "So thank you.",
            "Running a little late to have time for one question.",
            "So I'm wondering if the two norm squared in your algorithm is necessary, could you do it with other regularizers like entropy or something like that?",
            "So actually it's not necessary.",
            "You can remove it completely and you can plug in any strongly convex function you wish.",
            "Including verbalization is chosen to optimize the constants in the bound.",
            "But actually you can get almost any.",
            "You can put anything else there, and you would still get the same aseptic bounds.",
            "I think thank you one."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'm a lot has am and this is.",
                    "label": 0
                },
                {
                    "sent": "I'll talk about joint work with my colleagues.",
                    "label": 0
                },
                {
                    "sent": "So 10 color with that Yahoo.",
                    "label": 0
                },
                {
                    "sent": "I'm at IBM.",
                    "label": 0
                },
                {
                    "sent": "And I'll talk about investing this way.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is about interpolating models for investing in stochastic and a worst case model?",
                    "label": 0
                },
                {
                    "sent": "So let's start with the older theory, which is a stochastic model for investing.",
                    "label": 1
                },
                {
                    "sent": "And as early as the 1900s.",
                    "label": 0
                },
                {
                    "sent": "It was considered to model the prices of stocks as well.",
                    "label": 0
                },
                {
                    "sent": "The book a type of random walk.",
                    "label": 0
                },
                {
                    "sent": "This is given by the differential equation over here.",
                    "label": 0
                },
                {
                    "sent": "Essentially, this is called your metal band in motion, and it is if it is a random walk which is step size is infinitesimally small.",
                    "label": 0
                },
                {
                    "sent": "With parameters which are adrift.",
                    "label": 0
                },
                {
                    "sent": "And variation.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This pricing model was used by Black and Scholes in the Nobel Prize winning work to price options.",
                    "label": 0
                },
                {
                    "sent": "And is used for what I call average case investing.",
                    "label": 0
                },
                {
                    "sent": "So if you assume that stock prices behave in such a way, what you can do is observe historical data.",
                    "label": 0
                },
                {
                    "sent": "Try to extract the parameters the mu and Sigma here, which are the drift in the valuation and according to that building portfolio.",
                    "label": 0
                },
                {
                    "sent": "The trouble is, of course, that it doesn't.",
                    "label": 0
                },
                {
                    "sent": "This is only an approximation to reality, so geometric bounding motion does not always hold what we see here is the 1987 market crash, highlighted in this blue ellipse.",
                    "label": 0
                },
                {
                    "sent": "The market lost approximately 40% of its value in a few couple of days, so there's a discontinuity here, which is, of course.",
                    "label": 0
                },
                {
                    "sent": "Not explained by geometric Brownian motion.",
                    "label": 0
                },
                {
                    "sent": "And this is what motivated the statistician Tom Koehler in 89 to propose the worst case model.",
                    "label": 0
                },
                {
                    "sent": "So this is the second model that we consider.",
                    "label": 0
                },
                {
                    "sent": "And here Comer assume nothing statistical about the market, so prices can vary arbitrarily.",
                    "label": 0
                },
                {
                    "sent": "So to illustrate the model considered an investor, she distributes her wealth.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And in the form of a distribution over these four.",
                    "label": 0
                },
                {
                    "sent": "Assets.",
                    "label": 0
                },
                {
                    "sent": "Which will denoted by X and of course doesn't know how the market is going to behave.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "After committing to distribution so she puts her wealth in the dollar another half in the yen.",
                    "label": 0
                },
                {
                    "sent": "Then at the end of the trading.",
                    "label": 0
                },
                {
                    "sent": "We get to see how the market reacted.",
                    "label": 0
                },
                {
                    "sent": "And this is in the form of a price relative vector.",
                    "label": 0
                },
                {
                    "sent": "So for every asset we have.",
                    "label": 0
                },
                {
                    "sent": "Price relative this is the closing price divided by the opening price.",
                    "label": 1
                },
                {
                    "sent": "So in this simple example over here, the change of wealth is half of it multiplied 1.5, another half did nothing of the whole 25% increase.",
                    "label": 0
                },
                {
                    "sent": "Right, so the world change in one day in this model is multiplicative and it changed by a factor, which is the inner product between the investors distribution and the price relative vector.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And suppose, OK, it's within a day here, but doesn't have to be.",
                    "label": 0
                },
                {
                    "sent": "A date can be any trading.",
                    "label": 0
                },
                {
                    "sent": "In our second etc.",
                    "label": 0
                },
                {
                    "sent": "So although many trading periods, the final wealth is whatever initially we started off with multiplied by all the increased factor intermediate increasing factors.",
                    "label": 0
                },
                {
                    "sent": "And our objective is of course to maximize the worth or maximize this.",
                    "label": 0
                },
                {
                    "sent": "This product of product here.",
                    "label": 0
                },
                {
                    "sent": "And for mathematical convenience, it is of course.",
                    "label": 0
                },
                {
                    "sent": "And much nicer to take the logo with them.",
                    "label": 0
                },
                {
                    "sent": "So we would like to maximize this sum of logarithms of inner products.",
                    "label": 0
                },
                {
                    "sent": "But recall within it assumed anything about the market.",
                    "label": 0
                },
                {
                    "sent": "The market here is modeled by these by salty vectors are submitting which can be arbitrary.",
                    "label": 0
                },
                {
                    "sent": "An handful cannot say anything absolute, So what we do measure is regret.",
                    "label": 0
                },
                {
                    "sent": "A relative performance to some benchmark.",
                    "label": 0
                },
                {
                    "sent": "The benchmark that was chosen in this case that was proposed by Tom Kover is called the Constant a balanced portfolio.",
                    "label": 0
                },
                {
                    "sent": "So let me just illustrate what this is.",
                    "label": 0
                },
                {
                    "sent": "So consider two assets.",
                    "label": 0
                },
                {
                    "sent": "A constant rebalanced portfolio.",
                    "label": 0
                },
                {
                    "sent": "Every iteration, rebalancing.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is according to a fixed unchanging distribution.",
                    "label": 0
                },
                {
                    "sent": "So in this simple example, if we rebalanced everyday evenly amongst the two assets, then every day we make 5% because half of it multiplies by two and I don't have my .1.",
                    "label": 0
                },
                {
                    "sent": "But every single currency here depreciates exponentially fast.",
                    "label": 1
                },
                {
                    "sent": "So this is just a simple distillation of water content.",
                    "label": 0
                },
                {
                    "sent": "Balanced portfolio is an shows you that it is a powerful notion.",
                    "label": 0
                },
                {
                    "sent": "In fact, it's the optimal portfolio if you assume that prices behave independently according to some distribution.",
                    "label": 1
                },
                {
                    "sent": "And regret that something that I hope you have seen today or in previous days is measures the performance of our algorithm to the best offline fixed strategy.",
                    "label": 0
                },
                {
                    "sent": "In this case, we measure the log wealth of the optimum constant robust portfolio.",
                    "label": 0
                },
                {
                    "sent": "The difference between this and the wealth of our algorithm and this is what we have in mathematical here.",
                    "label": 0
                },
                {
                    "sent": "Textile is their optimal fixed, constantly balanced portfolio.",
                    "label": 0
                },
                {
                    "sent": "So a cover proposed this model.",
                    "label": 0
                },
                {
                    "sent": "He gave an algorithm whose regret behaves like logarithmic in the number of trading iterations.",
                    "label": 0
                },
                {
                    "sent": "And here is the number of facets so linear in the number of facets.",
                    "label": 0
                },
                {
                    "sent": "And this is actually optimal.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Approved by him to be optimal.",
                    "label": 0
                },
                {
                    "sent": "The implication is is very interesting.",
                    "label": 0
                },
                {
                    "sent": "It means that on the average, the average daily return given by his book algorithm approaches that of the best concentr balanced portfolio.",
                    "label": 0
                },
                {
                    "sent": "And the downside of this algorithm was its running time.",
                    "label": 0
                },
                {
                    "sent": "It was exponential.",
                    "label": 0
                },
                {
                    "sent": "TT is the number of trading iterations to the number of assets.",
                    "label": 0
                },
                {
                    "sent": "In the 2000 Colombian, Paula gave a polynomial time implementation.",
                    "label": 0
                },
                {
                    "sent": "Randomized implementation of coral's algorithm.",
                    "label": 0
                },
                {
                    "sent": "Who's running time is still quite large.",
                    "label": 1
                },
                {
                    "sent": "Helmbold champions England Valmouth gave you 96 six very nice algorithm that is.",
                    "label": 0
                },
                {
                    "sent": "Based on multiplicative updates, the regret is.",
                    "label": 0
                },
                {
                    "sent": "Wolf on some respect.",
                    "label": 0
                },
                {
                    "sent": "It is only proportional to square root of the number of turning iterations, but nicer in other respects, logarithmic in the number of assets and the running time is optimal linear running time.",
                    "label": 1
                },
                {
                    "sent": "One final word was given when joint work with Adam Kalai, 13: Amit Agarwal, 2006.",
                    "label": 0
                },
                {
                    "sent": "An algorithm based on Newtons method which has almost the same regretted Stamkos algorithm.",
                    "label": 1
                },
                {
                    "sent": "So it's almost optimal.",
                    "label": 0
                },
                {
                    "sent": "And the running time is also good.",
                    "label": 0
                },
                {
                    "sent": "It is in cube for iteration.",
                    "label": 0
                },
                {
                    "sent": "So we combine sort of the best of.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Previous algorithms.",
                    "label": 0
                },
                {
                    "sent": "In some experiments that were conducted and shown in ACNL 2006.",
                    "label": 0
                },
                {
                    "sent": "And also previous experience experience prior to that some interesting phenomena were observed.",
                    "label": 0
                },
                {
                    "sent": "For one interesting aspect was that if you increase the training frequency, the performance of these algorithms improves.",
                    "label": 0
                },
                {
                    "sent": "And there is no upper with reason why this should be true, because they regret increases with the number of training iterations increases to Infinity.",
                    "label": 0
                },
                {
                    "sent": "That's one.",
                    "label": 0
                },
                {
                    "sent": "One in the property that was observed.",
                    "label": 0
                },
                {
                    "sent": "Other properties were that the Newton based algorithm seem to perform much, much better than other algorithms, both in terms of return and also in terms.",
                    "label": 0
                },
                {
                    "sent": "This little graphs here on the side which indicate risk risk performance that was also superior in terms of risk.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And at that time we didn't know why.",
                    "label": 0
                },
                {
                    "sent": "Why was it so much better?",
                    "label": 1
                },
                {
                    "sent": "And why is it?",
                    "label": 0
                },
                {
                    "sent": "Why is it good at all, given that they regret goes to Infinity?",
                    "label": 1
                },
                {
                    "sent": "And the more interesting how do these results relate to standard economic theory?",
                    "label": 0
                },
                {
                    "sent": "Which model the price of efforts by geometric Brownian motion?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So finally I can tell you what is the result of the paper that we present and the main result is an algorithm with the title regret bound.",
                    "label": 0
                },
                {
                    "sent": "Now I mentioned that Kovels regret bound was tight, so it is a title in certain respects which I will describe shortly.",
                    "label": 0
                },
                {
                    "sent": "It is what is called the variational regret bound.",
                    "label": 1
                },
                {
                    "sent": "And it is an efficient algorithm, so that's the main result.",
                    "label": 0
                },
                {
                    "sent": "Main technical result and will couple it with some observations on geometric Brownian motion.",
                    "label": 0
                },
                {
                    "sent": "Such that looking at these properties of geometric bounding motion and looking at the regret bound to obtain, we can.",
                    "label": 0
                },
                {
                    "sent": "We can produce some interesting implication of the performance of algorithms of this algorithm, assuming geometric bounding motion, and we can relate the models.",
                    "label": 0
                },
                {
                    "sent": "And explain this theoretical results which I have briefly shown in the previous slide.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me start by explaining what I'll in what sense is the regret bound title and water variational regret bounds at all?",
                    "label": 1
                },
                {
                    "sent": "So consider two asset market simple to asset market that we have here.",
                    "label": 0
                },
                {
                    "sent": "We can see iteratively the multiplicative return of both assets and they behave.",
                    "label": 0
                },
                {
                    "sent": "These are just arbitrary numbers, but what cover showed?",
                    "label": 0
                },
                {
                    "sent": "If the regret of his algorithm is bounded by logarithm, the number of trading iterations.",
                    "label": 0
                },
                {
                    "sent": "And this is tight.",
                    "label": 0
                },
                {
                    "sent": "What if we consider a diff?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Current market, which is B9 such as the one we have here.",
                    "label": 0
                },
                {
                    "sent": "So one asset in you know.",
                    "label": 0
                },
                {
                    "sent": "Appreciates by factor of two daily and the other doesn't do anything, so there are very simple behavior.",
                    "label": 0
                },
                {
                    "sent": "So there is no Apple.",
                    "label": 0
                },
                {
                    "sent": "Isn't that in this simple behavior?",
                    "label": 1
                },
                {
                    "sent": "In the log it is tight.",
                    "label": 0
                },
                {
                    "sent": "In the worst case for this simple market there is no reason that the regression grow to Infinity, right?",
                    "label": 1
                },
                {
                    "sent": "We should be able to figure out that the first asset is much better and put all our money on it and that's it.",
                    "label": 0
                },
                {
                    "sent": "Occur constant regret if any.",
                    "label": 1
                },
                {
                    "sent": "And generalizing this question, it is a bouncy sublime came on so installs ask can we design?",
                    "label": 0
                },
                {
                    "sent": "And algorithms.",
                    "label": 1
                },
                {
                    "sent": "Whose regret what I called variational or they call it fundamental regret bounds which depend on the variation of the data.",
                    "label": 0
                },
                {
                    "sent": "So not only on the number of training iterations, which is sort of a rough bound, but something more delicate that takes the data into account.",
                    "label": 0
                },
                {
                    "sent": "The motivation came from statistics that actually if we do assume some statistical assumptions on how the data is formed, how these these returns of market are formed in this case, then we can actually come up with tighter bounds or step known statistical algorithms that can come up with tighter bounds and regret as we know it handles.",
                    "label": 0
                },
                {
                    "sent": "The worst case makes no assumptions at all.",
                    "label": 0
                },
                {
                    "sent": "So that was the motivation to interpolate somehow between stochastic and worst case.",
                    "label": 1
                },
                {
                    "sent": "And indeed I mean theorem.",
                    "label": 0
                },
                {
                    "sent": "Move such a bound so if we.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So there are some TR return vectors as I defined previously.",
                    "label": 0
                },
                {
                    "sent": "And then we give you an efficient algorithm for which the regret is bounded by the logarithm of the total quadratic variation of this return vectors.",
                    "label": 1
                },
                {
                    "sent": "Which are denoted by Q4 quadratic variation somew.",
                    "label": 0
                },
                {
                    "sent": "Here is the mean of all these.",
                    "label": 0
                },
                {
                    "sent": "These returns in the special case that other is fixed the same vector all the time, as in the benign example that we saw them.",
                    "label": 0
                },
                {
                    "sent": "This is 0 so it's not log of 0 then maybe there is a plus one inside there, but it's a constant nevertheless, so indeed in benign settings we get constant regret.",
                    "label": 0
                },
                {
                    "sent": "And more generally, it's logarithm for the quality collaboration, which is always better than log of the number of iterations and hence this is a title regret bound.",
                    "label": 0
                },
                {
                    "sent": "I'll just remark that.",
                    "label": 1
                },
                {
                    "sent": "Actually, our result holds more generally for a setting of online convex optimization, but for the sake of this talk we only consider these.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Folder management application.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "So let me say a few words about the algorithm that actually achieves this bound.",
                    "label": 0
                },
                {
                    "sent": "And the intuition is simple.",
                    "label": 0
                },
                {
                    "sent": "If a sequence has no variation, then we should be able to predict the future very well based upon the fact based upon the past.",
                    "label": 1
                },
                {
                    "sent": "Simply because there is no valuation, right?",
                    "label": 0
                },
                {
                    "sent": "We do not expect a lot of changes in the future.",
                    "label": 1
                },
                {
                    "sent": "So more formally.",
                    "label": 0
                },
                {
                    "sent": "An algorithm which is called fictitious play in economics.",
                    "label": 0
                },
                {
                    "sent": "So follow the leader in machine learning so the following at time T the portfolio we should use is the best portfolio.",
                    "label": 1
                },
                {
                    "sent": "In hindsight, adapting to the data we have seen.",
                    "label": 0
                },
                {
                    "sent": "Plus a small Euclidean regularization which I added here and it's not.",
                    "label": 0
                },
                {
                    "sent": "Completely necessary, it's not necessary actually, but intuitively.",
                    "label": 0
                },
                {
                    "sent": "Use the best portfolio in hindsight, that sort of the algorithm will consider.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let us just say so.",
                    "label": 0
                },
                {
                    "sent": "This is the algorithm that actually achieves the title bound.",
                    "label": 0
                },
                {
                    "sent": "There is simple and intuitive algorithm.",
                    "label": 0
                },
                {
                    "sent": "And let us just get give a little glimpse into the analysis.",
                    "label": 0
                },
                {
                    "sent": "The key to bounding regret for this type of algorithm is stability.",
                    "label": 1
                },
                {
                    "sent": "Namely, how much?",
                    "label": 0
                },
                {
                    "sent": "5 minutes OK. How much does the portfolio change from iteration to iteration Becausw?",
                    "label": 0
                },
                {
                    "sent": "So just intuitively, if it doesn't change at all, it means that we are doing the correct thing and we should not modify the portfolio from one iteration to the next and hence I regret would be very low overall.",
                    "label": 0
                },
                {
                    "sent": "So this is the key.",
                    "label": 0
                },
                {
                    "sent": "Formally the regret can be bounded by some of differences of logarithms of returns.",
                    "label": 0
                },
                {
                    "sent": "The first term is to use the grid.",
                    "label": 0
                },
                {
                    "sent": "The first steps to the gradient bound.",
                    "label": 0
                },
                {
                    "sent": "So here I'll submit the return vector is the gradient rough proportional to the gradient of the logarithmic reward function?",
                    "label": 0
                },
                {
                    "sent": "And then you can even add.",
                    "label": 0
                },
                {
                    "sent": "With a one family to get something proportional to the valuation, not to the returns themselves, so we can subtract the mean of all return vectors and easily see that everything telescopes.",
                    "label": 0
                },
                {
                    "sent": "So just just by adding the mean, everything telescopes.",
                    "label": 0
                },
                {
                    "sent": "So here I did not to mean itself because I do not know it ahead of time, but the mean up to time T. But this doesn't make a big difference, so we have some additional lower order terms.",
                    "label": 0
                },
                {
                    "sent": "So after using this gradient.",
                    "label": 0
                },
                {
                    "sent": "Approximation we can reason about the difference between two consecutive portfolios by their definition.",
                    "label": 0
                },
                {
                    "sent": "So I defined the algorithm.",
                    "label": 0
                },
                {
                    "sent": "It is followed a little type algorithm.",
                    "label": 0
                },
                {
                    "sent": "Do the best in hindsight.",
                    "label": 0
                },
                {
                    "sent": "And using optimality conditions, codes come to call on accepted, which is the result of an optimization problem.",
                    "label": 0
                },
                {
                    "sent": "We can reason about the difference between two consecutive portfolios and show it is proportional.",
                    "label": 0
                },
                {
                    "sent": "Again, to do an inner product between an invocation here and.",
                    "label": 0
                },
                {
                    "sent": "Something that looks like the return vector of the market or the valuation in it.",
                    "label": 0
                },
                {
                    "sent": "I just remarked that the Hessian of these functions is proportional to the son of all outer products of cost vectors so far.",
                    "label": 0
                },
                {
                    "sent": "So this is a nice structure that comes out.",
                    "label": 0
                },
                {
                    "sent": "And using the structure, the sum of quadratic terms here that we see in Step 2, it can actually be written as a generalization of something well known harmonic series.",
                    "label": 0
                },
                {
                    "sent": "So it's a vector generalization of it, and harmonic series behave like logarithms, so.",
                    "label": 0
                },
                {
                    "sent": "So that's something that helps us finally get the logarithm in there.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So this is just in one line.",
                    "label": 0
                },
                {
                    "sent": "For those of you who are interested in more details, please approach me this or my coauthor this evening in the Postal session.",
                    "label": 0
                },
                {
                    "sent": "So the next part is to observe the geometric Brownian motion model.",
                    "label": 0
                },
                {
                    "sent": "And the first observation is that if we fix a trading.",
                    "label": 0
                },
                {
                    "sent": "Let's say one year.",
                    "label": 0
                },
                {
                    "sent": "Then",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Because of the way the bounding this random walk behaves, the original motion behaves, sampling the prices of a certain asset, no matter how frequently you sample it.",
                    "label": 0
                },
                {
                    "sent": "The valuation is going to remain constant.",
                    "label": 0
                },
                {
                    "sent": "If the total duration is fixed, let's say one year.",
                    "label": 0
                },
                {
                    "sent": "So this means that quadratic variation.",
                    "label": 0
                },
                {
                    "sent": "Is almost I can say independent of the trading frequency is the first observation.",
                    "label": 1
                },
                {
                    "sent": "And the second observation is that in assuming, again, this geometric bounding motion model.",
                    "label": 1
                },
                {
                    "sent": "Increasing the trading frequency actually increases the performance of the best constant advanced portfolio.",
                    "label": 0
                },
                {
                    "sent": "So even though it cost about portfolio, therapy was defined generally for the worst case model.",
                    "label": 0
                },
                {
                    "sent": "If we of course it applies to this special case, stochastic assumptions and it improves as we improve as we increase the training frequency, this SLP creature improves its performance.",
                    "label": 0
                },
                {
                    "sent": "And the conclusion is that combining the stronger regret bound and this observation from geometry bounding motion, the conclusions that there existed an efficient portfolio selection algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Touch that.",
                    "label": 0
                },
                {
                    "sent": "If we assume prices behave according to genetic bound in motion.",
                    "label": 0
                },
                {
                    "sent": "It's regret is independent of the operating frequency completely, because of course the regret is logarithmic logarithmic in the quadratic variation, and that's fixed.",
                    "label": 1
                },
                {
                    "sent": "For the relative constant in effect.",
                    "label": 0
                },
                {
                    "sent": "And what what happens if we have a market crash like 1987?",
                    "label": 0
                },
                {
                    "sent": "Well then we still have the worst case bound that doesn't go away.",
                    "label": 0
                },
                {
                    "sent": "That always remains valid and we're still at most logarithmic away logarithmic in the quadratic location away from the best SLP.",
                    "label": 0
                },
                {
                    "sent": "So thank you.",
                    "label": 0
                },
                {
                    "sent": "Running a little late to have time for one question.",
                    "label": 0
                },
                {
                    "sent": "So I'm wondering if the two norm squared in your algorithm is necessary, could you do it with other regularizers like entropy or something like that?",
                    "label": 0
                },
                {
                    "sent": "So actually it's not necessary.",
                    "label": 0
                },
                {
                    "sent": "You can remove it completely and you can plug in any strongly convex function you wish.",
                    "label": 0
                },
                {
                    "sent": "Including verbalization is chosen to optimize the constants in the bound.",
                    "label": 0
                },
                {
                    "sent": "But actually you can get almost any.",
                    "label": 0
                },
                {
                    "sent": "You can put anything else there, and you would still get the same aseptic bounds.",
                    "label": 0
                },
                {
                    "sent": "I think thank you one.",
                    "label": 1
                }
            ]
        }
    }
}