{
    "id": "hu74whzbpu2txebpsltoqia6l2kg7e4f",
    "title": "Stochastic Control as a Non-Equilibrium Statistical Physics: Gauge Invariant Bellman Equation",
    "info": {
        "author": [
            "Vladimir Chernyak, Department of Chemistry, Wayne State University"
        ],
        "published": "Oct. 16, 2012",
        "recorded": "September 2012",
        "category": [
            "Top->Physics->Statistical Physics",
            "Top->Mathematics->Control Theory"
        ]
    },
    "url": "http://videolectures.net/cyberstat2012_chernyak_stochastic_control/",
    "segmentation": [
        [
            "This is like a very diverse audience here with a broad set of expertise, but I think I think I'm still the only one who who represents chemistry, right?",
            "So I would like like presenting like like a very simple like chemists simplistic picture over.",
            "You know how I understand controls, right?",
            "So this."
        ],
        [
            "This is joint work done actually, like over this summer, and it be before me this year.",
            "I mean, you actually not think about control theory, so thank admissions.",
            "Thank you Bird for introducing me to this beautiful sealed.",
            "So it's like as I said, it's a joint work with your ISH mission bird.",
            "And special thanks to my colleagues in Detroit June Klein, who is an algebraic topologist with whom we're doing some work, and my cousins are, is my math student."
        ],
        [
            "OK so are.",
            "I'll be talking about like a simple but very natural generalization of the Bellman equation in the senses, like like Burt was using it in his work, and this generalization actually related with an attempt to deal with currents with current densities, influxes and actually kind of like when you're dealing with fluxes.",
            "You're kind of like forced.",
            "If you're you're dealing with generation functions, you're forced to introduce vector potentials or like gauge fields, and it turns out that apart from the fact that it allows you to control kind of like a more broader set of quantities, it's actually provides with a very natural way, variational way of deriving the Bellman equation.",
            "Now we will be using what we call like Hamiltonian.",
            "Earlier or Kolmogorov approach or like PD approach, which makes life extremely simple, especially when you're dealing was called a regarding control.",
            "When you're looking for long times and everything is stationary, not necessarily equilibrium, but stationary now, so will be or.",
            "Deriving this generalized version of the Bellman equation that possesses gauge symmetry.",
            "And you know the point will be that if you use the current density day and density like averaged over stochastic trajectories, is the basic variables, it turns out is just a variable transformation and or.",
            "The.",
            "Cost to go function.",
            "Turns out to be just a set of LaGrange factors in deriving the in doing variation.",
            "Now we will like talk about the situation when when there is a match between the properties of noise and the properties of the of the cost function where actually or the Bellman equation can be linearized and you know, like it would like.",
            "It was like in a lot of talks here already and then, or we will kind of like show that or.",
            "Again, I mean that there was like here and there at this conference that actually if you want to do something, something, something, or.",
            "On probable to happen on a regular basis that you need to to to to to pay certain price for that and the price is the the logarithm of of the probability of this rare event and it kind of like reminds over like a famous story of Londow who was giving a lecture to engineers and for one hour he was like telling them that engineers are like care about 30% factors of two.",
            "And physicists just think in terms of like orders of magnitude.",
            "And after the election he was paid with cash in the Soviet Union 'cause they wanna checks credit cards or anything and he was like counting money very carefully.",
            "So his host was an engineer.",
            "You know, try to make fun of him saying you're you're doing it so carefully, right?",
            "And I said, I mean, the money is always in the exponent, right?",
            "On the other hand, I mean it's it's.",
            "It's also.",
            "It's also gives these this analogy that actually if you think about like like hapiness or unhappiness about, it's about something very improbable happening on probable gutter and probable bed right?",
            "It's kind of like if you have controls it's very easy to make people happy or unhappy because what you need to people you need to pay the logarithm of this happiness or unhappiness right?",
            "And as far as I know in computer science log is considered to be a constant right?",
            "So, so we'll talk about sequential representations.",
            "Then we'll talk about flux, which is kind of like the current as opposed to current density, which on the other hand you know show it's kind of like.",
            "So you can think about the flux as or angular velocity angular velocity in this system.",
            "And this is kind of like a statistical mechanics notion of what's known algebraic topologist bunker duality.",
            "And again, the panca radial.",
            "It is very simple and very intuitive thinking.",
            "I hope I get like explained like in few words.",
            "Then we'll talk about we'll have time to do this about like cost of equilibrium.",
            "It's about the following thing you mentioned.",
            "You have a system which is in a stationary state, but they have flux in it, so it's not their potential system.",
            "So the question is how much you need?",
            "What kind of costs you need to pay to put the system into equilibrium?",
            "OK?",
            "And then I'll talk a little bit about like time dependent gauge invariant blve.",
            "Quations like more or less to set up the stage for the following missions talk.",
            "Who will be like more or less?",
            "Yeah, we'll be talking more about like the pure formalism, and Michelle will be kind of like applying this formalism to find that establish like a relationship between controls and fluid mechanics."
        ],
        [
            "So.",
            "Did the setting is pretty standard.",
            "We're considering a longeron process.",
            "Where were, you know F is some deterministic force or vector field?",
            "It's over them and you is the control field sizes the noise, and we can write this correlation function of this Gaussian noise in some kind of like naive way.",
            "But you can always.",
            "Also, you know if you want to do the calculations you want to do the.",
            "Regularization and the regularization we're using.",
            "If we are like looking at it like from physics viewpoint and by the way, I like the work we've done where we actually have like a physics version, Anna probability theory version.",
            "And, you know, I learned a lot from your ish about probability theory like in an Brownian motion so.",
            "And it turns out that there is like a very simple way to introduce regularization, which actually turns out to be this turtle noise regularization and what I learned.",
            "Again, that's true knowledge.",
            "Regularization is not not only like.",
            "Kind of like it's the one that favored by physicists, but it turns out that this is the only regularization which is coordinate free, so this is only regularization.",
            "You can formulate in some kind of like an invariant way and the way one of the ways to formulate it you you do the discretization of time looking at small time increments of epsilon.",
            "And then you're saying that you have this differential equation.",
            "And the random true is represented by a vector field which actually depends on X&T.",
            "However, the dependence on T is very simple on each time segment of the length epsilon.",
            "It's time independent, so it changes.",
            "Justin jumps and then you have actually this representative she a on each time segment and we have the correlation function which gives her.",
            "The value of of quadratic correlation to be proportional to the inverse of the time increment, and then it turns out that using this properties like like marginal properties of the Wiener measure, you can actually show that kind of like all or like sticky stick integrals that are defined like using probability theory can be can be considered as as a limit of such a scheme.",
            "When epsilon goes to zero and this is like a rigorous result.",
            "In F, with the upper and lower, he's OK.",
            "It's a very good question.",
            "Thank you.",
            "So what we actually have here we have this.",
            "We're actually considering dynamics on an arbitrary manifold.",
            "So now when you have the correlation properties of noise, I mean, you can think about it as a metric, right?",
            "And again, uh, it's kind of like doesn't mean that your space is curved.",
            "It's kind of like the properties of noise introduced like natural, introduced the courage right?",
            "So now you when you're talking about.",
            "I bought like Upper and lower indices.",
            "It's about vectors and covectors right?",
            "So if we think about about about about the velocities, the velocities are vectors, right?",
            "For example, forces are covectors.",
            "It's kind of like our linear functionals on vectors, and this is like a way how physicists like, especially in like like in classical gravity are dealing with, with the difference between vectors and covectors.",
            "So like upper indices.",
            "Correspond to to vectors.",
            "Lower indexes correspond to covectors, and you're like if you have like a Riemann metric and on the generate metric.",
            "If elika metric like a scalar product in the vector space, it creates like an isomorphism between the vector the vectors and covectors to create symmetric in the core vector space, and so like like how it feels the same and you can use this metric to to lift.",
            "Subscripts superscripts in vice versa.",
            "So now."
        ],
        [
            "No.",
            "The gauge invariant cost functional, so it's a course functional that depends on a stochastic trajectory, and it has three terms.",
            "The first term is kind of like the standard terms that is like proportional to the square of the control field, and the square is defined with respect to this kind of like position dependent matrix H which will which which form like another metric which not necessarily can side with the metric that describes the noise.",
            "But we will consider the special case when this minimum with those two metrics are proportional.",
            "This is exactly the case.",
            "When are the Bellman equation can be can be turned into a linear equation by an exponential representation.",
            "OK, so this is the first term, the second term.",
            "I represent is represented by some kind of like a potential function, and this is kind of like.",
            "The course functional that yes.",
            "This is.",
            "So here's an edge effects of team.",
            "And then after their parents is opening, where is the time here is what is edge multiplying with this kind of work it's you know, I I'm I'm not sure I did it like correctly, so HX on the tensor product review and you.",
            "It's kind of like it's a bilinear form on the velocity.",
            "OK translation of gij yes yes.",
            "She said.",
            "Riemannian metric with.",
            "Vietnam.",
            "Yeah.",
            "I'm bad with parenthesis.",
            "Sorry and then there is an additional term that is represented by vector potential.",
            "And this is an integral of vector potential, like looks like scalar product with X dot.",
            "And this is a like kind of like it, like a standard term known in physics when you will when you put when you put it in LaGrange are form, then a kind of like represent the vector potential of the magnetic field.",
            "So now this is very natural form because you see like like V has his head has has a meaning, our scalar potential and which is related to densities.",
            "Right now the the variable which is dual to the current densities to occurrence is the vector potential.",
            "It's kind of like it's almost like a very natural if you talk about densities, right?",
            "You want to look at the evolution of the entities and evolution of dense is described in terms of the continuity equation, so so the they're kind of like the considering currents together together with dentists are very very natural thing.",
            "And we'll see how how, how easy it makes to deal with with the with the Bellman equation."
        ],
        [
            "So a little bit about about about current fluxes and current densities, because this is actually the trigger does to consider to consider this occurrences additional variables which makes the considerations so easy.",
            "So actually like currents, if you think about it as flux, is there really like like topological in nature?",
            "I mean to have like a current as you can have like a current density in a system that does not have.",
            "Have nontrivial cycles, 1 dimensional cycles, but if you want to have a flux, we want to have a flux.",
            "Even like in the simplest electrical current like like like in high school when you have like a battery and resistance right, you have a nontrivial cycle and you can think about about like current in two ways.",
            "You can think about current like if you look at that at the at the motion of our single particle is how many times it goes over the cycle and you need you need to calculate it like you using this site.",
            "For example, we go twice.",
            "In this direction, backwards one, it's one right?",
            "And then if you kind of like take take take a stochastic trajectory and enlarge tiles because I mean it whines like a lot of times you can think about this stochastic trajectory as as as a close trajectory is a cycle you can actually.",
            "Define some kind of of angular velocity which tells you how many times basically, take how many times it went through the cycle and divided by time.",
            "For example, if you have like 3 cycles like with two cycles like in the tourist, you'll have like 2 components of Angular velocity.",
            "On the other hand, you can think about this as a flux because what you can do for any for any like 1 dimensional cycle you can figure out like a cycle, like a hypersurface, is cycle of codimension one.",
            "And count how many times the trajectory pinched this codimension one cycle.",
            "And again like considering with this sign, direction is important and this is what in topology called an intersection index and the intersection index depends really only on the topological properties of to psych.",
            "So if you deform if you deform like a 1 dimensional trajectory continuously, or if you deform, you know the hypersurface.",
            "Through which you know you're looking like continually calculating the pinching the intersection index, which is like the number of intersection that takes into account design does not change, and in this way you can.",
            "Fix the endpoints.",
            "Yes, a actually what they said I would I said.",
            "I mean I am looking for four for a closed for close to 1 dimensional cycle because like jittering but when you have like a very long line right?",
            "You can actually use a geodesic to close it.",
            "And whether you're making an arrow of the order of plus minus one, whereas the total winding number is usually proportional to time.",
            "But you're absolutely right, you either you either fix fix the endpoints or you.",
            "You make it.",
            "You make it close and this is not like like what what do we call like at Lat long times?",
            "This stochastic trajectories are are are like probabilistically close.",
            "OK so.",
            "And or this is kind of like the notion of concrete duality, because you know, you can.",
            "You can look at the cycle in terms of how many times you go over the divining number, or you can look at the current density and calculate the integral of the current density over the over the over the over the section and obtain the same number."
        ],
        [
            "So the the simplest example is the particle in a circle.",
            "It's kind of like understandable how it goes.",
            "More more complex example is like a tourist, so we have like 2 cycles like that and like that right and they have cross sections for this cycle across section goes like this and for this cycle the cross section goes like that right?",
            "No, they're all."
        ],
        [
            "More like complicated examples, but sometimes you can have like a system, a system or with very large almost like infinite number degrees of freedom, like for example like in elastic Band on on a sphere.",
            "However, the flux is really kind of like.",
            "The complexity of life flow of the flux is given by kind of like the number of independent 1 dimensional cycles and for example for the case of this elastic band on interdimensional sphere you have only one topological on trivial 1 dimensional cycle and then so you have only one component of the current.",
            "So."
        ],
        [
            "No, is like Pablo was talking about.",
            "There is a large division theory for currents and for current densities so that the kind of the distribution function for say for the fluxes with for the current densities is represented by by this large deviation law.",
            "And here we have the large deviation function or the criminal function that describes the statistical properties.",
            "Of the current and will show that at the matched case.",
            "If you want to control the current, so actually are the cost, the rate, the cost rate you need to pay is proportional to the large deviation function and this is this money in the exponent principle.",
            "OK."
        ],
        [
            "So no, there is.",
            "There is this notion of.",
            "Current density in the city.",
            "If you have like a process with stochastic trajectories which actually kind of like if you want to to find the density you you choose, choose some small small region in this PIN configuration space and you know kind of like each trajectory spends a certain percentage of time there and this is the contribution to the density of this trajectory.",
            "Then you average over stick trajectories.",
            "You obtain the density and for stationary process.",
            "It's just a distribution, right?",
            "And the same thing you can do with the currents by kind of like doing the same thing with the with the with the small region.",
            "But what you need to do you need also like for each trajectory you need to multiply the time it spent there with the velocity.",
            "So you have like.",
            "Vector Field, which is the current distribution of current.",
            "OK."
        ],
        [
            "No, probably."
        ],
        [
            "Skip the singing."
        ],
        [
            "It's like about how you can really like calculate this.",
            "These distributions in the case of low noise.",
            "So now we will be using the PD approach.",
            "We can drive in various ways more rigorous, less rigorous, but you do do it right.",
            "You obtain the same result an in the case of are in the case of, like what's called control.",
            "When the times are, you know much longer than the collaboration time for the system, then you have this kind of like for each of these three terms.",
            "In the course functional, if you average them over the statistic trajectories, they kind of like behave like their typical behaviors, like proportional to time and the kind of like the the limit of T -- 1 times.",
            "The average is well defined quantity and is naturally described in terms of the.",
            "Average density role and average current density G of X.",
            "Now the stationary keys ruin G can be found by solving the.",
            "For your Planck equation, the stationary focal point equation on probability literature, it's called the Kolmogorov equation.",
            "So actually, or this is the focal point equation for the stationary state, and this is the expression for the current density in terms of the density and the parameters of the theory, so now.",
            "The actually kind of like the way we will look at this cost functional, which we call the gauge invariant cost functional that contains this vector potential.",
            "Of course that there are ways to think about that.",
            "It's really kind of like a cost function.",
            "Well, when you're trying to minimize to minimize the cost which is given by the square of the vector field plus plus something which you are trying to achieve.",
            "So you want to like to get like some kind of a compromise.",
            "Or like like like as people say in the United States consensus, right?",
            "It's very nice word for that.",
            "On the other hand, you can look at it like in a different way.",
            "You can look at this additional terms is LaGrange factors.",
            "So actually you're seeing you are really looking at the cost at the integral of the square field over stochastic trajectory.",
            "But you know what you want, what you want to you want to control?",
            "You want to control?",
            "Certain quantities that are linear in the in the density and in the current density, like a, like a quantity that is linear in the in the in the density, is in an integral of the density with some potential.",
            "It's kind of like a kind of like a problem like our optimization.",
            "Imagine that you want to go in point A to point B and during your way you're exposed to something which is not nice like radiation, right and.",
            "You want you want to pay the minimal cost, right?",
            "But you you're allowed to accept only certain amount of radiation, right?",
            "So you're asking the question.",
            "What should be your control field to achieve that?",
            "So it's kind of like it's a problem that can be solved using like the stairs Bellman equation when you think about this potential V scalar potential is LaGrange multiplier, so it's basically gives you the rate how much radiation you're getting at each point in your configuration space.",
            "Right now the additional term with this vector potential allows you to consider like a broader.",
            "A broader set of quantities, one of them which actually involved involved involved in velocity.",
            "One of this quantity like like there is a bunch of quantities like work produced on the system like heat produced by the system, like like the entropy produced and this can be done by by by by considering like setting this vector potential A to the force field.",
            "On the other hand there is like another application.",
            "If you want to control kind of like the average angular velocity, then then you know you can use this vector field's LaGrange multiplier that controls the flux, and then I'll talk like a little bit about about it.",
            "In this case you need to choose the vector potential that is locally purely gauge, so it's locali.",
            "It's locali a gradient, but if you have like a nontrivial 1 dimensional cycle, even though you have like a local.",
            "Gradient field it's not a global gradient as long as the integral of the vector potential over nontrivial cycle is is non zero.",
            "And actually it's kind of like you can see that there is a mesh there right?",
            "Because the number the number of.",
            "Independent non contracted, non contractible cycle is exactly kind of like described by the number of this locali gauge vector potentials which are in the very differential geometer called closed differential forms factor gations formation, which is adding a gradient OK.",
            "So.",
            "Anyway, we are kind of like drawing.",
            "To optimize, like in using one philosophy or the other philosophy, we are trying to optimize the average value over the stochastic process of the cost function.",
            "And.",
            "And or.",
            "Very this is a page acting on the space of densities gauge invariant.",
            "I'll show that these these these these functional this cost function the average value of the cost functional right is gauge invariant in the sense that if you add a gradient to the vector field.",
            "The rate kind of like the cost rate does not change.",
            "Just like it, it's a typical.",
            "It's like like gauge invariance in electrodynamics, right?",
            "If you think about a as vector potential negative in a mix.",
            "Does it answer a question?",
            "OK, I will try to talk about it a little bit more so now.",
            "Sexually the quantization here or to get integer solutions and.",
            "No.",
            "No, there are some effects of quantization if you if you look at that.",
            "You know at low noise limits in systems we will share periodically driven.",
            "We can talk about it but but here it's it's an unknown organization because because you see it's kind of like the the flux.",
            "The flux is is basically an integer number of rotations right divided by time, so generally it's like it's a real number serial number now so.",
            "And I think about about, you know, this representation is that if you look at the like figure Planck equation expression for the curve, you can see that the expression of the current allows you to express the.",
            "Control field you, in terms of gender or.",
            "Which means that if you are trying to control.",
            "Not just some flux, some work, or some like a couple of quantities, but you're trying to control like a lot.",
            "You're trying to control the average density and the average current density.",
            "You have actually an analytical formula for the cost, right?",
            "Because what you do you have the square of the of the control field you express it in terms of GN rule and you're there.",
            "Black calendars with K is Kappa cuppa cuppa is is it characterized the noise strength.",
            "It is dated to concerts.",
            "Memorial is like cables Monty.",
            "Because it would be good.",
            "Problem with a drift and a noise generation noise and actually actually you know it's kind of like the way you know we're trying to think about it.",
            "This metric G right?",
            "It's basically characterizes the viscosity in in the in the, in the in the overtime case right?",
            "Because because you have XXX dot is equal to some velocity which this velocity actually force divided by viscosity.",
            "Right now if you're Beth which you eliminate it.",
            "Stopped in your your like reduce description is at equilibrium that there is a fluctuation dissipation relation right?",
            "There are likely Einstein relation which says that actually the metric of noise is keyboards.",
            "Monte Times times the metric of of damping, right?",
            "So we're actually like put like keeping this Copa explicitly to be able, I mean to to play with the strength of noise relative to viscosity.",
            "No, no did they say OK?",
            "This system OK, I'm thinking about say I'm thinking about the Fokker Planck equation right?",
            "As a result of considering our system coupled to some bath.",
            "OK, so the system itself is not ridiculously is not an equilibrium system.",
            "It's not a gradient but the birth.",
            "But the birth is considered to be to be at Equilibrates.",
            "It's not you, you don't have to do it.",
            "What is the bath?",
            "Is some dynamical system right coupled with a large number of degrees of freedom, weakly coupled Thor system with the property that the relaxation time of the bath is very short compared to typical timescale in the system?",
            "Dimension or recalled into folders complex.",
            "Yeah.",
            "Yeah, yeah, it's kind of like you.",
            "You don't have to work in in compact manifolds, but then you need to make sure that your your your direction field has certain properties.",
            "These just think is just to say it's it's compact and oriented by the way.",
            "Myologie so that.",
            "Is close but not exact forms.",
            "Yeah, if you're OK if you're talking about fluxes, right?",
            "I'm not talking about fluxes only because.",
            "OK, for example if I want to to to to control the entropy production or I want to control the heat released to the bath, right then a would be actually the forcefield of the system.",
            "It it it, it's it's.",
            "It's not this formalism.",
            "It's not limited to fluxes.",
            "Fluxes is kind of like a nice application which actually triggered, you know.",
            "This thing that we introduced the vector potential, but you're absolutely right if you want to have fluxes right, you need to make sure we have the nontrivial first homology.",
            "But the only thing distinguishes be from a.",
            "Is the fact that A is closed and not exact?",
            "No no.",
            "OK, actually, like generally we consider a as as an arbitrary 14.",
            "However, if we want to apply this.",
            "OK, I'm using.",
            "I'm using an FM ISM.",
            "OK, OK vector potential, is it away?",
            "Is a differential one form OK?",
            "Is differential one form so the formalism?",
            "Mixed partials gotta have decent no?",
            "No, if if OK look if I want to work with fluxes right?",
            "If I want to work with boxes then I need to take a with the property D A = 0 In the air.",
            "By the way, gauge invariance means that if I add an exact form right that nothing changes.",
            "So if I'm dealing with closed form in a manifold with the trivial first homology right, then what will obtain I obtain nothing?",
            "Interesting about exactly about closed forms and its natural right because I want to work with fluxes I want I want to have nontrivial one cycles right and then I'll have closed forms that are not exact.",
            "But once again, I mean if I design to control.",
            "The amount of heat produced by this system, which is a reasonable quantity right?",
            "You don't want over here to certain system, right doing certain things right then, instead of a I will use.",
            "The force field is a differential form, and if the system is not a grid in system that this force field will be not a closed form that makes sense.",
            "Objecting to is what you're calling a vector potential OK vector potential vector potential is is or differential form of rank one.",
            "OK.",
            "Think of those.",
            "VVV OK like mathematical, like symmetric is speaking.",
            "V is a smooth function on our manifold.",
            "A is one form on our manifold.",
            "There absolutely not connected.",
            "OK. Once no, no.",
            "Once again a differential form does not have to be closed, right?",
            "But if you look if you want to count the flux, what you want to do, you want the trajectories that are like like, like, topologically equivalent you, you want them to be weighted.",
            "Or with the same factor.",
            "This is why you're using across 4, because I mean if there are two like Hama logically equivalent projectors right by the stock steering if you want.",
            "If I want to do the fluxes, but I'm saying it's it's not limited to the fluxes, OK, flux is my favorite example.",
            "OK, so anyway you can like.",
            "Extract you from.",
            "The current density and and just usual density right?",
            "Which means that you can.",
            "Actually think about it.",
            "It's transformation of variables.",
            "Instead of thinking in terms of the control fields control vector fields, you're thinking in terms of the density and current density, like averaged over over sarcastic projectors and at long times you can think of them as as independent variables.",
            "Of course, I mean you, you need to have the divergents of J = 0 because you know in a stationary process they average density is not changing, but the diverse is J = 0 exactly concise with the focal point equation is just another way to to represent the focal point equation.",
            "OK."
        ],
        [
            "So.",
            "You introduced the.",
            "The rate of the cost to go functional over a long time and then you immediately obtain like like like like a very natural formula.",
            "For for this rate, which is given by basically averaged over over over.",
            "Averaged over the.",
            "Random process of the square of the vector field on the square of the vector field.",
            "The vector field is expressed in terms of Ryan G. OK, so now when you want to get like an optimal solution, what you need to do.",
            "You just need to minimize this function with respect to current density density with the natural constraints that the density the integral of the density is 1.",
            "The conservation of probability and the divergents are of the current density 0, so the way you do it, like a natural way is just to introduce LaGrange factors.",
            "So there is 1 LaGrange factor.",
            "We called Lambda here for this constraint.",
            "And then this is a functional constraint.",
            "So we introduce electrons factor for the for this constraint which.",
            "Recall five OK.",
            "So now after that you kind of like and can do like the trivial math."
        ],
        [
            "And you need to to make like a couple really really well like trivial transformations, but the result of this kind of like minimization of dysfunctional will reproduce an equation for five.",
            "And the expression for the for the control field in terms of this of this LaGrange function, LaGrange factor Phi.",
            "Now, if you set the vector potential A to zero, you will recognize kind of like the standard Bellman equation, where five is the cost to go function, right?",
            "It's kind of you recognize the stationary form of the Bellman equation.",
            "And here you'll you'll recognize the famous form that the the control field is the gradient of the cost function.",
            "Now the way how it appears here.",
            "And this is something which is nice about gauge theories.",
            "I mean, if you introduce the gauge field, what you need to do, you need to what people say to elongated derivative, right?",
            "Kind of like when you have like a usual derivative, you always add the gauge field vector field here.",
            "And actually if you look at the expression you see that you take the standard like well known equations.",
            "Someone equation the relation and like each time we have like a derivative of fire, you add A and this is how it works.",
            "So once again it's generalization of the equation like people were dealing with and kind of like when you deal with with an extended set of variables you see that there is kind of like a 1101 type of derivation of this equation using like simple variational arguments.",
            "OK."
        ],
        [
            "You're assuming the existence of an invariant measure, and that's usually a hard question.",
            "I'm a physicist.",
            "Yeah, on the compact space actually your issues are like probability theory expert and I think everything is fine there, right?",
            "Do you have an example with this?",
            "Yeah, like for example, you can let the simplest problem you you can think about that they have like a particle in circle, right?",
            "For example it can be even even even in the.",
            "Gradient case like a potential and you want you want you want you want to mean it, you you want to use the control field to make it like like move at a certain angle of lost like an engine, right?",
            "And you're asking what was the least expensive way to do that.",
            "So then you can actually do this.",
            "Vision.",
            "Caulfield no generated.",
            "I think I think I think.",
            "I think there are there are applications.",
            "No, like about gauge invariance, right gauge invariance?",
            "Well I like like like really means that if you add a gradient to the vector potential Lambda which which represents the.",
            "Cost the optimal cost rate doesn't change right here and now there is like an interesting thing.",
            "What happens with fire when you add like a gradient.",
            "It does change, but in the sum like prescribed and very reasonable way right?",
            "And what this really means is for us you can think about five in the following way.",
            "If you look at long times and you look look at the at the at the optimal cost function, the deleting term will be proportional to time.",
            "Right, and it's it's given by the rate, but the next term, the next term will be time independent and the higher order terms.",
            "In the case of a compact manifold an if we kind of like believe that the spectrum of this like Twisted Fork, are planning operators still discrete, and I think that there should be like some theorems about that.",
            "Yes, it's actually yet OK anyway.",
            "Then the other terms will decay exponentially, where like that this exponent is given by the gap in the spectrum, right?",
            "So now you can show that Phi represents this time independent component of the cost function of the long Times Now.",
            "In this time time, independent component will depend on the point where were your trajectory start.",
            "So if you if you make a guy's transformation, of course.",
            "I mean you you add that this term which is given by by by by this value 5 at the point of the starting trajectory.",
            "So it's really like very reasonable gauge invariance and this is the kind of like a Lagrangian or stochastic.",
            "As of state, right of X.",
            "What is the function of state?",
            "The costs of the constant, the cost will go customer.",
            "Function, I know that they did not know that the optimal optimal function of state were in state the.",
            "What is X?",
            "The initial point?",
            "This case maybe he's got an equilibrium situation.",
            "How many liberal situation, right?",
            "Do you have an optimal density which depends on state?",
            "Also not yeah, but this is stacia.",
            "You you do it in a stationary state right?",
            "Because we do it at long times it's regarded control right?",
            "I'll talk a little bit about the time dependent Bellman equation given variable in equation.",
            "Yeah, did did not know it.",
            "It does depend on the state, of course right there, but it depends on the stationary state, right?",
            "You you change you change your your your like like forcefield.",
            "You'll get a different state but the gauge invariance still there.",
            "This makes sense.",
            "Gauge invariance is always there."
        ],
        [
            "No exponential representation in the case of the match between the noise properties in the cost properties, like it's done like in a standard way.",
            "And here you go.",
            "You can really see you know this kind of like a long gated derivatives in a very nice way.",
            "So you add minus QAJ times.",
            "To add it to the derivative and you can think about Q.",
            "If you like, think about like analogies.",
            "Would like to dynamics is the charge.",
            "And here like the role of Church is displayed by by by, by the ratio of the of the of the noise metrics in the cost metrics.",
            "Yeah, I know I'll wrap it up.",
            "OK, so."
        ],
        [
            "No, the money exponents Inc. OK, so now if you if you're drawing like like to control like Jinro right you you need to set A to zero and videos here, right?",
            "And what you're obtaining?",
            "You're obtaining the following expression for the for the.",
            "Optimal rate of the coast rate function, on the other hand, there is such a thing.",
            "It's called the functional of density and current density, which says that if you have like a stationary process and you're looking at that they had the probability distribution of the density and current density.",
            "It has large deviation form over which is described by by by the by the primary function and this primary function is like a little bit like more involved calculations Pablo noted at his talk, but he actually obtained the same.",
            "The same result OK after coefficient.",
            "So what you see that in the matched case the rate of the cost to go is given by by the.",
            "Fudge factor times the grammar function, which is the log of the probability at long times, so this is the money in the exponent think.",
            "So."
        ],
        [
            "So."
        ],
        [
            "OK, let me just say I have only 5 minutes.",
            "Optimal cost of equilibrium.",
            "OK, no, you using the density and current density.",
            "It's very easy to talk about.",
            "Like what does it mean about the system is at equilibrium systems equilibrium.",
            "By the way, it means that you know when you add this control field, U2F your total force field, which is U plus there should be a gradient, right?",
            "But here you you can let me say it like in like in an easier way is the situation when the current density is 0.",
            "So this is equilibrium, right?",
            "So kind of in the in the Fokker Planck equation, which is divergent.",
            "J is equal 0 in the equilibrium case.",
            "It is like a very special solution, G = 0.",
            "So if you want to talk to find the rate of the cost, you just use this functional.",
            "And said J to zero and then you make you make.",
            "Representation of raw equals PSI squared and after like like integrating by parts, you're obtaining a functional where this is some kind of like an effective, potentially effective potential is the square of the velocity field plus the it's an invariant for one of the ways to write the divergences.",
            "And or it's like a well known thing that if you like if you are minimize this functional with the interval upside squared equals one, it's equivalent to finding the ground state of assuring Griqua shun where copper is deploying constant.",
            "Use the potential so this this another another another another another another.",
            "Example of how quantum mechanics appears in stochastic processes.",
            "And."
        ],
        [
            "Finally, like a couple.",
            "Words about that the time dependent gauge invariant Bellman equation can be derived in an absolutely similar way.",
            "You you need to write.",
            "Kind of like if you do this kind of like PD you need to write down APD equation which is time dependent and or again I mean you're using the expression for the current which depends on time.",
            "So you can describe the time dependent vector field in terms of the density and current density which is time dependent.",
            "You plug it in.",
            "Uptain the functional then."
        ],
        [
            "Kind of like introduce the LaGrange factor here and after like doing iteration and it like very simple way you end up with the.",
            "Billman equation, which is like different from kind of like let me call the standard Billman equation.",
            "But by eliminating the derivative.",
            "Enter."
        ],
        [
            "Or so this is this is this is the gauge symmetry for the time dependent independent?",
            "Build an equation and you see that the scalar potential admits, admits the time derivative of the field fee that describes the gauge transformation.",
            "So this is like, again, I mean, it's like like what happens in electrodynamics when you look for the gations formation transformations which are actually time dependent.",
            "And again in the match.",
            "In case you you reproduce the linear equation, which again just don't get the derivative.",
            "He and."
        ],
        [
            "This is kind of.",
            "In natural summary and thank you very much for attention.",
            "The case that the space is simply connected single coming so trivial.",
            "What happens then that there are no fluxes and then looking at you you cannot control fluxes because there are no fluxes.",
            "However, for example, you can add the question.",
            "About you know what?",
            "What's the minimal cost of like minimizing the heat produced by the system, or maximizing the work produced on the system, right?",
            "Engaging the weight completing this.",
            "OK, in in this case, if you're talking about like wanted, just like like entropy production work produced, then a field the A is equal to F. For a, you just use the force field.",
            "It's kind of like.",
            "There are like some more applications, but like like I was talking like like clearly about two like one is when a is equal to F. Write an F in the key.",
            "In the case of.",
            "Non equilibrium system is not is not is not the gradient field right?",
            "It can be like anything and the second example it's about fluxes, right?",
            "So you cannot talk about flux if you don't.",
            "If you don't have non contractible cycles.",
            "So here you don't have non contractible cycles.",
            "Forget about fluxes.",
            "Forget about the politics.",
            "Forget about everything interesting right so?",
            "I'm exaggerating, of course."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is like a very diverse audience here with a broad set of expertise, but I think I think I'm still the only one who who represents chemistry, right?",
                    "label": 0
                },
                {
                    "sent": "So I would like like presenting like like a very simple like chemists simplistic picture over.",
                    "label": 0
                },
                {
                    "sent": "You know how I understand controls, right?",
                    "label": 0
                },
                {
                    "sent": "So this.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is joint work done actually, like over this summer, and it be before me this year.",
                    "label": 0
                },
                {
                    "sent": "I mean, you actually not think about control theory, so thank admissions.",
                    "label": 0
                },
                {
                    "sent": "Thank you Bird for introducing me to this beautiful sealed.",
                    "label": 0
                },
                {
                    "sent": "So it's like as I said, it's a joint work with your ISH mission bird.",
                    "label": 1
                },
                {
                    "sent": "And special thanks to my colleagues in Detroit June Klein, who is an algebraic topologist with whom we're doing some work, and my cousins are, is my math student.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK so are.",
                    "label": 0
                },
                {
                    "sent": "I'll be talking about like a simple but very natural generalization of the Bellman equation in the senses, like like Burt was using it in his work, and this generalization actually related with an attempt to deal with currents with current densities, influxes and actually kind of like when you're dealing with fluxes.",
                    "label": 0
                },
                {
                    "sent": "You're kind of like forced.",
                    "label": 0
                },
                {
                    "sent": "If you're you're dealing with generation functions, you're forced to introduce vector potentials or like gauge fields, and it turns out that apart from the fact that it allows you to control kind of like a more broader set of quantities, it's actually provides with a very natural way, variational way of deriving the Bellman equation.",
                    "label": 0
                },
                {
                    "sent": "Now we will be using what we call like Hamiltonian.",
                    "label": 0
                },
                {
                    "sent": "Earlier or Kolmogorov approach or like PD approach, which makes life extremely simple, especially when you're dealing was called a regarding control.",
                    "label": 0
                },
                {
                    "sent": "When you're looking for long times and everything is stationary, not necessarily equilibrium, but stationary now, so will be or.",
                    "label": 0
                },
                {
                    "sent": "Deriving this generalized version of the Bellman equation that possesses gauge symmetry.",
                    "label": 1
                },
                {
                    "sent": "And you know the point will be that if you use the current density day and density like averaged over stochastic trajectories, is the basic variables, it turns out is just a variable transformation and or.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Cost to go function.",
                    "label": 0
                },
                {
                    "sent": "Turns out to be just a set of LaGrange factors in deriving the in doing variation.",
                    "label": 0
                },
                {
                    "sent": "Now we will like talk about the situation when when there is a match between the properties of noise and the properties of the of the cost function where actually or the Bellman equation can be linearized and you know, like it would like.",
                    "label": 0
                },
                {
                    "sent": "It was like in a lot of talks here already and then, or we will kind of like show that or.",
                    "label": 0
                },
                {
                    "sent": "Again, I mean that there was like here and there at this conference that actually if you want to do something, something, something, or.",
                    "label": 0
                },
                {
                    "sent": "On probable to happen on a regular basis that you need to to to to to pay certain price for that and the price is the the logarithm of of the probability of this rare event and it kind of like reminds over like a famous story of Londow who was giving a lecture to engineers and for one hour he was like telling them that engineers are like care about 30% factors of two.",
                    "label": 0
                },
                {
                    "sent": "And physicists just think in terms of like orders of magnitude.",
                    "label": 0
                },
                {
                    "sent": "And after the election he was paid with cash in the Soviet Union 'cause they wanna checks credit cards or anything and he was like counting money very carefully.",
                    "label": 0
                },
                {
                    "sent": "So his host was an engineer.",
                    "label": 0
                },
                {
                    "sent": "You know, try to make fun of him saying you're you're doing it so carefully, right?",
                    "label": 0
                },
                {
                    "sent": "And I said, I mean, the money is always in the exponent, right?",
                    "label": 1
                },
                {
                    "sent": "On the other hand, I mean it's it's.",
                    "label": 0
                },
                {
                    "sent": "It's also.",
                    "label": 0
                },
                {
                    "sent": "It's also gives these this analogy that actually if you think about like like hapiness or unhappiness about, it's about something very improbable happening on probable gutter and probable bed right?",
                    "label": 0
                },
                {
                    "sent": "It's kind of like if you have controls it's very easy to make people happy or unhappy because what you need to people you need to pay the logarithm of this happiness or unhappiness right?",
                    "label": 0
                },
                {
                    "sent": "And as far as I know in computer science log is considered to be a constant right?",
                    "label": 0
                },
                {
                    "sent": "So, so we'll talk about sequential representations.",
                    "label": 0
                },
                {
                    "sent": "Then we'll talk about flux, which is kind of like the current as opposed to current density, which on the other hand you know show it's kind of like.",
                    "label": 0
                },
                {
                    "sent": "So you can think about the flux as or angular velocity angular velocity in this system.",
                    "label": 0
                },
                {
                    "sent": "And this is kind of like a statistical mechanics notion of what's known algebraic topologist bunker duality.",
                    "label": 0
                },
                {
                    "sent": "And again, the panca radial.",
                    "label": 0
                },
                {
                    "sent": "It is very simple and very intuitive thinking.",
                    "label": 0
                },
                {
                    "sent": "I hope I get like explained like in few words.",
                    "label": 1
                },
                {
                    "sent": "Then we'll talk about we'll have time to do this about like cost of equilibrium.",
                    "label": 0
                },
                {
                    "sent": "It's about the following thing you mentioned.",
                    "label": 0
                },
                {
                    "sent": "You have a system which is in a stationary state, but they have flux in it, so it's not their potential system.",
                    "label": 0
                },
                {
                    "sent": "So the question is how much you need?",
                    "label": 0
                },
                {
                    "sent": "What kind of costs you need to pay to put the system into equilibrium?",
                    "label": 0
                },
                {
                    "sent": "OK?",
                    "label": 0
                },
                {
                    "sent": "And then I'll talk a little bit about like time dependent gauge invariant blve.",
                    "label": 0
                },
                {
                    "sent": "Quations like more or less to set up the stage for the following missions talk.",
                    "label": 0
                },
                {
                    "sent": "Who will be like more or less?",
                    "label": 0
                },
                {
                    "sent": "Yeah, we'll be talking more about like the pure formalism, and Michelle will be kind of like applying this formalism to find that establish like a relationship between controls and fluid mechanics.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Did the setting is pretty standard.",
                    "label": 0
                },
                {
                    "sent": "We're considering a longeron process.",
                    "label": 0
                },
                {
                    "sent": "Where were, you know F is some deterministic force or vector field?",
                    "label": 0
                },
                {
                    "sent": "It's over them and you is the control field sizes the noise, and we can write this correlation function of this Gaussian noise in some kind of like naive way.",
                    "label": 0
                },
                {
                    "sent": "But you can always.",
                    "label": 0
                },
                {
                    "sent": "Also, you know if you want to do the calculations you want to do the.",
                    "label": 0
                },
                {
                    "sent": "Regularization and the regularization we're using.",
                    "label": 0
                },
                {
                    "sent": "If we are like looking at it like from physics viewpoint and by the way, I like the work we've done where we actually have like a physics version, Anna probability theory version.",
                    "label": 0
                },
                {
                    "sent": "And, you know, I learned a lot from your ish about probability theory like in an Brownian motion so.",
                    "label": 0
                },
                {
                    "sent": "And it turns out that there is like a very simple way to introduce regularization, which actually turns out to be this turtle noise regularization and what I learned.",
                    "label": 0
                },
                {
                    "sent": "Again, that's true knowledge.",
                    "label": 0
                },
                {
                    "sent": "Regularization is not not only like.",
                    "label": 0
                },
                {
                    "sent": "Kind of like it's the one that favored by physicists, but it turns out that this is the only regularization which is coordinate free, so this is only regularization.",
                    "label": 0
                },
                {
                    "sent": "You can formulate in some kind of like an invariant way and the way one of the ways to formulate it you you do the discretization of time looking at small time increments of epsilon.",
                    "label": 0
                },
                {
                    "sent": "And then you're saying that you have this differential equation.",
                    "label": 0
                },
                {
                    "sent": "And the random true is represented by a vector field which actually depends on X&T.",
                    "label": 0
                },
                {
                    "sent": "However, the dependence on T is very simple on each time segment of the length epsilon.",
                    "label": 0
                },
                {
                    "sent": "It's time independent, so it changes.",
                    "label": 0
                },
                {
                    "sent": "Justin jumps and then you have actually this representative she a on each time segment and we have the correlation function which gives her.",
                    "label": 0
                },
                {
                    "sent": "The value of of quadratic correlation to be proportional to the inverse of the time increment, and then it turns out that using this properties like like marginal properties of the Wiener measure, you can actually show that kind of like all or like sticky stick integrals that are defined like using probability theory can be can be considered as as a limit of such a scheme.",
                    "label": 0
                },
                {
                    "sent": "When epsilon goes to zero and this is like a rigorous result.",
                    "label": 0
                },
                {
                    "sent": "In F, with the upper and lower, he's OK.",
                    "label": 0
                },
                {
                    "sent": "It's a very good question.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "So what we actually have here we have this.",
                    "label": 0
                },
                {
                    "sent": "We're actually considering dynamics on an arbitrary manifold.",
                    "label": 0
                },
                {
                    "sent": "So now when you have the correlation properties of noise, I mean, you can think about it as a metric, right?",
                    "label": 0
                },
                {
                    "sent": "And again, uh, it's kind of like doesn't mean that your space is curved.",
                    "label": 0
                },
                {
                    "sent": "It's kind of like the properties of noise introduced like natural, introduced the courage right?",
                    "label": 0
                },
                {
                    "sent": "So now you when you're talking about.",
                    "label": 0
                },
                {
                    "sent": "I bought like Upper and lower indices.",
                    "label": 0
                },
                {
                    "sent": "It's about vectors and covectors right?",
                    "label": 0
                },
                {
                    "sent": "So if we think about about about about the velocities, the velocities are vectors, right?",
                    "label": 0
                },
                {
                    "sent": "For example, forces are covectors.",
                    "label": 0
                },
                {
                    "sent": "It's kind of like our linear functionals on vectors, and this is like a way how physicists like, especially in like like in classical gravity are dealing with, with the difference between vectors and covectors.",
                    "label": 0
                },
                {
                    "sent": "So like upper indices.",
                    "label": 0
                },
                {
                    "sent": "Correspond to to vectors.",
                    "label": 0
                },
                {
                    "sent": "Lower indexes correspond to covectors, and you're like if you have like a Riemann metric and on the generate metric.",
                    "label": 0
                },
                {
                    "sent": "If elika metric like a scalar product in the vector space, it creates like an isomorphism between the vector the vectors and covectors to create symmetric in the core vector space, and so like like how it feels the same and you can use this metric to to lift.",
                    "label": 0
                },
                {
                    "sent": "Subscripts superscripts in vice versa.",
                    "label": 0
                },
                {
                    "sent": "So now.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "The gauge invariant cost functional, so it's a course functional that depends on a stochastic trajectory, and it has three terms.",
                    "label": 0
                },
                {
                    "sent": "The first term is kind of like the standard terms that is like proportional to the square of the control field, and the square is defined with respect to this kind of like position dependent matrix H which will which which form like another metric which not necessarily can side with the metric that describes the noise.",
                    "label": 0
                },
                {
                    "sent": "But we will consider the special case when this minimum with those two metrics are proportional.",
                    "label": 0
                },
                {
                    "sent": "This is exactly the case.",
                    "label": 0
                },
                {
                    "sent": "When are the Bellman equation can be can be turned into a linear equation by an exponential representation.",
                    "label": 1
                },
                {
                    "sent": "OK, so this is the first term, the second term.",
                    "label": 1
                },
                {
                    "sent": "I represent is represented by some kind of like a potential function, and this is kind of like.",
                    "label": 0
                },
                {
                    "sent": "The course functional that yes.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "So here's an edge effects of team.",
                    "label": 0
                },
                {
                    "sent": "And then after their parents is opening, where is the time here is what is edge multiplying with this kind of work it's you know, I I'm I'm not sure I did it like correctly, so HX on the tensor product review and you.",
                    "label": 0
                },
                {
                    "sent": "It's kind of like it's a bilinear form on the velocity.",
                    "label": 0
                },
                {
                    "sent": "OK translation of gij yes yes.",
                    "label": 0
                },
                {
                    "sent": "She said.",
                    "label": 0
                },
                {
                    "sent": "Riemannian metric with.",
                    "label": 0
                },
                {
                    "sent": "Vietnam.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "I'm bad with parenthesis.",
                    "label": 0
                },
                {
                    "sent": "Sorry and then there is an additional term that is represented by vector potential.",
                    "label": 0
                },
                {
                    "sent": "And this is an integral of vector potential, like looks like scalar product with X dot.",
                    "label": 0
                },
                {
                    "sent": "And this is a like kind of like it, like a standard term known in physics when you will when you put when you put it in LaGrange are form, then a kind of like represent the vector potential of the magnetic field.",
                    "label": 0
                },
                {
                    "sent": "So now this is very natural form because you see like like V has his head has has a meaning, our scalar potential and which is related to densities.",
                    "label": 0
                },
                {
                    "sent": "Right now the the variable which is dual to the current densities to occurrence is the vector potential.",
                    "label": 0
                },
                {
                    "sent": "It's kind of like it's almost like a very natural if you talk about densities, right?",
                    "label": 0
                },
                {
                    "sent": "You want to look at the evolution of the entities and evolution of dense is described in terms of the continuity equation, so so the they're kind of like the considering currents together together with dentists are very very natural thing.",
                    "label": 0
                },
                {
                    "sent": "And we'll see how how, how easy it makes to deal with with the with the Bellman equation.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So a little bit about about about current fluxes and current densities, because this is actually the trigger does to consider to consider this occurrences additional variables which makes the considerations so easy.",
                    "label": 0
                },
                {
                    "sent": "So actually like currents, if you think about it as flux, is there really like like topological in nature?",
                    "label": 0
                },
                {
                    "sent": "I mean to have like a current as you can have like a current density in a system that does not have.",
                    "label": 0
                },
                {
                    "sent": "Have nontrivial cycles, 1 dimensional cycles, but if you want to have a flux, we want to have a flux.",
                    "label": 0
                },
                {
                    "sent": "Even like in the simplest electrical current like like like in high school when you have like a battery and resistance right, you have a nontrivial cycle and you can think about about like current in two ways.",
                    "label": 0
                },
                {
                    "sent": "You can think about current like if you look at that at the at the motion of our single particle is how many times it goes over the cycle and you need you need to calculate it like you using this site.",
                    "label": 0
                },
                {
                    "sent": "For example, we go twice.",
                    "label": 0
                },
                {
                    "sent": "In this direction, backwards one, it's one right?",
                    "label": 0
                },
                {
                    "sent": "And then if you kind of like take take take a stochastic trajectory and enlarge tiles because I mean it whines like a lot of times you can think about this stochastic trajectory as as as a close trajectory is a cycle you can actually.",
                    "label": 0
                },
                {
                    "sent": "Define some kind of of angular velocity which tells you how many times basically, take how many times it went through the cycle and divided by time.",
                    "label": 0
                },
                {
                    "sent": "For example, if you have like 3 cycles like with two cycles like in the tourist, you'll have like 2 components of Angular velocity.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, you can think about this as a flux because what you can do for any for any like 1 dimensional cycle you can figure out like a cycle, like a hypersurface, is cycle of codimension one.",
                    "label": 0
                },
                {
                    "sent": "And count how many times the trajectory pinched this codimension one cycle.",
                    "label": 0
                },
                {
                    "sent": "And again like considering with this sign, direction is important and this is what in topology called an intersection index and the intersection index depends really only on the topological properties of to psych.",
                    "label": 0
                },
                {
                    "sent": "So if you deform if you deform like a 1 dimensional trajectory continuously, or if you deform, you know the hypersurface.",
                    "label": 0
                },
                {
                    "sent": "Through which you know you're looking like continually calculating the pinching the intersection index, which is like the number of intersection that takes into account design does not change, and in this way you can.",
                    "label": 0
                },
                {
                    "sent": "Fix the endpoints.",
                    "label": 0
                },
                {
                    "sent": "Yes, a actually what they said I would I said.",
                    "label": 0
                },
                {
                    "sent": "I mean I am looking for four for a closed for close to 1 dimensional cycle because like jittering but when you have like a very long line right?",
                    "label": 0
                },
                {
                    "sent": "You can actually use a geodesic to close it.",
                    "label": 0
                },
                {
                    "sent": "And whether you're making an arrow of the order of plus minus one, whereas the total winding number is usually proportional to time.",
                    "label": 0
                },
                {
                    "sent": "But you're absolutely right, you either you either fix fix the endpoints or you.",
                    "label": 0
                },
                {
                    "sent": "You make it.",
                    "label": 0
                },
                {
                    "sent": "You make it close and this is not like like what what do we call like at Lat long times?",
                    "label": 0
                },
                {
                    "sent": "This stochastic trajectories are are are like probabilistically close.",
                    "label": 0
                },
                {
                    "sent": "OK so.",
                    "label": 0
                },
                {
                    "sent": "And or this is kind of like the notion of concrete duality, because you know, you can.",
                    "label": 0
                },
                {
                    "sent": "You can look at the cycle in terms of how many times you go over the divining number, or you can look at the current density and calculate the integral of the current density over the over the over the over the section and obtain the same number.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the the simplest example is the particle in a circle.",
                    "label": 0
                },
                {
                    "sent": "It's kind of like understandable how it goes.",
                    "label": 0
                },
                {
                    "sent": "More more complex example is like a tourist, so we have like 2 cycles like that and like that right and they have cross sections for this cycle across section goes like this and for this cycle the cross section goes like that right?",
                    "label": 0
                },
                {
                    "sent": "No, they're all.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More like complicated examples, but sometimes you can have like a system, a system or with very large almost like infinite number degrees of freedom, like for example like in elastic Band on on a sphere.",
                    "label": 0
                },
                {
                    "sent": "However, the flux is really kind of like.",
                    "label": 0
                },
                {
                    "sent": "The complexity of life flow of the flux is given by kind of like the number of independent 1 dimensional cycles and for example for the case of this elastic band on interdimensional sphere you have only one topological on trivial 1 dimensional cycle and then so you have only one component of the current.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, is like Pablo was talking about.",
                    "label": 0
                },
                {
                    "sent": "There is a large division theory for currents and for current densities so that the kind of the distribution function for say for the fluxes with for the current densities is represented by by this large deviation law.",
                    "label": 0
                },
                {
                    "sent": "And here we have the large deviation function or the criminal function that describes the statistical properties.",
                    "label": 0
                },
                {
                    "sent": "Of the current and will show that at the matched case.",
                    "label": 0
                },
                {
                    "sent": "If you want to control the current, so actually are the cost, the rate, the cost rate you need to pay is proportional to the large deviation function and this is this money in the exponent principle.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So no, there is.",
                    "label": 0
                },
                {
                    "sent": "There is this notion of.",
                    "label": 0
                },
                {
                    "sent": "Current density in the city.",
                    "label": 0
                },
                {
                    "sent": "If you have like a process with stochastic trajectories which actually kind of like if you want to to find the density you you choose, choose some small small region in this PIN configuration space and you know kind of like each trajectory spends a certain percentage of time there and this is the contribution to the density of this trajectory.",
                    "label": 0
                },
                {
                    "sent": "Then you average over stick trajectories.",
                    "label": 0
                },
                {
                    "sent": "You obtain the density and for stationary process.",
                    "label": 0
                },
                {
                    "sent": "It's just a distribution, right?",
                    "label": 0
                },
                {
                    "sent": "And the same thing you can do with the currents by kind of like doing the same thing with the with the with the small region.",
                    "label": 0
                },
                {
                    "sent": "But what you need to do you need also like for each trajectory you need to multiply the time it spent there with the velocity.",
                    "label": 0
                },
                {
                    "sent": "So you have like.",
                    "label": 0
                },
                {
                    "sent": "Vector Field, which is the current distribution of current.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, probably.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Skip the singing.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's like about how you can really like calculate this.",
                    "label": 0
                },
                {
                    "sent": "These distributions in the case of low noise.",
                    "label": 0
                },
                {
                    "sent": "So now we will be using the PD approach.",
                    "label": 0
                },
                {
                    "sent": "We can drive in various ways more rigorous, less rigorous, but you do do it right.",
                    "label": 0
                },
                {
                    "sent": "You obtain the same result an in the case of are in the case of, like what's called control.",
                    "label": 0
                },
                {
                    "sent": "When the times are, you know much longer than the collaboration time for the system, then you have this kind of like for each of these three terms.",
                    "label": 0
                },
                {
                    "sent": "In the course functional, if you average them over the statistic trajectories, they kind of like behave like their typical behaviors, like proportional to time and the kind of like the the limit of T -- 1 times.",
                    "label": 0
                },
                {
                    "sent": "The average is well defined quantity and is naturally described in terms of the.",
                    "label": 0
                },
                {
                    "sent": "Average density role and average current density G of X.",
                    "label": 0
                },
                {
                    "sent": "Now the stationary keys ruin G can be found by solving the.",
                    "label": 0
                },
                {
                    "sent": "For your Planck equation, the stationary focal point equation on probability literature, it's called the Kolmogorov equation.",
                    "label": 0
                },
                {
                    "sent": "So actually, or this is the focal point equation for the stationary state, and this is the expression for the current density in terms of the density and the parameters of the theory, so now.",
                    "label": 0
                },
                {
                    "sent": "The actually kind of like the way we will look at this cost functional, which we call the gauge invariant cost functional that contains this vector potential.",
                    "label": 0
                },
                {
                    "sent": "Of course that there are ways to think about that.",
                    "label": 0
                },
                {
                    "sent": "It's really kind of like a cost function.",
                    "label": 0
                },
                {
                    "sent": "Well, when you're trying to minimize to minimize the cost which is given by the square of the vector field plus plus something which you are trying to achieve.",
                    "label": 0
                },
                {
                    "sent": "So you want to like to get like some kind of a compromise.",
                    "label": 0
                },
                {
                    "sent": "Or like like like as people say in the United States consensus, right?",
                    "label": 0
                },
                {
                    "sent": "It's very nice word for that.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, you can look at it like in a different way.",
                    "label": 0
                },
                {
                    "sent": "You can look at this additional terms is LaGrange factors.",
                    "label": 0
                },
                {
                    "sent": "So actually you're seeing you are really looking at the cost at the integral of the square field over stochastic trajectory.",
                    "label": 0
                },
                {
                    "sent": "But you know what you want, what you want to you want to control?",
                    "label": 0
                },
                {
                    "sent": "You want to control?",
                    "label": 0
                },
                {
                    "sent": "Certain quantities that are linear in the in the density and in the current density, like a, like a quantity that is linear in the in the in the density, is in an integral of the density with some potential.",
                    "label": 0
                },
                {
                    "sent": "It's kind of like a kind of like a problem like our optimization.",
                    "label": 0
                },
                {
                    "sent": "Imagine that you want to go in point A to point B and during your way you're exposed to something which is not nice like radiation, right and.",
                    "label": 0
                },
                {
                    "sent": "You want you want to pay the minimal cost, right?",
                    "label": 0
                },
                {
                    "sent": "But you you're allowed to accept only certain amount of radiation, right?",
                    "label": 0
                },
                {
                    "sent": "So you're asking the question.",
                    "label": 0
                },
                {
                    "sent": "What should be your control field to achieve that?",
                    "label": 0
                },
                {
                    "sent": "So it's kind of like it's a problem that can be solved using like the stairs Bellman equation when you think about this potential V scalar potential is LaGrange multiplier, so it's basically gives you the rate how much radiation you're getting at each point in your configuration space.",
                    "label": 0
                },
                {
                    "sent": "Right now the additional term with this vector potential allows you to consider like a broader.",
                    "label": 0
                },
                {
                    "sent": "A broader set of quantities, one of them which actually involved involved involved in velocity.",
                    "label": 0
                },
                {
                    "sent": "One of this quantity like like there is a bunch of quantities like work produced on the system like heat produced by the system, like like the entropy produced and this can be done by by by by considering like setting this vector potential A to the force field.",
                    "label": 0
                },
                {
                    "sent": "On the other hand there is like another application.",
                    "label": 0
                },
                {
                    "sent": "If you want to control kind of like the average angular velocity, then then you know you can use this vector field's LaGrange multiplier that controls the flux, and then I'll talk like a little bit about about it.",
                    "label": 0
                },
                {
                    "sent": "In this case you need to choose the vector potential that is locally purely gauge, so it's locali.",
                    "label": 0
                },
                {
                    "sent": "It's locali a gradient, but if you have like a nontrivial 1 dimensional cycle, even though you have like a local.",
                    "label": 0
                },
                {
                    "sent": "Gradient field it's not a global gradient as long as the integral of the vector potential over nontrivial cycle is is non zero.",
                    "label": 0
                },
                {
                    "sent": "And actually it's kind of like you can see that there is a mesh there right?",
                    "label": 0
                },
                {
                    "sent": "Because the number the number of.",
                    "label": 0
                },
                {
                    "sent": "Independent non contracted, non contractible cycle is exactly kind of like described by the number of this locali gauge vector potentials which are in the very differential geometer called closed differential forms factor gations formation, which is adding a gradient OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Anyway, we are kind of like drawing.",
                    "label": 0
                },
                {
                    "sent": "To optimize, like in using one philosophy or the other philosophy, we are trying to optimize the average value over the stochastic process of the cost function.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And or.",
                    "label": 0
                },
                {
                    "sent": "Very this is a page acting on the space of densities gauge invariant.",
                    "label": 0
                },
                {
                    "sent": "I'll show that these these these these functional this cost function the average value of the cost functional right is gauge invariant in the sense that if you add a gradient to the vector field.",
                    "label": 0
                },
                {
                    "sent": "The rate kind of like the cost rate does not change.",
                    "label": 0
                },
                {
                    "sent": "Just like it, it's a typical.",
                    "label": 0
                },
                {
                    "sent": "It's like like gauge invariance in electrodynamics, right?",
                    "label": 0
                },
                {
                    "sent": "If you think about a as vector potential negative in a mix.",
                    "label": 0
                },
                {
                    "sent": "Does it answer a question?",
                    "label": 0
                },
                {
                    "sent": "OK, I will try to talk about it a little bit more so now.",
                    "label": 0
                },
                {
                    "sent": "Sexually the quantization here or to get integer solutions and.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "No, there are some effects of quantization if you if you look at that.",
                    "label": 0
                },
                {
                    "sent": "You know at low noise limits in systems we will share periodically driven.",
                    "label": 0
                },
                {
                    "sent": "We can talk about it but but here it's it's an unknown organization because because you see it's kind of like the the flux.",
                    "label": 0
                },
                {
                    "sent": "The flux is is basically an integer number of rotations right divided by time, so generally it's like it's a real number serial number now so.",
                    "label": 0
                },
                {
                    "sent": "And I think about about, you know, this representation is that if you look at the like figure Planck equation expression for the curve, you can see that the expression of the current allows you to express the.",
                    "label": 0
                },
                {
                    "sent": "Control field you, in terms of gender or.",
                    "label": 0
                },
                {
                    "sent": "Which means that if you are trying to control.",
                    "label": 0
                },
                {
                    "sent": "Not just some flux, some work, or some like a couple of quantities, but you're trying to control like a lot.",
                    "label": 0
                },
                {
                    "sent": "You're trying to control the average density and the average current density.",
                    "label": 0
                },
                {
                    "sent": "You have actually an analytical formula for the cost, right?",
                    "label": 0
                },
                {
                    "sent": "Because what you do you have the square of the of the control field you express it in terms of GN rule and you're there.",
                    "label": 0
                },
                {
                    "sent": "Black calendars with K is Kappa cuppa cuppa is is it characterized the noise strength.",
                    "label": 0
                },
                {
                    "sent": "It is dated to concerts.",
                    "label": 0
                },
                {
                    "sent": "Memorial is like cables Monty.",
                    "label": 0
                },
                {
                    "sent": "Because it would be good.",
                    "label": 0
                },
                {
                    "sent": "Problem with a drift and a noise generation noise and actually actually you know it's kind of like the way you know we're trying to think about it.",
                    "label": 0
                },
                {
                    "sent": "This metric G right?",
                    "label": 0
                },
                {
                    "sent": "It's basically characterizes the viscosity in in the in the, in the in the overtime case right?",
                    "label": 0
                },
                {
                    "sent": "Because because you have XXX dot is equal to some velocity which this velocity actually force divided by viscosity.",
                    "label": 0
                },
                {
                    "sent": "Right now if you're Beth which you eliminate it.",
                    "label": 0
                },
                {
                    "sent": "Stopped in your your like reduce description is at equilibrium that there is a fluctuation dissipation relation right?",
                    "label": 0
                },
                {
                    "sent": "There are likely Einstein relation which says that actually the metric of noise is keyboards.",
                    "label": 0
                },
                {
                    "sent": "Monte Times times the metric of of damping, right?",
                    "label": 0
                },
                {
                    "sent": "So we're actually like put like keeping this Copa explicitly to be able, I mean to to play with the strength of noise relative to viscosity.",
                    "label": 0
                },
                {
                    "sent": "No, no did they say OK?",
                    "label": 0
                },
                {
                    "sent": "This system OK, I'm thinking about say I'm thinking about the Fokker Planck equation right?",
                    "label": 0
                },
                {
                    "sent": "As a result of considering our system coupled to some bath.",
                    "label": 0
                },
                {
                    "sent": "OK, so the system itself is not ridiculously is not an equilibrium system.",
                    "label": 0
                },
                {
                    "sent": "It's not a gradient but the birth.",
                    "label": 0
                },
                {
                    "sent": "But the birth is considered to be to be at Equilibrates.",
                    "label": 0
                },
                {
                    "sent": "It's not you, you don't have to do it.",
                    "label": 0
                },
                {
                    "sent": "What is the bath?",
                    "label": 0
                },
                {
                    "sent": "Is some dynamical system right coupled with a large number of degrees of freedom, weakly coupled Thor system with the property that the relaxation time of the bath is very short compared to typical timescale in the system?",
                    "label": 0
                },
                {
                    "sent": "Dimension or recalled into folders complex.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, it's kind of like you.",
                    "label": 0
                },
                {
                    "sent": "You don't have to work in in compact manifolds, but then you need to make sure that your your your direction field has certain properties.",
                    "label": 0
                },
                {
                    "sent": "These just think is just to say it's it's compact and oriented by the way.",
                    "label": 0
                },
                {
                    "sent": "Myologie so that.",
                    "label": 0
                },
                {
                    "sent": "Is close but not exact forms.",
                    "label": 0
                },
                {
                    "sent": "Yeah, if you're OK if you're talking about fluxes, right?",
                    "label": 0
                },
                {
                    "sent": "I'm not talking about fluxes only because.",
                    "label": 0
                },
                {
                    "sent": "OK, for example if I want to to to to control the entropy production or I want to control the heat released to the bath, right then a would be actually the forcefield of the system.",
                    "label": 0
                },
                {
                    "sent": "It it it, it's it's.",
                    "label": 0
                },
                {
                    "sent": "It's not this formalism.",
                    "label": 0
                },
                {
                    "sent": "It's not limited to fluxes.",
                    "label": 0
                },
                {
                    "sent": "Fluxes is kind of like a nice application which actually triggered, you know.",
                    "label": 0
                },
                {
                    "sent": "This thing that we introduced the vector potential, but you're absolutely right if you want to have fluxes right, you need to make sure we have the nontrivial first homology.",
                    "label": 0
                },
                {
                    "sent": "But the only thing distinguishes be from a.",
                    "label": 0
                },
                {
                    "sent": "Is the fact that A is closed and not exact?",
                    "label": 0
                },
                {
                    "sent": "No no.",
                    "label": 0
                },
                {
                    "sent": "OK, actually, like generally we consider a as as an arbitrary 14.",
                    "label": 0
                },
                {
                    "sent": "However, if we want to apply this.",
                    "label": 0
                },
                {
                    "sent": "OK, I'm using.",
                    "label": 0
                },
                {
                    "sent": "I'm using an FM ISM.",
                    "label": 0
                },
                {
                    "sent": "OK, OK vector potential, is it away?",
                    "label": 0
                },
                {
                    "sent": "Is a differential one form OK?",
                    "label": 0
                },
                {
                    "sent": "Is differential one form so the formalism?",
                    "label": 0
                },
                {
                    "sent": "Mixed partials gotta have decent no?",
                    "label": 0
                },
                {
                    "sent": "No, if if OK look if I want to work with fluxes right?",
                    "label": 0
                },
                {
                    "sent": "If I want to work with boxes then I need to take a with the property D A = 0 In the air.",
                    "label": 0
                },
                {
                    "sent": "By the way, gauge invariance means that if I add an exact form right that nothing changes.",
                    "label": 0
                },
                {
                    "sent": "So if I'm dealing with closed form in a manifold with the trivial first homology right, then what will obtain I obtain nothing?",
                    "label": 0
                },
                {
                    "sent": "Interesting about exactly about closed forms and its natural right because I want to work with fluxes I want I want to have nontrivial one cycles right and then I'll have closed forms that are not exact.",
                    "label": 0
                },
                {
                    "sent": "But once again, I mean if I design to control.",
                    "label": 0
                },
                {
                    "sent": "The amount of heat produced by this system, which is a reasonable quantity right?",
                    "label": 0
                },
                {
                    "sent": "You don't want over here to certain system, right doing certain things right then, instead of a I will use.",
                    "label": 0
                },
                {
                    "sent": "The force field is a differential form, and if the system is not a grid in system that this force field will be not a closed form that makes sense.",
                    "label": 0
                },
                {
                    "sent": "Objecting to is what you're calling a vector potential OK vector potential vector potential is is or differential form of rank one.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Think of those.",
                    "label": 0
                },
                {
                    "sent": "VVV OK like mathematical, like symmetric is speaking.",
                    "label": 0
                },
                {
                    "sent": "V is a smooth function on our manifold.",
                    "label": 0
                },
                {
                    "sent": "A is one form on our manifold.",
                    "label": 0
                },
                {
                    "sent": "There absolutely not connected.",
                    "label": 0
                },
                {
                    "sent": "OK. Once no, no.",
                    "label": 0
                },
                {
                    "sent": "Once again a differential form does not have to be closed, right?",
                    "label": 0
                },
                {
                    "sent": "But if you look if you want to count the flux, what you want to do, you want the trajectories that are like like, like, topologically equivalent you, you want them to be weighted.",
                    "label": 0
                },
                {
                    "sent": "Or with the same factor.",
                    "label": 0
                },
                {
                    "sent": "This is why you're using across 4, because I mean if there are two like Hama logically equivalent projectors right by the stock steering if you want.",
                    "label": 0
                },
                {
                    "sent": "If I want to do the fluxes, but I'm saying it's it's not limited to the fluxes, OK, flux is my favorite example.",
                    "label": 0
                },
                {
                    "sent": "OK, so anyway you can like.",
                    "label": 0
                },
                {
                    "sent": "Extract you from.",
                    "label": 0
                },
                {
                    "sent": "The current density and and just usual density right?",
                    "label": 0
                },
                {
                    "sent": "Which means that you can.",
                    "label": 0
                },
                {
                    "sent": "Actually think about it.",
                    "label": 0
                },
                {
                    "sent": "It's transformation of variables.",
                    "label": 0
                },
                {
                    "sent": "Instead of thinking in terms of the control fields control vector fields, you're thinking in terms of the density and current density, like averaged over over sarcastic projectors and at long times you can think of them as as independent variables.",
                    "label": 0
                },
                {
                    "sent": "Of course, I mean you, you need to have the divergents of J = 0 because you know in a stationary process they average density is not changing, but the diverse is J = 0 exactly concise with the focal point equation is just another way to to represent the focal point equation.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "You introduced the.",
                    "label": 0
                },
                {
                    "sent": "The rate of the cost to go functional over a long time and then you immediately obtain like like like like a very natural formula.",
                    "label": 0
                },
                {
                    "sent": "For for this rate, which is given by basically averaged over over over.",
                    "label": 0
                },
                {
                    "sent": "Averaged over the.",
                    "label": 0
                },
                {
                    "sent": "Random process of the square of the vector field on the square of the vector field.",
                    "label": 0
                },
                {
                    "sent": "The vector field is expressed in terms of Ryan G. OK, so now when you want to get like an optimal solution, what you need to do.",
                    "label": 0
                },
                {
                    "sent": "You just need to minimize this function with respect to current density density with the natural constraints that the density the integral of the density is 1.",
                    "label": 0
                },
                {
                    "sent": "The conservation of probability and the divergents are of the current density 0, so the way you do it, like a natural way is just to introduce LaGrange factors.",
                    "label": 0
                },
                {
                    "sent": "So there is 1 LaGrange factor.",
                    "label": 0
                },
                {
                    "sent": "We called Lambda here for this constraint.",
                    "label": 0
                },
                {
                    "sent": "And then this is a functional constraint.",
                    "label": 0
                },
                {
                    "sent": "So we introduce electrons factor for the for this constraint which.",
                    "label": 0
                },
                {
                    "sent": "Recall five OK.",
                    "label": 0
                },
                {
                    "sent": "So now after that you kind of like and can do like the trivial math.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And you need to to make like a couple really really well like trivial transformations, but the result of this kind of like minimization of dysfunctional will reproduce an equation for five.",
                    "label": 0
                },
                {
                    "sent": "And the expression for the for the control field in terms of this of this LaGrange function, LaGrange factor Phi.",
                    "label": 0
                },
                {
                    "sent": "Now, if you set the vector potential A to zero, you will recognize kind of like the standard Bellman equation, where five is the cost to go function, right?",
                    "label": 0
                },
                {
                    "sent": "It's kind of you recognize the stationary form of the Bellman equation.",
                    "label": 1
                },
                {
                    "sent": "And here you'll you'll recognize the famous form that the the control field is the gradient of the cost function.",
                    "label": 0
                },
                {
                    "sent": "Now the way how it appears here.",
                    "label": 0
                },
                {
                    "sent": "And this is something which is nice about gauge theories.",
                    "label": 0
                },
                {
                    "sent": "I mean, if you introduce the gauge field, what you need to do, you need to what people say to elongated derivative, right?",
                    "label": 0
                },
                {
                    "sent": "Kind of like when you have like a usual derivative, you always add the gauge field vector field here.",
                    "label": 0
                },
                {
                    "sent": "And actually if you look at the expression you see that you take the standard like well known equations.",
                    "label": 0
                },
                {
                    "sent": "Someone equation the relation and like each time we have like a derivative of fire, you add A and this is how it works.",
                    "label": 0
                },
                {
                    "sent": "So once again it's generalization of the equation like people were dealing with and kind of like when you deal with with an extended set of variables you see that there is kind of like a 1101 type of derivation of this equation using like simple variational arguments.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You're assuming the existence of an invariant measure, and that's usually a hard question.",
                    "label": 0
                },
                {
                    "sent": "I'm a physicist.",
                    "label": 0
                },
                {
                    "sent": "Yeah, on the compact space actually your issues are like probability theory expert and I think everything is fine there, right?",
                    "label": 0
                },
                {
                    "sent": "Do you have an example with this?",
                    "label": 0
                },
                {
                    "sent": "Yeah, like for example, you can let the simplest problem you you can think about that they have like a particle in circle, right?",
                    "label": 0
                },
                {
                    "sent": "For example it can be even even even in the.",
                    "label": 0
                },
                {
                    "sent": "Gradient case like a potential and you want you want you want you want to mean it, you you want to use the control field to make it like like move at a certain angle of lost like an engine, right?",
                    "label": 0
                },
                {
                    "sent": "And you're asking what was the least expensive way to do that.",
                    "label": 0
                },
                {
                    "sent": "So then you can actually do this.",
                    "label": 0
                },
                {
                    "sent": "Vision.",
                    "label": 0
                },
                {
                    "sent": "Caulfield no generated.",
                    "label": 0
                },
                {
                    "sent": "I think I think I think.",
                    "label": 0
                },
                {
                    "sent": "I think there are there are applications.",
                    "label": 0
                },
                {
                    "sent": "No, like about gauge invariance, right gauge invariance?",
                    "label": 0
                },
                {
                    "sent": "Well I like like like really means that if you add a gradient to the vector potential Lambda which which represents the.",
                    "label": 0
                },
                {
                    "sent": "Cost the optimal cost rate doesn't change right here and now there is like an interesting thing.",
                    "label": 0
                },
                {
                    "sent": "What happens with fire when you add like a gradient.",
                    "label": 0
                },
                {
                    "sent": "It does change, but in the sum like prescribed and very reasonable way right?",
                    "label": 0
                },
                {
                    "sent": "And what this really means is for us you can think about five in the following way.",
                    "label": 0
                },
                {
                    "sent": "If you look at long times and you look look at the at the at the optimal cost function, the deleting term will be proportional to time.",
                    "label": 0
                },
                {
                    "sent": "Right, and it's it's given by the rate, but the next term, the next term will be time independent and the higher order terms.",
                    "label": 0
                },
                {
                    "sent": "In the case of a compact manifold an if we kind of like believe that the spectrum of this like Twisted Fork, are planning operators still discrete, and I think that there should be like some theorems about that.",
                    "label": 0
                },
                {
                    "sent": "Yes, it's actually yet OK anyway.",
                    "label": 0
                },
                {
                    "sent": "Then the other terms will decay exponentially, where like that this exponent is given by the gap in the spectrum, right?",
                    "label": 0
                },
                {
                    "sent": "So now you can show that Phi represents this time independent component of the cost function of the long Times Now.",
                    "label": 0
                },
                {
                    "sent": "In this time time, independent component will depend on the point where were your trajectory start.",
                    "label": 0
                },
                {
                    "sent": "So if you if you make a guy's transformation, of course.",
                    "label": 0
                },
                {
                    "sent": "I mean you you add that this term which is given by by by by this value 5 at the point of the starting trajectory.",
                    "label": 0
                },
                {
                    "sent": "So it's really like very reasonable gauge invariance and this is the kind of like a Lagrangian or stochastic.",
                    "label": 0
                },
                {
                    "sent": "As of state, right of X.",
                    "label": 0
                },
                {
                    "sent": "What is the function of state?",
                    "label": 0
                },
                {
                    "sent": "The costs of the constant, the cost will go customer.",
                    "label": 0
                },
                {
                    "sent": "Function, I know that they did not know that the optimal optimal function of state were in state the.",
                    "label": 0
                },
                {
                    "sent": "What is X?",
                    "label": 0
                },
                {
                    "sent": "The initial point?",
                    "label": 0
                },
                {
                    "sent": "This case maybe he's got an equilibrium situation.",
                    "label": 0
                },
                {
                    "sent": "How many liberal situation, right?",
                    "label": 0
                },
                {
                    "sent": "Do you have an optimal density which depends on state?",
                    "label": 0
                },
                {
                    "sent": "Also not yeah, but this is stacia.",
                    "label": 0
                },
                {
                    "sent": "You you do it in a stationary state right?",
                    "label": 0
                },
                {
                    "sent": "Because we do it at long times it's regarded control right?",
                    "label": 0
                },
                {
                    "sent": "I'll talk a little bit about the time dependent Bellman equation given variable in equation.",
                    "label": 0
                },
                {
                    "sent": "Yeah, did did not know it.",
                    "label": 0
                },
                {
                    "sent": "It does depend on the state, of course right there, but it depends on the stationary state, right?",
                    "label": 0
                },
                {
                    "sent": "You you change you change your your your like like forcefield.",
                    "label": 0
                },
                {
                    "sent": "You'll get a different state but the gauge invariance still there.",
                    "label": 0
                },
                {
                    "sent": "This makes sense.",
                    "label": 0
                },
                {
                    "sent": "Gauge invariance is always there.",
                    "label": 1
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No exponential representation in the case of the match between the noise properties in the cost properties, like it's done like in a standard way.",
                    "label": 0
                },
                {
                    "sent": "And here you go.",
                    "label": 0
                },
                {
                    "sent": "You can really see you know this kind of like a long gated derivatives in a very nice way.",
                    "label": 0
                },
                {
                    "sent": "So you add minus QAJ times.",
                    "label": 0
                },
                {
                    "sent": "To add it to the derivative and you can think about Q.",
                    "label": 0
                },
                {
                    "sent": "If you like, think about like analogies.",
                    "label": 0
                },
                {
                    "sent": "Would like to dynamics is the charge.",
                    "label": 0
                },
                {
                    "sent": "And here like the role of Church is displayed by by by, by the ratio of the of the of the noise metrics in the cost metrics.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I know I'll wrap it up.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, the money exponents Inc. OK, so now if you if you're drawing like like to control like Jinro right you you need to set A to zero and videos here, right?",
                    "label": 0
                },
                {
                    "sent": "And what you're obtaining?",
                    "label": 0
                },
                {
                    "sent": "You're obtaining the following expression for the for the.",
                    "label": 0
                },
                {
                    "sent": "Optimal rate of the coast rate function, on the other hand, there is such a thing.",
                    "label": 0
                },
                {
                    "sent": "It's called the functional of density and current density, which says that if you have like a stationary process and you're looking at that they had the probability distribution of the density and current density.",
                    "label": 0
                },
                {
                    "sent": "It has large deviation form over which is described by by by the by the primary function and this primary function is like a little bit like more involved calculations Pablo noted at his talk, but he actually obtained the same.",
                    "label": 0
                },
                {
                    "sent": "The same result OK after coefficient.",
                    "label": 0
                },
                {
                    "sent": "So what you see that in the matched case the rate of the cost to go is given by by the.",
                    "label": 0
                },
                {
                    "sent": "Fudge factor times the grammar function, which is the log of the probability at long times, so this is the money in the exponent think.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, let me just say I have only 5 minutes.",
                    "label": 0
                },
                {
                    "sent": "Optimal cost of equilibrium.",
                    "label": 0
                },
                {
                    "sent": "OK, no, you using the density and current density.",
                    "label": 1
                },
                {
                    "sent": "It's very easy to talk about.",
                    "label": 0
                },
                {
                    "sent": "Like what does it mean about the system is at equilibrium systems equilibrium.",
                    "label": 0
                },
                {
                    "sent": "By the way, it means that you know when you add this control field, U2F your total force field, which is U plus there should be a gradient, right?",
                    "label": 0
                },
                {
                    "sent": "But here you you can let me say it like in like in an easier way is the situation when the current density is 0.",
                    "label": 0
                },
                {
                    "sent": "So this is equilibrium, right?",
                    "label": 0
                },
                {
                    "sent": "So kind of in the in the Fokker Planck equation, which is divergent.",
                    "label": 0
                },
                {
                    "sent": "J is equal 0 in the equilibrium case.",
                    "label": 0
                },
                {
                    "sent": "It is like a very special solution, G = 0.",
                    "label": 1
                },
                {
                    "sent": "So if you want to talk to find the rate of the cost, you just use this functional.",
                    "label": 1
                },
                {
                    "sent": "And said J to zero and then you make you make.",
                    "label": 0
                },
                {
                    "sent": "Representation of raw equals PSI squared and after like like integrating by parts, you're obtaining a functional where this is some kind of like an effective, potentially effective potential is the square of the velocity field plus the it's an invariant for one of the ways to write the divergences.",
                    "label": 0
                },
                {
                    "sent": "And or it's like a well known thing that if you like if you are minimize this functional with the interval upside squared equals one, it's equivalent to finding the ground state of assuring Griqua shun where copper is deploying constant.",
                    "label": 1
                },
                {
                    "sent": "Use the potential so this this another another another another another another.",
                    "label": 0
                },
                {
                    "sent": "Example of how quantum mechanics appears in stochastic processes.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Finally, like a couple.",
                    "label": 0
                },
                {
                    "sent": "Words about that the time dependent gauge invariant Bellman equation can be derived in an absolutely similar way.",
                    "label": 1
                },
                {
                    "sent": "You you need to write.",
                    "label": 0
                },
                {
                    "sent": "Kind of like if you do this kind of like PD you need to write down APD equation which is time dependent and or again I mean you're using the expression for the current which depends on time.",
                    "label": 0
                },
                {
                    "sent": "So you can describe the time dependent vector field in terms of the density and current density which is time dependent.",
                    "label": 0
                },
                {
                    "sent": "You plug it in.",
                    "label": 0
                },
                {
                    "sent": "Uptain the functional then.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Kind of like introduce the LaGrange factor here and after like doing iteration and it like very simple way you end up with the.",
                    "label": 0
                },
                {
                    "sent": "Billman equation, which is like different from kind of like let me call the standard Billman equation.",
                    "label": 0
                },
                {
                    "sent": "But by eliminating the derivative.",
                    "label": 0
                },
                {
                    "sent": "Enter.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or so this is this is this is the gauge symmetry for the time dependent independent?",
                    "label": 1
                },
                {
                    "sent": "Build an equation and you see that the scalar potential admits, admits the time derivative of the field fee that describes the gauge transformation.",
                    "label": 0
                },
                {
                    "sent": "So this is like, again, I mean, it's like like what happens in electrodynamics when you look for the gations formation transformations which are actually time dependent.",
                    "label": 0
                },
                {
                    "sent": "And again in the match.",
                    "label": 0
                },
                {
                    "sent": "In case you you reproduce the linear equation, which again just don't get the derivative.",
                    "label": 0
                },
                {
                    "sent": "He and.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is kind of.",
                    "label": 0
                },
                {
                    "sent": "In natural summary and thank you very much for attention.",
                    "label": 0
                },
                {
                    "sent": "The case that the space is simply connected single coming so trivial.",
                    "label": 0
                },
                {
                    "sent": "What happens then that there are no fluxes and then looking at you you cannot control fluxes because there are no fluxes.",
                    "label": 0
                },
                {
                    "sent": "However, for example, you can add the question.",
                    "label": 0
                },
                {
                    "sent": "About you know what?",
                    "label": 0
                },
                {
                    "sent": "What's the minimal cost of like minimizing the heat produced by the system, or maximizing the work produced on the system, right?",
                    "label": 0
                },
                {
                    "sent": "Engaging the weight completing this.",
                    "label": 0
                },
                {
                    "sent": "OK, in in this case, if you're talking about like wanted, just like like entropy production work produced, then a field the A is equal to F. For a, you just use the force field.",
                    "label": 0
                },
                {
                    "sent": "It's kind of like.",
                    "label": 0
                },
                {
                    "sent": "There are like some more applications, but like like I was talking like like clearly about two like one is when a is equal to F. Write an F in the key.",
                    "label": 0
                },
                {
                    "sent": "In the case of.",
                    "label": 0
                },
                {
                    "sent": "Non equilibrium system is not is not is not the gradient field right?",
                    "label": 0
                },
                {
                    "sent": "It can be like anything and the second example it's about fluxes, right?",
                    "label": 0
                },
                {
                    "sent": "So you cannot talk about flux if you don't.",
                    "label": 0
                },
                {
                    "sent": "If you don't have non contractible cycles.",
                    "label": 0
                },
                {
                    "sent": "So here you don't have non contractible cycles.",
                    "label": 0
                },
                {
                    "sent": "Forget about fluxes.",
                    "label": 0
                },
                {
                    "sent": "Forget about the politics.",
                    "label": 0
                },
                {
                    "sent": "Forget about everything interesting right so?",
                    "label": 0
                },
                {
                    "sent": "I'm exaggerating, of course.",
                    "label": 0
                }
            ]
        }
    }
}