{
    "id": "huaeghn2lnwrqhsxqoqn6ypzszkn6plj",
    "title": "Professional Virtual Communities",
    "info": {
        "author": [
            "Andrea Bifulco, ESoCE-Net"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "May 2006",
        "category": [
            "Top->Business->Virtual Enterprises"
        ]
    },
    "url": "http://videolectures.net/brussels06_bifulco_p/",
    "segmentation": [
        [
            "And I'm going to introduce to you the concept of professional virtual communities.",
            "I's been developing in a colleague so far."
        ],
        [
            "So first question is what is a PVC?",
            "A professional virtual community and the answer is that is an Association of individuals.",
            "That are permanently knowledge workers.",
            "So these individuals, this knowledge workers can be company employees.",
            "They can belong to an S me to a large company can be researcher from University or research centers.",
            "Can be individual professional freelance individual consultants and also they say people that are retired from their company and they are still there.",
            "There is a social aspect here because the professional community is a community.",
            "There is a sort.",
            "It is not an aggregation of people that subscribe to something is a community.",
            "There is a social fabric among all those individuals.",
            "And what is?",
            "The identification of these people is a specific specific knowledge scope, so the professional virtual community is identified by knowledge scope that can be a discipline.",
            "The excellence in a specific discipline like let's say acoustic discipline or a multidisciplinary integration of discipline or a specific challenge.",
            "But what is really important to aggregate this community?",
            "Is that all those people shall share an interest in a specific knowledge scope, but it's not only about knowledge this interest.",
            "Is because the third element of the professional community is its explicit business orientation.",
            "This knowledge is made to make money out of it.",
            "So the mechanism by which the business is made within a professional with the community is when a customer is a need for a specific knowledge service.",
            "Then a virtual team of individuals.",
            "The best one is self aggregating to respond to this kind of needs.",
            "And then the visual team can provide this customer specific professional services.",
            "In these cases, we made the example that one guy from the University and to individual professional where the best one for providing a professional services to satisfy these needs, and then at the end money money, go back to the people that have delivered this service.",
            "So this is the economic business explicit orientation of.",
            "Of the community.",
            "The people see member interaction is optimized by the synergic use of ICT mediated and also face to face mechanism.",
            "So is not only virtual contact among people but there also a balance among virtual physical meeting."
        ],
        [
            "What is the PVC mission then?",
            "the PC mission consists in the generation of value and the mechanism to generate is the interaction among people sharing and collaboration.",
            "And this value is a trifle balance.",
            "One is the generation of advanced knowledge, the other one the generation of professional services to exploit the advanced knowledge that is being generated and the social capital, the social relationship among the members.",
            "The PC has been designed to, with two main objective.",
            "The one is to be a mechanism to deliver innovation.",
            "So we're talking about generation of frontier knowledge, advanced knowledge on a specific knowledge scope, but not just for making new idea, but with the mechanism of professional services to introduce this frontier knowledge in industrial reality.",
            "And also the other.",
            "Design requirement is to maximize the relative maximize the realization of individuals.",
            "So the PVC to self is an organizational form that has been designed to maximize satisfaction of knowledge workers through the coincidence of the objective of the individual and the organization itself."
        ],
        [
            "What we have now while we are developing this new concept, what we call a new concept professional Utah Community becausw we think that all the three element, the social knowledge and the business element must be accounted for in such a kind of a community to be successful.",
            "This is the example of community of practice.",
            "Community of practice has been around from since 10 years.",
            "Now within large Corporation.",
            "And our social.",
            "Settings that are put up by this Corporation to share knowledge so there is a big knowledge component, some social aspect, but there is no explicit business thing there.",
            "So what have the problem community of practice do not overcome existing organizational barrier becausw.",
            "The lack of explicit business dimension jeopardize member motivation member not motivated also by ability.",
            "That is, the motivation of the companies of the employers reduce the scope of community activities.",
            "In pizza, deep sharing and also induced mistrust because of hidden companies or members objectives.",
            "So there is a need to evolve towards a more balanced kind of community that shall address the three element altogether, and so the need to evolve from the blueish color that is one of the community of practice.",
            "There are more oriented knowledge to a color that is more white.",
            "This combination, more balanced combination of social, business and knowledge aspects."
        ],
        [
            "What is then the positioning of this professional services, the marketing positioning of the professional services that the professional community is intended to deliver?",
            "I've said already that they are exploring and exploiting a frontier knowledge that may consist of original application of state of the art knowledge first implementation.",
            "This is the relevant.",
            "The key aspect of emerging innovative methodology.",
            "So the professional community are belonging researchers from University people for company.",
            "The professional community is not competing in the business scenario with these entities because every.",
            "The organization is still doing his work, University Research Center and company, but the professional services are focused on this specific aspect that are not covered well of each of these organizations, so they are collaborating with this already existing entities."
        ],
        [
            "These are the three typology we have identified so far of community.",
            "The one it depends on the knowledge scope, the one the first one is about an established discipline like the acoustic expert and then we can have another typology incipient discipline, a multidisciplinary combination and also the challenge focused PVC that is aimed at addressing a specific challenge.",
            "So without discipline knowledge.",
            "So these three kinds of PVC are related to three kinds of innovation.",
            "They can deliver the first one, more incremental innovation.",
            "The second one, the stepwise innovation from the application of A of an emerging knowledge discipline, and the other one is more prone to deliver breakthrough innovation."
        ],
        [
            "This is the life cycle we have already seen this morning many times that I would like to stress."
        ],
        [
            "Our attention on the governance principle that the PVC on which the PVC is based on the first one is empowerment.",
            "These are very human centric kind of organization.",
            "the PC is so all decision responsibility must be taken as far as possible at the lowest hierarchical level.",
            "The self commitment is second point.",
            "That means that the members participation is not induced or decide apriori.",
            "The PDC member is not an employee of the PC is it is his decision, the quantity and typology of activity that is performing within the community.",
            "The other one is the self organizing leadership.",
            "That means that hierarchy, the leadership is not the desired.",
            "I priore as much as possible by hierarchical structure, but there are the organization of collaborative activities left to the people that are actually performing this activity and are emerging as leader.",
            "And then the 4th is the peer assessment.",
            "Maybe because we are trying to make a very flat organization.",
            "Anytime there is the necessity of a subjective evaluation not supported by objective data, there is not an hierarchical mechanism to design by by the decision is made by an assessment made by peer."
        ],
        [
            "Now let's have a look to a scenario and implementation scenario of PVC we have here what we can call a network as Mccluster.",
            "I choose this example because we have all networks here.",
            "And the Orange Big Circle is representing this SMB networks or virtual organization building environment that is producing prepared Ness and support for the creation of virtual organization to deliver products and services to customers.",
            "In the aeronautical case can be the big OEM of Airbus or something like that, and the VR can deliver a product component.",
            "In this supply chain, so this kind of PVC that is entangled with this V is a PVC that is mostly made of knowledge.",
            "Workers employed by the companies belonging to the VB and the Knowledge scope will be a core competency of this cluster, something that make difference among competitive advantage towards other competitors in the field.",
            "So the mechanism will be that.",
            "This PC is elaborating this core competancies is nurturing is developing and these selling professional services internally to the network.",
            "To the single company or.",
            "Can be can produce virtual team that are part of the view.",
            "These two increase the overall quality level of the video products and so the VB success."
        ],
        [
            "In this case, just few benefits from the side of the network in introduction of entangled PVC can bring this kind of bank benefits, such as the minimisation overall network costs through the sharing of the knowledge resource.",
            "Is this is the basic level, the knowledge sharing and then cost of reduction, but also the other point is to enable and control innovation cycle within the network.",
            "Infer Corporation readiness through the social capital that is built among the people.",
            "Then you infer cooperation readiness among DSM in the network.",
            "To improve the way in which companies in the network interact with University and Research Center.",
            "Because you are boosting a mechanism that is making an ongoing collaboration among these people, not a doc.",
            "Only when you need some expertise, then it becomes difficult to share things to manage flex flexible knowledge resources like freelance consultants in a controlled manner.",
            "Or to retain network knowledge by including the Community people that are retiring the retired people from this company.",
            "Motivate knowledge workers.",
            "This is by design.",
            "The main objective of the PVC and so on."
        ],
        [
            "This is the conceptual framework and this is a view of the tool that we are going to develop to support the functioning of professional community.",
            "I won't speak about that, 'cause I will shortly introduce Surgicals Merali from TST.",
            "That is the responsible for development of all the.",
            "Software product."
        ],
        [
            "Sites and just I want to spend some few words on this.",
            "Last you file I have to show you what is the portfolio solution that we are developing in this work package for professional with community.",
            "On the left side you see the potential clients that can be existing Community existing virtual community that are not KBS community.",
            "So they want to evolve by introducing.",
            "An explicit business dimension or a social dimension.",
            "If something is missing.",
            "Other clients can be regional developing institution that want to boost the social economic development of the region over the territorial industrial settings.",
            "Other client are the network manager Dbmanager, the example we are showing before another one.",
            "Maybe the large enterprises that want to introduce professional virtual community within the value network of their supplier.",
            "What is the portfolio var solution?",
            "We can we have a distinction among methodological and software solution.",
            "The methodological side?",
            "We are developing a PVC conceptual framework and value system.",
            "Reference elements of the business model of professional lifter community and guidelines for the instantiation of this reference elements.",
            "Governance and organizational principle.",
            "This is on the strategic and design phase on the operational phase.",
            "Then we are developing reference business processes and guidelines.",
            "For instance station organizational settings.",
            "All these methodological.",
            "Results have been already defined as as a first instantiation, so now from now on we're going to refine these results to consolidated on the software side, we have customized portal for PVC with the standard functionality such as membership management, members, profiling, knowledge management, communication, virtual team establishment and we are developing specific ICT module.",
            "One is for IPR tracking, another for social business networking, but surgery will talk more about that and in between we are also developing.",
            "We have a task that is started one month ago that will end the six in six months.",
            "The templates for PVC agreement so that are legally binding or not agreement that we need to establish a PVC, such as the statue, the membership agreement, the agreement among the team members.",
            "And others that we have evidence in our conceptual framework development.",
            "So for me it's all.",
            "If you have a question now.",
            "Or maybe we can.",
            "I will pass the word to Sergio to talk about software tools.",
            "Work package 4.",
            "Right?"
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I'm going to introduce to you the concept of professional virtual communities.",
                    "label": 0
                },
                {
                    "sent": "I's been developing in a colleague so far.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first question is what is a PVC?",
                    "label": 0
                },
                {
                    "sent": "A professional virtual community and the answer is that is an Association of individuals.",
                    "label": 1
                },
                {
                    "sent": "That are permanently knowledge workers.",
                    "label": 1
                },
                {
                    "sent": "So these individuals, this knowledge workers can be company employees.",
                    "label": 0
                },
                {
                    "sent": "They can belong to an S me to a large company can be researcher from University or research centers.",
                    "label": 0
                },
                {
                    "sent": "Can be individual professional freelance individual consultants and also they say people that are retired from their company and they are still there.",
                    "label": 0
                },
                {
                    "sent": "There is a social aspect here because the professional community is a community.",
                    "label": 0
                },
                {
                    "sent": "There is a sort.",
                    "label": 0
                },
                {
                    "sent": "It is not an aggregation of people that subscribe to something is a community.",
                    "label": 0
                },
                {
                    "sent": "There is a social fabric among all those individuals.",
                    "label": 0
                },
                {
                    "sent": "And what is?",
                    "label": 0
                },
                {
                    "sent": "The identification of these people is a specific specific knowledge scope, so the professional virtual community is identified by knowledge scope that can be a discipline.",
                    "label": 1
                },
                {
                    "sent": "The excellence in a specific discipline like let's say acoustic discipline or a multidisciplinary integration of discipline or a specific challenge.",
                    "label": 0
                },
                {
                    "sent": "But what is really important to aggregate this community?",
                    "label": 0
                },
                {
                    "sent": "Is that all those people shall share an interest in a specific knowledge scope, but it's not only about knowledge this interest.",
                    "label": 0
                },
                {
                    "sent": "Is because the third element of the professional community is its explicit business orientation.",
                    "label": 0
                },
                {
                    "sent": "This knowledge is made to make money out of it.",
                    "label": 0
                },
                {
                    "sent": "So the mechanism by which the business is made within a professional with the community is when a customer is a need for a specific knowledge service.",
                    "label": 0
                },
                {
                    "sent": "Then a virtual team of individuals.",
                    "label": 0
                },
                {
                    "sent": "The best one is self aggregating to respond to this kind of needs.",
                    "label": 0
                },
                {
                    "sent": "And then the visual team can provide this customer specific professional services.",
                    "label": 0
                },
                {
                    "sent": "In these cases, we made the example that one guy from the University and to individual professional where the best one for providing a professional services to satisfy these needs, and then at the end money money, go back to the people that have delivered this service.",
                    "label": 0
                },
                {
                    "sent": "So this is the economic business explicit orientation of.",
                    "label": 0
                },
                {
                    "sent": "Of the community.",
                    "label": 0
                },
                {
                    "sent": "The people see member interaction is optimized by the synergic use of ICT mediated and also face to face mechanism.",
                    "label": 1
                },
                {
                    "sent": "So is not only virtual contact among people but there also a balance among virtual physical meeting.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What is the PVC mission then?",
                    "label": 1
                },
                {
                    "sent": "the PC mission consists in the generation of value and the mechanism to generate is the interaction among people sharing and collaboration.",
                    "label": 1
                },
                {
                    "sent": "And this value is a trifle balance.",
                    "label": 1
                },
                {
                    "sent": "One is the generation of advanced knowledge, the other one the generation of professional services to exploit the advanced knowledge that is being generated and the social capital, the social relationship among the members.",
                    "label": 0
                },
                {
                    "sent": "The PC has been designed to, with two main objective.",
                    "label": 0
                },
                {
                    "sent": "The one is to be a mechanism to deliver innovation.",
                    "label": 0
                },
                {
                    "sent": "So we're talking about generation of frontier knowledge, advanced knowledge on a specific knowledge scope, but not just for making new idea, but with the mechanism of professional services to introduce this frontier knowledge in industrial reality.",
                    "label": 0
                },
                {
                    "sent": "And also the other.",
                    "label": 0
                },
                {
                    "sent": "Design requirement is to maximize the relative maximize the realization of individuals.",
                    "label": 1
                },
                {
                    "sent": "So the PVC to self is an organizational form that has been designed to maximize satisfaction of knowledge workers through the coincidence of the objective of the individual and the organization itself.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What we have now while we are developing this new concept, what we call a new concept professional Utah Community becausw we think that all the three element, the social knowledge and the business element must be accounted for in such a kind of a community to be successful.",
                    "label": 0
                },
                {
                    "sent": "This is the example of community of practice.",
                    "label": 0
                },
                {
                    "sent": "Community of practice has been around from since 10 years.",
                    "label": 0
                },
                {
                    "sent": "Now within large Corporation.",
                    "label": 0
                },
                {
                    "sent": "And our social.",
                    "label": 0
                },
                {
                    "sent": "Settings that are put up by this Corporation to share knowledge so there is a big knowledge component, some social aspect, but there is no explicit business thing there.",
                    "label": 0
                },
                {
                    "sent": "So what have the problem community of practice do not overcome existing organizational barrier becausw.",
                    "label": 1
                },
                {
                    "sent": "The lack of explicit business dimension jeopardize member motivation member not motivated also by ability.",
                    "label": 1
                },
                {
                    "sent": "That is, the motivation of the companies of the employers reduce the scope of community activities.",
                    "label": 0
                },
                {
                    "sent": "In pizza, deep sharing and also induced mistrust because of hidden companies or members objectives.",
                    "label": 1
                },
                {
                    "sent": "So there is a need to evolve towards a more balanced kind of community that shall address the three element altogether, and so the need to evolve from the blueish color that is one of the community of practice.",
                    "label": 0
                },
                {
                    "sent": "There are more oriented knowledge to a color that is more white.",
                    "label": 0
                },
                {
                    "sent": "This combination, more balanced combination of social, business and knowledge aspects.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What is then the positioning of this professional services, the marketing positioning of the professional services that the professional community is intended to deliver?",
                    "label": 1
                },
                {
                    "sent": "I've said already that they are exploring and exploiting a frontier knowledge that may consist of original application of state of the art knowledge first implementation.",
                    "label": 1
                },
                {
                    "sent": "This is the relevant.",
                    "label": 1
                },
                {
                    "sent": "The key aspect of emerging innovative methodology.",
                    "label": 0
                },
                {
                    "sent": "So the professional community are belonging researchers from University people for company.",
                    "label": 0
                },
                {
                    "sent": "The professional community is not competing in the business scenario with these entities because every.",
                    "label": 0
                },
                {
                    "sent": "The organization is still doing his work, University Research Center and company, but the professional services are focused on this specific aspect that are not covered well of each of these organizations, so they are collaborating with this already existing entities.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "These are the three typology we have identified so far of community.",
                    "label": 0
                },
                {
                    "sent": "The one it depends on the knowledge scope, the one the first one is about an established discipline like the acoustic expert and then we can have another typology incipient discipline, a multidisciplinary combination and also the challenge focused PVC that is aimed at addressing a specific challenge.",
                    "label": 1
                },
                {
                    "sent": "So without discipline knowledge.",
                    "label": 0
                },
                {
                    "sent": "So these three kinds of PVC are related to three kinds of innovation.",
                    "label": 1
                },
                {
                    "sent": "They can deliver the first one, more incremental innovation.",
                    "label": 1
                },
                {
                    "sent": "The second one, the stepwise innovation from the application of A of an emerging knowledge discipline, and the other one is more prone to deliver breakthrough innovation.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the life cycle we have already seen this morning many times that I would like to stress.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our attention on the governance principle that the PVC on which the PVC is based on the first one is empowerment.",
                    "label": 1
                },
                {
                    "sent": "These are very human centric kind of organization.",
                    "label": 0
                },
                {
                    "sent": "the PC is so all decision responsibility must be taken as far as possible at the lowest hierarchical level.",
                    "label": 1
                },
                {
                    "sent": "The self commitment is second point.",
                    "label": 0
                },
                {
                    "sent": "That means that the members participation is not induced or decide apriori.",
                    "label": 0
                },
                {
                    "sent": "The PDC member is not an employee of the PC is it is his decision, the quantity and typology of activity that is performing within the community.",
                    "label": 0
                },
                {
                    "sent": "The other one is the self organizing leadership.",
                    "label": 0
                },
                {
                    "sent": "That means that hierarchy, the leadership is not the desired.",
                    "label": 1
                },
                {
                    "sent": "I priore as much as possible by hierarchical structure, but there are the organization of collaborative activities left to the people that are actually performing this activity and are emerging as leader.",
                    "label": 0
                },
                {
                    "sent": "And then the 4th is the peer assessment.",
                    "label": 0
                },
                {
                    "sent": "Maybe because we are trying to make a very flat organization.",
                    "label": 1
                },
                {
                    "sent": "Anytime there is the necessity of a subjective evaluation not supported by objective data, there is not an hierarchical mechanism to design by by the decision is made by an assessment made by peer.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now let's have a look to a scenario and implementation scenario of PVC we have here what we can call a network as Mccluster.",
                    "label": 0
                },
                {
                    "sent": "I choose this example because we have all networks here.",
                    "label": 0
                },
                {
                    "sent": "And the Orange Big Circle is representing this SMB networks or virtual organization building environment that is producing prepared Ness and support for the creation of virtual organization to deliver products and services to customers.",
                    "label": 0
                },
                {
                    "sent": "In the aeronautical case can be the big OEM of Airbus or something like that, and the VR can deliver a product component.",
                    "label": 0
                },
                {
                    "sent": "In this supply chain, so this kind of PVC that is entangled with this V is a PVC that is mostly made of knowledge.",
                    "label": 1
                },
                {
                    "sent": "Workers employed by the companies belonging to the VB and the Knowledge scope will be a core competency of this cluster, something that make difference among competitive advantage towards other competitors in the field.",
                    "label": 1
                },
                {
                    "sent": "So the mechanism will be that.",
                    "label": 0
                },
                {
                    "sent": "This PC is elaborating this core competancies is nurturing is developing and these selling professional services internally to the network.",
                    "label": 0
                },
                {
                    "sent": "To the single company or.",
                    "label": 0
                },
                {
                    "sent": "Can be can produce virtual team that are part of the view.",
                    "label": 0
                },
                {
                    "sent": "These two increase the overall quality level of the video products and so the VB success.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In this case, just few benefits from the side of the network in introduction of entangled PVC can bring this kind of bank benefits, such as the minimisation overall network costs through the sharing of the knowledge resource.",
                    "label": 1
                },
                {
                    "sent": "Is this is the basic level, the knowledge sharing and then cost of reduction, but also the other point is to enable and control innovation cycle within the network.",
                    "label": 0
                },
                {
                    "sent": "Infer Corporation readiness through the social capital that is built among the people.",
                    "label": 0
                },
                {
                    "sent": "Then you infer cooperation readiness among DSM in the network.",
                    "label": 1
                },
                {
                    "sent": "To improve the way in which companies in the network interact with University and Research Center.",
                    "label": 0
                },
                {
                    "sent": "Because you are boosting a mechanism that is making an ongoing collaboration among these people, not a doc.",
                    "label": 1
                },
                {
                    "sent": "Only when you need some expertise, then it becomes difficult to share things to manage flex flexible knowledge resources like freelance consultants in a controlled manner.",
                    "label": 0
                },
                {
                    "sent": "Or to retain network knowledge by including the Community people that are retiring the retired people from this company.",
                    "label": 0
                },
                {
                    "sent": "Motivate knowledge workers.",
                    "label": 0
                },
                {
                    "sent": "This is by design.",
                    "label": 0
                },
                {
                    "sent": "The main objective of the PVC and so on.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the conceptual framework and this is a view of the tool that we are going to develop to support the functioning of professional community.",
                    "label": 0
                },
                {
                    "sent": "I won't speak about that, 'cause I will shortly introduce Surgicals Merali from TST.",
                    "label": 0
                },
                {
                    "sent": "That is the responsible for development of all the.",
                    "label": 0
                },
                {
                    "sent": "Software product.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sites and just I want to spend some few words on this.",
                    "label": 0
                },
                {
                    "sent": "Last you file I have to show you what is the portfolio solution that we are developing in this work package for professional with community.",
                    "label": 0
                },
                {
                    "sent": "On the left side you see the potential clients that can be existing Community existing virtual community that are not KBS community.",
                    "label": 0
                },
                {
                    "sent": "So they want to evolve by introducing.",
                    "label": 0
                },
                {
                    "sent": "An explicit business dimension or a social dimension.",
                    "label": 0
                },
                {
                    "sent": "If something is missing.",
                    "label": 0
                },
                {
                    "sent": "Other clients can be regional developing institution that want to boost the social economic development of the region over the territorial industrial settings.",
                    "label": 0
                },
                {
                    "sent": "Other client are the network manager Dbmanager, the example we are showing before another one.",
                    "label": 0
                },
                {
                    "sent": "Maybe the large enterprises that want to introduce professional virtual community within the value network of their supplier.",
                    "label": 1
                },
                {
                    "sent": "What is the portfolio var solution?",
                    "label": 0
                },
                {
                    "sent": "We can we have a distinction among methodological and software solution.",
                    "label": 0
                },
                {
                    "sent": "The methodological side?",
                    "label": 0
                },
                {
                    "sent": "We are developing a PVC conceptual framework and value system.",
                    "label": 1
                },
                {
                    "sent": "Reference elements of the business model of professional lifter community and guidelines for the instantiation of this reference elements.",
                    "label": 0
                },
                {
                    "sent": "Governance and organizational principle.",
                    "label": 0
                },
                {
                    "sent": "This is on the strategic and design phase on the operational phase.",
                    "label": 0
                },
                {
                    "sent": "Then we are developing reference business processes and guidelines.",
                    "label": 1
                },
                {
                    "sent": "For instance station organizational settings.",
                    "label": 0
                },
                {
                    "sent": "All these methodological.",
                    "label": 0
                },
                {
                    "sent": "Results have been already defined as as a first instantiation, so now from now on we're going to refine these results to consolidated on the software side, we have customized portal for PVC with the standard functionality such as membership management, members, profiling, knowledge management, communication, virtual team establishment and we are developing specific ICT module.",
                    "label": 1
                },
                {
                    "sent": "One is for IPR tracking, another for social business networking, but surgery will talk more about that and in between we are also developing.",
                    "label": 0
                },
                {
                    "sent": "We have a task that is started one month ago that will end the six in six months.",
                    "label": 0
                },
                {
                    "sent": "The templates for PVC agreement so that are legally binding or not agreement that we need to establish a PVC, such as the statue, the membership agreement, the agreement among the team members.",
                    "label": 0
                },
                {
                    "sent": "And others that we have evidence in our conceptual framework development.",
                    "label": 0
                },
                {
                    "sent": "So for me it's all.",
                    "label": 0
                },
                {
                    "sent": "If you have a question now.",
                    "label": 0
                },
                {
                    "sent": "Or maybe we can.",
                    "label": 0
                },
                {
                    "sent": "I will pass the word to Sergio to talk about software tools.",
                    "label": 0
                },
                {
                    "sent": "Work package 4.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                }
            ]
        }
    }
}