{
    "id": "hvkrt5bbhjhs65q6vcsb6wvw6plsqj6t",
    "title": "Human dynamics revealed through Web analytics",
    "info": {
        "author": [
            "José Javier Ramasco, Institute for Cross-Disciplinary Physics and Complex Systems (IFISC)"
        ],
        "published": "Sept. 26, 2008",
        "recorded": "August 2008",
        "category": [
            "Top->Computer Science->Web Mining"
        ]
    },
    "url": "http://videolectures.net/cvss08_ramasco_hdrtwa/",
    "segmentation": [
        [
            "Yeah, well, I mean I first of all I would like to thank the organization for the possibility of being here has been very interesting.",
            "The conference, I mean one of the most interesting aspects is the questions.",
            "The kind of questions that have been raised in the in the discussions and so here I will try to offer some.",
            "Let's say I really advance, but at least research on those questions.",
            "So in this case, what we're going to do is to use.",
            "The registers of how people use the web pages, so the Internet to try to infer something about which kind of mechanism are you want leading this process know how you want, which is the ultimate, but at least the general rules that can be applied in this in this system so well.",
            "This is a work done in collaboration with Bruno.",
            "Services it was a busy student at the time in Emily and now it's moving too.",
            "I used to Indiana University and while I am in the ISI Institute that has nothing to do with that.",
            "I have a lot of knowledge so please don't.",
            "Please don't blame me for for the rank is that you get in there but.",
            "It's a foundation that is relatively all this.",
            "It's working in complex systems and now we're trying to increase the activity of the group on complex networks and applications so."
        ],
        [
            "This is the first of line of what I'm going to show you, so first I will introduce what I understand by this web surfing, which is relatively clear and then I show you a numbers about our database.",
            "So what?",
            "What kind of raw data we have to play with and then I will try to infer from there some kind of information about the population dynamics, so the operation of the full users of the database and then some statistics like this interactive statistics or or if there is or not preferential linking into the the use of the different elements of the system, and I will conclude with with that."
        ],
        [
            "So first of all of all, which is this thing of web surfing and which is the object of the study so that accounts from Emory University?",
            "So this is a University, and as such you have students that can be still be doing this kind of things background so.",
            "But essentially what we have is the use of the data of the web pages of the University.",
            "So that's probably exclude this kind of user.",
            "Out of out of it."
        ],
        [
            "The data is formed by the web logs and this is something that many people don't know, but essentially we do navigating the Internet.",
            "Everything that you do remains register, and that's kind of a warning too.",
            "So every time that you do a click in a web page, the server machine of that domain keeps essentially which IP is doing that click which webpage visited an especially for.",
            "I mean for us it was interesting.",
            "Also, the time in which it happens just to give you a look of how the web page is.",
            "Domain is this one.",
            "OK so is the web page of the University, and even though here it doesn't look like there are many many web pages below this.",
            "This is distractor.",
            "Yes, go back.",
            "So I will give you.",
            "Also some numbers on it.",
            "This is how the information is registered, and for that I'm going to tell you something also about the University Emory University.",
            "So this is what is located is in Atlanta.",
            "That is a medium sized going to Big City in the South because it's one of the biggest cities of this area of the US and the universities."
        ],
        [
            "Relatively small to serviced in the sense of numbers at this of students is 12,000 but continuous stuff and the faculties has relatively respectable number.",
            "It the first thing that surprised us from here is that when you look at the database.",
            "And database is formed by the interest in the in the web logs of.",
            "So if the web logs so that means the interest in the Emory University server from April 2005 to almost generous next week.",
            "So it's a 41 weeks.",
            "And not a full year, but but almost and then as I was telling you this entrance are registered with the resolution of 1 second and what surprises more was these numbers.",
            "So essentially the number of IPS and this is something I have to warn here that we don't know the IP exactly because of course for a privacy reasons that was forbidden.",
            "So we have just an identification number that is kept coherently along time.",
            "So you can identify the users but not the real information about who they are.",
            "So, but we got this number 3 million different IPS, so that would mean 3 million different computers to some extent is not exactly the mapping, but and then the full domain of the University contains around 25 million web pages.",
            "And during all this.",
            "There was a total of 50 million clicks in this in this pages.",
            "So."
        ],
        [
            "Let's go down to the 1st."
        ],
        [
            "You want funny thing, this is the activity.",
            "So number of clicks but they are doing it all the food period of the database and as you see here I mean this is what started setting on what I want to show you about the population dynamics.",
            "There is a clear oscillation here.",
            "So the solutions are provided by the Savior in some of the users of this.",
            "Of these patches that are essentially people.",
            "So this week a week.",
            "In this, in this basic oscillations, and then there are some other things like this special periods here that I will tell you a later about about them a little more."
        ],
        [
            "So you take the average of what is happening every day on the week.",
            "You have to make a differentiation.",
            "For the different weeks of the different days of the week.",
            "Because of course, the things happens in a different way.",
            "So what we did here and I don't know if you can see it well.",
            "I mean this is course I said average of the.",
            "In databases for Saturday.",
            "And there are bus at two Sigma, so essentially 90 percent 95% confidence interval in within this disservice.",
            "And what you see is, I mean, the activity essentially has this kind of peculiar pattern in which you have the mountains that are practically active, and then you have Tuesday, Wednesday and so on that are more or less flat.",
            "And then the things go down for the for the weekend.",
            "The black points here are the Thanksgiving week, so this is a very particular time in the in the here in the US, because this application.",
            "So essentially you can see how these things go out of the green lines market and this other dates in which the Thanksgiving happened.",
            "During this period of time, this market, sensitive vacation time and you see that the dots are well below the normal activity.",
            "But there are some surprises, not increases this here, in which the twisted before was more active than usual.",
            "This happens with the one after after the holiday.",
            "This is what happens if you look at it hour by hour now, so this is the number of clicks."
        ],
        [
            "Tower and then you hear hear you have the.",
            "Happens in the different server, so the day is starting at 6:00 AM.",
            "And there's there's.",
            "There's also kind of separated the results also by the different days now.",
            "So this is the black black dots correspond to the weekdays, the red dots to what happens in Saturday's, and these are the Sundays.",
            "So as you see I mean there is an increase clear increases after 6:00 AM and there are two peaks separated by lunchtime and after The thing is 5 more or less.",
            "Many people censoring students and members of the staff is already way and there is this factor.",
            "Activity here more or less till then, and then even the post looks at the students go home.",
            "So this is actually.",
            "I mean, if you want kind of folkloristic approach and this is the first."
        ],
        [
            "Contact with the data and we wanted to see if we could say anything about the full population with with that, so at least one of the interesting thing about these groups is that you want this is the most basic part of human habits, so the same as you can say that there is an apology for the animals and you say OK, they usually go for lunch at night.",
            "You can do similar things for the humans and this course that I have show you.",
            "I have appear in different studies before, so there are some chances that this is a kind of universal.",
            "Some some extent behavioral.",
            "Of the humans and the next thing that we wanted to do was to study something more about the particular uses is we have them separated and we can individualize them now.",
            "So this is what we did in this in this curve.",
            "What we have here is essentially that I'm measuring seconds between two events and we call that this kind of relation.",
            "So we have the IP that is essentially a user or computer and it connects to a certain webpage and we measure which is the time that.",
            "It takes till there is another click in this same connection and this is what is represented here.",
            "In lock lock.",
            "And well, there has been a lot of discussion here.",
            "If there was power loss or not.",
            "I hope this can visually a little.",
            "But there is something that I mean this is more or less a polar up to here.",
            "Yeah after that there is a.",
            "There is another thing important thing here is that there is a model proposed by Barabasi explaining this kind of behavior inside the model is which you have.",
            "You have some agents and they have certain task to do know it's in.",
            "This tax has a priority.",
            "So if the agents choose the tasks based on only the priority.",
            "Then the only task that is chosen is the one with highest priority, and then there is no noise statistics inside here, but you choose.",
            "The task is usually chosen as the maximum priority.",
            "To do plus something very small probability of getting one at random, you get this kind of curves and he was predicting this minus one exponent.",
            "So this was a compilation of what he proposed and also what he has already found that."
        ],
        [
            "With emails and what we wanted to do was essentially to extend this kind of thing.",
            "So we are bunch of little more and the next step was to check another thing.",
            "So not only does a user with a certain webpage every particular web page, but what does a user with any web page in the domain.",
            "And this is the statistics that you find here.",
            "So this is this main live here and we found actually that the expert here is different.",
            "So that was a kind of curious, curious thing at the meeting, so I was.",
            "I mean, we were thinking we have to find a.",
            "Reason for that I mean that there shouldn't be a very strong iteration of the model to actually obtain this kind of behavior, and it is not because I mean what the only thing that you have to assume is that actually people when go to for a web page.",
            "So don't don't see that that's a single task is not like you have to go to the bank and that single single thing by by itself.",
            "But when you have to do some kind of work on the on the web, it usually implies the use of several group of web pages.",
            "So U group this.",
            "In the model you group this task and consider more than more than three, but you get this this this point.",
            "This is the simulation of the model, so I mean this is playing this kind of behavior in the.",
            "No, no, this these are.",
            "These are just bins and also here.",
            "Add yes yes.",
            "Yes, well in this one Sir are located make.",
            "But I mean put in as much as possible in the."
        ],
        [
            "And then the other thing that we wanted to test was the idea of preferential linking.",
            "So as you have seen with also with very nice talk for the first day with banana human, there are several competing ideas.",
            "When is this preferential linking and the other is his model about multiplicative process.",
            "Actually the basic idea of the two are relatively equivalent.",
            "Is this kind of behavior so the increase of a quantity essentially proportional to what you have already in that quantity, and that you assume that?",
            "Processes is linear, listing the preferential interlinking leads to a power law behavior in the in the statistics.",
            "So what we have there is a plot how the users explore the web page.",
            "So in this case at the IPS and the CAP IP means the number of different web pages they have explored.",
            "So since I mean this morning, there was a discussion about integrating or integrating the in time data here we have tried to do it carefully and these are essentially an increase of a single day.",
            "After completion of one week, so as you have seen, we have 41 weeks.",
            "So then we have just make every server over all of it and as you can see I mean the blue lines are always linear linear behavior and this is what you find for the users.",
            "This is what happens with the website attracting a new users.",
            "And well, I'm probably you cannot even see the blue line.",
            "This is below the points and this is their relation.",
            "Single user single work.",
            "So the number of clicks that is attractive.",
            "So I mean most.",
            "In most of the cases, I would say that this in this short time things seems to work.",
            "I mean this is this is to be a linear linear process.",
            "However, there are always some something behind all of this, and another already spent it somehow.",
            "I mean there what is happening is there is something?"
        ],
        [
            "That is, assuming the preferences attachment model that can or cannot be true in this case.",
            "But I will tell you which one it is, but there is the problem of stability along along time.",
            "So different time Windows can give you something that is consistent or not.",
            "And you can see here we did was to plot the number of websites that uses a explore an aggravated aggregated data week by week, or aggravating also, or seeing the full database.",
            "So essentially the full.",
            "We have the true to 90 days and in this case in the number of web pages provide users is consistent.",
            "The cops are similar and they can be actually if you fit this part by Prolog you can get.",
            "Respondent out of it.",
            "However, if you do the same for the web pages, you get this kind of things.",
            "So essentially what happens here is that for the statistics for a single week, you have this kind of curve.",
            "This is a cumulative function and the statistical.",
            "This is completely different, so you can say OK, there is something here that this is going wrong, and I mean you look at that.",
            "What happens between users on a single warps you get also the same.",
            "This in different in the in the case number this is coming probably from here and what is?"
        ],
        [
            "Is going differently from the assumptions of the very basic model of preferential attachment.",
            "Is the number of how the number of new agents are entering the system agents means in this case, what page is it because for the users that's true.",
            "I mean, the rate of interest is constant and everything seems to work as as in the model for the web pages.",
            "This is not true.",
            "I mean there is as I was telling you there are two periods of the year that are very special for the University life and these are the starting at the end of the semester.",
            "So essentially, the number of which is changed dramatically understand that's.",
            "Here.",
            "What you have is the last scenes for us is the last time we see a click on a certain webpage.",
            "So there is a big debt of web pages in this area and a big that here all the rest of the year is true.",
            "Probably the two mechanisms are OK, but in this particular moment, that's not.",
            "That's not true.",
            "So.",
            "And that's essentially changed the rules so you don't get unstable power law in the diploids."
        ],
        [
            "And well, I mean this was more or less what I wanted to tell you.",
            "We have studied this database that is relatively big, so statistically is consistent and what we wanted to do was to strike first kind of lazy pattern of activity of the Community to see what we can say about human habits and and then we wanted to check these two mechanisms.",
            "So if Quinn was actually there or if preferentially linking was actually the and the answer is Q and seems to be there.",
            "Differential linking in this kind of behavior is there in short time scales.",
            "Then you have the problem of the content so web pages can die and the content cannot be interested anymore.",
            "So they start to lose users.",
            "And that's something that you have to include in the model.",
            "If you want to really represent that.",
            "And of course we have still many open questions.",
            "We did database, but we're still working with with that, so thank you very much for your attention.",
            "So we have about 10 minutes for questions.",
            "Go over again why you think there is priority."
        ],
        [
            "So if I understand correctly, you have a set of web pages.",
            "Now you have people from all over the world.",
            "Particular web page yeah.",
            "We are looking at.",
            "Interval between successive.",
            "Between two accesses to the page, necessarily from the same no.",
            "No, this is a statistic of the access Act."
        ],
        [
            "Success of the page by the same user.",
            "So we consider it it's ready to priority because I mean most of these web pages are related to work, not like you visit.",
            "Yeah, well, it's averaged over all the users, but it's one user one page, so we only consider this kind of timing here, right?",
            "So if you would be looking at the curve for a single user, what would it look like?",
            "A single user who I don't know?",
            "Much more noisy than this?",
            "That for that's for sure.",
            "I haven't.",
            "I haven't check.",
            "This any of the users what?",
            "What would be the maximum number of successes for a single user?",
            "That depends.",
            "I haven't shown here what happens we have take in the activity of independent users that are not the statistics between times and you have a group of different users.",
            "Essentially you can say I mean there are some of them that are automatic machines that are trying to access web pages.",
            "Usually you can say them apart from the humans.",
            "Safeway because they enter all the time.",
            "I mean they are very recursive on the entrance, so there should be in this in this area.",
            "Here in the short time.",
            "Then the humans you see that they have a very spike like like behavior.",
            "So they are probably responsible for most of these of this thing.",
            "Here one of the surprising things.",
            "If you are saying would suggest that there are different time scales depending on the type of users, there are.",
            "Yes, yes user as a characteristic timescale, which means that each user is not scale free, but model is about single users 'cause they're the ones.",
            "Yeah no, but that depends because automatic users don't have a characteristic timescale.",
            "Usually very short.",
            "This is probably what they don't say.",
            "This kind of statistics the humans know they have a very clear.",
            "But I mean, if you have a clear, long, long time periods without activity in a typical human.",
            "And also it seems that both the amplitude of the clicks I can show you later if you want the plots because it's in the in the in the print so that the amplitude and the Internet a bedtime seems to be very well distributed in humans."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, well, I mean I first of all I would like to thank the organization for the possibility of being here has been very interesting.",
                    "label": 0
                },
                {
                    "sent": "The conference, I mean one of the most interesting aspects is the questions.",
                    "label": 0
                },
                {
                    "sent": "The kind of questions that have been raised in the in the discussions and so here I will try to offer some.",
                    "label": 0
                },
                {
                    "sent": "Let's say I really advance, but at least research on those questions.",
                    "label": 0
                },
                {
                    "sent": "So in this case, what we're going to do is to use.",
                    "label": 0
                },
                {
                    "sent": "The registers of how people use the web pages, so the Internet to try to infer something about which kind of mechanism are you want leading this process know how you want, which is the ultimate, but at least the general rules that can be applied in this in this system so well.",
                    "label": 0
                },
                {
                    "sent": "This is a work done in collaboration with Bruno.",
                    "label": 0
                },
                {
                    "sent": "Services it was a busy student at the time in Emily and now it's moving too.",
                    "label": 0
                },
                {
                    "sent": "I used to Indiana University and while I am in the ISI Institute that has nothing to do with that.",
                    "label": 0
                },
                {
                    "sent": "I have a lot of knowledge so please don't.",
                    "label": 0
                },
                {
                    "sent": "Please don't blame me for for the rank is that you get in there but.",
                    "label": 0
                },
                {
                    "sent": "It's a foundation that is relatively all this.",
                    "label": 0
                },
                {
                    "sent": "It's working in complex systems and now we're trying to increase the activity of the group on complex networks and applications so.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the first of line of what I'm going to show you, so first I will introduce what I understand by this web surfing, which is relatively clear and then I show you a numbers about our database.",
                    "label": 1
                },
                {
                    "sent": "So what?",
                    "label": 0
                },
                {
                    "sent": "What kind of raw data we have to play with and then I will try to infer from there some kind of information about the population dynamics, so the operation of the full users of the database and then some statistics like this interactive statistics or or if there is or not preferential linking into the the use of the different elements of the system, and I will conclude with with that.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first of all of all, which is this thing of web surfing and which is the object of the study so that accounts from Emory University?",
                    "label": 1
                },
                {
                    "sent": "So this is a University, and as such you have students that can be still be doing this kind of things background so.",
                    "label": 0
                },
                {
                    "sent": "But essentially what we have is the use of the data of the web pages of the University.",
                    "label": 0
                },
                {
                    "sent": "So that's probably exclude this kind of user.",
                    "label": 0
                },
                {
                    "sent": "Out of out of it.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The data is formed by the web logs and this is something that many people don't know, but essentially we do navigating the Internet.",
                    "label": 0
                },
                {
                    "sent": "Everything that you do remains register, and that's kind of a warning too.",
                    "label": 0
                },
                {
                    "sent": "So every time that you do a click in a web page, the server machine of that domain keeps essentially which IP is doing that click which webpage visited an especially for.",
                    "label": 0
                },
                {
                    "sent": "I mean for us it was interesting.",
                    "label": 0
                },
                {
                    "sent": "Also, the time in which it happens just to give you a look of how the web page is.",
                    "label": 0
                },
                {
                    "sent": "Domain is this one.",
                    "label": 0
                },
                {
                    "sent": "OK so is the web page of the University, and even though here it doesn't look like there are many many web pages below this.",
                    "label": 0
                },
                {
                    "sent": "This is distractor.",
                    "label": 0
                },
                {
                    "sent": "Yes, go back.",
                    "label": 0
                },
                {
                    "sent": "So I will give you.",
                    "label": 0
                },
                {
                    "sent": "Also some numbers on it.",
                    "label": 0
                },
                {
                    "sent": "This is how the information is registered, and for that I'm going to tell you something also about the University Emory University.",
                    "label": 0
                },
                {
                    "sent": "So this is what is located is in Atlanta.",
                    "label": 0
                },
                {
                    "sent": "That is a medium sized going to Big City in the South because it's one of the biggest cities of this area of the US and the universities.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Relatively small to serviced in the sense of numbers at this of students is 12,000 but continuous stuff and the faculties has relatively respectable number.",
                    "label": 0
                },
                {
                    "sent": "It the first thing that surprised us from here is that when you look at the database.",
                    "label": 1
                },
                {
                    "sent": "And database is formed by the interest in the in the web logs of.",
                    "label": 1
                },
                {
                    "sent": "So if the web logs so that means the interest in the Emory University server from April 2005 to almost generous next week.",
                    "label": 0
                },
                {
                    "sent": "So it's a 41 weeks.",
                    "label": 0
                },
                {
                    "sent": "And not a full year, but but almost and then as I was telling you this entrance are registered with the resolution of 1 second and what surprises more was these numbers.",
                    "label": 0
                },
                {
                    "sent": "So essentially the number of IPS and this is something I have to warn here that we don't know the IP exactly because of course for a privacy reasons that was forbidden.",
                    "label": 0
                },
                {
                    "sent": "So we have just an identification number that is kept coherently along time.",
                    "label": 0
                },
                {
                    "sent": "So you can identify the users but not the real information about who they are.",
                    "label": 0
                },
                {
                    "sent": "So, but we got this number 3 million different IPS, so that would mean 3 million different computers to some extent is not exactly the mapping, but and then the full domain of the University contains around 25 million web pages.",
                    "label": 0
                },
                {
                    "sent": "And during all this.",
                    "label": 0
                },
                {
                    "sent": "There was a total of 50 million clicks in this in this pages.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's go down to the 1st.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You want funny thing, this is the activity.",
                    "label": 0
                },
                {
                    "sent": "So number of clicks but they are doing it all the food period of the database and as you see here I mean this is what started setting on what I want to show you about the population dynamics.",
                    "label": 0
                },
                {
                    "sent": "There is a clear oscillation here.",
                    "label": 0
                },
                {
                    "sent": "So the solutions are provided by the Savior in some of the users of this.",
                    "label": 0
                },
                {
                    "sent": "Of these patches that are essentially people.",
                    "label": 0
                },
                {
                    "sent": "So this week a week.",
                    "label": 0
                },
                {
                    "sent": "In this, in this basic oscillations, and then there are some other things like this special periods here that I will tell you a later about about them a little more.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So you take the average of what is happening every day on the week.",
                    "label": 0
                },
                {
                    "sent": "You have to make a differentiation.",
                    "label": 0
                },
                {
                    "sent": "For the different weeks of the different days of the week.",
                    "label": 0
                },
                {
                    "sent": "Because of course, the things happens in a different way.",
                    "label": 0
                },
                {
                    "sent": "So what we did here and I don't know if you can see it well.",
                    "label": 0
                },
                {
                    "sent": "I mean this is course I said average of the.",
                    "label": 0
                },
                {
                    "sent": "In databases for Saturday.",
                    "label": 0
                },
                {
                    "sent": "And there are bus at two Sigma, so essentially 90 percent 95% confidence interval in within this disservice.",
                    "label": 0
                },
                {
                    "sent": "And what you see is, I mean, the activity essentially has this kind of peculiar pattern in which you have the mountains that are practically active, and then you have Tuesday, Wednesday and so on that are more or less flat.",
                    "label": 0
                },
                {
                    "sent": "And then the things go down for the for the weekend.",
                    "label": 0
                },
                {
                    "sent": "The black points here are the Thanksgiving week, so this is a very particular time in the in the here in the US, because this application.",
                    "label": 0
                },
                {
                    "sent": "So essentially you can see how these things go out of the green lines market and this other dates in which the Thanksgiving happened.",
                    "label": 0
                },
                {
                    "sent": "During this period of time, this market, sensitive vacation time and you see that the dots are well below the normal activity.",
                    "label": 0
                },
                {
                    "sent": "But there are some surprises, not increases this here, in which the twisted before was more active than usual.",
                    "label": 0
                },
                {
                    "sent": "This happens with the one after after the holiday.",
                    "label": 0
                },
                {
                    "sent": "This is what happens if you look at it hour by hour now, so this is the number of clicks.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tower and then you hear hear you have the.",
                    "label": 0
                },
                {
                    "sent": "Happens in the different server, so the day is starting at 6:00 AM.",
                    "label": 0
                },
                {
                    "sent": "And there's there's.",
                    "label": 0
                },
                {
                    "sent": "There's also kind of separated the results also by the different days now.",
                    "label": 0
                },
                {
                    "sent": "So this is the black black dots correspond to the weekdays, the red dots to what happens in Saturday's, and these are the Sundays.",
                    "label": 0
                },
                {
                    "sent": "So as you see I mean there is an increase clear increases after 6:00 AM and there are two peaks separated by lunchtime and after The thing is 5 more or less.",
                    "label": 0
                },
                {
                    "sent": "Many people censoring students and members of the staff is already way and there is this factor.",
                    "label": 0
                },
                {
                    "sent": "Activity here more or less till then, and then even the post looks at the students go home.",
                    "label": 0
                },
                {
                    "sent": "So this is actually.",
                    "label": 0
                },
                {
                    "sent": "I mean, if you want kind of folkloristic approach and this is the first.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Contact with the data and we wanted to see if we could say anything about the full population with with that, so at least one of the interesting thing about these groups is that you want this is the most basic part of human habits, so the same as you can say that there is an apology for the animals and you say OK, they usually go for lunch at night.",
                    "label": 0
                },
                {
                    "sent": "You can do similar things for the humans and this course that I have show you.",
                    "label": 0
                },
                {
                    "sent": "I have appear in different studies before, so there are some chances that this is a kind of universal.",
                    "label": 0
                },
                {
                    "sent": "Some some extent behavioral.",
                    "label": 0
                },
                {
                    "sent": "Of the humans and the next thing that we wanted to do was to study something more about the particular uses is we have them separated and we can individualize them now.",
                    "label": 0
                },
                {
                    "sent": "So this is what we did in this in this curve.",
                    "label": 0
                },
                {
                    "sent": "What we have here is essentially that I'm measuring seconds between two events and we call that this kind of relation.",
                    "label": 0
                },
                {
                    "sent": "So we have the IP that is essentially a user or computer and it connects to a certain webpage and we measure which is the time that.",
                    "label": 0
                },
                {
                    "sent": "It takes till there is another click in this same connection and this is what is represented here.",
                    "label": 0
                },
                {
                    "sent": "In lock lock.",
                    "label": 0
                },
                {
                    "sent": "And well, there has been a lot of discussion here.",
                    "label": 0
                },
                {
                    "sent": "If there was power loss or not.",
                    "label": 0
                },
                {
                    "sent": "I hope this can visually a little.",
                    "label": 0
                },
                {
                    "sent": "But there is something that I mean this is more or less a polar up to here.",
                    "label": 0
                },
                {
                    "sent": "Yeah after that there is a.",
                    "label": 0
                },
                {
                    "sent": "There is another thing important thing here is that there is a model proposed by Barabasi explaining this kind of behavior inside the model is which you have.",
                    "label": 0
                },
                {
                    "sent": "You have some agents and they have certain task to do know it's in.",
                    "label": 0
                },
                {
                    "sent": "This tax has a priority.",
                    "label": 0
                },
                {
                    "sent": "So if the agents choose the tasks based on only the priority.",
                    "label": 0
                },
                {
                    "sent": "Then the only task that is chosen is the one with highest priority, and then there is no noise statistics inside here, but you choose.",
                    "label": 0
                },
                {
                    "sent": "The task is usually chosen as the maximum priority.",
                    "label": 0
                },
                {
                    "sent": "To do plus something very small probability of getting one at random, you get this kind of curves and he was predicting this minus one exponent.",
                    "label": 0
                },
                {
                    "sent": "So this was a compilation of what he proposed and also what he has already found that.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With emails and what we wanted to do was essentially to extend this kind of thing.",
                    "label": 0
                },
                {
                    "sent": "So we are bunch of little more and the next step was to check another thing.",
                    "label": 0
                },
                {
                    "sent": "So not only does a user with a certain webpage every particular web page, but what does a user with any web page in the domain.",
                    "label": 0
                },
                {
                    "sent": "And this is the statistics that you find here.",
                    "label": 0
                },
                {
                    "sent": "So this is this main live here and we found actually that the expert here is different.",
                    "label": 0
                },
                {
                    "sent": "So that was a kind of curious, curious thing at the meeting, so I was.",
                    "label": 0
                },
                {
                    "sent": "I mean, we were thinking we have to find a.",
                    "label": 0
                },
                {
                    "sent": "Reason for that I mean that there shouldn't be a very strong iteration of the model to actually obtain this kind of behavior, and it is not because I mean what the only thing that you have to assume is that actually people when go to for a web page.",
                    "label": 0
                },
                {
                    "sent": "So don't don't see that that's a single task is not like you have to go to the bank and that single single thing by by itself.",
                    "label": 0
                },
                {
                    "sent": "But when you have to do some kind of work on the on the web, it usually implies the use of several group of web pages.",
                    "label": 0
                },
                {
                    "sent": "So U group this.",
                    "label": 0
                },
                {
                    "sent": "In the model you group this task and consider more than more than three, but you get this this this point.",
                    "label": 0
                },
                {
                    "sent": "This is the simulation of the model, so I mean this is playing this kind of behavior in the.",
                    "label": 0
                },
                {
                    "sent": "No, no, this these are.",
                    "label": 0
                },
                {
                    "sent": "These are just bins and also here.",
                    "label": 0
                },
                {
                    "sent": "Add yes yes.",
                    "label": 0
                },
                {
                    "sent": "Yes, well in this one Sir are located make.",
                    "label": 0
                },
                {
                    "sent": "But I mean put in as much as possible in the.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then the other thing that we wanted to test was the idea of preferential linking.",
                    "label": 0
                },
                {
                    "sent": "So as you have seen with also with very nice talk for the first day with banana human, there are several competing ideas.",
                    "label": 0
                },
                {
                    "sent": "When is this preferential linking and the other is his model about multiplicative process.",
                    "label": 1
                },
                {
                    "sent": "Actually the basic idea of the two are relatively equivalent.",
                    "label": 0
                },
                {
                    "sent": "Is this kind of behavior so the increase of a quantity essentially proportional to what you have already in that quantity, and that you assume that?",
                    "label": 0
                },
                {
                    "sent": "Processes is linear, listing the preferential interlinking leads to a power law behavior in the in the statistics.",
                    "label": 0
                },
                {
                    "sent": "So what we have there is a plot how the users explore the web page.",
                    "label": 0
                },
                {
                    "sent": "So in this case at the IPS and the CAP IP means the number of different web pages they have explored.",
                    "label": 0
                },
                {
                    "sent": "So since I mean this morning, there was a discussion about integrating or integrating the in time data here we have tried to do it carefully and these are essentially an increase of a single day.",
                    "label": 0
                },
                {
                    "sent": "After completion of one week, so as you have seen, we have 41 weeks.",
                    "label": 0
                },
                {
                    "sent": "So then we have just make every server over all of it and as you can see I mean the blue lines are always linear linear behavior and this is what you find for the users.",
                    "label": 0
                },
                {
                    "sent": "This is what happens with the website attracting a new users.",
                    "label": 0
                },
                {
                    "sent": "And well, I'm probably you cannot even see the blue line.",
                    "label": 0
                },
                {
                    "sent": "This is below the points and this is their relation.",
                    "label": 0
                },
                {
                    "sent": "Single user single work.",
                    "label": 0
                },
                {
                    "sent": "So the number of clicks that is attractive.",
                    "label": 0
                },
                {
                    "sent": "So I mean most.",
                    "label": 0
                },
                {
                    "sent": "In most of the cases, I would say that this in this short time things seems to work.",
                    "label": 0
                },
                {
                    "sent": "I mean this is this is to be a linear linear process.",
                    "label": 0
                },
                {
                    "sent": "However, there are always some something behind all of this, and another already spent it somehow.",
                    "label": 0
                },
                {
                    "sent": "I mean there what is happening is there is something?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That is, assuming the preferences attachment model that can or cannot be true in this case.",
                    "label": 0
                },
                {
                    "sent": "But I will tell you which one it is, but there is the problem of stability along along time.",
                    "label": 0
                },
                {
                    "sent": "So different time Windows can give you something that is consistent or not.",
                    "label": 0
                },
                {
                    "sent": "And you can see here we did was to plot the number of websites that uses a explore an aggravated aggregated data week by week, or aggravating also, or seeing the full database.",
                    "label": 0
                },
                {
                    "sent": "So essentially the full.",
                    "label": 0
                },
                {
                    "sent": "We have the true to 90 days and in this case in the number of web pages provide users is consistent.",
                    "label": 0
                },
                {
                    "sent": "The cops are similar and they can be actually if you fit this part by Prolog you can get.",
                    "label": 0
                },
                {
                    "sent": "Respondent out of it.",
                    "label": 0
                },
                {
                    "sent": "However, if you do the same for the web pages, you get this kind of things.",
                    "label": 0
                },
                {
                    "sent": "So essentially what happens here is that for the statistics for a single week, you have this kind of curve.",
                    "label": 0
                },
                {
                    "sent": "This is a cumulative function and the statistical.",
                    "label": 0
                },
                {
                    "sent": "This is completely different, so you can say OK, there is something here that this is going wrong, and I mean you look at that.",
                    "label": 0
                },
                {
                    "sent": "What happens between users on a single warps you get also the same.",
                    "label": 0
                },
                {
                    "sent": "This in different in the in the case number this is coming probably from here and what is?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is going differently from the assumptions of the very basic model of preferential attachment.",
                    "label": 0
                },
                {
                    "sent": "Is the number of how the number of new agents are entering the system agents means in this case, what page is it because for the users that's true.",
                    "label": 0
                },
                {
                    "sent": "I mean, the rate of interest is constant and everything seems to work as as in the model for the web pages.",
                    "label": 0
                },
                {
                    "sent": "This is not true.",
                    "label": 0
                },
                {
                    "sent": "I mean there is as I was telling you there are two periods of the year that are very special for the University life and these are the starting at the end of the semester.",
                    "label": 0
                },
                {
                    "sent": "So essentially, the number of which is changed dramatically understand that's.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "What you have is the last scenes for us is the last time we see a click on a certain webpage.",
                    "label": 0
                },
                {
                    "sent": "So there is a big debt of web pages in this area and a big that here all the rest of the year is true.",
                    "label": 0
                },
                {
                    "sent": "Probably the two mechanisms are OK, but in this particular moment, that's not.",
                    "label": 0
                },
                {
                    "sent": "That's not true.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "And that's essentially changed the rules so you don't get unstable power law in the diploids.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And well, I mean this was more or less what I wanted to tell you.",
                    "label": 0
                },
                {
                    "sent": "We have studied this database that is relatively big, so statistically is consistent and what we wanted to do was to strike first kind of lazy pattern of activity of the Community to see what we can say about human habits and and then we wanted to check these two mechanisms.",
                    "label": 1
                },
                {
                    "sent": "So if Quinn was actually there or if preferentially linking was actually the and the answer is Q and seems to be there.",
                    "label": 0
                },
                {
                    "sent": "Differential linking in this kind of behavior is there in short time scales.",
                    "label": 0
                },
                {
                    "sent": "Then you have the problem of the content so web pages can die and the content cannot be interested anymore.",
                    "label": 1
                },
                {
                    "sent": "So they start to lose users.",
                    "label": 0
                },
                {
                    "sent": "And that's something that you have to include in the model.",
                    "label": 0
                },
                {
                    "sent": "If you want to really represent that.",
                    "label": 0
                },
                {
                    "sent": "And of course we have still many open questions.",
                    "label": 1
                },
                {
                    "sent": "We did database, but we're still working with with that, so thank you very much for your attention.",
                    "label": 0
                },
                {
                    "sent": "So we have about 10 minutes for questions.",
                    "label": 0
                },
                {
                    "sent": "Go over again why you think there is priority.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if I understand correctly, you have a set of web pages.",
                    "label": 0
                },
                {
                    "sent": "Now you have people from all over the world.",
                    "label": 0
                },
                {
                    "sent": "Particular web page yeah.",
                    "label": 0
                },
                {
                    "sent": "We are looking at.",
                    "label": 0
                },
                {
                    "sent": "Interval between successive.",
                    "label": 0
                },
                {
                    "sent": "Between two accesses to the page, necessarily from the same no.",
                    "label": 0
                },
                {
                    "sent": "No, this is a statistic of the access Act.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Success of the page by the same user.",
                    "label": 0
                },
                {
                    "sent": "So we consider it it's ready to priority because I mean most of these web pages are related to work, not like you visit.",
                    "label": 0
                },
                {
                    "sent": "Yeah, well, it's averaged over all the users, but it's one user one page, so we only consider this kind of timing here, right?",
                    "label": 0
                },
                {
                    "sent": "So if you would be looking at the curve for a single user, what would it look like?",
                    "label": 0
                },
                {
                    "sent": "A single user who I don't know?",
                    "label": 0
                },
                {
                    "sent": "Much more noisy than this?",
                    "label": 0
                },
                {
                    "sent": "That for that's for sure.",
                    "label": 0
                },
                {
                    "sent": "I haven't.",
                    "label": 0
                },
                {
                    "sent": "I haven't check.",
                    "label": 0
                },
                {
                    "sent": "This any of the users what?",
                    "label": 0
                },
                {
                    "sent": "What would be the maximum number of successes for a single user?",
                    "label": 0
                },
                {
                    "sent": "That depends.",
                    "label": 0
                },
                {
                    "sent": "I haven't shown here what happens we have take in the activity of independent users that are not the statistics between times and you have a group of different users.",
                    "label": 0
                },
                {
                    "sent": "Essentially you can say I mean there are some of them that are automatic machines that are trying to access web pages.",
                    "label": 0
                },
                {
                    "sent": "Usually you can say them apart from the humans.",
                    "label": 0
                },
                {
                    "sent": "Safeway because they enter all the time.",
                    "label": 0
                },
                {
                    "sent": "I mean they are very recursive on the entrance, so there should be in this in this area.",
                    "label": 0
                },
                {
                    "sent": "Here in the short time.",
                    "label": 0
                },
                {
                    "sent": "Then the humans you see that they have a very spike like like behavior.",
                    "label": 0
                },
                {
                    "sent": "So they are probably responsible for most of these of this thing.",
                    "label": 0
                },
                {
                    "sent": "Here one of the surprising things.",
                    "label": 0
                },
                {
                    "sent": "If you are saying would suggest that there are different time scales depending on the type of users, there are.",
                    "label": 0
                },
                {
                    "sent": "Yes, yes user as a characteristic timescale, which means that each user is not scale free, but model is about single users 'cause they're the ones.",
                    "label": 0
                },
                {
                    "sent": "Yeah no, but that depends because automatic users don't have a characteristic timescale.",
                    "label": 0
                },
                {
                    "sent": "Usually very short.",
                    "label": 0
                },
                {
                    "sent": "This is probably what they don't say.",
                    "label": 0
                },
                {
                    "sent": "This kind of statistics the humans know they have a very clear.",
                    "label": 0
                },
                {
                    "sent": "But I mean, if you have a clear, long, long time periods without activity in a typical human.",
                    "label": 0
                },
                {
                    "sent": "And also it seems that both the amplitude of the clicks I can show you later if you want the plots because it's in the in the in the print so that the amplitude and the Internet a bedtime seems to be very well distributed in humans.",
                    "label": 0
                }
            ]
        }
    }
}