{
    "id": "hyvgnev53vvdfe5pnlirsf5wzg5n6c6l",
    "title": "On blank nodes",
    "info": {
        "author": [
            "Alejandro Mallea, Pontificia Universidad Catolica de Chile"
        ],
        "published": "Nov. 25, 2011",
        "recorded": "October 2011",
        "category": [
            "Top->Computer Science->Semantic Web->OWL - Web Ontology Language",
            "Top->Computer Science->Semantic Web->Annotation"
        ]
    },
    "url": "http://videolectures.net/iswc2011_mallea_nodes/",
    "segmentation": [
        [
            "1st, I'm just going to give up.",
            "Small context, I am an undergrad student input chili in the Pontifical Catholic University of Chile.",
            "I've done some work with Marcelo Arenas.",
            "This second author and I did that three months research internship in Derry where I work with Axel and Aiden who are here.",
            "So we did this work on black notes.",
            "For me.",
            "It started like like this.",
            "Marcello calls me one day."
        ],
        [
            "And tells me how Alejandro you do you know how black nodes are defined?",
            "I say yeah, sure, I'd read all the normative documents.",
            "I enjoyed very much and and he says well, then you must know that blackness are using other standards as well.",
            "I mean, they are defined in RDF, but they are also used in says particle or owl.",
            "And I say, Oh well, I don't know so much.",
            "So he says yes, and it's even worse because maybe some of these other standards use blank notes in rather different ways than than the original than the official RDF semantics.",
            "And Moreover, people use blank notes in their data when they publish data, and sometimes that the way they use blank nodes might not be the same as in RDF.",
            "So what we did in dairy and during the internship for the paper is study.",
            "The way people use blank notes in different standards and in published data, and that's what I'm going to talk about.",
            "So the 1st."
        ],
        [
            "For example, that I had imposed a bit of RDF data and a small sparkle query.",
            "When is the following?",
            "Let's say we have this database with a little known tennis player and I want to know OK how many times this guy has won the French Open and I have this database.",
            "This is all my graph.",
            "So I want to answer this query.",
            "Basically I want I want to select all the FO French Open such that Federer wins French Open.",
            "You know it's event.",
            "I want to know how many times this guy has won the event.",
            "So basically I want to count the number of topples, the number of rows in the answer of this query.",
            "I'm not going to show that now we will go back to that later.",
            "So.",
            "To properly answer this, we have to know exactly or precisely OK, how are black notifying in RDF?",
            "No, OK, yes.",
            "That's for the if you are up to date with technology, that's kind of equivalent in Sparkle 1.1, right?",
            "We have count now.",
            "So this will this would answer my question.",
            "This is the Sparkle 1 version."
        ],
        [
            "So.",
            "In RDF, black nodes are defined.",
            "Mainly with three words anonymous, existential and variables.",
            "So why anonymous?",
            "Because they don't have names.",
            "For example, we can write this.",
            "This triples like this with the bracket syntax internal and we just say way there is father of these two blank nodes and one of the black noses has named Luke one of the unknowns has named layer.",
            "On which is OK, we're not giving any explicit name or label to the blank nodes, but in some syntax is we have labels which is making it explicit.",
            "So I have blank node B1 and B2 and B1 has named Luke V2's name layer OK, but in principle in essence.",
            "Blank notes are normal, so they don't have these labels.",
            "We used him for to serialize."
        ],
        [
            "So here are a small signal to footnote in the presentation in the normative documents.",
            "Not only RDF will also sparkle and others.",
            "Sometimes these three words are used are mixed our interchange and it might be confusing or difficult to read because it should be more precise.",
            "What is the name?",
            "What is a label?",
            "What is an identifier, especially when we mix them with the words local or global.",
            "Use a global identifier, local constant or local name local label?",
            "That's a bit confusing in the document."
        ],
        [
            "So doubles anonymous white existential blank notes.",
            "Simply indicate the existence of a thing.",
            "For example, I have this triple that again, that's all my database and I want to know what is the meaning?",
            "What is the information in this triple in this data set?",
            "On the idea of semantics."
        ],
        [
            "Yes OK.",
            "The only thing I can say is John has a telephone number or if you prefer there exists a telephone number for John.",
            "OK."
        ],
        [
            "So in existential, if I if I have two blank nodes, they could represent the same thing in principle.",
            "So if I have this new data set now, John Telephone B1 and John Telephone B2, I want I ask like what is the information in this in this?"
        ],
        [
            "On the information again is John has a telephone number, or if you prefer young has at least one telephone number.",
            "I cannot conclude with the idea of semantics that this guy has 2 telephone numbers."
        ],
        [
            "And Y variables.",
            "Sorry, because the blank note is valid in a limited context, it's local to the document to the graph.",
            "So if I have to documents G1 and G2.",
            "And both of them use blank note B1.",
            "But"
        ],
        [
            "Locality means this B1 is not the same black node in the different graphs.",
            "OK, that again, related to the anonymous thing.",
            "Just labeling the blank node there locali and labeling the blank here locally so."
        ],
        [
            "For example, if I merge these two graphs, I will obtain something like this.",
            "I can put two new names to the black nodes X&Y, but they have to be different labels.",
            "If I use labels."
        ],
        [
            "Or use the bracket syntax.",
            "OK, so that's kind of the official semantics.",
            "RDF in RDF for blank note."
        ],
        [
            "So.",
            "In practice.",
            "We study a bit and it turns out blank notes are not used as nulls.",
            "And what is the use case here?",
            "Let's say we have this relational database.",
            "This is small table with a similar information.",
            "And I would like to have triples.",
            "I would like to have an RDF graph with equivalent information where equivalent to a dangerous world we have to define it, but the intuition is we have to want.",
            "We want to have the the same information in both databases in the relational database in the graph.",
            "So for John is OK, we have a triple saying John.",
            "We have to triple saying that John has a telephone number 888 whatever, but what happens with Jane in the SQL table?",
            "We have an all there, so if we don't know the intent, intention of the publisher, we don't know if that null is what does it mean?",
            "It means we don't know the telephone number.",
            "She doesn't have a telephone number.",
            "She does have a telephone number, but we don't publish it.",
            "So in principle we don't know so."
        ],
        [
            "Maybe we shouldn't write that that last triple there be 2 telephone B3.",
            "Because they naive approach would be OK. Just replace an old with a blank note.",
            "That's what they're for, maybe.",
            "But so here's the problem.",
            "Is replacing this row with these two triples.",
            "Ann has been discussed by the RDV 2 RDF Group and they say OK, It's not correct to generate this triple, we're just saying Jane Janey's there were not.",
            "Explicitly saying the null with blank notes or without, just generate the incomplete row."
        ],
        [
            "But also blank notes.",
            "Are indeed not the same as nulls.",
            "What if we want to go the other way?",
            "We have a graph now and we want to generate a table.",
            "With the equivalent information."
        ],
        [
            "So for example, is this an equivalent table?",
            "Now this is our original graph and we want to generate this.",
            "So can we just say since chain has a telephone B3, can we just say Jane null?",
            "Well, yes we can.",
            "But in principle, if somebody reads only this table if they don't know the original, they don't know what is the meaning of this null.",
            "What is the intention of of the publisher who did this conversion?",
            "So in general, blank notes are not the same as null."
        ],
        [
            "More uses of blackness in practice, so in practice people use them as constants.",
            "For example here.",
            "Now going back to the example with two telephones hear people say yes, John has 2 telephone numbers, one is B1 is represented in B1, the other is represented in the two.",
            "But that interpretation is not aligned with the existential nature of the official RDF semantics.",
            "Other using practice.",
            "Actually this another use case with this same example."
        ],
        [
            "What if we have one document the same simple document?",
            "John has a telephone ablanca somehow we find in the web 2 copies of the same document and we merge them.",
            "It could happen a crawler could do it if we merge these two documents, I'm going to get the same as before.",
            "So the question is, can I still say 2 telephone numbers?",
            "Because with the RDF semantics I say in the first one, John has a telephone number.",
            "I say the same here when I merge.",
            "Can I still say, can I say now John has two?",
            "Well?",
            "So it's a bit contradictory with the interpretation here, but that's one of the problems that we all know are out there with the black."
        ],
        [
            "Notes.",
            "Another using practice.",
            "People use blank notes too.",
            "Build data structures, for example, say a collection at least.",
            "So here I say be one represents or is connected to the first element of my collection B2 to my second element B3, and so on.",
            "So again, this is not aligned with the existential existential thing.",
            "Does not work here WHI, because these blindness are meant to be different.",
            "I won't be want to represent element One V2 to represent Element 2.",
            "So I have some kind of implicit constraint here.",
            "This is not in the data, but this is clearly the intention of the publisher, so I put an X there because this is bad thing.",
            "I mean, this is what I want, but it's not there.",
            "But another good use of this data structure thing is that, for example, let's say I have an enemy and the enemy has this triple and they say OK.",
            "I'm going to merge these two because now B1 is going to collapse.",
            "With that be one, and I'm going to break that that list.",
            "I don't want anybody else to have the list, so my enemy will not succeed because.",
            "This be one when merge as we saw before.",
            "These are not the same blank note just local label here local labor there so when we merge the merge will be disjoint and I'm not breaking the original data structure which is good.",
            "So in this use case I have like a good and a bad thing."
        ],
        [
            "One last practical use of blank notes is a default names.",
            "For example, if I have to generate triples and.",
            "Maybe I have to generate too many and I don't want to think about all of them or whatever.",
            "Whatever reason, sometimes this is."
        ],
        [
            "Just like faster or easier or I generate a random string or or auto increment integer number or whatever.",
            "Some sometimes I just I can just use that and it's easy."
        ],
        [
            "And it seems to happen.",
            "The problem here is that the meaning depends on the intent of the publisher, but we don't know that in principle, unless we are the publisher.",
            "But we also have to communicate.",
            "And how do how do we do it?"
        ],
        [
            "So as we see, not all the normative uses are common in practice, but we also asked this.",
            "We sent an email with Aiden to the semantic Web and Elodie mailing lists, asking it's a small pool.",
            "We got like 90 responses and think maybe some of you answered the poll.",
            "Unfortunately, the only like really, really clear conclusion is that blackness or divisive is like we cannot say yes, or like most people or all the people use black nose like this or like that now, some of them used like this, some of them just like that.",
            "But the clear conclusion is our device.",
            "If it's like 5050, if you want, but the numbers are not the numbers.",
            "Down so we got are not like one side."
        ],
        [
            "So another example, now with the standard he's sparkle, which is the query language for RDF, considers blank nodes as different.",
            "Well, we all know that we we go back to the first example.",
            "So now I want to answer this.",
            "I want to select all this tournaments he has."
        ],
        [
            "But it turns out that the answer will give me this B1 and B2.",
            "So if I want to count there, I will get 2, right?"
        ],
        [
            "But even if I use this solution modifier distinct so because I really want to know all the different instances of the tournament.",
            "Sparkle will give me again this same result set so that that's saying OK, he want two times."
        ],
        [
            "So what does it mean when distinct?",
            "I'm trying to to say what is different between B2 and B1.",
            "But under under the ideas.",
            "RDF semantics.",
            "B2 could collapse to be one.",
            "OK, that is called leaning.",
            "And what it means is B2 gives me a subset of the information of 1 and it doesn't give you more.",
            "So it's like the same triple, except that B1 has one more information attached to it.",
            "So in in according to the RDF semantics, the lean version of this graph when I call."
        ],
        [
            "Apps B2 to B1 is this one in the RDF semantics, this graph has the same information as the previous one, but the answers that is different in sparkle.",
            "So in Sparkle already, the interpretation of Langnas is different is different, so as the one of our."
        ],
        [
            "Yep.",
            "An after that, like more theoretical.",
            "Aspects we studied also black nodes out there in published data and we use a small not so small but corpus of data that Aiden using his PhD thesis.",
            "Well, do something numbers approximately 965 million of triples an average of 7.5 blank nodes for domain.",
            "And also interesting 44% of the domains in this corpus did not publish any black notes at all.",
            "So we could say 5050 like 50% of people are not publishing black notes.",
            "But we're going to do this now with."
        ],
        [
            "Is corpus what we found?",
            "Some publishers like BBC.",
            "They published just a small amount.",
            "The average.",
            "This is quite representative of the whole corpus.",
            "7% of languages in all their data set, but others published well more like Ontology central.com they have 85% of black notes in their data set.",
            "By the time 8 on this, did this scroll?",
            "This was the whole.",
            "This was the whole data set on ontology central.com so.",
            "85% of the data set is blank notes, but still a small data set.",
            "If we compare to the total, but maybe other publishers.",
            "Publish steal a high percentage of black nodes, but with more data and that's the case with high five they published like a huge data set, but most of the nodes are blank because they use mostly files too."
        ],
        [
            "Generated the data.",
            "So OK, there are sometimes there are no blackness at all.",
            "Sometimes there are many like in the previous cases.",
            "So how is this structure of these many black nose?",
            "And to study the structure, we define briefly two concepts.",
            "So the first one is less defined.",
            "This blank.",
            "This blank version of a graph, so.",
            "That's more like technical.",
            "What we do is we take only the blandness of the graph.",
            "And we see if they are connected between each other, if they are connected, we keep.",
            "Sorry, we keep.",
            "We don't keep the arrow, we just keep them connected so."
        ],
        [
            "Here we eliminate the UI.",
            "We disregard the predicates and we just keep the blank notes, and if they were connected in the 1st place they are connected.",
            "Now it doesn't matter that direction, so this is a blank version of G. That's the first con."
        ],
        [
            "We need the 2nd is a tree.",
            "With this more technical but.",
            "The intuition is we are measuring how cyclic the graph is.",
            "The trees don't hype cycles.",
            "They have to eat one.",
            "Cycles have two with two some other graphs happy with two, but as soon as I add edges and the structure becomes more complex, the tree with increases that.",
            "The intuition behind tree with.",
            "So why do we know?",
            "Why do we need this?",
            "This notion of tree within the blank G, because it was shown in 2008 that when we have high tea with entailment becomes harder.",
            "In fact they are in the same paper.",
            "The authors provide a polynomial algorithm, but polynomial for bounded treewidth.",
            "So if I have three with, Ki will have all.",
            "The order of enter the.",
            "Factor of K for the.",
            "The complexity of the algorithm will be polynomial, but K is the the two with."
        ],
        [
            "But it's NP complete in general, so it's what we say, bad or.",
            "Not really tractable.",
            "So in the corpus we studied this structure, we were looking for or hoping to find trees and white trees.",
            "Well, because what we said before treats behave good nicely and tell me the sufficient because they treat with this low and merging trees produces more trees like the example of Jaune telephone.",
            "Be one John Telephone we do.",
            "If I merge I have to treat I have another two here or forest."
        ],
        [
            "Disjoint trees, so in this corpus we found our first good news is that not many graphs.",
            "I have a complex blank note structure like more than 98% of the graphs had three with one which is really good because intendment there is sufficient.",
            "But then we found these.",
            "A few graphs with tree with say 345 on this outlier."
        ],
        [
            "Do it 7.",
            "So what is this?",
            "This tree with seven?",
            "How complex it is?",
            "How bad can it be?",
            "So we found it there.",
            "Don't try to copy it.",
            "I think it's not available anymore.",
            "But last time we checked.",
            "But so we analyzed this graph, the black version of the graph has three with seven.",
            "Just you should be impressed with that three.",
            "With seven, it's like, oh that's bad enough."
        ],
        [
            "How does it look like?",
            "Well, something like this.",
            "So all of these blue dots are blank nodes and connect connections between blank nodes.",
            "So we see like there is some structure.",
            "There's some clusters, but trusted without connections.",
            "But all the nodes in the cluster are connected to other two nodes, but whoever note whoever knows what is the original intention of the publisher here.",
            "But what we do see is a lot of cycles, and it's not like OK, I'm going to remove a few edges and I'm will have trees, no?",
            "I will have to remove a lot of edges or make a lot of changes to to eliminate all the side."
        ],
        [
            "This is another pictures, like more of the same.",
            "Those numbers are the sizes of the clusters, so let's say 111 is just 111 notes, all of them disconnected between them, but all of them connected to other two."
        ],
        [
            "So you might be asking OK, but should I care?",
            "Should I panic?",
            "Actually, if you care about Linux, yes you should panic, but since nobody seems to care about Linux, no, you shouldn't run panic.",
            "But the question is OK.",
            "I am a publisher.",
            "I want to avoid this.",
            "I don't want to have this picture in my graphs, so how?"
        ],
        [
            "Like how do I do it?",
            "How do I avoid this this mess?",
            "And here comes the good news.",
            "#2 is that when you use a syntax.",
            "Without labels for blank notes, you're guaranteed to have trees in this blank note structure.",
            "In this blank of G. Example, when you use this bracket syntax, you well, this graph is really quite trivial, But if you use only racket syntax, you won't have a cycles because you cannot refer to another node to close the cycle.",
            "And same example, if you use RDF XML without no not ID.",
            "You cannot refer to other nodes.",
            "You won't have cycles, so you will have load tree with that bit ugly to read, but it's the same example."
        ],
        [
            "So what if what if you don't care about tree with?",
            "I don't want to calculate it with or or maybe I am forced to use another syntax with with with labels for black nodes, But I see it's a problem, so right now I want to get rid of all my black nodes and here comes good news #3.",
            "There is this process called skolemization.",
            "It comes from logic and.",
            "It's simply a process to replace your variables.",
            "In this case, your blank notes with fresh constants.",
            "So just as an example, you have this original graph, very simple one, and this columnist version of the graph is simple.",
            "Replace blank note for four new constant.",
            "But this new constant has a requirement he has to refresh.",
            "It means it has to be.",
            "Well, this is a name that has not been used before anywhere.",
            "So it has to be a completely new.",
            "Let's say you or I or little.",
            "Oh yes, in principle it could be a UI or a little, because whatever that is not a blank note.",
            "I replaced a blank note for something that is not a blank note, but if new constant if we force the constants to be your eyes instead of literals.",
            "This drunk tripping thing.",
            "Becomes possible drunk tripping.",
            "Here's the example with the two copies I have.",
            "These two copies of the same document.",
            "When I merge, I would like to have the same document again, but we saw that's not the case.",
            "We merge John Telephone B1 and B2 and sorry we merge John Taylor from B and on telephone be we obtain two triples instead of the original document, but with this colonization, if we replaced by your eyes, round tripping becomes possible, which is a use case for many people that has been discussing the mailing lists.",
            "The problem."
        ],
        [
            "Here is that when you use the UI to replace bank notes.",
            "You might lose locality, for example.",
            "The good thing about locality was the example with data structures.",
            "OK, so my enemy cannot break my my list, but if you use this now now they can.",
            "They can break it because you replace this be one with the UI and they can now merge something like my new UI with Anil and they're breaking the original list, which was the original."
        ],
        [
            "Session.",
            "So how do I ensure that I'm generating completely new fresh constants, not user not used before anywhere?",
            "So here we have these what is called us colonization scheme is just a set of guidelines.",
            "We just say, oh, it's a standard syntax.",
            "We define a standard syntax for the new constants which are called calling constants.",
            "We recommend it so we say, OK, this is going to be a best practice.",
            "Best practice recommendation and the good thing is it doesn't require changes in the RDF semantics, which could be really bad because.",
            "Changing the sender is requires a lot of politics, and it might be really slow."
        ],
        [
            "So currently under discussion by the Working Group.",
            "Is this?",
            "This syntax for scalling contents.",
            "Say I am the responsible for my domain or my dot domain.",
            "So whenever I have a blank note, I don't want anymore, I can generate something like this.",
            "I start with my domain HTP, whatever, and I add this work known."
        ],
        [
            "Which is a fixed string for this one well known.",
            "Your eyes then."
        ],
        [
            "Another fix string which could be be nogen, ideas: but I mean we have to decide like which one is going to be.",
            "But Sebino we know this is the standard recommendation for for this column eyes black nodes.",
            "So we have this.",
            "We add these two fixed strings."
        ],
        [
            "And then we add some kind of locally unique identifier.",
            "By locally I mean in my triple store for example.",
            "In my triplestore, this identifier is unique.",
            "Which ink in total?"
        ],
        [
            "I will have this globally unique identifier now because I am the only one who is in whatever in charge of this my domain and two things here also under discussion is OK. What what can we put here in this local unique identifier?",
            "In principle you can put anything so you, for example, can encode information about provenance or the original ID in your triple store of your flag node you can store where did, where you did get the blanket from.",
            "Even more things like time when did you generate that Langnau or when you did do this column process this colonization process?",
            "Or you can just again use an auto increment integer and just order a new integer every time without any more information.",
            "But the good thing regardless of the local meaning, is the global uniqueness, and that's cute about skolemization."
        ],
        [
            "So it's a summary of the work we did.",
            "Um?",
            "Well, clearly there is confusion about the semantics of black nodes.",
            "Because in RDF they are defined one way and people use them in some other ways, not only in standards, but also in publishing.",
            "In the paper we discuss in detail some of the thunders which unfortunately are not necessarily aligned with the RDF semantics and also as I said.",
            "Publishers.",
            "Not all the time published blank notes with the same semantics with the same meaning as in RDF and the art in the RDF model theoretic semantics.",
            "3rd The blank notes rate the race.",
            "The complexity of entailment or simple entailment we should say, but we saw that is sufficient for most published data.",
            "That's the practical study with it.",
            "Because most published data has low three within their blank version and lost Skolemization is well quite useful when we want to exchange blank.",
            "Note for example, like the round trip in example, and what's more in the near future is there should be some kind of formal recommendation.",
            "You should this column eyes you should do this just column eyes.",
            "And finally, I would like to thank all of you who participated in the both the reviewer's for their comments, and in particular, Steven Decker, Richard Nixon, Michael Hudson, Plus for their wonderful feedback.",
            "While while I was also my coauthors Axel, who was my supervisor in Dairy and Aiden, because I we did like really good work there and thanks.",
            "In the in the Vulcan cell project we use colonization, an logical functions pretty heavily, and we actually it's interesting 'cause we had to deal with some of these same issues.",
            "And one thing that we found works well is to use something called UUID's which Mike Dina originally was the one to suggest an that is a really a standard generating what you were calling the local ID part of the local identifier and hence global.",
            "Call unique identifier there.",
            "So we find that works pretty well and then we just kind of abbreviate the name so people can see you know 4 digits worth or whatever, and that's good enough when they're editing so you can produce a short name very nicely that way as well.",
            "I think Skolemization in general.",
            "There's a lot of issues about the quality treatment, an aggregation so counting.",
            "You know the example that you started with the proposal that we have on the table in the silk language effort is that the semantics of that should be range.",
            "In some cases you know, like we know there's at least this much.",
            "You know.",
            "More than that much.",
            "I have an opinion, but that's more like an issue of sparkle.",
            "Count is right.",
            "Yeah, yeah, yeah, I mean, OK.",
            "I studied the blank note thing in RDF, but if you want to discuss this, yes, that's an issue of count.",
            "Like what do you want to say?",
            "This at least one or between one and two, or at least one to Infinity?",
            "Or yeah, that that's an issue of count and not not only with blank notes, but also with your eyes in general because you don't have unique name assumption.",
            "So that's I guess that's for this parking working group, so that actually was my question.",
            "Suppose that you took your whole talk and presentation, replaced blank node by you or I.",
            "How much would you have to throw out?",
            "Right, because distinctness and re usability and anonymous right?",
            "I mean they all got problems with your eyes as well."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "1st, I'm just going to give up.",
                    "label": 0
                },
                {
                    "sent": "Small context, I am an undergrad student input chili in the Pontifical Catholic University of Chile.",
                    "label": 0
                },
                {
                    "sent": "I've done some work with Marcelo Arenas.",
                    "label": 0
                },
                {
                    "sent": "This second author and I did that three months research internship in Derry where I work with Axel and Aiden who are here.",
                    "label": 0
                },
                {
                    "sent": "So we did this work on black notes.",
                    "label": 0
                },
                {
                    "sent": "For me.",
                    "label": 0
                },
                {
                    "sent": "It started like like this.",
                    "label": 0
                },
                {
                    "sent": "Marcello calls me one day.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And tells me how Alejandro you do you know how black nodes are defined?",
                    "label": 0
                },
                {
                    "sent": "I say yeah, sure, I'd read all the normative documents.",
                    "label": 0
                },
                {
                    "sent": "I enjoyed very much and and he says well, then you must know that blackness are using other standards as well.",
                    "label": 0
                },
                {
                    "sent": "I mean, they are defined in RDF, but they are also used in says particle or owl.",
                    "label": 1
                },
                {
                    "sent": "And I say, Oh well, I don't know so much.",
                    "label": 0
                },
                {
                    "sent": "So he says yes, and it's even worse because maybe some of these other standards use blank notes in rather different ways than than the original than the official RDF semantics.",
                    "label": 0
                },
                {
                    "sent": "And Moreover, people use blank notes in their data when they publish data, and sometimes that the way they use blank nodes might not be the same as in RDF.",
                    "label": 0
                },
                {
                    "sent": "So what we did in dairy and during the internship for the paper is study.",
                    "label": 0
                },
                {
                    "sent": "The way people use blank notes in different standards and in published data, and that's what I'm going to talk about.",
                    "label": 0
                },
                {
                    "sent": "So the 1st.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For example, that I had imposed a bit of RDF data and a small sparkle query.",
                    "label": 0
                },
                {
                    "sent": "When is the following?",
                    "label": 0
                },
                {
                    "sent": "Let's say we have this database with a little known tennis player and I want to know OK how many times this guy has won the French Open and I have this database.",
                    "label": 1
                },
                {
                    "sent": "This is all my graph.",
                    "label": 0
                },
                {
                    "sent": "So I want to answer this query.",
                    "label": 0
                },
                {
                    "sent": "Basically I want I want to select all the FO French Open such that Federer wins French Open.",
                    "label": 0
                },
                {
                    "sent": "You know it's event.",
                    "label": 0
                },
                {
                    "sent": "I want to know how many times this guy has won the event.",
                    "label": 0
                },
                {
                    "sent": "So basically I want to count the number of topples, the number of rows in the answer of this query.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to show that now we will go back to that later.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "To properly answer this, we have to know exactly or precisely OK, how are black notifying in RDF?",
                    "label": 0
                },
                {
                    "sent": "No, OK, yes.",
                    "label": 0
                },
                {
                    "sent": "That's for the if you are up to date with technology, that's kind of equivalent in Sparkle 1.1, right?",
                    "label": 0
                },
                {
                    "sent": "We have count now.",
                    "label": 0
                },
                {
                    "sent": "So this will this would answer my question.",
                    "label": 0
                },
                {
                    "sent": "This is the Sparkle 1 version.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "In RDF, black nodes are defined.",
                    "label": 1
                },
                {
                    "sent": "Mainly with three words anonymous, existential and variables.",
                    "label": 0
                },
                {
                    "sent": "So why anonymous?",
                    "label": 0
                },
                {
                    "sent": "Because they don't have names.",
                    "label": 1
                },
                {
                    "sent": "For example, we can write this.",
                    "label": 0
                },
                {
                    "sent": "This triples like this with the bracket syntax internal and we just say way there is father of these two blank nodes and one of the black noses has named Luke one of the unknowns has named layer.",
                    "label": 0
                },
                {
                    "sent": "On which is OK, we're not giving any explicit name or label to the blank nodes, but in some syntax is we have labels which is making it explicit.",
                    "label": 0
                },
                {
                    "sent": "So I have blank node B1 and B2 and B1 has named Luke V2's name layer OK, but in principle in essence.",
                    "label": 0
                },
                {
                    "sent": "Blank notes are normal, so they don't have these labels.",
                    "label": 0
                },
                {
                    "sent": "We used him for to serialize.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here are a small signal to footnote in the presentation in the normative documents.",
                    "label": 1
                },
                {
                    "sent": "Not only RDF will also sparkle and others.",
                    "label": 0
                },
                {
                    "sent": "Sometimes these three words are used are mixed our interchange and it might be confusing or difficult to read because it should be more precise.",
                    "label": 1
                },
                {
                    "sent": "What is the name?",
                    "label": 1
                },
                {
                    "sent": "What is a label?",
                    "label": 0
                },
                {
                    "sent": "What is an identifier, especially when we mix them with the words local or global.",
                    "label": 0
                },
                {
                    "sent": "Use a global identifier, local constant or local name local label?",
                    "label": 0
                },
                {
                    "sent": "That's a bit confusing in the document.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So doubles anonymous white existential blank notes.",
                    "label": 0
                },
                {
                    "sent": "Simply indicate the existence of a thing.",
                    "label": 0
                },
                {
                    "sent": "For example, I have this triple that again, that's all my database and I want to know what is the meaning?",
                    "label": 0
                },
                {
                    "sent": "What is the information in this triple in this data set?",
                    "label": 0
                },
                {
                    "sent": "On the idea of semantics.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yes OK.",
                    "label": 0
                },
                {
                    "sent": "The only thing I can say is John has a telephone number or if you prefer there exists a telephone number for John.",
                    "label": 1
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in existential, if I if I have two blank nodes, they could represent the same thing in principle.",
                    "label": 0
                },
                {
                    "sent": "So if I have this new data set now, John Telephone B1 and John Telephone B2, I want I ask like what is the information in this in this?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the information again is John has a telephone number, or if you prefer young has at least one telephone number.",
                    "label": 0
                },
                {
                    "sent": "I cannot conclude with the idea of semantics that this guy has 2 telephone numbers.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And Y variables.",
                    "label": 0
                },
                {
                    "sent": "Sorry, because the blank note is valid in a limited context, it's local to the document to the graph.",
                    "label": 1
                },
                {
                    "sent": "So if I have to documents G1 and G2.",
                    "label": 0
                },
                {
                    "sent": "And both of them use blank note B1.",
                    "label": 0
                },
                {
                    "sent": "But",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Locality means this B1 is not the same black node in the different graphs.",
                    "label": 1
                },
                {
                    "sent": "OK, that again, related to the anonymous thing.",
                    "label": 1
                },
                {
                    "sent": "Just labeling the blank node there locali and labeling the blank here locally so.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For example, if I merge these two graphs, I will obtain something like this.",
                    "label": 0
                },
                {
                    "sent": "I can put two new names to the black nodes X&Y, but they have to be different labels.",
                    "label": 0
                },
                {
                    "sent": "If I use labels.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or use the bracket syntax.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's kind of the official semantics.",
                    "label": 0
                },
                {
                    "sent": "RDF in RDF for blank note.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "In practice.",
                    "label": 0
                },
                {
                    "sent": "We study a bit and it turns out blank notes are not used as nulls.",
                    "label": 1
                },
                {
                    "sent": "And what is the use case here?",
                    "label": 0
                },
                {
                    "sent": "Let's say we have this relational database.",
                    "label": 0
                },
                {
                    "sent": "This is small table with a similar information.",
                    "label": 0
                },
                {
                    "sent": "And I would like to have triples.",
                    "label": 0
                },
                {
                    "sent": "I would like to have an RDF graph with equivalent information where equivalent to a dangerous world we have to define it, but the intuition is we have to want.",
                    "label": 0
                },
                {
                    "sent": "We want to have the the same information in both databases in the relational database in the graph.",
                    "label": 0
                },
                {
                    "sent": "So for John is OK, we have a triple saying John.",
                    "label": 0
                },
                {
                    "sent": "We have to triple saying that John has a telephone number 888 whatever, but what happens with Jane in the SQL table?",
                    "label": 0
                },
                {
                    "sent": "We have an all there, so if we don't know the intent, intention of the publisher, we don't know if that null is what does it mean?",
                    "label": 0
                },
                {
                    "sent": "It means we don't know the telephone number.",
                    "label": 0
                },
                {
                    "sent": "She doesn't have a telephone number.",
                    "label": 0
                },
                {
                    "sent": "She does have a telephone number, but we don't publish it.",
                    "label": 0
                },
                {
                    "sent": "So in principle we don't know so.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Maybe we shouldn't write that that last triple there be 2 telephone B3.",
                    "label": 0
                },
                {
                    "sent": "Because they naive approach would be OK. Just replace an old with a blank note.",
                    "label": 0
                },
                {
                    "sent": "That's what they're for, maybe.",
                    "label": 0
                },
                {
                    "sent": "But so here's the problem.",
                    "label": 0
                },
                {
                    "sent": "Is replacing this row with these two triples.",
                    "label": 0
                },
                {
                    "sent": "Ann has been discussed by the RDV 2 RDF Group and they say OK, It's not correct to generate this triple, we're just saying Jane Janey's there were not.",
                    "label": 0
                },
                {
                    "sent": "Explicitly saying the null with blank notes or without, just generate the incomplete row.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But also blank notes.",
                    "label": 0
                },
                {
                    "sent": "Are indeed not the same as nulls.",
                    "label": 0
                },
                {
                    "sent": "What if we want to go the other way?",
                    "label": 0
                },
                {
                    "sent": "We have a graph now and we want to generate a table.",
                    "label": 0
                },
                {
                    "sent": "With the equivalent information.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for example, is this an equivalent table?",
                    "label": 1
                },
                {
                    "sent": "Now this is our original graph and we want to generate this.",
                    "label": 1
                },
                {
                    "sent": "So can we just say since chain has a telephone B3, can we just say Jane null?",
                    "label": 0
                },
                {
                    "sent": "Well, yes we can.",
                    "label": 0
                },
                {
                    "sent": "But in principle, if somebody reads only this table if they don't know the original, they don't know what is the meaning of this null.",
                    "label": 0
                },
                {
                    "sent": "What is the intention of of the publisher who did this conversion?",
                    "label": 0
                },
                {
                    "sent": "So in general, blank notes are not the same as null.",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More uses of blackness in practice, so in practice people use them as constants.",
                    "label": 0
                },
                {
                    "sent": "For example here.",
                    "label": 0
                },
                {
                    "sent": "Now going back to the example with two telephones hear people say yes, John has 2 telephone numbers, one is B1 is represented in B1, the other is represented in the two.",
                    "label": 0
                },
                {
                    "sent": "But that interpretation is not aligned with the existential nature of the official RDF semantics.",
                    "label": 0
                },
                {
                    "sent": "Other using practice.",
                    "label": 0
                },
                {
                    "sent": "Actually this another use case with this same example.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What if we have one document the same simple document?",
                    "label": 0
                },
                {
                    "sent": "John has a telephone ablanca somehow we find in the web 2 copies of the same document and we merge them.",
                    "label": 0
                },
                {
                    "sent": "It could happen a crawler could do it if we merge these two documents, I'm going to get the same as before.",
                    "label": 0
                },
                {
                    "sent": "So the question is, can I still say 2 telephone numbers?",
                    "label": 0
                },
                {
                    "sent": "Because with the RDF semantics I say in the first one, John has a telephone number.",
                    "label": 0
                },
                {
                    "sent": "I say the same here when I merge.",
                    "label": 0
                },
                {
                    "sent": "Can I still say, can I say now John has two?",
                    "label": 1
                },
                {
                    "sent": "Well?",
                    "label": 0
                },
                {
                    "sent": "So it's a bit contradictory with the interpretation here, but that's one of the problems that we all know are out there with the black.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Notes.",
                    "label": 0
                },
                {
                    "sent": "Another using practice.",
                    "label": 0
                },
                {
                    "sent": "People use blank notes too.",
                    "label": 0
                },
                {
                    "sent": "Build data structures, for example, say a collection at least.",
                    "label": 0
                },
                {
                    "sent": "So here I say be one represents or is connected to the first element of my collection B2 to my second element B3, and so on.",
                    "label": 0
                },
                {
                    "sent": "So again, this is not aligned with the existential existential thing.",
                    "label": 0
                },
                {
                    "sent": "Does not work here WHI, because these blindness are meant to be different.",
                    "label": 0
                },
                {
                    "sent": "I won't be want to represent element One V2 to represent Element 2.",
                    "label": 0
                },
                {
                    "sent": "So I have some kind of implicit constraint here.",
                    "label": 0
                },
                {
                    "sent": "This is not in the data, but this is clearly the intention of the publisher, so I put an X there because this is bad thing.",
                    "label": 0
                },
                {
                    "sent": "I mean, this is what I want, but it's not there.",
                    "label": 0
                },
                {
                    "sent": "But another good use of this data structure thing is that, for example, let's say I have an enemy and the enemy has this triple and they say OK.",
                    "label": 0
                },
                {
                    "sent": "I'm going to merge these two because now B1 is going to collapse.",
                    "label": 0
                },
                {
                    "sent": "With that be one, and I'm going to break that that list.",
                    "label": 0
                },
                {
                    "sent": "I don't want anybody else to have the list, so my enemy will not succeed because.",
                    "label": 0
                },
                {
                    "sent": "This be one when merge as we saw before.",
                    "label": 0
                },
                {
                    "sent": "These are not the same blank note just local label here local labor there so when we merge the merge will be disjoint and I'm not breaking the original data structure which is good.",
                    "label": 0
                },
                {
                    "sent": "So in this use case I have like a good and a bad thing.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One last practical use of blank notes is a default names.",
                    "label": 0
                },
                {
                    "sent": "For example, if I have to generate triples and.",
                    "label": 0
                },
                {
                    "sent": "Maybe I have to generate too many and I don't want to think about all of them or whatever.",
                    "label": 0
                },
                {
                    "sent": "Whatever reason, sometimes this is.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just like faster or easier or I generate a random string or or auto increment integer number or whatever.",
                    "label": 0
                },
                {
                    "sent": "Some sometimes I just I can just use that and it's easy.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it seems to happen.",
                    "label": 0
                },
                {
                    "sent": "The problem here is that the meaning depends on the intent of the publisher, but we don't know that in principle, unless we are the publisher.",
                    "label": 0
                },
                {
                    "sent": "But we also have to communicate.",
                    "label": 0
                },
                {
                    "sent": "And how do how do we do it?",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So as we see, not all the normative uses are common in practice, but we also asked this.",
                    "label": 0
                },
                {
                    "sent": "We sent an email with Aiden to the semantic Web and Elodie mailing lists, asking it's a small pool.",
                    "label": 0
                },
                {
                    "sent": "We got like 90 responses and think maybe some of you answered the poll.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, the only like really, really clear conclusion is that blackness or divisive is like we cannot say yes, or like most people or all the people use black nose like this or like that now, some of them used like this, some of them just like that.",
                    "label": 0
                },
                {
                    "sent": "But the clear conclusion is our device.",
                    "label": 0
                },
                {
                    "sent": "If it's like 5050, if you want, but the numbers are not the numbers.",
                    "label": 0
                },
                {
                    "sent": "Down so we got are not like one side.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So another example, now with the standard he's sparkle, which is the query language for RDF, considers blank nodes as different.",
                    "label": 0
                },
                {
                    "sent": "Well, we all know that we we go back to the first example.",
                    "label": 0
                },
                {
                    "sent": "So now I want to answer this.",
                    "label": 0
                },
                {
                    "sent": "I want to select all this tournaments he has.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But it turns out that the answer will give me this B1 and B2.",
                    "label": 0
                },
                {
                    "sent": "So if I want to count there, I will get 2, right?",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But even if I use this solution modifier distinct so because I really want to know all the different instances of the tournament.",
                    "label": 0
                },
                {
                    "sent": "Sparkle will give me again this same result set so that that's saying OK, he want two times.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what does it mean when distinct?",
                    "label": 0
                },
                {
                    "sent": "I'm trying to to say what is different between B2 and B1.",
                    "label": 0
                },
                {
                    "sent": "But under under the ideas.",
                    "label": 0
                },
                {
                    "sent": "RDF semantics.",
                    "label": 0
                },
                {
                    "sent": "B2 could collapse to be one.",
                    "label": 0
                },
                {
                    "sent": "OK, that is called leaning.",
                    "label": 0
                },
                {
                    "sent": "And what it means is B2 gives me a subset of the information of 1 and it doesn't give you more.",
                    "label": 0
                },
                {
                    "sent": "So it's like the same triple, except that B1 has one more information attached to it.",
                    "label": 0
                },
                {
                    "sent": "So in in according to the RDF semantics, the lean version of this graph when I call.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Apps B2 to B1 is this one in the RDF semantics, this graph has the same information as the previous one, but the answers that is different in sparkle.",
                    "label": 0
                },
                {
                    "sent": "So in Sparkle already, the interpretation of Langnas is different is different, so as the one of our.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "An after that, like more theoretical.",
                    "label": 0
                },
                {
                    "sent": "Aspects we studied also black nodes out there in published data and we use a small not so small but corpus of data that Aiden using his PhD thesis.",
                    "label": 0
                },
                {
                    "sent": "Well, do something numbers approximately 965 million of triples an average of 7.5 blank nodes for domain.",
                    "label": 0
                },
                {
                    "sent": "And also interesting 44% of the domains in this corpus did not publish any black notes at all.",
                    "label": 0
                },
                {
                    "sent": "So we could say 5050 like 50% of people are not publishing black notes.",
                    "label": 0
                },
                {
                    "sent": "But we're going to do this now with.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is corpus what we found?",
                    "label": 0
                },
                {
                    "sent": "Some publishers like BBC.",
                    "label": 0
                },
                {
                    "sent": "They published just a small amount.",
                    "label": 0
                },
                {
                    "sent": "The average.",
                    "label": 0
                },
                {
                    "sent": "This is quite representative of the whole corpus.",
                    "label": 0
                },
                {
                    "sent": "7% of languages in all their data set, but others published well more like Ontology central.com they have 85% of black notes in their data set.",
                    "label": 0
                },
                {
                    "sent": "By the time 8 on this, did this scroll?",
                    "label": 0
                },
                {
                    "sent": "This was the whole.",
                    "label": 0
                },
                {
                    "sent": "This was the whole data set on ontology central.com so.",
                    "label": 0
                },
                {
                    "sent": "85% of the data set is blank notes, but still a small data set.",
                    "label": 0
                },
                {
                    "sent": "If we compare to the total, but maybe other publishers.",
                    "label": 0
                },
                {
                    "sent": "Publish steal a high percentage of black nodes, but with more data and that's the case with high five they published like a huge data set, but most of the nodes are blank because they use mostly files too.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Generated the data.",
                    "label": 0
                },
                {
                    "sent": "So OK, there are sometimes there are no blackness at all.",
                    "label": 0
                },
                {
                    "sent": "Sometimes there are many like in the previous cases.",
                    "label": 1
                },
                {
                    "sent": "So how is this structure of these many black nose?",
                    "label": 0
                },
                {
                    "sent": "And to study the structure, we define briefly two concepts.",
                    "label": 0
                },
                {
                    "sent": "So the first one is less defined.",
                    "label": 0
                },
                {
                    "sent": "This blank.",
                    "label": 0
                },
                {
                    "sent": "This blank version of a graph, so.",
                    "label": 0
                },
                {
                    "sent": "That's more like technical.",
                    "label": 0
                },
                {
                    "sent": "What we do is we take only the blandness of the graph.",
                    "label": 0
                },
                {
                    "sent": "And we see if they are connected between each other, if they are connected, we keep.",
                    "label": 0
                },
                {
                    "sent": "Sorry, we keep.",
                    "label": 0
                },
                {
                    "sent": "We don't keep the arrow, we just keep them connected so.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here we eliminate the UI.",
                    "label": 0
                },
                {
                    "sent": "We disregard the predicates and we just keep the blank notes, and if they were connected in the 1st place they are connected.",
                    "label": 0
                },
                {
                    "sent": "Now it doesn't matter that direction, so this is a blank version of G. That's the first con.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We need the 2nd is a tree.",
                    "label": 0
                },
                {
                    "sent": "With this more technical but.",
                    "label": 0
                },
                {
                    "sent": "The intuition is we are measuring how cyclic the graph is.",
                    "label": 0
                },
                {
                    "sent": "The trees don't hype cycles.",
                    "label": 0
                },
                {
                    "sent": "They have to eat one.",
                    "label": 0
                },
                {
                    "sent": "Cycles have two with two some other graphs happy with two, but as soon as I add edges and the structure becomes more complex, the tree with increases that.",
                    "label": 0
                },
                {
                    "sent": "The intuition behind tree with.",
                    "label": 0
                },
                {
                    "sent": "So why do we know?",
                    "label": 0
                },
                {
                    "sent": "Why do we need this?",
                    "label": 0
                },
                {
                    "sent": "This notion of tree within the blank G, because it was shown in 2008 that when we have high tea with entailment becomes harder.",
                    "label": 0
                },
                {
                    "sent": "In fact they are in the same paper.",
                    "label": 0
                },
                {
                    "sent": "The authors provide a polynomial algorithm, but polynomial for bounded treewidth.",
                    "label": 0
                },
                {
                    "sent": "So if I have three with, Ki will have all.",
                    "label": 0
                },
                {
                    "sent": "The order of enter the.",
                    "label": 0
                },
                {
                    "sent": "Factor of K for the.",
                    "label": 0
                },
                {
                    "sent": "The complexity of the algorithm will be polynomial, but K is the the two with.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But it's NP complete in general, so it's what we say, bad or.",
                    "label": 0
                },
                {
                    "sent": "Not really tractable.",
                    "label": 0
                },
                {
                    "sent": "So in the corpus we studied this structure, we were looking for or hoping to find trees and white trees.",
                    "label": 0
                },
                {
                    "sent": "Well, because what we said before treats behave good nicely and tell me the sufficient because they treat with this low and merging trees produces more trees like the example of Jaune telephone.",
                    "label": 0
                },
                {
                    "sent": "Be one John Telephone we do.",
                    "label": 0
                },
                {
                    "sent": "If I merge I have to treat I have another two here or forest.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Disjoint trees, so in this corpus we found our first good news is that not many graphs.",
                    "label": 0
                },
                {
                    "sent": "I have a complex blank note structure like more than 98% of the graphs had three with one which is really good because intendment there is sufficient.",
                    "label": 1
                },
                {
                    "sent": "But then we found these.",
                    "label": 0
                },
                {
                    "sent": "A few graphs with tree with say 345 on this outlier.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do it 7.",
                    "label": 0
                },
                {
                    "sent": "So what is this?",
                    "label": 0
                },
                {
                    "sent": "This tree with seven?",
                    "label": 0
                },
                {
                    "sent": "How complex it is?",
                    "label": 0
                },
                {
                    "sent": "How bad can it be?",
                    "label": 0
                },
                {
                    "sent": "So we found it there.",
                    "label": 0
                },
                {
                    "sent": "Don't try to copy it.",
                    "label": 0
                },
                {
                    "sent": "I think it's not available anymore.",
                    "label": 0
                },
                {
                    "sent": "But last time we checked.",
                    "label": 0
                },
                {
                    "sent": "But so we analyzed this graph, the black version of the graph has three with seven.",
                    "label": 0
                },
                {
                    "sent": "Just you should be impressed with that three.",
                    "label": 0
                },
                {
                    "sent": "With seven, it's like, oh that's bad enough.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How does it look like?",
                    "label": 0
                },
                {
                    "sent": "Well, something like this.",
                    "label": 0
                },
                {
                    "sent": "So all of these blue dots are blank nodes and connect connections between blank nodes.",
                    "label": 0
                },
                {
                    "sent": "So we see like there is some structure.",
                    "label": 0
                },
                {
                    "sent": "There's some clusters, but trusted without connections.",
                    "label": 0
                },
                {
                    "sent": "But all the nodes in the cluster are connected to other two nodes, but whoever note whoever knows what is the original intention of the publisher here.",
                    "label": 0
                },
                {
                    "sent": "But what we do see is a lot of cycles, and it's not like OK, I'm going to remove a few edges and I'm will have trees, no?",
                    "label": 0
                },
                {
                    "sent": "I will have to remove a lot of edges or make a lot of changes to to eliminate all the side.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is another pictures, like more of the same.",
                    "label": 0
                },
                {
                    "sent": "Those numbers are the sizes of the clusters, so let's say 111 is just 111 notes, all of them disconnected between them, but all of them connected to other two.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So you might be asking OK, but should I care?",
                    "label": 0
                },
                {
                    "sent": "Should I panic?",
                    "label": 0
                },
                {
                    "sent": "Actually, if you care about Linux, yes you should panic, but since nobody seems to care about Linux, no, you shouldn't run panic.",
                    "label": 0
                },
                {
                    "sent": "But the question is OK.",
                    "label": 0
                },
                {
                    "sent": "I am a publisher.",
                    "label": 0
                },
                {
                    "sent": "I want to avoid this.",
                    "label": 0
                },
                {
                    "sent": "I don't want to have this picture in my graphs, so how?",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Like how do I do it?",
                    "label": 0
                },
                {
                    "sent": "How do I avoid this this mess?",
                    "label": 1
                },
                {
                    "sent": "And here comes the good news.",
                    "label": 0
                },
                {
                    "sent": "#2 is that when you use a syntax.",
                    "label": 0
                },
                {
                    "sent": "Without labels for blank notes, you're guaranteed to have trees in this blank note structure.",
                    "label": 0
                },
                {
                    "sent": "In this blank of G. Example, when you use this bracket syntax, you well, this graph is really quite trivial, But if you use only racket syntax, you won't have a cycles because you cannot refer to another node to close the cycle.",
                    "label": 0
                },
                {
                    "sent": "And same example, if you use RDF XML without no not ID.",
                    "label": 0
                },
                {
                    "sent": "You cannot refer to other nodes.",
                    "label": 0
                },
                {
                    "sent": "You won't have cycles, so you will have load tree with that bit ugly to read, but it's the same example.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what if what if you don't care about tree with?",
                    "label": 0
                },
                {
                    "sent": "I don't want to calculate it with or or maybe I am forced to use another syntax with with with labels for black nodes, But I see it's a problem, so right now I want to get rid of all my black nodes and here comes good news #3.",
                    "label": 0
                },
                {
                    "sent": "There is this process called skolemization.",
                    "label": 0
                },
                {
                    "sent": "It comes from logic and.",
                    "label": 0
                },
                {
                    "sent": "It's simply a process to replace your variables.",
                    "label": 0
                },
                {
                    "sent": "In this case, your blank notes with fresh constants.",
                    "label": 0
                },
                {
                    "sent": "So just as an example, you have this original graph, very simple one, and this columnist version of the graph is simple.",
                    "label": 0
                },
                {
                    "sent": "Replace blank note for four new constant.",
                    "label": 0
                },
                {
                    "sent": "But this new constant has a requirement he has to refresh.",
                    "label": 0
                },
                {
                    "sent": "It means it has to be.",
                    "label": 0
                },
                {
                    "sent": "Well, this is a name that has not been used before anywhere.",
                    "label": 0
                },
                {
                    "sent": "So it has to be a completely new.",
                    "label": 0
                },
                {
                    "sent": "Let's say you or I or little.",
                    "label": 0
                },
                {
                    "sent": "Oh yes, in principle it could be a UI or a little, because whatever that is not a blank note.",
                    "label": 0
                },
                {
                    "sent": "I replaced a blank note for something that is not a blank note, but if new constant if we force the constants to be your eyes instead of literals.",
                    "label": 0
                },
                {
                    "sent": "This drunk tripping thing.",
                    "label": 0
                },
                {
                    "sent": "Becomes possible drunk tripping.",
                    "label": 0
                },
                {
                    "sent": "Here's the example with the two copies I have.",
                    "label": 0
                },
                {
                    "sent": "These two copies of the same document.",
                    "label": 0
                },
                {
                    "sent": "When I merge, I would like to have the same document again, but we saw that's not the case.",
                    "label": 0
                },
                {
                    "sent": "We merge John Telephone B1 and B2 and sorry we merge John Taylor from B and on telephone be we obtain two triples instead of the original document, but with this colonization, if we replaced by your eyes, round tripping becomes possible, which is a use case for many people that has been discussing the mailing lists.",
                    "label": 0
                },
                {
                    "sent": "The problem.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here is that when you use the UI to replace bank notes.",
                    "label": 0
                },
                {
                    "sent": "You might lose locality, for example.",
                    "label": 0
                },
                {
                    "sent": "The good thing about locality was the example with data structures.",
                    "label": 0
                },
                {
                    "sent": "OK, so my enemy cannot break my my list, but if you use this now now they can.",
                    "label": 0
                },
                {
                    "sent": "They can break it because you replace this be one with the UI and they can now merge something like my new UI with Anil and they're breaking the original list, which was the original.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Session.",
                    "label": 0
                },
                {
                    "sent": "So how do I ensure that I'm generating completely new fresh constants, not user not used before anywhere?",
                    "label": 1
                },
                {
                    "sent": "So here we have these what is called us colonization scheme is just a set of guidelines.",
                    "label": 0
                },
                {
                    "sent": "We just say, oh, it's a standard syntax.",
                    "label": 0
                },
                {
                    "sent": "We define a standard syntax for the new constants which are called calling constants.",
                    "label": 0
                },
                {
                    "sent": "We recommend it so we say, OK, this is going to be a best practice.",
                    "label": 0
                },
                {
                    "sent": "Best practice recommendation and the good thing is it doesn't require changes in the RDF semantics, which could be really bad because.",
                    "label": 0
                },
                {
                    "sent": "Changing the sender is requires a lot of politics, and it might be really slow.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So currently under discussion by the Working Group.",
                    "label": 0
                },
                {
                    "sent": "Is this?",
                    "label": 0
                },
                {
                    "sent": "This syntax for scalling contents.",
                    "label": 0
                },
                {
                    "sent": "Say I am the responsible for my domain or my dot domain.",
                    "label": 0
                },
                {
                    "sent": "So whenever I have a blank note, I don't want anymore, I can generate something like this.",
                    "label": 0
                },
                {
                    "sent": "I start with my domain HTP, whatever, and I add this work known.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which is a fixed string for this one well known.",
                    "label": 0
                },
                {
                    "sent": "Your eyes then.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another fix string which could be be nogen, ideas: but I mean we have to decide like which one is going to be.",
                    "label": 0
                },
                {
                    "sent": "But Sebino we know this is the standard recommendation for for this column eyes black nodes.",
                    "label": 0
                },
                {
                    "sent": "So we have this.",
                    "label": 0
                },
                {
                    "sent": "We add these two fixed strings.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we add some kind of locally unique identifier.",
                    "label": 0
                },
                {
                    "sent": "By locally I mean in my triple store for example.",
                    "label": 0
                },
                {
                    "sent": "In my triplestore, this identifier is unique.",
                    "label": 0
                },
                {
                    "sent": "Which ink in total?",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will have this globally unique identifier now because I am the only one who is in whatever in charge of this my domain and two things here also under discussion is OK. What what can we put here in this local unique identifier?",
                    "label": 0
                },
                {
                    "sent": "In principle you can put anything so you, for example, can encode information about provenance or the original ID in your triple store of your flag node you can store where did, where you did get the blanket from.",
                    "label": 0
                },
                {
                    "sent": "Even more things like time when did you generate that Langnau or when you did do this column process this colonization process?",
                    "label": 0
                },
                {
                    "sent": "Or you can just again use an auto increment integer and just order a new integer every time without any more information.",
                    "label": 0
                },
                {
                    "sent": "But the good thing regardless of the local meaning, is the global uniqueness, and that's cute about skolemization.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it's a summary of the work we did.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Well, clearly there is confusion about the semantics of black nodes.",
                    "label": 0
                },
                {
                    "sent": "Because in RDF they are defined one way and people use them in some other ways, not only in standards, but also in publishing.",
                    "label": 0
                },
                {
                    "sent": "In the paper we discuss in detail some of the thunders which unfortunately are not necessarily aligned with the RDF semantics and also as I said.",
                    "label": 0
                },
                {
                    "sent": "Publishers.",
                    "label": 0
                },
                {
                    "sent": "Not all the time published blank notes with the same semantics with the same meaning as in RDF and the art in the RDF model theoretic semantics.",
                    "label": 0
                },
                {
                    "sent": "3rd The blank notes rate the race.",
                    "label": 0
                },
                {
                    "sent": "The complexity of entailment or simple entailment we should say, but we saw that is sufficient for most published data.",
                    "label": 0
                },
                {
                    "sent": "That's the practical study with it.",
                    "label": 0
                },
                {
                    "sent": "Because most published data has low three within their blank version and lost Skolemization is well quite useful when we want to exchange blank.",
                    "label": 0
                },
                {
                    "sent": "Note for example, like the round trip in example, and what's more in the near future is there should be some kind of formal recommendation.",
                    "label": 0
                },
                {
                    "sent": "You should this column eyes you should do this just column eyes.",
                    "label": 0
                },
                {
                    "sent": "And finally, I would like to thank all of you who participated in the both the reviewer's for their comments, and in particular, Steven Decker, Richard Nixon, Michael Hudson, Plus for their wonderful feedback.",
                    "label": 0
                },
                {
                    "sent": "While while I was also my coauthors Axel, who was my supervisor in Dairy and Aiden, because I we did like really good work there and thanks.",
                    "label": 0
                },
                {
                    "sent": "In the in the Vulcan cell project we use colonization, an logical functions pretty heavily, and we actually it's interesting 'cause we had to deal with some of these same issues.",
                    "label": 0
                },
                {
                    "sent": "And one thing that we found works well is to use something called UUID's which Mike Dina originally was the one to suggest an that is a really a standard generating what you were calling the local ID part of the local identifier and hence global.",
                    "label": 0
                },
                {
                    "sent": "Call unique identifier there.",
                    "label": 0
                },
                {
                    "sent": "So we find that works pretty well and then we just kind of abbreviate the name so people can see you know 4 digits worth or whatever, and that's good enough when they're editing so you can produce a short name very nicely that way as well.",
                    "label": 0
                },
                {
                    "sent": "I think Skolemization in general.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of issues about the quality treatment, an aggregation so counting.",
                    "label": 0
                },
                {
                    "sent": "You know the example that you started with the proposal that we have on the table in the silk language effort is that the semantics of that should be range.",
                    "label": 0
                },
                {
                    "sent": "In some cases you know, like we know there's at least this much.",
                    "label": 0
                },
                {
                    "sent": "You know.",
                    "label": 0
                },
                {
                    "sent": "More than that much.",
                    "label": 0
                },
                {
                    "sent": "I have an opinion, but that's more like an issue of sparkle.",
                    "label": 0
                },
                {
                    "sent": "Count is right.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, yeah, I mean, OK.",
                    "label": 0
                },
                {
                    "sent": "I studied the blank note thing in RDF, but if you want to discuss this, yes, that's an issue of count.",
                    "label": 0
                },
                {
                    "sent": "Like what do you want to say?",
                    "label": 0
                },
                {
                    "sent": "This at least one or between one and two, or at least one to Infinity?",
                    "label": 0
                },
                {
                    "sent": "Or yeah, that that's an issue of count and not not only with blank notes, but also with your eyes in general because you don't have unique name assumption.",
                    "label": 0
                },
                {
                    "sent": "So that's I guess that's for this parking working group, so that actually was my question.",
                    "label": 0
                },
                {
                    "sent": "Suppose that you took your whole talk and presentation, replaced blank node by you or I.",
                    "label": 0
                },
                {
                    "sent": "How much would you have to throw out?",
                    "label": 0
                },
                {
                    "sent": "Right, because distinctness and re usability and anonymous right?",
                    "label": 0
                },
                {
                    "sent": "I mean they all got problems with your eyes as well.",
                    "label": 0
                }
            ]
        }
    }
}