{
    "id": "ibvjdktrbrax7egg5kzzd26rxafnbin4",
    "title": "COIN Platform Demonstration",
    "info": {
        "author": [
            "Michele Sesana, TXT e-solutions"
        ],
        "published": "Nov. 24, 2010",
        "recorded": "October 2010",
        "category": [
            "Top->Technology->Interoperability"
        ]
    },
    "url": "http://videolectures.net/coinactivess2010_sesana_cpd/",
    "segmentation": [
        [
            "OK, I will start with the coin platform."
        ],
        [
            "Demonstration.",
            "So these are topics I will address.",
            "I will give you a fast.",
            "Vision of the technical platform.",
            "And then I will show you how we register semantically.",
            "The service in the platform.",
            "How we search, discover, rank and execute the services through the our generic service platform.",
            "In full an push way then how I will present to you how we monitor the execution of the services and then I will give you a vision of the next steps that we are."
        ],
        [
            "Doing so, let's start with our tree.",
            "We have three steps here.",
            "This is step one that is state of the art.",
            "So there is a business process inside the business process.",
            "There are some steps that are linked to some services provided by a collaboration collaboration platform.",
            "So this is state of the art.",
            "Everything on the."
        ],
        [
            "Company portal for example.",
            "What we are doing and what I present I will show to you today in the first part of my presentation is our what we call Step 2 so we have again.",
            "A business process and for some steps we already have our services and our collaboration platform, but we miss some services here and there.",
            "We need a service, for example for invoicing or for a formal transformation, and we have to find it.",
            "And we will found and use the service through the generic service platform of coin.",
            "In which are registered the services I presented yesterday so called EI and EC Enterprise interoperability, Enterprise Collaboration Services Cousin calling.",
            "We focused on that kind of services.",
            "And semantically we'll find them, and we will inject this service in our business process and we use them through this journey."
        ],
        [
            "Service platform.",
            "This is.",
            "A nice view of the current state of the art.",
            "We have the collaboration platform of coin that is based on a life Reporter.",
            "We had a lot of services injected there.",
            "Will the functionalities of Liferay are still alive and.",
            "Is something like the company portal that you probably have in your in your company so you have some services, some data user logins and so on inside here.",
            "Then we have the generic service platform provided by coin based on Wismer with mix technologies.",
            "We are different models that are able to discover, service, compose, service, select a rank the services.",
            "Make choreography and invoke services.",
            "Everything here is based on semantic.",
            "Behind the platform we have the generic service platform.",
            "We have the services.",
            "We have two main categories of services.",
            "We have web services so we register inside the platform.",
            "The wisdom of the service.",
            "Are we have graphical user interface, so we have a business layer with graphical user interface and we register also this kind of services is that inside the platform.",
            "We registered them semantically."
        ],
        [
            "This is.",
            "Oh, a complex view of our portal.",
            "We increased a little bit the functionalities of liferay.",
            "But then going so much details here, you can see that there are some kind services.",
            "Here on the same server or in other service linked to the collaboration platform."
        ],
        [
            "So let's talk on before on how we register our services inside the generic service platform."
        ],
        [
            "So how we register those services here?",
            "How we create our catalog of services inside the generic service."
        ],
        [
            "Form.",
            "So first of all we have two ontologies.",
            "One for the EC domain, another for the domain.",
            "Here we have some.",
            "Numbers about this related to the ER two of coin in December will finish the final version of the services and will increase the number of services, and we probably extend again, this ontology.",
            "For example, I can show you we have the concept of documents and we have different kind of documents like Gantt chart, production plan, bill of material and you will see.",
            "How will find register and find service about this topics?",
            "This concept again we have also algorithm.",
            "Communication card anality interaction mode.",
            "Synchronous or synchronous, and so on.",
            "This is for the EC."
        ],
        [
            "I mean so the collaboration.",
            "This is less readable for the I we have again 39 concept, 14 relation and.",
            "At this stage we are two of coin.",
            "We have seven coin Baseline Services, an nine coin ya innovative services.",
            "Mapped to this ontology."
        ],
        [
            "So let's start with the registration of the services.",
            "This is the graphical user interface that should be used by the provider of the service by the service provider to register its service in our platform.",
            "So first of all we have to select of course namespace a semantic web service, it interfere."
        ],
        [
            "So where is the service?",
            "Then we have to import.",
            "The ontologies AI or easy or in the future other ontologies.",
            "And.",
            "Here we will define in which scope.",
            "Is the service API or easy in our case?",
            "So just selecting the correct ontology.",
            "For example.",
            "In this case we have enterprise collaboration ontology."
        ],
        [
            "And then we are going to build.",
            "Pre and post condition of the service.",
            "The concept of pre and post condition.",
            "Not so.",
            "Or related to input and output is the ontological description.",
            "Of.",
            "Precondition of the service and post condition to register.",
            "A service that send an email.",
            "For example, I have as preconditioned to send a message.",
            "I have a message and I have two individuals.",
            "As post condition I have the message sent.",
            "This is our ontological description.",
            "Of pre and post condition of the service this this work comes from the wizmo is based on Wismer with mix.",
            "Technologies.",
            "So here we are registering the service of to send an email.",
            "And.",
            "With select.",
            "As precondition, the email message and then the individual.",
            "That is below.",
            "So we are creating this and as postcondition we add, message sent.",
            "Of course we can work on different levels, we can.",
            "Say email message but we can have also more generic precondition like message.",
            "I have a message.",
            "In this case, we have an email message.",
            "This is important for the disk."
        ],
        [
            "Coveri that will be afterward.",
            "This again.",
            "More advanced status of pre and post condition.",
            "So we have selected two individuals.",
            "And image service message and this is the post condition this is.",
            "Probably is difficult to read email message sent and.",
            "Among brackets we have the three preconditions.",
            "So we send.",
            "A message among two individuals."
        ],
        [
            "As post condition.",
            "Then again, we."
        ],
        [
            "Define the annotation of the service and we define the non functional properties we can.",
            "You search for functional properties or for non functional properties nonfunctional could be the most of the case.",
            "The price of the service could be for free or we can have prices.",
            "For the usage.",
            "Or we have the invocation time and the reputation of the service.",
            "As non functional properties.",
            "So we are registering our service on our email service and here we put the price for power invoke."
        ],
        [
            "Nation.",
            "This is the final.",
            "Document we have from the registration.",
            "We have pre post condition.",
            "We have the ontologies.",
            "The non functional properties here are praan post condition.",
            "Anne, this is this graphical user interface is used by the service provider just to create this template that will be used from the generic service platform to find the service.",
            "But of course.",
            "We have created this graphical user interface to don't let the user to type manually everything.",
            "Here we provide this to."
        ],
        [
            "Facilitate the work.",
            "This is the service that has been registered.",
            "Through this document, inside the generic service platform that is based on with mix and you can see that we have a lot of services inside.",
            "In this case, we are talking about a web service.",
            "Quick question so far.",
            "Let's say to specify the register.",
            "Let's say.",
            "Medium complex service.",
            "Depends on your skill on on pre post condition.",
            "How much time would you need?",
            "Would you need for force?",
            "OK, I'm not an expert in this field.",
            "An IRA just read an simple web service in 10 minutes.",
            "With this, but it depends of the cases so far.",
            "Complex services that maybe are not really easy to map on the ontology.",
            "You have to ask to a large ontology and you have maybe to study what is pre and post condition.",
            "Metro.",
            "Generally it's more like ours with this graphical user interface, no at the beginning of the project we didn't have these graphical user interface an we need these to do this work now as easier early, easier to do because before you have to write down all this manually, all this document.",
            "That is not so easy if you are not skilled in this field in Wiz mix.",
            "Now is easier."
        ],
        [
            "OK, so we have registered the service in the generic service platform.",
            "So for example, this email service that will use afterward.",
            "8 two individuals and the messages, condition and message sent as post."
        ],
        [
            "And so now we are."
        ],
        [
            "I need to see how we search, discover, rank and execute this service and others in Pool way.",
            "So request from the collaboration platform and as we're from the generic service platform."
        ],
        [
            "This is our Step 2 I already pressed."
        ],
        [
            "Entered.",
            "Inside our collaboration platform we have added this graphical user interface that is the GSP client interface.",
            "I will show you then by videos.",
            "How we use this?",
            "This is just ER, two of coin.",
            "We are rebuilding the graphical user interface to modifying let's.",
            "To be more understandable by non technical users, but for businessmen that we're going to take."
        ],
        [
            "Afterward.",
            "This is our GSP client.",
            "The technical view.",
            "We have the again the GSP.",
            "Not detail IDR with C and EI on teologi.",
            "OK this is just easy ontology but we have also the ontology.",
            "For functional and non functional properties and the services behind registered inside.",
            "Services can stay.",
            "Where you want in the same machine, another machine in Mexico, China, Europe doesn't matter.",
            "This is.",
            "The collaboration platform in which we have a business process with some steps.",
            "For some steps we have already in our collaboration platform services.",
            "But for some steps we need to find new services.",
            "And this is the graphical user interface that can help us to communicate with GSP to find this these services we have a copy of the ontology downloaded from the generic service platform in order to speak the same language.",
            "And we have different models.",
            "We have the model to load the ontologies.",
            "Of course we have the goal management model.",
            "The goal is the request for the GSP.",
            "Then we have the invocation model that is able to.",
            "Invoke the service center.",
            "This goal is to search the service.",
            "This is to invoke a service through the graphic GSP.",
            "Then we have ranking module.",
            "And you will see how we rank the services.",
            "We don't just discover and give them to you, but will match the non functional properties that we rank.",
            "Accordingly.",
            "The services discovered if you have more than one service discovered.",
            "Then we have the monitor model that is push.",
            "Way we see afterwards.",
            "OK the communication model that's managed the bus.",
            "From the from the module and generic service platform."
        ],
        [
            "Just to show you what is the business process.",
            "In the collaborative platform, Life Reporter created or adapted for coin.",
            "We have this business process in which we have to create a production planning, do the production process, send the goods, inform the two partners of goods that has been shipped, and then we have to translate any invoice.",
            "From the tool."
        ],
        [
            "And the slide I'll show you is.",
            "Here, so here we have the business process with that steps and we.",
            "Are going to."
        ],
        [
            "Find some services.",
            "This is our scenario presented the secondary view of coin.",
            "Adapted from the fearless case that is the.",
            "A cluster from lots of region on outer space.",
            "In this case, we are talking about production of antenna, who was here yesterday.",
            "You have seen something of this process inside the C3P service, so we have two companies tests an COM.",
            "Com is the supplier of tests, so in this very.",
            "Short example.",
            "We have to make a shared production plan, but we don't have a service.",
            "To collaborate on production planning, we have to do the production process and this is outside the scope of the business process received the goods and then informed by email the two partners and then send invoice.",
            "And translate the invoice behind and we don't have these four services."
        ],
        [
            "So.",
            "This is."
        ],
        [
            "The search of the first service, so we need a service to make."
        ],
        [
            "As shared production plan, we already have our legacy system, but we need something to collaborate on that.",
            "So in this case we will invoke we search.",
            "Send a search to the generic service platform that will discover.",
            "The right service for us and we send the result.",
            "To the GSP client and in the next steps we show how to.",
            "From the result to inject the service in the business process.",
            "OK, this is the old yard.",
            "Two graphical user interface of the GSP client.",
            "Very very easy.",
            "You have the Enterprise Collaboration tab and the Enterprise Interoperability tab.",
            "Now we are talking about collaboration.",
            "We have to collaborate on a production plan.",
            "And we have a precondition of the service here and the postcondition here.",
            "So we have to insert pre and post condition of the service.",
            "We would like to find and use.",
            "This is the functional part, and this is the non functional properties.",
            "At this step we don't use the non functional property so I will show you.",
            "Afterwards, in this case we try before weed.",
            "Something generic.",
            "I have to.",
            "Let me go back one second, OK?",
            "There is an entity.",
            "I don't go in detail saying that the entity is an individual human or a cluster of an organization.",
            "I say something generic.",
            "I want to see then what is happening.",
            "So then I will go in detail and a document we have to share a production plan.",
            "At this stage I say documents very generic as precondition.",
            "And then as postcondition.",
            "I want to do a collaborative work.",
            "On preconditions, so I want to do a collaborative work among entities on a document.",
            "This is a very generic search.",
            "I send a request to the generic service platform and this is the answer from the generic service platform.",
            "We did a very generic search, very high level entities documents so we don't have any exact match with our pre and post condition.",
            "Plug in means that we found something that do something less that we required.",
            "Sorry, something more subsumption is a service more specific than what we are looking for.",
            "In this case, we have found the collaboration for project management Service represented yesterday that provide collaborative work on.",
            "Projektmanagement and we have the collaborative 3D service that provides collaborative work on 3D CAD diagram.",
            "And production management service is collaborative work on bill of material.",
            "So everything is more specific then we have other service and we have also the C3P service I presented yesterday that allow us to.",
            "Work on a shared production plan.",
            "To share our production plan and to see mismatches and collaborate on it.",
            "This is our target.",
            "So I have a lot of services, so I want to be more specific in the request, so I going to say.",
            "Oh that we don't have an entity.",
            "We have to organize, or an organization that have to work on this service.",
            "As precondition and we have a production plan something.",
            "More specific than a document.",
            "And this post condition.",
            "We say collaborative management.",
            "So I launch again the request and in this case we have found an exact match.",
            "That is what we are looking for.",
            "The CTP service that provides collaborative work on a production planning.",
            "In this case, we have a graphical user interface service.",
            "So we can retrieve the real endpoint of this service through with mix.",
            "Our invocation in the case of graphical user interface that is just the retrieval of the real endpoint of the service.",
            "The work this is for the year 2.",
            "What we are doing right now in coin is.",
            "On this step, to make available the button to insert this service inside the business process in an automatic way.",
            "So at this stage is manual, so I find this service and I have to do manually the insertion in the business process.",
            "What we are doing now is to automatize the process.",
            "Again, here we have just the description of the service.",
            "I assure description what you are doing now is to provide something more to have to.",
            "To give to the user the possibility to download information PDF files, for example on the service and.",
            "Rank the service CD.",
            "Assessment of the service of other person that already used the service.",
            "So we are trying to build a decision support system based on these functionalities.",
            "This is just the first prototype.",
            "OK.",
            "So now we have discovered this service."
        ],
        [
            "The second part, OK, I already showed you how to get the endpoint.",
            "We give the real endpoint we insert into the business process.",
            "The videos are little bit overlapping, sorry.",
            "If OK. OK.",
            "This is what they presented before, so just the retrieval of the service.",
            "Now we are doing.",
            "The automatically insertion, so the step 7.",
            "This part."
        ],
        [
            "OK, so now we have the C3P service.",
            "The that is an enterprise collaboration service based on graphical user interface.",
            "In the first step.",
            "Of our process.",
            "We don't know nothing at this stage.",
            "Because we don't have a service to receive the goods.",
            "It's a manual step.",
            "The businessman has to say done it when this process will be executed.",
            "Of course, the legacy system can be injected everywhere.",
            "Along with this step, this is just for.",
            "Presenting the functionalities of the GSP.",
            "And now we have to find we don't have the service.",
            "We have to find a service to send email.",
            "To test.",
            "And also in the next step will send an."
        ],
        [
            "Email so.",
            "What we use here we are interested on price.",
            "Non functional properties.",
            "So we use the ranking model and new functional properties to find the right service for us.",
            "So again, we'll find we search the service that will be discovered.",
            "Will arrive the results will be ranked by the graphical user interface.",
            "Rank based on non functional properties.",
            "In this case we will have.",
            "Web service so we can try the web service.",
            "I will start Video 3.",
            "OK, in this case we selected.",
            "At the beginning the individuals.",
            "As precondition and image service message as precondition and as postcondition.",
            "Email message sent.",
            "Very specific.",
            "This is exactly the service we have inserted before we have registered in the GSP before.",
            "And I have inserted here also the non functional properties.",
            "In this case we have price timer reputation.",
            "We just selected price and reputation.",
            "0.2 means that I'm not so interested in the price, but I'm really interested in the reputation of the service.",
            "That is calculated on monitoring of the service is up and running 100% of the time it's answer.",
            "Who is the provider and so on?",
            "So now.",
            "I will submit with nonfunctional properties in the step before we send without the goal.",
            "Without the functional properties.",
            "Waiting for the answer and we found two services.",
            "Taxi email service and email communication service.",
            "So there are two different services that provide this same functionalities.",
            "And TXT is the first.",
            "Here we have two exact match.",
            "We have we can see the description of the service and.",
            "In this case, we have a web service, not a graphical user interface, so clicking here we don't retrieve just the web address of the service, but we have a graphical user interface to try the service to invoke the service.",
            "This server this graphical user interfaces automatically generated starting from the ontological description of the service.",
            "So starting from the concept of email, then will be up to the generic service platform to transfer what I will insert here.",
            "In the real input and output parameter of the service.",
            "In this case we have.",
            "Has email address has subject as contact?",
            "So in this case I can try this service again.",
            "Here is a very simple graphical user interface, but we are working to make it better more.",
            "Easy to understand.",
            "And more focused on this season support system then just.",
            "Search and test.",
            "Submitting it.",
            "This is my email.",
            "I checked the Mail and I received.",
            "Gmail.",
            "So in this case we can test the service that businessman.",
            "This is a lock the businessman can.",
            "Check it if it's working is.",
            "Is it exactly what you are looking for?",
            "The email is very easy if you are talking about formal transformation with supply.",
            "More data than just typing subjects receive embody of the Mail."
        ],
        [
            "So we found that XD email service for inform Vetrano.",
            "That is the person from test.",
            "Then we have to inform the supplier that."
        ],
        [
            "Received the goods.",
            "In this case we search again.",
            "For an email service.",
            "I will try it.",
            "But in this case we don't need just an email service, but we need something more reliable.",
            "We have to send.",
            "A secure email.",
            "Maybe signed in this case.",
            "So.",
            "Let me open the video 4.",
            "In this case I'm changing.",
            "The non functional properties the functional properties are still the same because I'm looking for the same kind of service but I'm.",
            "More interested on price and less in reputation.",
            "Sorry it was the opposite.",
            "So before I need something very that can be not for free, but I'm not so interested in the price, but I want to service with deny reputation.",
            "In this case I'm not.",
            "Interested in the reputation I have to send a simple email to the supplier.",
            "So I and I'm really interested in the price.",
            "I want IT services will be ranked by price.",
            "Assending, so we'll find the four free services.",
            "At the beginning.",
            "On the top of the rank and this case we changed.",
            "We changed the nonfunctional properties and the text email service that is not for free.",
            "Unformed 60 and is on the bottom and on the top we have the other service that is me registered As for free.",
            "So we have found exactly the same services, but ranked in a different way.",
            "I can see again the description of the service.",
            "And again open and test the other service.",
            "As you can see the graphical user interface.",
            "Is exactly the same becauses generated from this same description.",
            "I semantic the same semantic description.",
            "But the services behind are different.",
            "I can skip the insertion.",
            "And this is again.",
            "My email.",
            "And I received the other email using another service.",
            "So we."
        ],
        [
            "These two 2 steps we selected.",
            "Two different image services ranked in a different way.",
            "And we was interested on price and reputation about the services.",
            "The last step.",
            "Here we are talking about enterprise collaboration services.",
            "I was in and in the Enterprise Collaboration tab now.",
            "We are going to see how to search a service in the interoperability.",
            "Domain we need to send an invoice and this example we have to find the service to transform UBL 1.0 to be."
        ],
        [
            ".0.",
            "In this case, we have the E ontology behind and not the easy ontology.",
            "And I will show you how to find this service.",
            "Here I'm opening.",
            "The Enterprise interoperability tab.",
            "What the graphical user interface is exactly the same of before just.",
            "Different concept because we have of course another ontology for the eye, so you don't find email here.",
            "You find.",
            "Data model business process model.",
            "What is related to the enterprise interoperability domain?",
            "So we have to find.",
            "A transformation from UBHL.",
            "We have any stance of UBL as precondition.",
            "And we want a data transformation at the end.",
            "So we are looking for services that, as Precondition Ave BL document and we want to transform this JPL document.",
            "As postcondition we have.",
            "Or better, as post conditioned has been transformed.",
            "Not the transformation, because transformation is the what we do in the service.",
            "The post condition is that UBL is being transformed.",
            "We insert also the non functional properties price.",
            "We are not so much interested in price.",
            "But we are interested a lot on their reputation.",
            "We submit this goal to the generic service platform.",
            "We find two different services.",
            "In this case.",
            "We have we don't have exactly.",
            "Up, sorry.",
            "We don't have a web service registered in the GSP that can do what I'm looking for, but we have this interpretive space service that is a graphical user interface based service that.",
            "Can provide us the environment to create the transformation.",
            "So in this case I idea and found the exact service, but I found this service that allow me to create the transformation from one format to another.",
            "And because it is a graphical user interface, service will find.",
            "The web address of him.",
            "Is another kind of.",
            "Services that we have so we have services like web service, graphical user interface and we have services to create other services.",
            "So a new creating a new format transformation with this service will create a new web service that can be registered as service in the generic service platform."
        ],
        [
            "So we have.",
            "Failed also the last step.",
            "So we have this business process that can be executed in the future by the businessman."
        ],
        [
            "This is the view of the model, so the first step for the creative production planning collaborate on the production planning.",
            "We have the CTP service to manual steps.",
            "To send email.",
            "In this case, we have automatic steps.",
            "What does it mean that?",
            "The work we are doing is that when you try the service, you can also save the message to be sent.",
            "And these two steps will be make automatic.",
            "If we save in this way, this means that when the businessman we say done it at this step, these two steps will be executed automatically.",
            "The other arm and one.",
            "And then we have the federate Interoperability Service at this stage."
        ],
        [
            "So this was search discovery ranking and execution on R2.",
            "Platform of coin.",
            "With Pool way, so I ask from this collaboration platform to the generic service platform I received and as well.",
            "Then we have also the Pooh."
        ],
        [
            "Way.",
            "So here we are going for and a synchronous discovery.",
            "I'm interested in to know which are the service for formal transformation to be able to some other formats I may be found some of them I maybe don't find services and I want to be notified on what is happening.",
            "Knew services are services available matching with my goal.",
            "My wishes.",
            "Or services that have been removed from the GSP?",
            "I move means that in the GSP are the description is cutted.",
            "The service could stay again there."
        ],
        [
            "This is the technical schema.",
            "So.",
            "We have again the client, the collaboration platform we have.",
            "The subscription on the.",
            "This is the ways mix environment, the base of the generic service platform.",
            "And we have the registry here, so we.",
            "Subscribe from the client.",
            "To a goal in the generic service platform that is stored inside the repository of with mix.",
            "So we send a goal and we store the goal there.",
            "When something will happen here, so new service is registered.",
            "The GSP will match these goals, if fine.",
            "If he found that one of the services inserted match with this goal will send a notification to the collaboration platform.",
            "Send a message means that we can receive the this information by email or by web service.",
            "So case by case we can select what is the best way to be notified."
        ],
        [
            "This is the notification broker.",
            "That has been on you.",
            "In development.",
            "From coin inserted in the Wiz mix environment.",
            "You can see the other.",
            "Ways mix component.",
            "Do the discovery communication management with collaborative platform choreography.",
            "Rank and selection."
        ],
        [
            "I don't go in so much technical details.",
            "Then"
        ],
        [
            "New component, The notification broker squared."
        ],
        [
            "Red Square.",
            "Is responsible of several task.",
            "So accept the subscription, store their subscription, manage the least of subscription that could be very huge.",
            "And stored in the registry, we execute the discovery process.",
            "So new subscription and service registration and for the first version of the coin platform presented in Year 2 review, we have just a notification of new services.",
            "But for the next review we have also the discovery of removing of services.",
            "Injecting some code on the Wiz mix environment.",
            "And then I as I presented before notifying subscribers can.",
            "Happened by email.",
            "And by web service invocation."
        ],
        [
            "OK, we created a new endpoint.",
            "New web service that can be invoked by the collaborative platform or better than GSP client injecting the collaborative platform with.",
            "This methods so retrieve the subscription, the ID subscription and subscribe subscribe all."
        ],
        [
            "OK, I skipped the technical details.",
            "This is an example of the notification by email.",
            "This is still technical level.",
            "So we receive.",
            "Than you.",
            "The.",
            "The new Service message service."
        ],
        [
            "School that has been inserted here."
        ],
        [
            "OK, I don't have a demo for that.",
            "On videos.",
            "There are no question I go to the execution.",
            "The monitoring of the execution in the generic service platform."
        ],
        [
            "So this is.",
            "Another presentation of the ways mix environment and we have on the top the monitoring part.",
            "Monitoring is very useful.",
            "Because we need to know what's happening, what is happening here.",
            "For Ashley and for charging bills.",
            "To the user that use the services, so we have to monitor everything and based on these monitoring we also change the response time and functional properties like that."
        ],
        [
            "Rotation of the service.",
            "This is the ontology for the GSP monitoring.",
            "I don't go in details we have in the center.",
            "Of course the activity event.",
            "Related to an activity.",
            "And then we have a lot of concept.",
            "Lincoln today."
        ],
        [
            "So again, the monitoring manager is responsible.",
            "This component is responsible for the following task, so extract data monitoring interest.",
            "Which are the topics that we want to monitor?",
            "Transforming data into appropriate format according to the ontology presented in the slide B4 bout, occurrences of observed data.",
            "OK, I don't go in other details."
        ],
        [
            "For that.",
            "Just."
        ],
        [
            "Skip this.",
            "Just do information about what is behind the monitoring so.",
            "You have the RDF.",
            "As a base sparkle query.",
            "To look on the RDF to see what happened.",
            "If the service as well, if the service is always online is something goes down.",
            "OK activities are we have crude on monitoring FDR.",
            "RDF.",
            "Create, read, update, delete."
        ],
        [
            "OK. And these are then.",
            "The technical implementation at this time, so you are two.",
            "So we update the average invocation time.",
            "That is used as non functional property, so I want to look for a service.",
            "And I really interested in the time.",
            "The answer time from this service, if I have to send 100 of invoices per second.",
            "And I want this service will answer with.",
            "They transformed the transformation of the format.",
            "I'm really interested to have a very fast service.",
            "If I send just one invoice per month, I'm not so interested in this, so this is the basis for the non functional properties.",
            "We have also the average invocation time per user.",
            "And the notification of their reputation manager.",
            "Also their reputation is involved on this service that is not online 5% of the time.",
            "The reputation will be lower."
        ],
        [
            "So till now I talked about Step 2.",
            "So collaborative platform that ask is notified by the GSP on services.",
            "And is the human that drives this process.",
            "Working on the client graphical user interface for the GSP.",
            "What we are doing in step three step."
        ],
        [
            "Tree."
        ],
        [
            "I will start with an example.",
            "We have some people we have a business process to create a meeting so we have to invite person to meeting, discuss, send, Agenda, reminder, meeting, run the meeting.",
            "And at the end, send minutes at this stage, Step 2.",
            "We have some of them that services and for the missing services that you may have to look for them.",
            "Asking to the GSP.",
            "And the human should be aware on the context.",
            "That is, behind the selection of the service.",
            "If I have to invite a meeting a person, I can use a lot of services.",
            "I can send an email like in our example, but also I can open a Skype chat or.",
            "Use other services or instant messaging, for example.",
            "How to select the best service depends on the context.",
            "So which project we are the role of the person is a boss is just the developer.",
            "I'm also developer where is the person.",
            "If he's in the office, I can send him an email or I can phone him.",
            "If it's outside the office and I need to contact him, maybe I can send SMS message.",
            "Our gender, if it's free, busy, or available if it's available, I can use the phone.",
            "If it's in a meeting, I probably send an email.",
            "It depends.",
            "If he's alone or with somebody or the.",
            "If it's idle or.",
            "We have priority on this job that we are doing or which devices as it.",
            "So.",
            "Starting from the context behind for the same activity.",
            "There are several services that can be used in this context to contact, for example, a person or for sending an email."
        ],
        [
            "Let's see this example in relation of our steps.",
            "That you are doing in coin.",
            "So I want to contact 1 one person.",
            "Step 0 is I know him.",
            "I have the phone, I call him.",
            "Step one is to use a collaboration platform to do this.",
            "I have in my company the five right tell it up on the browser.",
            "I will see a page and I can look for the people and see the number of telephone and call 220 and I will call my colleague.",
            "This is step one for the same company.",
            "For a cluster it depends.",
            "So step one is."
        ],
        [
            "Status of the art.",
            "Step 2 I already presented is use the GSP client module to find a service through the GSP, inject the service inside the business process and the reasoning is up to the human.",
            "I before selected an email to inform a person why.",
            "Because of my knowledge.",
            "I know that he has an email.",
            "I don't know if he has Skype for example or something other.",
            "I know the context as businessman and I reason and I select I search for an email service."
        ],
        [
            "In Step 3.",
            "That they started.",
            "Is ongoing on coin.",
            "We want to transfer the reasoning from the human to the system.",
            "So is not the human that I have to take."
        ],
        [
            "Share of the reasoning of the search."
        ],
        [
            "For services this is an overview of what we are doing right now.",
            "So the human.",
            "Is again on the business process.",
            "You need one service to contact a person.",
            "And ask.",
            "In the GSP client I want to communicate with Sergio and send this message.",
            "See you on Monday.",
            "I'm not looking for an email service.",
            "I want to send a message.",
            "Just that, and this is the message.",
            "I don't want to reason to see if it is in the office, or if as an email or where is.",
            "What is the Skype address?",
            "He says no.",
            "I don't want to take care of this is the system that I have to take care of that?",
            "So the knowledge is in the cluster, so we have a knowledge base here, starting from the knowledge base, we create a set of rules that will be used by an expert system.",
            "Probably will use just as expert system.",
            "And on top of that, there will be the functionalities of the GSP client graphical user interface I presented before.",
            "But is not the human that we lost us here inserting pre and post condition for search for any an email service just say see you on Monday.",
            "I want to communicate with surgeon.",
            "Based on that rules.",
            "The GSP client start starting from the rules and.",
            "The humor request the expert system.",
            "We select the right concept of the EC or EI ontology.",
            "To find the right service.",
            "In this case, the example is.",
            "Synchronous are a synchronous service for communication or invasive or discrete.",
            "We are we can have if.",
            "X is a Newman and.",
            "Again, that is busy.",
            "And has email then use email.",
            "But also if is not if it is available and as a Skype address, use Skype because it's faster.",
            "So we have a big set of rules inside here.",
            "And by inferential algorithm.",
            "We will select the best words best concept to be sent here.",
            "So we will ask for a synchronous.",
            "For example, if the person is available like an example is available is not.",
            "It has any communication way.",
            "I will ask for a synchronous service like Skype, Skype call.",
            "Is busy in the agenda.",
            "The expert system will select and a synchronous way.",
            "Like an email.",
            "Tordon bore him because there is only meeting.",
            "So here we just select the right concept of the ontology starting from the rules and your request.",
            "The GSP will work as worked before, so starting from pre and post condition we will find the right service behind.",
            "And we'll answer done it with the service here and then.",
            "This will be sent to the business process.",
            "And we will receive.",
            "Skype service in the example before I sent an email.",
            "But maybe it's in this case it's better to use Skype.",
            "Skype call.",
            "Be cause of India again that person is free.",
            "It has a Skype address.",
            "There's an email address, but I want to.",
            "The faster way is to communicate by Skype in this case, so the reasoning is not up to the human that has to select the service, but is up to the system.",
            "That have to select the right service.",
            "For that, and this will be.",
            "Will try to apply it.",
            "Today's meeting process.",
            "The simplest case is to invite the person of the meeting.",
            "So send a message.",
            "This is for.",
            "The next move of coin.",
            "OK.",
            "I just gave you.",
            "A short introduction of Step 3 for enterprise collaboration.",
            "For enterprise interoperability, we are working on that and we want to use services from business process interoperability.",
            "I explained you yesterday that are able to understand the gaps among processes from coming from different companies.",
            "For example, are able to understand if there is a format mismatches among two companies.",
            "Now if we have two different processes and we have a format one as output from once one step and format five as input for the other is the human that have to recognize this insert another step and ask to the GSP for a formal transformation service from format one to format 5.",
            "We want to make it automatically.",
            "So is the system that automatically we recognize the mismatch and we'll ask for the GSP for the right concept of the ontology."
        ],
        [
            "So I have to say thanks to Webcare team, because half of the slides come from them."
        ],
        [
            "And I finished earlier my presentation.",
            "Sorry if you have any questions.",
            "If I may, the last question that you posed last."
        ],
        [
            "Slides back please.",
            "Beef.",
            "Mentioned that the services that you have looked into, enterprise collaboration there very similar to Skype, and you're also includes a Skype based services.",
            "And yeah we have also that one as baseline we use.",
            "Are in we have the work package for the human interaction.",
            "We have some baselines, we call baselines coming from other projects or from the real world task.",
            "Of course, Skype, email, instant messaging, Facebook, Twitter, our communication services.",
            "Then on top of them we have other innovative services able to log what is happening and to retrieve.",
            "The collaboration attitude of the human, the trust among humans.",
            "And for example, to services to share documents based on trust based on my relationship, I work a lot with you.",
            "I assist you very well so you can access to my document.",
            "I never work with the other person and she can maybe download just the abstract of my documents.",
            "So we have this kind of baseline services and some innovative services on the top.",
            "For this example, we use the baseline service because it's easier.",
            "So.",
            "As well as you.",
            "Other sources like MSN or.",
            "We have also done messaging.",
            "Messaging service from coin.",
            "But messaging service is also included in Skype as well.",
            "Or is it something different?",
            "The Skype chat is exactly the MSN chat, but OK are two different services, but maybe an user have Skype but doesn't have an MSN or protocols like this one messaging service.",
            "Anything that they're using it just combines them together.",
            "Yeah, we have not created another Skype.",
            "We use Skype.",
            "Yeah, door invented the wheel.",
            "If the wheel works.",
            "No, we selected.",
            "Easy to understand services to this because the advance the research is not in service is in the way we discover it.",
            "An in the way we transfer the reasoning from the human to the system.",
            "So the concept was very good, though.",
            "The thing is that.",
            "Are you envisaging within the product?",
            "So as you said, it is about two years we are in the product and four years long I think yeah, so now we are approaching on February the third year review.",
            "So what does the final outcome?",
            "Are you expecting that these services will be fully integrated into?",
            "Industry or they will be used?",
            "Or is it?",
            "What is the final aim as service?",
            "Do you mean this service or devaul coin platform?",
            "You are providing this is a question for Sergio Gusmeroli.",
            "Your opinion, the ones which are on the side, maybe the services 123 or the one which is specific that you are dealing with you will be using it within your Institute or will it be provided to others as well?",
            "That's also a question for searching.",
            "Yes, yes the I haven't the slides.",
            "Maybe?",
            "No, I don't know the answer.",
            "As.",
            "I'm taking care of makes the system working.",
            "But I don't want to say something that is wrong.",
            "Again.",
            "Presentation you adopted this WSMX&WSMO structure.",
            "I'm sorry the modeling language in the execution element.",
            "What is that exactly?",
            "It came from one of the partners from Wanda of the partners from WBK is part of STI International that is partner of Coin and STI is the main provider service provider of the GSP that is based on with me with smokes and asks the we take care more on the previous part of the product.",
            "So the collaborative platform is selected as a technology.",
            "Because one of the partners were strong there again because was stronger and was one of the most recognized platform in this field in the scientific world.",
            "So it was not blind selection.",
            "So we select the partner also because of its platform for semantic they already have with mics that work with ontological description registration of the service and we are putting things over that.",
            "Don't reinvent the wheel again, but just put new functionalities new new way.",
            "To search services to adopt it.",
            "And is the development of of those standards?",
            "Are those being supported?",
            "Are they still alive?",
            "Everything working in with mix still alive?",
            "We just put something more.",
            "We're not cutting."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I will start with the coin platform.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Demonstration.",
                    "label": 0
                },
                {
                    "sent": "So these are topics I will address.",
                    "label": 0
                },
                {
                    "sent": "I will give you a fast.",
                    "label": 0
                },
                {
                    "sent": "Vision of the technical platform.",
                    "label": 0
                },
                {
                    "sent": "And then I will show you how we register semantically.",
                    "label": 0
                },
                {
                    "sent": "The service in the platform.",
                    "label": 0
                },
                {
                    "sent": "How we search, discover, rank and execute the services through the our generic service platform.",
                    "label": 0
                },
                {
                    "sent": "In full an push way then how I will present to you how we monitor the execution of the services and then I will give you a vision of the next steps that we are.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Doing so, let's start with our tree.",
                    "label": 0
                },
                {
                    "sent": "We have three steps here.",
                    "label": 0
                },
                {
                    "sent": "This is step one that is state of the art.",
                    "label": 0
                },
                {
                    "sent": "So there is a business process inside the business process.",
                    "label": 0
                },
                {
                    "sent": "There are some steps that are linked to some services provided by a collaboration collaboration platform.",
                    "label": 1
                },
                {
                    "sent": "So this is state of the art.",
                    "label": 0
                },
                {
                    "sent": "Everything on the.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Company portal for example.",
                    "label": 0
                },
                {
                    "sent": "What we are doing and what I present I will show to you today in the first part of my presentation is our what we call Step 2 so we have again.",
                    "label": 0
                },
                {
                    "sent": "A business process and for some steps we already have our services and our collaboration platform, but we miss some services here and there.",
                    "label": 1
                },
                {
                    "sent": "We need a service, for example for invoicing or for a formal transformation, and we have to find it.",
                    "label": 0
                },
                {
                    "sent": "And we will found and use the service through the generic service platform of coin.",
                    "label": 1
                },
                {
                    "sent": "In which are registered the services I presented yesterday so called EI and EC Enterprise interoperability, Enterprise Collaboration Services Cousin calling.",
                    "label": 0
                },
                {
                    "sent": "We focused on that kind of services.",
                    "label": 0
                },
                {
                    "sent": "And semantically we'll find them, and we will inject this service in our business process and we use them through this journey.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Service platform.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "A nice view of the current state of the art.",
                    "label": 0
                },
                {
                    "sent": "We have the collaboration platform of coin that is based on a life Reporter.",
                    "label": 0
                },
                {
                    "sent": "We had a lot of services injected there.",
                    "label": 0
                },
                {
                    "sent": "Will the functionalities of Liferay are still alive and.",
                    "label": 0
                },
                {
                    "sent": "Is something like the company portal that you probably have in your in your company so you have some services, some data user logins and so on inside here.",
                    "label": 0
                },
                {
                    "sent": "Then we have the generic service platform provided by coin based on Wismer with mix technologies.",
                    "label": 0
                },
                {
                    "sent": "We are different models that are able to discover, service, compose, service, select a rank the services.",
                    "label": 0
                },
                {
                    "sent": "Make choreography and invoke services.",
                    "label": 0
                },
                {
                    "sent": "Everything here is based on semantic.",
                    "label": 0
                },
                {
                    "sent": "Behind the platform we have the generic service platform.",
                    "label": 0
                },
                {
                    "sent": "We have the services.",
                    "label": 0
                },
                {
                    "sent": "We have two main categories of services.",
                    "label": 0
                },
                {
                    "sent": "We have web services so we register inside the platform.",
                    "label": 0
                },
                {
                    "sent": "The wisdom of the service.",
                    "label": 0
                },
                {
                    "sent": "Are we have graphical user interface, so we have a business layer with graphical user interface and we register also this kind of services is that inside the platform.",
                    "label": 0
                },
                {
                    "sent": "We registered them semantically.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "Oh, a complex view of our portal.",
                    "label": 0
                },
                {
                    "sent": "We increased a little bit the functionalities of liferay.",
                    "label": 0
                },
                {
                    "sent": "But then going so much details here, you can see that there are some kind services.",
                    "label": 0
                },
                {
                    "sent": "Here on the same server or in other service linked to the collaboration platform.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's talk on before on how we register our services inside the generic service platform.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So how we register those services here?",
                    "label": 0
                },
                {
                    "sent": "How we create our catalog of services inside the generic service.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Form.",
                    "label": 0
                },
                {
                    "sent": "So first of all we have two ontologies.",
                    "label": 0
                },
                {
                    "sent": "One for the EC domain, another for the domain.",
                    "label": 0
                },
                {
                    "sent": "Here we have some.",
                    "label": 0
                },
                {
                    "sent": "Numbers about this related to the ER two of coin in December will finish the final version of the services and will increase the number of services, and we probably extend again, this ontology.",
                    "label": 0
                },
                {
                    "sent": "For example, I can show you we have the concept of documents and we have different kind of documents like Gantt chart, production plan, bill of material and you will see.",
                    "label": 0
                },
                {
                    "sent": "How will find register and find service about this topics?",
                    "label": 0
                },
                {
                    "sent": "This concept again we have also algorithm.",
                    "label": 0
                },
                {
                    "sent": "Communication card anality interaction mode.",
                    "label": 0
                },
                {
                    "sent": "Synchronous or synchronous, and so on.",
                    "label": 0
                },
                {
                    "sent": "This is for the EC.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I mean so the collaboration.",
                    "label": 0
                },
                {
                    "sent": "This is less readable for the I we have again 39 concept, 14 relation and.",
                    "label": 0
                },
                {
                    "sent": "At this stage we are two of coin.",
                    "label": 0
                },
                {
                    "sent": "We have seven coin Baseline Services, an nine coin ya innovative services.",
                    "label": 1
                },
                {
                    "sent": "Mapped to this ontology.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's start with the registration of the services.",
                    "label": 0
                },
                {
                    "sent": "This is the graphical user interface that should be used by the provider of the service by the service provider to register its service in our platform.",
                    "label": 0
                },
                {
                    "sent": "So first of all we have to select of course namespace a semantic web service, it interfere.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So where is the service?",
                    "label": 0
                },
                {
                    "sent": "Then we have to import.",
                    "label": 0
                },
                {
                    "sent": "The ontologies AI or easy or in the future other ontologies.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Here we will define in which scope.",
                    "label": 0
                },
                {
                    "sent": "Is the service API or easy in our case?",
                    "label": 0
                },
                {
                    "sent": "So just selecting the correct ontology.",
                    "label": 0
                },
                {
                    "sent": "For example.",
                    "label": 0
                },
                {
                    "sent": "In this case we have enterprise collaboration ontology.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then we are going to build.",
                    "label": 0
                },
                {
                    "sent": "Pre and post condition of the service.",
                    "label": 1
                },
                {
                    "sent": "The concept of pre and post condition.",
                    "label": 0
                },
                {
                    "sent": "Not so.",
                    "label": 0
                },
                {
                    "sent": "Or related to input and output is the ontological description.",
                    "label": 0
                },
                {
                    "sent": "Of.",
                    "label": 0
                },
                {
                    "sent": "Precondition of the service and post condition to register.",
                    "label": 0
                },
                {
                    "sent": "A service that send an email.",
                    "label": 0
                },
                {
                    "sent": "For example, I have as preconditioned to send a message.",
                    "label": 0
                },
                {
                    "sent": "I have a message and I have two individuals.",
                    "label": 0
                },
                {
                    "sent": "As post condition I have the message sent.",
                    "label": 0
                },
                {
                    "sent": "This is our ontological description.",
                    "label": 0
                },
                {
                    "sent": "Of pre and post condition of the service this this work comes from the wizmo is based on Wismer with mix.",
                    "label": 0
                },
                {
                    "sent": "Technologies.",
                    "label": 0
                },
                {
                    "sent": "So here we are registering the service of to send an email.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "With select.",
                    "label": 0
                },
                {
                    "sent": "As precondition, the email message and then the individual.",
                    "label": 0
                },
                {
                    "sent": "That is below.",
                    "label": 0
                },
                {
                    "sent": "So we are creating this and as postcondition we add, message sent.",
                    "label": 0
                },
                {
                    "sent": "Of course we can work on different levels, we can.",
                    "label": 0
                },
                {
                    "sent": "Say email message but we can have also more generic precondition like message.",
                    "label": 0
                },
                {
                    "sent": "I have a message.",
                    "label": 0
                },
                {
                    "sent": "In this case, we have an email message.",
                    "label": 0
                },
                {
                    "sent": "This is important for the disk.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Coveri that will be afterward.",
                    "label": 0
                },
                {
                    "sent": "This again.",
                    "label": 0
                },
                {
                    "sent": "More advanced status of pre and post condition.",
                    "label": 1
                },
                {
                    "sent": "So we have selected two individuals.",
                    "label": 0
                },
                {
                    "sent": "And image service message and this is the post condition this is.",
                    "label": 0
                },
                {
                    "sent": "Probably is difficult to read email message sent and.",
                    "label": 0
                },
                {
                    "sent": "Among brackets we have the three preconditions.",
                    "label": 0
                },
                {
                    "sent": "So we send.",
                    "label": 0
                },
                {
                    "sent": "A message among two individuals.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As post condition.",
                    "label": 0
                },
                {
                    "sent": "Then again, we.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Define the annotation of the service and we define the non functional properties we can.",
                    "label": 0
                },
                {
                    "sent": "You search for functional properties or for non functional properties nonfunctional could be the most of the case.",
                    "label": 0
                },
                {
                    "sent": "The price of the service could be for free or we can have prices.",
                    "label": 0
                },
                {
                    "sent": "For the usage.",
                    "label": 0
                },
                {
                    "sent": "Or we have the invocation time and the reputation of the service.",
                    "label": 0
                },
                {
                    "sent": "As non functional properties.",
                    "label": 0
                },
                {
                    "sent": "So we are registering our service on our email service and here we put the price for power invoke.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Nation.",
                    "label": 0
                },
                {
                    "sent": "This is the final.",
                    "label": 0
                },
                {
                    "sent": "Document we have from the registration.",
                    "label": 0
                },
                {
                    "sent": "We have pre post condition.",
                    "label": 0
                },
                {
                    "sent": "We have the ontologies.",
                    "label": 0
                },
                {
                    "sent": "The non functional properties here are praan post condition.",
                    "label": 0
                },
                {
                    "sent": "Anne, this is this graphical user interface is used by the service provider just to create this template that will be used from the generic service platform to find the service.",
                    "label": 1
                },
                {
                    "sent": "But of course.",
                    "label": 0
                },
                {
                    "sent": "We have created this graphical user interface to don't let the user to type manually everything.",
                    "label": 0
                },
                {
                    "sent": "Here we provide this to.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Facilitate the work.",
                    "label": 0
                },
                {
                    "sent": "This is the service that has been registered.",
                    "label": 1
                },
                {
                    "sent": "Through this document, inside the generic service platform that is based on with mix and you can see that we have a lot of services inside.",
                    "label": 0
                },
                {
                    "sent": "In this case, we are talking about a web service.",
                    "label": 0
                },
                {
                    "sent": "Quick question so far.",
                    "label": 0
                },
                {
                    "sent": "Let's say to specify the register.",
                    "label": 0
                },
                {
                    "sent": "Let's say.",
                    "label": 0
                },
                {
                    "sent": "Medium complex service.",
                    "label": 0
                },
                {
                    "sent": "Depends on your skill on on pre post condition.",
                    "label": 0
                },
                {
                    "sent": "How much time would you need?",
                    "label": 0
                },
                {
                    "sent": "Would you need for force?",
                    "label": 0
                },
                {
                    "sent": "OK, I'm not an expert in this field.",
                    "label": 0
                },
                {
                    "sent": "An IRA just read an simple web service in 10 minutes.",
                    "label": 0
                },
                {
                    "sent": "With this, but it depends of the cases so far.",
                    "label": 0
                },
                {
                    "sent": "Complex services that maybe are not really easy to map on the ontology.",
                    "label": 0
                },
                {
                    "sent": "You have to ask to a large ontology and you have maybe to study what is pre and post condition.",
                    "label": 0
                },
                {
                    "sent": "Metro.",
                    "label": 0
                },
                {
                    "sent": "Generally it's more like ours with this graphical user interface, no at the beginning of the project we didn't have these graphical user interface an we need these to do this work now as easier early, easier to do because before you have to write down all this manually, all this document.",
                    "label": 0
                },
                {
                    "sent": "That is not so easy if you are not skilled in this field in Wiz mix.",
                    "label": 0
                },
                {
                    "sent": "Now is easier.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so we have registered the service in the generic service platform.",
                    "label": 0
                },
                {
                    "sent": "So for example, this email service that will use afterward.",
                    "label": 0
                },
                {
                    "sent": "8 two individuals and the messages, condition and message sent as post.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so now we are.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I need to see how we search, discover, rank and execute this service and others in Pool way.",
                    "label": 0
                },
                {
                    "sent": "So request from the collaboration platform and as we're from the generic service platform.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is our Step 2 I already pressed.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Entered.",
                    "label": 0
                },
                {
                    "sent": "Inside our collaboration platform we have added this graphical user interface that is the GSP client interface.",
                    "label": 0
                },
                {
                    "sent": "I will show you then by videos.",
                    "label": 0
                },
                {
                    "sent": "How we use this?",
                    "label": 0
                },
                {
                    "sent": "This is just ER, two of coin.",
                    "label": 0
                },
                {
                    "sent": "We are rebuilding the graphical user interface to modifying let's.",
                    "label": 0
                },
                {
                    "sent": "To be more understandable by non technical users, but for businessmen that we're going to take.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Afterward.",
                    "label": 0
                },
                {
                    "sent": "This is our GSP client.",
                    "label": 1
                },
                {
                    "sent": "The technical view.",
                    "label": 0
                },
                {
                    "sent": "We have the again the GSP.",
                    "label": 0
                },
                {
                    "sent": "Not detail IDR with C and EI on teologi.",
                    "label": 0
                },
                {
                    "sent": "OK this is just easy ontology but we have also the ontology.",
                    "label": 0
                },
                {
                    "sent": "For functional and non functional properties and the services behind registered inside.",
                    "label": 0
                },
                {
                    "sent": "Services can stay.",
                    "label": 0
                },
                {
                    "sent": "Where you want in the same machine, another machine in Mexico, China, Europe doesn't matter.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "The collaboration platform in which we have a business process with some steps.",
                    "label": 0
                },
                {
                    "sent": "For some steps we have already in our collaboration platform services.",
                    "label": 0
                },
                {
                    "sent": "But for some steps we need to find new services.",
                    "label": 0
                },
                {
                    "sent": "And this is the graphical user interface that can help us to communicate with GSP to find this these services we have a copy of the ontology downloaded from the generic service platform in order to speak the same language.",
                    "label": 0
                },
                {
                    "sent": "And we have different models.",
                    "label": 0
                },
                {
                    "sent": "We have the model to load the ontologies.",
                    "label": 0
                },
                {
                    "sent": "Of course we have the goal management model.",
                    "label": 0
                },
                {
                    "sent": "The goal is the request for the GSP.",
                    "label": 0
                },
                {
                    "sent": "Then we have the invocation model that is able to.",
                    "label": 0
                },
                {
                    "sent": "Invoke the service center.",
                    "label": 0
                },
                {
                    "sent": "This goal is to search the service.",
                    "label": 0
                },
                {
                    "sent": "This is to invoke a service through the graphic GSP.",
                    "label": 0
                },
                {
                    "sent": "Then we have ranking module.",
                    "label": 0
                },
                {
                    "sent": "And you will see how we rank the services.",
                    "label": 0
                },
                {
                    "sent": "We don't just discover and give them to you, but will match the non functional properties that we rank.",
                    "label": 0
                },
                {
                    "sent": "Accordingly.",
                    "label": 0
                },
                {
                    "sent": "The services discovered if you have more than one service discovered.",
                    "label": 0
                },
                {
                    "sent": "Then we have the monitor model that is push.",
                    "label": 0
                },
                {
                    "sent": "Way we see afterwards.",
                    "label": 0
                },
                {
                    "sent": "OK the communication model that's managed the bus.",
                    "label": 0
                },
                {
                    "sent": "From the from the module and generic service platform.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just to show you what is the business process.",
                    "label": 0
                },
                {
                    "sent": "In the collaborative platform, Life Reporter created or adapted for coin.",
                    "label": 0
                },
                {
                    "sent": "We have this business process in which we have to create a production planning, do the production process, send the goods, inform the two partners of goods that has been shipped, and then we have to translate any invoice.",
                    "label": 0
                },
                {
                    "sent": "From the tool.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the slide I'll show you is.",
                    "label": 0
                },
                {
                    "sent": "Here, so here we have the business process with that steps and we.",
                    "label": 0
                },
                {
                    "sent": "Are going to.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Find some services.",
                    "label": 0
                },
                {
                    "sent": "This is our scenario presented the secondary view of coin.",
                    "label": 0
                },
                {
                    "sent": "Adapted from the fearless case that is the.",
                    "label": 0
                },
                {
                    "sent": "A cluster from lots of region on outer space.",
                    "label": 0
                },
                {
                    "sent": "In this case, we are talking about production of antenna, who was here yesterday.",
                    "label": 0
                },
                {
                    "sent": "You have seen something of this process inside the C3P service, so we have two companies tests an COM.",
                    "label": 0
                },
                {
                    "sent": "Com is the supplier of tests, so in this very.",
                    "label": 0
                },
                {
                    "sent": "Short example.",
                    "label": 0
                },
                {
                    "sent": "We have to make a shared production plan, but we don't have a service.",
                    "label": 0
                },
                {
                    "sent": "To collaborate on production planning, we have to do the production process and this is outside the scope of the business process received the goods and then informed by email the two partners and then send invoice.",
                    "label": 0
                },
                {
                    "sent": "And translate the invoice behind and we don't have these four services.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The search of the first service, so we need a service to make.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As shared production plan, we already have our legacy system, but we need something to collaborate on that.",
                    "label": 0
                },
                {
                    "sent": "So in this case we will invoke we search.",
                    "label": 0
                },
                {
                    "sent": "Send a search to the generic service platform that will discover.",
                    "label": 0
                },
                {
                    "sent": "The right service for us and we send the result.",
                    "label": 0
                },
                {
                    "sent": "To the GSP client and in the next steps we show how to.",
                    "label": 0
                },
                {
                    "sent": "From the result to inject the service in the business process.",
                    "label": 0
                },
                {
                    "sent": "OK, this is the old yard.",
                    "label": 0
                },
                {
                    "sent": "Two graphical user interface of the GSP client.",
                    "label": 0
                },
                {
                    "sent": "Very very easy.",
                    "label": 0
                },
                {
                    "sent": "You have the Enterprise Collaboration tab and the Enterprise Interoperability tab.",
                    "label": 0
                },
                {
                    "sent": "Now we are talking about collaboration.",
                    "label": 0
                },
                {
                    "sent": "We have to collaborate on a production plan.",
                    "label": 0
                },
                {
                    "sent": "And we have a precondition of the service here and the postcondition here.",
                    "label": 0
                },
                {
                    "sent": "So we have to insert pre and post condition of the service.",
                    "label": 0
                },
                {
                    "sent": "We would like to find and use.",
                    "label": 0
                },
                {
                    "sent": "This is the functional part, and this is the non functional properties.",
                    "label": 0
                },
                {
                    "sent": "At this step we don't use the non functional property so I will show you.",
                    "label": 0
                },
                {
                    "sent": "Afterwards, in this case we try before weed.",
                    "label": 0
                },
                {
                    "sent": "Something generic.",
                    "label": 0
                },
                {
                    "sent": "I have to.",
                    "label": 0
                },
                {
                    "sent": "Let me go back one second, OK?",
                    "label": 0
                },
                {
                    "sent": "There is an entity.",
                    "label": 0
                },
                {
                    "sent": "I don't go in detail saying that the entity is an individual human or a cluster of an organization.",
                    "label": 0
                },
                {
                    "sent": "I say something generic.",
                    "label": 0
                },
                {
                    "sent": "I want to see then what is happening.",
                    "label": 0
                },
                {
                    "sent": "So then I will go in detail and a document we have to share a production plan.",
                    "label": 0
                },
                {
                    "sent": "At this stage I say documents very generic as precondition.",
                    "label": 0
                },
                {
                    "sent": "And then as postcondition.",
                    "label": 0
                },
                {
                    "sent": "I want to do a collaborative work.",
                    "label": 0
                },
                {
                    "sent": "On preconditions, so I want to do a collaborative work among entities on a document.",
                    "label": 0
                },
                {
                    "sent": "This is a very generic search.",
                    "label": 0
                },
                {
                    "sent": "I send a request to the generic service platform and this is the answer from the generic service platform.",
                    "label": 0
                },
                {
                    "sent": "We did a very generic search, very high level entities documents so we don't have any exact match with our pre and post condition.",
                    "label": 0
                },
                {
                    "sent": "Plug in means that we found something that do something less that we required.",
                    "label": 0
                },
                {
                    "sent": "Sorry, something more subsumption is a service more specific than what we are looking for.",
                    "label": 0
                },
                {
                    "sent": "In this case, we have found the collaboration for project management Service represented yesterday that provide collaborative work on.",
                    "label": 0
                },
                {
                    "sent": "Projektmanagement and we have the collaborative 3D service that provides collaborative work on 3D CAD diagram.",
                    "label": 0
                },
                {
                    "sent": "And production management service is collaborative work on bill of material.",
                    "label": 0
                },
                {
                    "sent": "So everything is more specific then we have other service and we have also the C3P service I presented yesterday that allow us to.",
                    "label": 0
                },
                {
                    "sent": "Work on a shared production plan.",
                    "label": 1
                },
                {
                    "sent": "To share our production plan and to see mismatches and collaborate on it.",
                    "label": 0
                },
                {
                    "sent": "This is our target.",
                    "label": 0
                },
                {
                    "sent": "So I have a lot of services, so I want to be more specific in the request, so I going to say.",
                    "label": 0
                },
                {
                    "sent": "Oh that we don't have an entity.",
                    "label": 0
                },
                {
                    "sent": "We have to organize, or an organization that have to work on this service.",
                    "label": 0
                },
                {
                    "sent": "As precondition and we have a production plan something.",
                    "label": 0
                },
                {
                    "sent": "More specific than a document.",
                    "label": 0
                },
                {
                    "sent": "And this post condition.",
                    "label": 0
                },
                {
                    "sent": "We say collaborative management.",
                    "label": 0
                },
                {
                    "sent": "So I launch again the request and in this case we have found an exact match.",
                    "label": 0
                },
                {
                    "sent": "That is what we are looking for.",
                    "label": 0
                },
                {
                    "sent": "The CTP service that provides collaborative work on a production planning.",
                    "label": 0
                },
                {
                    "sent": "In this case, we have a graphical user interface service.",
                    "label": 0
                },
                {
                    "sent": "So we can retrieve the real endpoint of this service through with mix.",
                    "label": 0
                },
                {
                    "sent": "Our invocation in the case of graphical user interface that is just the retrieval of the real endpoint of the service.",
                    "label": 0
                },
                {
                    "sent": "The work this is for the year 2.",
                    "label": 0
                },
                {
                    "sent": "What we are doing right now in coin is.",
                    "label": 1
                },
                {
                    "sent": "On this step, to make available the button to insert this service inside the business process in an automatic way.",
                    "label": 0
                },
                {
                    "sent": "So at this stage is manual, so I find this service and I have to do manually the insertion in the business process.",
                    "label": 0
                },
                {
                    "sent": "What we are doing now is to automatize the process.",
                    "label": 0
                },
                {
                    "sent": "Again, here we have just the description of the service.",
                    "label": 0
                },
                {
                    "sent": "I assure description what you are doing now is to provide something more to have to.",
                    "label": 0
                },
                {
                    "sent": "To give to the user the possibility to download information PDF files, for example on the service and.",
                    "label": 0
                },
                {
                    "sent": "Rank the service CD.",
                    "label": 0
                },
                {
                    "sent": "Assessment of the service of other person that already used the service.",
                    "label": 0
                },
                {
                    "sent": "So we are trying to build a decision support system based on these functionalities.",
                    "label": 0
                },
                {
                    "sent": "This is just the first prototype.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So now we have discovered this service.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second part, OK, I already showed you how to get the endpoint.",
                    "label": 0
                },
                {
                    "sent": "We give the real endpoint we insert into the business process.",
                    "label": 0
                },
                {
                    "sent": "The videos are little bit overlapping, sorry.",
                    "label": 0
                },
                {
                    "sent": "If OK. OK.",
                    "label": 0
                },
                {
                    "sent": "This is what they presented before, so just the retrieval of the service.",
                    "label": 0
                },
                {
                    "sent": "Now we are doing.",
                    "label": 0
                },
                {
                    "sent": "The automatically insertion, so the step 7.",
                    "label": 0
                },
                {
                    "sent": "This part.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so now we have the C3P service.",
                    "label": 0
                },
                {
                    "sent": "The that is an enterprise collaboration service based on graphical user interface.",
                    "label": 0
                },
                {
                    "sent": "In the first step.",
                    "label": 0
                },
                {
                    "sent": "Of our process.",
                    "label": 0
                },
                {
                    "sent": "We don't know nothing at this stage.",
                    "label": 0
                },
                {
                    "sent": "Because we don't have a service to receive the goods.",
                    "label": 0
                },
                {
                    "sent": "It's a manual step.",
                    "label": 0
                },
                {
                    "sent": "The businessman has to say done it when this process will be executed.",
                    "label": 0
                },
                {
                    "sent": "Of course, the legacy system can be injected everywhere.",
                    "label": 0
                },
                {
                    "sent": "Along with this step, this is just for.",
                    "label": 0
                },
                {
                    "sent": "Presenting the functionalities of the GSP.",
                    "label": 1
                },
                {
                    "sent": "And now we have to find we don't have the service.",
                    "label": 0
                },
                {
                    "sent": "We have to find a service to send email.",
                    "label": 0
                },
                {
                    "sent": "To test.",
                    "label": 0
                },
                {
                    "sent": "And also in the next step will send an.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Email so.",
                    "label": 0
                },
                {
                    "sent": "What we use here we are interested on price.",
                    "label": 0
                },
                {
                    "sent": "Non functional properties.",
                    "label": 0
                },
                {
                    "sent": "So we use the ranking model and new functional properties to find the right service for us.",
                    "label": 0
                },
                {
                    "sent": "So again, we'll find we search the service that will be discovered.",
                    "label": 0
                },
                {
                    "sent": "Will arrive the results will be ranked by the graphical user interface.",
                    "label": 0
                },
                {
                    "sent": "Rank based on non functional properties.",
                    "label": 0
                },
                {
                    "sent": "In this case we will have.",
                    "label": 0
                },
                {
                    "sent": "Web service so we can try the web service.",
                    "label": 0
                },
                {
                    "sent": "I will start Video 3.",
                    "label": 0
                },
                {
                    "sent": "OK, in this case we selected.",
                    "label": 0
                },
                {
                    "sent": "At the beginning the individuals.",
                    "label": 0
                },
                {
                    "sent": "As precondition and image service message as precondition and as postcondition.",
                    "label": 0
                },
                {
                    "sent": "Email message sent.",
                    "label": 0
                },
                {
                    "sent": "Very specific.",
                    "label": 0
                },
                {
                    "sent": "This is exactly the service we have inserted before we have registered in the GSP before.",
                    "label": 0
                },
                {
                    "sent": "And I have inserted here also the non functional properties.",
                    "label": 0
                },
                {
                    "sent": "In this case we have price timer reputation.",
                    "label": 0
                },
                {
                    "sent": "We just selected price and reputation.",
                    "label": 0
                },
                {
                    "sent": "0.2 means that I'm not so interested in the price, but I'm really interested in the reputation of the service.",
                    "label": 0
                },
                {
                    "sent": "That is calculated on monitoring of the service is up and running 100% of the time it's answer.",
                    "label": 0
                },
                {
                    "sent": "Who is the provider and so on?",
                    "label": 0
                },
                {
                    "sent": "So now.",
                    "label": 0
                },
                {
                    "sent": "I will submit with nonfunctional properties in the step before we send without the goal.",
                    "label": 0
                },
                {
                    "sent": "Without the functional properties.",
                    "label": 0
                },
                {
                    "sent": "Waiting for the answer and we found two services.",
                    "label": 0
                },
                {
                    "sent": "Taxi email service and email communication service.",
                    "label": 0
                },
                {
                    "sent": "So there are two different services that provide this same functionalities.",
                    "label": 0
                },
                {
                    "sent": "And TXT is the first.",
                    "label": 0
                },
                {
                    "sent": "Here we have two exact match.",
                    "label": 0
                },
                {
                    "sent": "We have we can see the description of the service and.",
                    "label": 0
                },
                {
                    "sent": "In this case, we have a web service, not a graphical user interface, so clicking here we don't retrieve just the web address of the service, but we have a graphical user interface to try the service to invoke the service.",
                    "label": 0
                },
                {
                    "sent": "This server this graphical user interfaces automatically generated starting from the ontological description of the service.",
                    "label": 0
                },
                {
                    "sent": "So starting from the concept of email, then will be up to the generic service platform to transfer what I will insert here.",
                    "label": 0
                },
                {
                    "sent": "In the real input and output parameter of the service.",
                    "label": 0
                },
                {
                    "sent": "In this case we have.",
                    "label": 0
                },
                {
                    "sent": "Has email address has subject as contact?",
                    "label": 0
                },
                {
                    "sent": "So in this case I can try this service again.",
                    "label": 0
                },
                {
                    "sent": "Here is a very simple graphical user interface, but we are working to make it better more.",
                    "label": 0
                },
                {
                    "sent": "Easy to understand.",
                    "label": 0
                },
                {
                    "sent": "And more focused on this season support system then just.",
                    "label": 0
                },
                {
                    "sent": "Search and test.",
                    "label": 0
                },
                {
                    "sent": "Submitting it.",
                    "label": 0
                },
                {
                    "sent": "This is my email.",
                    "label": 0
                },
                {
                    "sent": "I checked the Mail and I received.",
                    "label": 0
                },
                {
                    "sent": "Gmail.",
                    "label": 0
                },
                {
                    "sent": "So in this case we can test the service that businessman.",
                    "label": 0
                },
                {
                    "sent": "This is a lock the businessman can.",
                    "label": 0
                },
                {
                    "sent": "Check it if it's working is.",
                    "label": 0
                },
                {
                    "sent": "Is it exactly what you are looking for?",
                    "label": 0
                },
                {
                    "sent": "The email is very easy if you are talking about formal transformation with supply.",
                    "label": 0
                },
                {
                    "sent": "More data than just typing subjects receive embody of the Mail.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we found that XD email service for inform Vetrano.",
                    "label": 0
                },
                {
                    "sent": "That is the person from test.",
                    "label": 0
                },
                {
                    "sent": "Then we have to inform the supplier that.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Received the goods.",
                    "label": 0
                },
                {
                    "sent": "In this case we search again.",
                    "label": 0
                },
                {
                    "sent": "For an email service.",
                    "label": 0
                },
                {
                    "sent": "I will try it.",
                    "label": 0
                },
                {
                    "sent": "But in this case we don't need just an email service, but we need something more reliable.",
                    "label": 0
                },
                {
                    "sent": "We have to send.",
                    "label": 0
                },
                {
                    "sent": "A secure email.",
                    "label": 0
                },
                {
                    "sent": "Maybe signed in this case.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Let me open the video 4.",
                    "label": 0
                },
                {
                    "sent": "In this case I'm changing.",
                    "label": 0
                },
                {
                    "sent": "The non functional properties the functional properties are still the same because I'm looking for the same kind of service but I'm.",
                    "label": 0
                },
                {
                    "sent": "More interested on price and less in reputation.",
                    "label": 0
                },
                {
                    "sent": "Sorry it was the opposite.",
                    "label": 0
                },
                {
                    "sent": "So before I need something very that can be not for free, but I'm not so interested in the price, but I want to service with deny reputation.",
                    "label": 0
                },
                {
                    "sent": "In this case I'm not.",
                    "label": 0
                },
                {
                    "sent": "Interested in the reputation I have to send a simple email to the supplier.",
                    "label": 0
                },
                {
                    "sent": "So I and I'm really interested in the price.",
                    "label": 0
                },
                {
                    "sent": "I want IT services will be ranked by price.",
                    "label": 0
                },
                {
                    "sent": "Assending, so we'll find the four free services.",
                    "label": 0
                },
                {
                    "sent": "At the beginning.",
                    "label": 0
                },
                {
                    "sent": "On the top of the rank and this case we changed.",
                    "label": 0
                },
                {
                    "sent": "We changed the nonfunctional properties and the text email service that is not for free.",
                    "label": 0
                },
                {
                    "sent": "Unformed 60 and is on the bottom and on the top we have the other service that is me registered As for free.",
                    "label": 0
                },
                {
                    "sent": "So we have found exactly the same services, but ranked in a different way.",
                    "label": 0
                },
                {
                    "sent": "I can see again the description of the service.",
                    "label": 0
                },
                {
                    "sent": "And again open and test the other service.",
                    "label": 0
                },
                {
                    "sent": "As you can see the graphical user interface.",
                    "label": 0
                },
                {
                    "sent": "Is exactly the same becauses generated from this same description.",
                    "label": 0
                },
                {
                    "sent": "I semantic the same semantic description.",
                    "label": 0
                },
                {
                    "sent": "But the services behind are different.",
                    "label": 0
                },
                {
                    "sent": "I can skip the insertion.",
                    "label": 0
                },
                {
                    "sent": "And this is again.",
                    "label": 0
                },
                {
                    "sent": "My email.",
                    "label": 0
                },
                {
                    "sent": "And I received the other email using another service.",
                    "label": 0
                },
                {
                    "sent": "So we.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These two 2 steps we selected.",
                    "label": 0
                },
                {
                    "sent": "Two different image services ranked in a different way.",
                    "label": 0
                },
                {
                    "sent": "And we was interested on price and reputation about the services.",
                    "label": 0
                },
                {
                    "sent": "The last step.",
                    "label": 0
                },
                {
                    "sent": "Here we are talking about enterprise collaboration services.",
                    "label": 0
                },
                {
                    "sent": "I was in and in the Enterprise Collaboration tab now.",
                    "label": 0
                },
                {
                    "sent": "We are going to see how to search a service in the interoperability.",
                    "label": 0
                },
                {
                    "sent": "Domain we need to send an invoice and this example we have to find the service to transform UBL 1.0 to be.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": ".0.",
                    "label": 0
                },
                {
                    "sent": "In this case, we have the E ontology behind and not the easy ontology.",
                    "label": 0
                },
                {
                    "sent": "And I will show you how to find this service.",
                    "label": 0
                },
                {
                    "sent": "Here I'm opening.",
                    "label": 0
                },
                {
                    "sent": "The Enterprise interoperability tab.",
                    "label": 0
                },
                {
                    "sent": "What the graphical user interface is exactly the same of before just.",
                    "label": 0
                },
                {
                    "sent": "Different concept because we have of course another ontology for the eye, so you don't find email here.",
                    "label": 0
                },
                {
                    "sent": "You find.",
                    "label": 0
                },
                {
                    "sent": "Data model business process model.",
                    "label": 0
                },
                {
                    "sent": "What is related to the enterprise interoperability domain?",
                    "label": 0
                },
                {
                    "sent": "So we have to find.",
                    "label": 0
                },
                {
                    "sent": "A transformation from UBHL.",
                    "label": 0
                },
                {
                    "sent": "We have any stance of UBL as precondition.",
                    "label": 0
                },
                {
                    "sent": "And we want a data transformation at the end.",
                    "label": 0
                },
                {
                    "sent": "So we are looking for services that, as Precondition Ave BL document and we want to transform this JPL document.",
                    "label": 0
                },
                {
                    "sent": "As postcondition we have.",
                    "label": 0
                },
                {
                    "sent": "Or better, as post conditioned has been transformed.",
                    "label": 0
                },
                {
                    "sent": "Not the transformation, because transformation is the what we do in the service.",
                    "label": 0
                },
                {
                    "sent": "The post condition is that UBL is being transformed.",
                    "label": 0
                },
                {
                    "sent": "We insert also the non functional properties price.",
                    "label": 0
                },
                {
                    "sent": "We are not so much interested in price.",
                    "label": 0
                },
                {
                    "sent": "But we are interested a lot on their reputation.",
                    "label": 0
                },
                {
                    "sent": "We submit this goal to the generic service platform.",
                    "label": 0
                },
                {
                    "sent": "We find two different services.",
                    "label": 0
                },
                {
                    "sent": "In this case.",
                    "label": 0
                },
                {
                    "sent": "We have we don't have exactly.",
                    "label": 0
                },
                {
                    "sent": "Up, sorry.",
                    "label": 0
                },
                {
                    "sent": "We don't have a web service registered in the GSP that can do what I'm looking for, but we have this interpretive space service that is a graphical user interface based service that.",
                    "label": 0
                },
                {
                    "sent": "Can provide us the environment to create the transformation.",
                    "label": 0
                },
                {
                    "sent": "So in this case I idea and found the exact service, but I found this service that allow me to create the transformation from one format to another.",
                    "label": 0
                },
                {
                    "sent": "And because it is a graphical user interface, service will find.",
                    "label": 0
                },
                {
                    "sent": "The web address of him.",
                    "label": 0
                },
                {
                    "sent": "Is another kind of.",
                    "label": 0
                },
                {
                    "sent": "Services that we have so we have services like web service, graphical user interface and we have services to create other services.",
                    "label": 0
                },
                {
                    "sent": "So a new creating a new format transformation with this service will create a new web service that can be registered as service in the generic service platform.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we have.",
                    "label": 0
                },
                {
                    "sent": "Failed also the last step.",
                    "label": 0
                },
                {
                    "sent": "So we have this business process that can be executed in the future by the businessman.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the view of the model, so the first step for the creative production planning collaborate on the production planning.",
                    "label": 0
                },
                {
                    "sent": "We have the CTP service to manual steps.",
                    "label": 0
                },
                {
                    "sent": "To send email.",
                    "label": 0
                },
                {
                    "sent": "In this case, we have automatic steps.",
                    "label": 0
                },
                {
                    "sent": "What does it mean that?",
                    "label": 0
                },
                {
                    "sent": "The work we are doing is that when you try the service, you can also save the message to be sent.",
                    "label": 0
                },
                {
                    "sent": "And these two steps will be make automatic.",
                    "label": 0
                },
                {
                    "sent": "If we save in this way, this means that when the businessman we say done it at this step, these two steps will be executed automatically.",
                    "label": 0
                },
                {
                    "sent": "The other arm and one.",
                    "label": 0
                },
                {
                    "sent": "And then we have the federate Interoperability Service at this stage.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this was search discovery ranking and execution on R2.",
                    "label": 0
                },
                {
                    "sent": "Platform of coin.",
                    "label": 0
                },
                {
                    "sent": "With Pool way, so I ask from this collaboration platform to the generic service platform I received and as well.",
                    "label": 0
                },
                {
                    "sent": "Then we have also the Pooh.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Way.",
                    "label": 0
                },
                {
                    "sent": "So here we are going for and a synchronous discovery.",
                    "label": 0
                },
                {
                    "sent": "I'm interested in to know which are the service for formal transformation to be able to some other formats I may be found some of them I maybe don't find services and I want to be notified on what is happening.",
                    "label": 0
                },
                {
                    "sent": "Knew services are services available matching with my goal.",
                    "label": 0
                },
                {
                    "sent": "My wishes.",
                    "label": 0
                },
                {
                    "sent": "Or services that have been removed from the GSP?",
                    "label": 0
                },
                {
                    "sent": "I move means that in the GSP are the description is cutted.",
                    "label": 1
                },
                {
                    "sent": "The service could stay again there.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the technical schema.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We have again the client, the collaboration platform we have.",
                    "label": 0
                },
                {
                    "sent": "The subscription on the.",
                    "label": 0
                },
                {
                    "sent": "This is the ways mix environment, the base of the generic service platform.",
                    "label": 0
                },
                {
                    "sent": "And we have the registry here, so we.",
                    "label": 0
                },
                {
                    "sent": "Subscribe from the client.",
                    "label": 0
                },
                {
                    "sent": "To a goal in the generic service platform that is stored inside the repository of with mix.",
                    "label": 1
                },
                {
                    "sent": "So we send a goal and we store the goal there.",
                    "label": 0
                },
                {
                    "sent": "When something will happen here, so new service is registered.",
                    "label": 0
                },
                {
                    "sent": "The GSP will match these goals, if fine.",
                    "label": 1
                },
                {
                    "sent": "If he found that one of the services inserted match with this goal will send a notification to the collaboration platform.",
                    "label": 1
                },
                {
                    "sent": "Send a message means that we can receive the this information by email or by web service.",
                    "label": 0
                },
                {
                    "sent": "So case by case we can select what is the best way to be notified.",
                    "label": 1
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the notification broker.",
                    "label": 0
                },
                {
                    "sent": "That has been on you.",
                    "label": 0
                },
                {
                    "sent": "In development.",
                    "label": 0
                },
                {
                    "sent": "From coin inserted in the Wiz mix environment.",
                    "label": 0
                },
                {
                    "sent": "You can see the other.",
                    "label": 0
                },
                {
                    "sent": "Ways mix component.",
                    "label": 0
                },
                {
                    "sent": "Do the discovery communication management with collaborative platform choreography.",
                    "label": 0
                },
                {
                    "sent": "Rank and selection.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I don't go in so much technical details.",
                    "label": 0
                },
                {
                    "sent": "Then",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "New component, The notification broker squared.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Red Square.",
                    "label": 0
                },
                {
                    "sent": "Is responsible of several task.",
                    "label": 0
                },
                {
                    "sent": "So accept the subscription, store their subscription, manage the least of subscription that could be very huge.",
                    "label": 0
                },
                {
                    "sent": "And stored in the registry, we execute the discovery process.",
                    "label": 0
                },
                {
                    "sent": "So new subscription and service registration and for the first version of the coin platform presented in Year 2 review, we have just a notification of new services.",
                    "label": 0
                },
                {
                    "sent": "But for the next review we have also the discovery of removing of services.",
                    "label": 0
                },
                {
                    "sent": "Injecting some code on the Wiz mix environment.",
                    "label": 0
                },
                {
                    "sent": "And then I as I presented before notifying subscribers can.",
                    "label": 0
                },
                {
                    "sent": "Happened by email.",
                    "label": 0
                },
                {
                    "sent": "And by web service invocation.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, we created a new endpoint.",
                    "label": 0
                },
                {
                    "sent": "New web service that can be invoked by the collaborative platform or better than GSP client injecting the collaborative platform with.",
                    "label": 0
                },
                {
                    "sent": "This methods so retrieve the subscription, the ID subscription and subscribe subscribe all.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I skipped the technical details.",
                    "label": 0
                },
                {
                    "sent": "This is an example of the notification by email.",
                    "label": 0
                },
                {
                    "sent": "This is still technical level.",
                    "label": 0
                },
                {
                    "sent": "So we receive.",
                    "label": 0
                },
                {
                    "sent": "Than you.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "The new Service message service.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "School that has been inserted here.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I don't have a demo for that.",
                    "label": 0
                },
                {
                    "sent": "On videos.",
                    "label": 0
                },
                {
                    "sent": "There are no question I go to the execution.",
                    "label": 0
                },
                {
                    "sent": "The monitoring of the execution in the generic service platform.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is.",
                    "label": 0
                },
                {
                    "sent": "Another presentation of the ways mix environment and we have on the top the monitoring part.",
                    "label": 0
                },
                {
                    "sent": "Monitoring is very useful.",
                    "label": 0
                },
                {
                    "sent": "Because we need to know what's happening, what is happening here.",
                    "label": 0
                },
                {
                    "sent": "For Ashley and for charging bills.",
                    "label": 0
                },
                {
                    "sent": "To the user that use the services, so we have to monitor everything and based on these monitoring we also change the response time and functional properties like that.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Rotation of the service.",
                    "label": 0
                },
                {
                    "sent": "This is the ontology for the GSP monitoring.",
                    "label": 1
                },
                {
                    "sent": "I don't go in details we have in the center.",
                    "label": 0
                },
                {
                    "sent": "Of course the activity event.",
                    "label": 0
                },
                {
                    "sent": "Related to an activity.",
                    "label": 0
                },
                {
                    "sent": "And then we have a lot of concept.",
                    "label": 0
                },
                {
                    "sent": "Lincoln today.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So again, the monitoring manager is responsible.",
                    "label": 0
                },
                {
                    "sent": "This component is responsible for the following task, so extract data monitoring interest.",
                    "label": 0
                },
                {
                    "sent": "Which are the topics that we want to monitor?",
                    "label": 0
                },
                {
                    "sent": "Transforming data into appropriate format according to the ontology presented in the slide B4 bout, occurrences of observed data.",
                    "label": 0
                },
                {
                    "sent": "OK, I don't go in other details.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For that.",
                    "label": 0
                },
                {
                    "sent": "Just.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Skip this.",
                    "label": 0
                },
                {
                    "sent": "Just do information about what is behind the monitoring so.",
                    "label": 0
                },
                {
                    "sent": "You have the RDF.",
                    "label": 0
                },
                {
                    "sent": "As a base sparkle query.",
                    "label": 0
                },
                {
                    "sent": "To look on the RDF to see what happened.",
                    "label": 0
                },
                {
                    "sent": "If the service as well, if the service is always online is something goes down.",
                    "label": 0
                },
                {
                    "sent": "OK activities are we have crude on monitoring FDR.",
                    "label": 0
                },
                {
                    "sent": "RDF.",
                    "label": 0
                },
                {
                    "sent": "Create, read, update, delete.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK. And these are then.",
                    "label": 0
                },
                {
                    "sent": "The technical implementation at this time, so you are two.",
                    "label": 0
                },
                {
                    "sent": "So we update the average invocation time.",
                    "label": 0
                },
                {
                    "sent": "That is used as non functional property, so I want to look for a service.",
                    "label": 0
                },
                {
                    "sent": "And I really interested in the time.",
                    "label": 0
                },
                {
                    "sent": "The answer time from this service, if I have to send 100 of invoices per second.",
                    "label": 0
                },
                {
                    "sent": "And I want this service will answer with.",
                    "label": 0
                },
                {
                    "sent": "They transformed the transformation of the format.",
                    "label": 0
                },
                {
                    "sent": "I'm really interested to have a very fast service.",
                    "label": 0
                },
                {
                    "sent": "If I send just one invoice per month, I'm not so interested in this, so this is the basis for the non functional properties.",
                    "label": 0
                },
                {
                    "sent": "We have also the average invocation time per user.",
                    "label": 0
                },
                {
                    "sent": "And the notification of their reputation manager.",
                    "label": 0
                },
                {
                    "sent": "Also their reputation is involved on this service that is not online 5% of the time.",
                    "label": 0
                },
                {
                    "sent": "The reputation will be lower.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So till now I talked about Step 2.",
                    "label": 0
                },
                {
                    "sent": "So collaborative platform that ask is notified by the GSP on services.",
                    "label": 0
                },
                {
                    "sent": "And is the human that drives this process.",
                    "label": 0
                },
                {
                    "sent": "Working on the client graphical user interface for the GSP.",
                    "label": 0
                },
                {
                    "sent": "What we are doing in step three step.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tree.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I will start with an example.",
                    "label": 0
                },
                {
                    "sent": "We have some people we have a business process to create a meeting so we have to invite person to meeting, discuss, send, Agenda, reminder, meeting, run the meeting.",
                    "label": 1
                },
                {
                    "sent": "And at the end, send minutes at this stage, Step 2.",
                    "label": 0
                },
                {
                    "sent": "We have some of them that services and for the missing services that you may have to look for them.",
                    "label": 0
                },
                {
                    "sent": "Asking to the GSP.",
                    "label": 0
                },
                {
                    "sent": "And the human should be aware on the context.",
                    "label": 0
                },
                {
                    "sent": "That is, behind the selection of the service.",
                    "label": 0
                },
                {
                    "sent": "If I have to invite a meeting a person, I can use a lot of services.",
                    "label": 0
                },
                {
                    "sent": "I can send an email like in our example, but also I can open a Skype chat or.",
                    "label": 1
                },
                {
                    "sent": "Use other services or instant messaging, for example.",
                    "label": 0
                },
                {
                    "sent": "How to select the best service depends on the context.",
                    "label": 0
                },
                {
                    "sent": "So which project we are the role of the person is a boss is just the developer.",
                    "label": 0
                },
                {
                    "sent": "I'm also developer where is the person.",
                    "label": 1
                },
                {
                    "sent": "If he's in the office, I can send him an email or I can phone him.",
                    "label": 0
                },
                {
                    "sent": "If it's outside the office and I need to contact him, maybe I can send SMS message.",
                    "label": 1
                },
                {
                    "sent": "Our gender, if it's free, busy, or available if it's available, I can use the phone.",
                    "label": 0
                },
                {
                    "sent": "If it's in a meeting, I probably send an email.",
                    "label": 0
                },
                {
                    "sent": "It depends.",
                    "label": 0
                },
                {
                    "sent": "If he's alone or with somebody or the.",
                    "label": 0
                },
                {
                    "sent": "If it's idle or.",
                    "label": 0
                },
                {
                    "sent": "We have priority on this job that we are doing or which devices as it.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Starting from the context behind for the same activity.",
                    "label": 0
                },
                {
                    "sent": "There are several services that can be used in this context to contact, for example, a person or for sending an email.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's see this example in relation of our steps.",
                    "label": 0
                },
                {
                    "sent": "That you are doing in coin.",
                    "label": 0
                },
                {
                    "sent": "So I want to contact 1 one person.",
                    "label": 0
                },
                {
                    "sent": "Step 0 is I know him.",
                    "label": 0
                },
                {
                    "sent": "I have the phone, I call him.",
                    "label": 0
                },
                {
                    "sent": "Step one is to use a collaboration platform to do this.",
                    "label": 0
                },
                {
                    "sent": "I have in my company the five right tell it up on the browser.",
                    "label": 0
                },
                {
                    "sent": "I will see a page and I can look for the people and see the number of telephone and call 220 and I will call my colleague.",
                    "label": 0
                },
                {
                    "sent": "This is step one for the same company.",
                    "label": 0
                },
                {
                    "sent": "For a cluster it depends.",
                    "label": 0
                },
                {
                    "sent": "So step one is.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Status of the art.",
                    "label": 0
                },
                {
                    "sent": "Step 2 I already presented is use the GSP client module to find a service through the GSP, inject the service inside the business process and the reasoning is up to the human.",
                    "label": 0
                },
                {
                    "sent": "I before selected an email to inform a person why.",
                    "label": 0
                },
                {
                    "sent": "Because of my knowledge.",
                    "label": 0
                },
                {
                    "sent": "I know that he has an email.",
                    "label": 0
                },
                {
                    "sent": "I don't know if he has Skype for example or something other.",
                    "label": 0
                },
                {
                    "sent": "I know the context as businessman and I reason and I select I search for an email service.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In Step 3.",
                    "label": 0
                },
                {
                    "sent": "That they started.",
                    "label": 0
                },
                {
                    "sent": "Is ongoing on coin.",
                    "label": 0
                },
                {
                    "sent": "We want to transfer the reasoning from the human to the system.",
                    "label": 0
                },
                {
                    "sent": "So is not the human that I have to take.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Share of the reasoning of the search.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For services this is an overview of what we are doing right now.",
                    "label": 0
                },
                {
                    "sent": "So the human.",
                    "label": 0
                },
                {
                    "sent": "Is again on the business process.",
                    "label": 0
                },
                {
                    "sent": "You need one service to contact a person.",
                    "label": 0
                },
                {
                    "sent": "And ask.",
                    "label": 0
                },
                {
                    "sent": "In the GSP client I want to communicate with Sergio and send this message.",
                    "label": 0
                },
                {
                    "sent": "See you on Monday.",
                    "label": 0
                },
                {
                    "sent": "I'm not looking for an email service.",
                    "label": 0
                },
                {
                    "sent": "I want to send a message.",
                    "label": 0
                },
                {
                    "sent": "Just that, and this is the message.",
                    "label": 0
                },
                {
                    "sent": "I don't want to reason to see if it is in the office, or if as an email or where is.",
                    "label": 0
                },
                {
                    "sent": "What is the Skype address?",
                    "label": 0
                },
                {
                    "sent": "He says no.",
                    "label": 0
                },
                {
                    "sent": "I don't want to take care of this is the system that I have to take care of that?",
                    "label": 0
                },
                {
                    "sent": "So the knowledge is in the cluster, so we have a knowledge base here, starting from the knowledge base, we create a set of rules that will be used by an expert system.",
                    "label": 0
                },
                {
                    "sent": "Probably will use just as expert system.",
                    "label": 0
                },
                {
                    "sent": "And on top of that, there will be the functionalities of the GSP client graphical user interface I presented before.",
                    "label": 0
                },
                {
                    "sent": "But is not the human that we lost us here inserting pre and post condition for search for any an email service just say see you on Monday.",
                    "label": 0
                },
                {
                    "sent": "I want to communicate with surgeon.",
                    "label": 0
                },
                {
                    "sent": "Based on that rules.",
                    "label": 0
                },
                {
                    "sent": "The GSP client start starting from the rules and.",
                    "label": 0
                },
                {
                    "sent": "The humor request the expert system.",
                    "label": 0
                },
                {
                    "sent": "We select the right concept of the EC or EI ontology.",
                    "label": 0
                },
                {
                    "sent": "To find the right service.",
                    "label": 0
                },
                {
                    "sent": "In this case, the example is.",
                    "label": 0
                },
                {
                    "sent": "Synchronous are a synchronous service for communication or invasive or discrete.",
                    "label": 0
                },
                {
                    "sent": "We are we can have if.",
                    "label": 0
                },
                {
                    "sent": "X is a Newman and.",
                    "label": 0
                },
                {
                    "sent": "Again, that is busy.",
                    "label": 0
                },
                {
                    "sent": "And has email then use email.",
                    "label": 0
                },
                {
                    "sent": "But also if is not if it is available and as a Skype address, use Skype because it's faster.",
                    "label": 0
                },
                {
                    "sent": "So we have a big set of rules inside here.",
                    "label": 0
                },
                {
                    "sent": "And by inferential algorithm.",
                    "label": 0
                },
                {
                    "sent": "We will select the best words best concept to be sent here.",
                    "label": 0
                },
                {
                    "sent": "So we will ask for a synchronous.",
                    "label": 0
                },
                {
                    "sent": "For example, if the person is available like an example is available is not.",
                    "label": 0
                },
                {
                    "sent": "It has any communication way.",
                    "label": 0
                },
                {
                    "sent": "I will ask for a synchronous service like Skype, Skype call.",
                    "label": 0
                },
                {
                    "sent": "Is busy in the agenda.",
                    "label": 0
                },
                {
                    "sent": "The expert system will select and a synchronous way.",
                    "label": 0
                },
                {
                    "sent": "Like an email.",
                    "label": 0
                },
                {
                    "sent": "Tordon bore him because there is only meeting.",
                    "label": 0
                },
                {
                    "sent": "So here we just select the right concept of the ontology starting from the rules and your request.",
                    "label": 0
                },
                {
                    "sent": "The GSP will work as worked before, so starting from pre and post condition we will find the right service behind.",
                    "label": 0
                },
                {
                    "sent": "And we'll answer done it with the service here and then.",
                    "label": 0
                },
                {
                    "sent": "This will be sent to the business process.",
                    "label": 0
                },
                {
                    "sent": "And we will receive.",
                    "label": 0
                },
                {
                    "sent": "Skype service in the example before I sent an email.",
                    "label": 0
                },
                {
                    "sent": "But maybe it's in this case it's better to use Skype.",
                    "label": 0
                },
                {
                    "sent": "Skype call.",
                    "label": 0
                },
                {
                    "sent": "Be cause of India again that person is free.",
                    "label": 0
                },
                {
                    "sent": "It has a Skype address.",
                    "label": 0
                },
                {
                    "sent": "There's an email address, but I want to.",
                    "label": 0
                },
                {
                    "sent": "The faster way is to communicate by Skype in this case, so the reasoning is not up to the human that has to select the service, but is up to the system.",
                    "label": 0
                },
                {
                    "sent": "That have to select the right service.",
                    "label": 0
                },
                {
                    "sent": "For that, and this will be.",
                    "label": 0
                },
                {
                    "sent": "Will try to apply it.",
                    "label": 0
                },
                {
                    "sent": "Today's meeting process.",
                    "label": 0
                },
                {
                    "sent": "The simplest case is to invite the person of the meeting.",
                    "label": 0
                },
                {
                    "sent": "So send a message.",
                    "label": 0
                },
                {
                    "sent": "This is for.",
                    "label": 0
                },
                {
                    "sent": "The next move of coin.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "I just gave you.",
                    "label": 0
                },
                {
                    "sent": "A short introduction of Step 3 for enterprise collaboration.",
                    "label": 0
                },
                {
                    "sent": "For enterprise interoperability, we are working on that and we want to use services from business process interoperability.",
                    "label": 0
                },
                {
                    "sent": "I explained you yesterday that are able to understand the gaps among processes from coming from different companies.",
                    "label": 0
                },
                {
                    "sent": "For example, are able to understand if there is a format mismatches among two companies.",
                    "label": 0
                },
                {
                    "sent": "Now if we have two different processes and we have a format one as output from once one step and format five as input for the other is the human that have to recognize this insert another step and ask to the GSP for a formal transformation service from format one to format 5.",
                    "label": 0
                },
                {
                    "sent": "We want to make it automatically.",
                    "label": 0
                },
                {
                    "sent": "So is the system that automatically we recognize the mismatch and we'll ask for the GSP for the right concept of the ontology.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I have to say thanks to Webcare team, because half of the slides come from them.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I finished earlier my presentation.",
                    "label": 0
                },
                {
                    "sent": "Sorry if you have any questions.",
                    "label": 0
                },
                {
                    "sent": "If I may, the last question that you posed last.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Slides back please.",
                    "label": 0
                },
                {
                    "sent": "Beef.",
                    "label": 0
                },
                {
                    "sent": "Mentioned that the services that you have looked into, enterprise collaboration there very similar to Skype, and you're also includes a Skype based services.",
                    "label": 1
                },
                {
                    "sent": "And yeah we have also that one as baseline we use.",
                    "label": 0
                },
                {
                    "sent": "Are in we have the work package for the human interaction.",
                    "label": 0
                },
                {
                    "sent": "We have some baselines, we call baselines coming from other projects or from the real world task.",
                    "label": 0
                },
                {
                    "sent": "Of course, Skype, email, instant messaging, Facebook, Twitter, our communication services.",
                    "label": 0
                },
                {
                    "sent": "Then on top of them we have other innovative services able to log what is happening and to retrieve.",
                    "label": 0
                },
                {
                    "sent": "The collaboration attitude of the human, the trust among humans.",
                    "label": 0
                },
                {
                    "sent": "And for example, to services to share documents based on trust based on my relationship, I work a lot with you.",
                    "label": 0
                },
                {
                    "sent": "I assist you very well so you can access to my document.",
                    "label": 0
                },
                {
                    "sent": "I never work with the other person and she can maybe download just the abstract of my documents.",
                    "label": 0
                },
                {
                    "sent": "So we have this kind of baseline services and some innovative services on the top.",
                    "label": 0
                },
                {
                    "sent": "For this example, we use the baseline service because it's easier.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "As well as you.",
                    "label": 0
                },
                {
                    "sent": "Other sources like MSN or.",
                    "label": 0
                },
                {
                    "sent": "We have also done messaging.",
                    "label": 0
                },
                {
                    "sent": "Messaging service from coin.",
                    "label": 0
                },
                {
                    "sent": "But messaging service is also included in Skype as well.",
                    "label": 0
                },
                {
                    "sent": "Or is it something different?",
                    "label": 0
                },
                {
                    "sent": "The Skype chat is exactly the MSN chat, but OK are two different services, but maybe an user have Skype but doesn't have an MSN or protocols like this one messaging service.",
                    "label": 0
                },
                {
                    "sent": "Anything that they're using it just combines them together.",
                    "label": 0
                },
                {
                    "sent": "Yeah, we have not created another Skype.",
                    "label": 0
                },
                {
                    "sent": "We use Skype.",
                    "label": 0
                },
                {
                    "sent": "Yeah, door invented the wheel.",
                    "label": 0
                },
                {
                    "sent": "If the wheel works.",
                    "label": 0
                },
                {
                    "sent": "No, we selected.",
                    "label": 0
                },
                {
                    "sent": "Easy to understand services to this because the advance the research is not in service is in the way we discover it.",
                    "label": 0
                },
                {
                    "sent": "An in the way we transfer the reasoning from the human to the system.",
                    "label": 0
                },
                {
                    "sent": "So the concept was very good, though.",
                    "label": 0
                },
                {
                    "sent": "The thing is that.",
                    "label": 0
                },
                {
                    "sent": "Are you envisaging within the product?",
                    "label": 0
                },
                {
                    "sent": "So as you said, it is about two years we are in the product and four years long I think yeah, so now we are approaching on February the third year review.",
                    "label": 0
                },
                {
                    "sent": "So what does the final outcome?",
                    "label": 0
                },
                {
                    "sent": "Are you expecting that these services will be fully integrated into?",
                    "label": 0
                },
                {
                    "sent": "Industry or they will be used?",
                    "label": 0
                },
                {
                    "sent": "Or is it?",
                    "label": 0
                },
                {
                    "sent": "What is the final aim as service?",
                    "label": 0
                },
                {
                    "sent": "Do you mean this service or devaul coin platform?",
                    "label": 1
                },
                {
                    "sent": "You are providing this is a question for Sergio Gusmeroli.",
                    "label": 0
                },
                {
                    "sent": "Your opinion, the ones which are on the side, maybe the services 123 or the one which is specific that you are dealing with you will be using it within your Institute or will it be provided to others as well?",
                    "label": 0
                },
                {
                    "sent": "That's also a question for searching.",
                    "label": 0
                },
                {
                    "sent": "Yes, yes the I haven't the slides.",
                    "label": 0
                },
                {
                    "sent": "Maybe?",
                    "label": 0
                },
                {
                    "sent": "No, I don't know the answer.",
                    "label": 0
                },
                {
                    "sent": "As.",
                    "label": 0
                },
                {
                    "sent": "I'm taking care of makes the system working.",
                    "label": 0
                },
                {
                    "sent": "But I don't want to say something that is wrong.",
                    "label": 0
                },
                {
                    "sent": "Again.",
                    "label": 0
                },
                {
                    "sent": "Presentation you adopted this WSMX&WSMO structure.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry the modeling language in the execution element.",
                    "label": 0
                },
                {
                    "sent": "What is that exactly?",
                    "label": 0
                },
                {
                    "sent": "It came from one of the partners from Wanda of the partners from WBK is part of STI International that is partner of Coin and STI is the main provider service provider of the GSP that is based on with me with smokes and asks the we take care more on the previous part of the product.",
                    "label": 0
                },
                {
                    "sent": "So the collaborative platform is selected as a technology.",
                    "label": 0
                },
                {
                    "sent": "Because one of the partners were strong there again because was stronger and was one of the most recognized platform in this field in the scientific world.",
                    "label": 0
                },
                {
                    "sent": "So it was not blind selection.",
                    "label": 0
                },
                {
                    "sent": "So we select the partner also because of its platform for semantic they already have with mics that work with ontological description registration of the service and we are putting things over that.",
                    "label": 0
                },
                {
                    "sent": "Don't reinvent the wheel again, but just put new functionalities new new way.",
                    "label": 0
                },
                {
                    "sent": "To search services to adopt it.",
                    "label": 0
                },
                {
                    "sent": "And is the development of of those standards?",
                    "label": 0
                },
                {
                    "sent": "Are those being supported?",
                    "label": 0
                },
                {
                    "sent": "Are they still alive?",
                    "label": 0
                },
                {
                    "sent": "Everything working in with mix still alive?",
                    "label": 0
                },
                {
                    "sent": "We just put something more.",
                    "label": 0
                },
                {
                    "sent": "We're not cutting.",
                    "label": 0
                }
            ]
        }
    }
}