{
    "id": "ihjlac2tl2jop55pbnjsibmtfywx4gjj",
    "title": "Spatio-temporal clustering methods",
    "info": {
        "author": [
            "Matej Senožetnik, Artificial Intelligence Laboratory, Jožef Stefan Institute"
        ],
        "published": "Nov. 15, 2016",
        "recorded": "October 2016",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Artificial Intelligence"
        ]
    },
    "url": "http://videolectures.net/sikdd2016_senozetnik_clustering_methods/",
    "segmentation": [
        [
            "Hello I'm a tape and they did this work with Luca blush 219.",
            "I would like to present our paper titled Special Temporal Clustering Methods."
        ],
        [
            "The tracking confirm coordinate to identify people behavior is becoming increasingly popular.",
            "There are certain application which analyze user, path and and or behavior.",
            "Other can measure traffic congestion and we can use such application.",
            "The tracker people, if we want to make a search system, we need to make an application which can track coordinates from GPS.",
            "The raw data doesn't provide any useful information for the user and it is.",
            "Moreover, it is full of noise to preprocess data and calculate the state point by the definition state point is a point where a person stays for certain amount of time."
        ],
        [
            "This blue points are raw data and this green and red points are state points.",
            "Process to find a state points is called the clustering.",
            "So the aim of this work was to find the best methods for clustering this state points.",
            "When the state points are calculated, we can process the data further to calculate the most frequently visited location, which is the fund animation building block.",
            "For further advanced analysis such as next place prediction."
        ],
        [
            "Firstly, I will talk about the type of the clustering methods.",
            "Then I will try to answer the question which type of the methods are the most appropriate for classic special temporal data generated by mobile phone.",
            "Finally, I will compare the most common algorithms and find the most appropriate solution which meets our needs."
        ],
        [
            "Clustering methods are in general separated into four free following categories.",
            "Partitioning methods, classified data into car groups.",
            "Here are chical methods.",
            "Hierarchically decompose, given data set.",
            "Density based methods are based on cluster density.",
            "Where class or stop growing when neighborhood density stop stop succeeding a given threshold.",
            "The most appropriate methods for classic special temporal data density based methods as they regard clusters dense region of objects in data space that are separated by regions of low density."
        ],
        [
            "This table shows some of the most common density based algorithms used for the detection of state points for successful detection of state points.",
            "It is important that the cluster algorithms uses temporal information and lock site bear special data as indicated in the table.",
            "Most of the algorithm use of it except of the scan quality of the algorithms is also depends on noise sensitivity.",
            "The less sensitivity the algorithm has, the better it is.",
            "Some algorithm return only clusters such as DB scan, STD scan and optics.",
            "Other can return a state point or path.",
            "Now let's look to taken advantages and disadvantages for this algorithm."
        ],
        [
            "James DB Scan is density based clustering algorithm which identifies arbitrary shaped object and the text lines in a data set.",
            "Its advantages are that it robustly detects outliers, does not need many parameters, it is appropriate for a large database basis and data input order doesn't interfere with result.",
            "Drawback are dated only version of spatial elements and doesn't work with different densities.",
            "As a consequence of these two drawbacks, we can't use DB."
        ],
        [
            "Scan for our purposes.",
            "This picture is input of we can use for this data we can use for input of DB scan and this we can use for output of DB scan and it successfully cluster six different.",
            "It successfully cluster six different.",
            "Clusters second example is shown when the DB scan doesn't work well.",
            "It's actually in Chouteau drawbacks of this algorithm is then when the data are eyes and it's very sensitive to para meters."
        ],
        [
            "STD Scan is another algorithms that is based on the DB scan it's making use of the scan.",
            "Ability to discover cluster with various shape while improving some of the weak points of the original algorithms.",
            "It's taking into account and temporal data, identifies noisy object.",
            "If there are various densities of the input data, more accurately differentiate adjacent clusters."
        ],
        [
            "Optics is an algorithm which is used for finding density based clustering clusters in special temporal data toting works in a similar way is DB scan optics improve on the DB scam?",
            "Biggest weakness, the failure to the tag clustered when the date of arise.",
            "In figure we can observe that optics algorithm generate an easily visualization.",
            "Ordering of points which can be used for extract cluster."
        ],
        [
            "This way to how to understand how this works is by explaining this example.",
            "There are free potential stop candidate here, C1 or C2 and RC frame and for every region is defined time duration from figure.",
            "We can observe that there is .0 which is not inside of any geometry.",
            "So there is for this candidate for move data set the next few points are inside of.",
            "These candidates, so they are treated tests.",
            "Candidates stop."
        ],
        [
            "CB smooth algorithm season alternative.",
            "So the algorithm smooth and address one of its main drawback being capability of to detect the state points that are not predefined by user.",
            "It uses clustering methods to automatically detect state point.",
            "The idea behind this method is that when we are moved from.",
            "Around the point of interest, we move slower than we moving from one place to another.",
            "The authors report that the algorithm discard class incorrect stop compared to the smooth."
        ],
        [
            "Um?",
            "And then I will let me stay.",
            "Point detection works.",
            "It works in a very basic way.",
            "It's based on the time and distance threshold.",
            "If distances under certain value and time is above a certain value, we treat this point as state point.",
            "If they exceed these values, which are the best path?",
            "The main advantage of SPD is that it does not need predefined structures.",
            "It is also computed.",
            "Computer and it is not computationally demanding.",
            "But it is sensitive to the noise.",
            "This can be partially reduced by adjusting the parameters."
        ],
        [
            "The goal of this discussion is to find find an algorithm which is capable of clustering users throw historical data.",
            "The data are tracked by a mobile phone.",
            "Are referring back to the table.",
            "We want an algorithm which with the following properties is able to cluster special temporal data is noise insensitive and return state points and paths."
        ],
        [
            "Quick question, yeah so.",
            "This might sound like a silly question, but there's a reason why I'm asking why.",
            "Why is it that you chose?",
            "We decided as a group that clustering a clustering approach was the best method to go with this problem.",
            "Now it seems like the literature assumes that clustering is the way to do it, but it's not at all obvious to me that that would be the only choice in this situation.",
            "For example, what about treating your entire history as a set of samples and then learning some sequence model from from these samples, like path based models?",
            "This is not a clustering approach, but it basically treats clusters as more important points for learning and therefore would give you a similar latent clustering, but it wouldn't be a clustering approach in here, so that I guess what are the advantages of treating it as a spatiotemporal clustering problem as opposed to something else?",
            "And it might be a long discussion, so feel free to just tell me to shut up for the week and talk about this another time.",
            "Now I haven't I can.",
            "I mean, this also has the nature of its unsupervised.",
            "What you're proposing, right?",
            "It's just the not really.",
            "I mean, you're treating it as a supervised problem.",
            "You're saying that there is some important that comes out of having overlap where you can learn more.",
            "There's more information and things that appear more frequently.",
            "OK, yeah, so, but you, this is still like a big signal there, which.",
            "So.",
            "I'm just saying.",
            "So basically had predicted I don't see why the clustering is the first choice of a way to look at it, but maybe I'm missing some.",
            "Let's listen for this.",
            "Certainly it has nothing to do with the quality of this work.",
            "I'm just yeah, abstract tickets would include a little bit more context, right?",
            "So this is what you what would be the main additional value, right?",
            "I kinda smooth algorithm uses predefined regions which can be a problem if we want the text some of state points outside of these zones.",
            "CBS Motor request predefined ratio for state point and pads, but for real time it is impossible to provide algorithms SPD and smooth or both sensitive to the noise but have the advantage that returning.",
            "A point given our requirements, we propose.",
            "SPD is the most suitable for clustering special temporal data collecting from mobile."
        ],
        [
            "Home.",
            "To the best of our knowledge, up-to-date SPD SPD algorithm is considered as the best solution for detecting of state points, but first from 4 state points and paths.",
            "The problem can be elevated by running multiple iterations.",
            "Also algorithm to improve the accuracy of of detection state points can use different types of data, Wi-Fi activity recognition and so on.",
            "And also there is a large place to improve this algorithm, but this is out of scope of this paper, so thank you very."
        ],
        [
            "Much for your time and attention in difficult question, you can ask me."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello I'm a tape and they did this work with Luca blush 219.",
                    "label": 0
                },
                {
                    "sent": "I would like to present our paper titled Special Temporal Clustering Methods.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The tracking confirm coordinate to identify people behavior is becoming increasingly popular.",
                    "label": 0
                },
                {
                    "sent": "There are certain application which analyze user, path and and or behavior.",
                    "label": 0
                },
                {
                    "sent": "Other can measure traffic congestion and we can use such application.",
                    "label": 0
                },
                {
                    "sent": "The tracker people, if we want to make a search system, we need to make an application which can track coordinates from GPS.",
                    "label": 1
                },
                {
                    "sent": "The raw data doesn't provide any useful information for the user and it is.",
                    "label": 1
                },
                {
                    "sent": "Moreover, it is full of noise to preprocess data and calculate the state point by the definition state point is a point where a person stays for certain amount of time.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This blue points are raw data and this green and red points are state points.",
                    "label": 0
                },
                {
                    "sent": "Process to find a state points is called the clustering.",
                    "label": 0
                },
                {
                    "sent": "So the aim of this work was to find the best methods for clustering this state points.",
                    "label": 0
                },
                {
                    "sent": "When the state points are calculated, we can process the data further to calculate the most frequently visited location, which is the fund animation building block.",
                    "label": 0
                },
                {
                    "sent": "For further advanced analysis such as next place prediction.",
                    "label": 1
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Firstly, I will talk about the type of the clustering methods.",
                    "label": 0
                },
                {
                    "sent": "Then I will try to answer the question which type of the methods are the most appropriate for classic special temporal data generated by mobile phone.",
                    "label": 1
                },
                {
                    "sent": "Finally, I will compare the most common algorithms and find the most appropriate solution which meets our needs.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Clustering methods are in general separated into four free following categories.",
                    "label": 1
                },
                {
                    "sent": "Partitioning methods, classified data into car groups.",
                    "label": 0
                },
                {
                    "sent": "Here are chical methods.",
                    "label": 0
                },
                {
                    "sent": "Hierarchically decompose, given data set.",
                    "label": 0
                },
                {
                    "sent": "Density based methods are based on cluster density.",
                    "label": 0
                },
                {
                    "sent": "Where class or stop growing when neighborhood density stop stop succeeding a given threshold.",
                    "label": 0
                },
                {
                    "sent": "The most appropriate methods for classic special temporal data density based methods as they regard clusters dense region of objects in data space that are separated by regions of low density.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This table shows some of the most common density based algorithms used for the detection of state points for successful detection of state points.",
                    "label": 0
                },
                {
                    "sent": "It is important that the cluster algorithms uses temporal information and lock site bear special data as indicated in the table.",
                    "label": 0
                },
                {
                    "sent": "Most of the algorithm use of it except of the scan quality of the algorithms is also depends on noise sensitivity.",
                    "label": 0
                },
                {
                    "sent": "The less sensitivity the algorithm has, the better it is.",
                    "label": 0
                },
                {
                    "sent": "Some algorithm return only clusters such as DB scan, STD scan and optics.",
                    "label": 0
                },
                {
                    "sent": "Other can return a state point or path.",
                    "label": 0
                },
                {
                    "sent": "Now let's look to taken advantages and disadvantages for this algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "James DB Scan is density based clustering algorithm which identifies arbitrary shaped object and the text lines in a data set.",
                    "label": 1
                },
                {
                    "sent": "Its advantages are that it robustly detects outliers, does not need many parameters, it is appropriate for a large database basis and data input order doesn't interfere with result.",
                    "label": 1
                },
                {
                    "sent": "Drawback are dated only version of spatial elements and doesn't work with different densities.",
                    "label": 0
                },
                {
                    "sent": "As a consequence of these two drawbacks, we can't use DB.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Scan for our purposes.",
                    "label": 0
                },
                {
                    "sent": "This picture is input of we can use for this data we can use for input of DB scan and this we can use for output of DB scan and it successfully cluster six different.",
                    "label": 0
                },
                {
                    "sent": "It successfully cluster six different.",
                    "label": 0
                },
                {
                    "sent": "Clusters second example is shown when the DB scan doesn't work well.",
                    "label": 0
                },
                {
                    "sent": "It's actually in Chouteau drawbacks of this algorithm is then when the data are eyes and it's very sensitive to para meters.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "STD Scan is another algorithms that is based on the DB scan it's making use of the scan.",
                    "label": 0
                },
                {
                    "sent": "Ability to discover cluster with various shape while improving some of the weak points of the original algorithms.",
                    "label": 0
                },
                {
                    "sent": "It's taking into account and temporal data, identifies noisy object.",
                    "label": 1
                },
                {
                    "sent": "If there are various densities of the input data, more accurately differentiate adjacent clusters.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Optics is an algorithm which is used for finding density based clustering clusters in special temporal data toting works in a similar way is DB scan optics improve on the DB scam?",
                    "label": 0
                },
                {
                    "sent": "Biggest weakness, the failure to the tag clustered when the date of arise.",
                    "label": 1
                },
                {
                    "sent": "In figure we can observe that optics algorithm generate an easily visualization.",
                    "label": 0
                },
                {
                    "sent": "Ordering of points which can be used for extract cluster.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This way to how to understand how this works is by explaining this example.",
                    "label": 0
                },
                {
                    "sent": "There are free potential stop candidate here, C1 or C2 and RC frame and for every region is defined time duration from figure.",
                    "label": 0
                },
                {
                    "sent": "We can observe that there is .0 which is not inside of any geometry.",
                    "label": 0
                },
                {
                    "sent": "So there is for this candidate for move data set the next few points are inside of.",
                    "label": 0
                },
                {
                    "sent": "These candidates, so they are treated tests.",
                    "label": 0
                },
                {
                    "sent": "Candidates stop.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "CB smooth algorithm season alternative.",
                    "label": 0
                },
                {
                    "sent": "So the algorithm smooth and address one of its main drawback being capability of to detect the state points that are not predefined by user.",
                    "label": 1
                },
                {
                    "sent": "It uses clustering methods to automatically detect state point.",
                    "label": 1
                },
                {
                    "sent": "The idea behind this method is that when we are moved from.",
                    "label": 0
                },
                {
                    "sent": "Around the point of interest, we move slower than we moving from one place to another.",
                    "label": 1
                },
                {
                    "sent": "The authors report that the algorithm discard class incorrect stop compared to the smooth.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And then I will let me stay.",
                    "label": 0
                },
                {
                    "sent": "Point detection works.",
                    "label": 0
                },
                {
                    "sent": "It works in a very basic way.",
                    "label": 0
                },
                {
                    "sent": "It's based on the time and distance threshold.",
                    "label": 1
                },
                {
                    "sent": "If distances under certain value and time is above a certain value, we treat this point as state point.",
                    "label": 0
                },
                {
                    "sent": "If they exceed these values, which are the best path?",
                    "label": 0
                },
                {
                    "sent": "The main advantage of SPD is that it does not need predefined structures.",
                    "label": 0
                },
                {
                    "sent": "It is also computed.",
                    "label": 0
                },
                {
                    "sent": "Computer and it is not computationally demanding.",
                    "label": 0
                },
                {
                    "sent": "But it is sensitive to the noise.",
                    "label": 0
                },
                {
                    "sent": "This can be partially reduced by adjusting the parameters.",
                    "label": 1
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The goal of this discussion is to find find an algorithm which is capable of clustering users throw historical data.",
                    "label": 0
                },
                {
                    "sent": "The data are tracked by a mobile phone.",
                    "label": 0
                },
                {
                    "sent": "Are referring back to the table.",
                    "label": 0
                },
                {
                    "sent": "We want an algorithm which with the following properties is able to cluster special temporal data is noise insensitive and return state points and paths.",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Quick question, yeah so.",
                    "label": 0
                },
                {
                    "sent": "This might sound like a silly question, but there's a reason why I'm asking why.",
                    "label": 0
                },
                {
                    "sent": "Why is it that you chose?",
                    "label": 0
                },
                {
                    "sent": "We decided as a group that clustering a clustering approach was the best method to go with this problem.",
                    "label": 0
                },
                {
                    "sent": "Now it seems like the literature assumes that clustering is the way to do it, but it's not at all obvious to me that that would be the only choice in this situation.",
                    "label": 0
                },
                {
                    "sent": "For example, what about treating your entire history as a set of samples and then learning some sequence model from from these samples, like path based models?",
                    "label": 0
                },
                {
                    "sent": "This is not a clustering approach, but it basically treats clusters as more important points for learning and therefore would give you a similar latent clustering, but it wouldn't be a clustering approach in here, so that I guess what are the advantages of treating it as a spatiotemporal clustering problem as opposed to something else?",
                    "label": 0
                },
                {
                    "sent": "And it might be a long discussion, so feel free to just tell me to shut up for the week and talk about this another time.",
                    "label": 0
                },
                {
                    "sent": "Now I haven't I can.",
                    "label": 0
                },
                {
                    "sent": "I mean, this also has the nature of its unsupervised.",
                    "label": 0
                },
                {
                    "sent": "What you're proposing, right?",
                    "label": 0
                },
                {
                    "sent": "It's just the not really.",
                    "label": 0
                },
                {
                    "sent": "I mean, you're treating it as a supervised problem.",
                    "label": 0
                },
                {
                    "sent": "You're saying that there is some important that comes out of having overlap where you can learn more.",
                    "label": 0
                },
                {
                    "sent": "There's more information and things that appear more frequently.",
                    "label": 0
                },
                {
                    "sent": "OK, yeah, so, but you, this is still like a big signal there, which.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I'm just saying.",
                    "label": 0
                },
                {
                    "sent": "So basically had predicted I don't see why the clustering is the first choice of a way to look at it, but maybe I'm missing some.",
                    "label": 0
                },
                {
                    "sent": "Let's listen for this.",
                    "label": 0
                },
                {
                    "sent": "Certainly it has nothing to do with the quality of this work.",
                    "label": 0
                },
                {
                    "sent": "I'm just yeah, abstract tickets would include a little bit more context, right?",
                    "label": 0
                },
                {
                    "sent": "So this is what you what would be the main additional value, right?",
                    "label": 0
                },
                {
                    "sent": "I kinda smooth algorithm uses predefined regions which can be a problem if we want the text some of state points outside of these zones.",
                    "label": 1
                },
                {
                    "sent": "CBS Motor request predefined ratio for state point and pads, but for real time it is impossible to provide algorithms SPD and smooth or both sensitive to the noise but have the advantage that returning.",
                    "label": 0
                },
                {
                    "sent": "A point given our requirements, we propose.",
                    "label": 0
                },
                {
                    "sent": "SPD is the most suitable for clustering special temporal data collecting from mobile.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Home.",
                    "label": 0
                },
                {
                    "sent": "To the best of our knowledge, up-to-date SPD SPD algorithm is considered as the best solution for detecting of state points, but first from 4 state points and paths.",
                    "label": 0
                },
                {
                    "sent": "The problem can be elevated by running multiple iterations.",
                    "label": 1
                },
                {
                    "sent": "Also algorithm to improve the accuracy of of detection state points can use different types of data, Wi-Fi activity recognition and so on.",
                    "label": 0
                },
                {
                    "sent": "And also there is a large place to improve this algorithm, but this is out of scope of this paper, so thank you very.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Much for your time and attention in difficult question, you can ask me.",
                    "label": 0
                }
            ]
        }
    }
}