{
    "id": "infwauuqcpinpquf5lda6vjmug3q72ve",
    "title": "Mars Express Power Challenge",
    "info": {
        "author": [
            "Jurica Levatić, Department of Knowledge Technologies, Jožef Stefan Institute"
        ],
        "published": "Jan. 31, 2017",
        "recorded": "September 2016",
        "category": [
            "Top->Computer Science",
            "Top->Data Science"
        ]
    },
    "url": "http://videolectures.net/miningdata2016_levatic_power_challenge/",
    "segmentation": [
        [
            "I thought you started in May and you collected until 31st of August and it's got much to express public challenge and demonic must expresses this satellite which is orbiting around the markets were filled here now and I have a short video to illustrate what this guys going up there.",
            "I hope it will work.",
            "OK yeah, this is the same price as all sorts of equipment.",
            "But using devices, whatever their computers.",
            "Oh and he this template is about my height so 118 this why say that?",
            "OK.",
            "This is how it looks like.",
            "There's some solid training from Denison anybody, and it was actually the first expedition of your European agency to the other planet, so he's actually building a map of Mars, so it's taking images in building 3D model formats.",
            "And.",
            "Example.",
            "For example, this this image is believed to provide evidence that there was water marks because of those.",
            "Game is not OK.",
            "Sorry."
        ],
        [
            "Videos always mess up the presentation.",
            "OK, so this satellite satellite is living in very harsh space conditions.",
            "As you may know, the temperature in space is minus 270 degrees approximately, but the equipment of this sentence has to be at some temperature so electronics has to be at the room temperature and imaging sensors at about about minus 70 degrees.",
            "So we have to keep this satellite warm.",
            "So not not like this, it's a very sophisticated place, so this settles.",
            "Has he text which fit, and obviously those he takes consume a lot of power, which which this satellite is receiving from the Sun.",
            "So produce power is part which which he gets from the sun, and then we have thermal power which he needs to spend to himself.",
            "And then what is left can be used for.",
            "Science and the problem is ECA had a physical model of this satellite, but during the 12 years this model is not relevant.",
            "More so they actually cannot predict well how much power they have left for science in this problem.",
            "And once they cannot generate anymore the powerful science, they would crash.",
            "This type provided to the market sectors.",
            "In this it will be the end of its life.",
            "So they organized this challenge to hopefully.",
            "Extend its life for a few extra years.",
            "And the problem is."
        ],
        [
            "So they gave the data for free match index and they want to have prediction of power consumption for pick 253 power lines for the quality.",
            "And in machine learning language this is multitarget progression problem because we have 30 through 33 targets variables which are inactive.",
            "And."
        ],
        [
            "Data trading is all sorts of data, so we have some end angles to design some detailed mission operation plans which are.",
            "Which tell when something is subsistence woroner off.",
            "Then we have flight dynamics.",
            "We have some distances to sun to earth, whatever, and then information when the centralized satellite is in Umbra or Penumbra.",
            "An OK. As I said, we have three target variables, so this is the measured electric current at about every 30 or 60 seconds.",
            "So I'm just."
        ],
        [
            "A few examples of the data looks like this.",
            "Let's put angles for select language.",
            "We have Unix timestamp and then four different angles of the angle of its solar panels to the sun and then angles of each size with the sun.",
            "And next."
        ],
        [
            "We have will detail, mission Operation Price which is Unix time timestamp followed by some.",
            "The call of some subsystem which was turned on.",
            "At this point we don't have any discreteness of those goals, just like this.",
            "And then we have."
        ],
        [
            "Some other events, so again thanks.",
            "Thanks and then some 34 detected this feature.",
            "So obviously this data is not usable for machine learning algorithms as they are, so we had to transform them and build some."
        ],
        [
            "Usable.",
            "And so I think, as you saw, every entry they gave have has a timestamp, so we have to build the so we have to build with some time frame around this and we have to decide for the time resolution.",
            "And OK, so for future construction we use the solar radiation treatments, also radiation, solar radiation the best and and also be transformed.",
            "Those five dynamics and commands into features in the show."
        ],
        [
            "So.",
            "About this later, so regarding the data frame.",
            "As I said, target tracking those were measured at 30 or 60 seconds intervals.",
            "So we decided to have a one minute time resolution and maybe I didn't mention before.",
            "The goal is to predict hourly average, so power consumption per hour for each of the 33 power lines.",
            "Yeah, the data has a lot of gaps.",
            "So we can move the large gaps which which are larger like 5 or 10 minutes.",
            "And we interpolated all the numerical data and integrated them two to get one minute.",
            "Values for money regulated and obviously we have.",
            "This resulted in really huge data set.",
            "We have data for the free market index which is 1.",
            "Much nearest is almost 700 days and then you calculate this in in two minutes you get and throw away the gaps we have.",
            "You know you get something around two 2.6 millions of examples.",
            "So the data is massive and it's really appropriate for this summer school because they were talking about massive data inserted data OK."
        ],
        [
            "So.",
            "Features about solar radiation were really important because the directory tell you how much power you get an we calculated the cosine of the solar angle switch, which tells you how much the how much solar energy you get on the sides of the satellite image panels.",
            "And then we go.",
            "Hey and then we multiply it by the solar constant and by the same code for proficient about whether the settlement is being under our framework.",
            "And then we integrate this to get one minute."
        ],
        [
            "But obviously OK, you get features in certain thanks then, but for sure, solar energy in some past also affects this.",
            "So.",
            "Fireproof 5 consumption of thermal point.",
            "Once at this point.",
            "So we also calculated the leg features so.",
            "Language some features, so we sum the those.",
            "A feature we obtained from the solar panels from 4 minutes to 128 minutes in the past to get those historical features.",
            "OK and then."
        ],
        [
            "We have those features about subsequent commands and flight dynamics, and for this we made features which then your time since when the last command was turned on, so.",
            "This was kind of to also take into account this historical aspect of the features.",
            "OK. What is?"
        ],
        [
            "So then finally, this is was as I said on one minute time resolution we have around 500 features, 2.6 million other examples in 10.4 gigabytes of data.",
            "We just quite tricky to handle and program algorithms on this.",
            "And actually we generated the two newer versions of the data set.",
            "We didn't manage to use until the deadline, mutual times bigger than this.",
            "That isn't because of which we used."
        ],
        [
            "So OK, so machine learning part.",
            "We used all sorts of things and obviously, since we're familiar definition 2 three, you sprinted faster in pace, which can predict the third or continuous target variables, and we use the random forests of lasting peace, but we also consider single target moving target predictions.",
            "And then we got two clusters, target variables together.",
            "Similar similar targets together and then build multi target models for those in single target from the others tuned random voice parameters.",
            "Then we also consider the taking all the data into account so all three X or only third year or first and second or second intern.",
            "And we also, as I mentioned, we had few different bases.",
            "We performance and feature ranking and also we need an symbol of examples.",
            "So we have.",
            "We had several rounds of random forest with different parameters, different bases and we also tried to aggregate all this program and we also tried briefly with grading rules in place.",
            "But we do manage to submit this until the deadline, OK?"
        ],
        [
            "And the winning solution was false.",
            "So we built the cabin for disability, passing trees with 200 trees in an example, and we had to go with quite conservative minimum number of examples in each leaf because we had a lot of data.",
            "So we set this to 500.",
            "And it was quite ready for me.",
            "This feature, this magnetic number features which are considered at each node.",
            "So the size of the random subset of feature usually default magnet is square root or some logarithm.",
            "But this really didn't work well, so we had to increase this to 1/4 of all features to get with results.",
            "And this probably tells us that a lot of features which we generated are actually back.",
            "We have to increase the pool to always take some good features into account.",
            "Yeah, and and what was most surprising when you switch from multi target.",
            "Complete the single type predictions.",
            "This get us from sequence to 1st place, so if you're talking about structuring the prediction here, but in this case the single target.",
            "But this came with the costs because training time for one for one target was about 15 hours and multi target model build.",
            "Look in 15 hours for all the targets, but when we switch to single target it just times 33.",
            "So you can imagine how much time is this.",
            "And OK and for each job.",
            "For each arm you need about 100 gigabits to found.",
            "And Luckily we have good infrastructure in.",
            "But we have a lot of plastics, alot of CPUs with a lot of ramp so we will be able to do this.",
            "Shut up.",
            "Asked when you say 100 gigabytes, it was distributed because John request was distributed across computers, right?",
            "You didn't have one computer with one hour ago?",
            "We have also one computer with this amount of RAM, but we allowed you to stop for a month.",
            "Yeah, but but but actually it was not possible to do this more complex, so we have one last check in our group with 101 thousand CPUs.",
            "Then we have another report, comic 1500 CPUs at the Institute and then we have third one with 4500 at the national level and used all.",
            "Like it?",
            "Yeah, lucky we have new connections with system admin administrators, so they allowed us to do this and they actually from this national Plastic Day is 1/3 of it just for us in final two days of competition when it was emergency because one of our plastics at least crashed, so we had to do something.",
            "We should make sure we transfer some of the good publicity to that.",
            "And all of the three system audiences were on vacation at the time, but they're really responsive, and so kudos to them."
        ],
        [
            "OK, yeah, in one of the competition need they are exclusively used.",
            "One time one hour time resolution slow.",
            "We believe one minute gave us an edge OK but also a lot of troubles because we had huge data.",
            "And they use.",
            "The remaining boost increases or all sorts of neural networks, and then they combined this bill.",
            "Dominion sample of different approaches.",
            "And this worked well for them.",
            "And they also didn't build a multi target models.",
            "In a sense there talking about them.",
            "We need the something like this so you have some features and you have direct variables and then they try to make this into one basis so you have additional feature which tells you.",
            "About fish target flag, it will be filled with about and then you merge all this together into one big step.",
            "And this is also good single target.",
            "Yeah it's single target, but you you you have additional some additional feature which tells you about the about the target and this also helped them, but obviously not enough.",
            "OK."
        ],
        [
            "And the leader code was like this.",
            "In MA E. 8.",
            "Ask me about.",
            "Umm, but eight is the number of Files Department is last month.",
            "Mission to Mars Monday mission to Mars or something like that.",
            "Few meetings for a few months and then we started working.",
            "Oh OK, so we will for the last few days of the competition we were first on the living book."
        ],
        [
            "But then this happened.",
            "So then I was.",
            "A great person first of all.",
            "Will I be back in first minutes before your deadline?",
            "One guy Oil took us under a second place and we were on Skype like you know, looking what's happening and then we had some bad words.",
            "But Luckily"
        ],
        [
            "When they next day when they evaluated on the on the whole train set, we jumped back on the 1st place and we won the competition maybe?"
        ],
        [
            "Back a bit, so three submissions per day were allowed.",
            "As you can see, this guy had 65 with the submissions and we had 20.",
            "Since, like the submissions, and we assume that you already fitted on the small part of the test set where they made emulation, yeah, so we actually restarted the working this completion quite quite late and maybe at the end of this help us."
        ],
        [
            "OK, and yeah, special thanks to our system and it at least 8% jsi, and the national level and."
        ],
        [
            "This is the fee, so all of us are the film this summer school, so if you want to ask some questions about this, you can find us.",
            "And of course you can ask me now sufficiency, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I thought you started in May and you collected until 31st of August and it's got much to express public challenge and demonic must expresses this satellite which is orbiting around the markets were filled here now and I have a short video to illustrate what this guys going up there.",
                    "label": 0
                },
                {
                    "sent": "I hope it will work.",
                    "label": 0
                },
                {
                    "sent": "OK yeah, this is the same price as all sorts of equipment.",
                    "label": 0
                },
                {
                    "sent": "But using devices, whatever their computers.",
                    "label": 0
                },
                {
                    "sent": "Oh and he this template is about my height so 118 this why say that?",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "This is how it looks like.",
                    "label": 0
                },
                {
                    "sent": "There's some solid training from Denison anybody, and it was actually the first expedition of your European agency to the other planet, so he's actually building a map of Mars, so it's taking images in building 3D model formats.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Example.",
                    "label": 0
                },
                {
                    "sent": "For example, this this image is believed to provide evidence that there was water marks because of those.",
                    "label": 0
                },
                {
                    "sent": "Game is not OK.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Videos always mess up the presentation.",
                    "label": 0
                },
                {
                    "sent": "OK, so this satellite satellite is living in very harsh space conditions.",
                    "label": 0
                },
                {
                    "sent": "As you may know, the temperature in space is minus 270 degrees approximately, but the equipment of this sentence has to be at some temperature so electronics has to be at the room temperature and imaging sensors at about about minus 70 degrees.",
                    "label": 1
                },
                {
                    "sent": "So we have to keep this satellite warm.",
                    "label": 0
                },
                {
                    "sent": "So not not like this, it's a very sophisticated place, so this settles.",
                    "label": 0
                },
                {
                    "sent": "Has he text which fit, and obviously those he takes consume a lot of power, which which this satellite is receiving from the Sun.",
                    "label": 1
                },
                {
                    "sent": "So produce power is part which which he gets from the sun, and then we have thermal power which he needs to spend to himself.",
                    "label": 0
                },
                {
                    "sent": "And then what is left can be used for.",
                    "label": 0
                },
                {
                    "sent": "Science and the problem is ECA had a physical model of this satellite, but during the 12 years this model is not relevant.",
                    "label": 0
                },
                {
                    "sent": "More so they actually cannot predict well how much power they have left for science in this problem.",
                    "label": 0
                },
                {
                    "sent": "And once they cannot generate anymore the powerful science, they would crash.",
                    "label": 0
                },
                {
                    "sent": "This type provided to the market sectors.",
                    "label": 0
                },
                {
                    "sent": "In this it will be the end of its life.",
                    "label": 0
                },
                {
                    "sent": "So they organized this challenge to hopefully.",
                    "label": 0
                },
                {
                    "sent": "Extend its life for a few extra years.",
                    "label": 0
                },
                {
                    "sent": "And the problem is.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So they gave the data for free match index and they want to have prediction of power consumption for pick 253 power lines for the quality.",
                    "label": 1
                },
                {
                    "sent": "And in machine learning language this is multitarget progression problem because we have 30 through 33 targets variables which are inactive.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Data trading is all sorts of data, so we have some end angles to design some detailed mission operation plans which are.",
                    "label": 1
                },
                {
                    "sent": "Which tell when something is subsistence woroner off.",
                    "label": 0
                },
                {
                    "sent": "Then we have flight dynamics.",
                    "label": 1
                },
                {
                    "sent": "We have some distances to sun to earth, whatever, and then information when the centralized satellite is in Umbra or Penumbra.",
                    "label": 0
                },
                {
                    "sent": "An OK. As I said, we have three target variables, so this is the measured electric current at about every 30 or 60 seconds.",
                    "label": 1
                },
                {
                    "sent": "So I'm just.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A few examples of the data looks like this.",
                    "label": 0
                },
                {
                    "sent": "Let's put angles for select language.",
                    "label": 0
                },
                {
                    "sent": "We have Unix timestamp and then four different angles of the angle of its solar panels to the sun and then angles of each size with the sun.",
                    "label": 1
                },
                {
                    "sent": "And next.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have will detail, mission Operation Price which is Unix time timestamp followed by some.",
                    "label": 0
                },
                {
                    "sent": "The call of some subsystem which was turned on.",
                    "label": 0
                },
                {
                    "sent": "At this point we don't have any discreteness of those goals, just like this.",
                    "label": 0
                },
                {
                    "sent": "And then we have.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some other events, so again thanks.",
                    "label": 1
                },
                {
                    "sent": "Thanks and then some 34 detected this feature.",
                    "label": 0
                },
                {
                    "sent": "So obviously this data is not usable for machine learning algorithms as they are, so we had to transform them and build some.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Usable.",
                    "label": 0
                },
                {
                    "sent": "And so I think, as you saw, every entry they gave have has a timestamp, so we have to build the so we have to build with some time frame around this and we have to decide for the time resolution.",
                    "label": 0
                },
                {
                    "sent": "And OK, so for future construction we use the solar radiation treatments, also radiation, solar radiation the best and and also be transformed.",
                    "label": 1
                },
                {
                    "sent": "Those five dynamics and commands into features in the show.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "About this later, so regarding the data frame.",
                    "label": 0
                },
                {
                    "sent": "As I said, target tracking those were measured at 30 or 60 seconds intervals.",
                    "label": 0
                },
                {
                    "sent": "So we decided to have a one minute time resolution and maybe I didn't mention before.",
                    "label": 0
                },
                {
                    "sent": "The goal is to predict hourly average, so power consumption per hour for each of the 33 power lines.",
                    "label": 0
                },
                {
                    "sent": "Yeah, the data has a lot of gaps.",
                    "label": 1
                },
                {
                    "sent": "So we can move the large gaps which which are larger like 5 or 10 minutes.",
                    "label": 0
                },
                {
                    "sent": "And we interpolated all the numerical data and integrated them two to get one minute.",
                    "label": 1
                },
                {
                    "sent": "Values for money regulated and obviously we have.",
                    "label": 0
                },
                {
                    "sent": "This resulted in really huge data set.",
                    "label": 0
                },
                {
                    "sent": "We have data for the free market index which is 1.",
                    "label": 0
                },
                {
                    "sent": "Much nearest is almost 700 days and then you calculate this in in two minutes you get and throw away the gaps we have.",
                    "label": 0
                },
                {
                    "sent": "You know you get something around two 2.6 millions of examples.",
                    "label": 0
                },
                {
                    "sent": "So the data is massive and it's really appropriate for this summer school because they were talking about massive data inserted data OK.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Features about solar radiation were really important because the directory tell you how much power you get an we calculated the cosine of the solar angle switch, which tells you how much the how much solar energy you get on the sides of the satellite image panels.",
                    "label": 1
                },
                {
                    "sent": "And then we go.",
                    "label": 0
                },
                {
                    "sent": "Hey and then we multiply it by the solar constant and by the same code for proficient about whether the settlement is being under our framework.",
                    "label": 0
                },
                {
                    "sent": "And then we integrate this to get one minute.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But obviously OK, you get features in certain thanks then, but for sure, solar energy in some past also affects this.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Fireproof 5 consumption of thermal point.",
                    "label": 0
                },
                {
                    "sent": "Once at this point.",
                    "label": 0
                },
                {
                    "sent": "So we also calculated the leg features so.",
                    "label": 0
                },
                {
                    "sent": "Language some features, so we sum the those.",
                    "label": 0
                },
                {
                    "sent": "A feature we obtained from the solar panels from 4 minutes to 128 minutes in the past to get those historical features.",
                    "label": 1
                },
                {
                    "sent": "OK and then.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have those features about subsequent commands and flight dynamics, and for this we made features which then your time since when the last command was turned on, so.",
                    "label": 0
                },
                {
                    "sent": "This was kind of to also take into account this historical aspect of the features.",
                    "label": 0
                },
                {
                    "sent": "OK. What is?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So then finally, this is was as I said on one minute time resolution we have around 500 features, 2.6 million other examples in 10.4 gigabytes of data.",
                    "label": 0
                },
                {
                    "sent": "We just quite tricky to handle and program algorithms on this.",
                    "label": 0
                },
                {
                    "sent": "And actually we generated the two newer versions of the data set.",
                    "label": 1
                },
                {
                    "sent": "We didn't manage to use until the deadline, mutual times bigger than this.",
                    "label": 0
                },
                {
                    "sent": "That isn't because of which we used.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So OK, so machine learning part.",
                    "label": 1
                },
                {
                    "sent": "We used all sorts of things and obviously, since we're familiar definition 2 three, you sprinted faster in pace, which can predict the third or continuous target variables, and we use the random forests of lasting peace, but we also consider single target moving target predictions.",
                    "label": 1
                },
                {
                    "sent": "And then we got two clusters, target variables together.",
                    "label": 0
                },
                {
                    "sent": "Similar similar targets together and then build multi target models for those in single target from the others tuned random voice parameters.",
                    "label": 1
                },
                {
                    "sent": "Then we also consider the taking all the data into account so all three X or only third year or first and second or second intern.",
                    "label": 0
                },
                {
                    "sent": "And we also, as I mentioned, we had few different bases.",
                    "label": 0
                },
                {
                    "sent": "We performance and feature ranking and also we need an symbol of examples.",
                    "label": 0
                },
                {
                    "sent": "So we have.",
                    "label": 0
                },
                {
                    "sent": "We had several rounds of random forest with different parameters, different bases and we also tried to aggregate all this program and we also tried briefly with grading rules in place.",
                    "label": 0
                },
                {
                    "sent": "But we do manage to submit this until the deadline, OK?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the winning solution was false.",
                    "label": 0
                },
                {
                    "sent": "So we built the cabin for disability, passing trees with 200 trees in an example, and we had to go with quite conservative minimum number of examples in each leaf because we had a lot of data.",
                    "label": 1
                },
                {
                    "sent": "So we set this to 500.",
                    "label": 0
                },
                {
                    "sent": "And it was quite ready for me.",
                    "label": 0
                },
                {
                    "sent": "This feature, this magnetic number features which are considered at each node.",
                    "label": 0
                },
                {
                    "sent": "So the size of the random subset of feature usually default magnet is square root or some logarithm.",
                    "label": 1
                },
                {
                    "sent": "But this really didn't work well, so we had to increase this to 1/4 of all features to get with results.",
                    "label": 0
                },
                {
                    "sent": "And this probably tells us that a lot of features which we generated are actually back.",
                    "label": 0
                },
                {
                    "sent": "We have to increase the pool to always take some good features into account.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and and what was most surprising when you switch from multi target.",
                    "label": 1
                },
                {
                    "sent": "Complete the single type predictions.",
                    "label": 0
                },
                {
                    "sent": "This get us from sequence to 1st place, so if you're talking about structuring the prediction here, but in this case the single target.",
                    "label": 0
                },
                {
                    "sent": "But this came with the costs because training time for one for one target was about 15 hours and multi target model build.",
                    "label": 0
                },
                {
                    "sent": "Look in 15 hours for all the targets, but when we switch to single target it just times 33.",
                    "label": 0
                },
                {
                    "sent": "So you can imagine how much time is this.",
                    "label": 0
                },
                {
                    "sent": "And OK and for each job.",
                    "label": 0
                },
                {
                    "sent": "For each arm you need about 100 gigabits to found.",
                    "label": 0
                },
                {
                    "sent": "And Luckily we have good infrastructure in.",
                    "label": 0
                },
                {
                    "sent": "But we have a lot of plastics, alot of CPUs with a lot of ramp so we will be able to do this.",
                    "label": 0
                },
                {
                    "sent": "Shut up.",
                    "label": 0
                },
                {
                    "sent": "Asked when you say 100 gigabytes, it was distributed because John request was distributed across computers, right?",
                    "label": 0
                },
                {
                    "sent": "You didn't have one computer with one hour ago?",
                    "label": 0
                },
                {
                    "sent": "We have also one computer with this amount of RAM, but we allowed you to stop for a month.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but but but actually it was not possible to do this more complex, so we have one last check in our group with 101 thousand CPUs.",
                    "label": 0
                },
                {
                    "sent": "Then we have another report, comic 1500 CPUs at the Institute and then we have third one with 4500 at the national level and used all.",
                    "label": 0
                },
                {
                    "sent": "Like it?",
                    "label": 0
                },
                {
                    "sent": "Yeah, lucky we have new connections with system admin administrators, so they allowed us to do this and they actually from this national Plastic Day is 1/3 of it just for us in final two days of competition when it was emergency because one of our plastics at least crashed, so we had to do something.",
                    "label": 0
                },
                {
                    "sent": "We should make sure we transfer some of the good publicity to that.",
                    "label": 0
                },
                {
                    "sent": "And all of the three system audiences were on vacation at the time, but they're really responsive, and so kudos to them.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, yeah, in one of the competition need they are exclusively used.",
                    "label": 0
                },
                {
                    "sent": "One time one hour time resolution slow.",
                    "label": 1
                },
                {
                    "sent": "We believe one minute gave us an edge OK but also a lot of troubles because we had huge data.",
                    "label": 0
                },
                {
                    "sent": "And they use.",
                    "label": 0
                },
                {
                    "sent": "The remaining boost increases or all sorts of neural networks, and then they combined this bill.",
                    "label": 0
                },
                {
                    "sent": "Dominion sample of different approaches.",
                    "label": 0
                },
                {
                    "sent": "And this worked well for them.",
                    "label": 1
                },
                {
                    "sent": "And they also didn't build a multi target models.",
                    "label": 0
                },
                {
                    "sent": "In a sense there talking about them.",
                    "label": 0
                },
                {
                    "sent": "We need the something like this so you have some features and you have direct variables and then they try to make this into one basis so you have additional feature which tells you.",
                    "label": 0
                },
                {
                    "sent": "About fish target flag, it will be filled with about and then you merge all this together into one big step.",
                    "label": 0
                },
                {
                    "sent": "And this is also good single target.",
                    "label": 0
                },
                {
                    "sent": "Yeah it's single target, but you you you have additional some additional feature which tells you about the about the target and this also helped them, but obviously not enough.",
                    "label": 1
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the leader code was like this.",
                    "label": 0
                },
                {
                    "sent": "In MA E. 8.",
                    "label": 0
                },
                {
                    "sent": "Ask me about.",
                    "label": 0
                },
                {
                    "sent": "Umm, but eight is the number of Files Department is last month.",
                    "label": 0
                },
                {
                    "sent": "Mission to Mars Monday mission to Mars or something like that.",
                    "label": 0
                },
                {
                    "sent": "Few meetings for a few months and then we started working.",
                    "label": 0
                },
                {
                    "sent": "Oh OK, so we will for the last few days of the competition we were first on the living book.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But then this happened.",
                    "label": 0
                },
                {
                    "sent": "So then I was.",
                    "label": 0
                },
                {
                    "sent": "A great person first of all.",
                    "label": 0
                },
                {
                    "sent": "Will I be back in first minutes before your deadline?",
                    "label": 0
                },
                {
                    "sent": "One guy Oil took us under a second place and we were on Skype like you know, looking what's happening and then we had some bad words.",
                    "label": 0
                },
                {
                    "sent": "But Luckily",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When they next day when they evaluated on the on the whole train set, we jumped back on the 1st place and we won the competition maybe?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Back a bit, so three submissions per day were allowed.",
                    "label": 0
                },
                {
                    "sent": "As you can see, this guy had 65 with the submissions and we had 20.",
                    "label": 0
                },
                {
                    "sent": "Since, like the submissions, and we assume that you already fitted on the small part of the test set where they made emulation, yeah, so we actually restarted the working this completion quite quite late and maybe at the end of this help us.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, and yeah, special thanks to our system and it at least 8% jsi, and the national level and.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the fee, so all of us are the film this summer school, so if you want to ask some questions about this, you can find us.",
                    "label": 0
                },
                {
                    "sent": "And of course you can ask me now sufficiency, thank you.",
                    "label": 0
                }
            ]
        }
    }
}