{
    "id": "inutqbi6rxlew3qkzbvylbgm7xd3fy75",
    "title": "The META-NET Language White Paper Series: Overview and Key Results",
    "info": {
        "author": [
            "Bolette Sandford Pedersen, Centre for Language Technology, University of Copenhagen"
        ],
        "recorded by": [
            "German Research Center for Artificial Intelligence (DFKI)"
        ],
        "published": "Aug. 9, 2012",
        "recorded": "June 2012",
        "category": [
            "Top->Computer Science->Natural Language Processing",
            "Top->Computer Science->Text Mining",
            "Top->Science->Scientific Research"
        ]
    },
    "url": "http://videolectures.net/metaforum2012_sandford_pedersen_language/",
    "segmentation": [
        [
            "So I will give you a brief status of the.",
            "Of the language white papers and of the key results that they were trying to achieve with this serious.",
            "Um?",
            "Well, with this seriously, we basically wanted to develop an every strong instrument to address.",
            "Decision makers and journalists in."
        ],
        [
            "In the EU countries and inform them about the situation in the particular countries.",
            "So we wanted to actually combine expert judgments of the actual situations in their respective countries with more political statements that could wait in a wave function as as a wake up call to decision makers in Europe.",
            "So actually we are now coming to an end.",
            "They are ready now for download, most of them and will come out in the paper version there soon to be distributed in all the countries.",
            "The report covers sort of both status of the language situation as as a whole in the country and the level of support through language technology so.",
            "First of all, is report contains a common chapter called Languages at Risk.",
            "A challenge for language technology.",
            "Where were language Psygnosis presented to the public?",
            "In general terms and a lot of examples of applications are given which should be well known to most people and then further.",
            "The shoes are followed by language specific chapters, which partly give a status of the of the languages as a home in the country and look into also.",
            "Um political research programs in language technology.",
            "The educational situations of language technology in the particular countries.",
            "And finally, there's an expert chapter in the report which sort of give into more detailed description of the level of technological expertise and tools and resources in that particular country.",
            "And finally.",
            "We decided also to do some cross lingual evaluation so that you can not only see some of the internal status of your own language, but also compare with the with the other languages in in Europe and we believe that this would be also politically relevant.",
            "Should be able to see where, where, where's my own language sort of position."
        ],
        [
            "In the in the larger picture.",
            "Um?",
            "So these are the languages that are covered and more than 30 of them are now available on the web."
        ],
        [
            "They are all bilingual, so they have a.",
            "A section of the report is written both in the particular language and in English.",
            "As you can see on this front page of the Slovak."
        ],
        [
            "So all the reports are initiated by the.",
            "Particular language of that country and and then followed by the English translation."
        ],
        [
            "Few numbers, well, this is really being a huge effort.",
            "Around 116 national experts have contributed as authors or coauthors.",
            "That's around 5 experts.",
            "Purple language in most of us have sort of combine both research experts and industrial experts in that panel of authors for the reports.",
            "And in addition, more than 50 experts have contributed with data and information in particular for the first chapter, the general chapter of the report.",
            "And we are now copying more than 8000 versions of these reports that should be printed and distributed by Internet.",
            "As."
        ],
        [
            "Say a little more about this.",
            "The cross lingual ranking.",
            "We believe that journalists and politicians needed simple and clear messages and therefore we divided the material into sort of four application areas each language.",
            "Will then be assigned or was then assigned to one or five of these five clusters, ranging from excellent language technology support to weak or no support, and the formal occasion areas where machine translation, speech processing, text analysis and resources.",
            "But I should say that in the report we go into more detail with these respective areas and looking at more particular and specific resources, for instance.",
            "It was very hard to agree on the common consensus that we had a lot of discussions actually at the mall is 2 day, two days meeting in Berlin where we?",
            "Finalize the positioning of the languages and here are the results."
        ],
        [
            "For machine translation, we saw that the vast majority of the countries were actually or the languages were actually placed in the in the cluster, weak or no support.",
            "Where as you can see there for speech processing, this situation was a little better is a little better.",
            "We have a larger group in the fragmentary cluster and also important to say is that even English was not is not considered to have full or excellent language technology.",
            "Report it as you can.",
            "As you can see it's placed as the only language in the good column.",
            "If we look at text analysis and resources, we also."
        ],
        [
            "Find that the huge group of languages is placed in the fragmentary cluster and also we find home languages which can actually can be called excellent in their language.",
            "Technology support."
        ],
        [
            "So this was actually just looking around numbers altogether.",
            "And here you can see a final clustering of the different languages English as the first one, even if it is not excellent.",
            "And again most of the languages are clustered in there.",
            "The second voice group actually, so there's still a lot of work to do."
        ],
        [
            "Key results that we can sum up well when it comes to language technology support.",
            "There seems to be massive differences between the Europeans, languages and technology areas.",
            "It's also very clear that language technology support for English is ahead of any other language, but far from being perfect and 4:30 N. 3030 languages.",
            "Language technology support is only fragmentary, very weak or nonexistent.",
            "So definitely there's a need to act for a lot of the languages which are part of this series.",
            "Um?",
            "So we with these reports we we both have a list of.",
            "Love challenges described, but also we look a lot on the opportunities that that are given for the languages if they if they move more radically into this area but.",
            "So we have a list of gaps where we can start working from.",
            "And they will have to be addressed in the years to come."
        ],
        [
            "So today we will launch a new version of the language.",
            "My papers at this website and around I think, last night it was 31 of the 3021 of the 30 language papers that are now available in the final version and the first batch of printed copies will be available very soon and will be distributed in the beginning of July.",
            "Also, we've met quite a lot of interest in printing other volumes.",
            "Of the white papers, for instance, there will be a white paper on European Sign languages in the digital age.",
            "And also included other languages that would like to work to make a similar effort for their language.",
            "So have a look at the papers and I hope you will enjoy them and we all hope they will get the impact that they deserve.",
            "There's been a great effort to actually introduce this form for the languages.",
            "Thank you."
        ],
        [
            "The questions for the language white papers.",
            "I would like to know the criteria that determine if a language has an excellent support, which obviously not even English achieved and what would be.",
            "For example example, support that is missing.",
            "Sorry I did you ask about the German situation over the question, what was what was the criterion to give it to call a language has excellent support.",
            "I mean even if English English don't has it.",
            "I mean so yeah.",
            "Is it that I'm missing?",
            "So I mean, there's so.",
            "So these were these were expert guesses.",
            "That's so we have some definitions in the paper.",
            "You can look them up so there are some indications what is excellent support.",
            "I mean, and I think most people in this room have a very good feeling that even English is not excellently supported by by language technology.",
            "So maybe we can.",
            "Look it up in the paper, then offline.",
            "What's up?",
            "Information in the tables yesterday.",
            "Dallas, TX from you and I'm European language policy network and secretary for the Parliament in Screw on languages.",
            "National nurses think it works.",
            "Fantastic's really welcomed.",
            "I just wonder if you have any plans to extend it to all the other regional minority languages because information like this would be really helpful.",
            "We just recently did a report for the Commission on the NGO Platform for Multilingualism and part of those recommendations.",
            "Just to have an interesting Observatory and this kind of work would be really useful to upload and suspend Sissy.",
            "Will the gaps on in the provision of language technology that's my understanding is that every minority language that we want to make a white paper are more than welcome.",
            "Sign Language is a good example, so it's just to get started.",
            "Actually, it's all the best.",
            "We invite everybody who feels, I mean that it could build up such authoring team.",
            "So please welcome contact us.",
            "And of course there should be more volumes is thank you.",
            "Hi, my name is Ian Schofield with a product called JP.",
            "It seems to me that there is a large concentration on the written word.",
            "Can you tell me to what extent you are looking at the spoken word?",
            "Because we use speech technology in our products.",
            "As far as I'm I know there are very few companies in Europe creating voices.",
            "The majority of voices come from the America and scenario that we really could improve on.",
            "It's all in there, of course.",
            "I mean, we looked at it speech at the written language and semantics were committed.",
            "The whole area of language technologies is in there and it's discussed for four languages, so you can.",
            "We can find the information in the paper definitely, and I think we should then now and over to the tow_Now again to the chair.",
            "The panel discussion now.",
            "Thank you very much.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I will give you a brief status of the.",
                    "label": 0
                },
                {
                    "sent": "Of the language white papers and of the key results that they were trying to achieve with this serious.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Well, with this seriously, we basically wanted to develop an every strong instrument to address.",
                    "label": 0
                },
                {
                    "sent": "Decision makers and journalists in.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the EU countries and inform them about the situation in the particular countries.",
                    "label": 0
                },
                {
                    "sent": "So we wanted to actually combine expert judgments of the actual situations in their respective countries with more political statements that could wait in a wave function as as a wake up call to decision makers in Europe.",
                    "label": 0
                },
                {
                    "sent": "So actually we are now coming to an end.",
                    "label": 0
                },
                {
                    "sent": "They are ready now for download, most of them and will come out in the paper version there soon to be distributed in all the countries.",
                    "label": 0
                },
                {
                    "sent": "The report covers sort of both status of the language situation as as a whole in the country and the level of support through language technology so.",
                    "label": 1
                },
                {
                    "sent": "First of all, is report contains a common chapter called Languages at Risk.",
                    "label": 0
                },
                {
                    "sent": "A challenge for language technology.",
                    "label": 0
                },
                {
                    "sent": "Where were language Psygnosis presented to the public?",
                    "label": 0
                },
                {
                    "sent": "In general terms and a lot of examples of applications are given which should be well known to most people and then further.",
                    "label": 0
                },
                {
                    "sent": "The shoes are followed by language specific chapters, which partly give a status of the of the languages as a home in the country and look into also.",
                    "label": 0
                },
                {
                    "sent": "Um political research programs in language technology.",
                    "label": 0
                },
                {
                    "sent": "The educational situations of language technology in the particular countries.",
                    "label": 0
                },
                {
                    "sent": "And finally, there's an expert chapter in the report which sort of give into more detailed description of the level of technological expertise and tools and resources in that particular country.",
                    "label": 0
                },
                {
                    "sent": "And finally.",
                    "label": 0
                },
                {
                    "sent": "We decided also to do some cross lingual evaluation so that you can not only see some of the internal status of your own language, but also compare with the with the other languages in in Europe and we believe that this would be also politically relevant.",
                    "label": 0
                },
                {
                    "sent": "Should be able to see where, where, where's my own language sort of position.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the in the larger picture.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So these are the languages that are covered and more than 30 of them are now available on the web.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They are all bilingual, so they have a.",
                    "label": 0
                },
                {
                    "sent": "A section of the report is written both in the particular language and in English.",
                    "label": 0
                },
                {
                    "sent": "As you can see on this front page of the Slovak.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So all the reports are initiated by the.",
                    "label": 0
                },
                {
                    "sent": "Particular language of that country and and then followed by the English translation.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Few numbers, well, this is really being a huge effort.",
                    "label": 0
                },
                {
                    "sent": "Around 116 national experts have contributed as authors or coauthors.",
                    "label": 1
                },
                {
                    "sent": "That's around 5 experts.",
                    "label": 0
                },
                {
                    "sent": "Purple language in most of us have sort of combine both research experts and industrial experts in that panel of authors for the reports.",
                    "label": 0
                },
                {
                    "sent": "And in addition, more than 50 experts have contributed with data and information in particular for the first chapter, the general chapter of the report.",
                    "label": 1
                },
                {
                    "sent": "And we are now copying more than 8000 versions of these reports that should be printed and distributed by Internet.",
                    "label": 0
                },
                {
                    "sent": "As.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Say a little more about this.",
                    "label": 0
                },
                {
                    "sent": "The cross lingual ranking.",
                    "label": 0
                },
                {
                    "sent": "We believe that journalists and politicians needed simple and clear messages and therefore we divided the material into sort of four application areas each language.",
                    "label": 1
                },
                {
                    "sent": "Will then be assigned or was then assigned to one or five of these five clusters, ranging from excellent language technology support to weak or no support, and the formal occasion areas where machine translation, speech processing, text analysis and resources.",
                    "label": 0
                },
                {
                    "sent": "But I should say that in the report we go into more detail with these respective areas and looking at more particular and specific resources, for instance.",
                    "label": 0
                },
                {
                    "sent": "It was very hard to agree on the common consensus that we had a lot of discussions actually at the mall is 2 day, two days meeting in Berlin where we?",
                    "label": 0
                },
                {
                    "sent": "Finalize the positioning of the languages and here are the results.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For machine translation, we saw that the vast majority of the countries were actually or the languages were actually placed in the in the cluster, weak or no support.",
                    "label": 1
                },
                {
                    "sent": "Where as you can see there for speech processing, this situation was a little better is a little better.",
                    "label": 0
                },
                {
                    "sent": "We have a larger group in the fragmentary cluster and also important to say is that even English was not is not considered to have full or excellent language technology.",
                    "label": 0
                },
                {
                    "sent": "Report it as you can.",
                    "label": 0
                },
                {
                    "sent": "As you can see it's placed as the only language in the good column.",
                    "label": 0
                },
                {
                    "sent": "If we look at text analysis and resources, we also.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Find that the huge group of languages is placed in the fragmentary cluster and also we find home languages which can actually can be called excellent in their language.",
                    "label": 0
                },
                {
                    "sent": "Technology support.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this was actually just looking around numbers altogether.",
                    "label": 0
                },
                {
                    "sent": "And here you can see a final clustering of the different languages English as the first one, even if it is not excellent.",
                    "label": 0
                },
                {
                    "sent": "And again most of the languages are clustered in there.",
                    "label": 0
                },
                {
                    "sent": "The second voice group actually, so there's still a lot of work to do.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Key results that we can sum up well when it comes to language technology support.",
                    "label": 1
                },
                {
                    "sent": "There seems to be massive differences between the Europeans, languages and technology areas.",
                    "label": 0
                },
                {
                    "sent": "It's also very clear that language technology support for English is ahead of any other language, but far from being perfect and 4:30 N. 3030 languages.",
                    "label": 1
                },
                {
                    "sent": "Language technology support is only fragmentary, very weak or nonexistent.",
                    "label": 0
                },
                {
                    "sent": "So definitely there's a need to act for a lot of the languages which are part of this series.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So we with these reports we we both have a list of.",
                    "label": 0
                },
                {
                    "sent": "Love challenges described, but also we look a lot on the opportunities that that are given for the languages if they if they move more radically into this area but.",
                    "label": 1
                },
                {
                    "sent": "So we have a list of gaps where we can start working from.",
                    "label": 0
                },
                {
                    "sent": "And they will have to be addressed in the years to come.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So today we will launch a new version of the language.",
                    "label": 1
                },
                {
                    "sent": "My papers at this website and around I think, last night it was 31 of the 3021 of the 30 language papers that are now available in the final version and the first batch of printed copies will be available very soon and will be distributed in the beginning of July.",
                    "label": 0
                },
                {
                    "sent": "Also, we've met quite a lot of interest in printing other volumes.",
                    "label": 0
                },
                {
                    "sent": "Of the white papers, for instance, there will be a white paper on European Sign languages in the digital age.",
                    "label": 1
                },
                {
                    "sent": "And also included other languages that would like to work to make a similar effort for their language.",
                    "label": 0
                },
                {
                    "sent": "So have a look at the papers and I hope you will enjoy them and we all hope they will get the impact that they deserve.",
                    "label": 0
                },
                {
                    "sent": "There's been a great effort to actually introduce this form for the languages.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The questions for the language white papers.",
                    "label": 0
                },
                {
                    "sent": "I would like to know the criteria that determine if a language has an excellent support, which obviously not even English achieved and what would be.",
                    "label": 0
                },
                {
                    "sent": "For example example, support that is missing.",
                    "label": 0
                },
                {
                    "sent": "Sorry I did you ask about the German situation over the question, what was what was the criterion to give it to call a language has excellent support.",
                    "label": 0
                },
                {
                    "sent": "I mean even if English English don't has it.",
                    "label": 0
                },
                {
                    "sent": "I mean so yeah.",
                    "label": 0
                },
                {
                    "sent": "Is it that I'm missing?",
                    "label": 0
                },
                {
                    "sent": "So I mean, there's so.",
                    "label": 0
                },
                {
                    "sent": "So these were these were expert guesses.",
                    "label": 0
                },
                {
                    "sent": "That's so we have some definitions in the paper.",
                    "label": 0
                },
                {
                    "sent": "You can look them up so there are some indications what is excellent support.",
                    "label": 0
                },
                {
                    "sent": "I mean, and I think most people in this room have a very good feeling that even English is not excellently supported by by language technology.",
                    "label": 0
                },
                {
                    "sent": "So maybe we can.",
                    "label": 0
                },
                {
                    "sent": "Look it up in the paper, then offline.",
                    "label": 0
                },
                {
                    "sent": "What's up?",
                    "label": 0
                },
                {
                    "sent": "Information in the tables yesterday.",
                    "label": 0
                },
                {
                    "sent": "Dallas, TX from you and I'm European language policy network and secretary for the Parliament in Screw on languages.",
                    "label": 0
                },
                {
                    "sent": "National nurses think it works.",
                    "label": 0
                },
                {
                    "sent": "Fantastic's really welcomed.",
                    "label": 0
                },
                {
                    "sent": "I just wonder if you have any plans to extend it to all the other regional minority languages because information like this would be really helpful.",
                    "label": 0
                },
                {
                    "sent": "We just recently did a report for the Commission on the NGO Platform for Multilingualism and part of those recommendations.",
                    "label": 0
                },
                {
                    "sent": "Just to have an interesting Observatory and this kind of work would be really useful to upload and suspend Sissy.",
                    "label": 0
                },
                {
                    "sent": "Will the gaps on in the provision of language technology that's my understanding is that every minority language that we want to make a white paper are more than welcome.",
                    "label": 0
                },
                {
                    "sent": "Sign Language is a good example, so it's just to get started.",
                    "label": 0
                },
                {
                    "sent": "Actually, it's all the best.",
                    "label": 0
                },
                {
                    "sent": "We invite everybody who feels, I mean that it could build up such authoring team.",
                    "label": 0
                },
                {
                    "sent": "So please welcome contact us.",
                    "label": 0
                },
                {
                    "sent": "And of course there should be more volumes is thank you.",
                    "label": 1
                },
                {
                    "sent": "Hi, my name is Ian Schofield with a product called JP.",
                    "label": 0
                },
                {
                    "sent": "It seems to me that there is a large concentration on the written word.",
                    "label": 0
                },
                {
                    "sent": "Can you tell me to what extent you are looking at the spoken word?",
                    "label": 0
                },
                {
                    "sent": "Because we use speech technology in our products.",
                    "label": 0
                },
                {
                    "sent": "As far as I'm I know there are very few companies in Europe creating voices.",
                    "label": 0
                },
                {
                    "sent": "The majority of voices come from the America and scenario that we really could improve on.",
                    "label": 0
                },
                {
                    "sent": "It's all in there, of course.",
                    "label": 0
                },
                {
                    "sent": "I mean, we looked at it speech at the written language and semantics were committed.",
                    "label": 0
                },
                {
                    "sent": "The whole area of language technologies is in there and it's discussed for four languages, so you can.",
                    "label": 0
                },
                {
                    "sent": "We can find the information in the paper definitely, and I think we should then now and over to the tow_Now again to the chair.",
                    "label": 0
                },
                {
                    "sent": "The panel discussion now.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}