{
    "id": "iopapftpicat3x3r24axvkqp27e36q7f",
    "title": "Proof Interpretations and Their Application to Current Mathematics",
    "info": {
        "author": [
            "Ulrich Kohlenbach, Department of Mathematics, Darmstadt University of Technology"
        ],
        "published": "May 20, 2011",
        "recorded": "April 2011",
        "category": [
            "Top->Mathematics"
        ]
    },
    "url": "http://videolectures.net/godelfellowship2011_kohlenbach_pita/",
    "segmentation": [
        [
            "So my talk about is is about an applied form of."
        ],
        [
            "Proof theory that sometimes goes also under the name of proof mining.",
            "So here the idea is 1.",
            "Takes some proof of a theorem T and the goal is to extract from the proof."
        ],
        [
            "Information, so we saw already some type of features of this sort in Danko ilik stalk.",
            "There, the idea was to extract an algorithm or program in a programming language from a proof.",
            "Here the emphasis will be more on extracting information of interest to mathematicians working in this respect, the field of mathematics.",
            "Lagan expl."
        ],
        [
            "Is it bound or dependence or independence of data from certain?"
        ],
        [
            "Amateurs, so like uniformity results.",
            "This is in particular in issue which was in recent years pointed out by Terence Tao, who, surprisingly enough independently from any.",
            "Work in proof theory came up with some formulations which very much resemble what proof interpretations of the kind I've been investigating do in these particular."
        ],
        [
            "Examples.",
            "So in general the method is based on what I call proof interpretation.",
            "So approve interpretation assigns to every formula in a.",
            "In some formal system, which I've done, specifiers will be various systems around.",
            "Later in you formula it's interpretation AI."
        ],
        [
            "Such that when it comes to the theorem, if the theorem is sufficiently simple, this interpreted form has the additional information we are interested."
        ],
        [
            "And the approach is totally modular, so the interpretation was picked.",
            "The usual loss of reasoning, in particular the Motors opponents.",
            "So rather than being based on cut elimination or normalization, we follow directly the structure of the proof, and so by recursion on the given proof this in."
        ],
        [
            "Quotation of the theorem T is arrived at and our.",
            "Approach will be.",
            "Based on our has its historical roots in Google's famous dialectica interpretation, just published in this last paper in 58.",
            "Although he already had this interpretation developed in his ear lectures in I think of 41 or 42.",
            "And of course we need extensions and refinements in variations of that interpretation, but that's what what the origin of all this is.",
            "Andy Close connection to Google's profound research here.",
            "So because of this module Arity in particular, this means that any lemma which occurs in the proof of a theorem T which might have an arbitrary other complexity also receives a computational interesting meaning.",
            "So it doesn't just apply to Sigma one.",
            "Form."
        ],
        [
            "But to arbitrary sentences.",
            "Now historically, proof interpretations, like in Gordon's case, they used actually exclusively to give consistency proof.",
            "So girls paper was about to giving you consistency.",
            "Proof of 1st order, number theory, piano arithmetic.",
            "Namely, if the interpretation like in the dialectical case leaves statements like quantifier free statements, actually universal statements unchanged, then of course approve of an inconsistency gets translated again and approve of inconsistency.",
            "Will use this dialectic interpretation to interpret piano music in a quantifier.",
            "Free calculus of primitive recursive functionals of finite type in an extended sense of primitive recursion.",
            "Actually, this calculus was anticipated already in Hilbert's famous paper from 26 on Infinity.",
            "Uber does."
        ],
        [
            "So quietly in the 50s, had the idea of using proof theoretic transformations among them functional interpretations.",
            "When he learned about them from Google to to actually apply them to existing proofs of interesting theorems.",
            "When you prove a consistency theorem, you apply them only to hypothetical proof choppily will never exist of an inconsistency, so quizlets shift of emphasis was, well, let's take an interesting proof.",
            "An existing proof of an interesting theorem and see what this information transformation does, so in particular this reduction Google achieved from piano arithmetic.",
            "They have induction with arbitrary quantifier complexity to a quantifier.",
            "Free calculus means that somehow quantify is get eliminated in favor of combinatorial content.",
            "Now what does it mean when the statement is not quantifier free, but it's actually existential has some meaning, but it's proven by ineffective means what computational content can run."
        ],
        [
            "Correct, so that is what I'm interested in.",
            "Another feature which was pointed out by, in particular by Tao, is that when we go to this interpreted proof, which sort of exhibits infinitary combinatorics, skeleton of an original proof.",
            "So think of the original proof of some highly ineffective proof, which uses ideal principles in the sense of Hilbert of the proof of some other concrete statement.",
            "Then this interpreted proof will somehow exhibit some finite recombinant Oracle content behind this argument.",
            "Having access to.",
            "To this content is often easy.",
            "To generalize.",
            "This finite area reasoning, and then when can we interpret this as the interpretation of some generalized original proof, thereby obtaining by filling in this place here a generalization of a given proof.",
            "So we will see also briefly mentioned maybe instances of this."
        ],
        [
            "Yeah, so this is essentially what it said.",
            "So towel sometimes talks about soft analysis for ineffective reasoning, so it doesn't go with any quantitative information and heart of planetary analysis.",
            "If this vanity recombinant Oracle content is sort of."
        ],
        [
            "Exhibited so here is a very simple example which was treated already in crisis paper in 51, so consider just from first year calculus the statement that in an increase."
        ],
        [
            "If you have an an increasing bounded sequence just without loss of generality in the unit interval, so then we know that this sequence is convergent, so in particular Koshy.",
            "So I've just written here and a slightly unconventional way.",
            "The kosher property of this sequence."
        ],
        [
            "Now.",
            "As it follows from results of speaker in 49, even for very simple computable such sequences, and even of rational numbers in even primitive, recursively computable, there is in general no computable rate of convergence.",
            "So in particular, there's no bound on this existential quantifier N here, which would be computable in K. So what one does is to change this statement to the so called help on normal form which basically weakens this universal quantifier.",
            "Here by replacing for all M by a particular term, namely M is replaced by G of N, where G is an arbitrary number theoretic function.",
            "And so this function takes N, so it should be thought of as G should be thought of as an attempt to refute the Koshi property.",
            "Suppose the kosher property would be false.",
            "Then there would be a case such that for every end there is a counterexample M and finding this counterexample calling this G of N would be a function G refuting this year.",
            "So by this reasoning we see that although at first look two seems to be weakening of one, it is actually in affectively.",
            "Equivalent and applies back one, but since this proves ineffective, the fact that we do not have computable realizers or bonds for one doesn't rule out that we have."
        ],
        [
            "One for two, and in fact we have."
        ],
        [
            "Simple, very simple ones.",
            "And here is a very simple primitive recursive solution of this.",
            "Yeah is Christ, of course, it now counterexample interpretations.",
            "Or to show that such a Deacon does not succeed.",
            "So for every G we find an end refuting the G is a counterexample means we have solved the no counterexample interpretation of that statement.",
            "That is what tower calls meter stabilities or Tau would say.",
            "We have found an interval.",
            "Of metastability, so where the sequence, rather than being Co. She is not well.",
            "It's festival on the approximate Koshy, but also not forever, but only.",
            "Along an interval of this software, however, G has access to this particular point in.",
            "We tried to find and then this very simple operator.",
            "Here we just moved to the function N + G of N and then keep iterating this function starting from any element.",
            "For example zero if it would make this at least two to the K times, then we certainly have found a point below this where this is satisfied.",
            "Actually we can take one of these little bits is.",
            "One of these points of the form detailed I times iterated starting from zero 4 for some ice smaller than two to the K has to be a solution.",
            "Now where's the precise solution?",
            "Of course heavily depends on the sequence.",
            "What is important here that this bound is totally independent of the sequence, so there's before the speaker specter phenomenon.",
            "Is the speaker phenomenon of what the non computable solubility is due to the fact essentially that there is not even a continuous way of finding a rate of convergence.",
            "Here we have actually full independence from the.",
            "Sequence, so that's why towel causes a finite Terry Convergence principle, because we could touch only a finite amount of elements in our sequence, and how much we touch does not depend on the sequence of the.",
            "Actually, it's actually a statement about finite vectors rather than sequences."
        ],
        [
            "So now in very simple cases like this one, this bound on another counterexample coincides with what I call a monotone functional interpretation.",
            "So I will not have the time here today to spell out what the functional limitation of the monotone function adaptation is.",
            "It goes to higher and higher function spaces, but let me just say if the statement is as simple as a cautious statement like for all exists for all statement, then this is precisely what the interpretation does.",
            "But as soon."
        ],
        [
            "As it gets more complicated, when has to use more complicated devices, namely to follow up with the Google translation suggests to do, and this already starts from.",
            "Very simple examples like the infinitary pigeonhole principle, the infinitary pigeonhole principle is also studied by tower in an article in 2007, and there he argues that this is sort of problematic.",
            "It doesn't have any financial version, and so on and so forth, but he then suggests sums me financially version and properly understood.",
            "This is again the monotone function of the mutation of the original principles of the Infinity Original principles.",
            "Just that if you color the natural numbers per finitely many colors in one color has to occur infinitely.",
            "Often, and there is an exist for all existing pattern in this statement rather than for all exist for all."
        ],
        [
            "And also in order to undergo a proper understanding of functional reputation, needs some knowledge of intuitionistic logic because what functional limitation is actually doing is interpreting, not the system with classical logic, but the system with intuitionistic logic.",
            "And then when users, again another interpretation and really good as well known negative consolation first 2.",
            "Embed classical reasoning into an intuitionistic reasoning.",
            "Now this seems to be disasters, because then in front of every positive existential content there is a double negation placed in front.",
            "But the functional limitation managed to recover from this.",
            "That's the important feature.",
            "So by composing these two statements one these two interpretations, one obtains a powerful tool."
        ],
        [
            "Good, so here's already a nontrivial example, but it's of the similar format, so let's consider the well known for Neumann Agatic theorem, mean Agatic theorem in the formulation of Weiss.",
            "Here X is an arbitrary Hilbert space.",
            "F is linear, non expensive self mapping, so it doesn't increase norms of that space, and then we consider the so-called averaging mapping.",
            "So we take this example means of the iterates.",
            "Of this op."
        ],
        [
            "Later F and then the Phenomen theorem says no matter from which point X we start the sequence strongly converges.",
            "So this is somewhere in the early 30s."
        ],
        [
            "Approved now in a paper which appeared last year in transactions MSR, we got Guardian towers.",
            "No showed there is like in the simple case of speaker there is no in general no computable rate of convergence even for very simple spaces and very simple operators are.",
            "There is no issue of compatibility here.",
            "What compatibility should mean this in turn is based on some earlier observations of Bishop I guess."
        ],
        [
            "And but they extracted up limit."
        ],
        [
            "Recursive bond on the immediate stability using such proof theoretic tools, which I will I'm talking about here today.",
            "Then together with Laurencio last Jan we considered a proof do together perk of a generalization of this result, namely from Hilbert space to uniformly convex Banach spaces of this covers.",
            "For example all the LP spaces where P is larger than one and smaller than Infinity, whereas only for P = 2.",
            "This is a Hilbert space.",
            "There's a much larger class of.",
            "Space is an, although the book of proof is more involved than the usual textbook proof of the meaner got exterior, which is only half a page.",
            "It was surprisingly similar to analyze, and So what we got is this was appeared in 2009 and I got it theory and dynamical systems, but the 1st result is due to aggregate Kennedy and Toss night was proven.",
            "I think in two."
        ],
        [
            "Seven and this rate of metastability for them in a guarded theorem.",
            "In this general scenario.",
            "So if you have a bound on the meter stability of this Koshy property of these Cicero means and.",
            "The bound that's not surprising only depends on the error epsilon on the counter function G. And it essentially is independent of everything which has to do with this banner space and the operator and the starting point.",
            "The only input we need is enorm upper bound on the starting point, despite of the fact we have here in general banner space.",
            "So this will be by no means a compact subset.",
            "The space of points X of norm smaller equals MB and it's fully independent of the operator F and the only dependence on the spaces via modulus of convexity.",
            "So of course, since we use uniform convexity, we.",
            "Need to know with what numerical function of this convexity is actually witnessed, but that is known for all reasonable spaces."
        ],
        [
            "So here is actually the bound, so it's not totally different from this trivial example mentioned in the beginning.",
            "Again, we form out of G. We form some function.",
            "Now I call it H. It's a bit more involved than that function has to be iterated sufficiently often.",
            "How often I mean depends now a little bit on these various data involving the modelers of uniform convexity.",
            "And then we know that below this bound there has to be a point where this meter stability is met."
        ],
        [
            "So another."
        ],
        [
            "Thing is, we give the obtain here such highly uniform bounds, despite of the fact that we do not."
        ],
        [
            "And have compactness, the ifdef uniformity."
        ],
        [
            "This was picked with the operator and we have uniformity with respect to this."
        ],
        [
            "So the question is, is there a general logical and meter frame to account for this?",
            "I mean, for some experts you know they are in intuitionism.",
            "You have these things like fan theorem which sometimes guarantee uniformity.",
            "But this is always based on compactness or here we do not have."
        ],
        [
            "Agnes.",
            "Now for this to be for such a theorem to hold, it is crucial that the proof didn't use any separability assumption.",
            "So the proof uses just that X is an abstract Hilbert space, because if we use separability then the monotone function adaptation would actually translate separability into the total boundedness and hence compactness of any bounded ball.",
            "So therefore it is inseparability which is responsible for the fact that uniformity can only be achieved in the presence of compactness.",
            "Once we drop separability things are so have to be so uniform because the proof doesn't have any access to any combinatorial representation of the object.",
            "So somehow it should be independent from the object that construction.",
            "If you nevertheless managed to get such a number in, how could this number NB possibly defect depend on this point which just comes as an element of some black box of a monster proble Hilbert space?",
            "So let's see."
        ],
        [
            "Kosher thing now the problem is now how to talk about non separable spaces because the usual way you formalize things in proof theory in reverse mathematics in whatever fragments of set theory is that you say where you talk about spaces in functional analysis by assuming without loss of generality, let's assume they're all separable or useful.",
            "Spaces are separable and then you refer to them as a completion of a countable space.",
            "So that's how you also do this in descriptive set theory.",
            "So in the end of the day then everything gets reduced to either bare space or in the.",
            "Compare case to counter space so this is blocked here.",
            "So what we do in status we hardwire so to speak our abstract space into the formal framework so we have a new base type, so we have the type of natural numbers and we have the type of objects in our Hilbert space and we build a hierarchy of functionals of higher type on top of this use already in this now count example interpretation even when the statement only talks about numbers than account example interpretation talks about functionals of objects in their space.",
            "And as we move on, we need more and more complicated higher function spaces on top.",
            "Now he is just a list of spaces which can be nicely treated.",
            "So metric spaces, hyperbolic spaces in the sense of Kirk and rice cut zero spaces, were introduced by Gromov, Delta, hyperbolic space, again by Gromov.",
            "Norm Space is uniformly convex spaces, Hilbert spaces, or kinds of other spaces, some."
        ],
        [
            "Racism.",
            "I am missing, so the question is what a?",
            "What makes these notions nice compared to others?",
            "Well, what makes him nicest?",
            "They have an eczema tization, which has a monotone function of the mutation, which basically is its own monotone function adaptation.",
            "So these notions have the proper uniformity built-in.",
            "So what would be notions which do not have?"
        ],
        [
            "Proper uniformity built-in, whereas I already mentioned separable spaces, so we have to 1st make them uniform.",
            "But this essentially means to add a requirement of compactness.",
            "Other classes where the enrichment is less severe is to consider strictly convex spaces.",
            "Interesting results which hold already in the context of strictly convex spaces, but then the logical machinery would say well.",
            "Make it a bit stronger.",
            "Assume that the space is uniformly convex.",
            "Then I can produce what you want, otherwise it will not be possible.",
            "So this is just a mild.",
            "There's no reasonable now important space which is strictly convex, but it's not at the same time uniformly convex, so this is a very mild there's of course.",
            "Here this would be a drastic will basically rule out all banner spaces except finite dimensional ones.",
            "Now even notions wear the uniform version, make some inconsistent.",
            "So for example, take a statement, the space, the class of incomplete spaces.",
            "There is no space which is uniformly incomplete.",
            "One can show.",
            "Fortunately, there are very few mathematical theorems.",
            "Which start like taking incomplete space and the following is true, so it's so these classes here are more important."
        ],
        [
            "Good, So what one then does is, as I already mentioned, one closes up under these finite type hierarchy.",
            "So 1 builds the functionals on top of these operators.",
            "And then one formulates full arithmetic in all types on top of those.",
            "So this is a good system with classical logic with quantifiers on top of now functionals, Witcher build up on these types here and then we just for the time being go extremely strong.",
            "So we at the exome of Dependent Choice, which in particular covers countable choice of which in particular covers impredicative comprehension of a natural number.",
            "Second order arithmetic is a subsystem here of this, so this was already again mentioned in.",
            "And Uncle Ilecs talk that spectral succeeded using bar recursion to give an interpretation of countable choice.",
            "And actually this interpretation also works for Dependent Choice, and this can be extended to this setting with these abstract spaces as well."
        ],
        [
            "Of course, most proofs use only small parts of this, and then of course one has to add these specific constants and exams for the structure one is talking about, so it's a metric structure or some constant for pseudo metric and then XX stating that this is a pseudometric and then defining the quotient.",
            "So to make this a metric space, and so on and so forth."
        ],
        [
            "So then we want to extract uniform bounds.",
            "So we need a notion of bound which works in each level of these function spaces now."
        ],
        [
            "Or just numbers.",
            "It is clear the bound is X is a bond of Y if it's bigger.",
            "In element in our Hilbert space is bounded by a number X.",
            "If X is a bound on the norm of Y, this can be also applied in general metric spaces.",
            "In general metric spaces we use or reference point and then measure the distance relative to a reference point like in the gram of product.",
            "But I will not go into this for this talk today, but it's possible and actually then selecting the reference point cleverly like for example the starting point of some dynamical system and gives even additional uniformity.",
            "And then this is extended to all higher types in the usual, handy Terry fashion.",
            "I don't spell this out, it just give for the only case."
        ],
        [
            "We need the definition, namely, if you have a self mapping from X to X, then a major rising object will be a number theoretic function F star, which Maps any normal upper bound for X into a normal upper bound for F of X, and so all the computation will take place on these major rising objects.",
            "On this case, on Estar, which means our number theoretic functions, of which we have a perfect compatibility and complexity and whatnot theory, so we don't have to require hear anything like that.",
            "Our Hilbert spaces some effective representation and that we know what it means to be a computable operator in.",
            "From X to X, nothing of the sort."
        ],
        [
            "Now when the mapping is not expensive, which in the nonlinear case has to be expressed like this, so it's Lipschitz with Lipschitz constant one, then it's actually very simple to obtain such a major rising object.",
            "We just need a bound on the norm of one element of F, for example of F at zero, and then the mapping and goes to N + B always is major.",
            "And now if F is linear then of course F of 0 is 0.",
            "So we can take B to be 0 and therefore the identity is actually measurement.",
            "Now comes the point.",
            "What monotone functional limitation is doing is to interpret the whole proof on the level of these major rising objects.",
            "So the bound we obtained will be a computable device depending only on major guns.",
            "Now, since all what we need about to know about F is a major run, then we can always take the identity we don't see if in the bond I mean, that's the point.",
            "Of course, the major eyes X in general element X we needed bound on the norm of X because that's what major I."
        ],
        [
            "Required, so that's exactly what."
        ],
        [
            "This thing does so then extensional equality.",
            "Equality is defined like this.",
            "So we have actually a pseudo metric or normed space and then we defined here an equivalence relation and then of course the issue is."
        ],
        [
            "To state as an axiom we would like to state that all functions respect this equivalence relation.",
            "Now, if you would do this, this results would be grim false becausw the emitter theorem of the time we're going to prove would imply that all mappings between let's say bounded balls in non spaces are equi continuous with the same modulus of continuity and this cannot be.",
            "So extensionality is a problem this already in theory could cause talk.",
            "The emphasis on extensionality.",
            "So what we will do is like in the dialectic interpretation we use a weak rule of extensionality.",
            "So only if things are probably equal then we allowed to conclude that the objects respect this.",
            "Fortunately, mathematical conditions normally guarantee that things are extensional.",
            "For example, and an expensive mapping.",
            "Of course always is provable, extensional, but that's not followed, doesn't follow form and equality axiom, but it's a mathematical consequence of the assault."
        ],
        [
            "Good.",
            "So then to."
        ],
        [
            "Gather with Phillip Karate in 2008 I published meter frames to the effect.",
            "He is just a very special case for for what I need today.",
            "If you have not a statement like we talk about some numbers or number theoretic functions elements in a compact space, then some starting point of some iterations and we have some mapping of which we take for example, this is our average of whatever this mapping is non expensive.",
            "If you then prove an existential statement, there is always guaranteed that we get a computable bound which has exactly these features.",
            "It only depends on major runs of X and measurements of F. And as I said, a measurement of F, it is sufficient to know.",
            "Abound on this one point.",
            "And if it is linear, even that disappears, and so this fully explains in mathematical terms why this was possible.",
            "What we did in the mean aquatic theme."
        ],
        [
            "In case."
        ],
        [
            "So here's a citation from Tao.",
            "So he used.",
            "He cited the work by Advocate Guardian Towson.",
            "So he used this uniform meter stable version to generalize the meaner Goddess theorem to commuting families of operators.",
            "So there's no mentioning of bonds in the result, but it's just behind the scenery.",
            "In order to prove the result, the original meaner got experience for families of operators.",
            "He uses this passage through the now counterexample interpretation.",
            "And so it says we establish the ceiling by train experiment of green tower.",
            "That's a famous Green Tao theorem for which tower.",
            "Mainly kept the fields medal.",
            "The main advantage of working in a finite every setting is that the underlying dynamical system becomes extremely explicit.",
            "In proof theory, this finalization is known as Google Functional Interpretation, which is closely related to Kaizen account example interpretate."
        ],
        [
            "Yeah, so now I will talk about current work and briefly and outlook for what I want to do.",
            "So since 2000 we have many people have worked now using these tools.",
            "More than 40 papers published and since normally you get a result which is directly readable to analysts, most of these results are published in journals like Nonlinear Analysis, Journal of Mathematical Analysis and so on and Be Cause the End product is again an ordinary functional analytic proof."
        ],
        [
            "That's one thing I want."
        ],
        [
            "To convey here.",
            "So now new frontiers are the following.",
            "So what about if proofs use severely weak compactness where I showed in my contribution yet to this competition that there is a solution to of the monotone functional limitation of weak compactness and is of high complexity.",
            "It has to be it uses body Kirchen and it elevates things 2 levels in the Google hierarchy of primitive recursive functionals, whatever.",
            "This precisely means and recent work of a PhD student of Mine, Alexander Kreutzer has proven that this is optimal, so one.",
            "To move up one."
        ],
        [
            "It would not be sufficient.",
            "Now I applied this to a nonlinear agatic therium, so by your proofed in 75 and nonlinear Agatic theorem.",
            "So your drop just the linearity condition.",
            "Then it's actually known to be false that strong convergence holds, but he proved that weak convergence holds and there is a quantitative version of this which uses iteratively two times this operator.",
            "Here someone gets this rough bound on the first level of grilled cziraky, which is probably far from optimal, but at least that's what one get."
        ],
        [
            "On the other hand, in many special cases, BIOS result boils down to a strong convergence result in each of these cases, one so far obtained very elementary primitive recursive bounds of the type described before, so one result is due to Whitman.",
            "Here one drops linearity but replaces the Cicero means by slightly distorted iterations of so called help an iteration, which, however, in the presence of linearity, coincides with its izaro means.",
            "So it's a nonlinear extension.",
            "Therefore, of the phenomenon feeling so, I extracted an elementary bound for this recently, and this appeared in advances in math math."
        ],
        [
            "Six in 2011.",
            "Again, recently a PhD student of mine, Pavel Cephalic, treated another result which was first proved by by Jan 76 and generalized by again by Whitman about operators.",
            "So here you keep.",
            "This is our home means, but we add a little bit of linearity, so you require that the operator, rather than being linear, is odd Now this was further generalized by victim into actually very nice condition and this results of Whitman was analyzed by Safari Candy Garden primitive recursive bound.",
            "On that version of a strong nonlinear agatic."
        ],
        [
            "Ceiling.",
            "So.",
            "You get fussy about how.",
            "Yeah, but how primitive?",
            "Because if they normally they are of the kind you have one iteration of the counter function, so if they counter function is the successor function, it's already an important case.",
            "Then you get actually a linear bound and sometimes you get a polynomial bounded when it depends, they just typically elevates things one level into Georgia Cairo key.",
            "So you start with the counter function G and then typically use the other examples.",
            "We have polynomial bounds across the board if no.",
            "Sequential compactness is basically used."
        ],
        [
            "So, so this is what I want to investigate it."
        ],
        [
            "General.",
            "Dichotomy result of this sort that whenever you prove strong convergence result, even if it uses weak compactness and whatnot, it somehow can be eliminated because it what actually happens in these posts, it could not be so far illuminated in BIOS original result, but that is a result which in itself states of the convergence result.",
            "But if the result is strong, convergence with that, is it possible to elementor eyes approve always?",
            "So that's one question and you say."
        ],
        [
            "We did see him explaining this.",
            "Now another topic which is very active is to use banner limits in this business, because people actually generalize this type of functional analysis in their God theory to these hyperbolic spaces I mentioned, like at zero spaces of come off in this space.",
            "If you don't have a linear structure, so it doesn't make sense to talk about linear operators and therefore not about weak compactness, so people instead use Banach limits.",
            "Nobody limits you some substantial amount of the axiom of choice.",
            "It's not covered yet by the existing meter programs."
        ],
        [
            "Nevertheless, we just."
        ],
        [
            "Analyzed."
        ],
        [
            "Only together Florencia last Jan approve of.",
            "Whitman theorem for cat O Spaces, which is was proven last year by CR Chung using Banach limits and it turned out this banner limit could be illuminated.",
            "Vanity mirrors used only on some financial recombinant Oracle business, and there could be first illuminated in terms of arithmetic comprehension later even there are many comprehension could be illuminated.",
            "So we've got actually in some sense and more elementary proof than their proof using the compactness for the Hilbert case was and essentially we have a primitive recursive bound, we have just write down the details, but the elimination has been already achieved.",
            "So question is a general meter theorem that which tells us this is always possible if you have a convergence result of this type and it's proved using bandwidth limits and somehow the banner limit is some machinery which is used for convenience, but it can be systematically."
        ],
        [
            "Turn it off.",
            "Finally, what about Ultrapowers?",
            "Can one treat other powers of metric structures?",
            "It's also often used in this context.",
            "There already results of again, Alexander Carlson, PhD student of mine, to the extent that this is."
        ],
        [
            "Possible.",
            "And then finally, so far I talked about rates of metastability.",
            "Of course it would be even nicer to have real rates of convergence.",
            "Now this is often blocked by speakers result fuse classical logic, but in many cases it turns out of all the proof first seems to be ineffective.",
            "It turned out that there was is actually possible to get effective rates of convergence.",
            "Important classes are there when his monotone convergence or the uniqueness of the limit is involved or recently proved results together with a student of Mine Kern Line.",
            "For so-called pseudo contractions, which play an important role for partial differential equations, this is a far reaching extension of the class of nonexpansive mappings, and there was a proof that something converges which was highly ineffective, it seemed, but we actually got a rate of convergence.",
            "Another rate of metastability by the rate of convergence.",
            "So question is a general logical media theorem."
        ],
        [
            "For such classes which says or classifieds one this is to be expected."
        ],
        [
            "Will be possible and finally to find new areas for proof mining.",
            "Since I mentioned already these hyperbolic spaces, Godzilla spaces out reason song they ever used by Gromov in the context of the program of geometric group theory, so are their main statements which are genuine interest to people working in this area.",
            "Different statements not like stability results of aquatic systems, but algebraic statements to which these machinery's could be applied as well.",
            "What about partial differential equations?"
        ],
        [
            "Histology bars and song.",
            "And finally I want to close with some big questions because we know that the questions are important for the research.",
            "Funded by the Templeton Foundation, and rightly so, so here's a question.",
            "Is there any mathematical principle whatsoever?",
            "For which there is substantial obstacle in doing this, so you have a proof of some combinatorial meaningful statement, some convergence statement.",
            "The proof uses this principle, and it's somehow impossible to get any meaningful combinatorial content.",
            "Any principle other than extensionality, because extensionality is such a statement because as we know from Howard, even very simple instances of extensionality in itself simply do not have a similar Frankel definable solution or functional reputation.",
            "So this was the only thing which we ruled out, so we have to be careful about extensionality.",
            "By the way, in."
        ],
        [
            "Result of safaric.",
            "There is no extensionality wasn't given the condition of Whitman is so general that the condition no longer implies that the operators continuous even.",
            "Nevertheless, using the rule of extensionality, one could get through here and it was still the case that the identity measure rises.",
            "Sotc meter is not the smoothness of the operator, but it's the niceness of the measurement.",
            "So the function can be horrible as long as a measurement is nice, and as long as extensionality is used only in this week setting.",
            "But we have to be careful about this, otherwise they're counterexamples all over the place.",
            "So question is there any other principle one has to be equally careful about?",
            "Or is it just a matter of you know, further pushing?",
            "Things to treat.",
            "I mean, today banner limits to Molitor Powers and what not functional analysts use in the years to come, thanks.",
            "Thank you very much and we have 4 * 4 questions.",
            "With regard to this last issue of.",
            "You know this example I keep coming back to of mine where I exploit bozzano via straws and ask for the estimate to be a little different than normal and then it blows up the ackermann's function yes.",
            "How would you classify that it turns your last question.",
            "Yeah, but but obstacle.",
            "I mean of course, and Ackerman bound is not an obstacle.",
            "If that's the complexity then then then then that's what it is.",
            "An obstacle I mean is to say there is absolutely no meaningful computational rendering of this statement.",
            "Now with respect to the Bolzano vanish classes, we have results of the that's actually very interesting results of the following form.",
            "So I proved along time ago.",
            "If you work in very weak systems, roughly corresponding to RCA, not star, and use just a single instance of both sunrise or sequence of instances, then it only gives primitive recursion.",
            "Nobody your example does is to smuggle in an iteration of that both on the wash trusted to combine it with Sigma, one induction that then gives the Ackermann function in principle, but most of the applications and ordinary mathematics of the form that is a single use now.",
            "Actually, in most of these results, one needs only the bird sound advice.",
            "Trust in the following week version named to say there is a subsequence which is cool she not fast 'cause she just 'cause she it is in some sense an artifact of reverse mathematics.",
            "It's about some of our class is equivalent to automatic comprehension because one insists on the course sequence to be fast because the real numbers are represented as fast code causing sequence and therefore to say there is a limit means to have a fast course sequence.",
            "Now if you weaken the statement to say there is a cautious sequence, just focus on sufficient in these ergotic theory then caught so recently showed that the principle is equivalent to the cohesiveness principle.",
            "Cohesiveness studied in the context of Ramsey theorem for pairs in the cohesiveness principle remains conservative over PRA.",
            "If an AIDS is to RCA not.",
            "So if an ad to RCA not full.",
            "Bolzano watch 'cause as often iterated as one wants, but in this version, namely saying there's only.",
            "Of course, the subsequence rather fast converging then it still is conservative over primitive recursive Arma tick, and I suspect that this accounts for this empirical finding that despite of the fact that analysts use sequential compactness all over the place, one rarely sees if at all common type of bonds.",
            "Another project would be is this tool for V. Compactness is a tool that to say every sequence in a unit ball in Hilbert space has.",
            "Anne.",
            "I mean you have a weak Cauchy subsequence without a rate, just coaches subsequences that also as weak as a cohesiveness principle.",
            "So that would be OK.",
            "Thank you very much.",
            "We have to close because we're way behind the schedule and piano is going to come here back, and so on and so on.",
            "So thank you all very much for this for being here.",
            "Thank you, Monty's for organizing this first session such a way and thank you.",
            "Excellent lecture."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So my talk about is is about an applied form of.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Proof theory that sometimes goes also under the name of proof mining.",
                    "label": 0
                },
                {
                    "sent": "So here the idea is 1.",
                    "label": 0
                },
                {
                    "sent": "Takes some proof of a theorem T and the goal is to extract from the proof.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Information, so we saw already some type of features of this sort in Danko ilik stalk.",
                    "label": 0
                },
                {
                    "sent": "There, the idea was to extract an algorithm or program in a programming language from a proof.",
                    "label": 0
                },
                {
                    "sent": "Here the emphasis will be more on extracting information of interest to mathematicians working in this respect, the field of mathematics.",
                    "label": 0
                },
                {
                    "sent": "Lagan expl.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is it bound or dependence or independence of data from certain?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Amateurs, so like uniformity results.",
                    "label": 1
                },
                {
                    "sent": "This is in particular in issue which was in recent years pointed out by Terence Tao, who, surprisingly enough independently from any.",
                    "label": 1
                },
                {
                    "sent": "Work in proof theory came up with some formulations which very much resemble what proof interpretations of the kind I've been investigating do in these particular.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Examples.",
                    "label": 0
                },
                {
                    "sent": "So in general the method is based on what I call proof interpretation.",
                    "label": 0
                },
                {
                    "sent": "So approve interpretation assigns to every formula in a.",
                    "label": 0
                },
                {
                    "sent": "In some formal system, which I've done, specifiers will be various systems around.",
                    "label": 0
                },
                {
                    "sent": "Later in you formula it's interpretation AI.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Such that when it comes to the theorem, if the theorem is sufficiently simple, this interpreted form has the additional information we are interested.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the approach is totally modular, so the interpretation was picked.",
                    "label": 0
                },
                {
                    "sent": "The usual loss of reasoning, in particular the Motors opponents.",
                    "label": 0
                },
                {
                    "sent": "So rather than being based on cut elimination or normalization, we follow directly the structure of the proof, and so by recursion on the given proof this in.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Quotation of the theorem T is arrived at and our.",
                    "label": 0
                },
                {
                    "sent": "Approach will be.",
                    "label": 0
                },
                {
                    "sent": "Based on our has its historical roots in Google's famous dialectica interpretation, just published in this last paper in 58.",
                    "label": 0
                },
                {
                    "sent": "Although he already had this interpretation developed in his ear lectures in I think of 41 or 42.",
                    "label": 0
                },
                {
                    "sent": "And of course we need extensions and refinements in variations of that interpretation, but that's what what the origin of all this is.",
                    "label": 0
                },
                {
                    "sent": "Andy Close connection to Google's profound research here.",
                    "label": 0
                },
                {
                    "sent": "So because of this module Arity in particular, this means that any lemma which occurs in the proof of a theorem T which might have an arbitrary other complexity also receives a computational interesting meaning.",
                    "label": 0
                },
                {
                    "sent": "So it doesn't just apply to Sigma one.",
                    "label": 0
                },
                {
                    "sent": "Form.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But to arbitrary sentences.",
                    "label": 0
                },
                {
                    "sent": "Now historically, proof interpretations, like in Gordon's case, they used actually exclusively to give consistency proof.",
                    "label": 1
                },
                {
                    "sent": "So girls paper was about to giving you consistency.",
                    "label": 0
                },
                {
                    "sent": "Proof of 1st order, number theory, piano arithmetic.",
                    "label": 0
                },
                {
                    "sent": "Namely, if the interpretation like in the dialectical case leaves statements like quantifier free statements, actually universal statements unchanged, then of course approve of an inconsistency gets translated again and approve of inconsistency.",
                    "label": 0
                },
                {
                    "sent": "Will use this dialectic interpretation to interpret piano music in a quantifier.",
                    "label": 0
                },
                {
                    "sent": "Free calculus of primitive recursive functionals of finite type in an extended sense of primitive recursion.",
                    "label": 0
                },
                {
                    "sent": "Actually, this calculus was anticipated already in Hilbert's famous paper from 26 on Infinity.",
                    "label": 0
                },
                {
                    "sent": "Uber does.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So quietly in the 50s, had the idea of using proof theoretic transformations among them functional interpretations.",
                    "label": 0
                },
                {
                    "sent": "When he learned about them from Google to to actually apply them to existing proofs of interesting theorems.",
                    "label": 0
                },
                {
                    "sent": "When you prove a consistency theorem, you apply them only to hypothetical proof choppily will never exist of an inconsistency, so quizlets shift of emphasis was, well, let's take an interesting proof.",
                    "label": 0
                },
                {
                    "sent": "An existing proof of an interesting theorem and see what this information transformation does, so in particular this reduction Google achieved from piano arithmetic.",
                    "label": 0
                },
                {
                    "sent": "They have induction with arbitrary quantifier complexity to a quantifier.",
                    "label": 0
                },
                {
                    "sent": "Free calculus means that somehow quantify is get eliminated in favor of combinatorial content.",
                    "label": 0
                },
                {
                    "sent": "Now what does it mean when the statement is not quantifier free, but it's actually existential has some meaning, but it's proven by ineffective means what computational content can run.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Correct, so that is what I'm interested in.",
                    "label": 0
                },
                {
                    "sent": "Another feature which was pointed out by, in particular by Tao, is that when we go to this interpreted proof, which sort of exhibits infinitary combinatorics, skeleton of an original proof.",
                    "label": 0
                },
                {
                    "sent": "So think of the original proof of some highly ineffective proof, which uses ideal principles in the sense of Hilbert of the proof of some other concrete statement.",
                    "label": 0
                },
                {
                    "sent": "Then this interpreted proof will somehow exhibit some finite recombinant Oracle content behind this argument.",
                    "label": 0
                },
                {
                    "sent": "Having access to.",
                    "label": 0
                },
                {
                    "sent": "To this content is often easy.",
                    "label": 0
                },
                {
                    "sent": "To generalize.",
                    "label": 0
                },
                {
                    "sent": "This finite area reasoning, and then when can we interpret this as the interpretation of some generalized original proof, thereby obtaining by filling in this place here a generalization of a given proof.",
                    "label": 0
                },
                {
                    "sent": "So we will see also briefly mentioned maybe instances of this.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, so this is essentially what it said.",
                    "label": 0
                },
                {
                    "sent": "So towel sometimes talks about soft analysis for ineffective reasoning, so it doesn't go with any quantitative information and heart of planetary analysis.",
                    "label": 0
                },
                {
                    "sent": "If this vanity recombinant Oracle content is sort of.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Exhibited so here is a very simple example which was treated already in crisis paper in 51, so consider just from first year calculus the statement that in an increase.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you have an an increasing bounded sequence just without loss of generality in the unit interval, so then we know that this sequence is convergent, so in particular Koshy.",
                    "label": 0
                },
                {
                    "sent": "So I've just written here and a slightly unconventional way.",
                    "label": 0
                },
                {
                    "sent": "The kosher property of this sequence.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "As it follows from results of speaker in 49, even for very simple computable such sequences, and even of rational numbers in even primitive, recursively computable, there is in general no computable rate of convergence.",
                    "label": 0
                },
                {
                    "sent": "So in particular, there's no bound on this existential quantifier N here, which would be computable in K. So what one does is to change this statement to the so called help on normal form which basically weakens this universal quantifier.",
                    "label": 0
                },
                {
                    "sent": "Here by replacing for all M by a particular term, namely M is replaced by G of N, where G is an arbitrary number theoretic function.",
                    "label": 0
                },
                {
                    "sent": "And so this function takes N, so it should be thought of as G should be thought of as an attempt to refute the Koshi property.",
                    "label": 0
                },
                {
                    "sent": "Suppose the kosher property would be false.",
                    "label": 0
                },
                {
                    "sent": "Then there would be a case such that for every end there is a counterexample M and finding this counterexample calling this G of N would be a function G refuting this year.",
                    "label": 0
                },
                {
                    "sent": "So by this reasoning we see that although at first look two seems to be weakening of one, it is actually in affectively.",
                    "label": 0
                },
                {
                    "sent": "Equivalent and applies back one, but since this proves ineffective, the fact that we do not have computable realizers or bonds for one doesn't rule out that we have.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One for two, and in fact we have.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Simple, very simple ones.",
                    "label": 0
                },
                {
                    "sent": "And here is a very simple primitive recursive solution of this.",
                    "label": 1
                },
                {
                    "sent": "Yeah is Christ, of course, it now counterexample interpretations.",
                    "label": 0
                },
                {
                    "sent": "Or to show that such a Deacon does not succeed.",
                    "label": 0
                },
                {
                    "sent": "So for every G we find an end refuting the G is a counterexample means we have solved the no counterexample interpretation of that statement.",
                    "label": 0
                },
                {
                    "sent": "That is what tower calls meter stabilities or Tau would say.",
                    "label": 0
                },
                {
                    "sent": "We have found an interval.",
                    "label": 0
                },
                {
                    "sent": "Of metastability, so where the sequence, rather than being Co. She is not well.",
                    "label": 0
                },
                {
                    "sent": "It's festival on the approximate Koshy, but also not forever, but only.",
                    "label": 0
                },
                {
                    "sent": "Along an interval of this software, however, G has access to this particular point in.",
                    "label": 0
                },
                {
                    "sent": "We tried to find and then this very simple operator.",
                    "label": 0
                },
                {
                    "sent": "Here we just moved to the function N + G of N and then keep iterating this function starting from any element.",
                    "label": 0
                },
                {
                    "sent": "For example zero if it would make this at least two to the K times, then we certainly have found a point below this where this is satisfied.",
                    "label": 0
                },
                {
                    "sent": "Actually we can take one of these little bits is.",
                    "label": 0
                },
                {
                    "sent": "One of these points of the form detailed I times iterated starting from zero 4 for some ice smaller than two to the K has to be a solution.",
                    "label": 0
                },
                {
                    "sent": "Now where's the precise solution?",
                    "label": 0
                },
                {
                    "sent": "Of course heavily depends on the sequence.",
                    "label": 0
                },
                {
                    "sent": "What is important here that this bound is totally independent of the sequence, so there's before the speaker specter phenomenon.",
                    "label": 0
                },
                {
                    "sent": "Is the speaker phenomenon of what the non computable solubility is due to the fact essentially that there is not even a continuous way of finding a rate of convergence.",
                    "label": 0
                },
                {
                    "sent": "Here we have actually full independence from the.",
                    "label": 0
                },
                {
                    "sent": "Sequence, so that's why towel causes a finite Terry Convergence principle, because we could touch only a finite amount of elements in our sequence, and how much we touch does not depend on the sequence of the.",
                    "label": 0
                },
                {
                    "sent": "Actually, it's actually a statement about finite vectors rather than sequences.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now in very simple cases like this one, this bound on another counterexample coincides with what I call a monotone functional interpretation.",
                    "label": 0
                },
                {
                    "sent": "So I will not have the time here today to spell out what the functional limitation of the monotone function adaptation is.",
                    "label": 0
                },
                {
                    "sent": "It goes to higher and higher function spaces, but let me just say if the statement is as simple as a cautious statement like for all exists for all statement, then this is precisely what the interpretation does.",
                    "label": 0
                },
                {
                    "sent": "But as soon.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As it gets more complicated, when has to use more complicated devices, namely to follow up with the Google translation suggests to do, and this already starts from.",
                    "label": 1
                },
                {
                    "sent": "Very simple examples like the infinitary pigeonhole principle, the infinitary pigeonhole principle is also studied by tower in an article in 2007, and there he argues that this is sort of problematic.",
                    "label": 0
                },
                {
                    "sent": "It doesn't have any financial version, and so on and so forth, but he then suggests sums me financially version and properly understood.",
                    "label": 0
                },
                {
                    "sent": "This is again the monotone function of the mutation of the original principles of the Infinity Original principles.",
                    "label": 1
                },
                {
                    "sent": "Just that if you color the natural numbers per finitely many colors in one color has to occur infinitely.",
                    "label": 0
                },
                {
                    "sent": "Often, and there is an exist for all existing pattern in this statement rather than for all exist for all.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And also in order to undergo a proper understanding of functional reputation, needs some knowledge of intuitionistic logic because what functional limitation is actually doing is interpreting, not the system with classical logic, but the system with intuitionistic logic.",
                    "label": 0
                },
                {
                    "sent": "And then when users, again another interpretation and really good as well known negative consolation first 2.",
                    "label": 0
                },
                {
                    "sent": "Embed classical reasoning into an intuitionistic reasoning.",
                    "label": 0
                },
                {
                    "sent": "Now this seems to be disasters, because then in front of every positive existential content there is a double negation placed in front.",
                    "label": 0
                },
                {
                    "sent": "But the functional limitation managed to recover from this.",
                    "label": 0
                },
                {
                    "sent": "That's the important feature.",
                    "label": 0
                },
                {
                    "sent": "So by composing these two statements one these two interpretations, one obtains a powerful tool.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good, so here's already a nontrivial example, but it's of the similar format, so let's consider the well known for Neumann Agatic theorem, mean Agatic theorem in the formulation of Weiss.",
                    "label": 0
                },
                {
                    "sent": "Here X is an arbitrary Hilbert space.",
                    "label": 0
                },
                {
                    "sent": "F is linear, non expensive self mapping, so it doesn't increase norms of that space, and then we consider the so-called averaging mapping.",
                    "label": 0
                },
                {
                    "sent": "So we take this example means of the iterates.",
                    "label": 0
                },
                {
                    "sent": "Of this op.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Later F and then the Phenomen theorem says no matter from which point X we start the sequence strongly converges.",
                    "label": 0
                },
                {
                    "sent": "So this is somewhere in the early 30s.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Approved now in a paper which appeared last year in transactions MSR, we got Guardian towers.",
                    "label": 0
                },
                {
                    "sent": "No showed there is like in the simple case of speaker there is no in general no computable rate of convergence even for very simple spaces and very simple operators are.",
                    "label": 0
                },
                {
                    "sent": "There is no issue of compatibility here.",
                    "label": 0
                },
                {
                    "sent": "What compatibility should mean this in turn is based on some earlier observations of Bishop I guess.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And but they extracted up limit.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Recursive bond on the immediate stability using such proof theoretic tools, which I will I'm talking about here today.",
                    "label": 0
                },
                {
                    "sent": "Then together with Laurencio last Jan we considered a proof do together perk of a generalization of this result, namely from Hilbert space to uniformly convex Banach spaces of this covers.",
                    "label": 1
                },
                {
                    "sent": "For example all the LP spaces where P is larger than one and smaller than Infinity, whereas only for P = 2.",
                    "label": 0
                },
                {
                    "sent": "This is a Hilbert space.",
                    "label": 0
                },
                {
                    "sent": "There's a much larger class of.",
                    "label": 0
                },
                {
                    "sent": "Space is an, although the book of proof is more involved than the usual textbook proof of the meaner got exterior, which is only half a page.",
                    "label": 0
                },
                {
                    "sent": "It was surprisingly similar to analyze, and So what we got is this was appeared in 2009 and I got it theory and dynamical systems, but the 1st result is due to aggregate Kennedy and Toss night was proven.",
                    "label": 0
                },
                {
                    "sent": "I think in two.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Seven and this rate of metastability for them in a guarded theorem.",
                    "label": 1
                },
                {
                    "sent": "In this general scenario.",
                    "label": 0
                },
                {
                    "sent": "So if you have a bound on the meter stability of this Koshy property of these Cicero means and.",
                    "label": 0
                },
                {
                    "sent": "The bound that's not surprising only depends on the error epsilon on the counter function G. And it essentially is independent of everything which has to do with this banner space and the operator and the starting point.",
                    "label": 0
                },
                {
                    "sent": "The only input we need is enorm upper bound on the starting point, despite of the fact we have here in general banner space.",
                    "label": 1
                },
                {
                    "sent": "So this will be by no means a compact subset.",
                    "label": 0
                },
                {
                    "sent": "The space of points X of norm smaller equals MB and it's fully independent of the operator F and the only dependence on the spaces via modulus of convexity.",
                    "label": 1
                },
                {
                    "sent": "So of course, since we use uniform convexity, we.",
                    "label": 0
                },
                {
                    "sent": "Need to know with what numerical function of this convexity is actually witnessed, but that is known for all reasonable spaces.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here is actually the bound, so it's not totally different from this trivial example mentioned in the beginning.",
                    "label": 0
                },
                {
                    "sent": "Again, we form out of G. We form some function.",
                    "label": 0
                },
                {
                    "sent": "Now I call it H. It's a bit more involved than that function has to be iterated sufficiently often.",
                    "label": 0
                },
                {
                    "sent": "How often I mean depends now a little bit on these various data involving the modelers of uniform convexity.",
                    "label": 1
                },
                {
                    "sent": "And then we know that below this bound there has to be a point where this meter stability is met.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So another.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thing is, we give the obtain here such highly uniform bounds, despite of the fact that we do not.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And have compactness, the ifdef uniformity.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This was picked with the operator and we have uniformity with respect to this.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the question is, is there a general logical and meter frame to account for this?",
                    "label": 0
                },
                {
                    "sent": "I mean, for some experts you know they are in intuitionism.",
                    "label": 0
                },
                {
                    "sent": "You have these things like fan theorem which sometimes guarantee uniformity.",
                    "label": 0
                },
                {
                    "sent": "But this is always based on compactness or here we do not have.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Agnes.",
                    "label": 0
                },
                {
                    "sent": "Now for this to be for such a theorem to hold, it is crucial that the proof didn't use any separability assumption.",
                    "label": 0
                },
                {
                    "sent": "So the proof uses just that X is an abstract Hilbert space, because if we use separability then the monotone function adaptation would actually translate separability into the total boundedness and hence compactness of any bounded ball.",
                    "label": 0
                },
                {
                    "sent": "So therefore it is inseparability which is responsible for the fact that uniformity can only be achieved in the presence of compactness.",
                    "label": 0
                },
                {
                    "sent": "Once we drop separability things are so have to be so uniform because the proof doesn't have any access to any combinatorial representation of the object.",
                    "label": 0
                },
                {
                    "sent": "So somehow it should be independent from the object that construction.",
                    "label": 0
                },
                {
                    "sent": "If you nevertheless managed to get such a number in, how could this number NB possibly defect depend on this point which just comes as an element of some black box of a monster proble Hilbert space?",
                    "label": 0
                },
                {
                    "sent": "So let's see.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Kosher thing now the problem is now how to talk about non separable spaces because the usual way you formalize things in proof theory in reverse mathematics in whatever fragments of set theory is that you say where you talk about spaces in functional analysis by assuming without loss of generality, let's assume they're all separable or useful.",
                    "label": 0
                },
                {
                    "sent": "Spaces are separable and then you refer to them as a completion of a countable space.",
                    "label": 0
                },
                {
                    "sent": "So that's how you also do this in descriptive set theory.",
                    "label": 0
                },
                {
                    "sent": "So in the end of the day then everything gets reduced to either bare space or in the.",
                    "label": 1
                },
                {
                    "sent": "Compare case to counter space so this is blocked here.",
                    "label": 0
                },
                {
                    "sent": "So what we do in status we hardwire so to speak our abstract space into the formal framework so we have a new base type, so we have the type of natural numbers and we have the type of objects in our Hilbert space and we build a hierarchy of functionals of higher type on top of this use already in this now count example interpretation even when the statement only talks about numbers than account example interpretation talks about functionals of objects in their space.",
                    "label": 0
                },
                {
                    "sent": "And as we move on, we need more and more complicated higher function spaces on top.",
                    "label": 0
                },
                {
                    "sent": "Now he is just a list of spaces which can be nicely treated.",
                    "label": 1
                },
                {
                    "sent": "So metric spaces, hyperbolic spaces in the sense of Kirk and rice cut zero spaces, were introduced by Gromov, Delta, hyperbolic space, again by Gromov.",
                    "label": 0
                },
                {
                    "sent": "Norm Space is uniformly convex spaces, Hilbert spaces, or kinds of other spaces, some.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Racism.",
                    "label": 0
                },
                {
                    "sent": "I am missing, so the question is what a?",
                    "label": 0
                },
                {
                    "sent": "What makes these notions nice compared to others?",
                    "label": 0
                },
                {
                    "sent": "Well, what makes him nicest?",
                    "label": 0
                },
                {
                    "sent": "They have an eczema tization, which has a monotone function of the mutation, which basically is its own monotone function adaptation.",
                    "label": 0
                },
                {
                    "sent": "So these notions have the proper uniformity built-in.",
                    "label": 0
                },
                {
                    "sent": "So what would be notions which do not have?",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Proper uniformity built-in, whereas I already mentioned separable spaces, so we have to 1st make them uniform.",
                    "label": 0
                },
                {
                    "sent": "But this essentially means to add a requirement of compactness.",
                    "label": 0
                },
                {
                    "sent": "Other classes where the enrichment is less severe is to consider strictly convex spaces.",
                    "label": 0
                },
                {
                    "sent": "Interesting results which hold already in the context of strictly convex spaces, but then the logical machinery would say well.",
                    "label": 0
                },
                {
                    "sent": "Make it a bit stronger.",
                    "label": 0
                },
                {
                    "sent": "Assume that the space is uniformly convex.",
                    "label": 0
                },
                {
                    "sent": "Then I can produce what you want, otherwise it will not be possible.",
                    "label": 0
                },
                {
                    "sent": "So this is just a mild.",
                    "label": 0
                },
                {
                    "sent": "There's no reasonable now important space which is strictly convex, but it's not at the same time uniformly convex, so this is a very mild there's of course.",
                    "label": 0
                },
                {
                    "sent": "Here this would be a drastic will basically rule out all banner spaces except finite dimensional ones.",
                    "label": 0
                },
                {
                    "sent": "Now even notions wear the uniform version, make some inconsistent.",
                    "label": 0
                },
                {
                    "sent": "So for example, take a statement, the space, the class of incomplete spaces.",
                    "label": 0
                },
                {
                    "sent": "There is no space which is uniformly incomplete.",
                    "label": 0
                },
                {
                    "sent": "One can show.",
                    "label": 0
                },
                {
                    "sent": "Fortunately, there are very few mathematical theorems.",
                    "label": 0
                },
                {
                    "sent": "Which start like taking incomplete space and the following is true, so it's so these classes here are more important.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good, So what one then does is, as I already mentioned, one closes up under these finite type hierarchy.",
                    "label": 0
                },
                {
                    "sent": "So 1 builds the functionals on top of these operators.",
                    "label": 0
                },
                {
                    "sent": "And then one formulates full arithmetic in all types on top of those.",
                    "label": 0
                },
                {
                    "sent": "So this is a good system with classical logic with quantifiers on top of now functionals, Witcher build up on these types here and then we just for the time being go extremely strong.",
                    "label": 0
                },
                {
                    "sent": "So we at the exome of Dependent Choice, which in particular covers countable choice of which in particular covers impredicative comprehension of a natural number.",
                    "label": 0
                },
                {
                    "sent": "Second order arithmetic is a subsystem here of this, so this was already again mentioned in.",
                    "label": 0
                },
                {
                    "sent": "And Uncle Ilecs talk that spectral succeeded using bar recursion to give an interpretation of countable choice.",
                    "label": 0
                },
                {
                    "sent": "And actually this interpretation also works for Dependent Choice, and this can be extended to this setting with these abstract spaces as well.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course, most proofs use only small parts of this, and then of course one has to add these specific constants and exams for the structure one is talking about, so it's a metric structure or some constant for pseudo metric and then XX stating that this is a pseudometric and then defining the quotient.",
                    "label": 0
                },
                {
                    "sent": "So to make this a metric space, and so on and so forth.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So then we want to extract uniform bounds.",
                    "label": 0
                },
                {
                    "sent": "So we need a notion of bound which works in each level of these function spaces now.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or just numbers.",
                    "label": 0
                },
                {
                    "sent": "It is clear the bound is X is a bond of Y if it's bigger.",
                    "label": 0
                },
                {
                    "sent": "In element in our Hilbert space is bounded by a number X.",
                    "label": 0
                },
                {
                    "sent": "If X is a bound on the norm of Y, this can be also applied in general metric spaces.",
                    "label": 0
                },
                {
                    "sent": "In general metric spaces we use or reference point and then measure the distance relative to a reference point like in the gram of product.",
                    "label": 0
                },
                {
                    "sent": "But I will not go into this for this talk today, but it's possible and actually then selecting the reference point cleverly like for example the starting point of some dynamical system and gives even additional uniformity.",
                    "label": 0
                },
                {
                    "sent": "And then this is extended to all higher types in the usual, handy Terry fashion.",
                    "label": 0
                },
                {
                    "sent": "I don't spell this out, it just give for the only case.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We need the definition, namely, if you have a self mapping from X to X, then a major rising object will be a number theoretic function F star, which Maps any normal upper bound for X into a normal upper bound for F of X, and so all the computation will take place on these major rising objects.",
                    "label": 0
                },
                {
                    "sent": "On this case, on Estar, which means our number theoretic functions, of which we have a perfect compatibility and complexity and whatnot theory, so we don't have to require hear anything like that.",
                    "label": 0
                },
                {
                    "sent": "Our Hilbert spaces some effective representation and that we know what it means to be a computable operator in.",
                    "label": 0
                },
                {
                    "sent": "From X to X, nothing of the sort.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now when the mapping is not expensive, which in the nonlinear case has to be expressed like this, so it's Lipschitz with Lipschitz constant one, then it's actually very simple to obtain such a major rising object.",
                    "label": 0
                },
                {
                    "sent": "We just need a bound on the norm of one element of F, for example of F at zero, and then the mapping and goes to N + B always is major.",
                    "label": 0
                },
                {
                    "sent": "And now if F is linear then of course F of 0 is 0.",
                    "label": 0
                },
                {
                    "sent": "So we can take B to be 0 and therefore the identity is actually measurement.",
                    "label": 0
                },
                {
                    "sent": "Now comes the point.",
                    "label": 0
                },
                {
                    "sent": "What monotone functional limitation is doing is to interpret the whole proof on the level of these major rising objects.",
                    "label": 0
                },
                {
                    "sent": "So the bound we obtained will be a computable device depending only on major guns.",
                    "label": 0
                },
                {
                    "sent": "Now, since all what we need about to know about F is a major run, then we can always take the identity we don't see if in the bond I mean, that's the point.",
                    "label": 0
                },
                {
                    "sent": "Of course, the major eyes X in general element X we needed bound on the norm of X because that's what major I.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Required, so that's exactly what.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This thing does so then extensional equality.",
                    "label": 0
                },
                {
                    "sent": "Equality is defined like this.",
                    "label": 0
                },
                {
                    "sent": "So we have actually a pseudo metric or normed space and then we defined here an equivalence relation and then of course the issue is.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To state as an axiom we would like to state that all functions respect this equivalence relation.",
                    "label": 0
                },
                {
                    "sent": "Now, if you would do this, this results would be grim false becausw the emitter theorem of the time we're going to prove would imply that all mappings between let's say bounded balls in non spaces are equi continuous with the same modulus of continuity and this cannot be.",
                    "label": 0
                },
                {
                    "sent": "So extensionality is a problem this already in theory could cause talk.",
                    "label": 0
                },
                {
                    "sent": "The emphasis on extensionality.",
                    "label": 0
                },
                {
                    "sent": "So what we will do is like in the dialectic interpretation we use a weak rule of extensionality.",
                    "label": 0
                },
                {
                    "sent": "So only if things are probably equal then we allowed to conclude that the objects respect this.",
                    "label": 0
                },
                {
                    "sent": "Fortunately, mathematical conditions normally guarantee that things are extensional.",
                    "label": 0
                },
                {
                    "sent": "For example, and an expensive mapping.",
                    "label": 0
                },
                {
                    "sent": "Of course always is provable, extensional, but that's not followed, doesn't follow form and equality axiom, but it's a mathematical consequence of the assault.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good.",
                    "label": 0
                },
                {
                    "sent": "So then to.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Gather with Phillip Karate in 2008 I published meter frames to the effect.",
                    "label": 0
                },
                {
                    "sent": "He is just a very special case for for what I need today.",
                    "label": 1
                },
                {
                    "sent": "If you have not a statement like we talk about some numbers or number theoretic functions elements in a compact space, then some starting point of some iterations and we have some mapping of which we take for example, this is our average of whatever this mapping is non expensive.",
                    "label": 1
                },
                {
                    "sent": "If you then prove an existential statement, there is always guaranteed that we get a computable bound which has exactly these features.",
                    "label": 0
                },
                {
                    "sent": "It only depends on major runs of X and measurements of F. And as I said, a measurement of F, it is sufficient to know.",
                    "label": 0
                },
                {
                    "sent": "Abound on this one point.",
                    "label": 0
                },
                {
                    "sent": "And if it is linear, even that disappears, and so this fully explains in mathematical terms why this was possible.",
                    "label": 0
                },
                {
                    "sent": "What we did in the mean aquatic theme.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In case.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here's a citation from Tao.",
                    "label": 0
                },
                {
                    "sent": "So he used.",
                    "label": 0
                },
                {
                    "sent": "He cited the work by Advocate Guardian Towson.",
                    "label": 0
                },
                {
                    "sent": "So he used this uniform meter stable version to generalize the meaner Goddess theorem to commuting families of operators.",
                    "label": 0
                },
                {
                    "sent": "So there's no mentioning of bonds in the result, but it's just behind the scenery.",
                    "label": 0
                },
                {
                    "sent": "In order to prove the result, the original meaner got experience for families of operators.",
                    "label": 0
                },
                {
                    "sent": "He uses this passage through the now counterexample interpretation.",
                    "label": 0
                },
                {
                    "sent": "And so it says we establish the ceiling by train experiment of green tower.",
                    "label": 0
                },
                {
                    "sent": "That's a famous Green Tao theorem for which tower.",
                    "label": 0
                },
                {
                    "sent": "Mainly kept the fields medal.",
                    "label": 0
                },
                {
                    "sent": "The main advantage of working in a finite every setting is that the underlying dynamical system becomes extremely explicit.",
                    "label": 0
                },
                {
                    "sent": "In proof theory, this finalization is known as Google Functional Interpretation, which is closely related to Kaizen account example interpretate.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, so now I will talk about current work and briefly and outlook for what I want to do.",
                    "label": 0
                },
                {
                    "sent": "So since 2000 we have many people have worked now using these tools.",
                    "label": 0
                },
                {
                    "sent": "More than 40 papers published and since normally you get a result which is directly readable to analysts, most of these results are published in journals like Nonlinear Analysis, Journal of Mathematical Analysis and so on and Be Cause the End product is again an ordinary functional analytic proof.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's one thing I want.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To convey here.",
                    "label": 0
                },
                {
                    "sent": "So now new frontiers are the following.",
                    "label": 0
                },
                {
                    "sent": "So what about if proofs use severely weak compactness where I showed in my contribution yet to this competition that there is a solution to of the monotone functional limitation of weak compactness and is of high complexity.",
                    "label": 0
                },
                {
                    "sent": "It has to be it uses body Kirchen and it elevates things 2 levels in the Google hierarchy of primitive recursive functionals, whatever.",
                    "label": 0
                },
                {
                    "sent": "This precisely means and recent work of a PhD student of Mine, Alexander Kreutzer has proven that this is optimal, so one.",
                    "label": 0
                },
                {
                    "sent": "To move up one.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It would not be sufficient.",
                    "label": 0
                },
                {
                    "sent": "Now I applied this to a nonlinear agatic therium, so by your proofed in 75 and nonlinear Agatic theorem.",
                    "label": 0
                },
                {
                    "sent": "So your drop just the linearity condition.",
                    "label": 0
                },
                {
                    "sent": "Then it's actually known to be false that strong convergence holds, but he proved that weak convergence holds and there is a quantitative version of this which uses iteratively two times this operator.",
                    "label": 0
                },
                {
                    "sent": "Here someone gets this rough bound on the first level of grilled cziraky, which is probably far from optimal, but at least that's what one get.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the other hand, in many special cases, BIOS result boils down to a strong convergence result in each of these cases, one so far obtained very elementary primitive recursive bounds of the type described before, so one result is due to Whitman.",
                    "label": 0
                },
                {
                    "sent": "Here one drops linearity but replaces the Cicero means by slightly distorted iterations of so called help an iteration, which, however, in the presence of linearity, coincides with its izaro means.",
                    "label": 0
                },
                {
                    "sent": "So it's a nonlinear extension.",
                    "label": 0
                },
                {
                    "sent": "Therefore, of the phenomenon feeling so, I extracted an elementary bound for this recently, and this appeared in advances in math math.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Six in 2011.",
                    "label": 0
                },
                {
                    "sent": "Again, recently a PhD student of mine, Pavel Cephalic, treated another result which was first proved by by Jan 76 and generalized by again by Whitman about operators.",
                    "label": 0
                },
                {
                    "sent": "So here you keep.",
                    "label": 0
                },
                {
                    "sent": "This is our home means, but we add a little bit of linearity, so you require that the operator, rather than being linear, is odd Now this was further generalized by victim into actually very nice condition and this results of Whitman was analyzed by Safari Candy Garden primitive recursive bound.",
                    "label": 0
                },
                {
                    "sent": "On that version of a strong nonlinear agatic.",
                    "label": 1
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ceiling.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "You get fussy about how.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but how primitive?",
                    "label": 0
                },
                {
                    "sent": "Because if they normally they are of the kind you have one iteration of the counter function, so if they counter function is the successor function, it's already an important case.",
                    "label": 0
                },
                {
                    "sent": "Then you get actually a linear bound and sometimes you get a polynomial bounded when it depends, they just typically elevates things one level into Georgia Cairo key.",
                    "label": 0
                },
                {
                    "sent": "So you start with the counter function G and then typically use the other examples.",
                    "label": 0
                },
                {
                    "sent": "We have polynomial bounds across the board if no.",
                    "label": 0
                },
                {
                    "sent": "Sequential compactness is basically used.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So, so this is what I want to investigate it.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "General.",
                    "label": 0
                },
                {
                    "sent": "Dichotomy result of this sort that whenever you prove strong convergence result, even if it uses weak compactness and whatnot, it somehow can be eliminated because it what actually happens in these posts, it could not be so far illuminated in BIOS original result, but that is a result which in itself states of the convergence result.",
                    "label": 0
                },
                {
                    "sent": "But if the result is strong, convergence with that, is it possible to elementor eyes approve always?",
                    "label": 0
                },
                {
                    "sent": "So that's one question and you say.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We did see him explaining this.",
                    "label": 0
                },
                {
                    "sent": "Now another topic which is very active is to use banner limits in this business, because people actually generalize this type of functional analysis in their God theory to these hyperbolic spaces I mentioned, like at zero spaces of come off in this space.",
                    "label": 0
                },
                {
                    "sent": "If you don't have a linear structure, so it doesn't make sense to talk about linear operators and therefore not about weak compactness, so people instead use Banach limits.",
                    "label": 0
                },
                {
                    "sent": "Nobody limits you some substantial amount of the axiom of choice.",
                    "label": 0
                },
                {
                    "sent": "It's not covered yet by the existing meter programs.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nevertheless, we just.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Analyzed.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Only together Florencia last Jan approve of.",
                    "label": 0
                },
                {
                    "sent": "Whitman theorem for cat O Spaces, which is was proven last year by CR Chung using Banach limits and it turned out this banner limit could be illuminated.",
                    "label": 0
                },
                {
                    "sent": "Vanity mirrors used only on some financial recombinant Oracle business, and there could be first illuminated in terms of arithmetic comprehension later even there are many comprehension could be illuminated.",
                    "label": 0
                },
                {
                    "sent": "So we've got actually in some sense and more elementary proof than their proof using the compactness for the Hilbert case was and essentially we have a primitive recursive bound, we have just write down the details, but the elimination has been already achieved.",
                    "label": 0
                },
                {
                    "sent": "So question is a general meter theorem that which tells us this is always possible if you have a convergence result of this type and it's proved using bandwidth limits and somehow the banner limit is some machinery which is used for convenience, but it can be systematically.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Turn it off.",
                    "label": 0
                },
                {
                    "sent": "Finally, what about Ultrapowers?",
                    "label": 0
                },
                {
                    "sent": "Can one treat other powers of metric structures?",
                    "label": 0
                },
                {
                    "sent": "It's also often used in this context.",
                    "label": 0
                },
                {
                    "sent": "There already results of again, Alexander Carlson, PhD student of mine, to the extent that this is.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Possible.",
                    "label": 0
                },
                {
                    "sent": "And then finally, so far I talked about rates of metastability.",
                    "label": 0
                },
                {
                    "sent": "Of course it would be even nicer to have real rates of convergence.",
                    "label": 0
                },
                {
                    "sent": "Now this is often blocked by speakers result fuse classical logic, but in many cases it turns out of all the proof first seems to be ineffective.",
                    "label": 0
                },
                {
                    "sent": "It turned out that there was is actually possible to get effective rates of convergence.",
                    "label": 0
                },
                {
                    "sent": "Important classes are there when his monotone convergence or the uniqueness of the limit is involved or recently proved results together with a student of Mine Kern Line.",
                    "label": 0
                },
                {
                    "sent": "For so-called pseudo contractions, which play an important role for partial differential equations, this is a far reaching extension of the class of nonexpansive mappings, and there was a proof that something converges which was highly ineffective, it seemed, but we actually got a rate of convergence.",
                    "label": 0
                },
                {
                    "sent": "Another rate of metastability by the rate of convergence.",
                    "label": 0
                },
                {
                    "sent": "So question is a general logical media theorem.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For such classes which says or classifieds one this is to be expected.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Will be possible and finally to find new areas for proof mining.",
                    "label": 0
                },
                {
                    "sent": "Since I mentioned already these hyperbolic spaces, Godzilla spaces out reason song they ever used by Gromov in the context of the program of geometric group theory, so are their main statements which are genuine interest to people working in this area.",
                    "label": 0
                },
                {
                    "sent": "Different statements not like stability results of aquatic systems, but algebraic statements to which these machinery's could be applied as well.",
                    "label": 0
                },
                {
                    "sent": "What about partial differential equations?",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Histology bars and song.",
                    "label": 0
                },
                {
                    "sent": "And finally I want to close with some big questions because we know that the questions are important for the research.",
                    "label": 0
                },
                {
                    "sent": "Funded by the Templeton Foundation, and rightly so, so here's a question.",
                    "label": 0
                },
                {
                    "sent": "Is there any mathematical principle whatsoever?",
                    "label": 0
                },
                {
                    "sent": "For which there is substantial obstacle in doing this, so you have a proof of some combinatorial meaningful statement, some convergence statement.",
                    "label": 0
                },
                {
                    "sent": "The proof uses this principle, and it's somehow impossible to get any meaningful combinatorial content.",
                    "label": 0
                },
                {
                    "sent": "Any principle other than extensionality, because extensionality is such a statement because as we know from Howard, even very simple instances of extensionality in itself simply do not have a similar Frankel definable solution or functional reputation.",
                    "label": 0
                },
                {
                    "sent": "So this was the only thing which we ruled out, so we have to be careful about extensionality.",
                    "label": 0
                },
                {
                    "sent": "By the way, in.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Result of safaric.",
                    "label": 0
                },
                {
                    "sent": "There is no extensionality wasn't given the condition of Whitman is so general that the condition no longer implies that the operators continuous even.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, using the rule of extensionality, one could get through here and it was still the case that the identity measure rises.",
                    "label": 0
                },
                {
                    "sent": "Sotc meter is not the smoothness of the operator, but it's the niceness of the measurement.",
                    "label": 0
                },
                {
                    "sent": "So the function can be horrible as long as a measurement is nice, and as long as extensionality is used only in this week setting.",
                    "label": 0
                },
                {
                    "sent": "But we have to be careful about this, otherwise they're counterexamples all over the place.",
                    "label": 0
                },
                {
                    "sent": "So question is there any other principle one has to be equally careful about?",
                    "label": 0
                },
                {
                    "sent": "Or is it just a matter of you know, further pushing?",
                    "label": 0
                },
                {
                    "sent": "Things to treat.",
                    "label": 0
                },
                {
                    "sent": "I mean, today banner limits to Molitor Powers and what not functional analysts use in the years to come, thanks.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much and we have 4 * 4 questions.",
                    "label": 0
                },
                {
                    "sent": "With regard to this last issue of.",
                    "label": 0
                },
                {
                    "sent": "You know this example I keep coming back to of mine where I exploit bozzano via straws and ask for the estimate to be a little different than normal and then it blows up the ackermann's function yes.",
                    "label": 0
                },
                {
                    "sent": "How would you classify that it turns your last question.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but but obstacle.",
                    "label": 0
                },
                {
                    "sent": "I mean of course, and Ackerman bound is not an obstacle.",
                    "label": 0
                },
                {
                    "sent": "If that's the complexity then then then then that's what it is.",
                    "label": 0
                },
                {
                    "sent": "An obstacle I mean is to say there is absolutely no meaningful computational rendering of this statement.",
                    "label": 0
                },
                {
                    "sent": "Now with respect to the Bolzano vanish classes, we have results of the that's actually very interesting results of the following form.",
                    "label": 0
                },
                {
                    "sent": "So I proved along time ago.",
                    "label": 0
                },
                {
                    "sent": "If you work in very weak systems, roughly corresponding to RCA, not star, and use just a single instance of both sunrise or sequence of instances, then it only gives primitive recursion.",
                    "label": 0
                },
                {
                    "sent": "Nobody your example does is to smuggle in an iteration of that both on the wash trusted to combine it with Sigma, one induction that then gives the Ackermann function in principle, but most of the applications and ordinary mathematics of the form that is a single use now.",
                    "label": 0
                },
                {
                    "sent": "Actually, in most of these results, one needs only the bird sound advice.",
                    "label": 0
                },
                {
                    "sent": "Trust in the following week version named to say there is a subsequence which is cool she not fast 'cause she just 'cause she it is in some sense an artifact of reverse mathematics.",
                    "label": 0
                },
                {
                    "sent": "It's about some of our class is equivalent to automatic comprehension because one insists on the course sequence to be fast because the real numbers are represented as fast code causing sequence and therefore to say there is a limit means to have a fast course sequence.",
                    "label": 0
                },
                {
                    "sent": "Now if you weaken the statement to say there is a cautious sequence, just focus on sufficient in these ergotic theory then caught so recently showed that the principle is equivalent to the cohesiveness principle.",
                    "label": 0
                },
                {
                    "sent": "Cohesiveness studied in the context of Ramsey theorem for pairs in the cohesiveness principle remains conservative over PRA.",
                    "label": 0
                },
                {
                    "sent": "If an AIDS is to RCA not.",
                    "label": 0
                },
                {
                    "sent": "So if an ad to RCA not full.",
                    "label": 0
                },
                {
                    "sent": "Bolzano watch 'cause as often iterated as one wants, but in this version, namely saying there's only.",
                    "label": 0
                },
                {
                    "sent": "Of course, the subsequence rather fast converging then it still is conservative over primitive recursive Arma tick, and I suspect that this accounts for this empirical finding that despite of the fact that analysts use sequential compactness all over the place, one rarely sees if at all common type of bonds.",
                    "label": 0
                },
                {
                    "sent": "Another project would be is this tool for V. Compactness is a tool that to say every sequence in a unit ball in Hilbert space has.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "I mean you have a weak Cauchy subsequence without a rate, just coaches subsequences that also as weak as a cohesiveness principle.",
                    "label": 0
                },
                {
                    "sent": "So that would be OK.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "We have to close because we're way behind the schedule and piano is going to come here back, and so on and so on.",
                    "label": 0
                },
                {
                    "sent": "So thank you all very much for this for being here.",
                    "label": 0
                },
                {
                    "sent": "Thank you, Monty's for organizing this first session such a way and thank you.",
                    "label": 0
                },
                {
                    "sent": "Excellent lecture.",
                    "label": 0
                }
            ]
        }
    }
}