{
    "id": "ivtt5du3hhjgm5fgjpcngqedar2cgkef",
    "title": "Administering A 160-year-old Database Knowledge Management At The New York Times",
    "info": {
        "author": [
            "Evan Sandhaus, New York Times"
        ],
        "published": "Jan. 31, 2012",
        "recorded": "January 2012",
        "category": [
            "Top->Business->Management->Knowledge Management",
            "Top->Computer Science"
        ]
    },
    "url": "http://videolectures.net/solomon_sandhaus_administering/",
    "segmentation": [
        [
            "Thank you so much for having me here.",
            "I, I and both my myself personally in the New York Times generally are really excited to be part of the X like project.",
            "That's going to be kicking off tomorrow.",
            "I apologize for keeping you all waiting.",
            "I was visiting a friend in Venice yesterday and I thought it would be fun to drive.",
            "So I left Venice at 9:00 AM this morning and I figured that would be plenty of time to get to Ljubljana, but I got a flat tire so I had to and I don't speak Italian so I got to have a.",
            "Sort of cross cultural, you know.",
            "Experience why headed?",
            "Had to show adaptability.",
            "The hardest part was finding an ATM in the small town that they dropped me off at so I could pay the tow truck driver, but I'm here now.",
            "I got here at 1:01 so I apologize if I if I talk fast.",
            "My endorphins are kind of rushing right now because it was an exciting afternoon but I want to talk to you today about some of the cool stuff we do with data.",
            "At the New York Times Company, I've titled this talk administrator, 160 year old database because this year actually late last year in September of last year, the New York Times turned 160 and we've been publishing a daily paper almost the entire period in between 1851 and today, although in the earlier we didn't publish every day of the weekend.",
            "That being said, I want to talk to you about some of the things that we've historically done to make this database useful, and things that we have done more recently to build upon this work so."
        ],
        [
            "And by way of it, by way of introduction today, I'm going to start out by telling you the story of our first semantic technology.",
            "If any of you were at the SWC or sorry, the Semantic Technology conference in 2009, you will recognize this story.",
            "If then after that I'm going to talk about some work we've been doing in linked data, and then I want to follow that up with some brief remarks about some recent work we've been doing in the space of semantic markup.",
            "If we have time, and then of course I want to leave time for your questions because I want to tell you what's interesting to you.",
            "So Mark, how much time do we have?",
            "One hour for excellent?"
        ],
        [
            "So just a quick word by way of introduction about what the New York Times Company is.",
            "the New York Times Company is a global company that holds a bunch of different media brands.",
            "Of course, probably the two 2 most globally known are the New York Times itself and the International Herald Tribune, which is a publication of the New York Times.",
            "New York Times also has a group of couple of newspapers in New England, including the Boston Globe, the finest newspaper in Boston and.",
            "We recently sold our regional media groups for this slide needs to be updated and we also have the about group, which is which includes about.com and a set of related companies to about.com.",
            "So that's the New York Times in a nutshell.",
            "I forgot.",
            "I forgot that I don't know the latest stats, but as far as American media companies go, this portfolio of brands has a very significant web presence when you add it all together so they."
        ],
        [
            "It's the New York Times Company and me.",
            "Let me tell you a little about me.",
            "I work in the New York Times, features research and development group is Marco said, and our mission in research and development is to monitor trends and technologies with the potential to disrupt or impact the news industry in the three to five year timeframe.",
            "So we're always looking for the next big thing in terms of technical developments.",
            "And then it's our job not only to identify those trends, but to try to try to take advantage of them to build prototypes using some of the technology that's pointed to by these trends.",
            "And then to show these prototypes to folks throughout our organization and try to get them into operations where appropriate.",
            "So my role in research and development is I am the leader, architect, first, semantic platform.",
            "So the area I focus most closely on is what we can do with sort of emerging practices in knowledge management.",
            "And my talk is going to focus on."
        ],
        [
            "Couple of those so I said I would tell you the story of our first semantic platform, so I want to start by doing that.",
            "Who wants to guess when we launched our very first semantic platform at the New York Times was at hand.",
            "I San Marco.",
            "Probably won't say 1981.",
            "Alright, the answer is."
        ],
        [
            "1913 in 1913 we released our first semantic product and it was called the New York Times Index, and it has kind."
        ],
        [
            "Interesting story you see in in those days around 1913, the New York Times was just one of many New York City newspapers on the day the Titanic sank.",
            "You could have chosen to read about, read about it in about 20 different English language publications and several others in different languages.",
            "So the media landscape in New York in that time period was very."
        ],
        [
            "Very crowded and so.",
            "It was with pretty substantial relief that the publisher of the newspaper at that time, a gentleman named Adolph Ochs, was able to lure away the manager of another newspaper.",
            "His name was, I believe, William Siraiki, and make him essentially his executive vice."
        ],
        [
            "President and in those years that he worked at the New York Times.",
            "He was sort of our publishers right hand man and among other achievements.",
            "He helped forge a partnership with an Italian inventor by the name of Marconi to broadcast our news for the first time overseas."
        ],
        [
            "Using what was then called wireless."
        ],
        [
            "Unfortunately, in that the publisher an Mr. Reich eventually parted ways in 1912, and Mr. Reich went to go run a rival newspaper which caused our publishers some consternation because he all of a sudden not only was it competing against all these, you know these 20 different newspapers in just the English language.",
            "But he also now had to compete with the newspaper that was run by a gentleman who knew everything he wanted to do so to remain competitive in this fiercely competitive landscape.",
            "He introduced 3 new products in 1913, the 1st."
        ],
        [
            "Product was called the analyst.",
            "It was a quarterly magazine of finance, so it was a weekly magazine, finance, finance, Commerce and economics that was targeted in the gendered language of the time.",
            "For the."
        ],
        [
            "Businessman.",
            "He also introduced a periodical quarterly periodical called Current History which focused on longform reporting, supplemented by what was then the emerging field of photojournalism and the last."
        ],
        [
            "New product that our publisher introduced with something called the New York Times Index and the goal behind the New York Times Index was that too.",
            "That that our publisher wanted to position his paper as the resource that future generations would refer back to when it became necessary to investigate some specific point in history and."
        ],
        [
            "I'm not going to say that the New York Times, yes, an when the New York Times Index was first launched, you could buy it for $8.00 a year, bounding cloth or slightly more if you wanted a fancy let."
        ],
        [
            "Version strangely, in the years immediately following the release of the index, a number of articles appeared in the New York Times talking about how great the index was."
        ],
        [
            "So the index has continued to operate at the New York Times and it is still around today, 98 years after it was, it was first introduced.",
            "Now I'm not going to tell you that metadata and semantic technology saved the New York Times 100 years ago, but."
        ],
        [
            "It is interesting that we're the only major New York City National Paper still in existence."
        ],
        [
            "So.",
            "That is, that is the sort of introduction to the New York Times index.",
            "And just to say a couple of words more about it, the New York Times Index started out simply as an internal business practice of the New York Times back in the early days of newspapers.",
            "A newspaper is competitive advantage was to a large part determined by the quality of research that could bring to bear on its on its stories.",
            "So in order to in order to use the paper for that purpose.",
            "The New York Times actually internally indexed it, and this is a picture of a handwritten index from the first years of the."
        ],
        [
            "Paper.",
            "The index was eventually more systematized and the way it went in the way.",
            "That we managed this data was we had a staff of people whose job it was to clip out articles from the newspaper, assign them to specific subject headings, write a summary and then file them away."
        ],
        [
            "Eventually we we started publishing the New York Times on microfilm.",
            "In the 1960s, I believe, and we began, so that was in the 1930s, and we began to release the index so that folks could use it to find what they were."
        ],
        [
            "King for the microfilm.",
            "In the 1970s we digitize the index, and we made it available as our very first online service.",
            "We announced that service in 1968 and we launched it in the early 70s and it was a system where you could dial up into our mainframe computer and search our index of that way, which was really cool because it's very difficult to do Boolean queries in a printed index.",
            "So if you want to find two things, an article, it's about two things you kind of need, an online index, and apparently the machine that it was run on, which is the one behind that gentleman.",
            "Was operated by."
        ],
        [
            "That guy and we continue today with our tradition of indexing and tagging and high quality metadata at the New York time."
        ],
        [
            "Times, and that takes 2 forms.",
            "Today we continue, perhaps somewhat surprisingly, to publish a print index that we that we sell to the to the reference library sector.",
            "And we also.",
            "Index articles online as they go onto the."
        ],
        [
            "Website, so both of those processes are still very much part of the way.",
            "the New York Times does business, and on a sort of on a practical level.",
            "What that means is that every article that we've ever written, it's associated with keywords draw for controlled vocabulary of people, places, organizations and descriptors.",
            "An I have examples up here.",
            "A descriptor might be something like burritos or Exxon Valdez.",
            "Location, of course, is a place a person is self evident in organization.",
            "Is both for profit companies publicly traded companies as well as government organizations and institutions of higher learning so that those are the different types of metadata that we associate?"
        ],
        [
            "With our articles and it is not an inconsiderable investment for us to do this.",
            "We have a probably about 60 people every day they are involved in one way or another with tagging our content.",
            "It's really important to us to have this high quality metadata, and the reason we tag is because it powers a lot of services on nytimes.com that, other than that, other organizations, aren't able to provide 'cause they don't have the same high Fidelity metadata that we do, and those services include news alerts.",
            "They let us.",
            "Automate editorial practices like past coverage of events related to the story you're currently reading.",
            "We can give you really high Fidelity feeds and terms of RSS in syndication, and we also are able to indicate this data towards you know into other platforms in a in a way that's targeted to make sense for those audiences so.",
            "You might say, well, you could do a lot of this stuff using keywords and to an extent that's true, but it's very difficult for almost any other organization before besides the New York Times to give you two different RSS feeds where one contains only articles about the fruit and the other one contains articles about the company Apple, so we are able to do that because of this real because of this institutional dedication to manually tagging all of our content assets."
        ],
        [
            "Another reason that we do it is that we have this section of our site called Topic Pages which includes about 27,000 different pages that bring together our coverage of individual topics that are addressed in various stories in the New York Times and this enables us also to offer a service that our competitors aren't really well positioned to offer, so that is indexing at the New York Times and now I want to talk about how we've taken that work to the next level through the application of the principles of length data.",
            "But before I do that, are there any questions?",
            "About the indexing process at the New York Times.",
            "Alright, the so."
        ],
        [
            "Lake Data is is sort of an emerging practice and knowledge management that's motivated by the fact that as you can see from this helpful illustration, the Internet is a very confusing place.",
            "It is a place of competing standards, different for different ways of identifying the same data and different approaches to storing and retrieving that data.",
            "So even from the perspective."
        ],
        [
            "Of a relatively relatively straightforward concept like Barack Obama, the president of the United States, the web can be a confusing place, brah."
        ],
        [
            "Obama is known in the New York Times Archive as far as Obama, Barack Piyar, knowing that in our database lets you retrieve all of the articles we've ever set we've ever tagged as being about Barack Obama."
        ],
        [
            "However, other databases like Wikipedia, he is referred to as Barack_"
        ],
        [
            "Obama and the Library of Congress.",
            "He's referred to as 00016."
        ],
        [
            "In Amazon, that is his author."
        ],
        [
            "D That is his Twitter."
        ],
        [
            "Handle that."
        ],
        [
            "This is YouTube account that is his that his author ID on."
        ],
        [
            "ITunes and this is his Facebook account, so as you can see we have this one entity.",
            "But because of the way data is stored and retrieved on the web right now, this one entity is known by all these different identifiers and it's a shame that they're not all linked to one another because were they you could do some really interesting aggregations across different databases that let you know more about these things.",
            "So that is the idea behind linked data is that it is that.",
            "You are able to is to identify the strong identifiers that refer to the same real world thing across multiple databases on the web, and we decided the New York Times that we wanted to this was an interesting trend with a potential to enable us to do new things with the way that we aggregate present content.",
            "So we decided to do an experiment to see if this link data stuff was going to workout for us an as."
        ],
        [
            "I mentioned earlier we have these topic pages in these topics."
        ],
        [
            "Pages contain a list of articles that are generated with queries that look a little bit like that, and these queries the topic pages that I mentioned.",
            "There's about 27,000 of them, and."
        ],
        [
            "If you pop the if you pop the hood on the queries beneath the topic pages, we use a total of about 29,000 unique tags to generate those 27,000 pages.",
            "And since these are the tags we've decided to invest the energy to create topic pages around, we thought they would be a good place to start.",
            "Our exploration of linked data."
        ],
        [
            "So what we did?"
        ],
        [
            "Was we started to."
        ],
        [
            "We took this list of about 29,000 tags and we started to map them to other databases.",
            "Specifically, we aligned our tags with Wikipedia.",
            "The strong identifiers from Wikipedia, namely their URL on the site, and we also aligned our geographic tags with records from a database called Geo Names, which is this nice database of geographic metadata, and once we knew how are tags lined up to Wikipedia, we align them.",
            "We could automatically align them to two other databases called DB Pedia, an Freebase, just one quick word about the presence of Wikipedia.",
            "On this slide.",
            "There are some in the news world for whom Wikipedia is a somewhat nervewracking phenomenon because it doesn't have any guarantee of accuracy or or correctness.",
            "I mean Wikipedia, in my experience is almost is generally right on a whole, but at any one point is tends to be had.",
            "To be riddled with controversies in minor errors, but we're not using Wikipedia in this in this in this link data work for the fax that asserts about things, but rather building on the fact that Wikipedia has given a unique name to a bunch of different things, and the only the only thing we're supposing about Wikipedia in this in this in this work is that Wikipedia, if there is a name for a thing on Wikipedia, it's probably a thing.",
            "That's the only that's the extent to which we're relying on Wikipedia, and I'm not suggesting that it isn't a wonderful resource, but it's not always the.",
            "Write resource for Journal you know for journalistic organizations to build around."
        ],
        [
            "So.",
            "Let me say a little bit about these other databases that we've mapped to, so we have this.",
            "We've been mapping our tags this database DB pedia.",
            "And for those of you who might not be familiar with it, DB Pedia is a project that started at the University of Leipzig and the Free University of Berlin and they and the idea behind DVD."
        ],
        [
            "Wikipedia has these really cool information boxes on a bunch of different articles, and it is the case that there is quite a bit of useful information for a lot of different things.",
            "However, the way Wikipedia stores this information is basically glorified HTML.",
            "There's not a database behind Wikipedia that generates these information boxes, so using Wikipedia by itself you can't do interesting bits of retrieval like show me all of the cities in Slovenia with the population between X&Y.",
            "That's not possible using Wikipedia by itself, so the folks at these two universities build a system for scraping this information out of the Wikipedia infoboxes and dating data, basing it using semantic web technologies, and then make it accessible through a partnership with Open Link software to the web making it queryable so people can take advantage and reason around the information that's in Wikipedia, so that is."
        ],
        [
            "Freebase I've started DB Pedia and DB pedia.",
            "Last I checked I'm sure these numbers have gotten larger since I made this slide.",
            "Had about 2.6 million entities for which there were facts broken down into these categories and perhaps even more importantly there about 4.9 million links in DB pedia that point to other databases.",
            "So if you know how your thing aligns to DB pedia, there's a good chance DB pedia will tell you how it aligns to a bunch of other databases around the web."
        ],
        [
            "Another company that we have.",
            "Another database that we have mapped RR tags to is Freebase which aside from being one of the most one of the most questionably named companies on the Internet, has a tremendously useful database of entities that covers about 11,000,000 total topics.",
            "They sort of started from the same place that DVDs started getting information about the topics on Wikipedia, and have since expanded on that.",
            "In fact, I'm told that that 11 million topic number is somewhat out of date now that it's gotten quite a bit larger.",
            "Freebase was contrast Freebase with DB pedia.",
            "Freebase provides I feel a better platform for developers to build actual systems and services on top of DB.",
            "Pedia is great for research but the public facing services that I've used around it tend to be insufficient for this sort of loaded Commercial Services.",
            "Going to subject them to that being said, Freebase was acquired in the summer of 2010 by Google and his.",
            "Subsequently been folded into their operations, but it continues to be freely available.",
            "It continues to be maintained that continues to be very valuable research for folks.",
            "Resource for folks doing Lee."
        ],
        [
            "Data work, the last database that we've aligned our vocabulary two is geonames.",
            "Geonames is a huge database of place names which has geographic metadata for about 8 million different places."
        ],
        [
            "And fairly good global coverage.",
            "That's a little heat map of all the different places they have information about in their day."
        ],
        [
            "Database, so in order to get our tags align with these databases, we built a tool for what I should take a step back and say we have a couple of folks working for the New York Times website whose sole job is to maintain the indexing vocabularies we use on our website.",
            "So there basically the world experts in these vocabularies.",
            "So what we did to experiment with linked data was we built a tool for them and it looks like this that shows that shows them.",
            "The Wikipedia article on one side and our coverage on the other.",
            "And a proposed mapping between two tags at the top, and if that mapping is correct, they click the little check box, the mapping its database.",
            "Do we move on to the next tag?",
            "There are this tool also gives you the ability to reassign to change the mapping if it's not correct in to search for the correct mapping if it's not in the drop down list of suggestions and using this tool, we've mapped quite a number of our tags to."
        ],
        [
            "To Wikipedia and also we use a slightly different tool for mapping to geonames.",
            "It's the same general principle, but here instead of showing you the alignments between the Wikipedia article in the end and the New York Times articles, we plot out the.",
            "The suggested places from Geonames on this map and our vocabulary expert select the proper location that corresponds to our tag so."
        ],
        [
            "Going through that process, we've manually mapped again.",
            "I apologize these numbers need to be updated about 15,000 of our tags to DB pedia.",
            "Freebase angio names so we have a pretty nice collection of links data now that we can start to build on."
        ],
        [
            "And we also realize that as great as the people that we have working at the New York Times R, we can't be the sole source of innovation in this space.",
            "And it would be sort of out of the spirit would sort of not be in step with the spirit of the linked data community to keep all these links to ourselves.",
            "So about 2 1/2 years ago now we released the first round of mappings that we did with linked data.",
            "Actually, it was a year and a half ago, I apologize.",
            "To this website that we maintain data dot nytimes com inundated out of my times com you can type in you can basically get semantic information about the tags that we've mapped so far in semantic web friendly formats like RDF."
        ],
        [
            "The nice thing about davidnytimes.com is that all of the data that we provide on that site is covered by a Creative Commons Attribution license.",
            "So folks who want to take advantage of the work that we've done aligning over Cabul Airy to other vocabularies, need to only give us credit for doing the work and don't need to worry about any further licensing issues around."
        ],
        [
            "Data we also much more recently a couple of months ago, actually last month released our Semantic API's which are Restful web services that return XML or Jason standard sort of web web services stuff.",
            "About that let's you that also relates to this link data work.",
            "We have both a semantic API Anna Geo API now and our semantic API lets you look up A tag by its name or also its UI on data.",
            "My times com every single tag on datadata.nytimes.com is assigned a unique identifier.",
            "You could look at it.",
            "You can look that identifier up using this service.",
            "You can also search for A tag by name.",
            "So if you want to find all of the tags that you know say contain the word Slovenia, you could do that and you could also look up.",
            "Buy article so if you want to see all the tags that correspond to the given article, you can push the article into this service and we give you that they give you those back.",
            "Of course this service will also return to you the mappings between R tags and and the the other databases that we've mapped to along with some other information for four descriptors.",
            "For instance, we've internally made a little taxonomy that relates are descriptors to each other so you can see stuff like.",
            "This term is a broader term than this term or this term has an arrow or term and it's this.",
            "So those are the various things that are returned by the semantic API.",
            "We also have a Geo API that's based on this link data work, and it lets you query our Geo codes by various criteria so you can query query them by any geonames criteria.",
            "So Geonames data about the places has stuff like the population of this place is X, the elevation of this place is Y and you can submit queries to say like show me all the cities the New York Times is written about with the population between X&Y, or show me all the cities New York Times is written about that are in Italy.",
            "Those sort of queries can be handled by this API.",
            "You can also submit a bounding box query so if you have a map, if you have a map open in a viewport, you can say this is.",
            "This is what's visible to the user on this map.",
            "Give me all the places in the New York Times is written about that fits inside that viewport.",
            "And Lastly you can do a nearby query using that geographic API which we think is pretty cool.",
            "We think it will enable folks to build interesting location based experiences around New York Times content because using this API you could do something like build an iPhone app or an Android app.",
            "Where you push a button and say I want to know what's happening near me and we can use this API to query into our.",
            "You can use this API to query into our archive by geography.",
            "Now to be fair, our geography geographic terms are much more granular in NYC than anywhere else, but they still give you a fairly good sense no matter where you are, so those are the various services we've built."
        ],
        [
            "On top of our linked data that we have built using the linked data that we have been acquiring for the last couple of years and before I go on to tell you what we've learned from this experience, I'd like to ask again if there are any questions.",
            "Alright, so we've been doing this link to work now for a couple of years and we have learned a new."
        ],
        [
            "Number of lessons.",
            "Through this work, the first of which is that link data helps with three things.",
            "Adding ontological context.",
            "Automating our data alignments and it gives us a platform for doing non traditional aggregations.",
            "Link data is however not a silver bullet.",
            "There are areas that we would like to see improvement in on the link data front.",
            "One is community interaction.",
            "We release this data on data.nytimes.com a couple of years ago and people were very positive about the fact that we had done this, but we haven't seen this sort of uptake that we would have liked with this data.",
            "That being said, we have we believe that the APIs are going to see a much bigger uptake than the than the stuff we released on data nytimes COM.",
            "Simply because you don't have to know thing one about semantic web technologies to use our API's.",
            "Where is the day today today?",
            "My times.com, while valuable, has a pretty steep learning curve to be useful to somebody.",
            "So I have been carefully monitoring the number of registrations on the APIs since we release them.",
            "In early December, and although I'm not allowed to discuss the specific numbers, I can tell you all the time.",
            "Happy with the numbers that I'm seeing so people are signing up for these API's and people are using them, so that is that is a good story.",
            "And another area, and I alluded to this earlier when I discussed Wikipedia, is issues of data accuracy.",
            "A lot of these link data sources are still our community curated sources, so the data can be modified by anybody and not everybody modifies the data accurately, so there is a concern about how an organization like the New York Times, or really any other news publication can use, can rely on this kind of data to do interesting work, while at the same time.",
            "Not sacrificing the public's trust in the authority of what it says, so that's another issue an I don't purport to have an answer for, but it's an issue that comes up when you start doing this kind of work so."
        ],
        [
            "To elaborate on what I mean by some of the things that we've learned in this, yes.",
            "So you said."
        ],
        [
            "Accuracy is the problem.",
            "Are you?",
            "So you can map.",
            "I know all your persons to Freebase.",
            "Have you done checks of how many?",
            "I know birthdays deferred and stuff like that and have you tried to push out your stuff out to the?",
            "That is a wonderful suggestion.",
            "We have not right now.",
            "We are more focused on just getting the alignments and I take your point.",
            "It would be helpful to do an assessment of our own to get a sense for how accurate things are.",
            "I get a sense that the problem is not that the problem, I think though, is not so much that there might be some in accuracies.",
            "It said those accuracy those inner accuracies might change day by day, so you know you might get one thing right and then another thing might change to something that's not correct.",
            "Somebody might do something.",
            "Uh, not entirely ethical to somebody's, you know, account for one reason or another, and so those are things that you have to watch out for."
        ],
        [
            "So.",
            "I want to go onto a little more detail about some of the benefits that we've we've we've seen from this linked data work.",
            "The first is that help us add ontological context, and that's."
        ],
        [
            "A fancy way of saying that it helps us better understand how our data relates to itself.",
            "So to give you a specific example about away Geonames helped us address a technical problem that we faced."
        ],
        [
            "We have, as I mentioned earlier, RSS and email services and they both basically work in the same back end when a new one article is tagged about being a new talk about being a new topic, it's sent out over the feed or get sent out."
        ],
        [
            "As as an email and one of our feeds that you can sign up for is Italy, the country in which I got a flat tire this morning."
        ],
        [
            "And whenever we write a new article about Italy, it gets duly tagged an an email or RSS feed item goes out and the user is."
        ],
        [
            "However, it is our longstanding practice to target to tag an article at the most specific level possible.",
            "So for article is about Rome, even though Rome is in Italy, it will get tagged as being about Rome and not as being about Italy."
        ],
        [
            "So as a consequence, our user won't get the email and they're going to mix miss out on some of the some of the data that is relevant to their information need."
        ],
        [
            "So.",
            "Through the link data work we've been able to through our mapping at geonames make simple queries like show us all the places we write about that are in Italy and we can use that information now to augment the quality of these feeds.",
            "An this is just a small example of how links data can help us offer better, more accurate services that are both more comprehensive because it provides us with the context that we didn't previously have.",
            "So that's one example of how link data helps because it can."
        ],
        [
            "Add context, another example that link data of what like data can do.",
            "That's positive for our organization is it helps with automatically aligning data.",
            "We produce a lot of APIs at nytimes.com.",
            "We encourage you to check out our developer pages at developer.mitimes.com if you want to see all of them, and."
        ],
        [
            "We have, for example, a Congress API which lets you retrieve the votes of every member of Congress in the United States.",
            "For every every law over the last 30 years.",
            "It's a pretty cool database."
        ],
        [
            "We also of course have the New York Times Archive, which contains everything we've ever written.",
            "So the problem is the New York the Congressional API has a key called the Congressional Bio ID.",
            "The Library of Congress assigns every legislature in the United States a unique ID and it."
        ],
        [
            "Is not the same as the subject headings that we use for our index, so as a call."
        ],
        [
            "Sequence we have two different APIs that we offer that address the same entities by two different names.",
            "Here's an example.",
            "This is Senator Al Franken, the junior senator from Minnesota, and he is addressed in the New York Times Archive with the identifier.",
            "Franking, al PR.",
            "However, in the Congress API, he has that identifier, so it would be nice if we could provide developers with a mapping between the folks in our archive and the folks you can find out information about in this API and not only external folks, but internal books.",
            "We didn't have this information and to go through the Congress, they'll not a huge task.",
            "It's still kind of a time consuming task to map each and everyone of these things by hand."
        ],
        [
            "But because we've done this link data work, it turns out that Freebase has, for a lot of the people that we've aligned their congressional bio ID."
        ],
        [
            "So all we had to do was make a simple query to Freebase.",
            "Is API and database, the Creative Commons Creative Commons license result and we have an alignment now between our API between two of our internal APIs that we didn't actually have to make.",
            "It's little efficiencies like this that are another reason that we find link data to be really compelling as a knowledge management."
        ],
        [
            "Approach and the last thing I want to talk about, probably the coolest is that link data.",
            "I'll let you do nontraditional aggregations, but let you slice and dice data in ways that would have been difficult if not impossible without the help of linked data.",
            "To give you a."
        ],
        [
            "Few examples we were able using our geonames data to create a new kind of news."
        ],
        [
            "Now news Maps are not new.",
            "They've been around for awhile.",
            "But Geo Geo names and linked data lets us do.",
            "Let us take a new spin on this old idea.",
            "So prior to our working link data we couldn't have even done this.",
            "We didn't know the latitudes, longitudes, the places we wrote about the link data helped us get to this point."
        ],
        [
            "And we are able of course, to show you the articles that correspond to a given place, and that's cool, and it's helpful to sort of see how the news is oriented geographically.",
            "But what's really cool is that with this link data stuff, don't like we show you the articles about a given place, but."
        ],
        [
            "I can also show you the people that were born there and articles about them.",
            "We can show you the companies that are headquartered there and we can show you a bunch of different other facets.",
            "And that's the kind of pivoting around data that Link data lets you do that.",
            "We wouldn't have been able to do otherwise."
        ],
        [
            "Another cool thing that we were able."
        ],
        [
            "To do with Link data is create new ways of querying the archive that might be personally relevant to people.",
            "It turns out that Freebase, for a lot of different individuals that we've aligned stores where they went to college, where they went to University, where they got their degree and so using that data we were able to build a little application that lets you query the New York Times Archive for alumni of given."
        ],
        [
            "Schools so this is an example of the of the application interaction.",
            "Retrieving the alumni that we have written about that we know went to Harvard University and you can imagine this kind of topical aggregation.",
            "This ability to say I want to see all the articles about folks who went somewhere or folks in a certain profession or folks from a given geographic area could really be helpful in targeting your content into a bunch of different environments.",
            "You can imagine you know, for instance, in a social network scenario where you have a profile that describes the users interests and where there from and where they went to school and all that fun stuff.",
            "Being able to use linked with linked data, you can probably find articles that are going to be more interesting that to that person, so that's another way that this link data self lets you do nontraditional aggregation."
        ],
        [
            "And the second to last, and perhaps my personal favorite is an application.",
            "We built called standing tall.",
            "It turns out that for about 1500 people freebase.",
            "Let's you know how tall they are and I thought well?",
            "What the world really needs is an application?",
            "Where you can browse the historical archive of the New York Times."
        ],
        [
            "Based on the height of the people written about so we built that.",
            "And over here on the left hand column you can see the individuals that are in the height range.",
            "Four 9 to 5 four.",
            "It turns out that the shortest person that we have data for is Madeline Albright, who is 49.",
            "However, for those of you in the audience that are fan of new jerseys of the MTV show Jersey Shore, we have not added data for Snooki yet.",
            "An I understand she is shorter than Madeleine Albright, so this demo needs to be updated with that latest data.",
            "That being said, what you're able to do in this?",
            "There's a couple of cool things about this.",
            "First of all, you can browse the archive by criteria that nobody is ever that nobody would ever invest the effort into make otherwise, but it's right there because we've already done this mapping another.",
            "Another cool thing about this is that we're able to create a reasonable reference experience, sort of on the fly, just by just by querying out to other linked data sources.",
            "Freebase gives us some nice demographic information right here.",
            "We were able to get some reference material to describe, you know who the person is.",
            "We can show you the most recent articles from archive about them.",
            "We can do other things.",
            "We can pull things in like the most recent tweets this person has sent out to or the books that they've authored in the movies.",
            "They've been in.",
            "All that stuff is available through this link data sources, which brings me to the last demo and the newest.",
            "In fact, this one has not really seen the light of day outside of the lab yet, because it's still very much a work in progress.",
            "But it's an attempt to sort of fuse all of the different lessons we've learned about linked data to a.",
            "Single user experience and it's called conceptual and basically what this prototype lets you do is type in any of the concepts that we've mapped so far and it goes out and does a bunch of different API calls depending on the type of thing you've asked for.",
            "But just to give you a.",
            "A quick taste.",
            "I've looked up Brooklyn, NY, which is where I where I currently live and because of Geo names we can show you the map so we can show you where Brooklyn is and using another one of our APIs we can show you which concepts in the New York Times Archive most frequently Co occur with Brooklyn.",
            "Regrettably, it seems that murders and attempted murders is the number one, but I assure you, my neighborhood is lovely.",
            "And and so you could click on those an browse a narrow or list of articles that were about both of those topics.",
            "Another thing that you can do building on the work that we've done a link data, is we have this little widget down here which shows you people who are born in Brooklyn, NY.",
            "And if you click on one of them it reorients it reorients the experience it reorients the experience around those individuals.",
            "So that is the latest greatest work.",
            "Oh yeah, and we have some facts that we're pulling about about Brooklyn as well.",
            "Yes.",
            "And then he said, Brooklyn murders, yes.",
            "Yes, so you know it will be interesting to see how it's like a histogram.",
            "That yeah, now we're actually we're actually doing.",
            "Yes, and we're actually we're actually doing a project right now to sort of look into how our metadata evolves overtime, which based on your suggestion, I will consider incorporating into this prototype, but this is the sort of stuff you can do with linked data.",
            "It basically lowers the lowers the cost and the amount of work that it takes for an organization to take an archive of documents and cut it up in new and interesting ways that.",
            "Not only help you find what you're looking for, but as as was just helpfully illustration stated by Dunia, ask interesting and new questions that you that you might not have even thought to ask before seeing the data this way.",
            "So that is why Link data is cool I mentioned."
        ],
        [
            "The areas of improvement are, so I'll just say a couple of words now, but we want to make this work next, but before I do that, are there any further questions about yes?",
            "Write out the three hours again, what the colleges that you used to handle in there.",
            "So we use almost everything is custom we.",
            "Right now one of the challenges that we faced in developing this platform and this platform over a few years is that when we started this work, the only sort of semantic web capable platform for storing this stuff using RDF and retrieving it with Sparkle was the what were a couple of open source projects that, while very promising in their direction, we're not at that point capable of delivering the performance that we required.",
            "So we decided to store all of our links.",
            "As relational data under any trip, typical relational database and the APIs are just PHP on top of that.",
            "The applications that I've shown you are HTML, CSS, JavaScript.",
            "On top of those PHP APIs and dated nytimes.com is currently generated by Static Java process that trolls the database and RE generates the pages, so that's how that whole platform is put together.",
            "Yes.",
            "But some features that you take in your English is that all supervised or manage it all, manually done.",
            "So there is one automated step in the process, but it's a supervised step.",
            "So what happens?",
            "Yeah, so when the article goes from The Newsroom to the website, it's run through a rule based information extraction system that was provided to us by a company named Teragram, which is now part of SAS Institute.",
            "And what Teragram does is it applies this giant Dictionary of rules to our news articles and suggests to the producer the tags they might want to associate with the article.",
            "Within a human being, it has to look at that list of tags and choose the ones that are appropriate and add the ones that are missing so it is.",
            "There is a somewhat automated step in the process, but it is a fully supervised automated step and.",
            "The New York Times index.",
            "The print publication doesn't do that.",
            "They do everything manually.",
            "Yes.",
            "Right now we do store some multimedia metadata around multimedia.",
            "We store caption creator stuff like that.",
            "However, we don't tag our images with the same level of metadata.",
            "Right now we do some work with our images that relies on the metadata.",
            "The articles there are associated with, which is a reasonable first pass, but it would be better if we had more specific metadata.",
            "Yes.",
            "Does it affect back the editors in the writers?",
            "Do you have an impact on the next editorial policy?",
            "I said well.",
            "I will say that this work raises questions of editorial policy, especially around the community.",
            "Curated data.",
            "Those are discussions that we are currently starting to have because the stuff is becoming more real, but I can't.",
            "I can't point to any one thing and say this work has changed that because this work is just really getting rolled out into production.",
            "It's mostly been a research project and it was only last month that we launched the first production version of the APIs.",
            "So before I take anymore questions, I'm just going to."
        ],
        [
            "Say a couple of things about the direction we're going to continue to make this work.",
            "We felt that after R&D did this study that there was value in linked data for news organizations, so we're continuing this work to map our subject headings to external data sources.",
            "And in fact, I don't know if interview are familiar with this great tool that Google Open sourced called Google Refine, but it's a nice tool that was released by the Freebase team that makes this kind of mapping exercise even easier, so we're probably investigating how to apply that.",
            "Moving forward, we're also in the process of opera of turning what we built as a experiment in R&D into real digital infrastructure.",
            "The first component of that launched in December with our Semantic API's.",
            "And there's still some work to do on that, and we're also.",
            "We also well we launched APIs that with that bullet is and the other thing that we're doing is we're collaborating with other media organizations to look at.",
            "Other problems are around linked data, specifically with semantic markup, and I will say a couple of words about that."
        ],
        [
            "Next on that thing is called our news.",
            "But before I do, are there any further questions about the link data work?",
            "Awesome, so now I'm going to change gears 100% and talk about another project that we have in R&D, but I'm going to speak about this very briefly because I realized that we're we're getting near the end of the hour.",
            "So this project is also related vaguely to semantics.",
            "However, it is focused on a different slice of the problem.",
            "That right there.",
            "In case you're wondering, is a picture of a gentleman crawling up the outside of the New York Times building.",
            "We had two of these gentlemen crawl up the wall, and one day it was an exciting day.",
            "Fortunately, they both got to the top so."
        ],
        [
            "So the our news project is a project at the New York Times has carried out in collaboration with a digital industry standard.",
            "Sorry, a media industry digital standards body called the International Press Telecommunications Council and the IPC is a about it has been around since 1965 and it is a place that the media can come to discuss the needs.",
            "That sort of technical needs of news organizations and traditionally.",
            "DC has focused on creating standards for the digital syndication of news, so the file formats that AP and Reuters and AFP and EPA used to syndicate news across the wire are developed by the International Press Telecommunications Council."
        ],
        [
            "And its membership includes sort of a who's who of news of major news agencies, an photo services, and vendors.",
            "So the international Press Telecommunications Council was the sort of Center for the work that I'm about."
        ],
        [
            "To describe.",
            "And that work is it is to develop a vocabulary in a data model for embedding publishing metadata directly into HTML documents.",
            "And the reason that that became an area of focus for the international Press Telecommunications Council is."
        ],
        [
            "That there is kind of a problem with the way the web works today from the perspective of news publishers, and that is that we as human beings, so into the four billion years of evolution that we have conveniently positioned between our ears, can look at this article and say."
        ],
        [
            "Oh this right.",
            "There is the story.",
            "That's the photo that goes with the story.",
            "That's the that's the headline associated with that story.",
            "However, in the."
        ],
        [
            "Case that same problem is not very obvious to a machine.",
            "HTML is sort of an undifferentiated massive markup specifying how a page should look much more than what the page me."
        ],
        [
            "Means and the reason that we had that disconnect is that most websites today are built using an architecture that looks something like this, where you have a display tear, which is the HTML.",
            "JavaScript gets instead to the user.",
            "A data tear where the where the actual data that constitutes the site lives and this logic tier which translates user requests into responses that are set to the display."
        ],
        [
            "Here and the majority of publishing organizations on the data tier have their data really well specified.",
            "It's usually in some sort of database, like maybe a relational database where every data asset is divided into columns that have types that have names, but when they get served over the web, they get served as a large HTML document and all that beautiful structural metadata that many publishers.",
            "Have invested years in structuring is lossed to the end user."
        ],
        [
            "Now that wouldn't be so bad, except that the web sees all of our sites through the very dark lens of the HTML that sits on top of them.",
            "Another way of saying it is that the HTML that we publish obscures all that nice structure that we've been working on for years and years and years, so we at the ITC began to ask ourselves the question.",
            "Well, is there something we can do?",
            "Is there something we can do from a technical standards perspective to help address this problem?"
        ],
        [
            "And it is a problem because with structured data, your results on a search engine might look like that instead of the result there, and all the studies we've read shows .2.",
            "Prettier results getting."
        ],
        [
            "More clicks so we started to look in the see the fall of 2010 at the sort of landscape of technical standards there were out there that could help us address the."
        ],
        [
            "Problem and it turns out we were able to identify four of them.",
            "Microformats, RDF, a microdata, and Jason.",
            "All four of these technologies give you the ability to take a raw HTML document and attach something to it that starts to specify what the document is actually saying.",
            "You have a question.",
            "And each one of these standards has different pros and cons, and I'd be happy.",
            "I'd be happy to talk at length about what those pros and cons are, but for the interest of brevity, I'm just going to say that in our work we decided to focus on both our DFA in HTML5 Microdata.",
            "Those were the two standards we thought best suited the challenge of creating a standard from bed."
        ],
        [
            "Betting publishing specific metadata.",
            "However, those standards are just a starting point.",
            "There are just tools for doing something, and tools applied without a blueprint, you know don't tend to yield very good results.",
            "Put more specifically, the.",
            "These tools, like our DFA in Microdata, lets you say this part of the page is this thing.",
            "However, something even as simple as headline will get multiple names, but there's not coordination.",
            "You know, for instance, bloggers might call a headline a title we at the Times were probably called a headline.",
            "Our colleagues in Germany were probably called an Uber shift, so there needed to be a standardization effort.",
            "A blueprint developed for how we would apply these tools so that the industry could really derive the benefit from these from these approach."
        ],
        [
            "Is and so we call that Blueprint."
        ],
        [
            "R news."
        ],
        [
            "An R news is a data model for embedding, publishing and sorry embedding machine readable publishing metadata in web documents and a set of suggested implementations so too."
        ],
        [
            "Tease that definition apart, our news is a data model.",
            "That's the data model."
        ],
        [
            "It's a data model that has been engineered specifically for embedding publishing specific metadata into web documents, so it is not meant to be an exhaustive ontology of news.",
            "There's a few efforts underway to specify that kind of ontology, and there is great value in doing that, but our news is not trying to be that ours is just trying to capture the subset of the data model.",
            "It's important for this very specific purpose."
        ],
        [
            "And Lastly, it's a set of suggested implementations.",
            "We have documentations on our news org that specify all the different ways that you can use the two different ways you can implement our news on your site using other HTML5 Microdata or RDF A.",
            "Now the Jason is is grayed out because there has been some interest in using Jason for this purpose, but not enough to justify creating a third way of implementing."
        ],
        [
            "News just yet, so the IPC.",
            "As I mentioned earlier, has traditionally focused on the syndication piece of the standards puzzle.",
            "The IPC specifies how articles get syndicated over the wire, and the publishers choose how to store them, and our news adds a new capability to that publishing pipeline by enabling publishers to take the metadata they get here, store here and projected out to here so that the rest of the web can see the metadata.",
            "Open store."
        ],
        [
            "Internally.",
            "So this is the sort of timeline of the development of our news, and we're really proud of the IPC at the speed at which this project this project is preceded, we incorporated it as a formal IPC project.",
            "In September of 2010, and over the next year where they were able to get from version 0.1 in March to version 1.0 in October, and we have started to implement our news on, on nytimes.com, and that work is ongoing annual, hopefully see it in the not too distant future when you right click.",
            "And view source so."
        ],
        [
            "What is our news?",
            "Let's you model?",
            "Well, basically it takes this sort of stuff that a news organization publishes and breaks it down into these objects.",
            "Everything that we publish is regarded as a news item and a news item could be associated with an image object and audio object in a video object.",
            "News item could also be sorry news item can be one of those things and it could also be an article and each one of those objects have have properties specific to those.",
            "Individual media types and a news item can have one or more comments, and it can be either about or.",
            "It can mention a concept as if it's about a concept that's really the core subject matter of the article that mentions the concept.",
            "It's just something that sort of occurs incidentally in the context of the article, and a concept can either be an abstract concept like terrorism, or it can be a person, a location, or an organization so you can use our news to associate articles with this kind of metadata an all those three things people locate locations and organizations.",
            "Can be associated with the Postal address and Lastly articles can be can be associated with the Creator.",
            "A contributor, a provider, a Copyright Holder, an accountable person, and a source organization.",
            "And those relationships take advantage of the person and organization classes I described just a second ago, so that's what our news.",
            "That's how our news models the news.",
            "This is the sort of fundamental data model that we we provide publishers to embed publishing specific metadata into their websites."
        ],
        [
            "Now I could I could go on about those individual classes, but if you want to read more about them, I encourage you to go to ournews.org to see this sort of full specification in its full glory.",
            "But if you're publishing organization, what does it mean to implement the standard on your website?",
            "Well, taking this sample article about Libya as a starting point."
        ],
        [
            "If you pop the hood on that article today, you're going to see a bunch of HTML markup underneath it in order to implement our news on this."
        ],
        [
            "Article using microdata, what you have to do is go through that HTML and add a new attribute.",
            "The attribute is called item prop and in a meta tag.",
            "If you say the item prop is say word count, then the value of the meta tag is taken to be the value for that property.",
            "So this meta tag says this article has a word count of 879 words.",
            "Also you can add item props inside the body to model other things that are associated with the article.",
            "And when you're all done with this, you can run it through an HTML5 parser and will get a nice formatted object that contains all of the metadata that's in the article and machine readable format."
        ],
        [
            "You can also implement it using our DFA, which is similar to HTML5 Microdata instead of item property we use sort of item prop.",
            "Our DFA uses property, but it's used in much the same spirit.",
            "The difference between RFA in HTML5 microdata is that our DFA is based on the RDF specification for the World Wide Web Consortium.",
            "So when this document is parsed, what you get out is not just sort of a data object, but you get out well format.",
            "Well well formed RDF that you can plug into all the different systems that have been.",
            "Engineer around that standard so that those are the but.",
            "Two to sum up what I'm saying in this respect.",
            "Those are the that's how you implement our news on your site.",
            "You basically go into the templates that you used to generate your content and you add a little bit of extra markup and then you've created a site that has machine readable metadata embedded directly."
        ],
        [
            "Into it.",
            "So our news was, as I mentioned, a."
        ],
        [
            "Fairly fast process and the one thing that we tried to do was to include as many different points of view as possible, so we did everything we could to reach."
        ],
        [
            "Out to other organizations and we talked about it all over the world.",
            "We talked about it."
        ],
        [
            "And then we talked about."
        ],
        [
            "When we talked about it in New York."
        ],
        [
            "Talking about in Slovenia today and we are and we were, we tried to get as much feedback as we could from publishers to make sure that the standard was as broadly acceptable as we can."
        ],
        [
            "Make it an.",
            "So those are."
        ],
        [
            "Some of."
        ],
        [
            "The people we talked to and we incorporated some of the feedback that they gave us, and then last summer Google announced this effort called schema.org.",
            "Is anybody here familiar?",
            "Schema.orgokschema.org is essentially Googles sorry I shouldn't say googleschema.org is a website that is published by consortium of Search engines that include Google, Microsoft and Yahoo and I believe Yandex is also joined the consortium and what schema.org.",
            "What does is it publishes a set of vocabularies that you can use to embed metadata about the sort of things that your website contains.",
            "This should sound familiar 'cause that's what we set out to do with our news and at first when this was announced we had a moment of Oh well, I guess we don't need to work on this anymore.",
            "And then we realized that this was a really good opportunity for collaboration.",
            "So we reached out to the team and charger schema.org and we worked with them to incorporate the our new standard into the standard published schema.org now.",
            "So today you can implement our news using.",
            "You implement almost the complete our news data model using the properties of vocabulary specified at schema.org in a way that is sanctioned by both the IPC and the major search engines, which turned out to be a major victory for us because before we started working with schema.org, there were certain things that we wanted to have modeled network model as clearly as we would have liked that are now part of the standard that all three major English search engines are supporting, so it was a, I think a really good thing for the IPC and really good thing for this consortium."
        ],
        [
            "So that is that is."
        ],
        [
            "Our news and that is the conclusion of my remarks.",
            "So thank you so much for having me here.",
            "I hope you found this this work interesting and I'll be happy to answer answer any questions now."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you so much for having me here.",
                    "label": 0
                },
                {
                    "sent": "I, I and both my myself personally in the New York Times generally are really excited to be part of the X like project.",
                    "label": 1
                },
                {
                    "sent": "That's going to be kicking off tomorrow.",
                    "label": 0
                },
                {
                    "sent": "I apologize for keeping you all waiting.",
                    "label": 0
                },
                {
                    "sent": "I was visiting a friend in Venice yesterday and I thought it would be fun to drive.",
                    "label": 0
                },
                {
                    "sent": "So I left Venice at 9:00 AM this morning and I figured that would be plenty of time to get to Ljubljana, but I got a flat tire so I had to and I don't speak Italian so I got to have a.",
                    "label": 0
                },
                {
                    "sent": "Sort of cross cultural, you know.",
                    "label": 0
                },
                {
                    "sent": "Experience why headed?",
                    "label": 0
                },
                {
                    "sent": "Had to show adaptability.",
                    "label": 0
                },
                {
                    "sent": "The hardest part was finding an ATM in the small town that they dropped me off at so I could pay the tow truck driver, but I'm here now.",
                    "label": 0
                },
                {
                    "sent": "I got here at 1:01 so I apologize if I if I talk fast.",
                    "label": 0
                },
                {
                    "sent": "My endorphins are kind of rushing right now because it was an exciting afternoon but I want to talk to you today about some of the cool stuff we do with data.",
                    "label": 0
                },
                {
                    "sent": "At the New York Times Company, I've titled this talk administrator, 160 year old database because this year actually late last year in September of last year, the New York Times turned 160 and we've been publishing a daily paper almost the entire period in between 1851 and today, although in the earlier we didn't publish every day of the weekend.",
                    "label": 0
                },
                {
                    "sent": "That being said, I want to talk to you about some of the things that we've historically done to make this database useful, and things that we have done more recently to build upon this work so.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And by way of it, by way of introduction today, I'm going to start out by telling you the story of our first semantic technology.",
                    "label": 1
                },
                {
                    "sent": "If any of you were at the SWC or sorry, the Semantic Technology conference in 2009, you will recognize this story.",
                    "label": 0
                },
                {
                    "sent": "If then after that I'm going to talk about some work we've been doing in linked data, and then I want to follow that up with some brief remarks about some recent work we've been doing in the space of semantic markup.",
                    "label": 0
                },
                {
                    "sent": "If we have time, and then of course I want to leave time for your questions because I want to tell you what's interesting to you.",
                    "label": 0
                },
                {
                    "sent": "So Mark, how much time do we have?",
                    "label": 0
                },
                {
                    "sent": "One hour for excellent?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So just a quick word by way of introduction about what the New York Times Company is.",
                    "label": 0
                },
                {
                    "sent": "the New York Times Company is a global company that holds a bunch of different media brands.",
                    "label": 0
                },
                {
                    "sent": "Of course, probably the two 2 most globally known are the New York Times itself and the International Herald Tribune, which is a publication of the New York Times.",
                    "label": 1
                },
                {
                    "sent": "New York Times also has a group of couple of newspapers in New England, including the Boston Globe, the finest newspaper in Boston and.",
                    "label": 0
                },
                {
                    "sent": "We recently sold our regional media groups for this slide needs to be updated and we also have the about group, which is which includes about.com and a set of related companies to about.com.",
                    "label": 0
                },
                {
                    "sent": "So that's the New York Times in a nutshell.",
                    "label": 0
                },
                {
                    "sent": "I forgot.",
                    "label": 0
                },
                {
                    "sent": "I forgot that I don't know the latest stats, but as far as American media companies go, this portfolio of brands has a very significant web presence when you add it all together so they.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's the New York Times Company and me.",
                    "label": 0
                },
                {
                    "sent": "Let me tell you a little about me.",
                    "label": 0
                },
                {
                    "sent": "I work in the New York Times, features research and development group is Marco said, and our mission in research and development is to monitor trends and technologies with the potential to disrupt or impact the news industry in the three to five year timeframe.",
                    "label": 0
                },
                {
                    "sent": "So we're always looking for the next big thing in terms of technical developments.",
                    "label": 0
                },
                {
                    "sent": "And then it's our job not only to identify those trends, but to try to try to take advantage of them to build prototypes using some of the technology that's pointed to by these trends.",
                    "label": 0
                },
                {
                    "sent": "And then to show these prototypes to folks throughout our organization and try to get them into operations where appropriate.",
                    "label": 0
                },
                {
                    "sent": "So my role in research and development is I am the leader, architect, first, semantic platform.",
                    "label": 0
                },
                {
                    "sent": "So the area I focus most closely on is what we can do with sort of emerging practices in knowledge management.",
                    "label": 0
                },
                {
                    "sent": "And my talk is going to focus on.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Couple of those so I said I would tell you the story of our first semantic platform, so I want to start by doing that.",
                    "label": 0
                },
                {
                    "sent": "Who wants to guess when we launched our very first semantic platform at the New York Times was at hand.",
                    "label": 1
                },
                {
                    "sent": "I San Marco.",
                    "label": 0
                },
                {
                    "sent": "Probably won't say 1981.",
                    "label": 0
                },
                {
                    "sent": "Alright, the answer is.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "1913 in 1913 we released our first semantic product and it was called the New York Times Index, and it has kind.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Interesting story you see in in those days around 1913, the New York Times was just one of many New York City newspapers on the day the Titanic sank.",
                    "label": 1
                },
                {
                    "sent": "You could have chosen to read about, read about it in about 20 different English language publications and several others in different languages.",
                    "label": 0
                },
                {
                    "sent": "So the media landscape in New York in that time period was very.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Very crowded and so.",
                    "label": 0
                },
                {
                    "sent": "It was with pretty substantial relief that the publisher of the newspaper at that time, a gentleman named Adolph Ochs, was able to lure away the manager of another newspaper.",
                    "label": 0
                },
                {
                    "sent": "His name was, I believe, William Siraiki, and make him essentially his executive vice.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "President and in those years that he worked at the New York Times.",
                    "label": 1
                },
                {
                    "sent": "He was sort of our publishers right hand man and among other achievements.",
                    "label": 0
                },
                {
                    "sent": "He helped forge a partnership with an Italian inventor by the name of Marconi to broadcast our news for the first time overseas.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Using what was then called wireless.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Unfortunately, in that the publisher an Mr. Reich eventually parted ways in 1912, and Mr. Reich went to go run a rival newspaper which caused our publishers some consternation because he all of a sudden not only was it competing against all these, you know these 20 different newspapers in just the English language.",
                    "label": 0
                },
                {
                    "sent": "But he also now had to compete with the newspaper that was run by a gentleman who knew everything he wanted to do so to remain competitive in this fiercely competitive landscape.",
                    "label": 0
                },
                {
                    "sent": "He introduced 3 new products in 1913, the 1st.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Product was called the analyst.",
                    "label": 0
                },
                {
                    "sent": "It was a quarterly magazine of finance, so it was a weekly magazine, finance, finance, Commerce and economics that was targeted in the gendered language of the time.",
                    "label": 0
                },
                {
                    "sent": "For the.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Businessman.",
                    "label": 0
                },
                {
                    "sent": "He also introduced a periodical quarterly periodical called Current History which focused on longform reporting, supplemented by what was then the emerging field of photojournalism and the last.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "New product that our publisher introduced with something called the New York Times Index and the goal behind the New York Times Index was that too.",
                    "label": 0
                },
                {
                    "sent": "That that our publisher wanted to position his paper as the resource that future generations would refer back to when it became necessary to investigate some specific point in history and.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm not going to say that the New York Times, yes, an when the New York Times Index was first launched, you could buy it for $8.00 a year, bounding cloth or slightly more if you wanted a fancy let.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Version strangely, in the years immediately following the release of the index, a number of articles appeared in the New York Times talking about how great the index was.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the index has continued to operate at the New York Times and it is still around today, 98 years after it was, it was first introduced.",
                    "label": 0
                },
                {
                    "sent": "Now I'm not going to tell you that metadata and semantic technology saved the New York Times 100 years ago, but.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is interesting that we're the only major New York City National Paper still in existence.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "That is, that is the sort of introduction to the New York Times index.",
                    "label": 0
                },
                {
                    "sent": "And just to say a couple of words more about it, the New York Times Index started out simply as an internal business practice of the New York Times back in the early days of newspapers.",
                    "label": 0
                },
                {
                    "sent": "A newspaper is competitive advantage was to a large part determined by the quality of research that could bring to bear on its on its stories.",
                    "label": 0
                },
                {
                    "sent": "So in order to in order to use the paper for that purpose.",
                    "label": 0
                },
                {
                    "sent": "The New York Times actually internally indexed it, and this is a picture of a handwritten index from the first years of the.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Paper.",
                    "label": 0
                },
                {
                    "sent": "The index was eventually more systematized and the way it went in the way.",
                    "label": 0
                },
                {
                    "sent": "That we managed this data was we had a staff of people whose job it was to clip out articles from the newspaper, assign them to specific subject headings, write a summary and then file them away.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Eventually we we started publishing the New York Times on microfilm.",
                    "label": 0
                },
                {
                    "sent": "In the 1960s, I believe, and we began, so that was in the 1930s, and we began to release the index so that folks could use it to find what they were.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "King for the microfilm.",
                    "label": 0
                },
                {
                    "sent": "In the 1970s we digitize the index, and we made it available as our very first online service.",
                    "label": 0
                },
                {
                    "sent": "We announced that service in 1968 and we launched it in the early 70s and it was a system where you could dial up into our mainframe computer and search our index of that way, which was really cool because it's very difficult to do Boolean queries in a printed index.",
                    "label": 0
                },
                {
                    "sent": "So if you want to find two things, an article, it's about two things you kind of need, an online index, and apparently the machine that it was run on, which is the one behind that gentleman.",
                    "label": 0
                },
                {
                    "sent": "Was operated by.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That guy and we continue today with our tradition of indexing and tagging and high quality metadata at the New York time.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Times, and that takes 2 forms.",
                    "label": 0
                },
                {
                    "sent": "Today we continue, perhaps somewhat surprisingly, to publish a print index that we that we sell to the to the reference library sector.",
                    "label": 1
                },
                {
                    "sent": "And we also.",
                    "label": 0
                },
                {
                    "sent": "Index articles online as they go onto the.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Website, so both of those processes are still very much part of the way.",
                    "label": 0
                },
                {
                    "sent": "the New York Times does business, and on a sort of on a practical level.",
                    "label": 0
                },
                {
                    "sent": "What that means is that every article that we've ever written, it's associated with keywords draw for controlled vocabulary of people, places, organizations and descriptors.",
                    "label": 0
                },
                {
                    "sent": "An I have examples up here.",
                    "label": 0
                },
                {
                    "sent": "A descriptor might be something like burritos or Exxon Valdez.",
                    "label": 0
                },
                {
                    "sent": "Location, of course, is a place a person is self evident in organization.",
                    "label": 0
                },
                {
                    "sent": "Is both for profit companies publicly traded companies as well as government organizations and institutions of higher learning so that those are the different types of metadata that we associate?",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "With our articles and it is not an inconsiderable investment for us to do this.",
                    "label": 0
                },
                {
                    "sent": "We have a probably about 60 people every day they are involved in one way or another with tagging our content.",
                    "label": 0
                },
                {
                    "sent": "It's really important to us to have this high quality metadata, and the reason we tag is because it powers a lot of services on nytimes.com that, other than that, other organizations, aren't able to provide 'cause they don't have the same high Fidelity metadata that we do, and those services include news alerts.",
                    "label": 0
                },
                {
                    "sent": "They let us.",
                    "label": 0
                },
                {
                    "sent": "Automate editorial practices like past coverage of events related to the story you're currently reading.",
                    "label": 1
                },
                {
                    "sent": "We can give you really high Fidelity feeds and terms of RSS in syndication, and we also are able to indicate this data towards you know into other platforms in a in a way that's targeted to make sense for those audiences so.",
                    "label": 0
                },
                {
                    "sent": "You might say, well, you could do a lot of this stuff using keywords and to an extent that's true, but it's very difficult for almost any other organization before besides the New York Times to give you two different RSS feeds where one contains only articles about the fruit and the other one contains articles about the company Apple, so we are able to do that because of this real because of this institutional dedication to manually tagging all of our content assets.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another reason that we do it is that we have this section of our site called Topic Pages which includes about 27,000 different pages that bring together our coverage of individual topics that are addressed in various stories in the New York Times and this enables us also to offer a service that our competitors aren't really well positioned to offer, so that is indexing at the New York Times and now I want to talk about how we've taken that work to the next level through the application of the principles of length data.",
                    "label": 0
                },
                {
                    "sent": "But before I do that, are there any questions?",
                    "label": 0
                },
                {
                    "sent": "About the indexing process at the New York Times.",
                    "label": 0
                },
                {
                    "sent": "Alright, the so.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Lake Data is is sort of an emerging practice and knowledge management that's motivated by the fact that as you can see from this helpful illustration, the Internet is a very confusing place.",
                    "label": 0
                },
                {
                    "sent": "It is a place of competing standards, different for different ways of identifying the same data and different approaches to storing and retrieving that data.",
                    "label": 0
                },
                {
                    "sent": "So even from the perspective.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of a relatively relatively straightforward concept like Barack Obama, the president of the United States, the web can be a confusing place, brah.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Obama is known in the New York Times Archive as far as Obama, Barack Piyar, knowing that in our database lets you retrieve all of the articles we've ever set we've ever tagged as being about Barack Obama.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "However, other databases like Wikipedia, he is referred to as Barack_",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Obama and the Library of Congress.",
                    "label": 0
                },
                {
                    "sent": "He's referred to as 00016.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In Amazon, that is his author.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "D That is his Twitter.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Handle that.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is YouTube account that is his that his author ID on.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "ITunes and this is his Facebook account, so as you can see we have this one entity.",
                    "label": 0
                },
                {
                    "sent": "But because of the way data is stored and retrieved on the web right now, this one entity is known by all these different identifiers and it's a shame that they're not all linked to one another because were they you could do some really interesting aggregations across different databases that let you know more about these things.",
                    "label": 0
                },
                {
                    "sent": "So that is the idea behind linked data is that it is that.",
                    "label": 0
                },
                {
                    "sent": "You are able to is to identify the strong identifiers that refer to the same real world thing across multiple databases on the web, and we decided the New York Times that we wanted to this was an interesting trend with a potential to enable us to do new things with the way that we aggregate present content.",
                    "label": 0
                },
                {
                    "sent": "So we decided to do an experiment to see if this link data stuff was going to workout for us an as.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I mentioned earlier we have these topic pages in these topics.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pages contain a list of articles that are generated with queries that look a little bit like that, and these queries the topic pages that I mentioned.",
                    "label": 0
                },
                {
                    "sent": "There's about 27,000 of them, and.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you pop the if you pop the hood on the queries beneath the topic pages, we use a total of about 29,000 unique tags to generate those 27,000 pages.",
                    "label": 0
                },
                {
                    "sent": "And since these are the tags we've decided to invest the energy to create topic pages around, we thought they would be a good place to start.",
                    "label": 0
                },
                {
                    "sent": "Our exploration of linked data.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what we did?",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Was we started to.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We took this list of about 29,000 tags and we started to map them to other databases.",
                    "label": 0
                },
                {
                    "sent": "Specifically, we aligned our tags with Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "The strong identifiers from Wikipedia, namely their URL on the site, and we also aligned our geographic tags with records from a database called Geo Names, which is this nice database of geographic metadata, and once we knew how are tags lined up to Wikipedia, we align them.",
                    "label": 0
                },
                {
                    "sent": "We could automatically align them to two other databases called DB Pedia, an Freebase, just one quick word about the presence of Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "On this slide.",
                    "label": 0
                },
                {
                    "sent": "There are some in the news world for whom Wikipedia is a somewhat nervewracking phenomenon because it doesn't have any guarantee of accuracy or or correctness.",
                    "label": 0
                },
                {
                    "sent": "I mean Wikipedia, in my experience is almost is generally right on a whole, but at any one point is tends to be had.",
                    "label": 0
                },
                {
                    "sent": "To be riddled with controversies in minor errors, but we're not using Wikipedia in this in this in this link data work for the fax that asserts about things, but rather building on the fact that Wikipedia has given a unique name to a bunch of different things, and the only the only thing we're supposing about Wikipedia in this in this in this work is that Wikipedia, if there is a name for a thing on Wikipedia, it's probably a thing.",
                    "label": 0
                },
                {
                    "sent": "That's the only that's the extent to which we're relying on Wikipedia, and I'm not suggesting that it isn't a wonderful resource, but it's not always the.",
                    "label": 0
                },
                {
                    "sent": "Write resource for Journal you know for journalistic organizations to build around.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Let me say a little bit about these other databases that we've mapped to, so we have this.",
                    "label": 0
                },
                {
                    "sent": "We've been mapping our tags this database DB pedia.",
                    "label": 0
                },
                {
                    "sent": "And for those of you who might not be familiar with it, DB Pedia is a project that started at the University of Leipzig and the Free University of Berlin and they and the idea behind DVD.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Wikipedia has these really cool information boxes on a bunch of different articles, and it is the case that there is quite a bit of useful information for a lot of different things.",
                    "label": 0
                },
                {
                    "sent": "However, the way Wikipedia stores this information is basically glorified HTML.",
                    "label": 0
                },
                {
                    "sent": "There's not a database behind Wikipedia that generates these information boxes, so using Wikipedia by itself you can't do interesting bits of retrieval like show me all of the cities in Slovenia with the population between X&Y.",
                    "label": 0
                },
                {
                    "sent": "That's not possible using Wikipedia by itself, so the folks at these two universities build a system for scraping this information out of the Wikipedia infoboxes and dating data, basing it using semantic web technologies, and then make it accessible through a partnership with Open Link software to the web making it queryable so people can take advantage and reason around the information that's in Wikipedia, so that is.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Freebase I've started DB Pedia and DB pedia.",
                    "label": 0
                },
                {
                    "sent": "Last I checked I'm sure these numbers have gotten larger since I made this slide.",
                    "label": 0
                },
                {
                    "sent": "Had about 2.6 million entities for which there were facts broken down into these categories and perhaps even more importantly there about 4.9 million links in DB pedia that point to other databases.",
                    "label": 1
                },
                {
                    "sent": "So if you know how your thing aligns to DB pedia, there's a good chance DB pedia will tell you how it aligns to a bunch of other databases around the web.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another company that we have.",
                    "label": 0
                },
                {
                    "sent": "Another database that we have mapped RR tags to is Freebase which aside from being one of the most one of the most questionably named companies on the Internet, has a tremendously useful database of entities that covers about 11,000,000 total topics.",
                    "label": 1
                },
                {
                    "sent": "They sort of started from the same place that DVDs started getting information about the topics on Wikipedia, and have since expanded on that.",
                    "label": 1
                },
                {
                    "sent": "In fact, I'm told that that 11 million topic number is somewhat out of date now that it's gotten quite a bit larger.",
                    "label": 0
                },
                {
                    "sent": "Freebase was contrast Freebase with DB pedia.",
                    "label": 0
                },
                {
                    "sent": "Freebase provides I feel a better platform for developers to build actual systems and services on top of DB.",
                    "label": 0
                },
                {
                    "sent": "Pedia is great for research but the public facing services that I've used around it tend to be insufficient for this sort of loaded Commercial Services.",
                    "label": 0
                },
                {
                    "sent": "Going to subject them to that being said, Freebase was acquired in the summer of 2010 by Google and his.",
                    "label": 0
                },
                {
                    "sent": "Subsequently been folded into their operations, but it continues to be freely available.",
                    "label": 0
                },
                {
                    "sent": "It continues to be maintained that continues to be very valuable research for folks.",
                    "label": 0
                },
                {
                    "sent": "Resource for folks doing Lee.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Data work, the last database that we've aligned our vocabulary two is geonames.",
                    "label": 0
                },
                {
                    "sent": "Geonames is a huge database of place names which has geographic metadata for about 8 million different places.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And fairly good global coverage.",
                    "label": 0
                },
                {
                    "sent": "That's a little heat map of all the different places they have information about in their day.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Database, so in order to get our tags align with these databases, we built a tool for what I should take a step back and say we have a couple of folks working for the New York Times website whose sole job is to maintain the indexing vocabularies we use on our website.",
                    "label": 0
                },
                {
                    "sent": "So there basically the world experts in these vocabularies.",
                    "label": 0
                },
                {
                    "sent": "So what we did to experiment with linked data was we built a tool for them and it looks like this that shows that shows them.",
                    "label": 0
                },
                {
                    "sent": "The Wikipedia article on one side and our coverage on the other.",
                    "label": 0
                },
                {
                    "sent": "And a proposed mapping between two tags at the top, and if that mapping is correct, they click the little check box, the mapping its database.",
                    "label": 0
                },
                {
                    "sent": "Do we move on to the next tag?",
                    "label": 0
                },
                {
                    "sent": "There are this tool also gives you the ability to reassign to change the mapping if it's not correct in to search for the correct mapping if it's not in the drop down list of suggestions and using this tool, we've mapped quite a number of our tags to.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To Wikipedia and also we use a slightly different tool for mapping to geonames.",
                    "label": 0
                },
                {
                    "sent": "It's the same general principle, but here instead of showing you the alignments between the Wikipedia article in the end and the New York Times articles, we plot out the.",
                    "label": 0
                },
                {
                    "sent": "The suggested places from Geonames on this map and our vocabulary expert select the proper location that corresponds to our tag so.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Going through that process, we've manually mapped again.",
                    "label": 0
                },
                {
                    "sent": "I apologize these numbers need to be updated about 15,000 of our tags to DB pedia.",
                    "label": 0
                },
                {
                    "sent": "Freebase angio names so we have a pretty nice collection of links data now that we can start to build on.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we also realize that as great as the people that we have working at the New York Times R, we can't be the sole source of innovation in this space.",
                    "label": 0
                },
                {
                    "sent": "And it would be sort of out of the spirit would sort of not be in step with the spirit of the linked data community to keep all these links to ourselves.",
                    "label": 0
                },
                {
                    "sent": "So about 2 1/2 years ago now we released the first round of mappings that we did with linked data.",
                    "label": 0
                },
                {
                    "sent": "Actually, it was a year and a half ago, I apologize.",
                    "label": 0
                },
                {
                    "sent": "To this website that we maintain data dot nytimes com inundated out of my times com you can type in you can basically get semantic information about the tags that we've mapped so far in semantic web friendly formats like RDF.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The nice thing about davidnytimes.com is that all of the data that we provide on that site is covered by a Creative Commons Attribution license.",
                    "label": 0
                },
                {
                    "sent": "So folks who want to take advantage of the work that we've done aligning over Cabul Airy to other vocabularies, need to only give us credit for doing the work and don't need to worry about any further licensing issues around.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Data we also much more recently a couple of months ago, actually last month released our Semantic API's which are Restful web services that return XML or Jason standard sort of web web services stuff.",
                    "label": 0
                },
                {
                    "sent": "About that let's you that also relates to this link data work.",
                    "label": 0
                },
                {
                    "sent": "We have both a semantic API Anna Geo API now and our semantic API lets you look up A tag by its name or also its UI on data.",
                    "label": 1
                },
                {
                    "sent": "My times com every single tag on datadata.nytimes.com is assigned a unique identifier.",
                    "label": 0
                },
                {
                    "sent": "You could look at it.",
                    "label": 0
                },
                {
                    "sent": "You can look that identifier up using this service.",
                    "label": 0
                },
                {
                    "sent": "You can also search for A tag by name.",
                    "label": 0
                },
                {
                    "sent": "So if you want to find all of the tags that you know say contain the word Slovenia, you could do that and you could also look up.",
                    "label": 0
                },
                {
                    "sent": "Buy article so if you want to see all the tags that correspond to the given article, you can push the article into this service and we give you that they give you those back.",
                    "label": 0
                },
                {
                    "sent": "Of course this service will also return to you the mappings between R tags and and the the other databases that we've mapped to along with some other information for four descriptors.",
                    "label": 0
                },
                {
                    "sent": "For instance, we've internally made a little taxonomy that relates are descriptors to each other so you can see stuff like.",
                    "label": 0
                },
                {
                    "sent": "This term is a broader term than this term or this term has an arrow or term and it's this.",
                    "label": 0
                },
                {
                    "sent": "So those are the various things that are returned by the semantic API.",
                    "label": 0
                },
                {
                    "sent": "We also have a Geo API that's based on this link data work, and it lets you query our Geo codes by various criteria so you can query query them by any geonames criteria.",
                    "label": 0
                },
                {
                    "sent": "So Geonames data about the places has stuff like the population of this place is X, the elevation of this place is Y and you can submit queries to say like show me all the cities the New York Times is written about with the population between X&Y, or show me all the cities New York Times is written about that are in Italy.",
                    "label": 0
                },
                {
                    "sent": "Those sort of queries can be handled by this API.",
                    "label": 0
                },
                {
                    "sent": "You can also submit a bounding box query so if you have a map, if you have a map open in a viewport, you can say this is.",
                    "label": 0
                },
                {
                    "sent": "This is what's visible to the user on this map.",
                    "label": 0
                },
                {
                    "sent": "Give me all the places in the New York Times is written about that fits inside that viewport.",
                    "label": 0
                },
                {
                    "sent": "And Lastly you can do a nearby query using that geographic API which we think is pretty cool.",
                    "label": 0
                },
                {
                    "sent": "We think it will enable folks to build interesting location based experiences around New York Times content because using this API you could do something like build an iPhone app or an Android app.",
                    "label": 0
                },
                {
                    "sent": "Where you push a button and say I want to know what's happening near me and we can use this API to query into our.",
                    "label": 0
                },
                {
                    "sent": "You can use this API to query into our archive by geography.",
                    "label": 0
                },
                {
                    "sent": "Now to be fair, our geography geographic terms are much more granular in NYC than anywhere else, but they still give you a fairly good sense no matter where you are, so those are the various services we've built.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On top of our linked data that we have built using the linked data that we have been acquiring for the last couple of years and before I go on to tell you what we've learned from this experience, I'd like to ask again if there are any questions.",
                    "label": 0
                },
                {
                    "sent": "Alright, so we've been doing this link to work now for a couple of years and we have learned a new.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Number of lessons.",
                    "label": 0
                },
                {
                    "sent": "Through this work, the first of which is that link data helps with three things.",
                    "label": 1
                },
                {
                    "sent": "Adding ontological context.",
                    "label": 1
                },
                {
                    "sent": "Automating our data alignments and it gives us a platform for doing non traditional aggregations.",
                    "label": 0
                },
                {
                    "sent": "Link data is however not a silver bullet.",
                    "label": 0
                },
                {
                    "sent": "There are areas that we would like to see improvement in on the link data front.",
                    "label": 0
                },
                {
                    "sent": "One is community interaction.",
                    "label": 0
                },
                {
                    "sent": "We release this data on data.nytimes.com a couple of years ago and people were very positive about the fact that we had done this, but we haven't seen this sort of uptake that we would have liked with this data.",
                    "label": 0
                },
                {
                    "sent": "That being said, we have we believe that the APIs are going to see a much bigger uptake than the than the stuff we released on data nytimes COM.",
                    "label": 0
                },
                {
                    "sent": "Simply because you don't have to know thing one about semantic web technologies to use our API's.",
                    "label": 0
                },
                {
                    "sent": "Where is the day today today?",
                    "label": 0
                },
                {
                    "sent": "My times.com, while valuable, has a pretty steep learning curve to be useful to somebody.",
                    "label": 0
                },
                {
                    "sent": "So I have been carefully monitoring the number of registrations on the APIs since we release them.",
                    "label": 0
                },
                {
                    "sent": "In early December, and although I'm not allowed to discuss the specific numbers, I can tell you all the time.",
                    "label": 1
                },
                {
                    "sent": "Happy with the numbers that I'm seeing so people are signing up for these API's and people are using them, so that is that is a good story.",
                    "label": 0
                },
                {
                    "sent": "And another area, and I alluded to this earlier when I discussed Wikipedia, is issues of data accuracy.",
                    "label": 0
                },
                {
                    "sent": "A lot of these link data sources are still our community curated sources, so the data can be modified by anybody and not everybody modifies the data accurately, so there is a concern about how an organization like the New York Times, or really any other news publication can use, can rely on this kind of data to do interesting work, while at the same time.",
                    "label": 0
                },
                {
                    "sent": "Not sacrificing the public's trust in the authority of what it says, so that's another issue an I don't purport to have an answer for, but it's an issue that comes up when you start doing this kind of work so.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To elaborate on what I mean by some of the things that we've learned in this, yes.",
                    "label": 0
                },
                {
                    "sent": "So you said.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Accuracy is the problem.",
                    "label": 0
                },
                {
                    "sent": "Are you?",
                    "label": 0
                },
                {
                    "sent": "So you can map.",
                    "label": 0
                },
                {
                    "sent": "I know all your persons to Freebase.",
                    "label": 0
                },
                {
                    "sent": "Have you done checks of how many?",
                    "label": 0
                },
                {
                    "sent": "I know birthdays deferred and stuff like that and have you tried to push out your stuff out to the?",
                    "label": 0
                },
                {
                    "sent": "That is a wonderful suggestion.",
                    "label": 0
                },
                {
                    "sent": "We have not right now.",
                    "label": 0
                },
                {
                    "sent": "We are more focused on just getting the alignments and I take your point.",
                    "label": 0
                },
                {
                    "sent": "It would be helpful to do an assessment of our own to get a sense for how accurate things are.",
                    "label": 0
                },
                {
                    "sent": "I get a sense that the problem is not that the problem, I think though, is not so much that there might be some in accuracies.",
                    "label": 0
                },
                {
                    "sent": "It said those accuracy those inner accuracies might change day by day, so you know you might get one thing right and then another thing might change to something that's not correct.",
                    "label": 0
                },
                {
                    "sent": "Somebody might do something.",
                    "label": 0
                },
                {
                    "sent": "Uh, not entirely ethical to somebody's, you know, account for one reason or another, and so those are things that you have to watch out for.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I want to go onto a little more detail about some of the benefits that we've we've we've seen from this linked data work.",
                    "label": 0
                },
                {
                    "sent": "The first is that help us add ontological context, and that's.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A fancy way of saying that it helps us better understand how our data relates to itself.",
                    "label": 0
                },
                {
                    "sent": "So to give you a specific example about away Geonames helped us address a technical problem that we faced.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have, as I mentioned earlier, RSS and email services and they both basically work in the same back end when a new one article is tagged about being a new talk about being a new topic, it's sent out over the feed or get sent out.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As as an email and one of our feeds that you can sign up for is Italy, the country in which I got a flat tire this morning.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And whenever we write a new article about Italy, it gets duly tagged an an email or RSS feed item goes out and the user is.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "However, it is our longstanding practice to target to tag an article at the most specific level possible.",
                    "label": 0
                },
                {
                    "sent": "So for article is about Rome, even though Rome is in Italy, it will get tagged as being about Rome and not as being about Italy.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So as a consequence, our user won't get the email and they're going to mix miss out on some of the some of the data that is relevant to their information need.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Through the link data work we've been able to through our mapping at geonames make simple queries like show us all the places we write about that are in Italy and we can use that information now to augment the quality of these feeds.",
                    "label": 0
                },
                {
                    "sent": "An this is just a small example of how links data can help us offer better, more accurate services that are both more comprehensive because it provides us with the context that we didn't previously have.",
                    "label": 0
                },
                {
                    "sent": "So that's one example of how link data helps because it can.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Add context, another example that link data of what like data can do.",
                    "label": 0
                },
                {
                    "sent": "That's positive for our organization is it helps with automatically aligning data.",
                    "label": 0
                },
                {
                    "sent": "We produce a lot of APIs at nytimes.com.",
                    "label": 0
                },
                {
                    "sent": "We encourage you to check out our developer pages at developer.mitimes.com if you want to see all of them, and.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have, for example, a Congress API which lets you retrieve the votes of every member of Congress in the United States.",
                    "label": 1
                },
                {
                    "sent": "For every every law over the last 30 years.",
                    "label": 0
                },
                {
                    "sent": "It's a pretty cool database.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We also of course have the New York Times Archive, which contains everything we've ever written.",
                    "label": 0
                },
                {
                    "sent": "So the problem is the New York the Congressional API has a key called the Congressional Bio ID.",
                    "label": 1
                },
                {
                    "sent": "The Library of Congress assigns every legislature in the United States a unique ID and it.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is not the same as the subject headings that we use for our index, so as a call.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sequence we have two different APIs that we offer that address the same entities by two different names.",
                    "label": 0
                },
                {
                    "sent": "Here's an example.",
                    "label": 0
                },
                {
                    "sent": "This is Senator Al Franken, the junior senator from Minnesota, and he is addressed in the New York Times Archive with the identifier.",
                    "label": 0
                },
                {
                    "sent": "Franking, al PR.",
                    "label": 0
                },
                {
                    "sent": "However, in the Congress API, he has that identifier, so it would be nice if we could provide developers with a mapping between the folks in our archive and the folks you can find out information about in this API and not only external folks, but internal books.",
                    "label": 0
                },
                {
                    "sent": "We didn't have this information and to go through the Congress, they'll not a huge task.",
                    "label": 0
                },
                {
                    "sent": "It's still kind of a time consuming task to map each and everyone of these things by hand.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But because we've done this link data work, it turns out that Freebase has, for a lot of the people that we've aligned their congressional bio ID.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So all we had to do was make a simple query to Freebase.",
                    "label": 0
                },
                {
                    "sent": "Is API and database, the Creative Commons Creative Commons license result and we have an alignment now between our API between two of our internal APIs that we didn't actually have to make.",
                    "label": 0
                },
                {
                    "sent": "It's little efficiencies like this that are another reason that we find link data to be really compelling as a knowledge management.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Approach and the last thing I want to talk about, probably the coolest is that link data.",
                    "label": 0
                },
                {
                    "sent": "I'll let you do nontraditional aggregations, but let you slice and dice data in ways that would have been difficult if not impossible without the help of linked data.",
                    "label": 0
                },
                {
                    "sent": "To give you a.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Few examples we were able using our geonames data to create a new kind of news.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now news Maps are not new.",
                    "label": 0
                },
                {
                    "sent": "They've been around for awhile.",
                    "label": 0
                },
                {
                    "sent": "But Geo Geo names and linked data lets us do.",
                    "label": 0
                },
                {
                    "sent": "Let us take a new spin on this old idea.",
                    "label": 1
                },
                {
                    "sent": "So prior to our working link data we couldn't have even done this.",
                    "label": 0
                },
                {
                    "sent": "We didn't know the latitudes, longitudes, the places we wrote about the link data helped us get to this point.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we are able of course, to show you the articles that correspond to a given place, and that's cool, and it's helpful to sort of see how the news is oriented geographically.",
                    "label": 0
                },
                {
                    "sent": "But what's really cool is that with this link data stuff, don't like we show you the articles about a given place, but.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I can also show you the people that were born there and articles about them.",
                    "label": 0
                },
                {
                    "sent": "We can show you the companies that are headquartered there and we can show you a bunch of different other facets.",
                    "label": 0
                },
                {
                    "sent": "And that's the kind of pivoting around data that Link data lets you do that.",
                    "label": 0
                },
                {
                    "sent": "We wouldn't have been able to do otherwise.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another cool thing that we were able.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To do with Link data is create new ways of querying the archive that might be personally relevant to people.",
                    "label": 0
                },
                {
                    "sent": "It turns out that Freebase, for a lot of different individuals that we've aligned stores where they went to college, where they went to University, where they got their degree and so using that data we were able to build a little application that lets you query the New York Times Archive for alumni of given.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Schools so this is an example of the of the application interaction.",
                    "label": 0
                },
                {
                    "sent": "Retrieving the alumni that we have written about that we know went to Harvard University and you can imagine this kind of topical aggregation.",
                    "label": 0
                },
                {
                    "sent": "This ability to say I want to see all the articles about folks who went somewhere or folks in a certain profession or folks from a given geographic area could really be helpful in targeting your content into a bunch of different environments.",
                    "label": 0
                },
                {
                    "sent": "You can imagine you know, for instance, in a social network scenario where you have a profile that describes the users interests and where there from and where they went to school and all that fun stuff.",
                    "label": 0
                },
                {
                    "sent": "Being able to use linked with linked data, you can probably find articles that are going to be more interesting that to that person, so that's another way that this link data self lets you do nontraditional aggregation.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the second to last, and perhaps my personal favorite is an application.",
                    "label": 0
                },
                {
                    "sent": "We built called standing tall.",
                    "label": 0
                },
                {
                    "sent": "It turns out that for about 1500 people freebase.",
                    "label": 0
                },
                {
                    "sent": "Let's you know how tall they are and I thought well?",
                    "label": 0
                },
                {
                    "sent": "What the world really needs is an application?",
                    "label": 0
                },
                {
                    "sent": "Where you can browse the historical archive of the New York Times.",
                    "label": 0
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Based on the height of the people written about so we built that.",
                    "label": 0
                },
                {
                    "sent": "And over here on the left hand column you can see the individuals that are in the height range.",
                    "label": 0
                },
                {
                    "sent": "Four 9 to 5 four.",
                    "label": 0
                },
                {
                    "sent": "It turns out that the shortest person that we have data for is Madeline Albright, who is 49.",
                    "label": 0
                },
                {
                    "sent": "However, for those of you in the audience that are fan of new jerseys of the MTV show Jersey Shore, we have not added data for Snooki yet.",
                    "label": 0
                },
                {
                    "sent": "An I understand she is shorter than Madeleine Albright, so this demo needs to be updated with that latest data.",
                    "label": 0
                },
                {
                    "sent": "That being said, what you're able to do in this?",
                    "label": 0
                },
                {
                    "sent": "There's a couple of cool things about this.",
                    "label": 0
                },
                {
                    "sent": "First of all, you can browse the archive by criteria that nobody is ever that nobody would ever invest the effort into make otherwise, but it's right there because we've already done this mapping another.",
                    "label": 0
                },
                {
                    "sent": "Another cool thing about this is that we're able to create a reasonable reference experience, sort of on the fly, just by just by querying out to other linked data sources.",
                    "label": 0
                },
                {
                    "sent": "Freebase gives us some nice demographic information right here.",
                    "label": 0
                },
                {
                    "sent": "We were able to get some reference material to describe, you know who the person is.",
                    "label": 0
                },
                {
                    "sent": "We can show you the most recent articles from archive about them.",
                    "label": 0
                },
                {
                    "sent": "We can do other things.",
                    "label": 0
                },
                {
                    "sent": "We can pull things in like the most recent tweets this person has sent out to or the books that they've authored in the movies.",
                    "label": 0
                },
                {
                    "sent": "They've been in.",
                    "label": 0
                },
                {
                    "sent": "All that stuff is available through this link data sources, which brings me to the last demo and the newest.",
                    "label": 0
                },
                {
                    "sent": "In fact, this one has not really seen the light of day outside of the lab yet, because it's still very much a work in progress.",
                    "label": 0
                },
                {
                    "sent": "But it's an attempt to sort of fuse all of the different lessons we've learned about linked data to a.",
                    "label": 0
                },
                {
                    "sent": "Single user experience and it's called conceptual and basically what this prototype lets you do is type in any of the concepts that we've mapped so far and it goes out and does a bunch of different API calls depending on the type of thing you've asked for.",
                    "label": 0
                },
                {
                    "sent": "But just to give you a.",
                    "label": 0
                },
                {
                    "sent": "A quick taste.",
                    "label": 0
                },
                {
                    "sent": "I've looked up Brooklyn, NY, which is where I where I currently live and because of Geo names we can show you the map so we can show you where Brooklyn is and using another one of our APIs we can show you which concepts in the New York Times Archive most frequently Co occur with Brooklyn.",
                    "label": 0
                },
                {
                    "sent": "Regrettably, it seems that murders and attempted murders is the number one, but I assure you, my neighborhood is lovely.",
                    "label": 0
                },
                {
                    "sent": "And and so you could click on those an browse a narrow or list of articles that were about both of those topics.",
                    "label": 0
                },
                {
                    "sent": "Another thing that you can do building on the work that we've done a link data, is we have this little widget down here which shows you people who are born in Brooklyn, NY.",
                    "label": 0
                },
                {
                    "sent": "And if you click on one of them it reorients it reorients the experience it reorients the experience around those individuals.",
                    "label": 0
                },
                {
                    "sent": "So that is the latest greatest work.",
                    "label": 0
                },
                {
                    "sent": "Oh yeah, and we have some facts that we're pulling about about Brooklyn as well.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "And then he said, Brooklyn murders, yes.",
                    "label": 0
                },
                {
                    "sent": "Yes, so you know it will be interesting to see how it's like a histogram.",
                    "label": 0
                },
                {
                    "sent": "That yeah, now we're actually we're actually doing.",
                    "label": 0
                },
                {
                    "sent": "Yes, and we're actually we're actually doing a project right now to sort of look into how our metadata evolves overtime, which based on your suggestion, I will consider incorporating into this prototype, but this is the sort of stuff you can do with linked data.",
                    "label": 0
                },
                {
                    "sent": "It basically lowers the lowers the cost and the amount of work that it takes for an organization to take an archive of documents and cut it up in new and interesting ways that.",
                    "label": 0
                },
                {
                    "sent": "Not only help you find what you're looking for, but as as was just helpfully illustration stated by Dunia, ask interesting and new questions that you that you might not have even thought to ask before seeing the data this way.",
                    "label": 0
                },
                {
                    "sent": "So that is why Link data is cool I mentioned.",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The areas of improvement are, so I'll just say a couple of words now, but we want to make this work next, but before I do that, are there any further questions about yes?",
                    "label": 0
                },
                {
                    "sent": "Write out the three hours again, what the colleges that you used to handle in there.",
                    "label": 0
                },
                {
                    "sent": "So we use almost everything is custom we.",
                    "label": 0
                },
                {
                    "sent": "Right now one of the challenges that we faced in developing this platform and this platform over a few years is that when we started this work, the only sort of semantic web capable platform for storing this stuff using RDF and retrieving it with Sparkle was the what were a couple of open source projects that, while very promising in their direction, we're not at that point capable of delivering the performance that we required.",
                    "label": 0
                },
                {
                    "sent": "So we decided to store all of our links.",
                    "label": 0
                },
                {
                    "sent": "As relational data under any trip, typical relational database and the APIs are just PHP on top of that.",
                    "label": 0
                },
                {
                    "sent": "The applications that I've shown you are HTML, CSS, JavaScript.",
                    "label": 0
                },
                {
                    "sent": "On top of those PHP APIs and dated nytimes.com is currently generated by Static Java process that trolls the database and RE generates the pages, so that's how that whole platform is put together.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "But some features that you take in your English is that all supervised or manage it all, manually done.",
                    "label": 0
                },
                {
                    "sent": "So there is one automated step in the process, but it's a supervised step.",
                    "label": 0
                },
                {
                    "sent": "So what happens?",
                    "label": 0
                },
                {
                    "sent": "Yeah, so when the article goes from The Newsroom to the website, it's run through a rule based information extraction system that was provided to us by a company named Teragram, which is now part of SAS Institute.",
                    "label": 0
                },
                {
                    "sent": "And what Teragram does is it applies this giant Dictionary of rules to our news articles and suggests to the producer the tags they might want to associate with the article.",
                    "label": 0
                },
                {
                    "sent": "Within a human being, it has to look at that list of tags and choose the ones that are appropriate and add the ones that are missing so it is.",
                    "label": 0
                },
                {
                    "sent": "There is a somewhat automated step in the process, but it is a fully supervised automated step and.",
                    "label": 0
                },
                {
                    "sent": "The New York Times index.",
                    "label": 0
                },
                {
                    "sent": "The print publication doesn't do that.",
                    "label": 0
                },
                {
                    "sent": "They do everything manually.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Right now we do store some multimedia metadata around multimedia.",
                    "label": 0
                },
                {
                    "sent": "We store caption creator stuff like that.",
                    "label": 0
                },
                {
                    "sent": "However, we don't tag our images with the same level of metadata.",
                    "label": 0
                },
                {
                    "sent": "Right now we do some work with our images that relies on the metadata.",
                    "label": 0
                },
                {
                    "sent": "The articles there are associated with, which is a reasonable first pass, but it would be better if we had more specific metadata.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Does it affect back the editors in the writers?",
                    "label": 0
                },
                {
                    "sent": "Do you have an impact on the next editorial policy?",
                    "label": 0
                },
                {
                    "sent": "I said well.",
                    "label": 0
                },
                {
                    "sent": "I will say that this work raises questions of editorial policy, especially around the community.",
                    "label": 0
                },
                {
                    "sent": "Curated data.",
                    "label": 0
                },
                {
                    "sent": "Those are discussions that we are currently starting to have because the stuff is becoming more real, but I can't.",
                    "label": 0
                },
                {
                    "sent": "I can't point to any one thing and say this work has changed that because this work is just really getting rolled out into production.",
                    "label": 0
                },
                {
                    "sent": "It's mostly been a research project and it was only last month that we launched the first production version of the APIs.",
                    "label": 0
                },
                {
                    "sent": "So before I take anymore questions, I'm just going to.",
                    "label": 0
                }
            ]
        },
        "clip_85": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Say a couple of things about the direction we're going to continue to make this work.",
                    "label": 0
                },
                {
                    "sent": "We felt that after R&D did this study that there was value in linked data for news organizations, so we're continuing this work to map our subject headings to external data sources.",
                    "label": 1
                },
                {
                    "sent": "And in fact, I don't know if interview are familiar with this great tool that Google Open sourced called Google Refine, but it's a nice tool that was released by the Freebase team that makes this kind of mapping exercise even easier, so we're probably investigating how to apply that.",
                    "label": 0
                },
                {
                    "sent": "Moving forward, we're also in the process of opera of turning what we built as a experiment in R&D into real digital infrastructure.",
                    "label": 0
                },
                {
                    "sent": "The first component of that launched in December with our Semantic API's.",
                    "label": 0
                },
                {
                    "sent": "And there's still some work to do on that, and we're also.",
                    "label": 1
                },
                {
                    "sent": "We also well we launched APIs that with that bullet is and the other thing that we're doing is we're collaborating with other media organizations to look at.",
                    "label": 0
                },
                {
                    "sent": "Other problems are around linked data, specifically with semantic markup, and I will say a couple of words about that.",
                    "label": 0
                }
            ]
        },
        "clip_86": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Next on that thing is called our news.",
                    "label": 0
                },
                {
                    "sent": "But before I do, are there any further questions about the link data work?",
                    "label": 0
                },
                {
                    "sent": "Awesome, so now I'm going to change gears 100% and talk about another project that we have in R&D, but I'm going to speak about this very briefly because I realized that we're we're getting near the end of the hour.",
                    "label": 0
                },
                {
                    "sent": "So this project is also related vaguely to semantics.",
                    "label": 0
                },
                {
                    "sent": "However, it is focused on a different slice of the problem.",
                    "label": 0
                },
                {
                    "sent": "That right there.",
                    "label": 0
                },
                {
                    "sent": "In case you're wondering, is a picture of a gentleman crawling up the outside of the New York Times building.",
                    "label": 0
                },
                {
                    "sent": "We had two of these gentlemen crawl up the wall, and one day it was an exciting day.",
                    "label": 0
                },
                {
                    "sent": "Fortunately, they both got to the top so.",
                    "label": 0
                }
            ]
        },
        "clip_87": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the our news project is a project at the New York Times has carried out in collaboration with a digital industry standard.",
                    "label": 0
                },
                {
                    "sent": "Sorry, a media industry digital standards body called the International Press Telecommunications Council and the IPC is a about it has been around since 1965 and it is a place that the media can come to discuss the needs.",
                    "label": 0
                },
                {
                    "sent": "That sort of technical needs of news organizations and traditionally.",
                    "label": 0
                },
                {
                    "sent": "DC has focused on creating standards for the digital syndication of news, so the file formats that AP and Reuters and AFP and EPA used to syndicate news across the wire are developed by the International Press Telecommunications Council.",
                    "label": 0
                }
            ]
        },
        "clip_88": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And its membership includes sort of a who's who of news of major news agencies, an photo services, and vendors.",
                    "label": 0
                },
                {
                    "sent": "So the international Press Telecommunications Council was the sort of Center for the work that I'm about.",
                    "label": 0
                }
            ]
        },
        "clip_89": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To describe.",
                    "label": 0
                },
                {
                    "sent": "And that work is it is to develop a vocabulary in a data model for embedding publishing metadata directly into HTML documents.",
                    "label": 0
                },
                {
                    "sent": "And the reason that that became an area of focus for the international Press Telecommunications Council is.",
                    "label": 0
                }
            ]
        },
        "clip_90": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That there is kind of a problem with the way the web works today from the perspective of news publishers, and that is that we as human beings, so into the four billion years of evolution that we have conveniently positioned between our ears, can look at this article and say.",
                    "label": 0
                }
            ]
        },
        "clip_91": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Oh this right.",
                    "label": 0
                },
                {
                    "sent": "There is the story.",
                    "label": 0
                },
                {
                    "sent": "That's the photo that goes with the story.",
                    "label": 0
                },
                {
                    "sent": "That's the that's the headline associated with that story.",
                    "label": 0
                },
                {
                    "sent": "However, in the.",
                    "label": 0
                }
            ]
        },
        "clip_92": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Case that same problem is not very obvious to a machine.",
                    "label": 0
                },
                {
                    "sent": "HTML is sort of an undifferentiated massive markup specifying how a page should look much more than what the page me.",
                    "label": 0
                }
            ]
        },
        "clip_93": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Means and the reason that we had that disconnect is that most websites today are built using an architecture that looks something like this, where you have a display tear, which is the HTML.",
                    "label": 0
                },
                {
                    "sent": "JavaScript gets instead to the user.",
                    "label": 0
                },
                {
                    "sent": "A data tear where the where the actual data that constitutes the site lives and this logic tier which translates user requests into responses that are set to the display.",
                    "label": 0
                }
            ]
        },
        "clip_94": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here and the majority of publishing organizations on the data tier have their data really well specified.",
                    "label": 0
                },
                {
                    "sent": "It's usually in some sort of database, like maybe a relational database where every data asset is divided into columns that have types that have names, but when they get served over the web, they get served as a large HTML document and all that beautiful structural metadata that many publishers.",
                    "label": 0
                },
                {
                    "sent": "Have invested years in structuring is lossed to the end user.",
                    "label": 0
                }
            ]
        },
        "clip_95": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now that wouldn't be so bad, except that the web sees all of our sites through the very dark lens of the HTML that sits on top of them.",
                    "label": 0
                },
                {
                    "sent": "Another way of saying it is that the HTML that we publish obscures all that nice structure that we've been working on for years and years and years, so we at the ITC began to ask ourselves the question.",
                    "label": 0
                },
                {
                    "sent": "Well, is there something we can do?",
                    "label": 0
                },
                {
                    "sent": "Is there something we can do from a technical standards perspective to help address this problem?",
                    "label": 0
                }
            ]
        },
        "clip_96": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it is a problem because with structured data, your results on a search engine might look like that instead of the result there, and all the studies we've read shows .2.",
                    "label": 0
                },
                {
                    "sent": "Prettier results getting.",
                    "label": 0
                }
            ]
        },
        "clip_97": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More clicks so we started to look in the see the fall of 2010 at the sort of landscape of technical standards there were out there that could help us address the.",
                    "label": 0
                }
            ]
        },
        "clip_98": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Problem and it turns out we were able to identify four of them.",
                    "label": 0
                },
                {
                    "sent": "Microformats, RDF, a microdata, and Jason.",
                    "label": 0
                },
                {
                    "sent": "All four of these technologies give you the ability to take a raw HTML document and attach something to it that starts to specify what the document is actually saying.",
                    "label": 0
                },
                {
                    "sent": "You have a question.",
                    "label": 0
                },
                {
                    "sent": "And each one of these standards has different pros and cons, and I'd be happy.",
                    "label": 0
                },
                {
                    "sent": "I'd be happy to talk at length about what those pros and cons are, but for the interest of brevity, I'm just going to say that in our work we decided to focus on both our DFA in HTML5 Microdata.",
                    "label": 0
                },
                {
                    "sent": "Those were the two standards we thought best suited the challenge of creating a standard from bed.",
                    "label": 0
                }
            ]
        },
        "clip_99": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Betting publishing specific metadata.",
                    "label": 0
                },
                {
                    "sent": "However, those standards are just a starting point.",
                    "label": 0
                },
                {
                    "sent": "There are just tools for doing something, and tools applied without a blueprint, you know don't tend to yield very good results.",
                    "label": 0
                },
                {
                    "sent": "Put more specifically, the.",
                    "label": 0
                },
                {
                    "sent": "These tools, like our DFA in Microdata, lets you say this part of the page is this thing.",
                    "label": 0
                },
                {
                    "sent": "However, something even as simple as headline will get multiple names, but there's not coordination.",
                    "label": 0
                },
                {
                    "sent": "You know, for instance, bloggers might call a headline a title we at the Times were probably called a headline.",
                    "label": 0
                },
                {
                    "sent": "Our colleagues in Germany were probably called an Uber shift, so there needed to be a standardization effort.",
                    "label": 0
                },
                {
                    "sent": "A blueprint developed for how we would apply these tools so that the industry could really derive the benefit from these from these approach.",
                    "label": 0
                }
            ]
        },
        "clip_100": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is and so we call that Blueprint.",
                    "label": 0
                }
            ]
        },
        "clip_101": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "R news.",
                    "label": 0
                }
            ]
        },
        "clip_102": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An R news is a data model for embedding, publishing and sorry embedding machine readable publishing metadata in web documents and a set of suggested implementations so too.",
                    "label": 0
                }
            ]
        },
        "clip_103": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tease that definition apart, our news is a data model.",
                    "label": 0
                },
                {
                    "sent": "That's the data model.",
                    "label": 0
                }
            ]
        },
        "clip_104": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's a data model that has been engineered specifically for embedding publishing specific metadata into web documents, so it is not meant to be an exhaustive ontology of news.",
                    "label": 1
                },
                {
                    "sent": "There's a few efforts underway to specify that kind of ontology, and there is great value in doing that, but our news is not trying to be that ours is just trying to capture the subset of the data model.",
                    "label": 0
                },
                {
                    "sent": "It's important for this very specific purpose.",
                    "label": 0
                }
            ]
        },
        "clip_105": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And Lastly, it's a set of suggested implementations.",
                    "label": 1
                },
                {
                    "sent": "We have documentations on our news org that specify all the different ways that you can use the two different ways you can implement our news on your site using other HTML5 Microdata or RDF A.",
                    "label": 0
                },
                {
                    "sent": "Now the Jason is is grayed out because there has been some interest in using Jason for this purpose, but not enough to justify creating a third way of implementing.",
                    "label": 0
                }
            ]
        },
        "clip_106": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "News just yet, so the IPC.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned earlier, has traditionally focused on the syndication piece of the standards puzzle.",
                    "label": 0
                },
                {
                    "sent": "The IPC specifies how articles get syndicated over the wire, and the publishers choose how to store them, and our news adds a new capability to that publishing pipeline by enabling publishers to take the metadata they get here, store here and projected out to here so that the rest of the web can see the metadata.",
                    "label": 0
                },
                {
                    "sent": "Open store.",
                    "label": 0
                }
            ]
        },
        "clip_107": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Internally.",
                    "label": 0
                },
                {
                    "sent": "So this is the sort of timeline of the development of our news, and we're really proud of the IPC at the speed at which this project this project is preceded, we incorporated it as a formal IPC project.",
                    "label": 0
                },
                {
                    "sent": "In September of 2010, and over the next year where they were able to get from version 0.1 in March to version 1.0 in October, and we have started to implement our news on, on nytimes.com, and that work is ongoing annual, hopefully see it in the not too distant future when you right click.",
                    "label": 0
                },
                {
                    "sent": "And view source so.",
                    "label": 0
                }
            ]
        },
        "clip_108": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What is our news?",
                    "label": 0
                },
                {
                    "sent": "Let's you model?",
                    "label": 0
                },
                {
                    "sent": "Well, basically it takes this sort of stuff that a news organization publishes and breaks it down into these objects.",
                    "label": 0
                },
                {
                    "sent": "Everything that we publish is regarded as a news item and a news item could be associated with an image object and audio object in a video object.",
                    "label": 0
                },
                {
                    "sent": "News item could also be sorry news item can be one of those things and it could also be an article and each one of those objects have have properties specific to those.",
                    "label": 0
                },
                {
                    "sent": "Individual media types and a news item can have one or more comments, and it can be either about or.",
                    "label": 0
                },
                {
                    "sent": "It can mention a concept as if it's about a concept that's really the core subject matter of the article that mentions the concept.",
                    "label": 0
                },
                {
                    "sent": "It's just something that sort of occurs incidentally in the context of the article, and a concept can either be an abstract concept like terrorism, or it can be a person, a location, or an organization so you can use our news to associate articles with this kind of metadata an all those three things people locate locations and organizations.",
                    "label": 0
                },
                {
                    "sent": "Can be associated with the Postal address and Lastly articles can be can be associated with the Creator.",
                    "label": 0
                },
                {
                    "sent": "A contributor, a provider, a Copyright Holder, an accountable person, and a source organization.",
                    "label": 0
                },
                {
                    "sent": "And those relationships take advantage of the person and organization classes I described just a second ago, so that's what our news.",
                    "label": 0
                },
                {
                    "sent": "That's how our news models the news.",
                    "label": 0
                },
                {
                    "sent": "This is the sort of fundamental data model that we we provide publishers to embed publishing specific metadata into their websites.",
                    "label": 0
                }
            ]
        },
        "clip_109": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now I could I could go on about those individual classes, but if you want to read more about them, I encourage you to go to ournews.org to see this sort of full specification in its full glory.",
                    "label": 0
                },
                {
                    "sent": "But if you're publishing organization, what does it mean to implement the standard on your website?",
                    "label": 0
                },
                {
                    "sent": "Well, taking this sample article about Libya as a starting point.",
                    "label": 0
                }
            ]
        },
        "clip_110": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you pop the hood on that article today, you're going to see a bunch of HTML markup underneath it in order to implement our news on this.",
                    "label": 0
                }
            ]
        },
        "clip_111": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Article using microdata, what you have to do is go through that HTML and add a new attribute.",
                    "label": 0
                },
                {
                    "sent": "The attribute is called item prop and in a meta tag.",
                    "label": 0
                },
                {
                    "sent": "If you say the item prop is say word count, then the value of the meta tag is taken to be the value for that property.",
                    "label": 0
                },
                {
                    "sent": "So this meta tag says this article has a word count of 879 words.",
                    "label": 0
                },
                {
                    "sent": "Also you can add item props inside the body to model other things that are associated with the article.",
                    "label": 0
                },
                {
                    "sent": "And when you're all done with this, you can run it through an HTML5 parser and will get a nice formatted object that contains all of the metadata that's in the article and machine readable format.",
                    "label": 0
                }
            ]
        },
        "clip_112": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can also implement it using our DFA, which is similar to HTML5 Microdata instead of item property we use sort of item prop.",
                    "label": 0
                },
                {
                    "sent": "Our DFA uses property, but it's used in much the same spirit.",
                    "label": 0
                },
                {
                    "sent": "The difference between RFA in HTML5 microdata is that our DFA is based on the RDF specification for the World Wide Web Consortium.",
                    "label": 0
                },
                {
                    "sent": "So when this document is parsed, what you get out is not just sort of a data object, but you get out well format.",
                    "label": 0
                },
                {
                    "sent": "Well well formed RDF that you can plug into all the different systems that have been.",
                    "label": 0
                },
                {
                    "sent": "Engineer around that standard so that those are the but.",
                    "label": 0
                },
                {
                    "sent": "Two to sum up what I'm saying in this respect.",
                    "label": 0
                },
                {
                    "sent": "Those are the that's how you implement our news on your site.",
                    "label": 0
                },
                {
                    "sent": "You basically go into the templates that you used to generate your content and you add a little bit of extra markup and then you've created a site that has machine readable metadata embedded directly.",
                    "label": 0
                }
            ]
        },
        "clip_113": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Into it.",
                    "label": 0
                },
                {
                    "sent": "So our news was, as I mentioned, a.",
                    "label": 0
                }
            ]
        },
        "clip_114": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Fairly fast process and the one thing that we tried to do was to include as many different points of view as possible, so we did everything we could to reach.",
                    "label": 0
                }
            ]
        },
        "clip_115": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Out to other organizations and we talked about it all over the world.",
                    "label": 0
                },
                {
                    "sent": "We talked about it.",
                    "label": 0
                }
            ]
        },
        "clip_116": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we talked about.",
                    "label": 0
                }
            ]
        },
        "clip_117": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When we talked about it in New York.",
                    "label": 0
                }
            ]
        },
        "clip_118": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Talking about in Slovenia today and we are and we were, we tried to get as much feedback as we could from publishers to make sure that the standard was as broadly acceptable as we can.",
                    "label": 0
                }
            ]
        },
        "clip_119": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Make it an.",
                    "label": 0
                },
                {
                    "sent": "So those are.",
                    "label": 0
                }
            ]
        },
        "clip_120": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some of.",
                    "label": 0
                }
            ]
        },
        "clip_121": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The people we talked to and we incorporated some of the feedback that they gave us, and then last summer Google announced this effort called schema.org.",
                    "label": 0
                },
                {
                    "sent": "Is anybody here familiar?",
                    "label": 0
                },
                {
                    "sent": "Schema.orgokschema.org is essentially Googles sorry I shouldn't say googleschema.org is a website that is published by consortium of Search engines that include Google, Microsoft and Yahoo and I believe Yandex is also joined the consortium and what schema.org.",
                    "label": 0
                },
                {
                    "sent": "What does is it publishes a set of vocabularies that you can use to embed metadata about the sort of things that your website contains.",
                    "label": 0
                },
                {
                    "sent": "This should sound familiar 'cause that's what we set out to do with our news and at first when this was announced we had a moment of Oh well, I guess we don't need to work on this anymore.",
                    "label": 0
                },
                {
                    "sent": "And then we realized that this was a really good opportunity for collaboration.",
                    "label": 0
                },
                {
                    "sent": "So we reached out to the team and charger schema.org and we worked with them to incorporate the our new standard into the standard published schema.org now.",
                    "label": 0
                },
                {
                    "sent": "So today you can implement our news using.",
                    "label": 0
                },
                {
                    "sent": "You implement almost the complete our news data model using the properties of vocabulary specified at schema.org in a way that is sanctioned by both the IPC and the major search engines, which turned out to be a major victory for us because before we started working with schema.org, there were certain things that we wanted to have modeled network model as clearly as we would have liked that are now part of the standard that all three major English search engines are supporting, so it was a, I think a really good thing for the IPC and really good thing for this consortium.",
                    "label": 0
                }
            ]
        },
        "clip_122": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that is that is.",
                    "label": 0
                }
            ]
        },
        "clip_123": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our news and that is the conclusion of my remarks.",
                    "label": 0
                },
                {
                    "sent": "So thank you so much for having me here.",
                    "label": 0
                },
                {
                    "sent": "I hope you found this this work interesting and I'll be happy to answer answer any questions now.",
                    "label": 0
                }
            ]
        }
    }
}