{
    "id": "j3p4jupeshbpfp4dn7r6mgp2gghywdtu",
    "title": "Identifying the Influential Bloggers",
    "info": {
        "author": [
            "Nitin Agarwal, Department of Information Science, Donaghey College of Engineering and Information Technology, University of Arkansas at Little Rock"
        ],
        "published": "Feb. 25, 2008",
        "recorded": "February 2008",
        "category": [
            "Top->Computer Science->Network Analysis",
            "Top->Computer Science->Web Mining"
        ]
    },
    "url": "http://videolectures.net/wsdm08_agarwal_iib/",
    "segmentation": [
        [
            "In this talk I'll introduce the problem.",
            "The problem is an.",
            "What is the importance of this problem?",
            "And then I'll talk about the model which we have proposed.",
            "The challenges that we faced for this model an the experiments, how we worked out the experiment.",
            "What are the settings for the experiments and the result which we obtain an some future work."
        ],
        [
            "Past 15 years computers and Internet have revolutionized the communication.",
            "People can connect with each other across different time zones with all geographical barriers and this has created a humongous mesh of social interactions which people call a social network.",
            "As you can see in the illustration, there are different services which revolve around Web 2.0 paradigm, which has basically catalyzed this communication, and by the ease of use interface and desktop like experience, these services like friendship, networks, blogs, wikis, collaborative tagging and media sharing.",
            "In our research, we focus on blogsphere."
        ],
        [
            "Block sites could be individual or community for individual blog sites.",
            "These are owned and maintained by individual users as compared to community block sites, which are owned and maintained by a group of like minded users.",
            "And community block sites are more like discussion forums and discussion boards where you can see high degree of group discussion and collaboration, whereas an individual block sides.",
            "They're more like personal accounts, journals or Diaries.",
            "An almost negligible group interaction is there.",
            "We focus on Community blog sites."
        ],
        [
            "To find his influential bloggers, let's consider a physical scenario where you were trying to buy a digital camera and you want this super cool camera with all these great features.",
            "So in a physical world, what you would do is you would go to a domain expert or you will talk to your friends to get their reviews and feedback about this product.",
            "But in a virtual world you would log onto our online community and try to find out the feedbacks of this product.",
            "So now there's so many communities online and there's so many users they're giving out their feedback about this product.",
            "So which one you should go with?",
            "Who's feedback?",
            "You should follow.",
            "That is the main problem."
        ],
        [
            "So here we introduce this problem.",
            "Inspired by the energy between this real world and the block communities, we try to answer their influential bloggers and who are these?",
            "Can we find them or just active bloggers are the influential bloggers?",
            "What are the differences between them?",
            "An can active loggers be influential or influential luggage be active.",
            "All these sort of."
        ],
        [
            "Other applications for influential bloggers could be like they could be market movers.",
            "They could easily spread the word about the product and they could sway opinions in a government policy or campaigns.",
            "The customers they could be really helpful in customer support and troubleshooting.",
            "They have really valuable feedbacks for the products which can be used by different companies for their market, research service and technology.",
            "Published a report which said there around 18.6 new blog posts which appear every second.",
            "So you need to find representative posts so that you can look at them there.",
            "It's just not possible to look at all the posts, so these influential blog posts could be those representative articles."
        ],
        [
            "So searching the influentials.",
            "As I mentioned, we have active bloggers and we have influential bloggers, so an active Blogger is easy to define just based just on the volume of posting she has.",
            "And these are often listed on the blog sites.",
            "Are they necessarily influential?",
            "That's what we want to find out.",
            "And how do we define influential Blogger?",
            "By the influential posts he has submitted.",
            "Obviously it's a very subjective concept.",
            "What kind of statistiques can be collected and how we can use these statistiques to gauge the influence of this?"
        ],
        [
            "A Blogger.",
            "In our study, we use four different statistics which we call social gestures.",
            "1st is recognition, which is gauged by the incoming links or the citations.",
            "The more influential the ring posts are, the more influential than effort.",
            "Post becomes an influential Blogger is recognized by a lot of other bloggers.",
            "The second is activity generation, which is basically the volume of discussion he generates, which is gauged by the number of comments he obtains on his blog posts.",
            "The 3rd is a novelty which is basically the number of outlets he's using the point in order is.",
            "We have done a study and it says a novel ideas exert more influence.",
            "So if the idea is not very novel then it might not be very influential.",
            "So we gave this by the number of outlets he is using.",
            "So the large number of out links suggests that the blog post represents several other blog posts, hence less novel.",
            "Eloquence, which is basically how good the blog post is right now.",
            "We're using the length of the blog post, but there can be several other measures like linguistic analysis you can use to gauge the how good this blog post is.",
            "Then you combine these different social gestures and then come up with the influence code for a blog post.",
            "Size.",
            "So can I can I have that again?",
            "Or measuring goodness in terms of length?",
            "I mean, I thought I would prefer the smaller blog entries concerning the casual nature of the blog post.",
            "You don't have any incentive to write longer blog posts.",
            "So if you're writing a lot of content, that means you really have some insight.",
            "It's obviously can garble around some text, Ann, that could harm the model, but we as you can see in there for the slides, we have various parameters or weights to these parameters.",
            "We can tune these weights to adjust these.",
            "Parameters the contribution of these parameters, and as I said you can also include some other linguistic analysis tools to verify that this is whether it's very literally good blog post or not."
        ],
        [
            "So in the model.",
            "As you can see.",
            "We have the influence flow of a blog post B which is gauged by the influence of incoming block posts.",
            "Incoming links to this blog post.",
            "Then we subtract the influence of all those blog posts which he is cited to.",
            "And then.",
            "Can see in the next equation the.",
            "Influence flow.",
            "We add the number of comments, the activity generation he has for this blog post, and the third equation can see how we have merged the quality of the blog post.",
            "And basically once we have these scores, we just take the maximum and then that gives the influence score for the."
        ],
        [
            "Dog.",
            "So as I mentioned, are these influential bloggers simply active bloggers?",
            "If not, then can the model differentiate between them?",
            "Or are there different types of influential bloggers an are there temporal patterns to these different types of bloggers and what other parameters beyond what we have used can be used in the model to evolve IT?"
        ],
        [
            "There are other questions like how do you evaluate, especially when there is no training test data and there's no ground truth?",
            "Is there an alternative ground truth an we try to answer these questions and about the parameters can?",
            "How can we determine our all of these necessary?",
            "Can any of them be correlated?",
            "And for our experiments we use an official Apple web log for data collection.",
            "It's a.",
            "Moderate size Community block site with 15 to 16 loggers an quite high.",
            "Volume of postings."
        ],
        [
            "So in the experiments on this blog site, we also they also list top five active bloggers.",
            "As you can see in the left hand side of the table, they have listed the top five active bloggers for a month for 30 days and towards the right hand side are the bloggers which are model says these are the top five influential bloggers.",
            "So the names in the italics are the ones which are kind of overlap in this in these two lists.",
            "So based on this these two.",
            "List you can.",
            "We can create four categories of bloggers.",
            "First category could be active and influential bloggers which are basically these italic names which are both active as well as influential second could be inactive, but influential bloggers, those which are not active but still influential bloggers third category could be active.",
            "But those who are not influential they obviously there is another category which is inactive and non influential bloggers.",
            "But we don't care about those because they seldom submit blog post an.",
            "However, they do not influence others.",
            "There are details statistics for these four categories of bloggers which we have mentioned in the paper.",
            "You can always look at the paper."
        ],
        [
            "In this chart.",
            "We study.",
            "How different parameters contribute to the system?",
            "So as you can see in the X axis we have different configuration of the model where we remove each parameter at a time and generate five different configurations without links.",
            "No comments, no blog post length, no inlinks, an 5th convocation where all the parameters are considered on the Y axis.",
            "You can see the ranks of the top five bloggers, and as you can see no two configurations have similar.",
            "So ranking for these bloggers, which says that all the all, the all the parameters are contributing.",
            "In some sense.",
            "There are further on the next slides I'll show you how there are some more experiments which do the correlation analysis between these parameters."
        ],
        [
            "We also try to consider other parameters like rate of comments to see if that could be a possible.",
            "Mom parameter to this model, but as you can see these two charts are for particular for two different influential blog posts.",
            "An both of them have very different.",
            "Comment reaction one has very spiky comment reaction by intuition.",
            "You can always think that a very spiky comment reaction could be to a very influential blog post, but on the other hand you see a flat comment reaction to an influential blog post as well.",
            "So this is not exactly a very good differentiating parameter between influential influential."
        ],
        [
            "In this chart you can see the different temporal patterns of influential bloggers.",
            "In the Rose you can see the.",
            "By the months starting from February 2004 to January the 7th, an on the columns, you have different influential bloggers who have been influential at some point of their time.",
            "So, and the color gradient shows their influence level.",
            "The darker the color is, the higher the more influential they were basically.",
            "So in this chart you can observe there are different kinds of influential bloggers, some are long-term or influential bloggers like this guy.",
            "Who has been quite influential for longer time and some of them are.",
            "Very short term or basically average influential bloggers who have been influential for some period of time and then transient influential bloggers who have been influential for very small time and then purging influential bloggers which.",
            "Just started to become influential, so depending on the different marketing applications you can use these blockers for different.",
            "Things."
        ],
        [
            "OK, so far we have.",
            "Addressed questions like how these?",
            "Influential bloggers are different from active bloggers or.",
            "What are the different types of loggers?",
            "But we haven't addressed the question like how we can validate this method.",
            "This model, the influential Blogger which we propose, are really the information or not.",
            "And specially when you have no ground truth, how we can find out these things?",
            "One obvious solution is to.",
            "Use a human survey.",
            "You can ask the people to rank what you what your findings are, and what they think.",
            "But it involves a lot of cost, effort and resources, and beyond that, it's not always guaranteed to be a fair evaluation.",
            "So we need to think of something.",
            "Three different like has to be a different alternate reference point for the ground truth.",
            "In this case we use another Web 2.0 website which is dig.",
            "Dig is all about user powered content.",
            "Everything is submitted and voted on by the Community share discovered bookmark and promote stuff that is positive.",
            "Basically, take is a huge user base.",
            "You have a lot of collectivism.",
            "People vote what they see an if an article is really important or popular, it keeps on acquiring a lot of big score and keeps on getting popular.",
            "So the higher their Dicks for a blog post is, the more it is liked.",
            "Or if a blog post is not on the date, that means either it's not like or it was not at all submitted.",
            "So we use this Web 2.0 website.",
            "They as a reference point to do our model."
        ],
        [
            "The setting for this experiment is Dig Records, top 100 block posts an.",
            "We have top five influential as well as five active bloggers which we use to construct four categories.",
            "For each of these four categories of bloggers, we collect Top 20 blog posts from our model and compare them with their Dick Top 100.",
            "So as you can see in this first table.",
            "There are four categories of these bloggers.",
            "Influential, active, influential, inactive, non influential, active and so on.",
            "But influential and active loggers the cell S1 you can see there are.",
            "17 Oh 17 blog posts that were overlapping between the top 20 blog posts of influential active as and compared to the 100 day blog posts.",
            "And seven of the top 20 influential blog posts from influential and inactive loggers were found on the top 100 of Dig.",
            "Similarly, in S3 you can see only three of the block Top 20 block posts submitted by non essential active loggers.",
            "Appeared in the top 100 of DIG.",
            "So if you compare S2 and S3, you can easily make out that being influential is more important.",
            "Like if you are more influential than you are.",
            "More likely to appear on day or more likely to be popular with people as compared to being active.",
            "In the next 2 charts we give the distribution for top 100 block post sandigan.",
            "The 535 block posts collected from the unofficial Apple web log.",
            "So really, in this case, if you compare S2 cell here and it's two here, you can see around 3033% of their blog posts.",
            "Well.",
            "On big as compared to just 6% of these bloggers.",
            "This is quite significant statistics."
        ],
        [
            "Next, we study the.",
            "Parimeter importance what is the relative importance of these parameters in the model?",
            "Here we use Top 20 influential blog posts from our model and Top 20 blog posts that appear on Dig and then we try to do an overlap house and try to compute the overlap between these two top 20 lists for six different months starting from January 2007 to June 2007.",
            "So again, we see we use those five configurations for all in no in links, no comments, no out links and no blog post length.",
            "As you can see, for all N when you have all the parameters in the model, that that's when you get the maximum overlap, and when you remove links from the model, that's when you get the minimum overlap, which says that if you the in links are kind of most important to this model, and then if you compare with the no comments then.",
            "With if you don't have comments, then you have kind of little more overlap.",
            "Basically it says comments are next in importance to inlinks, so this way you can construct this.",
            "Perimetre relevance, it says in links of the most important highest priority as compared to comments and then blog post length is the least important."
        ],
        [
            "So having said that.",
            "Here are some of the future applications of this system.",
            "Obviously we're trying to improve this preliminary model.",
            "As Hector also mentioned that.",
            "The quality of the blog post is cannot be measured just by the length, so we can look at various other linguistic analysis tools and for the comments.",
            "Also applying to use quality versus the quantity of the comments.",
            "And then next weekend study the community evaluation of Community Evolution.",
            "Sorry for different communities in the absence or presence of these influentials how they cause topic drift in this communities."
        ],
        [
            "Obviously we can study trust and reputation given these influential bloggers may cause these influential bloggers can be trustworthy Bud.",
            "A trustworthy Blogger may or may not be influential, so we can use these important facts.",
            "And right now we're just using one one Community block site to do.",
            "So identification of influential bloggers, but we can also do a lot of connect.",
            "A lot of blog post over a topic and then try to find influential bloggers and this.",
            "Oh, collected pool of data so that we can extract experts from this domain kind of domain experts."
        ],
        [
            "So to conclude, we have seen a lot of opportunities for influential bloggers and this study an we saw that influences a very subjective concept which gives rise to a lot of challenges, like how we develop models, what kind of world we can develop, what kind of parameters we can use, how to combine these parameters in different ways to get influential bloggers of different types of new engine block bloggers?",
            "How do you evaluate and verify the model and absence of ground truth?",
            "How do resort to different alternate.",
            "Ground truths how you can build ground truths.",
            "An lost data collection is also an important issue.",
            "Thanks and I'll be happy.",
            "If you have any questions one in the back here and actually get to you.",
            "Two questions.",
            "First, it seems like you're measuring.",
            "Interesting Ness rather than influence.",
            "It seems more like you're in, especially in terms of dig.",
            "This is information that people found interesting rather than information that influenced you.",
            "Know further information and created repeatability across them across the web.",
            "That that might just be a definition thing, and also that you consider measuring sort of.",
            "You might have trouble getting to this data, but like click through in terms of with their outgoing links, you know how many people follow those and go to those sites, sort of measuring the Slashdot effect or something like that, right?",
            "Actually, you have a very interesting.",
            "Comment about the first question which is interesting this as compared to the influence.",
            "Oh it's the way you define are you perceive something which is interesting to you may be influential for other or something which is influential or may be interested.",
            "Maybe like the other way.",
            "So it's a very subjective concept as I said, but the main idea is we're trying to look for an insightful article.",
            "It may be interesting for you or maybe inferential for me, but that the main code is it's insightful and you really like to read it.",
            "And I like to read it so.",
            "Is this could be different terms you can assign to this concept an as the second comment goes about the clickthrough.",
            "We haven't really thought about that, and I guess it's an interesting thing to look at.",
            "How clickthrough will help?",
            "Actually, I'm looking at other concepts like leadership.",
            "If you can get access to these data, how the readership subscription to these blog posts?",
            "Just beside the comments.",
            "So there are vast pool of parameters which we can use to improve the model.",
            "It's just the matter of how we can get to the date and collect the data, especially when you are in academia.",
            "If you have very restricted access to the data sets.",
            "Yeah, so can you say a little bit about how you combine all those measures so you said what goes into your interestingness measure, but can you say a little bit more about how they get combined?",
            "The four distinct length of parts?",
            "Outgoing links?",
            "Incoming links?",
            "How do they come in?",
            "And also you talked about the top posts that you select for your last experiment.",
            "I might have missed it, but I didn't quite get, you know which costs you name is.",
            "Stop especially for the non influential people.",
            "OK.",
            "So the first question is about the.",
            "Model.",
            "You can always get the more details from the paper which which is there in the proceedings.",
            "But the main idea is.",
            "In the first equation you can see two components.",
            "The first one is the influence from the end links and the 2nd is the influence from the out links.",
            "So we subtract the influence from the out links from all the influence which is coming through the end links of that blog post which we call it as influence flow.",
            "For this blog post and then we add the.",
            "Contribution of.",
            "The comments to this influence and then the third equation you can see how we get we try to scale that influence by the goodness of the block post.",
            "I hope it's answers your question.",
            "OK Ann, for the next one.",
            "You're talking about this experiment.",
            "Again, this one.",
            "We take the top 20 blog posts of the influential bloggers and then compare it with the Top 20 blog posts that appear at Dig.",
            "And then study the overlap between these two lists.",
            "So according to our model.",
            "According to our model, the model which you have proposed based on that we get a list or we get scores for each of these blog posts.",
            "So for each of these blog posts we just sort them based on the score and pick the top 20.",
            "Yes, one more question here.",
            "When going through the data, did you notice any cases of spam or self promotion of Blogger that might create links and text and have maybe collude with some other bloggers to reference each other to create popularity?",
            "That's interesting observation because.",
            "The few of the block sides which we came across since they have a lot of spamming shoes and especially this block site, it has very controlled access to the block posts means you have to be registered and to post you cannot be a guest and post at this blog site so I didn't see any of these issues in these blog posts.",
            "Means very clean environment I would say but definitely means spam is an issue in this kind of research and there have been a lot of works.",
            "So as I mentioned in the future work we, I'm trying to improve the model by using the quality as well as the quantity in the parameters, not just the number of comments, but how good these comments are treated, the polarity or the opinions in these comments.",
            "OK, well let's thank our speaker and have your coffee break."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In this talk I'll introduce the problem.",
                    "label": 0
                },
                {
                    "sent": "The problem is an.",
                    "label": 0
                },
                {
                    "sent": "What is the importance of this problem?",
                    "label": 0
                },
                {
                    "sent": "And then I'll talk about the model which we have proposed.",
                    "label": 0
                },
                {
                    "sent": "The challenges that we faced for this model an the experiments, how we worked out the experiment.",
                    "label": 0
                },
                {
                    "sent": "What are the settings for the experiments and the result which we obtain an some future work.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Past 15 years computers and Internet have revolutionized the communication.",
                    "label": 1
                },
                {
                    "sent": "People can connect with each other across different time zones with all geographical barriers and this has created a humongous mesh of social interactions which people call a social network.",
                    "label": 1
                },
                {
                    "sent": "As you can see in the illustration, there are different services which revolve around Web 2.0 paradigm, which has basically catalyzed this communication, and by the ease of use interface and desktop like experience, these services like friendship, networks, blogs, wikis, collaborative tagging and media sharing.",
                    "label": 0
                },
                {
                    "sent": "In our research, we focus on blogsphere.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Block sites could be individual or community for individual blog sites.",
                    "label": 0
                },
                {
                    "sent": "These are owned and maintained by individual users as compared to community block sites, which are owned and maintained by a group of like minded users.",
                    "label": 1
                },
                {
                    "sent": "And community block sites are more like discussion forums and discussion boards where you can see high degree of group discussion and collaboration, whereas an individual block sides.",
                    "label": 0
                },
                {
                    "sent": "They're more like personal accounts, journals or Diaries.",
                    "label": 0
                },
                {
                    "sent": "An almost negligible group interaction is there.",
                    "label": 0
                },
                {
                    "sent": "We focus on Community blog sites.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To find his influential bloggers, let's consider a physical scenario where you were trying to buy a digital camera and you want this super cool camera with all these great features.",
                    "label": 0
                },
                {
                    "sent": "So in a physical world, what you would do is you would go to a domain expert or you will talk to your friends to get their reviews and feedback about this product.",
                    "label": 1
                },
                {
                    "sent": "But in a virtual world you would log onto our online community and try to find out the feedbacks of this product.",
                    "label": 1
                },
                {
                    "sent": "So now there's so many communities online and there's so many users they're giving out their feedback about this product.",
                    "label": 0
                },
                {
                    "sent": "So which one you should go with?",
                    "label": 0
                },
                {
                    "sent": "Who's feedback?",
                    "label": 0
                },
                {
                    "sent": "You should follow.",
                    "label": 0
                },
                {
                    "sent": "That is the main problem.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here we introduce this problem.",
                    "label": 0
                },
                {
                    "sent": "Inspired by the energy between this real world and the block communities, we try to answer their influential bloggers and who are these?",
                    "label": 1
                },
                {
                    "sent": "Can we find them or just active bloggers are the influential bloggers?",
                    "label": 1
                },
                {
                    "sent": "What are the differences between them?",
                    "label": 0
                },
                {
                    "sent": "An can active loggers be influential or influential luggage be active.",
                    "label": 0
                },
                {
                    "sent": "All these sort of.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Other applications for influential bloggers could be like they could be market movers.",
                    "label": 1
                },
                {
                    "sent": "They could easily spread the word about the product and they could sway opinions in a government policy or campaigns.",
                    "label": 0
                },
                {
                    "sent": "The customers they could be really helpful in customer support and troubleshooting.",
                    "label": 1
                },
                {
                    "sent": "They have really valuable feedbacks for the products which can be used by different companies for their market, research service and technology.",
                    "label": 0
                },
                {
                    "sent": "Published a report which said there around 18.6 new blog posts which appear every second.",
                    "label": 1
                },
                {
                    "sent": "So you need to find representative posts so that you can look at them there.",
                    "label": 0
                },
                {
                    "sent": "It's just not possible to look at all the posts, so these influential blog posts could be those representative articles.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So searching the influentials.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned, we have active bloggers and we have influential bloggers, so an active Blogger is easy to define just based just on the volume of posting she has.",
                    "label": 1
                },
                {
                    "sent": "And these are often listed on the blog sites.",
                    "label": 0
                },
                {
                    "sent": "Are they necessarily influential?",
                    "label": 0
                },
                {
                    "sent": "That's what we want to find out.",
                    "label": 1
                },
                {
                    "sent": "And how do we define influential Blogger?",
                    "label": 0
                },
                {
                    "sent": "By the influential posts he has submitted.",
                    "label": 0
                },
                {
                    "sent": "Obviously it's a very subjective concept.",
                    "label": 0
                },
                {
                    "sent": "What kind of statistiques can be collected and how we can use these statistiques to gauge the influence of this?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A Blogger.",
                    "label": 0
                },
                {
                    "sent": "In our study, we use four different statistics which we call social gestures.",
                    "label": 0
                },
                {
                    "sent": "1st is recognition, which is gauged by the incoming links or the citations.",
                    "label": 0
                },
                {
                    "sent": "The more influential the ring posts are, the more influential than effort.",
                    "label": 0
                },
                {
                    "sent": "Post becomes an influential Blogger is recognized by a lot of other bloggers.",
                    "label": 0
                },
                {
                    "sent": "The second is activity generation, which is basically the volume of discussion he generates, which is gauged by the number of comments he obtains on his blog posts.",
                    "label": 0
                },
                {
                    "sent": "The 3rd is a novelty which is basically the number of outlets he's using the point in order is.",
                    "label": 0
                },
                {
                    "sent": "We have done a study and it says a novel ideas exert more influence.",
                    "label": 0
                },
                {
                    "sent": "So if the idea is not very novel then it might not be very influential.",
                    "label": 0
                },
                {
                    "sent": "So we gave this by the number of outlets he is using.",
                    "label": 0
                },
                {
                    "sent": "So the large number of out links suggests that the blog post represents several other blog posts, hence less novel.",
                    "label": 0
                },
                {
                    "sent": "Eloquence, which is basically how good the blog post is right now.",
                    "label": 0
                },
                {
                    "sent": "We're using the length of the blog post, but there can be several other measures like linguistic analysis you can use to gauge the how good this blog post is.",
                    "label": 0
                },
                {
                    "sent": "Then you combine these different social gestures and then come up with the influence code for a blog post.",
                    "label": 0
                },
                {
                    "sent": "Size.",
                    "label": 0
                },
                {
                    "sent": "So can I can I have that again?",
                    "label": 0
                },
                {
                    "sent": "Or measuring goodness in terms of length?",
                    "label": 0
                },
                {
                    "sent": "I mean, I thought I would prefer the smaller blog entries concerning the casual nature of the blog post.",
                    "label": 0
                },
                {
                    "sent": "You don't have any incentive to write longer blog posts.",
                    "label": 0
                },
                {
                    "sent": "So if you're writing a lot of content, that means you really have some insight.",
                    "label": 0
                },
                {
                    "sent": "It's obviously can garble around some text, Ann, that could harm the model, but we as you can see in there for the slides, we have various parameters or weights to these parameters.",
                    "label": 0
                },
                {
                    "sent": "We can tune these weights to adjust these.",
                    "label": 0
                },
                {
                    "sent": "Parameters the contribution of these parameters, and as I said you can also include some other linguistic analysis tools to verify that this is whether it's very literally good blog post or not.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in the model.",
                    "label": 0
                },
                {
                    "sent": "As you can see.",
                    "label": 0
                },
                {
                    "sent": "We have the influence flow of a blog post B which is gauged by the influence of incoming block posts.",
                    "label": 0
                },
                {
                    "sent": "Incoming links to this blog post.",
                    "label": 0
                },
                {
                    "sent": "Then we subtract the influence of all those blog posts which he is cited to.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "Can see in the next equation the.",
                    "label": 0
                },
                {
                    "sent": "Influence flow.",
                    "label": 0
                },
                {
                    "sent": "We add the number of comments, the activity generation he has for this blog post, and the third equation can see how we have merged the quality of the blog post.",
                    "label": 0
                },
                {
                    "sent": "And basically once we have these scores, we just take the maximum and then that gives the influence score for the.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Dog.",
                    "label": 0
                },
                {
                    "sent": "So as I mentioned, are these influential bloggers simply active bloggers?",
                    "label": 1
                },
                {
                    "sent": "If not, then can the model differentiate between them?",
                    "label": 1
                },
                {
                    "sent": "Or are there different types of influential bloggers an are there temporal patterns to these different types of bloggers and what other parameters beyond what we have used can be used in the model to evolve IT?",
                    "label": 1
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are other questions like how do you evaluate, especially when there is no training test data and there's no ground truth?",
                    "label": 0
                },
                {
                    "sent": "Is there an alternative ground truth an we try to answer these questions and about the parameters can?",
                    "label": 1
                },
                {
                    "sent": "How can we determine our all of these necessary?",
                    "label": 0
                },
                {
                    "sent": "Can any of them be correlated?",
                    "label": 0
                },
                {
                    "sent": "And for our experiments we use an official Apple web log for data collection.",
                    "label": 0
                },
                {
                    "sent": "It's a.",
                    "label": 0
                },
                {
                    "sent": "Moderate size Community block site with 15 to 16 loggers an quite high.",
                    "label": 0
                },
                {
                    "sent": "Volume of postings.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in the experiments on this blog site, we also they also list top five active bloggers.",
                    "label": 0
                },
                {
                    "sent": "As you can see in the left hand side of the table, they have listed the top five active bloggers for a month for 30 days and towards the right hand side are the bloggers which are model says these are the top five influential bloggers.",
                    "label": 0
                },
                {
                    "sent": "So the names in the italics are the ones which are kind of overlap in this in these two lists.",
                    "label": 0
                },
                {
                    "sent": "So based on this these two.",
                    "label": 0
                },
                {
                    "sent": "List you can.",
                    "label": 0
                },
                {
                    "sent": "We can create four categories of bloggers.",
                    "label": 0
                },
                {
                    "sent": "First category could be active and influential bloggers which are basically these italic names which are both active as well as influential second could be inactive, but influential bloggers, those which are not active but still influential bloggers third category could be active.",
                    "label": 1
                },
                {
                    "sent": "But those who are not influential they obviously there is another category which is inactive and non influential bloggers.",
                    "label": 0
                },
                {
                    "sent": "But we don't care about those because they seldom submit blog post an.",
                    "label": 1
                },
                {
                    "sent": "However, they do not influence others.",
                    "label": 0
                },
                {
                    "sent": "There are details statistics for these four categories of bloggers which we have mentioned in the paper.",
                    "label": 0
                },
                {
                    "sent": "You can always look at the paper.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this chart.",
                    "label": 0
                },
                {
                    "sent": "We study.",
                    "label": 0
                },
                {
                    "sent": "How different parameters contribute to the system?",
                    "label": 0
                },
                {
                    "sent": "So as you can see in the X axis we have different configuration of the model where we remove each parameter at a time and generate five different configurations without links.",
                    "label": 0
                },
                {
                    "sent": "No comments, no blog post length, no inlinks, an 5th convocation where all the parameters are considered on the Y axis.",
                    "label": 0
                },
                {
                    "sent": "You can see the ranks of the top five bloggers, and as you can see no two configurations have similar.",
                    "label": 0
                },
                {
                    "sent": "So ranking for these bloggers, which says that all the all, the all the parameters are contributing.",
                    "label": 0
                },
                {
                    "sent": "In some sense.",
                    "label": 0
                },
                {
                    "sent": "There are further on the next slides I'll show you how there are some more experiments which do the correlation analysis between these parameters.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We also try to consider other parameters like rate of comments to see if that could be a possible.",
                    "label": 1
                },
                {
                    "sent": "Mom parameter to this model, but as you can see these two charts are for particular for two different influential blog posts.",
                    "label": 0
                },
                {
                    "sent": "An both of them have very different.",
                    "label": 0
                },
                {
                    "sent": "Comment reaction one has very spiky comment reaction by intuition.",
                    "label": 0
                },
                {
                    "sent": "You can always think that a very spiky comment reaction could be to a very influential blog post, but on the other hand you see a flat comment reaction to an influential blog post as well.",
                    "label": 0
                },
                {
                    "sent": "So this is not exactly a very good differentiating parameter between influential influential.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In this chart you can see the different temporal patterns of influential bloggers.",
                    "label": 1
                },
                {
                    "sent": "In the Rose you can see the.",
                    "label": 0
                },
                {
                    "sent": "By the months starting from February 2004 to January the 7th, an on the columns, you have different influential bloggers who have been influential at some point of their time.",
                    "label": 0
                },
                {
                    "sent": "So, and the color gradient shows their influence level.",
                    "label": 0
                },
                {
                    "sent": "The darker the color is, the higher the more influential they were basically.",
                    "label": 0
                },
                {
                    "sent": "So in this chart you can observe there are different kinds of influential bloggers, some are long-term or influential bloggers like this guy.",
                    "label": 0
                },
                {
                    "sent": "Who has been quite influential for longer time and some of them are.",
                    "label": 0
                },
                {
                    "sent": "Very short term or basically average influential bloggers who have been influential for some period of time and then transient influential bloggers who have been influential for very small time and then purging influential bloggers which.",
                    "label": 0
                },
                {
                    "sent": "Just started to become influential, so depending on the different marketing applications you can use these blockers for different.",
                    "label": 0
                },
                {
                    "sent": "Things.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so far we have.",
                    "label": 0
                },
                {
                    "sent": "Addressed questions like how these?",
                    "label": 0
                },
                {
                    "sent": "Influential bloggers are different from active bloggers or.",
                    "label": 0
                },
                {
                    "sent": "What are the different types of loggers?",
                    "label": 0
                },
                {
                    "sent": "But we haven't addressed the question like how we can validate this method.",
                    "label": 0
                },
                {
                    "sent": "This model, the influential Blogger which we propose, are really the information or not.",
                    "label": 0
                },
                {
                    "sent": "And specially when you have no ground truth, how we can find out these things?",
                    "label": 0
                },
                {
                    "sent": "One obvious solution is to.",
                    "label": 0
                },
                {
                    "sent": "Use a human survey.",
                    "label": 0
                },
                {
                    "sent": "You can ask the people to rank what you what your findings are, and what they think.",
                    "label": 0
                },
                {
                    "sent": "But it involves a lot of cost, effort and resources, and beyond that, it's not always guaranteed to be a fair evaluation.",
                    "label": 0
                },
                {
                    "sent": "So we need to think of something.",
                    "label": 0
                },
                {
                    "sent": "Three different like has to be a different alternate reference point for the ground truth.",
                    "label": 0
                },
                {
                    "sent": "In this case we use another Web 2.0 website which is dig.",
                    "label": 1
                },
                {
                    "sent": "Dig is all about user powered content.",
                    "label": 1
                },
                {
                    "sent": "Everything is submitted and voted on by the Community share discovered bookmark and promote stuff that is positive.",
                    "label": 1
                },
                {
                    "sent": "Basically, take is a huge user base.",
                    "label": 0
                },
                {
                    "sent": "You have a lot of collectivism.",
                    "label": 0
                },
                {
                    "sent": "People vote what they see an if an article is really important or popular, it keeps on acquiring a lot of big score and keeps on getting popular.",
                    "label": 1
                },
                {
                    "sent": "So the higher their Dicks for a blog post is, the more it is liked.",
                    "label": 0
                },
                {
                    "sent": "Or if a blog post is not on the date, that means either it's not like or it was not at all submitted.",
                    "label": 0
                },
                {
                    "sent": "So we use this Web 2.0 website.",
                    "label": 0
                },
                {
                    "sent": "They as a reference point to do our model.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The setting for this experiment is Dig Records, top 100 block posts an.",
                    "label": 0
                },
                {
                    "sent": "We have top five influential as well as five active bloggers which we use to construct four categories.",
                    "label": 0
                },
                {
                    "sent": "For each of these four categories of bloggers, we collect Top 20 blog posts from our model and compare them with their Dick Top 100.",
                    "label": 1
                },
                {
                    "sent": "So as you can see in this first table.",
                    "label": 0
                },
                {
                    "sent": "There are four categories of these bloggers.",
                    "label": 0
                },
                {
                    "sent": "Influential, active, influential, inactive, non influential, active and so on.",
                    "label": 0
                },
                {
                    "sent": "But influential and active loggers the cell S1 you can see there are.",
                    "label": 0
                },
                {
                    "sent": "17 Oh 17 blog posts that were overlapping between the top 20 blog posts of influential active as and compared to the 100 day blog posts.",
                    "label": 0
                },
                {
                    "sent": "And seven of the top 20 influential blog posts from influential and inactive loggers were found on the top 100 of Dig.",
                    "label": 0
                },
                {
                    "sent": "Similarly, in S3 you can see only three of the block Top 20 block posts submitted by non essential active loggers.",
                    "label": 0
                },
                {
                    "sent": "Appeared in the top 100 of DIG.",
                    "label": 0
                },
                {
                    "sent": "So if you compare S2 and S3, you can easily make out that being influential is more important.",
                    "label": 0
                },
                {
                    "sent": "Like if you are more influential than you are.",
                    "label": 0
                },
                {
                    "sent": "More likely to appear on day or more likely to be popular with people as compared to being active.",
                    "label": 0
                },
                {
                    "sent": "In the next 2 charts we give the distribution for top 100 block post sandigan.",
                    "label": 0
                },
                {
                    "sent": "The 535 block posts collected from the unofficial Apple web log.",
                    "label": 0
                },
                {
                    "sent": "So really, in this case, if you compare S2 cell here and it's two here, you can see around 3033% of their blog posts.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "On big as compared to just 6% of these bloggers.",
                    "label": 0
                },
                {
                    "sent": "This is quite significant statistics.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Next, we study the.",
                    "label": 0
                },
                {
                    "sent": "Parimeter importance what is the relative importance of these parameters in the model?",
                    "label": 1
                },
                {
                    "sent": "Here we use Top 20 influential blog posts from our model and Top 20 blog posts that appear on Dig and then we try to do an overlap house and try to compute the overlap between these two top 20 lists for six different months starting from January 2007 to June 2007.",
                    "label": 1
                },
                {
                    "sent": "So again, we see we use those five configurations for all in no in links, no comments, no out links and no blog post length.",
                    "label": 0
                },
                {
                    "sent": "As you can see, for all N when you have all the parameters in the model, that that's when you get the maximum overlap, and when you remove links from the model, that's when you get the minimum overlap, which says that if you the in links are kind of most important to this model, and then if you compare with the no comments then.",
                    "label": 0
                },
                {
                    "sent": "With if you don't have comments, then you have kind of little more overlap.",
                    "label": 1
                },
                {
                    "sent": "Basically it says comments are next in importance to inlinks, so this way you can construct this.",
                    "label": 0
                },
                {
                    "sent": "Perimetre relevance, it says in links of the most important highest priority as compared to comments and then blog post length is the least important.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So having said that.",
                    "label": 0
                },
                {
                    "sent": "Here are some of the future applications of this system.",
                    "label": 0
                },
                {
                    "sent": "Obviously we're trying to improve this preliminary model.",
                    "label": 1
                },
                {
                    "sent": "As Hector also mentioned that.",
                    "label": 0
                },
                {
                    "sent": "The quality of the blog post is cannot be measured just by the length, so we can look at various other linguistic analysis tools and for the comments.",
                    "label": 0
                },
                {
                    "sent": "Also applying to use quality versus the quantity of the comments.",
                    "label": 1
                },
                {
                    "sent": "And then next weekend study the community evaluation of Community Evolution.",
                    "label": 0
                },
                {
                    "sent": "Sorry for different communities in the absence or presence of these influentials how they cause topic drift in this communities.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Obviously we can study trust and reputation given these influential bloggers may cause these influential bloggers can be trustworthy Bud.",
                    "label": 1
                },
                {
                    "sent": "A trustworthy Blogger may or may not be influential, so we can use these important facts.",
                    "label": 0
                },
                {
                    "sent": "And right now we're just using one one Community block site to do.",
                    "label": 0
                },
                {
                    "sent": "So identification of influential bloggers, but we can also do a lot of connect.",
                    "label": 1
                },
                {
                    "sent": "A lot of blog post over a topic and then try to find influential bloggers and this.",
                    "label": 0
                },
                {
                    "sent": "Oh, collected pool of data so that we can extract experts from this domain kind of domain experts.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to conclude, we have seen a lot of opportunities for influential bloggers and this study an we saw that influences a very subjective concept which gives rise to a lot of challenges, like how we develop models, what kind of world we can develop, what kind of parameters we can use, how to combine these parameters in different ways to get influential bloggers of different types of new engine block bloggers?",
                    "label": 1
                },
                {
                    "sent": "How do you evaluate and verify the model and absence of ground truth?",
                    "label": 0
                },
                {
                    "sent": "How do resort to different alternate.",
                    "label": 0
                },
                {
                    "sent": "Ground truths how you can build ground truths.",
                    "label": 1
                },
                {
                    "sent": "An lost data collection is also an important issue.",
                    "label": 0
                },
                {
                    "sent": "Thanks and I'll be happy.",
                    "label": 0
                },
                {
                    "sent": "If you have any questions one in the back here and actually get to you.",
                    "label": 0
                },
                {
                    "sent": "Two questions.",
                    "label": 0
                },
                {
                    "sent": "First, it seems like you're measuring.",
                    "label": 0
                },
                {
                    "sent": "Interesting Ness rather than influence.",
                    "label": 0
                },
                {
                    "sent": "It seems more like you're in, especially in terms of dig.",
                    "label": 0
                },
                {
                    "sent": "This is information that people found interesting rather than information that influenced you.",
                    "label": 0
                },
                {
                    "sent": "Know further information and created repeatability across them across the web.",
                    "label": 0
                },
                {
                    "sent": "That that might just be a definition thing, and also that you consider measuring sort of.",
                    "label": 0
                },
                {
                    "sent": "You might have trouble getting to this data, but like click through in terms of with their outgoing links, you know how many people follow those and go to those sites, sort of measuring the Slashdot effect or something like that, right?",
                    "label": 0
                },
                {
                    "sent": "Actually, you have a very interesting.",
                    "label": 0
                },
                {
                    "sent": "Comment about the first question which is interesting this as compared to the influence.",
                    "label": 0
                },
                {
                    "sent": "Oh it's the way you define are you perceive something which is interesting to you may be influential for other or something which is influential or may be interested.",
                    "label": 0
                },
                {
                    "sent": "Maybe like the other way.",
                    "label": 0
                },
                {
                    "sent": "So it's a very subjective concept as I said, but the main idea is we're trying to look for an insightful article.",
                    "label": 0
                },
                {
                    "sent": "It may be interesting for you or maybe inferential for me, but that the main code is it's insightful and you really like to read it.",
                    "label": 0
                },
                {
                    "sent": "And I like to read it so.",
                    "label": 0
                },
                {
                    "sent": "Is this could be different terms you can assign to this concept an as the second comment goes about the clickthrough.",
                    "label": 0
                },
                {
                    "sent": "We haven't really thought about that, and I guess it's an interesting thing to look at.",
                    "label": 0
                },
                {
                    "sent": "How clickthrough will help?",
                    "label": 0
                },
                {
                    "sent": "Actually, I'm looking at other concepts like leadership.",
                    "label": 0
                },
                {
                    "sent": "If you can get access to these data, how the readership subscription to these blog posts?",
                    "label": 0
                },
                {
                    "sent": "Just beside the comments.",
                    "label": 0
                },
                {
                    "sent": "So there are vast pool of parameters which we can use to improve the model.",
                    "label": 0
                },
                {
                    "sent": "It's just the matter of how we can get to the date and collect the data, especially when you are in academia.",
                    "label": 0
                },
                {
                    "sent": "If you have very restricted access to the data sets.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so can you say a little bit about how you combine all those measures so you said what goes into your interestingness measure, but can you say a little bit more about how they get combined?",
                    "label": 0
                },
                {
                    "sent": "The four distinct length of parts?",
                    "label": 0
                },
                {
                    "sent": "Outgoing links?",
                    "label": 0
                },
                {
                    "sent": "Incoming links?",
                    "label": 0
                },
                {
                    "sent": "How do they come in?",
                    "label": 0
                },
                {
                    "sent": "And also you talked about the top posts that you select for your last experiment.",
                    "label": 0
                },
                {
                    "sent": "I might have missed it, but I didn't quite get, you know which costs you name is.",
                    "label": 0
                },
                {
                    "sent": "Stop especially for the non influential people.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So the first question is about the.",
                    "label": 0
                },
                {
                    "sent": "Model.",
                    "label": 0
                },
                {
                    "sent": "You can always get the more details from the paper which which is there in the proceedings.",
                    "label": 0
                },
                {
                    "sent": "But the main idea is.",
                    "label": 0
                },
                {
                    "sent": "In the first equation you can see two components.",
                    "label": 0
                },
                {
                    "sent": "The first one is the influence from the end links and the 2nd is the influence from the out links.",
                    "label": 0
                },
                {
                    "sent": "So we subtract the influence from the out links from all the influence which is coming through the end links of that blog post which we call it as influence flow.",
                    "label": 0
                },
                {
                    "sent": "For this blog post and then we add the.",
                    "label": 0
                },
                {
                    "sent": "Contribution of.",
                    "label": 0
                },
                {
                    "sent": "The comments to this influence and then the third equation you can see how we get we try to scale that influence by the goodness of the block post.",
                    "label": 0
                },
                {
                    "sent": "I hope it's answers your question.",
                    "label": 0
                },
                {
                    "sent": "OK Ann, for the next one.",
                    "label": 0
                },
                {
                    "sent": "You're talking about this experiment.",
                    "label": 0
                },
                {
                    "sent": "Again, this one.",
                    "label": 0
                },
                {
                    "sent": "We take the top 20 blog posts of the influential bloggers and then compare it with the Top 20 blog posts that appear at Dig.",
                    "label": 0
                },
                {
                    "sent": "And then study the overlap between these two lists.",
                    "label": 0
                },
                {
                    "sent": "So according to our model.",
                    "label": 0
                },
                {
                    "sent": "According to our model, the model which you have proposed based on that we get a list or we get scores for each of these blog posts.",
                    "label": 0
                },
                {
                    "sent": "So for each of these blog posts we just sort them based on the score and pick the top 20.",
                    "label": 0
                },
                {
                    "sent": "Yes, one more question here.",
                    "label": 0
                },
                {
                    "sent": "When going through the data, did you notice any cases of spam or self promotion of Blogger that might create links and text and have maybe collude with some other bloggers to reference each other to create popularity?",
                    "label": 0
                },
                {
                    "sent": "That's interesting observation because.",
                    "label": 0
                },
                {
                    "sent": "The few of the block sides which we came across since they have a lot of spamming shoes and especially this block site, it has very controlled access to the block posts means you have to be registered and to post you cannot be a guest and post at this blog site so I didn't see any of these issues in these blog posts.",
                    "label": 0
                },
                {
                    "sent": "Means very clean environment I would say but definitely means spam is an issue in this kind of research and there have been a lot of works.",
                    "label": 0
                },
                {
                    "sent": "So as I mentioned in the future work we, I'm trying to improve the model by using the quality as well as the quantity in the parameters, not just the number of comments, but how good these comments are treated, the polarity or the opinions in these comments.",
                    "label": 0
                },
                {
                    "sent": "OK, well let's thank our speaker and have your coffee break.",
                    "label": 0
                }
            ]
        }
    }
}