{
    "id": "j4gtda7264u26c7giv6ytwitttcywfdj",
    "title": "Single atom manipulation and spectroscopy using low-temperature STM",
    "info": {
        "author": [
            "Erik Zupanič, Condensed Matter Physics, Jožef Stefan Institute"
        ],
        "published": "Feb. 12, 2008",
        "recorded": "October 2007",
        "category": [
            "Top->Technology->Nanotechnology"
        ]
    },
    "url": "http://videolectures.net/slonano07_zupanic_sam/",
    "segmentation": [
        [
            "So first of all, thank you for coming today.",
            "I intend to present some recent achievements of our low temperature race team group.",
            "Other members are rujeko, Herman Vermillion, Professor Abbott Road and then professor message.",
            "First of all, I will explain some basics about scanning, tunneling microscopy and spectroscopy.",
            "Then we represent different manipulation techniques that can be applied with STM.",
            "Then I will show you some results of single molecule.",
            "Manipulation in."
        ],
        [
            "Spectroscopy.",
            "Um?",
            "The the mechanisms behind mechanism behind the estimate duration is the so called tunneling effect.",
            "This is a quantum mechanical effect.",
            "That can allow electron tour come a potential barrier even if his energy is lower than the energy of this barrier in accordance to begin stumbling formalism, the tunneling Kirby.",
            "The tunneling current can be written in this in this way, but let's look at the simplified equation.",
            "We see that determining current is linearly dependent on the voltage between the tip and the sample, and exponentially dependent on the distance between the two electrodes.",
            "So the one electorate is the metallic tip and the other electrode is the sample.",
            "So this exponential dependence is the reason for very high vertical resolution of such microscope.",
            "So just to show you an animation.",
            "You see a metallic tip that is scanning over the surface.",
            "The deep end surface are very close together, but are not touching, so from from the from the magnitude of the tunneling current we can somehow broke the sample surface, but you can of course see that the tunneling current is not only dependent on the distance between the two electrodes, but also but also on the density of states of both the sample and the tip.",
            "So the image you get from the STM is always a convolution of of surface topography and electronics."
        ],
        [
            "Picture of the sample.",
            "Um?",
            "Just some basic about the dynamic spectroscopy.",
            "Again, the equation of Fulton and current, written in a little bit different.",
            "You see density of states of the tip.",
            "We can presume that somehow the tip is is is metallic, so the density of states is constant and these are the density of states of the sample.",
            "So if you keep the distance constant between the tip and the sample.",
            "Weekend we can do mainly sweep the sample bias measured the tunneling current, and when we make the first derivative, this first derivative, the raft conductance, is proportional to the local density of states while local because the SMTP is very sharp.",
            "So basically you're making your measuring locally.",
            "You can measure the the the timing.",
            "The recipe of even single atoms that gives you information on energy gap, chemical composition, bonding and."
        ],
        [
            "A lot of other stuff, so trying to answer to the question why STM?",
            "STM allows us to do space atomic resolution imaging.",
            "It allows us to probe electronic structure through measuring local density of electronic states.",
            "It allows us to investigate physical and chemical properties at atomic level and what is most interesting for us.",
            "It allows atomic and molecular manipulation so.",
            "Answer To the question why manipulation?",
            "But constructing the atomic scale structures, we can study the quantum phenomena so the atoms are the basic building blocks of all matter.",
            "So knowing the principles on basic level is essential for in material science, physics and so on we can.",
            "You can induce with the STM single monocle chemical reactions which gives insight into the reaction mechanism at a fundamental level.",
            "With STM you can you can break or even form chemical bonds.",
            "You can study molecular nanomachines."
        ],
        [
            "And of course, manipulation at atomic level could be fun.",
            "So just to present to our SM laboratory, we have two microscopes, one room temperature omikron the other one is home built, low temperature bazooka type.",
            "This is the STM measuring cat.",
            "Um, we're doing.",
            "We are doing measurements and are very clean conditions.",
            "The base pressure is below 10 to minus 10 millibars and the working temperature of our microscope is around 9 carryings.",
            "We also have low electron low energy electron diffraction and gentran spectral meter.",
            "So these are two surface techniques.",
            "We checked the chemistry and structure of the surface with them.",
            "Then we have an iron gun.",
            "We have to clean our samples.",
            "We do that with.",
            "I'm done then we have gluten in the Fusion cells for sub monolayer deposits.",
            "The position of atoms."
        ],
        [
            "Or organic molecules.",
            "So.",
            "Talking about different manipulation techniques by carefully controlling the interaction, quantum mechanical interactions between the tip and the sample, we can literally manipulate.",
            "That means we can move the atoms and molecules on the surface.",
            "We can push them, or we can pull them.",
            "We can transfer the item from the surface to the tip and vice versa.",
            "We can change the confirmation of individual molecules and very interesting we can do single molecule chemistry so.",
            "Break or form chemical."
        ],
        [
            "Once.",
            "The mechanisms of manipulation with STM can be roughly divided into three groups, so we can use chemical forces between the tip and its orbits, so repulsive or attractive.",
            "This is used for retro manipulation or conformational changes of molecules.",
            "We can use tunneling electrons.",
            "We can inject them into the molecules, and in this way we can break, perform bonds, or we can.",
            "Sometimes this electric field between the tip and the sample for field assisted diffusion."
        ],
        [
            "So we have two basic modes of lateral manipulation pushing and pulling mode.",
            "In pulling in, pushing him out, the repulsive forces coming to play.",
            "So basically we approach the tip closer to the surface and push the Atom in front of the tip in pulling mode, attractive forces come into play, so the Atom is following the path of the tip.",
            "So by by recording the tunneling current during this manipulation process, we can clearly distinguish the two processes.",
            "So basically what is happening here is a picture of closed packed one on one surface.",
            "This is gold, one on one surface you see close back rows of atoms on 60 degrees and the atoms are sitting in this positions.",
            "This at places.",
            "So when you move the tip.",
            "On a straight line, the Atom is basically jumping from one to the other stable position, so the Atom is never never following the tip in a straight line, but rather rather somehow following through this stable positions the force needed for an item to hop from one to the other.",
            "Stable position is about 0.5 nano newtons."
        ],
        [
            "So just some experimental details.",
            "We use single crystal Noble metals.",
            "True experiments in Capital One online services.",
            "They had high purity polished introduce them into Ultra high vacuum system, there in situ cleaned by cycle sophian, spattering continuing the surface structure in chemistry is controlled by little measure when we have clean flat surface is we operate with miss and sorcery Fusion cell atoms or molecules.",
            "Or we can show you later produce add items by controlled.",
            "Deep crashing into."
        ],
        [
            "Surface.",
            "So this is just how clean and flat copper surface look looks like.",
            "These are terraces.",
            "You see there almost defect free.",
            "These are monotonic steps.",
            "So this is one layer.",
            "Second foot and so on, of copper atoms.",
            "This is the magnified area.",
            "6 by 6 nanometers.",
            "These are the individual individual atoms, so these are items on the surface.",
            "OK you can."
        ],
        [
            "Of course, make some nice through the pictures in color.",
            "First of all, we deposited some Co molecules on the surface.",
            "These are these black dots.",
            "If you magnify you see this picture.",
            "This picture was taken at 25 kelvins and as you can see, this steam temperature is too high for the manipulation of of molecules because they tend to move so the diffusion coefficient is still high enough so they're just moving around so."
        ],
        [
            "So I want to show you the manipulation with your molecules.",
            "I will, I'll show you the the LDA item extraction process.",
            "So, um.",
            "Keep crashing, controlled creation is often used for deep conditioning, so be carefully dipping the tip into the surface.",
            "We can cover the the tip with the material from the surface.",
            "Here you see a hole that was left behind when such a deep forming procedure was was applied.",
            "So all the material from this whole is on the on the STM tip so but you see some some items in some some agglomerates also from this material by wearing the conditions during that information you can produce single add items around round hole and these are the items we are interest."
        ],
        [
            "This is a magnified area.",
            "These are individual corporations on copper, one on one surface, recorded at low temperatures.",
            "So how do manipulation looks like?",
            "First of all, we take a picture of area of interest.",
            "Then we move the STM tip to the starting position market circle, lower the tip, move to the final position retractive and take the picture again.",
            "And as you can see from these two pictures, this Atom was moved from left to the right.",
            "So in this case the Atom was I think pushed in front of the."
        ],
        [
            "STM tip here is the first successful.",
            "Successful manipulation and.",
            "This is the Institute Stephen Sign composed of individual corporations.",
            "On this right picture, you can very beautifully see this standing electron wave.",
            "This is the Friday last relation.",
            "This is because of the quantum interference of the surface select."
        ],
        [
            "States.",
            "These are some some other pictures.",
            "They were just for."
        ],
        [
            "For testing and for.",
            "Oh OK, so I'm running out of time.",
            "I will quickly show you some spectroscopy measurements.",
            "The cobalt was evaporated from cotton source and clean copper surface.",
            "He received individual copper atoms in reserve.",
            "The agglomerates they usually tend to form this kind of violence, two monolayers high and we wanted to study the the local structure of clean copper surface, cobalt island and even individual."
        ],
        [
            "Cobalt atoms individual covered patterns can be extracted from this agglomerates with the tip.",
            "Um, so I won't go into details.",
            "Color one and three are recorded on a clean surface.",
            "You see that the curves are basically fully reproducible.",
            "You see some distinctive features.",
            "Like this sharp drop at about 417 year olds.",
            "And this red curve is taken on the Cobalt Island again.",
            "This peak is very characteristic and in this way you can of course distinguish between the covert islands."
        ],
        [
            "And the surface in the next picture.",
            "Shows a the the black is the curve Spectra recorded at clean surface and the red one is recorded on a cobalt Atom.",
            "You see a resonance centered somewhere around the Fermi level, so this can be explained in terms of Kondo effect.",
            "Again, I won't go into details.",
            "You say that Spanish dining spectroscopy can be a nice tool to distinguish between different different."
        ],
        [
            "Items in this case, so just to conclude, I showed that STM can be a very powerful nanotechnological tool.",
            "It allows us not only atomic scale imaging and characterization, but also building nanostructures from single atoms and molecules, so I hope I'll proceed with you that somehow we have the knowledge and the technology to do experiments at the atomic level.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first of all, thank you for coming today.",
                    "label": 0
                },
                {
                    "sent": "I intend to present some recent achievements of our low temperature race team group.",
                    "label": 1
                },
                {
                    "sent": "Other members are rujeko, Herman Vermillion, Professor Abbott Road and then professor message.",
                    "label": 1
                },
                {
                    "sent": "First of all, I will explain some basics about scanning, tunneling microscopy and spectroscopy.",
                    "label": 0
                },
                {
                    "sent": "Then we represent different manipulation techniques that can be applied with STM.",
                    "label": 0
                },
                {
                    "sent": "Then I will show you some results of single molecule.",
                    "label": 0
                },
                {
                    "sent": "Manipulation in.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Spectroscopy.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "The the mechanisms behind mechanism behind the estimate duration is the so called tunneling effect.",
                    "label": 0
                },
                {
                    "sent": "This is a quantum mechanical effect.",
                    "label": 0
                },
                {
                    "sent": "That can allow electron tour come a potential barrier even if his energy is lower than the energy of this barrier in accordance to begin stumbling formalism, the tunneling Kirby.",
                    "label": 0
                },
                {
                    "sent": "The tunneling current can be written in this in this way, but let's look at the simplified equation.",
                    "label": 0
                },
                {
                    "sent": "We see that determining current is linearly dependent on the voltage between the tip and the sample, and exponentially dependent on the distance between the two electrodes.",
                    "label": 0
                },
                {
                    "sent": "So the one electorate is the metallic tip and the other electrode is the sample.",
                    "label": 0
                },
                {
                    "sent": "So this exponential dependence is the reason for very high vertical resolution of such microscope.",
                    "label": 0
                },
                {
                    "sent": "So just to show you an animation.",
                    "label": 0
                },
                {
                    "sent": "You see a metallic tip that is scanning over the surface.",
                    "label": 0
                },
                {
                    "sent": "The deep end surface are very close together, but are not touching, so from from the from the magnitude of the tunneling current we can somehow broke the sample surface, but you can of course see that the tunneling current is not only dependent on the distance between the two electrodes, but also but also on the density of states of both the sample and the tip.",
                    "label": 0
                },
                {
                    "sent": "So the image you get from the STM is always a convolution of of surface topography and electronics.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Picture of the sample.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Just some basic about the dynamic spectroscopy.",
                    "label": 0
                },
                {
                    "sent": "Again, the equation of Fulton and current, written in a little bit different.",
                    "label": 0
                },
                {
                    "sent": "You see density of states of the tip.",
                    "label": 0
                },
                {
                    "sent": "We can presume that somehow the tip is is is metallic, so the density of states is constant and these are the density of states of the sample.",
                    "label": 0
                },
                {
                    "sent": "So if you keep the distance constant between the tip and the sample.",
                    "label": 0
                },
                {
                    "sent": "Weekend we can do mainly sweep the sample bias measured the tunneling current, and when we make the first derivative, this first derivative, the raft conductance, is proportional to the local density of states while local because the SMTP is very sharp.",
                    "label": 0
                },
                {
                    "sent": "So basically you're making your measuring locally.",
                    "label": 0
                },
                {
                    "sent": "You can measure the the the timing.",
                    "label": 0
                },
                {
                    "sent": "The recipe of even single atoms that gives you information on energy gap, chemical composition, bonding and.",
                    "label": 1
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A lot of other stuff, so trying to answer to the question why STM?",
                    "label": 0
                },
                {
                    "sent": "STM allows us to do space atomic resolution imaging.",
                    "label": 0
                },
                {
                    "sent": "It allows us to probe electronic structure through measuring local density of electronic states.",
                    "label": 1
                },
                {
                    "sent": "It allows us to investigate physical and chemical properties at atomic level and what is most interesting for us.",
                    "label": 1
                },
                {
                    "sent": "It allows atomic and molecular manipulation so.",
                    "label": 0
                },
                {
                    "sent": "Answer To the question why manipulation?",
                    "label": 0
                },
                {
                    "sent": "But constructing the atomic scale structures, we can study the quantum phenomena so the atoms are the basic building blocks of all matter.",
                    "label": 0
                },
                {
                    "sent": "So knowing the principles on basic level is essential for in material science, physics and so on we can.",
                    "label": 0
                },
                {
                    "sent": "You can induce with the STM single monocle chemical reactions which gives insight into the reaction mechanism at a fundamental level.",
                    "label": 1
                },
                {
                    "sent": "With STM you can you can break or even form chemical bonds.",
                    "label": 0
                },
                {
                    "sent": "You can study molecular nanomachines.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course, manipulation at atomic level could be fun.",
                    "label": 0
                },
                {
                    "sent": "So just to present to our SM laboratory, we have two microscopes, one room temperature omikron the other one is home built, low temperature bazooka type.",
                    "label": 0
                },
                {
                    "sent": "This is the STM measuring cat.",
                    "label": 0
                },
                {
                    "sent": "Um, we're doing.",
                    "label": 0
                },
                {
                    "sent": "We are doing measurements and are very clean conditions.",
                    "label": 0
                },
                {
                    "sent": "The base pressure is below 10 to minus 10 millibars and the working temperature of our microscope is around 9 carryings.",
                    "label": 0
                },
                {
                    "sent": "We also have low electron low energy electron diffraction and gentran spectral meter.",
                    "label": 0
                },
                {
                    "sent": "So these are two surface techniques.",
                    "label": 0
                },
                {
                    "sent": "We checked the chemistry and structure of the surface with them.",
                    "label": 0
                },
                {
                    "sent": "Then we have an iron gun.",
                    "label": 0
                },
                {
                    "sent": "We have to clean our samples.",
                    "label": 0
                },
                {
                    "sent": "We do that with.",
                    "label": 0
                },
                {
                    "sent": "I'm done then we have gluten in the Fusion cells for sub monolayer deposits.",
                    "label": 0
                },
                {
                    "sent": "The position of atoms.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or organic molecules.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Talking about different manipulation techniques by carefully controlling the interaction, quantum mechanical interactions between the tip and the sample, we can literally manipulate.",
                    "label": 1
                },
                {
                    "sent": "That means we can move the atoms and molecules on the surface.",
                    "label": 0
                },
                {
                    "sent": "We can push them, or we can pull them.",
                    "label": 0
                },
                {
                    "sent": "We can transfer the item from the surface to the tip and vice versa.",
                    "label": 0
                },
                {
                    "sent": "We can change the confirmation of individual molecules and very interesting we can do single molecule chemistry so.",
                    "label": 0
                },
                {
                    "sent": "Break or form chemical.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Once.",
                    "label": 0
                },
                {
                    "sent": "The mechanisms of manipulation with STM can be roughly divided into three groups, so we can use chemical forces between the tip and its orbits, so repulsive or attractive.",
                    "label": 0
                },
                {
                    "sent": "This is used for retro manipulation or conformational changes of molecules.",
                    "label": 1
                },
                {
                    "sent": "We can use tunneling electrons.",
                    "label": 0
                },
                {
                    "sent": "We can inject them into the molecules, and in this way we can break, perform bonds, or we can.",
                    "label": 0
                },
                {
                    "sent": "Sometimes this electric field between the tip and the sample for field assisted diffusion.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we have two basic modes of lateral manipulation pushing and pulling mode.",
                    "label": 0
                },
                {
                    "sent": "In pulling in, pushing him out, the repulsive forces coming to play.",
                    "label": 0
                },
                {
                    "sent": "So basically we approach the tip closer to the surface and push the Atom in front of the tip in pulling mode, attractive forces come into play, so the Atom is following the path of the tip.",
                    "label": 0
                },
                {
                    "sent": "So by by recording the tunneling current during this manipulation process, we can clearly distinguish the two processes.",
                    "label": 0
                },
                {
                    "sent": "So basically what is happening here is a picture of closed packed one on one surface.",
                    "label": 0
                },
                {
                    "sent": "This is gold, one on one surface you see close back rows of atoms on 60 degrees and the atoms are sitting in this positions.",
                    "label": 0
                },
                {
                    "sent": "This at places.",
                    "label": 0
                },
                {
                    "sent": "So when you move the tip.",
                    "label": 0
                },
                {
                    "sent": "On a straight line, the Atom is basically jumping from one to the other stable position, so the Atom is never never following the tip in a straight line, but rather rather somehow following through this stable positions the force needed for an item to hop from one to the other.",
                    "label": 0
                },
                {
                    "sent": "Stable position is about 0.5 nano newtons.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So just some experimental details.",
                    "label": 0
                },
                {
                    "sent": "We use single crystal Noble metals.",
                    "label": 0
                },
                {
                    "sent": "True experiments in Capital One online services.",
                    "label": 0
                },
                {
                    "sent": "They had high purity polished introduce them into Ultra high vacuum system, there in situ cleaned by cycle sophian, spattering continuing the surface structure in chemistry is controlled by little measure when we have clean flat surface is we operate with miss and sorcery Fusion cell atoms or molecules.",
                    "label": 0
                },
                {
                    "sent": "Or we can show you later produce add items by controlled.",
                    "label": 0
                },
                {
                    "sent": "Deep crashing into.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Surface.",
                    "label": 0
                },
                {
                    "sent": "So this is just how clean and flat copper surface look looks like.",
                    "label": 0
                },
                {
                    "sent": "These are terraces.",
                    "label": 0
                },
                {
                    "sent": "You see there almost defect free.",
                    "label": 0
                },
                {
                    "sent": "These are monotonic steps.",
                    "label": 0
                },
                {
                    "sent": "So this is one layer.",
                    "label": 0
                },
                {
                    "sent": "Second foot and so on, of copper atoms.",
                    "label": 0
                },
                {
                    "sent": "This is the magnified area.",
                    "label": 0
                },
                {
                    "sent": "6 by 6 nanometers.",
                    "label": 0
                },
                {
                    "sent": "These are the individual individual atoms, so these are items on the surface.",
                    "label": 0
                },
                {
                    "sent": "OK you can.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of course, make some nice through the pictures in color.",
                    "label": 0
                },
                {
                    "sent": "First of all, we deposited some Co molecules on the surface.",
                    "label": 1
                },
                {
                    "sent": "These are these black dots.",
                    "label": 0
                },
                {
                    "sent": "If you magnify you see this picture.",
                    "label": 0
                },
                {
                    "sent": "This picture was taken at 25 kelvins and as you can see, this steam temperature is too high for the manipulation of of molecules because they tend to move so the diffusion coefficient is still high enough so they're just moving around so.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I want to show you the manipulation with your molecules.",
                    "label": 0
                },
                {
                    "sent": "I will, I'll show you the the LDA item extraction process.",
                    "label": 0
                },
                {
                    "sent": "So, um.",
                    "label": 0
                },
                {
                    "sent": "Keep crashing, controlled creation is often used for deep conditioning, so be carefully dipping the tip into the surface.",
                    "label": 0
                },
                {
                    "sent": "We can cover the the tip with the material from the surface.",
                    "label": 0
                },
                {
                    "sent": "Here you see a hole that was left behind when such a deep forming procedure was was applied.",
                    "label": 0
                },
                {
                    "sent": "So all the material from this whole is on the on the STM tip so but you see some some items in some some agglomerates also from this material by wearing the conditions during that information you can produce single add items around round hole and these are the items we are interest.",
                    "label": 1
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a magnified area.",
                    "label": 0
                },
                {
                    "sent": "These are individual corporations on copper, one on one surface, recorded at low temperatures.",
                    "label": 0
                },
                {
                    "sent": "So how do manipulation looks like?",
                    "label": 0
                },
                {
                    "sent": "First of all, we take a picture of area of interest.",
                    "label": 0
                },
                {
                    "sent": "Then we move the STM tip to the starting position market circle, lower the tip, move to the final position retractive and take the picture again.",
                    "label": 0
                },
                {
                    "sent": "And as you can see from these two pictures, this Atom was moved from left to the right.",
                    "label": 0
                },
                {
                    "sent": "So in this case the Atom was I think pushed in front of the.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "STM tip here is the first successful.",
                    "label": 0
                },
                {
                    "sent": "Successful manipulation and.",
                    "label": 0
                },
                {
                    "sent": "This is the Institute Stephen Sign composed of individual corporations.",
                    "label": 0
                },
                {
                    "sent": "On this right picture, you can very beautifully see this standing electron wave.",
                    "label": 0
                },
                {
                    "sent": "This is the Friday last relation.",
                    "label": 0
                },
                {
                    "sent": "This is because of the quantum interference of the surface select.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "States.",
                    "label": 0
                },
                {
                    "sent": "These are some some other pictures.",
                    "label": 0
                },
                {
                    "sent": "They were just for.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For testing and for.",
                    "label": 0
                },
                {
                    "sent": "Oh OK, so I'm running out of time.",
                    "label": 0
                },
                {
                    "sent": "I will quickly show you some spectroscopy measurements.",
                    "label": 0
                },
                {
                    "sent": "The cobalt was evaporated from cotton source and clean copper surface.",
                    "label": 0
                },
                {
                    "sent": "He received individual copper atoms in reserve.",
                    "label": 0
                },
                {
                    "sent": "The agglomerates they usually tend to form this kind of violence, two monolayers high and we wanted to study the the local structure of clean copper surface, cobalt island and even individual.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cobalt atoms individual covered patterns can be extracted from this agglomerates with the tip.",
                    "label": 0
                },
                {
                    "sent": "Um, so I won't go into details.",
                    "label": 0
                },
                {
                    "sent": "Color one and three are recorded on a clean surface.",
                    "label": 0
                },
                {
                    "sent": "You see that the curves are basically fully reproducible.",
                    "label": 0
                },
                {
                    "sent": "You see some distinctive features.",
                    "label": 0
                },
                {
                    "sent": "Like this sharp drop at about 417 year olds.",
                    "label": 0
                },
                {
                    "sent": "And this red curve is taken on the Cobalt Island again.",
                    "label": 0
                },
                {
                    "sent": "This peak is very characteristic and in this way you can of course distinguish between the covert islands.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the surface in the next picture.",
                    "label": 0
                },
                {
                    "sent": "Shows a the the black is the curve Spectra recorded at clean surface and the red one is recorded on a cobalt Atom.",
                    "label": 0
                },
                {
                    "sent": "You see a resonance centered somewhere around the Fermi level, so this can be explained in terms of Kondo effect.",
                    "label": 0
                },
                {
                    "sent": "Again, I won't go into details.",
                    "label": 0
                },
                {
                    "sent": "You say that Spanish dining spectroscopy can be a nice tool to distinguish between different different.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Items in this case, so just to conclude, I showed that STM can be a very powerful nanotechnological tool.",
                    "label": 0
                },
                {
                    "sent": "It allows us not only atomic scale imaging and characterization, but also building nanostructures from single atoms and molecules, so I hope I'll proceed with you that somehow we have the knowledge and the technology to do experiments at the atomic level.",
                    "label": 1
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}