{
    "id": "j7u6cxi7eiomyf2ctqnvjjn3gfssmrwx",
    "title": "The Big Questions in Computation, Intelligence and Life",
    "info": {
        "author": [
            "Samson Abramsky, Department of Computer Science, University of Oxford"
        ],
        "published": "Aug. 14, 2012",
        "recorded": "June 2012",
        "category": [
            "Top->Computer Science->Artificial Intelligence"
        ]
    },
    "url": "http://videolectures.net/turing100_abramsky_big_questions/",
    "segmentation": [
        [
            "So."
        ],
        [
            "So I want to try and present two questions that appeal to me as big questions, both relating to computation.",
            "I think there's a general issue with big questions.",
            "There's a tension between.",
            "The question being big and the question being something we can actually address with some possibility of making progress, and much of the art of science is finding the right sort of points of balance at a given stage.",
            "So I think the two things."
        ],
        [
            "Yes, I'm going to try and mention.",
            "Perhaps do have some possibility of progress inducing to me to be."
        ],
        [
            "Of quite large import, the first one concerns takes us right from Turing's central analysis of computer bility.",
            "And sort of recasts the problem in according to modern concerns as they developed in computer science.",
            "Turing analyzed the compute ability of numbers as in his famous paper or functions or sets.",
            "In other words that kind of objects that we already knew from mathematics and logic and that was a perfect extra abstraction of the things that we originally sought to do with computers.",
            "We would feed an input in, perform a computation typically off some mathematical function.",
            "And then obtain the result.",
            "But as we know, computing is moved on a long way.",
            "We do different kinds of things.",
            "With computers, we have the Internet, the web, and million other things.",
            "So we have a changing face of comp."
        ],
        [
            "Mutation and what comes out of us as a sort of much wider Panorama of computation is the idea of a process."
        ],
        [
            "And computer science asks this broader question, what is a process?",
            "And we don't have that."
        ],
        [
            "And answers things stand."
        ],
        [
            "This broader idea of a process causes its purpose not to compute."
        ],
        [
            "Function, but to exhibit some."
        ],
        [
            "Behavior which can be of many very rich and varied kinds.",
            "It isn't a very sensible question to ask which function does the Internet compute, that's not."
        ],
        [
            "Useful way of describing what's going on, and if we think of the rich variety of software that we use on an everyday basis."
        ],
        [
            "This becomes fairly clear, so if we come back to the question of what is a process where our two process is equivalent and so forth, we don't have ready."
        ],
        [
            "Hey dancers, from.",
            "From"
        ],
        [
            "Mathematics and logic.",
            "There's no well developed mathematical theory of what processes are despite several decades of well, I mean there is.",
            "There is a many mathematical theories of what processes are, but there's no definitive answer and no pre established mathematical theory that computer science could lean on.",
            "That's why there's been so much work in computer science."
        ],
        [
            "Pressing this issue so the situation is very different so that which was found in compute ability theory developed by Turing and the other pioneers.",
            "One often speaks in compute ability of the confluence of notions this wonderful way that different reasonable answers to the question of what is a computable function or lead to the same notion, which is one thing that convinces us of the robustness of the analysis given by touring and the other pioneers.",
            "What we find in in the world of process is.",
            "Is rather a non confluence of notions in."
        ],
        [
            "Ability theory.",
            "We have a definitive calculus for functions.",
            "The Lambda calculus were one of the original formalisms for compute ability given by church.",
            "So once of the Church Turing thesis.",
            "Despite much brilliant."
        ],
        [
            "Work amount."
        ],
        [
            "Active research in."
        ],
        [
            "Concurrency theory in process is."
        ],
        [
            "One cannot help noticing that there's a great diversity of different process calculi.",
            "Different answers to the questions of when two processes are the same, different kinds of."
        ],
        [
            "Searching for reasoning about process is and despite again many brilliant efforts by many people, no definitive calc."
        ],
        [
            "This fall, the world of concurrency has emerged, and more broadly than this, in terms of even a plausible church Turing thesis for spanning the space of possibilities of the different kinds of process is different kinds of interaction, synchrony, asynchrony and all the rest of it.",
            "There isn't really a plausible candidate for something that is universally expressive, and which will subsume everything that."
        ],
        [
            "Been down in this field.",
            "We can speak of the next 700 syndrome, remembering a classic paper by Peter Landin, another pioneer of the subject from 1966, when he wrote a paper called the Next 700 Programming languages, reminding us that by 1966 they had already been 700 programming languages.",
            "They've been an awful lot more since then, and this is a sort of syndrome that is proper."
        ],
        [
            "Gated itself in in computer science, so I think the quest for a church Turing thesis for concurrency and for a kind of definitive answer to the question of water process is which will have the same kind of status that compute ability of functions house in the present day is a very challenging problem, and one where there's where we will need a new touring or perhaps several new.",
            "Turing's in fact well maybe sceptical, and wonder whether a good answer of the same quality can be found.",
            "At any rate, I do think it's a.",
            "It's a big.",
            "It's a big question about a big challenge for the computer science of the future and if I have a minute.",
            "Then I'll."
        ],
        [
            "Answer my other question which is of a slightly different flavor."
        ],
        [
            "But this comes from one of the exciting current developments in computation quantum computation, where we take seriously the fact that our computing systems are physically embodied and therefore ultimately run according to the laws of quantum mechanics rather than classical mechanics.",
            "Feynman famously said that Turing's analysis of computation in terms of pencil and paper and writing in squares and so on was impeccable, except it assumed that we understand paper and pencil.",
            "So implicitly, we're assuming some kind of class."
        ],
        [
            "Cool background.",
            "I'm one of the remarkable and disturbing things we get from quantum mechanics is that we are forced to accept contextuality and we sort of know this from remarkable results by various people coming from Bellwood, Coach Inspector and others.",
            "But whether we've absorbed this lesson or what its implications are, I think is another matter.",
            "So in simple terms, this is saying.",
            "Do physical variables and ultimately there any kind of variable that we can measure.",
            "Observe being in a computational system or anything else must be physically embodied.",
            "So do they have definite values independently of how we choose to measure them?",
            "And this is a basic tenet of a realistic view of the world, and perhaps have common sense."
        ],
        [
            "The quantum mechanics says there, and the challenge is how can we understand this contextuality and even more so perhaps how we can use it to some computational advantage we've understood began to understand in the work on quantum information and computation, how to use the phenomenon of entanglement, which is intimately linked with this contextuality.",
            "But this broader notion, I think, is something that is still poorly understood.",
            "People are just beginning to do experimental tests for contextuality of a broader nature than those.",
            "Those relating to Bell's theorem in a non locality."
        ],
        [
            "So I went trying."
        ],
        [
            "To sort of explain this, but this is a simple example.",
            "Actually construction essentially due to Lucien Hardy, which shows that with Alice and Bob making choices of measurement sexes and wise and then observing outcomes red or green by the various choices of the measurements that they make, they can produce a pattern of possible and impossible results.",
            "So 0 means impossible probability 01 means may happen, perhaps with some probability and there is simply no are no possibility of an underlying way of describing.",
            "Definite values to all the variables independently of our choice of which ones we happen to measure, which will be consistent with what their simple kind of table tells us.",
            "And yet this table is something that can be realized in quantum mechanics and situations of this kind have been experimentally verified, so a simple demonstration of quite a conceptually disturbing phenomena."
        ],
        [
            "And just to, I mean, you may feel that these are technical questions, perhaps of a narrow nature, but I actually feel this is not true."
        ],
        [
            "We could even relate it to some broad themes in philosophy if we're so inclined.",
            "I mean, although I do so with some trepidation, traditionally we view.",
            "The world is made of objects and their properties and realism implies that properties are objectively things that hold of objects independently of observe."
        ],
        [
            "And there were challenging both those basic points because by taking processes as primary.",
            "We're taking a different for you from the idea that what the basic stuff out there is things and their properties.",
            "It's it's linked to the idea that we take relations as basic, but one of the drawbacks of the idea of a relational view of the world is one of the relations between, so they often taken to presuppose object.",
            "But I think taking process is as primary gives us a way of thinking of the world in the relational fashion without assuming relata."
        ],
        [
            "And again, take."
        ],
        [
            "Contextuality as primary I think is, is deeply puzzling and something that we haven't really come to terms with.",
            "So I think on a broader perspective, the question is we want to want to sort of push it out as a big question, can we rethink the way we think about the world in these kind of terms?",
            "There's a Fortunately there is scientific content that we can address in the realm of computation, so that's what I wanted to say.",
            "Thanks very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I want to try and present two questions that appeal to me as big questions, both relating to computation.",
                    "label": 1
                },
                {
                    "sent": "I think there's a general issue with big questions.",
                    "label": 1
                },
                {
                    "sent": "There's a tension between.",
                    "label": 0
                },
                {
                    "sent": "The question being big and the question being something we can actually address with some possibility of making progress, and much of the art of science is finding the right sort of points of balance at a given stage.",
                    "label": 0
                },
                {
                    "sent": "So I think the two things.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yes, I'm going to try and mention.",
                    "label": 0
                },
                {
                    "sent": "Perhaps do have some possibility of progress inducing to me to be.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of quite large import, the first one concerns takes us right from Turing's central analysis of computer bility.",
                    "label": 1
                },
                {
                    "sent": "And sort of recasts the problem in according to modern concerns as they developed in computer science.",
                    "label": 1
                },
                {
                    "sent": "Turing analyzed the compute ability of numbers as in his famous paper or functions or sets.",
                    "label": 0
                },
                {
                    "sent": "In other words that kind of objects that we already knew from mathematics and logic and that was a perfect extra abstraction of the things that we originally sought to do with computers.",
                    "label": 0
                },
                {
                    "sent": "We would feed an input in, perform a computation typically off some mathematical function.",
                    "label": 0
                },
                {
                    "sent": "And then obtain the result.",
                    "label": 0
                },
                {
                    "sent": "But as we know, computing is moved on a long way.",
                    "label": 0
                },
                {
                    "sent": "We do different kinds of things.",
                    "label": 0
                },
                {
                    "sent": "With computers, we have the Internet, the web, and million other things.",
                    "label": 0
                },
                {
                    "sent": "So we have a changing face of comp.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mutation and what comes out of us as a sort of much wider Panorama of computation is the idea of a process.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And computer science asks this broader question, what is a process?",
                    "label": 0
                },
                {
                    "sent": "And we don't have that.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And answers things stand.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This broader idea of a process causes its purpose not to compute.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Function, but to exhibit some.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Behavior which can be of many very rich and varied kinds.",
                    "label": 0
                },
                {
                    "sent": "It isn't a very sensible question to ask which function does the Internet compute, that's not.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Useful way of describing what's going on, and if we think of the rich variety of software that we use on an everyday basis.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This becomes fairly clear, so if we come back to the question of what is a process where our two process is equivalent and so forth, we don't have ready.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hey dancers, from.",
                    "label": 0
                },
                {
                    "sent": "From",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Mathematics and logic.",
                    "label": 0
                },
                {
                    "sent": "There's no well developed mathematical theory of what processes are despite several decades of well, I mean there is.",
                    "label": 0
                },
                {
                    "sent": "There is a many mathematical theories of what processes are, but there's no definitive answer and no pre established mathematical theory that computer science could lean on.",
                    "label": 1
                },
                {
                    "sent": "That's why there's been so much work in computer science.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Pressing this issue so the situation is very different so that which was found in compute ability theory developed by Turing and the other pioneers.",
                    "label": 0
                },
                {
                    "sent": "One often speaks in compute ability of the confluence of notions this wonderful way that different reasonable answers to the question of what is a computable function or lead to the same notion, which is one thing that convinces us of the robustness of the analysis given by touring and the other pioneers.",
                    "label": 0
                },
                {
                    "sent": "What we find in in the world of process is.",
                    "label": 0
                },
                {
                    "sent": "Is rather a non confluence of notions in.",
                    "label": 1
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ability theory.",
                    "label": 0
                },
                {
                    "sent": "We have a definitive calculus for functions.",
                    "label": 1
                },
                {
                    "sent": "The Lambda calculus were one of the original formalisms for compute ability given by church.",
                    "label": 0
                },
                {
                    "sent": "So once of the Church Turing thesis.",
                    "label": 0
                },
                {
                    "sent": "Despite much brilliant.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Work amount.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Active research in.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Concurrency theory in process is.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One cannot help noticing that there's a great diversity of different process calculi.",
                    "label": 0
                },
                {
                    "sent": "Different answers to the questions of when two processes are the same, different kinds of.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Searching for reasoning about process is and despite again many brilliant efforts by many people, no definitive calc.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This fall, the world of concurrency has emerged, and more broadly than this, in terms of even a plausible church Turing thesis for spanning the space of possibilities of the different kinds of process is different kinds of interaction, synchrony, asynchrony and all the rest of it.",
                    "label": 0
                },
                {
                    "sent": "There isn't really a plausible candidate for something that is universally expressive, and which will subsume everything that.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Been down in this field.",
                    "label": 0
                },
                {
                    "sent": "We can speak of the next 700 syndrome, remembering a classic paper by Peter Landin, another pioneer of the subject from 1966, when he wrote a paper called the Next 700 Programming languages, reminding us that by 1966 they had already been 700 programming languages.",
                    "label": 1
                },
                {
                    "sent": "They've been an awful lot more since then, and this is a sort of syndrome that is proper.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Gated itself in in computer science, so I think the quest for a church Turing thesis for concurrency and for a kind of definitive answer to the question of water process is which will have the same kind of status that compute ability of functions house in the present day is a very challenging problem, and one where there's where we will need a new touring or perhaps several new.",
                    "label": 1
                },
                {
                    "sent": "Turing's in fact well maybe sceptical, and wonder whether a good answer of the same quality can be found.",
                    "label": 0
                },
                {
                    "sent": "At any rate, I do think it's a.",
                    "label": 0
                },
                {
                    "sent": "It's a big.",
                    "label": 1
                },
                {
                    "sent": "It's a big question about a big challenge for the computer science of the future and if I have a minute.",
                    "label": 0
                },
                {
                    "sent": "Then I'll.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Answer my other question which is of a slightly different flavor.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But this comes from one of the exciting current developments in computation quantum computation, where we take seriously the fact that our computing systems are physically embodied and therefore ultimately run according to the laws of quantum mechanics rather than classical mechanics.",
                    "label": 0
                },
                {
                    "sent": "Feynman famously said that Turing's analysis of computation in terms of pencil and paper and writing in squares and so on was impeccable, except it assumed that we understand paper and pencil.",
                    "label": 0
                },
                {
                    "sent": "So implicitly, we're assuming some kind of class.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Cool background.",
                    "label": 0
                },
                {
                    "sent": "I'm one of the remarkable and disturbing things we get from quantum mechanics is that we are forced to accept contextuality and we sort of know this from remarkable results by various people coming from Bellwood, Coach Inspector and others.",
                    "label": 0
                },
                {
                    "sent": "But whether we've absorbed this lesson or what its implications are, I think is another matter.",
                    "label": 0
                },
                {
                    "sent": "So in simple terms, this is saying.",
                    "label": 0
                },
                {
                    "sent": "Do physical variables and ultimately there any kind of variable that we can measure.",
                    "label": 0
                },
                {
                    "sent": "Observe being in a computational system or anything else must be physically embodied.",
                    "label": 0
                },
                {
                    "sent": "So do they have definite values independently of how we choose to measure them?",
                    "label": 1
                },
                {
                    "sent": "And this is a basic tenet of a realistic view of the world, and perhaps have common sense.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The quantum mechanics says there, and the challenge is how can we understand this contextuality and even more so perhaps how we can use it to some computational advantage we've understood began to understand in the work on quantum information and computation, how to use the phenomenon of entanglement, which is intimately linked with this contextuality.",
                    "label": 1
                },
                {
                    "sent": "But this broader notion, I think, is something that is still poorly understood.",
                    "label": 0
                },
                {
                    "sent": "People are just beginning to do experimental tests for contextuality of a broader nature than those.",
                    "label": 0
                },
                {
                    "sent": "Those relating to Bell's theorem in a non locality.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I went trying.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To sort of explain this, but this is a simple example.",
                    "label": 0
                },
                {
                    "sent": "Actually construction essentially due to Lucien Hardy, which shows that with Alice and Bob making choices of measurement sexes and wise and then observing outcomes red or green by the various choices of the measurements that they make, they can produce a pattern of possible and impossible results.",
                    "label": 0
                },
                {
                    "sent": "So 0 means impossible probability 01 means may happen, perhaps with some probability and there is simply no are no possibility of an underlying way of describing.",
                    "label": 0
                },
                {
                    "sent": "Definite values to all the variables independently of our choice of which ones we happen to measure, which will be consistent with what their simple kind of table tells us.",
                    "label": 0
                },
                {
                    "sent": "And yet this table is something that can be realized in quantum mechanics and situations of this kind have been experimentally verified, so a simple demonstration of quite a conceptually disturbing phenomena.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And just to, I mean, you may feel that these are technical questions, perhaps of a narrow nature, but I actually feel this is not true.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We could even relate it to some broad themes in philosophy if we're so inclined.",
                    "label": 0
                },
                {
                    "sent": "I mean, although I do so with some trepidation, traditionally we view.",
                    "label": 0
                },
                {
                    "sent": "The world is made of objects and their properties and realism implies that properties are objectively things that hold of objects independently of observe.",
                    "label": 1
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And there were challenging both those basic points because by taking processes as primary.",
                    "label": 1
                },
                {
                    "sent": "We're taking a different for you from the idea that what the basic stuff out there is things and their properties.",
                    "label": 0
                },
                {
                    "sent": "It's it's linked to the idea that we take relations as basic, but one of the drawbacks of the idea of a relational view of the world is one of the relations between, so they often taken to presuppose object.",
                    "label": 0
                },
                {
                    "sent": "But I think taking process is as primary gives us a way of thinking of the world in the relational fashion without assuming relata.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And again, take.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Contextuality as primary I think is, is deeply puzzling and something that we haven't really come to terms with.",
                    "label": 1
                },
                {
                    "sent": "So I think on a broader perspective, the question is we want to want to sort of push it out as a big question, can we rethink the way we think about the world in these kind of terms?",
                    "label": 1
                },
                {
                    "sent": "There's a Fortunately there is scientific content that we can address in the realm of computation, so that's what I wanted to say.",
                    "label": 0
                },
                {
                    "sent": "Thanks very much.",
                    "label": 0
                }
            ]
        }
    }
}