{
    "id": "jfuj7rnaxuoqkljvxwacjrutfuw3c2ej",
    "title": "Introduction and Overview of the SIMBAD Project",
    "info": {
        "author": [
            "Marcello Pelillo, University Ca' Foscari"
        ],
        "published": "Sept. 13, 2010",
        "recorded": "August 2010",
        "category": [
            "Top->Computer Science->Pattern Recognition"
        ]
    },
    "url": "http://videolectures.net/ssspr2010_pelillo_ios/",
    "segmentation": [
        [
            "Good morning everybody and welcome to this session.",
            "This final session of SPR Iamiceli Pillow from the universe to Venice and I then with Edwin Hancock.",
            "I organized this session.",
            "On similarity based pattern recognition challenges and prospects, the idea of running these event we had within a repair project called symbol.",
            "And F B7 European project and same.",
            "But there is also a sponsor of this of this meeting as I would like to spend the next few minutes describing what we are doing within within symbol."
        ],
        [
            "So first of all, let me briefly say something about our consortium apart from the University of Venice, which is the scientific coordinator of SIM.",
            "But we have a group from York headed by Edwin Hancock.",
            "Then we have a group from Delft added by Bob doing then a group from the THC Rick Yolk in Beaumont is the header.",
            "Then group from the University of Verona.",
            "Amatory Marino is the head and then we have a group from Lisbon.",
            "My refrigerator is the head there OK?",
            "So six groups.",
            "This is an FB7 fat open project.",
            "We are already in the third year, so the project will end in March next year and the topic of this project is this is the title actually beyond features similarity based power analysis, recognition.",
            "So it's a it's a project on where we try to exploit similarity based techniques for pattern recognition and machine learning."
        ],
        [
            "So one could well argue, well, you know.",
            "Recognition national learning.",
            "Both our founder than similarity principle.",
            "Actually, I could call it Hume similarity principle.",
            "Just because David Hume was arguably one of the first to put it most forcefully in the 18 century.",
            "How can we recognize patterns?",
            "How can we design algorithms that learn if we don't rely on a similarity principle like the one which you wrote in the 18th century, which essentially this is a continuity principle, it states that.",
            "If you have similar causes, you should expect similar effects.",
            "Very straightforward idea in modern times.",
            "Maybe we can say that if you have a system which accepts inputs that produces outputs.",
            "If you feed your system with similar inputs, you should expect similar outputs and so on.",
            "So forth is a very basic principle, so the first objection to our project could be.",
            "Well, so since we necessarily have to rely on the similarity on some similarity principle, what's new behind this project?"
        ],
        [
            "The novelty, I think is is here.",
            "I mean traditional pattern recognition and machine learning techniques are dominated by the notion of a feature, which is a very convenient notion indeed, because we can describe the objects that needs that need to be classified or clustered in terms of a feature vector.",
            "So this is a point in a vector space and we can derive the similarity between objects just as a byproduct of the representation.",
            "Maybe as the Euclidean distance between these points.",
            "Of course we we work in the structure pattern recognition domain.",
            "We know that the limitations of the feature based approach and actually the very idea of relion of an ocean of feature is weak in the sense that there are many applications domain where it is difficult to come up with a vet where the vector representation of the objects to be classified or classroom or whatever.",
            "This is a short list of potential situations where it's difficult to come up with a feature vector representation, and of course probably the most interesting one, at least for us, is the last one.",
            "So when the objects are described in terms of the structure representation, maybe strings, trees, graphs, hypergraphs or something more complex than that.",
            "So it's very difficult to.",
            "Dana Victoria representation in this situation."
        ],
        [
            "So the aim of this project is to explore the field help similarity based out of recognition without relying on nation on any notion of a feature.",
            "And once we abandoned confortable real, no better representation we are confronted with very challenging problems because if our similarities do not come from a vector representation of objects then we might have similarities or dissimilarities or distance color palette with everyone.",
            "Which are not Euclidean or not metric, and so this is a very interesting area, because this undermines most of what has been done within the pattern recognition and machine learning area."
        ],
        [
            "Of course, the notion of similarity.",
            "I mean the idea of relying on the notion of similarity is not new person and actually very recently there's been a lot of work, and in the kernel methods which actually kernels are a measure of similarities, But so this is a step toward the our.",
            "I mean our direction.",
            "But still this is a partial step in the sense that these methods usually assume an implicit.",
            "Vector or feature based representation of the object may be in a high dimensional space still still still implicitly, they rely on the notion of feature vector.",
            "Of course, I'm talking about the standard master kennel and semi definite kernels, so the aim of the same bodies to bring to full maturation parodying shift that is just emerging the last few years and essentially one when one leaves the idea of the feature vector representation of the objects.",
            "One is confronted with the two problems.",
            "The first one is how can we obtain suitable similarity information?",
            "Suitable similarity data from objects representations that are richer and more powerful than feature vector representation and another question is, once I've obtained similar informations, how how can I use this information in order to perform classification, clustering and whatever?",
            "So these two question actually."
        ],
        [
            "Reflect the structure of cement.",
            "This is more or less the work package structure of the symbol project.",
            "First of all, we will be working on the idea of deriving similarities from non material data and essentially will be working on structural kernels, both generative kernels and compression kernels inspired from information theory and we are working on learning the similarities given a set of data or combining similarities somehow.",
            "So the first part is to do with the derivation of similarity.",
            "The second part is to do with the use of similarities.",
            "What can I do once I've got the similar to somehow and so we've been working on the foundations and non geometric similarities, starting the causes and the origination of non metric or non Euclidean similarities.",
            "We had a few talks an SSP are mostly by Bob doing was working actually in this field.",
            "Then we there is a whole.",
            "Thread aiming to studying and exploring embedding ideas for for non geometric similarities so tried to come up with the Euclidean norm metric data from non metrical known for the end data and then we're using game theoretic techniques to deal with the similarities which done by either the Euclidean axioms or the metric axioms.",
            "The last part is concerned with the applications we are working together with the Zurich Hospital, Rowan, the Verona Hospital we are working on two large scale biomedical applications.",
            "The first one which is essentially band with the Zurich team is the analysis of TMI images of renal cell carcinoma and the second application done in collaboration with the Verona Hospital in Verona.",
            "Team is the knowledge of our maremar scans.",
            "For the diagnosis of mental illnesses like schizophrenia?"
        ],
        [
            "OK, so if you in the in the session today we will have a sample of what we are doing with in same bed because there will be a few talks from simple people and if you would like to learn more about the symbol project, just go to the web page and this is the.",
            "The."
        ],
        [
            "The web address, let me say a couple of couple of things.",
            "We are we've been saying, but we have the idea of running a special issue of a Journal.",
            "We are actually thinking possibly at Gmail are in general machine learning research.",
            "The topic of the special issue would be learning in non geometric spaces.",
            "We are actually right now in the process of writing a proposal to be sent in the next few days, possibly a few weeks.",
            "So let's cross fingers and if everything goes well we hope to.",
            "Published this special issue in 2012."
        ],
        [
            "Also, we are thinking of relaunching and a series of meetings seem bad workshops exactly on the topics of Sinbad the 1st edition of the meeting will take place in Italy, in Venice in the late spring next year.",
            "The format will of the meeting will be fueled by the talks, a few.",
            "Most of the papers will be contributed talks, either an overall posture presentation and also a panel discussion.",
            "Right now we are in the process of writing down a call for papers, and so possibly in the next month or so we will issue the call for papers.",
            "They be the same, but worship will be sponsored by Pascal.",
            "There will be video lecture coverage and we have published in the proceedings in lecture notes in computer science."
        ],
        [
            "OK, so much for symbol.",
            "Let me now say something about the schedule today.",
            "We have a few talks from Simbad and some talks or some discussion from outside symbol.",
            "But today actually we have two parts.",
            "The first part will have three talks, then with the coffee break at 10:10.",
            "Then in theory we should have three more talks in the second part, but I've just been notified that key school is not able to participate in the meeting, so we are skipping skipping this talk.",
            "So we go straight to the last talk.",
            "And then we have a panel discussion with distinguished speakers on our end Ahuja.",
            "Host Bunk and Lester Strawder, Yosef Kittler and Fatty pony.",
            "Another will be at Winco.",
            "OK so thanks for attention.",
            "Let me now officially start the session.",
            "The first talk will be given by Edwin Hancock and will be on generative models for relational structures.",
            "Thank you for everything."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good morning everybody and welcome to this session.",
                    "label": 0
                },
                {
                    "sent": "This final session of SPR Iamiceli Pillow from the universe to Venice and I then with Edwin Hancock.",
                    "label": 0
                },
                {
                    "sent": "I organized this session.",
                    "label": 0
                },
                {
                    "sent": "On similarity based pattern recognition challenges and prospects, the idea of running these event we had within a repair project called symbol.",
                    "label": 0
                },
                {
                    "sent": "And F B7 European project and same.",
                    "label": 0
                },
                {
                    "sent": "But there is also a sponsor of this of this meeting as I would like to spend the next few minutes describing what we are doing within within symbol.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So first of all, let me briefly say something about our consortium apart from the University of Venice, which is the scientific coordinator of SIM.",
                    "label": 0
                },
                {
                    "sent": "But we have a group from York headed by Edwin Hancock.",
                    "label": 0
                },
                {
                    "sent": "Then we have a group from Delft added by Bob doing then a group from the THC Rick Yolk in Beaumont is the header.",
                    "label": 0
                },
                {
                    "sent": "Then group from the University of Verona.",
                    "label": 0
                },
                {
                    "sent": "Amatory Marino is the head and then we have a group from Lisbon.",
                    "label": 0
                },
                {
                    "sent": "My refrigerator is the head there OK?",
                    "label": 0
                },
                {
                    "sent": "So six groups.",
                    "label": 0
                },
                {
                    "sent": "This is an FB7 fat open project.",
                    "label": 0
                },
                {
                    "sent": "We are already in the third year, so the project will end in March next year and the topic of this project is this is the title actually beyond features similarity based power analysis, recognition.",
                    "label": 0
                },
                {
                    "sent": "So it's a it's a project on where we try to exploit similarity based techniques for pattern recognition and machine learning.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So one could well argue, well, you know.",
                    "label": 0
                },
                {
                    "sent": "Recognition national learning.",
                    "label": 0
                },
                {
                    "sent": "Both our founder than similarity principle.",
                    "label": 0
                },
                {
                    "sent": "Actually, I could call it Hume similarity principle.",
                    "label": 0
                },
                {
                    "sent": "Just because David Hume was arguably one of the first to put it most forcefully in the 18 century.",
                    "label": 1
                },
                {
                    "sent": "How can we recognize patterns?",
                    "label": 0
                },
                {
                    "sent": "How can we design algorithms that learn if we don't rely on a similarity principle like the one which you wrote in the 18th century, which essentially this is a continuity principle, it states that.",
                    "label": 0
                },
                {
                    "sent": "If you have similar causes, you should expect similar effects.",
                    "label": 1
                },
                {
                    "sent": "Very straightforward idea in modern times.",
                    "label": 0
                },
                {
                    "sent": "Maybe we can say that if you have a system which accepts inputs that produces outputs.",
                    "label": 1
                },
                {
                    "sent": "If you feed your system with similar inputs, you should expect similar outputs and so on.",
                    "label": 0
                },
                {
                    "sent": "So forth is a very basic principle, so the first objection to our project could be.",
                    "label": 0
                },
                {
                    "sent": "Well, so since we necessarily have to rely on the similarity on some similarity principle, what's new behind this project?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The novelty, I think is is here.",
                    "label": 0
                },
                {
                    "sent": "I mean traditional pattern recognition and machine learning techniques are dominated by the notion of a feature, which is a very convenient notion indeed, because we can describe the objects that needs that need to be classified or clustered in terms of a feature vector.",
                    "label": 1
                },
                {
                    "sent": "So this is a point in a vector space and we can derive the similarity between objects just as a byproduct of the representation.",
                    "label": 0
                },
                {
                    "sent": "Maybe as the Euclidean distance between these points.",
                    "label": 1
                },
                {
                    "sent": "Of course we we work in the structure pattern recognition domain.",
                    "label": 0
                },
                {
                    "sent": "We know that the limitations of the feature based approach and actually the very idea of relion of an ocean of feature is weak in the sense that there are many applications domain where it is difficult to come up with a vet where the vector representation of the objects to be classified or classroom or whatever.",
                    "label": 0
                },
                {
                    "sent": "This is a short list of potential situations where it's difficult to come up with a feature vector representation, and of course probably the most interesting one, at least for us, is the last one.",
                    "label": 1
                },
                {
                    "sent": "So when the objects are described in terms of the structure representation, maybe strings, trees, graphs, hypergraphs or something more complex than that.",
                    "label": 0
                },
                {
                    "sent": "So it's very difficult to.",
                    "label": 0
                },
                {
                    "sent": "Dana Victoria representation in this situation.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the aim of this project is to explore the field help similarity based out of recognition without relying on nation on any notion of a feature.",
                    "label": 1
                },
                {
                    "sent": "And once we abandoned confortable real, no better representation we are confronted with very challenging problems because if our similarities do not come from a vector representation of objects then we might have similarities or dissimilarities or distance color palette with everyone.",
                    "label": 1
                },
                {
                    "sent": "Which are not Euclidean or not metric, and so this is a very interesting area, because this undermines most of what has been done within the pattern recognition and machine learning area.",
                    "label": 1
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of course, the notion of similarity.",
                    "label": 1
                },
                {
                    "sent": "I mean the idea of relying on the notion of similarity is not new person and actually very recently there's been a lot of work, and in the kernel methods which actually kernels are a measure of similarities, But so this is a step toward the our.",
                    "label": 0
                },
                {
                    "sent": "I mean our direction.",
                    "label": 0
                },
                {
                    "sent": "But still this is a partial step in the sense that these methods usually assume an implicit.",
                    "label": 0
                },
                {
                    "sent": "Vector or feature based representation of the object may be in a high dimensional space still still still implicitly, they rely on the notion of feature vector.",
                    "label": 1
                },
                {
                    "sent": "Of course, I'm talking about the standard master kennel and semi definite kernels, so the aim of the same bodies to bring to full maturation parodying shift that is just emerging the last few years and essentially one when one leaves the idea of the feature vector representation of the objects.",
                    "label": 1
                },
                {
                    "sent": "One is confronted with the two problems.",
                    "label": 0
                },
                {
                    "sent": "The first one is how can we obtain suitable similarity information?",
                    "label": 1
                },
                {
                    "sent": "Suitable similarity data from objects representations that are richer and more powerful than feature vector representation and another question is, once I've obtained similar informations, how how can I use this information in order to perform classification, clustering and whatever?",
                    "label": 1
                },
                {
                    "sent": "So these two question actually.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Reflect the structure of cement.",
                    "label": 0
                },
                {
                    "sent": "This is more or less the work package structure of the symbol project.",
                    "label": 0
                },
                {
                    "sent": "First of all, we will be working on the idea of deriving similarities from non material data and essentially will be working on structural kernels, both generative kernels and compression kernels inspired from information theory and we are working on learning the similarities given a set of data or combining similarities somehow.",
                    "label": 0
                },
                {
                    "sent": "So the first part is to do with the derivation of similarity.",
                    "label": 0
                },
                {
                    "sent": "The second part is to do with the use of similarities.",
                    "label": 0
                },
                {
                    "sent": "What can I do once I've got the similar to somehow and so we've been working on the foundations and non geometric similarities, starting the causes and the origination of non metric or non Euclidean similarities.",
                    "label": 1
                },
                {
                    "sent": "We had a few talks an SSP are mostly by Bob doing was working actually in this field.",
                    "label": 0
                },
                {
                    "sent": "Then we there is a whole.",
                    "label": 0
                },
                {
                    "sent": "Thread aiming to studying and exploring embedding ideas for for non geometric similarities so tried to come up with the Euclidean norm metric data from non metrical known for the end data and then we're using game theoretic techniques to deal with the similarities which done by either the Euclidean axioms or the metric axioms.",
                    "label": 0
                },
                {
                    "sent": "The last part is concerned with the applications we are working together with the Zurich Hospital, Rowan, the Verona Hospital we are working on two large scale biomedical applications.",
                    "label": 0
                },
                {
                    "sent": "The first one which is essentially band with the Zurich team is the analysis of TMI images of renal cell carcinoma and the second application done in collaboration with the Verona Hospital in Verona.",
                    "label": 1
                },
                {
                    "sent": "Team is the knowledge of our maremar scans.",
                    "label": 0
                },
                {
                    "sent": "For the diagnosis of mental illnesses like schizophrenia?",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so if you in the in the session today we will have a sample of what we are doing with in same bed because there will be a few talks from simple people and if you would like to learn more about the symbol project, just go to the web page and this is the.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The web address, let me say a couple of couple of things.",
                    "label": 0
                },
                {
                    "sent": "We are we've been saying, but we have the idea of running a special issue of a Journal.",
                    "label": 0
                },
                {
                    "sent": "We are actually thinking possibly at Gmail are in general machine learning research.",
                    "label": 0
                },
                {
                    "sent": "The topic of the special issue would be learning in non geometric spaces.",
                    "label": 0
                },
                {
                    "sent": "We are actually right now in the process of writing a proposal to be sent in the next few days, possibly a few weeks.",
                    "label": 1
                },
                {
                    "sent": "So let's cross fingers and if everything goes well we hope to.",
                    "label": 0
                },
                {
                    "sent": "Published this special issue in 2012.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also, we are thinking of relaunching and a series of meetings seem bad workshops exactly on the topics of Sinbad the 1st edition of the meeting will take place in Italy, in Venice in the late spring next year.",
                    "label": 1
                },
                {
                    "sent": "The format will of the meeting will be fueled by the talks, a few.",
                    "label": 0
                },
                {
                    "sent": "Most of the papers will be contributed talks, either an overall posture presentation and also a panel discussion.",
                    "label": 0
                },
                {
                    "sent": "Right now we are in the process of writing down a call for papers, and so possibly in the next month or so we will issue the call for papers.",
                    "label": 0
                },
                {
                    "sent": "They be the same, but worship will be sponsored by Pascal.",
                    "label": 0
                },
                {
                    "sent": "There will be video lecture coverage and we have published in the proceedings in lecture notes in computer science.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so much for symbol.",
                    "label": 0
                },
                {
                    "sent": "Let me now say something about the schedule today.",
                    "label": 0
                },
                {
                    "sent": "We have a few talks from Simbad and some talks or some discussion from outside symbol.",
                    "label": 0
                },
                {
                    "sent": "But today actually we have two parts.",
                    "label": 0
                },
                {
                    "sent": "The first part will have three talks, then with the coffee break at 10:10.",
                    "label": 0
                },
                {
                    "sent": "Then in theory we should have three more talks in the second part, but I've just been notified that key school is not able to participate in the meeting, so we are skipping skipping this talk.",
                    "label": 0
                },
                {
                    "sent": "So we go straight to the last talk.",
                    "label": 0
                },
                {
                    "sent": "And then we have a panel discussion with distinguished speakers on our end Ahuja.",
                    "label": 0
                },
                {
                    "sent": "Host Bunk and Lester Strawder, Yosef Kittler and Fatty pony.",
                    "label": 0
                },
                {
                    "sent": "Another will be at Winco.",
                    "label": 0
                },
                {
                    "sent": "OK so thanks for attention.",
                    "label": 0
                },
                {
                    "sent": "Let me now officially start the session.",
                    "label": 0
                },
                {
                    "sent": "The first talk will be given by Edwin Hancock and will be on generative models for relational structures.",
                    "label": 1
                },
                {
                    "sent": "Thank you for everything.",
                    "label": 0
                }
            ]
        }
    }
}