{
    "id": "jgxpaqqjsgxgbijndvu3wfejycyr3dww",
    "title": "GDEX for Slovene",
    "info": {
        "author": [
            "Iztok Kosem, Trojina – Institute for Applied Slovene Studies"
        ],
        "published": "Dec. 2, 2011",
        "recorded": "November 2011",
        "category": [
            "Top->Humanities->Linguistics->Lexicography"
        ]
    },
    "url": "http://videolectures.net/elex2011_kosem_slovene/",
    "segmentation": [
        [
            "So anyway, I'm I'll give a talk on goodrx for slowing which is.",
            "The project that's been ongoing sort of have been started.",
            "Last year and it's a joint effort between 39 Institute for Applied Studies, which represents the communication is slowing project and Lexington Computing Limited?",
            "I'm only one of the authors of the paper of the whole.",
            "Of the good expert slowing as well Millers Husak who is not.",
            "He couldn't come to the conference unfortunately, but he's the technical aspect of good ex.",
            "He actually came up with the program in the 1st place and Diana McCarty joins our little team in providing also tech technical help in coordinating the whole matter.",
            "So she's she's here and for any questions.",
            "Which will be more related to English?",
            "Could access should also be."
        ],
        [
            "Ready to answer them?",
            "OK now just to give you a brief outline of the paper of this presentation, just quickly to say something about examples in dictionaries, especially the good ones, and I'll briefly describe the Goodix tool.",
            "So what it is and what it does or is supposed to do and then.",
            "Go to goodrx for English because that was the first goodix designed and now the new sort of the latest development in good access which is good extra slowing and outline some of our future plans."
        ],
        [
            "So first of all, if we look at examples in dictionary, So what is their role now?",
            "First of all they illustrate usage.",
            "It's nothing you.",
            "So they put the words back in context.",
            "So the next thing is they support the definitions.",
            "So it's often problematic to understand the definitions without reading the examples, which is also something that Sue Atkins and Michael Rundell mention in their book in 2008.",
            "An help they also help with navigation through longer entries.",
            "I found that in uh, let's think it's from 1987 when I think was.",
            "Authored by Fox are basically mentioning that when you encounter when you go through the dictionary to find the answers, the context that you're looking for, and if you find it in an example, it often helps you find the sense of the entry.",
            "Now these are the characteristics of good examples.",
            "So when you're lexicographer selecting them these are sort of the guidelines.",
            "They have to be natural.",
            "We have to be typical of the words usage or collocation usage.",
            "They have to be informative so they have to tell something new.",
            "They have to add value to the entry that did not used just for the sake of it and they have to be intelligible so they don't.",
            "Normally they're not allowed, or they shouldn't include very difficult words.",
            "The focus should be on the headward.",
            "Now the problem with examples and finding them is that.",
            "It's very time consuming.",
            "Any lexicographer knows that so, and there is question, can this procedure be automated to some extent?",
            "Now when we're talking about the time consuming nature of searching examples, I mean you have to picture."
        ],
        [
            "Yes, so you're looking through concordances."
        ],
        [
            "Looking through concordances."
        ],
        [
            "More concordances.",
            "More courses so you have to find examples in all this.",
            "So in this case I was looking for the World Conference in slowing and 92,000 hits an you have to find a good example.",
            "So imagine the work now there.",
            "There's been some automated things done that save you the trouble of going through loads of examples."
        ],
        [
            "Anyway, I'll mention that later, but.",
            "Going a step further is actually good X, and this is a ranking tool.",
            "It's important to stress that because you do not have good extra say OK, go to the corpus and find me only good examples.",
            "It does not do that.",
            "It actually says OK, I will rank each example on according to some criteria and I will give you the good ones.",
            "The potentially 1 first and the bad ones with some bad criteria last.",
            "So you will look at the ones that you're interested in first, because you normally tend to look at.",
            "I don't know 1015 Twenty 25 and you don't want to look at more.",
            "Because you don't have time to, so it rains examples according to their potential for dictionary purposes.",
            "The selection is still made by lexicographers.",
            "And the ranking was automatic and based on various syntactic and lexical features.",
            "And the question is which features can be ranked?",
            "Can intelligibility be ranked?",
            "Can naturalness be ranked well to some extent?",
            "I mean the answer lies partly in what was used."
        ],
        [
            "For good X for English, so the heuristics used the classifiers that we used for English.",
            "So first of all, you think So what it is project specific, but you think what kind of examples do I actually want out of the corpus?",
            "So what kind of examples do I want to even examine so you think, OK, I want whole examples.",
            "I want whole sentence examples, it depends.",
            "So it has to end with a full full stop!?",
            "And nothing.",
            "The else it has, it has to start with a capital letter.",
            "It depends on how long they are.",
            "You don't want 100 words sentences.",
            "You want shorter, so you determine all these values of classifiers and this is what they did in good X for English.",
            "So they use sentence length, word length, word frequency, keyword position with keyword position I mean the head word that you are analyzing and when you do the search where its position.",
            "In the sentences then there are other criteria proper the the number of proper nouns and pronouns, even polysemy for English they used Wordnet Synsets so they penalized multi sense words if they occurred in examples and so forth.",
            "So you also say if an example contains URLs or I don't know any other like email addresses.",
            "A penalize are meant to put them lower down the list.",
            "Now the procedure goes."
        ],
        [
            "You have these classifiers that I just mentioned in many others and you score on each classifier.",
            "You give them a score from zero to 1 and then you wait scores.",
            "So you say this classifiers are more important than the others.",
            "Call of course.",
            "Depending on the project and then you calculate the weighted average of classifiers course an you rank sentences according to that.",
            "Now this was first used, the Good Express first used in lexicography for Macmillan English Dictionary Online, so they were they needed.",
            "More examples for collocations and they use the tool.",
            "The results according to reports, are quite promising that and the short and lexicographers time spent on searching good examples and the procedure was based on manually annotated good sentences in a set.",
            "Of course, is not that this is where we come to the question.",
            "Is this useful for other languages?",
            "Can this be made useful?"
        ],
        [
            "We believe so, and in our project we had we had a similar need and this is the project mentioned already this morning and we need it for the specific purpose of lexical database for slowing.",
            "So we needed we were looking for examples of headwords for Caucasians for constructions and we using sketch engine.",
            "In selecting examples in Word sketch, so we use, we use the tick box lexicography.",
            "We're still using it, so if you're not familiar with this so."
        ],
        [
            "Basically it offers you the word sketch of the words, so the grammatical relations with."
        ],
        [
            "The color kits and you select them and then you select the examples.",
            "And the number of examples offered is chosen by the lexicographer.",
            "But it tends to be between 10 and 15."
        ],
        [
            "Now the aim was let's design good express loving that would offer three good examples out of 10 for each color kit, because lexicographers normally select so out of these 10 here I want at least three, they're good.",
            "Now.",
            "So we.",
            "We used the non language specific classifier for English of English, Good X as a point of departure.",
            "So for example Wordnet Synsets for English, we couldn't use those.",
            "And we sort of changed the procedure a bit by using existing manually selected examples in the lexical database as a benchmark.",
            "So we already had it.",
            "We already had manually selected examples in database, partly because the we couldn't use the English Codex, so it was still quite time consuming to find examples, but they were good and we offered sort of made a database and we use the vector tool to determine the values of these classifiers.",
            "So for those of you not familiar with Becca, Tool is a data visualization tool that shows various statistics for each feature and also offers you more advanced visualization like 3D charts, where that you determined efficiency of two measurements."
        ],
        [
            "So this is just an example, so you have features to the left and then the values to the right.",
            "I mean I won't go into any detail, it's very complex to summarize this in."
        ],
        [
            "One or two sentences.",
            "One of the other things that we we quickly notice when we did the initial analysis on good experts.",
            "That examples were rather similar, so sometimes you can imagine 2 examples that are similar or even the same will be scored the same, so they will be ranked exactly the same or similar and put higher or lower.",
            "So we wanted to get rid of that.",
            "We wanted more unique examples, because normally lexicographer would pick one.",
            "And justice ignore the others.",
            "So this language time distance was introduced so examples had to differ at least 30%.",
            "And we divide several configurations and I'll explain later how the process for that, which were different, not.",
            "In classifiers, but mainly in classifier values and weights, there were some difference in classifieds but not substantial.",
            "And then we did the evaluation, which was rather a crucial part of the whole design process.",
            "So we used word sketches, becausw that that is the.",
            "Way are lexicographers work, so we wanted to simulate the work and we set the minimum frequency of a color cut to 15, because if it's if you have fewer examples in that, then good X ranking doesn't even help you get all examples shown anyway and we looked at the lemmas of nouns, verbs, adjectives and adverbs because these are the lemmas in lexical database at the moment.",
            "We also did.",
            "We also log the examples, both good ones and bad ones so we could analyze them further and improve the configurations.",
            "What was designed especially for the project was the tick box lexicography feature that allowed the comparison of two configurations.",
            "Because it was very difficult to sort of, say, so what's different in this one from the previous one?"
        ],
        [
            "So this was designed so you can compare two configurations, so one on the left, one on the right.",
            "You can see the length, sorry, the length of the sentences, the position of the keyword, and I'll demonstrate that a bit late."
        ],
        [
            "Your.",
            "One important question you have to ask.",
            "We had to answer this when starting the evaluation was So what kind of examples are looking for?",
            "Is it really the dictionary examples?",
            "Because we were designing the lexical database or is it something else?",
            "Well, first of all, there's this debate.",
            "Should you modify corpus examples?",
            "I know the corpus driven.",
            "Proponents will say that you shouldn't really modify them to.",
            "You should leave them as they are.",
            "And I think grammar Krishnamurti, who was my PhD supervisor, really crucified for this.",
            "But anyway, I looked at his words, what he wrote in the book about Co build project and even he had to admit that at some point some examples had to be modified a little because they, for example they were too long or they contained really odd words and but they were, they were not enough examples on offer.",
            "So they had to modify those, so the next the next comparison is between lexical database example.",
            "In a dictionary example and this is where basically our answer comes from is we allowed.",
            "To sort of say OK example can break some of the rules of what a good example is.",
            "If it can be later modified into a good dictionary example.",
            "So you can have a longer example with some more difficult words.",
            "If there is a potential to make it a bit shorter and still have a good dictionary example with enough context."
        ],
        [
            "So this is the procedure that was take took place.",
            "So first of all I already mentioned the first part, so we did a vector analysis on the manually selected examples.",
            "We devised the configuration slow in one immediately corrected because we left out one of the classifiers and then we did evaluation plus vector analysis and we sort of device the next configuration based on the findings and this took place in the next stage.",
            "We already introduced the comparison because we had to configurations to compare.",
            "The better one was normally sort of selected, so if you see slowing one versus slowing two in the next phase slowing one was kept slowing.",
            "Two was ignored because it really produced poor results and we moved on until we got too good X for slowing, which is actually slowing configuration slowing tree."
        ],
        [
            "Right now, just to show you some of the examples of this comparison.",
            "So first of all this is comparison.",
            "I think there are many.",
            "Examples to show, but chose a hopefully a good one.",
            "You don't need to know slowing to see the points.",
            "I'll try to make so, but first of all two configurations, same color kit for the headward Mucha T which is.",
            "Verb, and just to point out, so this is the example that is ranked exactly the same in same position, same example, and these are the."
        ],
        [
            "Examples that are different so all the other examples here, not mark.",
            "Occur also in both, but they're ranked differently, so they're not for a second, so this was the comparison that we made between the first 2 configurations.",
            "So not make a lot of difference Now this the second part was where we compared slowing one or slowing tool and.",
            "That there were many.",
            "Different examples, so these are the marked ones, so 5 examples different in both configurations and more important, more importantly, as will be demonstrated later.",
            "It is also different in examples produced in terms of length and keyword position.",
            "So here you can see a bit of length.",
            "Of some examples being longer already shown.",
            "Now slowing 1 compared to slowing 3.",
            "If I listen.",
            "Everything is different, so all examples are different.",
            "So this was starting difference.",
            "You can see longer examples.",
            "You can see positioning of keywords towards the end.",
            "I'll mention why that's important."
        ],
        [
            "Your."
        ],
        [
            "And then finally we compared slow entry with slowing 3B and there were no differences.",
            "They're all the same examples, just in different order.",
            "So we then just discard it, slowing three.",
            "We said slowing slowing 3B with its low entry."
        ],
        [
            "Is enough for us, so our findings were sentence length.",
            "The optimum we had to increase at the initial one was 8:30.",
            "We care to increase it to 15 to 35 and that showed considerable improvement.",
            "The keyword position with English.",
            "It was the beginning of the sentence with slow in middle to end of the sentence.",
            "So it was really slowing.",
            "That's a better position for a keyword and we had to penalize the repetitions of the word in the same example.",
            "We limited the sentence length and also the."
        ],
        [
            "Word length now just to show you what I mean by limiting the word.",
            "Lines were limited to 18, so when you get to the word list and you see above 18, you get sort of web."
        ],
        [
            "Ages and some.",
            "Errors in tokenization and you really want to penalize that, otherwise you get a lot of."
        ],
        [
            "Nice.",
            "I have to say the initial goal of getting 2 examples for Collocate actually, was achieved was initially 5 but were overly ambitious.",
            "So just to summarize, these are some of the remaining issues, so we found some central initial adverbs often found in bed examples in all configurations.",
            "So we will add a stop list for that.",
            "Ending with something other than full stops or still found, I think... was causing the problem, but that will be solved now and different configurations.",
            "This is an important point.",
            "Work better with different types of lemma.",
            "So for slowing tree slowing 3B work better with adjectives and nouns but keyword position 40 to 100 within this configuration caused problems with some of the verbs because they were found at the end of the example and they didn't have enough context.",
            "And this is clear evidence that you need perhaps more than one Codex configuration for a language.",
            "So our future plans are to sort of improve the classifiers in to sort of."
        ],
        [
            "Them closer also to improve them in a way that could explore English already is.",
            "And also this is our next project in the next upcoming month is to use Good X in automatic extraction.",
            "So designing different configurations for different types of lemma.",
            "And this is an important point.",
            "We're no longer looking for three examples in among 10 or 15, but for three top good examples because automatic extraction will want to select the first top three and then put it in a database rather than say, well which of these ten we don't.",
            "We want to eliminate the human intervention at that point.",
            "And that is it.",
            "Thank you very much.",
            "Thank you very much.",
            "Very interesting and inspiring.",
            "I was wondering about the keyword position.",
            "Well one of the aims of having good examples is typicality, of course, and this is 1 aspect, which it seems to be rather easily computationally tractable.",
            "You think it might be possible in some future to actually quickly go through the examples located and see what the typical sentence position is for your keyword, and perhaps prefer examples which replicate that typical position.",
            "It was Michael Howie that has done somewhere contextual position and we know that it's item specific because it depends on the discourse function of some items.",
            "OK, so I.",
            "It's the I think it can be done.",
            "I think it should be done the.",
            "The only problem is that when you're working with a tool like this, it's speed that you want and it's everything is done on the fly.",
            "So what sketches are already calculated?",
            "But the examples are ranked on the fly, so you would have to have everything stored already for each headword that you would want to analyze.",
            "But yes, that's that's definitely something desirable.",
            "Thank you very much for the very interesting talk.",
            "I think this is a very good project and I was wondering if you have thought of applying it to other areas like language learning, for example looking at different kind of user groups an adapting these features that you're investigating to specific users.",
            "Yes, in fact we will do that because in the project that we're working on.",
            "There are different activities taking place and for lexical database specifically, we need this kind of tool to extract lexical database examples.",
            "For example, we are also working for on online grammar where we need examples for very more low level for learners, but native speaker learners, so elementary secondary school.",
            "Students and examples there have to be much less complex than in the lexical database.",
            "Of course there is also the potential of saying kinda lexical database examples be modified.",
            "So in the way we're working at the moment, but we also need some examples directly extracted, so looking at more generally, what I would say is that if you take a tool like this behind this, there are many configurations and we were.",
            "We were sort of fine tuning the this one for slowing at the moment, but now you can take it and you say OK, I prefer sentence length between 7 to 15 and I don't want any difficult words so you actually can specify them.",
            "And then that will give you the results more towards what you want.",
            "And then you can fine tune for learners for the database.",
            "I mean for any type of user, but they need different configuration just to say I really like Roberts comment and I think that's something we should we should do.",
            "We can.",
            "So to take the so if we're finding a typical example for.",
            "Score a goal, then we can say we've got 200 examples for it, and let's use that as a data set for finding the most.",
            "For finding various features that are typical for score goal, including position include including also the other color coat which relates a bit to something you said it stop.",
            "This issue of finding very similar examples to each other.",
            "Of not finding them.",
            "Of not finding them, not wanting to play yes.",
            "And the way I see it is sort of an absolute level.",
            "It's a problem, comes up a lot.",
            "You're looking for something.",
            "So if you look if you find it, you find others.",
            "If you find it.",
            "If you want more than one of it, you find them there all the same.",
            "So what you want to do is on the 1st 10, find things that are the best and on the other hand diversity and what?",
            "One way to approach that would be to say, will, let's find let's if we've got.",
            "A two word collicut, then the.",
            "Then we can find we can look for the third words that go with those first 2 words, and we're going to have one example for for the first third, click it and another example for the 2nd third collicutt and the third example for the third, so call.",
            "It can actually ensure that they're not all about the same as each other, and are showing a spread of behavior, yes.",
            "Implement that as soon as possible please.",
            "This dude.",
            "I think that's a nice way of for closing this presentation.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So anyway, I'm I'll give a talk on goodrx for slowing which is.",
                    "label": 0
                },
                {
                    "sent": "The project that's been ongoing sort of have been started.",
                    "label": 0
                },
                {
                    "sent": "Last year and it's a joint effort between 39 Institute for Applied Studies, which represents the communication is slowing project and Lexington Computing Limited?",
                    "label": 0
                },
                {
                    "sent": "I'm only one of the authors of the paper of the whole.",
                    "label": 0
                },
                {
                    "sent": "Of the good expert slowing as well Millers Husak who is not.",
                    "label": 0
                },
                {
                    "sent": "He couldn't come to the conference unfortunately, but he's the technical aspect of good ex.",
                    "label": 0
                },
                {
                    "sent": "He actually came up with the program in the 1st place and Diana McCarty joins our little team in providing also tech technical help in coordinating the whole matter.",
                    "label": 0
                },
                {
                    "sent": "So she's she's here and for any questions.",
                    "label": 0
                },
                {
                    "sent": "Which will be more related to English?",
                    "label": 0
                },
                {
                    "sent": "Could access should also be.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ready to answer them?",
                    "label": 0
                },
                {
                    "sent": "OK now just to give you a brief outline of the paper of this presentation, just quickly to say something about examples in dictionaries, especially the good ones, and I'll briefly describe the Goodix tool.",
                    "label": 1
                },
                {
                    "sent": "So what it is and what it does or is supposed to do and then.",
                    "label": 1
                },
                {
                    "sent": "Go to goodrx for English because that was the first goodix designed and now the new sort of the latest development in good access which is good extra slowing and outline some of our future plans.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first of all, if we look at examples in dictionary, So what is their role now?",
                    "label": 0
                },
                {
                    "sent": "First of all they illustrate usage.",
                    "label": 0
                },
                {
                    "sent": "It's nothing you.",
                    "label": 0
                },
                {
                    "sent": "So they put the words back in context.",
                    "label": 1
                },
                {
                    "sent": "So the next thing is they support the definitions.",
                    "label": 0
                },
                {
                    "sent": "So it's often problematic to understand the definitions without reading the examples, which is also something that Sue Atkins and Michael Rundell mention in their book in 2008.",
                    "label": 1
                },
                {
                    "sent": "An help they also help with navigation through longer entries.",
                    "label": 0
                },
                {
                    "sent": "I found that in uh, let's think it's from 1987 when I think was.",
                    "label": 1
                },
                {
                    "sent": "Authored by Fox are basically mentioning that when you encounter when you go through the dictionary to find the answers, the context that you're looking for, and if you find it in an example, it often helps you find the sense of the entry.",
                    "label": 0
                },
                {
                    "sent": "Now these are the characteristics of good examples.",
                    "label": 0
                },
                {
                    "sent": "So when you're lexicographer selecting them these are sort of the guidelines.",
                    "label": 0
                },
                {
                    "sent": "They have to be natural.",
                    "label": 0
                },
                {
                    "sent": "We have to be typical of the words usage or collocation usage.",
                    "label": 0
                },
                {
                    "sent": "They have to be informative so they have to tell something new.",
                    "label": 0
                },
                {
                    "sent": "They have to add value to the entry that did not used just for the sake of it and they have to be intelligible so they don't.",
                    "label": 0
                },
                {
                    "sent": "Normally they're not allowed, or they shouldn't include very difficult words.",
                    "label": 0
                },
                {
                    "sent": "The focus should be on the headward.",
                    "label": 0
                },
                {
                    "sent": "Now the problem with examples and finding them is that.",
                    "label": 0
                },
                {
                    "sent": "It's very time consuming.",
                    "label": 0
                },
                {
                    "sent": "Any lexicographer knows that so, and there is question, can this procedure be automated to some extent?",
                    "label": 0
                },
                {
                    "sent": "Now when we're talking about the time consuming nature of searching examples, I mean you have to picture.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yes, so you're looking through concordances.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Looking through concordances.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More concordances.",
                    "label": 0
                },
                {
                    "sent": "More courses so you have to find examples in all this.",
                    "label": 0
                },
                {
                    "sent": "So in this case I was looking for the World Conference in slowing and 92,000 hits an you have to find a good example.",
                    "label": 0
                },
                {
                    "sent": "So imagine the work now there.",
                    "label": 0
                },
                {
                    "sent": "There's been some automated things done that save you the trouble of going through loads of examples.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anyway, I'll mention that later, but.",
                    "label": 0
                },
                {
                    "sent": "Going a step further is actually good X, and this is a ranking tool.",
                    "label": 0
                },
                {
                    "sent": "It's important to stress that because you do not have good extra say OK, go to the corpus and find me only good examples.",
                    "label": 0
                },
                {
                    "sent": "It does not do that.",
                    "label": 0
                },
                {
                    "sent": "It actually says OK, I will rank each example on according to some criteria and I will give you the good ones.",
                    "label": 0
                },
                {
                    "sent": "The potentially 1 first and the bad ones with some bad criteria last.",
                    "label": 0
                },
                {
                    "sent": "So you will look at the ones that you're interested in first, because you normally tend to look at.",
                    "label": 0
                },
                {
                    "sent": "I don't know 1015 Twenty 25 and you don't want to look at more.",
                    "label": 0
                },
                {
                    "sent": "Because you don't have time to, so it rains examples according to their potential for dictionary purposes.",
                    "label": 1
                },
                {
                    "sent": "The selection is still made by lexicographers.",
                    "label": 1
                },
                {
                    "sent": "And the ranking was automatic and based on various syntactic and lexical features.",
                    "label": 0
                },
                {
                    "sent": "And the question is which features can be ranked?",
                    "label": 0
                },
                {
                    "sent": "Can intelligibility be ranked?",
                    "label": 0
                },
                {
                    "sent": "Can naturalness be ranked well to some extent?",
                    "label": 0
                },
                {
                    "sent": "I mean the answer lies partly in what was used.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For good X for English, so the heuristics used the classifiers that we used for English.",
                    "label": 0
                },
                {
                    "sent": "So first of all, you think So what it is project specific, but you think what kind of examples do I actually want out of the corpus?",
                    "label": 0
                },
                {
                    "sent": "So what kind of examples do I want to even examine so you think, OK, I want whole examples.",
                    "label": 0
                },
                {
                    "sent": "I want whole sentence examples, it depends.",
                    "label": 0
                },
                {
                    "sent": "So it has to end with a full full stop!?",
                    "label": 0
                },
                {
                    "sent": "And nothing.",
                    "label": 0
                },
                {
                    "sent": "The else it has, it has to start with a capital letter.",
                    "label": 0
                },
                {
                    "sent": "It depends on how long they are.",
                    "label": 0
                },
                {
                    "sent": "You don't want 100 words sentences.",
                    "label": 0
                },
                {
                    "sent": "You want shorter, so you determine all these values of classifiers and this is what they did in good X for English.",
                    "label": 0
                },
                {
                    "sent": "So they use sentence length, word length, word frequency, keyword position with keyword position I mean the head word that you are analyzing and when you do the search where its position.",
                    "label": 1
                },
                {
                    "sent": "In the sentences then there are other criteria proper the the number of proper nouns and pronouns, even polysemy for English they used Wordnet Synsets so they penalized multi sense words if they occurred in examples and so forth.",
                    "label": 0
                },
                {
                    "sent": "So you also say if an example contains URLs or I don't know any other like email addresses.",
                    "label": 0
                },
                {
                    "sent": "A penalize are meant to put them lower down the list.",
                    "label": 0
                },
                {
                    "sent": "Now the procedure goes.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You have these classifiers that I just mentioned in many others and you score on each classifier.",
                    "label": 0
                },
                {
                    "sent": "You give them a score from zero to 1 and then you wait scores.",
                    "label": 0
                },
                {
                    "sent": "So you say this classifiers are more important than the others.",
                    "label": 0
                },
                {
                    "sent": "Call of course.",
                    "label": 0
                },
                {
                    "sent": "Depending on the project and then you calculate the weighted average of classifiers course an you rank sentences according to that.",
                    "label": 0
                },
                {
                    "sent": "Now this was first used, the Good Express first used in lexicography for Macmillan English Dictionary Online, so they were they needed.",
                    "label": 1
                },
                {
                    "sent": "More examples for collocations and they use the tool.",
                    "label": 0
                },
                {
                    "sent": "The results according to reports, are quite promising that and the short and lexicographers time spent on searching good examples and the procedure was based on manually annotated good sentences in a set.",
                    "label": 0
                },
                {
                    "sent": "Of course, is not that this is where we come to the question.",
                    "label": 0
                },
                {
                    "sent": "Is this useful for other languages?",
                    "label": 0
                },
                {
                    "sent": "Can this be made useful?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We believe so, and in our project we had we had a similar need and this is the project mentioned already this morning and we need it for the specific purpose of lexical database for slowing.",
                    "label": 0
                },
                {
                    "sent": "So we needed we were looking for examples of headwords for Caucasians for constructions and we using sketch engine.",
                    "label": 0
                },
                {
                    "sent": "In selecting examples in Word sketch, so we use, we use the tick box lexicography.",
                    "label": 1
                },
                {
                    "sent": "We're still using it, so if you're not familiar with this so.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Basically it offers you the word sketch of the words, so the grammatical relations with.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The color kits and you select them and then you select the examples.",
                    "label": 0
                },
                {
                    "sent": "And the number of examples offered is chosen by the lexicographer.",
                    "label": 0
                },
                {
                    "sent": "But it tends to be between 10 and 15.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now the aim was let's design good express loving that would offer three good examples out of 10 for each color kit, because lexicographers normally select so out of these 10 here I want at least three, they're good.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "So we.",
                    "label": 0
                },
                {
                    "sent": "We used the non language specific classifier for English of English, Good X as a point of departure.",
                    "label": 0
                },
                {
                    "sent": "So for example Wordnet Synsets for English, we couldn't use those.",
                    "label": 0
                },
                {
                    "sent": "And we sort of changed the procedure a bit by using existing manually selected examples in the lexical database as a benchmark.",
                    "label": 0
                },
                {
                    "sent": "So we already had it.",
                    "label": 0
                },
                {
                    "sent": "We already had manually selected examples in database, partly because the we couldn't use the English Codex, so it was still quite time consuming to find examples, but they were good and we offered sort of made a database and we use the vector tool to determine the values of these classifiers.",
                    "label": 0
                },
                {
                    "sent": "So for those of you not familiar with Becca, Tool is a data visualization tool that shows various statistics for each feature and also offers you more advanced visualization like 3D charts, where that you determined efficiency of two measurements.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is just an example, so you have features to the left and then the values to the right.",
                    "label": 0
                },
                {
                    "sent": "I mean I won't go into any detail, it's very complex to summarize this in.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One or two sentences.",
                    "label": 0
                },
                {
                    "sent": "One of the other things that we we quickly notice when we did the initial analysis on good experts.",
                    "label": 0
                },
                {
                    "sent": "That examples were rather similar, so sometimes you can imagine 2 examples that are similar or even the same will be scored the same, so they will be ranked exactly the same or similar and put higher or lower.",
                    "label": 0
                },
                {
                    "sent": "So we wanted to get rid of that.",
                    "label": 0
                },
                {
                    "sent": "We wanted more unique examples, because normally lexicographer would pick one.",
                    "label": 0
                },
                {
                    "sent": "And justice ignore the others.",
                    "label": 0
                },
                {
                    "sent": "So this language time distance was introduced so examples had to differ at least 30%.",
                    "label": 1
                },
                {
                    "sent": "And we divide several configurations and I'll explain later how the process for that, which were different, not.",
                    "label": 0
                },
                {
                    "sent": "In classifiers, but mainly in classifier values and weights, there were some difference in classifieds but not substantial.",
                    "label": 1
                },
                {
                    "sent": "And then we did the evaluation, which was rather a crucial part of the whole design process.",
                    "label": 0
                },
                {
                    "sent": "So we used word sketches, becausw that that is the.",
                    "label": 0
                },
                {
                    "sent": "Way are lexicographers work, so we wanted to simulate the work and we set the minimum frequency of a color cut to 15, because if it's if you have fewer examples in that, then good X ranking doesn't even help you get all examples shown anyway and we looked at the lemmas of nouns, verbs, adjectives and adverbs because these are the lemmas in lexical database at the moment.",
                    "label": 0
                },
                {
                    "sent": "We also did.",
                    "label": 0
                },
                {
                    "sent": "We also log the examples, both good ones and bad ones so we could analyze them further and improve the configurations.",
                    "label": 0
                },
                {
                    "sent": "What was designed especially for the project was the tick box lexicography feature that allowed the comparison of two configurations.",
                    "label": 1
                },
                {
                    "sent": "Because it was very difficult to sort of, say, so what's different in this one from the previous one?",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this was designed so you can compare two configurations, so one on the left, one on the right.",
                    "label": 0
                },
                {
                    "sent": "You can see the length, sorry, the length of the sentences, the position of the keyword, and I'll demonstrate that a bit late.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Your.",
                    "label": 0
                },
                {
                    "sent": "One important question you have to ask.",
                    "label": 0
                },
                {
                    "sent": "We had to answer this when starting the evaluation was So what kind of examples are looking for?",
                    "label": 0
                },
                {
                    "sent": "Is it really the dictionary examples?",
                    "label": 0
                },
                {
                    "sent": "Because we were designing the lexical database or is it something else?",
                    "label": 0
                },
                {
                    "sent": "Well, first of all, there's this debate.",
                    "label": 0
                },
                {
                    "sent": "Should you modify corpus examples?",
                    "label": 1
                },
                {
                    "sent": "I know the corpus driven.",
                    "label": 0
                },
                {
                    "sent": "Proponents will say that you shouldn't really modify them to.",
                    "label": 0
                },
                {
                    "sent": "You should leave them as they are.",
                    "label": 0
                },
                {
                    "sent": "And I think grammar Krishnamurti, who was my PhD supervisor, really crucified for this.",
                    "label": 0
                },
                {
                    "sent": "But anyway, I looked at his words, what he wrote in the book about Co build project and even he had to admit that at some point some examples had to be modified a little because they, for example they were too long or they contained really odd words and but they were, they were not enough examples on offer.",
                    "label": 0
                },
                {
                    "sent": "So they had to modify those, so the next the next comparison is between lexical database example.",
                    "label": 1
                },
                {
                    "sent": "In a dictionary example and this is where basically our answer comes from is we allowed.",
                    "label": 0
                },
                {
                    "sent": "To sort of say OK example can break some of the rules of what a good example is.",
                    "label": 1
                },
                {
                    "sent": "If it can be later modified into a good dictionary example.",
                    "label": 0
                },
                {
                    "sent": "So you can have a longer example with some more difficult words.",
                    "label": 0
                },
                {
                    "sent": "If there is a potential to make it a bit shorter and still have a good dictionary example with enough context.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is the procedure that was take took place.",
                    "label": 0
                },
                {
                    "sent": "So first of all I already mentioned the first part, so we did a vector analysis on the manually selected examples.",
                    "label": 1
                },
                {
                    "sent": "We devised the configuration slow in one immediately corrected because we left out one of the classifiers and then we did evaluation plus vector analysis and we sort of device the next configuration based on the findings and this took place in the next stage.",
                    "label": 0
                },
                {
                    "sent": "We already introduced the comparison because we had to configurations to compare.",
                    "label": 0
                },
                {
                    "sent": "The better one was normally sort of selected, so if you see slowing one versus slowing two in the next phase slowing one was kept slowing.",
                    "label": 0
                },
                {
                    "sent": "Two was ignored because it really produced poor results and we moved on until we got too good X for slowing, which is actually slowing configuration slowing tree.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right now, just to show you some of the examples of this comparison.",
                    "label": 0
                },
                {
                    "sent": "So first of all this is comparison.",
                    "label": 0
                },
                {
                    "sent": "I think there are many.",
                    "label": 0
                },
                {
                    "sent": "Examples to show, but chose a hopefully a good one.",
                    "label": 0
                },
                {
                    "sent": "You don't need to know slowing to see the points.",
                    "label": 0
                },
                {
                    "sent": "I'll try to make so, but first of all two configurations, same color kit for the headward Mucha T which is.",
                    "label": 0
                },
                {
                    "sent": "Verb, and just to point out, so this is the example that is ranked exactly the same in same position, same example, and these are the.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Examples that are different so all the other examples here, not mark.",
                    "label": 0
                },
                {
                    "sent": "Occur also in both, but they're ranked differently, so they're not for a second, so this was the comparison that we made between the first 2 configurations.",
                    "label": 0
                },
                {
                    "sent": "So not make a lot of difference Now this the second part was where we compared slowing one or slowing tool and.",
                    "label": 0
                },
                {
                    "sent": "That there were many.",
                    "label": 0
                },
                {
                    "sent": "Different examples, so these are the marked ones, so 5 examples different in both configurations and more important, more importantly, as will be demonstrated later.",
                    "label": 0
                },
                {
                    "sent": "It is also different in examples produced in terms of length and keyword position.",
                    "label": 0
                },
                {
                    "sent": "So here you can see a bit of length.",
                    "label": 0
                },
                {
                    "sent": "Of some examples being longer already shown.",
                    "label": 0
                },
                {
                    "sent": "Now slowing 1 compared to slowing 3.",
                    "label": 0
                },
                {
                    "sent": "If I listen.",
                    "label": 0
                },
                {
                    "sent": "Everything is different, so all examples are different.",
                    "label": 0
                },
                {
                    "sent": "So this was starting difference.",
                    "label": 0
                },
                {
                    "sent": "You can see longer examples.",
                    "label": 0
                },
                {
                    "sent": "You can see positioning of keywords towards the end.",
                    "label": 0
                },
                {
                    "sent": "I'll mention why that's important.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Your.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then finally we compared slow entry with slowing 3B and there were no differences.",
                    "label": 0
                },
                {
                    "sent": "They're all the same examples, just in different order.",
                    "label": 0
                },
                {
                    "sent": "So we then just discard it, slowing three.",
                    "label": 0
                },
                {
                    "sent": "We said slowing slowing 3B with its low entry.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is enough for us, so our findings were sentence length.",
                    "label": 0
                },
                {
                    "sent": "The optimum we had to increase at the initial one was 8:30.",
                    "label": 0
                },
                {
                    "sent": "We care to increase it to 15 to 35 and that showed considerable improvement.",
                    "label": 0
                },
                {
                    "sent": "The keyword position with English.",
                    "label": 1
                },
                {
                    "sent": "It was the beginning of the sentence with slow in middle to end of the sentence.",
                    "label": 1
                },
                {
                    "sent": "So it was really slowing.",
                    "label": 1
                },
                {
                    "sent": "That's a better position for a keyword and we had to penalize the repetitions of the word in the same example.",
                    "label": 0
                },
                {
                    "sent": "We limited the sentence length and also the.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Word length now just to show you what I mean by limiting the word.",
                    "label": 0
                },
                {
                    "sent": "Lines were limited to 18, so when you get to the word list and you see above 18, you get sort of web.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ages and some.",
                    "label": 0
                },
                {
                    "sent": "Errors in tokenization and you really want to penalize that, otherwise you get a lot of.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Nice.",
                    "label": 0
                },
                {
                    "sent": "I have to say the initial goal of getting 2 examples for Collocate actually, was achieved was initially 5 but were overly ambitious.",
                    "label": 0
                },
                {
                    "sent": "So just to summarize, these are some of the remaining issues, so we found some central initial adverbs often found in bed examples in all configurations.",
                    "label": 1
                },
                {
                    "sent": "So we will add a stop list for that.",
                    "label": 0
                },
                {
                    "sent": "Ending with something other than full stops or still found, I think... was causing the problem, but that will be solved now and different configurations.",
                    "label": 1
                },
                {
                    "sent": "This is an important point.",
                    "label": 0
                },
                {
                    "sent": "Work better with different types of lemma.",
                    "label": 1
                },
                {
                    "sent": "So for slowing tree slowing 3B work better with adjectives and nouns but keyword position 40 to 100 within this configuration caused problems with some of the verbs because they were found at the end of the example and they didn't have enough context.",
                    "label": 0
                },
                {
                    "sent": "And this is clear evidence that you need perhaps more than one Codex configuration for a language.",
                    "label": 1
                },
                {
                    "sent": "So our future plans are to sort of improve the classifiers in to sort of.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Them closer also to improve them in a way that could explore English already is.",
                    "label": 0
                },
                {
                    "sent": "And also this is our next project in the next upcoming month is to use Good X in automatic extraction.",
                    "label": 1
                },
                {
                    "sent": "So designing different configurations for different types of lemma.",
                    "label": 1
                },
                {
                    "sent": "And this is an important point.",
                    "label": 0
                },
                {
                    "sent": "We're no longer looking for three examples in among 10 or 15, but for three top good examples because automatic extraction will want to select the first top three and then put it in a database rather than say, well which of these ten we don't.",
                    "label": 0
                },
                {
                    "sent": "We want to eliminate the human intervention at that point.",
                    "label": 0
                },
                {
                    "sent": "And that is it.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Very interesting and inspiring.",
                    "label": 0
                },
                {
                    "sent": "I was wondering about the keyword position.",
                    "label": 0
                },
                {
                    "sent": "Well one of the aims of having good examples is typicality, of course, and this is 1 aspect, which it seems to be rather easily computationally tractable.",
                    "label": 0
                },
                {
                    "sent": "You think it might be possible in some future to actually quickly go through the examples located and see what the typical sentence position is for your keyword, and perhaps prefer examples which replicate that typical position.",
                    "label": 0
                },
                {
                    "sent": "It was Michael Howie that has done somewhere contextual position and we know that it's item specific because it depends on the discourse function of some items.",
                    "label": 0
                },
                {
                    "sent": "OK, so I.",
                    "label": 0
                },
                {
                    "sent": "It's the I think it can be done.",
                    "label": 0
                },
                {
                    "sent": "I think it should be done the.",
                    "label": 0
                },
                {
                    "sent": "The only problem is that when you're working with a tool like this, it's speed that you want and it's everything is done on the fly.",
                    "label": 0
                },
                {
                    "sent": "So what sketches are already calculated?",
                    "label": 0
                },
                {
                    "sent": "But the examples are ranked on the fly, so you would have to have everything stored already for each headword that you would want to analyze.",
                    "label": 0
                },
                {
                    "sent": "But yes, that's that's definitely something desirable.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for the very interesting talk.",
                    "label": 0
                },
                {
                    "sent": "I think this is a very good project and I was wondering if you have thought of applying it to other areas like language learning, for example looking at different kind of user groups an adapting these features that you're investigating to specific users.",
                    "label": 0
                },
                {
                    "sent": "Yes, in fact we will do that because in the project that we're working on.",
                    "label": 0
                },
                {
                    "sent": "There are different activities taking place and for lexical database specifically, we need this kind of tool to extract lexical database examples.",
                    "label": 0
                },
                {
                    "sent": "For example, we are also working for on online grammar where we need examples for very more low level for learners, but native speaker learners, so elementary secondary school.",
                    "label": 0
                },
                {
                    "sent": "Students and examples there have to be much less complex than in the lexical database.",
                    "label": 0
                },
                {
                    "sent": "Of course there is also the potential of saying kinda lexical database examples be modified.",
                    "label": 0
                },
                {
                    "sent": "So in the way we're working at the moment, but we also need some examples directly extracted, so looking at more generally, what I would say is that if you take a tool like this behind this, there are many configurations and we were.",
                    "label": 0
                },
                {
                    "sent": "We were sort of fine tuning the this one for slowing at the moment, but now you can take it and you say OK, I prefer sentence length between 7 to 15 and I don't want any difficult words so you actually can specify them.",
                    "label": 0
                },
                {
                    "sent": "And then that will give you the results more towards what you want.",
                    "label": 0
                },
                {
                    "sent": "And then you can fine tune for learners for the database.",
                    "label": 0
                },
                {
                    "sent": "I mean for any type of user, but they need different configuration just to say I really like Roberts comment and I think that's something we should we should do.",
                    "label": 0
                },
                {
                    "sent": "We can.",
                    "label": 0
                },
                {
                    "sent": "So to take the so if we're finding a typical example for.",
                    "label": 0
                },
                {
                    "sent": "Score a goal, then we can say we've got 200 examples for it, and let's use that as a data set for finding the most.",
                    "label": 0
                },
                {
                    "sent": "For finding various features that are typical for score goal, including position include including also the other color coat which relates a bit to something you said it stop.",
                    "label": 0
                },
                {
                    "sent": "This issue of finding very similar examples to each other.",
                    "label": 1
                },
                {
                    "sent": "Of not finding them.",
                    "label": 0
                },
                {
                    "sent": "Of not finding them, not wanting to play yes.",
                    "label": 0
                },
                {
                    "sent": "And the way I see it is sort of an absolute level.",
                    "label": 0
                },
                {
                    "sent": "It's a problem, comes up a lot.",
                    "label": 0
                },
                {
                    "sent": "You're looking for something.",
                    "label": 0
                },
                {
                    "sent": "So if you look if you find it, you find others.",
                    "label": 0
                },
                {
                    "sent": "If you find it.",
                    "label": 0
                },
                {
                    "sent": "If you want more than one of it, you find them there all the same.",
                    "label": 0
                },
                {
                    "sent": "So what you want to do is on the 1st 10, find things that are the best and on the other hand diversity and what?",
                    "label": 0
                },
                {
                    "sent": "One way to approach that would be to say, will, let's find let's if we've got.",
                    "label": 0
                },
                {
                    "sent": "A two word collicut, then the.",
                    "label": 0
                },
                {
                    "sent": "Then we can find we can look for the third words that go with those first 2 words, and we're going to have one example for for the first third, click it and another example for the 2nd third collicutt and the third example for the third, so call.",
                    "label": 0
                },
                {
                    "sent": "It can actually ensure that they're not all about the same as each other, and are showing a spread of behavior, yes.",
                    "label": 0
                },
                {
                    "sent": "Implement that as soon as possible please.",
                    "label": 0
                },
                {
                    "sent": "This dude.",
                    "label": 0
                },
                {
                    "sent": "I think that's a nice way of for closing this presentation.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}