{
    "id": "jjn7hjrg2wczei6wjqjdzo6oaf226grg",
    "title": "BOTTARI: Location based Social Media Analysis with Semantic Web",
    "info": {
        "author": [
            "Emanuele Della Valle, Politecnico di Milano"
        ],
        "published": "Nov. 25, 2011",
        "recorded": "October 2011",
        "category": [
            "Top->Computer Science->Social Media",
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2011_valle_bottari/",
    "segmentation": [
        [
            "Short movie that.",
            "Yeah, better to move away."
        ],
        [
            "Start moving out the English straight.",
            "Our application, which as you can see the mobile application that actually you can use in the street over some part of sorry.",
            "Some part of Korea in a given part of civil.",
            "And what it does is recommending you which restaurant you should have dinner in and it does it based on social stories and so we try to get the pools of what's going on on the web.",
            "Mining this streams of tweets, blogs and news and actually comes up with recommendations that fits you and the idea is that there is a bunch of machine learning going on behind that tried to predict what you should do it positively about next.",
            "Given what you have been tweeting.",
            "Positively about so far on the other recommendation based on other technique, but I will go into that in the slides.",
            "OK, so we don't need this anymore."
        ],
        [
            "Of course you are very welcome to come to me or Frank and you will have the possibility to try it out as we did yesterday evening.",
            "So OK, you've seen something which is not so unusual, right?",
            "I mean, it's an amended reality application where you have some layering of digital things on top of a part of reality.",
            "And I was saying that you have had several different way of doing recommendations.",
            "One is for me, one is a popular one is.",
            "Interesting one is emerging so keep them in mind because I will go back on this for different things."
        ],
        [
            "Later on, I believe it this is not yet just another trip advisory thing and the reason is that it's a bit more Democratic if you let me say that it's listening to what people is saying on all the channels and it's try to mine it and get some of his reality into your device and it pops up.",
            "Things like these graphs where you can see the amount of positive negative tweets that were post.",
            "Or you can have other visualization in heat Maps.",
            "If you want to see them in a different way."
        ],
        [
            "Beyond this universe is eternal semantic web technology.",
            "So the first thing is that we have an architecture which has a push part and pull apart the push part.",
            "At least that initiated.",
            "So you have a tweet that comes out of Twitter and you get them crawlers and you apply sentiment analysis to them.",
            "They become much more abstract RDF streams that goes above through a machine learning part, which is these are deaf to matrix.",
            "Plug in an into the streaming link data server.",
            "On then when this stuff is running OK and you have all this window full up of data, when actually you can do query on top of it, and so when your Aunt Regina Baeza application comes and send a sparkle query, what happens is that the query actually sorry.",
            "Activate service components inside of the architecture that we're using and comes back with the results and then typing is based on larger, which is a pluggable framework which made it very easy for us actually to plug all these different components so we have some machine learning, some stream processing and some geospatial knowledge base in place here so."
        ],
        [
            "Sentiment mining is based on state of the art.",
            "Technology is a product by Sal looks, which is our Korean partner here.",
            "And it basically try to do a simple thing.",
            "So if a sentence that you detect in the microblog makes sense in English or in Korean.",
            "So if morphological analysis good when we apply a rule based approaches to detect if if you have a positive or bad feeling about it, if it's not written in a good natural language for me, just use machine learning again too.",
            "Try to do the same as you consume in viz is all about precision and so we don't really care if we drop many tweets that don't.",
            "We cannot actually detect the mood of.",
            "Basically we want precise indications.",
            "In any case we will drop any people that is around and is not tweeting."
        ],
        [
            "But Geo Knowledge Base is based off an extended version of Shock Ontology."
        ],
        [
            "The most important thing is that you can head with the relationship between a tweet and a point of interest, and you can say you ever visit is a positive and negative or neutral.",
            "Discussion or proposition."
        ],
        [
            "When we have the streaming link data part, which is based on spark, what you can do is coming up with an actor for queries that actually consume each other date as an somehow perform some interesting things.",
            "In this case is just summing up a positive tweets for each.",
            "For each point of interest, and then it keeps a window over the day window over the month I went over the weekend."
        ],
        [
            "For the machine learning stuff is also quite interesting in space on an approach which is called statistical unit note sets and it basically does inductive materialization.",
            "So you send an RDF graph in and what it does it predict all the other triples which are not him, and basically it does it by using quite an interesting I dimensional and.",
            "Sorry, multivariate Latin space approach that copes with multidimensional and incomplete data."
        ],
        [
            "Onto this is the back end when you get the query.",
            "Actually the system does the following.",
            "You detect that there are three different flavors in the query.",
            "For instance, there is a request for a given point of interest, which is written in some.",
            "Magic function with ask for your given distance of the point where you are from a point of interest and also taking consideration that you have one of these Android tablet in your hand.",
            "So you are orienting yourself in a given direction so it will only pop up things that sort of meet the direction that you're looking for.",
            "When there is this second.",
            "Parts in blue, which actually is the query language for sons, and it allows you to put in brackets a basic graph pattern and then you can actually ask whether this graph pattern is into the materialized, inductive, materialized version of a graph and hear what you're asking is for a user which is a creator of a tweet that talks positive about some point of interest, and we want the probability to be larger than 50% but not one, and so we don't want to.",
            "At actually to get the real data, we only want the materialize into rematerialized one and the last one, which is just the line is actually the way you can read the results of all the stream competition.",
            "And because what happened is that the streaming link data part publish things like that.",
            "So I've been getting 122 positive feedbacks about this point of interest."
        ],
        [
            "And so going to visualization again so you have a query coming in so it's chop it down.",
            "As I said him different parts.",
            "One part goes to the probabilistic engine that tried to computer anchored list of pointer instead based on your probability to tweet positively about them, another part goes to the streaming stuff that actually reads the current top list of point of interest and tells you exactly which are most like it.",
            "Point of interest in this moment and also goes to videos partial knowledge base where you actually got a bound and what you have to do is to combine these free lenker list and make one list and that will be helpful and you can do any kind of mix of a different query that you like an avenging with somehow support them.",
            "So in."
        ],
        [
            "Names of evaluation.",
            "We have been trying to to evaluate this thing as much as possible, so this graph here.",
            "Sorry, I forgot to put it there.",
            "X graph is but top N and the Y is very accuracy and so what's going on here is that we are trying to check whether different techniques are able to actually give us a good set of proposal for point of interest and it was done taking away the last tweet in the data set and checking whether we were able to predict it for each user into the data set.",
            "So you can see, but if you just do random, you are around 10% when you go up to 30 results we will say basic benchmark from machine learning so nearest neighborhoods will somehow do things but start from 20% and go up to 40.",
            "Or the simple thing that you do by counting.",
            "So with lease that you do by top K. Lists of things that were treated positively already performed quite nicely, so it got already 20% of suggestion right, which means that there is a lot of iPad.",
            "So when people like Swan restaurant, everybody likes it, and when people don't like it anymore, nobody likes it anymore.",
            "The machine learning things is for me and it's the 2nd way that you can do with predictions, and it's a bit better than the emerging when it goes up to 50%.",
            "When you got enough.",
            "Points and if you combine them, which is exactly what we want to show him.",
            "But I mean by combining different techniques you can get better results.",
            "You actually outperform even before me."
        ],
        [
            "You may wonder if this is efficient and not only somehow possible to do in terms of efficacy, so this first slide is about availability of system to have a high throughput and so somehow on a standard laptop when you send the tweets in with querying graph that I was showing you are able to cope with up to 6000 people per second so without any deley and then when you send in things which are larger sum of assistant.",
            "Sort of stop responding in real time and keeps doing things quite fast, but still not in real time.",
            "So when you send in some 14,000 people per second, you should expect results in the worst case in 14,000 three plus per second, OK."
        ],
        [
            "J and terms of scalability services that attempt to measure their ability to support multiple user at the same time.",
            "So when you have just one user within, But again demonstrates some of the query latency is around one second and when you actually pull a lot of users in up to 50, it gracefully goes up, possibly nary to some free 5 seconds.",
            "Depends on what you're asking for on this is mainly die by caching, and so it's not."
        ],
        [
            "Magic conclusions, I believe that you we were presenting a quite an answer end user application with how we say attractive functional interface.",
            "It goes on real world data which are also quite dynamic and it's fully based on the semantic web technology that we have been working on for so many years.",
            "Use RDF as the common language for all these different plugins to communicate and you sparkle as the only language that you can send to this complex engine.",
            "Inside query written in different languages and so you have seen that there are different flavors of sparkle inside an.",
            "It was somehow rigorously tested for what we were able to do.",
            "So what we're going to do now in exactly these days is to present lists to real user and try to check which are very recommendation that they really like and.",
            "In any case, I believe that visit attempt to do it on the data by predicting the last Twitter was already something good for us and also brings all look some possibilities to try to commercialize.",
            "We have concrete plan to do a trial in two square kilometer area where I can do the demonstration next year in winter.",
            "So between January, March and if I succeed in having it running properly, we meant to do it in school.",
            "And if the costs are correct.",
            "You may even be a successful business, so thank you very much and if you come to Korea in two years, maybe you can see this running on lock."
        ],
        [
            "Add question.",
            "So question about the data.",
            "So you mentioned that you're using geospatial data, but I imagine you also use.",
            "Data about restaurants.",
            "Because you mentioned there are restaurants, so can you tell a bit more about what the data sources are and how do we integrate them?",
            "Yeah, so we have tried several different things here two years ago.",
            "We try using linger data and that was quite nicely because it was possible to do it on a large scale, but the data were not precise enough and so somehow open street map is a nice tool, but people don't put accurate things on it so you will.",
            "Basically not be able to achieve a right precision, so we use LINQ to data is a busy part and then people from from school from Sal looks actually went through with two square kilometer area and did precise positioning of restaurants.",
            "An assessment with photo and other things so they geospatial knowledge base is sort of seeded by Joe linked data, but when constructed by manual work and the idea for scaling up.",
            "Is to use governmental data.",
            "So we are negotiating with the local government for getting the data for the position of the restaurants.",
            "Another point of instruments.",
            "Tom, yeah, firstly a comment that obviously the large platform so wonderful and powerful that it made it very easy to integrate this, which is perhaps not in favor of your of your entry.",
            "Anyway, serious question is the and maybe it's unfair to ask you this, but given the high cost of running a system like this and the low price people are willing to pay for Android applications, how does the.",
            "Your group intend to commercialize it.",
            "Housed, assault looks actually intend to commercialize this.",
            "Yeah, if I find it in a millisecond, I show you one thing.",
            "If I don't, I answer without.",
            "Did I click so we did this sort of evaluation of this course?",
            "I don't know why I didn't open it.",
            "Is it somewhere OK answer without the slide so we didn't attempt to evaluate the costs and they're not low?",
            "If for some 2000 users for that area of Seoul it will cost something like 8000 euro per day running it?",
            "Yeah, including all their crawling, but you need all the work that you need and it's also caused some 20,000 euro to do the work that I was asked before so it was really expensive to go around and fetch the data, Navi quality, knowledge base.",
            "But the idea is that if you try to sell it, the premium version with some added value services we have some.",
            "We say five euros it will sort of payoff already in two years.",
            "If you start doing localized advertisement with the standard rates that you find around, you may even pay off in one year at half.",
            "And if you also had some other ideas like you have sponsored peo I where you try to to play with it and people can actually push up a bit.",
            "They results by paying when you can have a result in one year.",
            "Thanks.",
            "Thank you very much, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Short movie that.",
                    "label": 0
                },
                {
                    "sent": "Yeah, better to move away.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Start moving out the English straight.",
                    "label": 0
                },
                {
                    "sent": "Our application, which as you can see the mobile application that actually you can use in the street over some part of sorry.",
                    "label": 0
                },
                {
                    "sent": "Some part of Korea in a given part of civil.",
                    "label": 0
                },
                {
                    "sent": "And what it does is recommending you which restaurant you should have dinner in and it does it based on social stories and so we try to get the pools of what's going on on the web.",
                    "label": 0
                },
                {
                    "sent": "Mining this streams of tweets, blogs and news and actually comes up with recommendations that fits you and the idea is that there is a bunch of machine learning going on behind that tried to predict what you should do it positively about next.",
                    "label": 0
                },
                {
                    "sent": "Given what you have been tweeting.",
                    "label": 0
                },
                {
                    "sent": "Positively about so far on the other recommendation based on other technique, but I will go into that in the slides.",
                    "label": 0
                },
                {
                    "sent": "OK, so we don't need this anymore.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course you are very welcome to come to me or Frank and you will have the possibility to try it out as we did yesterday evening.",
                    "label": 0
                },
                {
                    "sent": "So OK, you've seen something which is not so unusual, right?",
                    "label": 0
                },
                {
                    "sent": "I mean, it's an amended reality application where you have some layering of digital things on top of a part of reality.",
                    "label": 0
                },
                {
                    "sent": "And I was saying that you have had several different way of doing recommendations.",
                    "label": 0
                },
                {
                    "sent": "One is for me, one is a popular one is.",
                    "label": 0
                },
                {
                    "sent": "Interesting one is emerging so keep them in mind because I will go back on this for different things.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Later on, I believe it this is not yet just another trip advisory thing and the reason is that it's a bit more Democratic if you let me say that it's listening to what people is saying on all the channels and it's try to mine it and get some of his reality into your device and it pops up.",
                    "label": 0
                },
                {
                    "sent": "Things like these graphs where you can see the amount of positive negative tweets that were post.",
                    "label": 0
                },
                {
                    "sent": "Or you can have other visualization in heat Maps.",
                    "label": 0
                },
                {
                    "sent": "If you want to see them in a different way.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Beyond this universe is eternal semantic web technology.",
                    "label": 0
                },
                {
                    "sent": "So the first thing is that we have an architecture which has a push part and pull apart the push part.",
                    "label": 0
                },
                {
                    "sent": "At least that initiated.",
                    "label": 0
                },
                {
                    "sent": "So you have a tweet that comes out of Twitter and you get them crawlers and you apply sentiment analysis to them.",
                    "label": 0
                },
                {
                    "sent": "They become much more abstract RDF streams that goes above through a machine learning part, which is these are deaf to matrix.",
                    "label": 0
                },
                {
                    "sent": "Plug in an into the streaming link data server.",
                    "label": 0
                },
                {
                    "sent": "On then when this stuff is running OK and you have all this window full up of data, when actually you can do query on top of it, and so when your Aunt Regina Baeza application comes and send a sparkle query, what happens is that the query actually sorry.",
                    "label": 0
                },
                {
                    "sent": "Activate service components inside of the architecture that we're using and comes back with the results and then typing is based on larger, which is a pluggable framework which made it very easy for us actually to plug all these different components so we have some machine learning, some stream processing and some geospatial knowledge base in place here so.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sentiment mining is based on state of the art.",
                    "label": 1
                },
                {
                    "sent": "Technology is a product by Sal looks, which is our Korean partner here.",
                    "label": 0
                },
                {
                    "sent": "And it basically try to do a simple thing.",
                    "label": 0
                },
                {
                    "sent": "So if a sentence that you detect in the microblog makes sense in English or in Korean.",
                    "label": 0
                },
                {
                    "sent": "So if morphological analysis good when we apply a rule based approaches to detect if if you have a positive or bad feeling about it, if it's not written in a good natural language for me, just use machine learning again too.",
                    "label": 0
                },
                {
                    "sent": "Try to do the same as you consume in viz is all about precision and so we don't really care if we drop many tweets that don't.",
                    "label": 0
                },
                {
                    "sent": "We cannot actually detect the mood of.",
                    "label": 0
                },
                {
                    "sent": "Basically we want precise indications.",
                    "label": 0
                },
                {
                    "sent": "In any case we will drop any people that is around and is not tweeting.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But Geo Knowledge Base is based off an extended version of Shock Ontology.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The most important thing is that you can head with the relationship between a tweet and a point of interest, and you can say you ever visit is a positive and negative or neutral.",
                    "label": 0
                },
                {
                    "sent": "Discussion or proposition.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When we have the streaming link data part, which is based on spark, what you can do is coming up with an actor for queries that actually consume each other date as an somehow perform some interesting things.",
                    "label": 0
                },
                {
                    "sent": "In this case is just summing up a positive tweets for each.",
                    "label": 0
                },
                {
                    "sent": "For each point of interest, and then it keeps a window over the day window over the month I went over the weekend.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For the machine learning stuff is also quite interesting in space on an approach which is called statistical unit note sets and it basically does inductive materialization.",
                    "label": 1
                },
                {
                    "sent": "So you send an RDF graph in and what it does it predict all the other triples which are not him, and basically it does it by using quite an interesting I dimensional and.",
                    "label": 1
                },
                {
                    "sent": "Sorry, multivariate Latin space approach that copes with multidimensional and incomplete data.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Onto this is the back end when you get the query.",
                    "label": 0
                },
                {
                    "sent": "Actually the system does the following.",
                    "label": 0
                },
                {
                    "sent": "You detect that there are three different flavors in the query.",
                    "label": 0
                },
                {
                    "sent": "For instance, there is a request for a given point of interest, which is written in some.",
                    "label": 0
                },
                {
                    "sent": "Magic function with ask for your given distance of the point where you are from a point of interest and also taking consideration that you have one of these Android tablet in your hand.",
                    "label": 0
                },
                {
                    "sent": "So you are orienting yourself in a given direction so it will only pop up things that sort of meet the direction that you're looking for.",
                    "label": 0
                },
                {
                    "sent": "When there is this second.",
                    "label": 0
                },
                {
                    "sent": "Parts in blue, which actually is the query language for sons, and it allows you to put in brackets a basic graph pattern and then you can actually ask whether this graph pattern is into the materialized, inductive, materialized version of a graph and hear what you're asking is for a user which is a creator of a tweet that talks positive about some point of interest, and we want the probability to be larger than 50% but not one, and so we don't want to.",
                    "label": 0
                },
                {
                    "sent": "At actually to get the real data, we only want the materialize into rematerialized one and the last one, which is just the line is actually the way you can read the results of all the stream competition.",
                    "label": 0
                },
                {
                    "sent": "And because what happened is that the streaming link data part publish things like that.",
                    "label": 0
                },
                {
                    "sent": "So I've been getting 122 positive feedbacks about this point of interest.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so going to visualization again so you have a query coming in so it's chop it down.",
                    "label": 0
                },
                {
                    "sent": "As I said him different parts.",
                    "label": 0
                },
                {
                    "sent": "One part goes to the probabilistic engine that tried to computer anchored list of pointer instead based on your probability to tweet positively about them, another part goes to the streaming stuff that actually reads the current top list of point of interest and tells you exactly which are most like it.",
                    "label": 0
                },
                {
                    "sent": "Point of interest in this moment and also goes to videos partial knowledge base where you actually got a bound and what you have to do is to combine these free lenker list and make one list and that will be helpful and you can do any kind of mix of a different query that you like an avenging with somehow support them.",
                    "label": 0
                },
                {
                    "sent": "So in.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Names of evaluation.",
                    "label": 0
                },
                {
                    "sent": "We have been trying to to evaluate this thing as much as possible, so this graph here.",
                    "label": 0
                },
                {
                    "sent": "Sorry, I forgot to put it there.",
                    "label": 0
                },
                {
                    "sent": "X graph is but top N and the Y is very accuracy and so what's going on here is that we are trying to check whether different techniques are able to actually give us a good set of proposal for point of interest and it was done taking away the last tweet in the data set and checking whether we were able to predict it for each user into the data set.",
                    "label": 0
                },
                {
                    "sent": "So you can see, but if you just do random, you are around 10% when you go up to 30 results we will say basic benchmark from machine learning so nearest neighborhoods will somehow do things but start from 20% and go up to 40.",
                    "label": 0
                },
                {
                    "sent": "Or the simple thing that you do by counting.",
                    "label": 0
                },
                {
                    "sent": "So with lease that you do by top K. Lists of things that were treated positively already performed quite nicely, so it got already 20% of suggestion right, which means that there is a lot of iPad.",
                    "label": 0
                },
                {
                    "sent": "So when people like Swan restaurant, everybody likes it, and when people don't like it anymore, nobody likes it anymore.",
                    "label": 0
                },
                {
                    "sent": "The machine learning things is for me and it's the 2nd way that you can do with predictions, and it's a bit better than the emerging when it goes up to 50%.",
                    "label": 0
                },
                {
                    "sent": "When you got enough.",
                    "label": 0
                },
                {
                    "sent": "Points and if you combine them, which is exactly what we want to show him.",
                    "label": 0
                },
                {
                    "sent": "But I mean by combining different techniques you can get better results.",
                    "label": 0
                },
                {
                    "sent": "You actually outperform even before me.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You may wonder if this is efficient and not only somehow possible to do in terms of efficacy, so this first slide is about availability of system to have a high throughput and so somehow on a standard laptop when you send the tweets in with querying graph that I was showing you are able to cope with up to 6000 people per second so without any deley and then when you send in things which are larger sum of assistant.",
                    "label": 0
                },
                {
                    "sent": "Sort of stop responding in real time and keeps doing things quite fast, but still not in real time.",
                    "label": 0
                },
                {
                    "sent": "So when you send in some 14,000 people per second, you should expect results in the worst case in 14,000 three plus per second, OK.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "J and terms of scalability services that attempt to measure their ability to support multiple user at the same time.",
                    "label": 0
                },
                {
                    "sent": "So when you have just one user within, But again demonstrates some of the query latency is around one second and when you actually pull a lot of users in up to 50, it gracefully goes up, possibly nary to some free 5 seconds.",
                    "label": 0
                },
                {
                    "sent": "Depends on what you're asking for on this is mainly die by caching, and so it's not.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Magic conclusions, I believe that you we were presenting a quite an answer end user application with how we say attractive functional interface.",
                    "label": 1
                },
                {
                    "sent": "It goes on real world data which are also quite dynamic and it's fully based on the semantic web technology that we have been working on for so many years.",
                    "label": 1
                },
                {
                    "sent": "Use RDF as the common language for all these different plugins to communicate and you sparkle as the only language that you can send to this complex engine.",
                    "label": 0
                },
                {
                    "sent": "Inside query written in different languages and so you have seen that there are different flavors of sparkle inside an.",
                    "label": 0
                },
                {
                    "sent": "It was somehow rigorously tested for what we were able to do.",
                    "label": 0
                },
                {
                    "sent": "So what we're going to do now in exactly these days is to present lists to real user and try to check which are very recommendation that they really like and.",
                    "label": 0
                },
                {
                    "sent": "In any case, I believe that visit attempt to do it on the data by predicting the last Twitter was already something good for us and also brings all look some possibilities to try to commercialize.",
                    "label": 0
                },
                {
                    "sent": "We have concrete plan to do a trial in two square kilometer area where I can do the demonstration next year in winter.",
                    "label": 0
                },
                {
                    "sent": "So between January, March and if I succeed in having it running properly, we meant to do it in school.",
                    "label": 0
                },
                {
                    "sent": "And if the costs are correct.",
                    "label": 0
                },
                {
                    "sent": "You may even be a successful business, so thank you very much and if you come to Korea in two years, maybe you can see this running on lock.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Add question.",
                    "label": 0
                },
                {
                    "sent": "So question about the data.",
                    "label": 0
                },
                {
                    "sent": "So you mentioned that you're using geospatial data, but I imagine you also use.",
                    "label": 0
                },
                {
                    "sent": "Data about restaurants.",
                    "label": 0
                },
                {
                    "sent": "Because you mentioned there are restaurants, so can you tell a bit more about what the data sources are and how do we integrate them?",
                    "label": 0
                },
                {
                    "sent": "Yeah, so we have tried several different things here two years ago.",
                    "label": 0
                },
                {
                    "sent": "We try using linger data and that was quite nicely because it was possible to do it on a large scale, but the data were not precise enough and so somehow open street map is a nice tool, but people don't put accurate things on it so you will.",
                    "label": 0
                },
                {
                    "sent": "Basically not be able to achieve a right precision, so we use LINQ to data is a busy part and then people from from school from Sal looks actually went through with two square kilometer area and did precise positioning of restaurants.",
                    "label": 0
                },
                {
                    "sent": "An assessment with photo and other things so they geospatial knowledge base is sort of seeded by Joe linked data, but when constructed by manual work and the idea for scaling up.",
                    "label": 0
                },
                {
                    "sent": "Is to use governmental data.",
                    "label": 0
                },
                {
                    "sent": "So we are negotiating with the local government for getting the data for the position of the restaurants.",
                    "label": 0
                },
                {
                    "sent": "Another point of instruments.",
                    "label": 0
                },
                {
                    "sent": "Tom, yeah, firstly a comment that obviously the large platform so wonderful and powerful that it made it very easy to integrate this, which is perhaps not in favor of your of your entry.",
                    "label": 0
                },
                {
                    "sent": "Anyway, serious question is the and maybe it's unfair to ask you this, but given the high cost of running a system like this and the low price people are willing to pay for Android applications, how does the.",
                    "label": 0
                },
                {
                    "sent": "Your group intend to commercialize it.",
                    "label": 0
                },
                {
                    "sent": "Housed, assault looks actually intend to commercialize this.",
                    "label": 0
                },
                {
                    "sent": "Yeah, if I find it in a millisecond, I show you one thing.",
                    "label": 0
                },
                {
                    "sent": "If I don't, I answer without.",
                    "label": 0
                },
                {
                    "sent": "Did I click so we did this sort of evaluation of this course?",
                    "label": 0
                },
                {
                    "sent": "I don't know why I didn't open it.",
                    "label": 0
                },
                {
                    "sent": "Is it somewhere OK answer without the slide so we didn't attempt to evaluate the costs and they're not low?",
                    "label": 0
                },
                {
                    "sent": "If for some 2000 users for that area of Seoul it will cost something like 8000 euro per day running it?",
                    "label": 0
                },
                {
                    "sent": "Yeah, including all their crawling, but you need all the work that you need and it's also caused some 20,000 euro to do the work that I was asked before so it was really expensive to go around and fetch the data, Navi quality, knowledge base.",
                    "label": 0
                },
                {
                    "sent": "But the idea is that if you try to sell it, the premium version with some added value services we have some.",
                    "label": 0
                },
                {
                    "sent": "We say five euros it will sort of payoff already in two years.",
                    "label": 0
                },
                {
                    "sent": "If you start doing localized advertisement with the standard rates that you find around, you may even pay off in one year at half.",
                    "label": 0
                },
                {
                    "sent": "And if you also had some other ideas like you have sponsored peo I where you try to to play with it and people can actually push up a bit.",
                    "label": 0
                },
                {
                    "sent": "They results by paying when you can have a result in one year.",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much, thank you.",
                    "label": 0
                }
            ]
        }
    }
}