{
    "id": "jlkzqwugmexb76ksmnnffdypaf6oksx6",
    "title": "Peer-to-Peer Tagged Media: Advances and Perspectives",
    "info": {
        "author": [
            "Ebroul Izquierdo, Queen Mary, University of London"
        ],
        "published": "Oct. 21, 2009",
        "recorded": "September 2009",
        "category": [
            "Top->Computer Science->Semantic Web->Annotation->Tagging",
            "Top->Computer Science->Information Retrieval->Multimedia Retrieval"
        ]
    },
    "url": "http://videolectures.net/pmiw09_ebroul_ptpaap/",
    "segmentation": [
        [
            "OK, thank you email.",
            "Good morning everybody.",
            "Also from my side I am I. I would like to start by saying that I am pretty glad to be here today for two main reasons.",
            "The first one is be cause score member of the Peter Media Consortium and we're only four core members.",
            "We are obliged to disseminate the outcomes of the project and this is what we intend to do here today.",
            "More than that we want also to get your feedback and learn from UC what.",
            "Do you think about what we're doing and perhaps try to also Tyler our research directions accordingly, and the second reason is 'cause it is pretty appealing to meet so many friends and colleagues we have been working with over the years in two different European projects.",
            "This is one of the, again, one of the appeals of this kind of meetings where you?",
            "Basically our bump into people that say you have been meeting for many years.",
            "This is the well, my name is Everly scared?",
            "Or in already already said that I am with Queen Mary, University of London.",
            "And what I'm going to do today is to give a sort of overview of the Peter Media activities.",
            "But focusing on the future.",
            "So this is the outline of the presentation."
        ],
        [
            "Going to spend a couple of minutes on couple of slides.",
            "Repeating or reminding you.",
            "What is Peter Media about and also what is the PETA Media Research paradigm and the majority of the time of this talk is going to be dedicated to the last three points approach towards the user cases, user scenarios on field trials.",
            "The reason is because these goes into what we want to do next and these are the points where we want to get feedback from you.",
            "So what the speed?"
        ],
        [
            "Yeah, so to answer this question quickly, I would like to start by explaining the origin of Peter Media, how this started.",
            "The idea of the media was to get a number of national networks together working together so we realize sometime ago that there were four national networks in four different countries, the Netherlands, the UK, Switzerland and Germany.",
            "Doing work related to Peter Media and we knew that the Commission provide funding to integrate research institutions across Europe.",
            "So the probably unique idea of this project here was to tap into these existing networks and get them together to do what well, first of all, to try to.",
            "Foster the relationships among the partners in the national networks and more than that, getting them together to work as a single network of networks.",
            "More than that, because this is a European project, we wanted also to go beyond this for a countries and embrace other institutions across Europe.",
            "And this is the reason why the PETA Media partner concept contains 3.",
            "Types of partners.",
            "The first one is the core partners, which are the contractual the institutions signing the contract with the Commission.",
            "Then we have what we call the network or affiliated partners, which are the partners of the original networks and the active partners which are partners.",
            "Outside of these four counties coming from other European institutions.",
            "So this is a."
        ],
        [
            "A slide showing the.",
            "A way we represent that we have the four networks here working together and one of the main aims of the work we're doing is to try to.",
            "Leave a sort of legacy are in the form of a virtual center of excellence.",
            "We will be working towards that and is also one of the objectives of the of the network in the context of integrating people now."
        ],
        [
            "Moving on to the actual topic, the work that we are doing.",
            "Op our technical level.",
            "What we want to do is based in what we call the triple scenery scenery, Peter Medias and network of excellence is doing what many other annoys are doing.",
            "Probably one of the main.",
            "The differentiating points with other annoys is the topic of research we are we're tackling, and this is based on what we call the triple synergy, and I'm going to explain a bit more about that in the next slide.",
            "This research paradigm is the one that is going to be used for what we call the field trials, and as I said at the beginning more."
        ],
        [
            "So my talk is going to be about the field trials so."
        ],
        [
            "We we we, we, we we are expect to explain as good as possible what is what we intend to do here in the in the field trials OK Fill trials about what.",
            "The the technical scope is is based on these three different topics of work here.",
            "Multimedia content analysis for tagging, keeping in mind that multimedia content analysis is everything what we want to do here is any sort of low level processing multimedia processing that goes directed or goes towards annotation of content.",
            "User contributed tax.",
            "They are metadata and very important the social.",
            "A dimension of all this in a peer to peer environment.",
            "These three fields of work or fields of research are what we call the Triple City synergy of PETA Media.",
            "And are they?",
            "Topics that we want to link together to advance to push forward the front different tiers of search and retrieval of multimedia content starting with tagging of data data.",
            "So the mission in general is to integrate all the resources that we have in all these countries.",
            "In all these different institutions towards achieving the goals of integrating technology.",
            "To advance the state of the art in annotation, annotation, tagging, and."
        ],
        [
            "Receival of multimedia content.",
            "Let me spend probably."
        ],
        [
            "Going to now to spend to use one slide to try to explain or elaborate a bit better on each one of these different.",
            "8 topics."
        ],
        [
            "Of the synergy of Peter Media, starting with a multimedia content analysis, this is a very generic view of what we mean.",
            "Without this is a low level processing.",
            "When you have a media database and.",
            "A researcher or a inducer player you use features, extracted extracted from that content to generate what we call a feature space that is going to be used to do the the analysis.",
            "On the other hand, you can have also a domain on teologi's at the other side of what we call the semantic gap and then we try to link these two things together to do inference and.",
            "To extract what is called the metadata that acts that we want to get out of the content.",
            "All this process is done automatically.",
            "The aim is again to get tax to get annotations of the content, and at some point we put also the human in the loop there to improve this annotations.",
            "So this picture basically shows you the overview of what we mean with multimedia content analysis.",
            "2 walls annotation."
        ],
        [
            "Towards tagging.",
            "User contributed, contributed tags or metadata.",
            "What is this?",
            "Well, this is also a field of work which embraces several different technologies.",
            "Starting front manual annotation using relevance feedback.",
            "When you assume that you have an interface, there you have the content and then you have a human trying to annotate generating tax.",
            "This is the conventional way of doing that.",
            "Of course a bit enhance by the fact that you can have some algorithms technologies in the background helping.",
            "The user to do the annotation model annotation.",
            "What we call relevance feedback.",
            "Object driven when you try to.",
            "Back the different pictures, assuming that what you have in these pictures as always or in this video, are single objects, and then you generate tax manually or semiautomatically, or automatically for each one of these objects.",
            "There are other techniques that we are using also in Peter Media to generate tax exploiting.",
            "The fact that the users are usually playing using content, for instance while playing a game.",
            "This is a follows the same right research directions of the ESP game that is using in the Google Image tool for annotation, and I do believe we will have a demonstration on these tools that has been implemented at Queen Mary University of London.",
            "I think we have a demonstration of that today.",
            "Other ways of doing this is by measuring using physiological data.",
            "We have sensors sensing the user and then we try to infer information from that and get also additional tags and.",
            "Using a gaze analysis, this is also work that we're doing at Queen Mary, in which basically we have some cameras there observing the user looking where the user is, gazing at, and trying to use this information to infer tax.",
            "Many others are using catch us to do annotation or work that is done at the Technical University of Delft and so on.",
            "So all this is what we call the user contributed.",
            "Facts that are coming from from the user, either by a explicitly interacting with the system, doing the annotation, the annotations in in a.",
            "Direct Direct Way or indirectly by observing the user and trying to infer."
        ],
        [
            "The tax out of that observations, so the third field of the synergy that we are considering here in Peter Media is the social aspect over peer to peer networks.",
            "This is very important becausw.",
            "Basically what it does is enable us to mine information that is distributed in the network and to try to use this information to improve to enhance the tasks that we are.",
            "Using to annotate the content.",
            "At technical level in Peter Media we are using peer to peer technology based on BitTorrent and tribal, which is a protocol developed since one of the core partner institutions."
        ],
        [
            "Right, OK, let me move now to the user cases I said at the beginning that I am going to try to.",
            "We spend most of the time of this talk elaborating on what is what is going to happen in the next few months and how we want to demonstrate show that what we are investigating.",
            "The research that we are doing here is useful.",
            "This is done by what we call the field trials, but in order to have field trials we start with some user scenarios."
        ],
        [
            "Are the reason we start to use scenarios?",
            "If it cause the technology that we are describing or describing or considering here is very broad so we need to narrow the scope and have some sort of a guide towards this a tiles.",
            "We are focusing on tear relationships between people, which are the ones acting up as peers in the net and these user scenarios are going to help us to put or to see Peter Media technology from the user perspective.",
            "Now, how we're going to do that?",
            "This is based on three main goals that we have set to define the user scenarios.",
            "The first one is the annotation goal annotating content.",
            "The second one.",
            "Is accessing content search and retrieval of content and the last one is watching that content actually like the the last one?",
            "Is the reason I put it there right?",
            "OK, so we have three goals, annotation, accessing and watching of content and on the other hand we have also."
        ],
        [
            "We need to think about what kind of data we're going to use to work to develop these trials.",
            "So there are three kinds of data which are sources of interest, and these kinds of data are again coming out of the.",
            "Coming out front from the technology that that we have proposed in the triple scenery, the first one is explicit tagging, which is, as I said before, when we assume a tax or metadata is generated by the user in a either.",
            "A direct way by a manual annotation or by the system and a automatic way.",
            "The second type of data is what we call implicit tagging, which is data that we collect by observing the user, however.",
            "Without letting the user know that they're annotated, the user may be aware that we are gathering information about his or her behavior for annotation aims, but we are not asking explicitly the user to do something towards annotation, and the last one is is of course the.",
            "Social one social tagging in which.",
            "We again mine the network.",
            "Mind they are.",
            "Users connected over the social network and try to either improve the existing metadata or to infer additional metadata.",
            "These are the three sources of data, so we have now.",
            "We have now."
        ],
        [
            "Goals and sources.",
            "The goals are, annotate, access, watch the data sources of data are explicit, implicit, and social, and now by using this by putting this in a sort of two dimensional matrix, we.",
            "Can't pigeonhole the technology that we need for our user cases, so of course the technology elements that we're putting here is not exhaustive.",
            "We know there may be additional points here.",
            "These are just the main ones that we believe are needed to develop what we want to do in the trials.",
            "So starting with content based at generation, this is the conventional.",
            "Content base our annotation information retrieval A again.",
            "In the context of access, an explicit Dan talk based retrieval and browsing very important area of research and in the context of looking at the content, watching the Content Act driven scalability.",
            "Second line, when we do this implicitly while the data is generated implicitly and what kind of technology we're looking at here, Tak generation by observing users user reactions.",
            "Basically we have cameras there.",
            "We use computer vision technology to try to infer what is going on and then use that information to generate a tax in the context of access to improve to use affect emotions.",
            "To improve access and retrieval are very important and very difficult.",
            "Area of research, and in the context of watching using or doing research on perceptual content quality on the social lines.",
            "Well refinement enhancement attacks using social information for the annotation case for the access case, improving search and retrieval again using social information and watching content delivery over peer to peer.",
            "So this is what we call the technology matrix, and these blocks here are the ones that are telling us what is what we need to develop the system.",
            "Are in a quotation marks the system that we are going to use for the field trials, and I saying quotation mark because it's not a integrated system in the sense of other projects like straps or IPS is a sort of distributed system that will use technology coming from the different partners in the network too.",
            "A conduct the user trials.",
            "So this word the tech."
        ],
        [
            "She's on the approach towards the user case.",
            "Now let's look at the actual scenarios."
        ],
        [
            "We are going to use to, uh, to drive the the tires, so the first scenario is called.",
            "The first scenario is called the near to me a scenario and here what we have.",
            "In mind is to give user access to social media collections that will bring them closer to remote faraway places.",
            "Basically you have the user account and we enable them to access content that bring them to any place they want to be.",
            "Let"
        ],
        [
            "We tried to elaborate on that how we are going to use this?",
            "This is the use of the use scenario, so I want to add a clip into an online collection and wish it to be automatically and reach for subsequent search and use.",
            "These are the steps of this user case as in any other project when you have user scenario do develop the semantic steps and then you try to map that to the technology that you need to achieve what you have.",
            "In the different semantic cases of the of the of the.",
            "Of the use case."
        ],
        [
            "So what the field trials will do with respect to this near to me use case, so the field trials or what we're going to evaluate in the field trial is how the system support users in place in video clips into a social space which is related to close to related content or close to related people provide representation of the video clip within the social space.",
            "Ante up.",
            "Reflect how well that video clip.",
            "Can be found within the collection via search and browsing.",
            "So the data that we require for this use case is coming from or we intend to have this data from public available sources like Facebook, YouTube and two weeks ago in the last integration meeting of the project Peter Media, we define better the way this data is going to be collected and used for this specific."
        ],
        [
            "Scenario.",
            "So now we have to look at the we got the semantic steps of the user case.",
            "Now we have to look at the technology that is needed for that and this is put here in this slide cluster into two groups.",
            "The first one is technology that you can use for the automated content generation.",
            "Sorry, a content based generation on the second cluster is for semi automatic automatic tag.",
            "Generation an improvement for enhancement.",
            "Being a network of excellence, we assume that most of these technologies available.",
            "So what we are doing here in this project is integrating or using that technology for the objectives of the project.",
            "So this is not a project in which we have a user case and we want to develop a whole system from scratch.",
            "Is a project in which we know the key players in Europe are working together.",
            "They have a long track record of development of related technology and the aim is to take all these, put it together towards the.",
            "A system that we expect is going to be better and it's going to be trialed in the in the trials.",
            "So I."
        ],
        [
            "Elaborating a bit more on the required technology, this is big picture of things that we may use in the context of a low level content based multimedia analysis going from shot detection too.",
            "It.",
            "Audio analysis and.",
            "The two together in a multimodal way too."
        ],
        [
            "High level semantic inference of content in the technology in the technology matrix we see this this use case near to me somewhere.",
            "Cutting across these different types of technology that are.",
            "Shown here with the red.",
            "Sign over there."
        ],
        [
            "We have been looking also at the risk that we have here when we try to put technologies I coming from different partners together towards a common goal and the probably the key risk that we have identified is the.",
            "The content, do we have the content needed for that is large enough?",
            "Do we have ground truth so that we can't?",
            "I assess the output of the field trials in a very objective way and we have meaningful subsets of content in suitable social space.",
            "So this is.",
            "This is at risk because because content is, as you know, is tricky and it's tricky to get an instinct to use.",
            "It's tricky to get permission to use.",
            "It's tricky to get the the players involved helping you with that.",
            "And the second problem is, do we have enough users for the field trials so that the results that we get out are meaningful so?",
            "We are looking at that and we are taking also action on that by at attempting to define our data as explicit as possible and also looking at the users need as explicit explicitly as possible."
        ],
        [
            "So something that we are very aware of, and looking at the second use case is what we call the we TV case.",
            "And here what we want is to have users a assembling content into meaningful stories, narrative stories of a given event.",
            "The example we have here is people capturing content of a given event from different positions, different perspectives and then going home using a.",
            "Automated authoring tool that will help them to produce a better piece of content.",
            "Reflecting that same event in in a better way so you have 3 users ABCD and or or more ABC or more and you want to.",
            "Use that content to produce a better, more appealing piece of content so the motivation is here.",
            "Search chatting events now."
        ],
        [
            "This is a it's A or sharing information about events.",
            "Is now.",
            "There's something that is gaining popularity when you go to a football match Aura event like.",
            "G20 meeting whatever.",
            "These then you have a lot of people in different places capturing information about that, so you may go back home and try to see the same, but you have captured from the perspective of a different user and use that.",
            "Information that is available on the web to produce that different narrative.",
            "So this is the user case.",
            "I want to create a video Journal of an event that I attended an include content.",
            "That was captured by other users, so I want or.",
            "I want to really realize the experience of watching the same event recorded from someones elses perspectives.",
            "For now different point of view.",
            "This is the.",
            "Technology that we figure."
        ],
        [
            "Wow, this needed to realize this.",
            "Scenario this use case."
        ],
        [
            "And this is an example of basically what we want to do.",
            "So you have, let's say, the classic example of a football match, in which you have different people there capturing events or what is going on there.",
            "Then you go home and you assemble the whole from the perspective of somebody else.",
            "Or you just close gaps on your own narrative using content from other people."
        ],
        [
            "Right in the technology matrix, so we are somewhere.",
            "Embracing this different pieces of technology that I have a. Um, intercepted with the red.",
            "Scribble there.",
            "However, this is not.",
            "This is not exhaustive, as I said at the beginning, we may have or we may be using additional pieces."
        ],
        [
            "Of technology now the last use cases.",
            "What we call this new TV case.",
            "Which is are the one that will allow the user to throw away the remote control the user is tired.",
            "Getting home after a long day of work and once just once just the system to bring to him what he wants to see.",
            "However, without any interaction with the system.",
            "So you want to sit over there.",
            "Want a?",
            "Get entertain by the system without any interaction.",
            "So this is a very interesting appealing from the point of view of research scenario.",
            "Appealing."
        ],
        [
            "It causes a lot of the technology that we want to use for this specific use case is very difficult.",
            "It's very tricky, is based on two measuring.",
            "Analyzing what are the user reactions towards something trying to infer emotional state of the user by using computer computer vision technology by using things like gays, tracking and so on.",
            "And again, we're going to have a demonstration of the gaze tracker and the.",
            "Information that we can gain out of that.",
            "A."
        ],
        [
            "Today, so you are welcome to come along and have a look at these demos, so this is a required technology for this particular use case.",
            "Now I am aware that we got only two."
        ],
        [
            "Minutes time, so I'm trying to speed up this is.",
            "Examples of the technology that we are going to use inch Peter Media for this for the user trials.",
            "If we do them of this use case and I say if we do them becausw in the last meeting we also decide to be more focused.",
            "We started with three use cases.",
            "Then we merge two of them the near to me and then we we TV and we are sort of thinking discussing if we take this as a research use case rather than.",
            "Going really into user tiles and focus on a single one or doing both so this is 1.",
            "One example in which implicit gaze analysis is used for tagging work that we're doing at Queen Mary, University of London.",
            "And again there is a demo today on this."
        ],
        [
            "Research questions.",
            "There are a couple of them.",
            "And as I say before is a very important from the point of view of research."
        ],
        [
            "Cause.",
            "A lot of the technology that we want to use here is still open, so it's not a state of the art is not something that is already available now coming back, coming, coming to the field trials."
        ],
        [
            "If from the point of view of our objectives and planning so this will provide Peter Media with the opportunity to match the scientific progress that we are achieving against the original project vision.",
            "So this is, uh, is going to happen via what we call while the user scenarios I already explained on our piece which are integrated research projects.",
            "So in Peter Media we have teams of people working in specific.",
            "Audience of work and these are called IPS, so they use.",
            "Scenarios were instrumental so far to build consensus consensus among the partners on the.",
            "A content and scope of the field trials and to set the road map towards."
        ],
        [
            "Field trials, so the objectives of the field trials are here is to evaluate the contributions made by the research we're doing with Peter Medium.",
            "Up until the.",
            "Underlying triple synergy.",
            "So there are two sorts of trials that we are planning in Peter Media.",
            "The first one is to evaluate the performance of the technology that we are trying to integrate.",
            "Here is integrated distributed technology.",
            "As I said before, we are not thinking here about a common integrated system.",
            "We want to evaluate, evaluate this system in real world settings where.",
            "We confront challenges of scale, bandwidth.",
            "Complex complexity are specifically in the context of social networks, and we want to perform trials to measure the success of the technology in terms of usability.",
            "How welcome is this technology by the users and effectiveness in terms of well, how quick, how fast, how it scales and many other directions.",
            "So this."
        ],
        [
            "The road map towards the trials, and again one of the aims of this initial workshop today is to try to get feedback from you, so we will be very happy to learn from you.",
            "What do you think about the plan?",
            "What do you think about the technology?",
            "And if you think?",
            "We are doing the right.",
            "Think or not, are we going in the right direction or not?",
            "So we started this project sixteen 1718 months ago.",
            "Well, it was a March last year in Monsey Rd.",
            "That was the.",
            "They kick off.",
            "Or the project?",
            "We spent some eight months assessing the technology available within the institutions.",
            "Um, in the four countries.",
            "The four networks then.",
            "We set also what we call special interest groups, some of them looking at implicit tagging, others looking at explicit tagging, or they're looking at visualization, and so on.",
            "Um?",
            "By Month 6 seven, we launched the 1st Wave Higher piece.",
            "Remember this other piece are integrated research projects.",
            "This was this small clusters of people and institutions looking at very specific research projects.",
            "I lost a week or two weeks ago.",
            "We launch the 2nd wave of IRP's.",
            "The 1st Wave was finished by.",
            "Well is being finished by now.",
            "Some of these other pieces were finished on some weeks ago.",
            "Orders are just finishing and we launched the 2nd wave of herpes.",
            "Very focused Tyler to the towards the use cases on the field trials.",
            "And what we did also two weeks ago.",
            "More sort of concrete plan for field trials after knowing what was there and what is going to be developed in the next year.",
            "So from now on, till roughly 1:30, we're going to consolidate the technology towards these field trials and.",
            "During the last year, we're going to execute the field trials, so this is what we expect.",
            "To be happening from now till the end of the project, which is in Mount 42 is a 42 month long project.",
            "And one of the aims of this again, this industrial workshop is to try to know from outsiders what do you think about what we are doing and use this information to reshape.",
            "We are still in time of reshaping the plan."
        ],
        [
            "That we have here, right, right?",
            "So you are welcome to to come today to the demos.",
            "We have a couple of demos, I don't know where they are.",
            "I guess they're going to be happening in the stand or here.",
            "Here so I well I thought it's a better idea to have that understand.",
            "Anyway, you are welcome to give us feedback we have here.",
            "Three of the core.",
            "The members are well for all the core members of the of the project are here.",
            "In our front is the coordinator actually of the whole enterprise thrashes from the main partner from Switzerland and Chi representing Germany and myself."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, thank you email.",
                    "label": 0
                },
                {
                    "sent": "Good morning everybody.",
                    "label": 0
                },
                {
                    "sent": "Also from my side I am I. I would like to start by saying that I am pretty glad to be here today for two main reasons.",
                    "label": 0
                },
                {
                    "sent": "The first one is be cause score member of the Peter Media Consortium and we're only four core members.",
                    "label": 0
                },
                {
                    "sent": "We are obliged to disseminate the outcomes of the project and this is what we intend to do here today.",
                    "label": 0
                },
                {
                    "sent": "More than that we want also to get your feedback and learn from UC what.",
                    "label": 0
                },
                {
                    "sent": "Do you think about what we're doing and perhaps try to also Tyler our research directions accordingly, and the second reason is 'cause it is pretty appealing to meet so many friends and colleagues we have been working with over the years in two different European projects.",
                    "label": 0
                },
                {
                    "sent": "This is one of the, again, one of the appeals of this kind of meetings where you?",
                    "label": 0
                },
                {
                    "sent": "Basically our bump into people that say you have been meeting for many years.",
                    "label": 0
                },
                {
                    "sent": "This is the well, my name is Everly scared?",
                    "label": 0
                },
                {
                    "sent": "Or in already already said that I am with Queen Mary, University of London.",
                    "label": 1
                },
                {
                    "sent": "And what I'm going to do today is to give a sort of overview of the Peter Media activities.",
                    "label": 0
                },
                {
                    "sent": "But focusing on the future.",
                    "label": 0
                },
                {
                    "sent": "So this is the outline of the presentation.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Going to spend a couple of minutes on couple of slides.",
                    "label": 0
                },
                {
                    "sent": "Repeating or reminding you.",
                    "label": 0
                },
                {
                    "sent": "What is Peter Media about and also what is the PETA Media Research paradigm and the majority of the time of this talk is going to be dedicated to the last three points approach towards the user cases, user scenarios on field trials.",
                    "label": 1
                },
                {
                    "sent": "The reason is because these goes into what we want to do next and these are the points where we want to get feedback from you.",
                    "label": 0
                },
                {
                    "sent": "So what the speed?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, so to answer this question quickly, I would like to start by explaining the origin of Peter Media, how this started.",
                    "label": 0
                },
                {
                    "sent": "The idea of the media was to get a number of national networks together working together so we realize sometime ago that there were four national networks in four different countries, the Netherlands, the UK, Switzerland and Germany.",
                    "label": 0
                },
                {
                    "sent": "Doing work related to Peter Media and we knew that the Commission provide funding to integrate research institutions across Europe.",
                    "label": 0
                },
                {
                    "sent": "So the probably unique idea of this project here was to tap into these existing networks and get them together to do what well, first of all, to try to.",
                    "label": 0
                },
                {
                    "sent": "Foster the relationships among the partners in the national networks and more than that, getting them together to work as a single network of networks.",
                    "label": 0
                },
                {
                    "sent": "More than that, because this is a European project, we wanted also to go beyond this for a countries and embrace other institutions across Europe.",
                    "label": 0
                },
                {
                    "sent": "And this is the reason why the PETA Media partner concept contains 3.",
                    "label": 0
                },
                {
                    "sent": "Types of partners.",
                    "label": 0
                },
                {
                    "sent": "The first one is the core partners, which are the contractual the institutions signing the contract with the Commission.",
                    "label": 0
                },
                {
                    "sent": "Then we have what we call the network or affiliated partners, which are the partners of the original networks and the active partners which are partners.",
                    "label": 0
                },
                {
                    "sent": "Outside of these four counties coming from other European institutions.",
                    "label": 0
                },
                {
                    "sent": "So this is a.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A slide showing the.",
                    "label": 0
                },
                {
                    "sent": "A way we represent that we have the four networks here working together and one of the main aims of the work we're doing is to try to.",
                    "label": 0
                },
                {
                    "sent": "Leave a sort of legacy are in the form of a virtual center of excellence.",
                    "label": 1
                },
                {
                    "sent": "We will be working towards that and is also one of the objectives of the of the network in the context of integrating people now.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Moving on to the actual topic, the work that we are doing.",
                    "label": 0
                },
                {
                    "sent": "Op our technical level.",
                    "label": 0
                },
                {
                    "sent": "What we want to do is based in what we call the triple scenery scenery, Peter Medias and network of excellence is doing what many other annoys are doing.",
                    "label": 0
                },
                {
                    "sent": "Probably one of the main.",
                    "label": 1
                },
                {
                    "sent": "The differentiating points with other annoys is the topic of research we are we're tackling, and this is based on what we call the triple synergy, and I'm going to explain a bit more about that in the next slide.",
                    "label": 1
                },
                {
                    "sent": "This research paradigm is the one that is going to be used for what we call the field trials, and as I said at the beginning more.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So my talk is going to be about the field trials so.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We we we, we, we we are expect to explain as good as possible what is what we intend to do here in the in the field trials OK Fill trials about what.",
                    "label": 0
                },
                {
                    "sent": "The the technical scope is is based on these three different topics of work here.",
                    "label": 0
                },
                {
                    "sent": "Multimedia content analysis for tagging, keeping in mind that multimedia content analysis is everything what we want to do here is any sort of low level processing multimedia processing that goes directed or goes towards annotation of content.",
                    "label": 1
                },
                {
                    "sent": "User contributed tax.",
                    "label": 0
                },
                {
                    "sent": "They are metadata and very important the social.",
                    "label": 0
                },
                {
                    "sent": "A dimension of all this in a peer to peer environment.",
                    "label": 1
                },
                {
                    "sent": "These three fields of work or fields of research are what we call the Triple City synergy of PETA Media.",
                    "label": 0
                },
                {
                    "sent": "And are they?",
                    "label": 0
                },
                {
                    "sent": "Topics that we want to link together to advance to push forward the front different tiers of search and retrieval of multimedia content starting with tagging of data data.",
                    "label": 0
                },
                {
                    "sent": "So the mission in general is to integrate all the resources that we have in all these countries.",
                    "label": 0
                },
                {
                    "sent": "In all these different institutions towards achieving the goals of integrating technology.",
                    "label": 0
                },
                {
                    "sent": "To advance the state of the art in annotation, annotation, tagging, and.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Receival of multimedia content.",
                    "label": 0
                },
                {
                    "sent": "Let me spend probably.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Going to now to spend to use one slide to try to explain or elaborate a bit better on each one of these different.",
                    "label": 0
                },
                {
                    "sent": "8 topics.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of the synergy of Peter Media, starting with a multimedia content analysis, this is a very generic view of what we mean.",
                    "label": 0
                },
                {
                    "sent": "Without this is a low level processing.",
                    "label": 0
                },
                {
                    "sent": "When you have a media database and.",
                    "label": 1
                },
                {
                    "sent": "A researcher or a inducer player you use features, extracted extracted from that content to generate what we call a feature space that is going to be used to do the the analysis.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, you can have also a domain on teologi's at the other side of what we call the semantic gap and then we try to link these two things together to do inference and.",
                    "label": 0
                },
                {
                    "sent": "To extract what is called the metadata that acts that we want to get out of the content.",
                    "label": 0
                },
                {
                    "sent": "All this process is done automatically.",
                    "label": 0
                },
                {
                    "sent": "The aim is again to get tax to get annotations of the content, and at some point we put also the human in the loop there to improve this annotations.",
                    "label": 0
                },
                {
                    "sent": "So this picture basically shows you the overview of what we mean with multimedia content analysis.",
                    "label": 1
                },
                {
                    "sent": "2 walls annotation.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Towards tagging.",
                    "label": 0
                },
                {
                    "sent": "User contributed, contributed tags or metadata.",
                    "label": 0
                },
                {
                    "sent": "What is this?",
                    "label": 0
                },
                {
                    "sent": "Well, this is also a field of work which embraces several different technologies.",
                    "label": 0
                },
                {
                    "sent": "Starting front manual annotation using relevance feedback.",
                    "label": 0
                },
                {
                    "sent": "When you assume that you have an interface, there you have the content and then you have a human trying to annotate generating tax.",
                    "label": 0
                },
                {
                    "sent": "This is the conventional way of doing that.",
                    "label": 0
                },
                {
                    "sent": "Of course a bit enhance by the fact that you can have some algorithms technologies in the background helping.",
                    "label": 0
                },
                {
                    "sent": "The user to do the annotation model annotation.",
                    "label": 0
                },
                {
                    "sent": "What we call relevance feedback.",
                    "label": 0
                },
                {
                    "sent": "Object driven when you try to.",
                    "label": 1
                },
                {
                    "sent": "Back the different pictures, assuming that what you have in these pictures as always or in this video, are single objects, and then you generate tax manually or semiautomatically, or automatically for each one of these objects.",
                    "label": 0
                },
                {
                    "sent": "There are other techniques that we are using also in Peter Media to generate tax exploiting.",
                    "label": 0
                },
                {
                    "sent": "The fact that the users are usually playing using content, for instance while playing a game.",
                    "label": 0
                },
                {
                    "sent": "This is a follows the same right research directions of the ESP game that is using in the Google Image tool for annotation, and I do believe we will have a demonstration on these tools that has been implemented at Queen Mary University of London.",
                    "label": 0
                },
                {
                    "sent": "I think we have a demonstration of that today.",
                    "label": 0
                },
                {
                    "sent": "Other ways of doing this is by measuring using physiological data.",
                    "label": 0
                },
                {
                    "sent": "We have sensors sensing the user and then we try to infer information from that and get also additional tags and.",
                    "label": 0
                },
                {
                    "sent": "Using a gaze analysis, this is also work that we're doing at Queen Mary, in which basically we have some cameras there observing the user looking where the user is, gazing at, and trying to use this information to infer tax.",
                    "label": 0
                },
                {
                    "sent": "Many others are using catch us to do annotation or work that is done at the Technical University of Delft and so on.",
                    "label": 0
                },
                {
                    "sent": "So all this is what we call the user contributed.",
                    "label": 0
                },
                {
                    "sent": "Facts that are coming from from the user, either by a explicitly interacting with the system, doing the annotation, the annotations in in a.",
                    "label": 0
                },
                {
                    "sent": "Direct Direct Way or indirectly by observing the user and trying to infer.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The tax out of that observations, so the third field of the synergy that we are considering here in Peter Media is the social aspect over peer to peer networks.",
                    "label": 1
                },
                {
                    "sent": "This is very important becausw.",
                    "label": 0
                },
                {
                    "sent": "Basically what it does is enable us to mine information that is distributed in the network and to try to use this information to improve to enhance the tasks that we are.",
                    "label": 1
                },
                {
                    "sent": "Using to annotate the content.",
                    "label": 0
                },
                {
                    "sent": "At technical level in Peter Media we are using peer to peer technology based on BitTorrent and tribal, which is a protocol developed since one of the core partner institutions.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right, OK, let me move now to the user cases I said at the beginning that I am going to try to.",
                    "label": 1
                },
                {
                    "sent": "We spend most of the time of this talk elaborating on what is what is going to happen in the next few months and how we want to demonstrate show that what we are investigating.",
                    "label": 0
                },
                {
                    "sent": "The research that we are doing here is useful.",
                    "label": 1
                },
                {
                    "sent": "This is done by what we call the field trials, but in order to have field trials we start with some user scenarios.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Are the reason we start to use scenarios?",
                    "label": 1
                },
                {
                    "sent": "If it cause the technology that we are describing or describing or considering here is very broad so we need to narrow the scope and have some sort of a guide towards this a tiles.",
                    "label": 0
                },
                {
                    "sent": "We are focusing on tear relationships between people, which are the ones acting up as peers in the net and these user scenarios are going to help us to put or to see Peter Media technology from the user perspective.",
                    "label": 1
                },
                {
                    "sent": "Now, how we're going to do that?",
                    "label": 1
                },
                {
                    "sent": "This is based on three main goals that we have set to define the user scenarios.",
                    "label": 0
                },
                {
                    "sent": "The first one is the annotation goal annotating content.",
                    "label": 0
                },
                {
                    "sent": "The second one.",
                    "label": 0
                },
                {
                    "sent": "Is accessing content search and retrieval of content and the last one is watching that content actually like the the last one?",
                    "label": 0
                },
                {
                    "sent": "Is the reason I put it there right?",
                    "label": 0
                },
                {
                    "sent": "OK, so we have three goals, annotation, accessing and watching of content and on the other hand we have also.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We need to think about what kind of data we're going to use to work to develop these trials.",
                    "label": 0
                },
                {
                    "sent": "So there are three kinds of data which are sources of interest, and these kinds of data are again coming out of the.",
                    "label": 1
                },
                {
                    "sent": "Coming out front from the technology that that we have proposed in the triple scenery, the first one is explicit tagging, which is, as I said before, when we assume a tax or metadata is generated by the user in a either.",
                    "label": 1
                },
                {
                    "sent": "A direct way by a manual annotation or by the system and a automatic way.",
                    "label": 1
                },
                {
                    "sent": "The second type of data is what we call implicit tagging, which is data that we collect by observing the user, however.",
                    "label": 0
                },
                {
                    "sent": "Without letting the user know that they're annotated, the user may be aware that we are gathering information about his or her behavior for annotation aims, but we are not asking explicitly the user to do something towards annotation, and the last one is is of course the.",
                    "label": 0
                },
                {
                    "sent": "Social one social tagging in which.",
                    "label": 0
                },
                {
                    "sent": "We again mine the network.",
                    "label": 0
                },
                {
                    "sent": "Mind they are.",
                    "label": 0
                },
                {
                    "sent": "Users connected over the social network and try to either improve the existing metadata or to infer additional metadata.",
                    "label": 0
                },
                {
                    "sent": "These are the three sources of data, so we have now.",
                    "label": 0
                },
                {
                    "sent": "We have now.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Goals and sources.",
                    "label": 0
                },
                {
                    "sent": "The goals are, annotate, access, watch the data sources of data are explicit, implicit, and social, and now by using this by putting this in a sort of two dimensional matrix, we.",
                    "label": 1
                },
                {
                    "sent": "Can't pigeonhole the technology that we need for our user cases, so of course the technology elements that we're putting here is not exhaustive.",
                    "label": 0
                },
                {
                    "sent": "We know there may be additional points here.",
                    "label": 0
                },
                {
                    "sent": "These are just the main ones that we believe are needed to develop what we want to do in the trials.",
                    "label": 0
                },
                {
                    "sent": "So starting with content based at generation, this is the conventional.",
                    "label": 0
                },
                {
                    "sent": "Content base our annotation information retrieval A again.",
                    "label": 0
                },
                {
                    "sent": "In the context of access, an explicit Dan talk based retrieval and browsing very important area of research and in the context of looking at the content, watching the Content Act driven scalability.",
                    "label": 1
                },
                {
                    "sent": "Second line, when we do this implicitly while the data is generated implicitly and what kind of technology we're looking at here, Tak generation by observing users user reactions.",
                    "label": 0
                },
                {
                    "sent": "Basically we have cameras there.",
                    "label": 1
                },
                {
                    "sent": "We use computer vision technology to try to infer what is going on and then use that information to generate a tax in the context of access to improve to use affect emotions.",
                    "label": 1
                },
                {
                    "sent": "To improve access and retrieval are very important and very difficult.",
                    "label": 1
                },
                {
                    "sent": "Area of research, and in the context of watching using or doing research on perceptual content quality on the social lines.",
                    "label": 0
                },
                {
                    "sent": "Well refinement enhancement attacks using social information for the annotation case for the access case, improving search and retrieval again using social information and watching content delivery over peer to peer.",
                    "label": 0
                },
                {
                    "sent": "So this is what we call the technology matrix, and these blocks here are the ones that are telling us what is what we need to develop the system.",
                    "label": 0
                },
                {
                    "sent": "Are in a quotation marks the system that we are going to use for the field trials, and I saying quotation mark because it's not a integrated system in the sense of other projects like straps or IPS is a sort of distributed system that will use technology coming from the different partners in the network too.",
                    "label": 0
                },
                {
                    "sent": "A conduct the user trials.",
                    "label": 0
                },
                {
                    "sent": "So this word the tech.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "She's on the approach towards the user case.",
                    "label": 0
                },
                {
                    "sent": "Now let's look at the actual scenarios.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We are going to use to, uh, to drive the the tires, so the first scenario is called.",
                    "label": 0
                },
                {
                    "sent": "The first scenario is called the near to me a scenario and here what we have.",
                    "label": 0
                },
                {
                    "sent": "In mind is to give user access to social media collections that will bring them closer to remote faraway places.",
                    "label": 1
                },
                {
                    "sent": "Basically you have the user account and we enable them to access content that bring them to any place they want to be.",
                    "label": 0
                },
                {
                    "sent": "Let",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We tried to elaborate on that how we are going to use this?",
                    "label": 0
                },
                {
                    "sent": "This is the use of the use scenario, so I want to add a clip into an online collection and wish it to be automatically and reach for subsequent search and use.",
                    "label": 1
                },
                {
                    "sent": "These are the steps of this user case as in any other project when you have user scenario do develop the semantic steps and then you try to map that to the technology that you need to achieve what you have.",
                    "label": 0
                },
                {
                    "sent": "In the different semantic cases of the of the of the.",
                    "label": 0
                },
                {
                    "sent": "Of the use case.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what the field trials will do with respect to this near to me use case, so the field trials or what we're going to evaluate in the field trial is how the system support users in place in video clips into a social space which is related to close to related content or close to related people provide representation of the video clip within the social space.",
                    "label": 1
                },
                {
                    "sent": "Ante up.",
                    "label": 1
                },
                {
                    "sent": "Reflect how well that video clip.",
                    "label": 1
                },
                {
                    "sent": "Can be found within the collection via search and browsing.",
                    "label": 0
                },
                {
                    "sent": "So the data that we require for this use case is coming from or we intend to have this data from public available sources like Facebook, YouTube and two weeks ago in the last integration meeting of the project Peter Media, we define better the way this data is going to be collected and used for this specific.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Scenario.",
                    "label": 0
                },
                {
                    "sent": "So now we have to look at the we got the semantic steps of the user case.",
                    "label": 0
                },
                {
                    "sent": "Now we have to look at the technology that is needed for that and this is put here in this slide cluster into two groups.",
                    "label": 0
                },
                {
                    "sent": "The first one is technology that you can use for the automated content generation.",
                    "label": 0
                },
                {
                    "sent": "Sorry, a content based generation on the second cluster is for semi automatic automatic tag.",
                    "label": 0
                },
                {
                    "sent": "Generation an improvement for enhancement.",
                    "label": 0
                },
                {
                    "sent": "Being a network of excellence, we assume that most of these technologies available.",
                    "label": 0
                },
                {
                    "sent": "So what we are doing here in this project is integrating or using that technology for the objectives of the project.",
                    "label": 0
                },
                {
                    "sent": "So this is not a project in which we have a user case and we want to develop a whole system from scratch.",
                    "label": 0
                },
                {
                    "sent": "Is a project in which we know the key players in Europe are working together.",
                    "label": 0
                },
                {
                    "sent": "They have a long track record of development of related technology and the aim is to take all these, put it together towards the.",
                    "label": 0
                },
                {
                    "sent": "A system that we expect is going to be better and it's going to be trialed in the in the trials.",
                    "label": 0
                },
                {
                    "sent": "So I.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Elaborating a bit more on the required technology, this is big picture of things that we may use in the context of a low level content based multimedia analysis going from shot detection too.",
                    "label": 0
                },
                {
                    "sent": "It.",
                    "label": 0
                },
                {
                    "sent": "Audio analysis and.",
                    "label": 0
                },
                {
                    "sent": "The two together in a multimodal way too.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "High level semantic inference of content in the technology in the technology matrix we see this this use case near to me somewhere.",
                    "label": 1
                },
                {
                    "sent": "Cutting across these different types of technology that are.",
                    "label": 0
                },
                {
                    "sent": "Shown here with the red.",
                    "label": 0
                },
                {
                    "sent": "Sign over there.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have been looking also at the risk that we have here when we try to put technologies I coming from different partners together towards a common goal and the probably the key risk that we have identified is the.",
                    "label": 0
                },
                {
                    "sent": "The content, do we have the content needed for that is large enough?",
                    "label": 0
                },
                {
                    "sent": "Do we have ground truth so that we can't?",
                    "label": 0
                },
                {
                    "sent": "I assess the output of the field trials in a very objective way and we have meaningful subsets of content in suitable social space.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                },
                {
                    "sent": "This is at risk because because content is, as you know, is tricky and it's tricky to get an instinct to use.",
                    "label": 0
                },
                {
                    "sent": "It's tricky to get permission to use.",
                    "label": 0
                },
                {
                    "sent": "It's tricky to get the the players involved helping you with that.",
                    "label": 0
                },
                {
                    "sent": "And the second problem is, do we have enough users for the field trials so that the results that we get out are meaningful so?",
                    "label": 1
                },
                {
                    "sent": "We are looking at that and we are taking also action on that by at attempting to define our data as explicit as possible and also looking at the users need as explicit explicitly as possible.",
                    "label": 1
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So something that we are very aware of, and looking at the second use case is what we call the we TV case.",
                    "label": 0
                },
                {
                    "sent": "And here what we want is to have users a assembling content into meaningful stories, narrative stories of a given event.",
                    "label": 0
                },
                {
                    "sent": "The example we have here is people capturing content of a given event from different positions, different perspectives and then going home using a.",
                    "label": 1
                },
                {
                    "sent": "Automated authoring tool that will help them to produce a better piece of content.",
                    "label": 0
                },
                {
                    "sent": "Reflecting that same event in in a better way so you have 3 users ABCD and or or more ABC or more and you want to.",
                    "label": 0
                },
                {
                    "sent": "Use that content to produce a better, more appealing piece of content so the motivation is here.",
                    "label": 0
                },
                {
                    "sent": "Search chatting events now.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is a it's A or sharing information about events.",
                    "label": 0
                },
                {
                    "sent": "Is now.",
                    "label": 0
                },
                {
                    "sent": "There's something that is gaining popularity when you go to a football match Aura event like.",
                    "label": 0
                },
                {
                    "sent": "G20 meeting whatever.",
                    "label": 0
                },
                {
                    "sent": "These then you have a lot of people in different places capturing information about that, so you may go back home and try to see the same, but you have captured from the perspective of a different user and use that.",
                    "label": 0
                },
                {
                    "sent": "Information that is available on the web to produce that different narrative.",
                    "label": 0
                },
                {
                    "sent": "So this is the user case.",
                    "label": 0
                },
                {
                    "sent": "I want to create a video Journal of an event that I attended an include content.",
                    "label": 1
                },
                {
                    "sent": "That was captured by other users, so I want or.",
                    "label": 1
                },
                {
                    "sent": "I want to really realize the experience of watching the same event recorded from someones elses perspectives.",
                    "label": 0
                },
                {
                    "sent": "For now different point of view.",
                    "label": 0
                },
                {
                    "sent": "This is the.",
                    "label": 0
                },
                {
                    "sent": "Technology that we figure.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Wow, this needed to realize this.",
                    "label": 0
                },
                {
                    "sent": "Scenario this use case.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is an example of basically what we want to do.",
                    "label": 0
                },
                {
                    "sent": "So you have, let's say, the classic example of a football match, in which you have different people there capturing events or what is going on there.",
                    "label": 0
                },
                {
                    "sent": "Then you go home and you assemble the whole from the perspective of somebody else.",
                    "label": 0
                },
                {
                    "sent": "Or you just close gaps on your own narrative using content from other people.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right in the technology matrix, so we are somewhere.",
                    "label": 1
                },
                {
                    "sent": "Embracing this different pieces of technology that I have a. Um, intercepted with the red.",
                    "label": 0
                },
                {
                    "sent": "Scribble there.",
                    "label": 0
                },
                {
                    "sent": "However, this is not.",
                    "label": 0
                },
                {
                    "sent": "This is not exhaustive, as I said at the beginning, we may have or we may be using additional pieces.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of technology now the last use cases.",
                    "label": 0
                },
                {
                    "sent": "What we call this new TV case.",
                    "label": 0
                },
                {
                    "sent": "Which is are the one that will allow the user to throw away the remote control the user is tired.",
                    "label": 1
                },
                {
                    "sent": "Getting home after a long day of work and once just once just the system to bring to him what he wants to see.",
                    "label": 0
                },
                {
                    "sent": "However, without any interaction with the system.",
                    "label": 0
                },
                {
                    "sent": "So you want to sit over there.",
                    "label": 0
                },
                {
                    "sent": "Want a?",
                    "label": 0
                },
                {
                    "sent": "Get entertain by the system without any interaction.",
                    "label": 0
                },
                {
                    "sent": "So this is a very interesting appealing from the point of view of research scenario.",
                    "label": 0
                },
                {
                    "sent": "Appealing.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It causes a lot of the technology that we want to use for this specific use case is very difficult.",
                    "label": 0
                },
                {
                    "sent": "It's very tricky, is based on two measuring.",
                    "label": 0
                },
                {
                    "sent": "Analyzing what are the user reactions towards something trying to infer emotional state of the user by using computer computer vision technology by using things like gays, tracking and so on.",
                    "label": 0
                },
                {
                    "sent": "And again, we're going to have a demonstration of the gaze tracker and the.",
                    "label": 0
                },
                {
                    "sent": "Information that we can gain out of that.",
                    "label": 0
                },
                {
                    "sent": "A.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Today, so you are welcome to come along and have a look at these demos, so this is a required technology for this particular use case.",
                    "label": 0
                },
                {
                    "sent": "Now I am aware that we got only two.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Minutes time, so I'm trying to speed up this is.",
                    "label": 0
                },
                {
                    "sent": "Examples of the technology that we are going to use inch Peter Media for this for the user trials.",
                    "label": 0
                },
                {
                    "sent": "If we do them of this use case and I say if we do them becausw in the last meeting we also decide to be more focused.",
                    "label": 0
                },
                {
                    "sent": "We started with three use cases.",
                    "label": 0
                },
                {
                    "sent": "Then we merge two of them the near to me and then we we TV and we are sort of thinking discussing if we take this as a research use case rather than.",
                    "label": 0
                },
                {
                    "sent": "Going really into user tiles and focus on a single one or doing both so this is 1.",
                    "label": 0
                },
                {
                    "sent": "One example in which implicit gaze analysis is used for tagging work that we're doing at Queen Mary, University of London.",
                    "label": 1
                },
                {
                    "sent": "And again there is a demo today on this.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Research questions.",
                    "label": 0
                },
                {
                    "sent": "There are a couple of them.",
                    "label": 0
                },
                {
                    "sent": "And as I say before is a very important from the point of view of research.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cause.",
                    "label": 0
                },
                {
                    "sent": "A lot of the technology that we want to use here is still open, so it's not a state of the art is not something that is already available now coming back, coming, coming to the field trials.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If from the point of view of our objectives and planning so this will provide Peter Media with the opportunity to match the scientific progress that we are achieving against the original project vision.",
                    "label": 1
                },
                {
                    "sent": "So this is, uh, is going to happen via what we call while the user scenarios I already explained on our piece which are integrated research projects.",
                    "label": 0
                },
                {
                    "sent": "So in Peter Media we have teams of people working in specific.",
                    "label": 0
                },
                {
                    "sent": "Audience of work and these are called IPS, so they use.",
                    "label": 1
                },
                {
                    "sent": "Scenarios were instrumental so far to build consensus consensus among the partners on the.",
                    "label": 1
                },
                {
                    "sent": "A content and scope of the field trials and to set the road map towards.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Field trials, so the objectives of the field trials are here is to evaluate the contributions made by the research we're doing with Peter Medium.",
                    "label": 1
                },
                {
                    "sent": "Up until the.",
                    "label": 0
                },
                {
                    "sent": "Underlying triple synergy.",
                    "label": 1
                },
                {
                    "sent": "So there are two sorts of trials that we are planning in Peter Media.",
                    "label": 0
                },
                {
                    "sent": "The first one is to evaluate the performance of the technology that we are trying to integrate.",
                    "label": 0
                },
                {
                    "sent": "Here is integrated distributed technology.",
                    "label": 0
                },
                {
                    "sent": "As I said before, we are not thinking here about a common integrated system.",
                    "label": 0
                },
                {
                    "sent": "We want to evaluate, evaluate this system in real world settings where.",
                    "label": 1
                },
                {
                    "sent": "We confront challenges of scale, bandwidth.",
                    "label": 0
                },
                {
                    "sent": "Complex complexity are specifically in the context of social networks, and we want to perform trials to measure the success of the technology in terms of usability.",
                    "label": 1
                },
                {
                    "sent": "How welcome is this technology by the users and effectiveness in terms of well, how quick, how fast, how it scales and many other directions.",
                    "label": 0
                },
                {
                    "sent": "So this.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The road map towards the trials, and again one of the aims of this initial workshop today is to try to get feedback from you, so we will be very happy to learn from you.",
                    "label": 0
                },
                {
                    "sent": "What do you think about the plan?",
                    "label": 0
                },
                {
                    "sent": "What do you think about the technology?",
                    "label": 0
                },
                {
                    "sent": "And if you think?",
                    "label": 0
                },
                {
                    "sent": "We are doing the right.",
                    "label": 0
                },
                {
                    "sent": "Think or not, are we going in the right direction or not?",
                    "label": 0
                },
                {
                    "sent": "So we started this project sixteen 1718 months ago.",
                    "label": 0
                },
                {
                    "sent": "Well, it was a March last year in Monsey Rd.",
                    "label": 0
                },
                {
                    "sent": "That was the.",
                    "label": 0
                },
                {
                    "sent": "They kick off.",
                    "label": 0
                },
                {
                    "sent": "Or the project?",
                    "label": 0
                },
                {
                    "sent": "We spent some eight months assessing the technology available within the institutions.",
                    "label": 0
                },
                {
                    "sent": "Um, in the four countries.",
                    "label": 0
                },
                {
                    "sent": "The four networks then.",
                    "label": 0
                },
                {
                    "sent": "We set also what we call special interest groups, some of them looking at implicit tagging, others looking at explicit tagging, or they're looking at visualization, and so on.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "By Month 6 seven, we launched the 1st Wave Higher piece.",
                    "label": 0
                },
                {
                    "sent": "Remember this other piece are integrated research projects.",
                    "label": 0
                },
                {
                    "sent": "This was this small clusters of people and institutions looking at very specific research projects.",
                    "label": 0
                },
                {
                    "sent": "I lost a week or two weeks ago.",
                    "label": 0
                },
                {
                    "sent": "We launch the 2nd wave of IRP's.",
                    "label": 1
                },
                {
                    "sent": "The 1st Wave was finished by.",
                    "label": 0
                },
                {
                    "sent": "Well is being finished by now.",
                    "label": 0
                },
                {
                    "sent": "Some of these other pieces were finished on some weeks ago.",
                    "label": 1
                },
                {
                    "sent": "Orders are just finishing and we launched the 2nd wave of herpes.",
                    "label": 0
                },
                {
                    "sent": "Very focused Tyler to the towards the use cases on the field trials.",
                    "label": 0
                },
                {
                    "sent": "And what we did also two weeks ago.",
                    "label": 0
                },
                {
                    "sent": "More sort of concrete plan for field trials after knowing what was there and what is going to be developed in the next year.",
                    "label": 1
                },
                {
                    "sent": "So from now on, till roughly 1:30, we're going to consolidate the technology towards these field trials and.",
                    "label": 0
                },
                {
                    "sent": "During the last year, we're going to execute the field trials, so this is what we expect.",
                    "label": 0
                },
                {
                    "sent": "To be happening from now till the end of the project, which is in Mount 42 is a 42 month long project.",
                    "label": 0
                },
                {
                    "sent": "And one of the aims of this again, this industrial workshop is to try to know from outsiders what do you think about what we are doing and use this information to reshape.",
                    "label": 0
                },
                {
                    "sent": "We are still in time of reshaping the plan.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That we have here, right, right?",
                    "label": 0
                },
                {
                    "sent": "So you are welcome to to come today to the demos.",
                    "label": 0
                },
                {
                    "sent": "We have a couple of demos, I don't know where they are.",
                    "label": 0
                },
                {
                    "sent": "I guess they're going to be happening in the stand or here.",
                    "label": 0
                },
                {
                    "sent": "Here so I well I thought it's a better idea to have that understand.",
                    "label": 0
                },
                {
                    "sent": "Anyway, you are welcome to give us feedback we have here.",
                    "label": 0
                },
                {
                    "sent": "Three of the core.",
                    "label": 0
                },
                {
                    "sent": "The members are well for all the core members of the of the project are here.",
                    "label": 0
                },
                {
                    "sent": "In our front is the coordinator actually of the whole enterprise thrashes from the main partner from Switzerland and Chi representing Germany and myself.",
                    "label": 0
                }
            ]
        }
    }
}