{
    "id": "jnau4mbbntypvpknjpkqscik4r2nytlp",
    "title": "What is cognitive science?",
    "info": {
        "author": [
            "Joshua B. Tenenbaum, Department of Brain and Cognitive Sciences, Massachusetts Institute of Technology, MIT"
        ],
        "published": "Aug. 13, 2010",
        "recorded": "May 2010",
        "category": [
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/mlss2010_tenenbaum_csfml/",
    "segmentation": [
        [
            "So I'm going to start and I'm going to be giving the second half of the introduction to cognitive science.",
            "This is a particularly fun spot.",
            "I feel like I have maybe the most fun spot on the whole program because it's at the end of the first day.",
            "I get to talk about big picture, general introductory issues, but also playing off the themes.",
            "Very interesting ideas and questions for debate that have been raised in all the earlier talks for today, so I hope this will give you further background in what we're interested in cognitive science.",
            "What these two fields of cognitive science machine learning have to say to each other, and also laid the groundwork for, say, some of the debates were going."
        ],
        [
            "Having today and for the rest of the summer school.",
            "Now, as many of the speakers have emphasized, there's there's a long history of interplay between these fields of psychology and cognitive science.",
            "On the one hand, and machine learning here, I just put up a list of not not complete, but representative list of various approaches to machine learning.",
            "But in some sense have their origins in psychology or cognitive science.",
            "They were either invented by psychologists or first published in psychology journals, and that includes ones that have been mentioned already in that context, like the perceptron.",
            "It was published in the Journal Psychological Review, which is the main leading Journal for theoretical psychology.",
            "Other things which have been mentioned here like factor analysis and multidimensional scaling, right?",
            "Which are somewhat old techniques.",
            "And now we call those unsupervised learning techniques, but also things which you might not at all think of as psychological, either psychologically inspired or psychologically motivated learning algorithms.",
            "Things like spectral clustering, collaborative filtering with low rank factorization.",
            "Kernel based classification.",
            "Bayesian concept learning these ideas.",
            "Although I don't want.",
            "I'm not trying to claim that psychologist did everything in machine learning is just picking up the pieces, but you can find either the actual idea or key intuition.",
            "Zanki math.",
            "It's not the case that psychology is just about cool phenomena and need experiments, or even it's not just that the rigor of psychology is contained to the rigor of experimental design and data analysis, but that field, just like machine learning, has a long theoretical tradition.",
            "And what's exciting here is that we need to bring these two theoretical traditions into can't."
        ],
        [
            "Act and learn from each other.",
            "Now as again the earlier speakers have emphasized this history of interaction between these fields.",
            "It's long, but it kind of goes in waves and they come together and move apart and so on.",
            "And what, partly, what motivates this summer school is the sense that these two fields are coming back together again after a somewhat long history of having been apart and looking back with for inspiration and lessons learned for the last moment in history.",
            "When these two fields were really very tightly interacting.",
            "This was the connectionist neural network boom that the time went.",
            "Actually I think all the all the speakers today, maybe all the faculty here were bout the right generation.",
            "We all kind of got into the field around this time and this was probably a lot of what excited us is.",
            "That is that a fair statement.",
            "Certainly Neil said that I think would say that I would say that.",
            "So what was this paradigm about what was incomplete and what lessons can we learn?",
            "Take forward just to recap my own version of the same kind of history.",
            "What was exciting about this view was, but it did give in the sense that Nick was talking about at the very end this multi level of analysis perspective on how the mind in the brain work, formulating problems of cognition and really with a focus on learning at what mark called the computational theory level.",
            "The abstract logic of the computation, the algorithmic level that made contact with traditional ideas from psychology.",
            "What were the steps of mental processing an even down to the neural implementation level and all these things seem to fit together in a very neat way.",
            "So learning is some kind of statistics with the general motivation that what our brains do is they find structure in the world.",
            "This could be unsupervised, it could be task oriented, it could be driven by rewards spread out overtime.",
            "Those are the paradigms of supervised unsupervised reinforcement learning.",
            "But it's basically some kind of statistical inference.",
            "Finding patterns in masses of high dimensional data, finding clusters, low dimensional manifolds, and so on.",
            "So that's the abstract math problem.",
            "We then knew how to formulate this statistical inference problem as some kind of an optimization.",
            "Or if you like some kind of maximum likelihood as Neil said, those are kind of two different takes on the same problem, but there's basically some kind of function, some cost function to be minimized.",
            "We knew how to write learning rules or sort of algorithms for effectively doing that.",
            "These gradient descent chain rule backpropagation sorts of things.",
            "We also this is where the connection to neuroscience comes in.",
            "Of course.",
            "Knew how to make a link to these neural networks.",
            "These networks of neuron, like processing units, where the idea is that this high dimensional data analysis problem that comes down to learning lots and lots of numerical parameters, say the lutely.",
            "This picture here, which is dimensionality reduction from 2 dimensions down to one.",
            "Obviously that's a cartoon sketch of a much higher dimensional problem if we think about the data coming through our senses and there you have parameters specifying, say, the slope and Y intercept or the weights of that linear surface.",
            "In this very high dimensional space, or the parameter specifying, say, means and covariances of clusters, all those numerical parameters would correspond to the weights connecting these units and the learning rules were ways of adjusting the weights in response to.",
            "Data.",
            "And then actually making contact with real Duro science.",
            "These pictures, the reason why we could say these are like the brain is because these circles can be interpreted as neurons.",
            "These lines as synapses or connections where one neuron sends a signal to another neuron and the weights correspond to the strength of the synapses.",
            "How much when an electrical impulse comes in from the presynaptic neuron, how much chemical is dumped into the space between the neurons that's then picked up by the postsynaptic neuron and then determines basically how strongly the postsynaptic neuron responds to the input coming in from the presynaptic neuron.",
            "The more of that neurotransmitter or the more sensitive the postsynaptic cell is to the same amount of neurotransmitter, the stronger the connection.",
            "And there were rules mapped out empirically of how this strength of these synapses in the brain adjusted in response to experience.",
            "These are things like long term potentiation.",
            "That's an empirical phenomenon which was found to follow some of the basic characteristics of, say, heavy and or or Delta rule type learning.",
            "Just basically just some function of pre and post synaptic or input and output activations and then you can find circuits in the brain.",
            "This is a synapse in the hippocampus.",
            "The hippocampus is structuring your brain kind of around there and it's also in other mammals like there approximately there in the mouse brain and a lot of neuropsychology and other kinds of neuroscience showed that basically without this structure working well and without these synapses even doing long term potentiation you can't learn certain basic things.",
            "So that's a very elegant picture.",
            "In understanding the mind in the brain in computational terms, but it's also been useful not just for this kind of reverse engineering enter."
        ],
        [
            "Guys, but for forward engineering so on the technology side these basic learning algorithms.",
            "What we would now call things like principle component analysis or K means clustering or mixture models and so on underlie many of the basic learning technologies that we now take for granted.",
            "So face detection this is a classic example of eigenfaces and more modern ways of detecting faces and images, which I think Neil was referring to.",
            "How does Facebook suggests who your friends should be or how does Amazon recommend newproducts?",
            "Well they do.",
            "They use very essentially very simple.",
            "Statistical pattern finding like this, but just scaled up that's you know that's the Google recipe, right?",
            "Google does this best.",
            "How does Google organize information on the web and return useful search hits for your query?",
            "Well, the first note technical innovation of Google there.",
            "Now of course many.",
            "But the one that got famous for what distinguish it from earlier generations of search, which by conventional standards now or just worthless, like things like AltaVista.",
            "If anybody remembers that, was this idea of page rank where you rank web search hits, not just based on the match of the words on the page to the words in the query.",
            "But to some sense of how important a web pages, how central it is in the great connectivity network of the Web, and Google showed how you could compute a sensible and very efficient notion of authoritativeness or centrality by taking basically the first principle component of the web connectivity matrix.",
            "So PCA and related techniques massively influential.",
            "What's missing well again?",
            "You've seen some of this in all of the talks here, and I want to give you my take.",
            "What the serious study of cognition, learning, and cognition more generally tells us how we need to go beyond this paradigm, but also what kind of insights can we take from this paradigm and what other stuff do we have to add?",
            "We want we don't just want to throw this out.",
            "'cause this has been such a successful paradigm, like in physics or any other successful science.",
            "We want successive paradigms to build on what was valuable and write about.",
            "Old paradigms, so the premise of this summer school, I'd say pretty clearly, is that there is some sense in which cognition is heavily dependent on learning and learning should be described as a kind of statistical inference, but the question is what kind of statistics and how does it interact with the other important pieces of the picture?",
            "In cognition?",
            "The kinds of symbolic representations, for example, that Nick was talking about."
        ],
        [
            "OK, so the outline for for this talk will be 3 parts.",
            "I'll give you my take on the big problem of cognitive science, which Nick is already hinted at.",
            "And of course this is a personal view, but it's one that's widely shared.",
            "Also, it's not the only problem though.",
            "Just to be clear, then talk about how machine learning in its modern form can help address this problem, and then a very brief introduction to cognition viewed through the lens of statistical inference and learning like what's an example of a sort of experiment we might do to just give some insight into how and why we might want to view cognition as a kind of statistical inference."
        ],
        [
            "So here's the big question from my point of view, you could put it like this.",
            "How does the mind get so much from so little all across cognition?",
            "We see the mind taking in data, say through the senses, and making generalizations, abstractions going beyond the data given, building models, doing things that by saying some conventional standard in statistics, maybe by the standards that earlier paradigm shouldn't be possible to get, it is, and we want to understand how that works.",
            "So we."
        ],
        [
            "And illustrate this from starting from visual perception.",
            "That I think it's again widely acknowledged that taking out even learning the study of vision is where we made the most progress in understanding how the brain and the mind work, how cognition spans all these different levels.",
            "This is a slide from David Mars book, so Mars.",
            "Remember it in famous these days for a number of reasons, including this way to think about how a cognitive system works at different levels of analysis.",
            "As Nick talked about, but he was also probably this is his main legacy.",
            "One of the founders of the field of Computational Vision, a field which has also a long history of interaction between the human and engineering side and in his book that based on a research program developed over a brief time, he died tragically early from cancer.",
            "This is research that was mostly done in the 1970s and the book was published around 1980, laid out a view of how the visual system might work.",
            "It was mostly speculation he didn't have time to really work it all out, but there's a lot we can learn by looking at it now.",
            "This is this figure.",
            "Here is just meant to illustrate what makes the problem of vision hard.",
            "How in this context vision is the mind going beyond the data that's given.",
            "So here's an image.",
            "Again, this is, you know, circa 1980.",
            "Digital image, very low, low resolution, low.",
            "Contrast, but we can still see what is right.",
            "So what is this?",
            "Describe it.",
            "Yeah.",
            "It's a plant.",
            "Yeah, I heard somebody else say it's a leaf.",
            "Is it 1 leaf or how many leaves are there?",
            "For what?",
            "What else is there?",
            "There's a stand right there you can.",
            "You can put in a number of words on this, but you can also talk about the geometry, right?",
            "Like use your hands to describe the shape of this plant with these leaves.",
            "Sort of like there's one kind of leaf folding over another one passing behind another one over here, right?",
            "So just from this image, very low quality image as it is.",
            "You can extract semantic context and rich surface percepts.",
            "But what does this look like coming into your eye?",
            "Well, it looks like this.",
            "This is just a zoom in in that box there of the pixel brightness is on a scale of 0 to 255.",
            "Roughly like what might be coming into your retinal ganglion cells, pulling inputs from photoreceptors in your retina and you just see a sea of numbers here, right where there are the surface is, or the Leafs, or the stems, or the plant.",
            "That's the problem and this particular zooming is an interesting one, because this is a region here 1 leaf crosses over the other, and perceptually, we see a boundary between surface is there, but there's no actual edge or or sharp change in the image.",
            "Brightness is here.",
            "It's all these numbers are around.",
            "You know high 160's low 170, so that's that's interpolated based on of course other data that's here but also rich knowledge about how the world, and indeed the process of image formation, likely works."
        ],
        [
            "As as Nick pointed out or showed some great illustrations of the study of visual illusions, places where our mind plays tricks on us.",
            "If you like has long been used by cognitive scientists to understand how the problem works, what makes it hard, and what kinds of assumptions or constraints might enable the solution.",
            "So here's my favorite visual lusion.",
            "It's a close second, perhaps to the brightness allusions that Nick showed.",
            "This one is by Roger Shepherd, who is one of the founders of cognitive Psychology, one of the most important figures in cognitive science.",
            "He was also a very good artist.",
            "Besides being very creative scientists and so he drew a number of allusions.",
            "But this is perhaps his most famous these two tables.",
            "So what's what's the illusion here?",
            "Well, let's ask you to make a judgment similar to the kind of judgment Nick said, which is a judgment just about what you see here on the plane.",
            "So let's take these two lines in particular.",
            "Say this.",
            "The edge of this table, and this edge of that table, and the question is which one is longer?",
            "Just here on the plane, this one, or that one.",
            "The right one.",
            "Anyone want to?",
            "The left one?",
            "Is there another answer?",
            "The same, yes.",
            "So some people have already generalized from the one example that when people show you a visual illusion, the correct answer is always there.",
            "The same.",
            "That's right, they are the same here.",
            "Just to convince you of that, I'll do my version of like what what Nick did, which is show you a PowerPoint build up here.",
            "There's a, you know, an outline I drew.",
            "On that guy.",
            "Oh I haven't done this since I switched to the new version of PowerPoint.",
            "Does anyone know how to rotate?",
            "Oh, that little green thing, OK?",
            "Dad.",
            "There you go, so you can see no tricks here, unless I've actually literally hacked PowerPoint, that it really is the very same shape the whole table top is the same shape in the plane, yet the context of this scene.",
            "Makes makes them look very different as 2 dimensional shapes.",
            "So what's going on here?",
            "Well, you know it's all the stuff that Nick was talking about there.",
            "Let's get rid of this.",
            "The problem.",
            "The problem is ambiguous.",
            "Or the interpretation of the image.",
            "The biggest there are multiple ways the 3D World could be that would give rise to the same 2 dimensional image falling onto your retina onto this plane here.",
            "So that's that's the problem.",
            "That's the sense in which we're trying to solve in inherently ill posed or under constrained problem, right?",
            "I mean, just mathematically the world is 3 dimensional, the retinal images 2 dimensional.",
            "So of course you're losing information, and in principle there's an infinite number of three dimensional geometry that could be compatible with any one 2 dimensional projection.",
            "Not to mention all the other complexities that come from occlusion.",
            "The way light interacts with surface properties and so on.",
            "So how do you solve that impossible problem?",
            "How do you work backwards from the 2D image to the 3D structure out there?",
            "Well, our best guess is that the brain makes a good guess.",
            "It solves a kind of statistical inference problem from a Bayesian point of view.",
            "There's some hypothesis space of world structures in some prior.",
            "And by putting probabilities in the right way that correspond to at least sufficiently not in full detail, but correspond just enough to the way the world is yet while still allowing tractable inference, then that's.",
            "Going to be the form of the solution and by studying what the mind does here, right?",
            "It's not really getting it wrong.",
            "It's getting it right in the sense of using the kind of logic needed to solve the real world problem that doesn't involve looking at images displayed on flat computer screens, but involves trying to solve this analogous problem of discovering the 3D structure of the world from the image comment coming onto your retina.",
            "Now, what is current computer vision which which does rely very heavily on the kind of learning techniques that have long been developed in statistical machine learning?",
            "Things like for example perceptrons, support vector machines, PCA, dimensionality reduction, various boosting, these kinds of methods which you've probably heard some about, and you'll hear more about in the summer school, can it solve these kinds of scene analysis problems well?"
        ],
        [
            "Here's an example from a great paper by some of my MIT colleagues.",
            "Joy Lim Torralba and will sleep.",
            "I think it was just accepted to CPR 2010 so it's state of the art.",
            "It uses a very number of different learning based approaches.",
            "It learns detectors for many classes of real world objects, like for example people, roads, sofas and not only that.",
            "It also has a notion of context.",
            "In this particular paper is trying to show how you can put together the result of bottom up detectors which are trained using a boosting.",
            "Very simple kind of but very powerful supervised.",
            "Learning method, but also put those together with some kind of top down scene context.",
            "And here the point of this figure of course is you see this sofa in the middle of the road and it's anomalous, and their model is able to say that it's anomalous, still recognize it.",
            "It's a sofa, but but say that's kind of a violation of context.",
            "So here's the input, and here's the output with this very nice method, well.",
            "What their method does is it draws a few boxes around some regions in the image and puts words on them.",
            "Rd, sofa, person, person, person with confidence.",
            "Now that to some extent approximates what you see when you actually look at this input.",
            "But how closely does it approximate how close to the richness of what you see here?",
            "Does this come well on a scale from sort of here to here, I would say it's about here, right?",
            "It's definitely a step in the right direction, but just think about all the things you could say here.",
            "All the things you could describe all the questions you could answer all the richness of surface is.",
            "And and different layers of depth that you see.",
            "You see these windows here.",
            "This is sort of a glass window.",
            "You see a car slightly bent and distorted there.",
            "You don't think there's a weird bent car inside that building, but rather it's reflecting something across the street.",
            "All these inferences go on unconsciously.",
            "You're just as Nick was saying, when you consciously introspect what you get is the output of the computation.",
            "But the richness of that output should tell us a lot about what might and maybe even what has to go on along the way.",
            "From here to there.",
            "Now let's turn to."
        ],
        [
            "Example, which is closer to some of the work I do this is, this is from an experiment in our lab where we were inspired by another kind of problem of inference and generalization.",
            "Children learning concepts or learning the meanings of words.",
            "Anybody who's been a child or had a child, it's easier to see this if you are looking at somebody else doing this rather than being in the moment yourself.",
            "Should be familiar with the experience of word learning and the remarkable thing there is, how few examples it takes to learn the meaning of a word.",
            "So a child might learn what a chair is, or what a horses from just seeing one or a couple of examples labeled in the right context.",
            "And then they can pretty much pick out all the other horses.",
            "They might make an occasional confusion.",
            "Seeing a cow that you know down the field in the same farm and calling that a horse and their parent has to say no.",
            "No, that's a cow, right?",
            "But they're not going to be calling the fence post a horse or mom or dad horse, hopefully.",
            "Unless they're making a joke, right?",
            "So how does that work?",
            "I mean, if you think of it as a as a math problem, there's some infinite set of objects.",
            "There's an infinite subset of those that are the set of horses, and the child is able to mostly grass the boundaries of that subset from just a few points randomly sampled within it.",
            "If you want to a sense of what this is like.",
            "As an adult you see we show you these objects here and then we give you a couple of examples say of a tufa.",
            "These are objects from an alien world, and that's a word in the alien language.",
            "And now you have a pretty good job.",
            "Or you can do a pretty good job of telling me which other things are too frozen which aren't, so let's try that out.",
            "How about this one?",
            "Yes or no?",
            "This one.",
            "OK. More uncertainty there.",
            "That's why you've got to be Bayesian, OK?",
            "Right, so most people said no on that one, but there was a brief delay and a little bit of hesitation.",
            "Which is one way behaviourally in the lab to diagnose uncertainty, reaction time.",
            "So here you have a demonstration that again from just a few examples and this would work basically the same if I gave you 1 example, you can get it almost perfectly correct with a little bit of uncertainty.",
            "Kind of at the edges of the concept.",
            "How does that work well?"
        ],
        [
            "To to go back to a theme that Neil raised.",
            "You know this slogan, according to their dynamics, a bumblebee can't fly.",
            "Well, you might say according to conventional statistical learning theory.",
            "Like you know that Nick's theories of generalization or or.",
            "Valiants PAC learning theory this shouldn't be possible.",
            "You shouldn't be able to learn a concept from just a few examples, let alone just one positive example.",
            "Where is all the negative examples?",
            "Where is the masses of data that you know the positives and negatives that something like a perceptron needs to find the right maximum margin discriminator to take another example where I think we need to raise some questions about our conventional theories of learning, think about the oldest problem in statistics learning about the causal structure of the world from evidence.",
            "So we learn in a basic statistics class.",
            "Correlation doesn't imply causation.",
            "It's a cute causation and within in some cases saying the right randomized controlled experiment.",
            "It can identify causation.",
            "But what do people do?",
            "Do we go out and conduct randomized clinical trials with extensive datasets?",
            "Well, think about into it."
        ],
        [
            "Really, how you might make a causal inference, that kind of thing.",
            "That's a clinical trial would, do?",
            "We know we're always trying to make inferences like this, like, you know, I get a cold.",
            "Somebody tells you about some new herbal remedy.",
            "Does it actually help me get over the cold more quickly or not?",
            "Well, I might do a little informal experiment.",
            "Or I might not even think about this consciously, but sometimes I remember to take the drug in time.",
            "Other times I don't.",
            "I could keep track of whether I had a short code or a long cold, and I might make a data table like this.",
            "You know, unconsciously, of course, but people are going to be making inferences from there.",
            "Very sparse data.",
            "I mean just a few examples is just a few data points in each cell, which you know if you computed Chi Square, tried to do a conventional statistical measure of Association here isn't going to give you anything particularly meaningful, but what will see Tom Griffith will talk about this?",
            "I believe later on in the in the in the course is that people peoples console inferences from very little data are surprisingly rational and reliable, and it might have something to do with how even a young child is able to learn about the causal structure of the world from not just this little data, but you know.",
            "Think about to take an example from Hume.",
            "How does a child learn when they first touch hot stove not to touch the stove again that was touching the stove that burned them, so do."
        ],
        [
            "Do something like this.",
            "Do they keep track of all the times in which they came up to a stove and they either touched it or didn't touch it and either got burned or didn't get burned?",
            "Know once is enough right?",
            "Or to take another example, there isn't actually a button on this wall, but let's say there was an I went over here and pressed it and just at the moment that I pressed it.",
            "The screen started to go up, So what would we think?",
            "Well, everybody here would think oh I guess this button makes the screen go up probably makes it go down too.",
            "If I press it again or suppose I press this button and the light all the lights in the auditorium go off well then just that one suspicious coincidence combined with all the other stuff you know about how causal causality works and how auditoriums work is enough to say, OK, I think that that button makes the lights go off.",
            "Maybe turn back on again and this ability to infer a new causal relation.",
            "From one example, this one suspicious coincidence.",
            "Is really quite powerful.",
            "I mean almost to the point that it could have a misguided or there's a lot of potential for misuse of this power.",
            "You think about all the calls of relations you could infer from this.",
            "So suppose I went over here and press this button and all of a sudden the two halves the auditorium started to split and the and the chairs on.",
            "This time over here and over there and underneath was revealed a swimming pool.",
            "Has anybody seen it's A wonderful life that Jimmy Jimmy Stewart movie that actually happens there in a high school gym?",
            "That's where I got the idea.",
            "But you know, these crazy Italian architects they could think of anything.",
            "I mean, that's it's possible.",
            "And if that happened, I'd say oh that's the button that makes the auditorium split in half to reveal the hidden swimming pool.",
            "Awesome.",
            "So that's and that's what it's like to be a child is to be in the world of these surprising and wonderful causal connections, and to get them just like that, and then to be able to use them to achieve all sorts of wonderful and sometimes to your parents annoying effects.",
            "Again by classical statistical standards, it shouldn't be possible, yet it is."
        ],
        [
            "Language so Nick mentioned language and next vision.",
            "This is the other great area of progress in cognitive science, not so much endurance science because we don't have good animal models.",
            "So we know almost nothing about how language works in the brain.",
            "But we know a lot about the behavior and working backwards.",
            "Reverse engineering the black box.",
            "We have a lot of ideas, at least an insights into into the representations and computations underlying language.",
            "So classically looking at examples of parsing where you take a stream of words in a sentence and extract some representation of meaning like these hierarchical phrase structures.",
            "Nick showed examples with the sentence.",
            "The girl saw the boy with the telescope.",
            "Here are a few more amusing examples of ambiguity in parsing where the same sequence of words could have say, two or more different meanings that Steve Pinker collected in one of his popular books.",
            "Two cars were reported stolen by The Grove Police yesterday.",
            "So who was doing the stealing or the reporting there?",
            "The judge sentence the killer to die in the electric chair for the second time, no one was injured in the blast, which was attributed to a buildup of gas by 1 town official.",
            "One witness told the commissioners that she'd seen sexual intercourse taking place between two parked cars in front of your house.",
            "So in all cases, there's kind of a humorous reading and the intended reading and what it has to do with how you group these words together into phrases.",
            "How you attach the different arguments of different nouns here to the verbs, who's doing what and who and what is it being done too.",
            "So that's that's the case again, where our minds have to solve this inherently underconstrained problem.",
            "There's more than one solution, consistent or compatible with the data.",
            "Somehow we just have to make a good guess.",
            "And of course you have these cases.",
            "These are like visual illusions where your mind is kind of getting it wrong, but they show you the assumptions in the logic by which the computation normally works and gets it right now.",
            "As Nick mentioned, just like in computer vision where there's the current state of the art, a lot of it is based on representations that are way too simple that don't capture the richness of human perception in natural scenes, but are tractable for learning and that we can get some practical mileage out of them.",
            "Like that work I showed you from MIT well.",
            "Again, on the language side, you've got the same sort of thing.",
            "He the version of that quote that I'd heard was from Fernando Pereira saying every time I fire a linguist, the performance of my system goes up much more negative view, not if you add it well.",
            "I guess they're both pretty negative.",
            "If you add a linguist, performance goes down anyway.",
            "But you know, think about how Google does natural language processing massive data, very simple statistical learning algorithms, just because that's what that's what scalable an they can do some surprising amount from masses of data.",
            "So I just saw some you know, I don't know when they release exactly, but Google released their Google Ngram data set so you can get up to five five word engrams from a massive online data set.",
            "That's the kind of data that Google say uses to do spelling correction."
        ],
        [
            "It is a one place where you can really see both the power and limitations of the simple statistical view of language.",
            "So here is remarkable thing we're all familiar with.",
            "You can type in a sort of garbled junk to Google and it somehow figures out what you're talking about and then returns you useful search hits.",
            "So I typed in this.",
            "We can all read this, right, it says, well, it says that.",
            "How does Google Spelling correction work?",
            "You have no trouble overlooking the spelling errors, and apparently neither does Google.",
            "Does that mean that Google's got the same model that you do or somewhat human like model of language?",
            "Well, it does have a model of language.",
            "It's based on these these N grams and I think it's based on other things like a model of typing errors.",
            "But to see where your model goes beyond Googles, try this case here."
        ],
        [
            "So what does this say?",
            "Yeah, so if you're not a native English speaker, so most native English speakers can like look at this for about half a second and then just pretty much rattle it off if you're not a native English speaker, it probably took you longer now that both of those are showing you something.",
            "But even the non native English speakers among you are much better than Google here.",
            "Why is it?",
            "Why can you figure this out with these massive misspellings and Google camp?",
            "Well, it's because to you.",
            "These words aren't just frequently occurring clusters of letters, they actually have meaning, and they fit together into a sentence which expresses a larger chunk of meaning.",
            "I thought another way to see the role of this higher level structure.",
            "The fact that language encodes thoughts right is to say, take the very same words but just mix them."
        ],
        [
            "So same words, but they're just reordered and, well, we haven't done a rigorous controlled experiment here.",
            "Maybe just trust me, it's a lot harder to read this.",
            "I mean, even though you've already seen this, but you still have to kind of figure out each word piece by piece, because you can't use the larger structures of semantics.",
            "The underlying meaning of the font that this is expressing, as well as the syntax, the rules about how words go together in a linear sequence to produce a complex meaning.",
            "And I think this helps to show you why we need.",
            "If we're going, you know we we want to apply statistical approaches to understanding parsing and language learning, but they need to be sensitive to a lot more than current natural language processing approaches are.",
            "They need to be sensitive to the structure of syntax and they need to be struck sensitive to meaning.",
            "Sure, why not?",
            "Yeah.",
            "Well, sure, that's what Shannon said.",
            "I mean, a lot of what what generated the early controversy about statistics and language with Chomsky was, I take it reading Shannon's first paper, information theory, in which he showed how much you could do really cool stuff you could do with, you know, just engrams 4 grams, right?",
            "I mean everybody.",
            "If you haven't read Shannon's classic paper on information there you go back and read it.",
            "He basically introduced that idea.",
            "Now he didn't have the massive data that Google had, but I think everybody would have agreed.",
            "Yeah, if you had all the data in the world as we now have.",
            "But it could work.",
            "Are you arguing that this fundamental difference between?",
            "Yes, I'm arguing that the basic technology of of information theory and finding clusters that has been with us and underlies a lot of machine learning.",
            "Since Shannon can solve this problem, but that is not enough to solve this problem because it doesn't capture meaning, and it doesn't capture the rules by which meaning is projected into linear sequences of words that would be syntax, semantics and syntax, and it's not to say that statistics and information theory relevant is that we need, as I think Nick was suggesting we need to understand how those ideas.",
            "For learning and inference, operate over the kinds of representations of meaning and syntactic structure that linguists have proposed an.",
            "I think Google would agree.",
            "That's why they're not really trying to solve this problem, and that's why they kind of laugh off startups which claim to threaten them.",
            "Like, for example, Powerset was a hot start up in the Internet world for a little while, saying we're going to use actual syntax from natural language processing, and we're going to be Google at natural language Search and Google just said haha to them right.",
            "And then I think Microsoft bought them for somewhat in that business is a paltry sum of.",
            "100 million or something WHI?",
            "Well because Google said we just don't have the technology yet to solve that problem.",
            "So we're not.",
            "We're not even going to try to do that.",
            "We're going to solve the problems that we know how to do.",
            "The ones that we're good at.",
            "I would say we don't have the.",
            "We don't have the technology to solve it in the way Google wants to solve it, which is you know, very high accuracy, instantaneous across the entire world.",
            "But for me why I'm excited about this coming together?",
            "Again of these fields is that I do think we have at least the kinds of ideas and I want to try to just sketch out those things.",
            "It's just.",
            "It's much.",
            "It's not.",
            "It's not a."
        ],
        [
            "Cool level engineering challenge.",
            "It's more of a basic scientific research and reverse engineering challenge.",
            "There are of course many other inductive problems in language, and a big focus, which I won't say much more about now, but we'll definitely see this later on this acquisition, so there's not just using your knowledge of language to parse a sentence, but learning your knowledge of language.",
            "How do you learn the rules of syntax?",
            "Well, that's another place where there's long, long been study of how the mind goes beyond the data that's given and move here a lot about that."
        ],
        [
            "One last set of examples.",
            "Which I'll start off with thinking from science and then moved to children's cognitive development.",
            "The problem of representing and constructing a theory of the world.",
            "So think about what might be the greatest moments of human learning.",
            "Greatest accomplishments when scientists or whatever you want to call them natural philosophers or just plain old philosophers, have come to fundamentally new and fundamentally more correct insights about how the world works by in some sense looking at data or observations.",
            "So how did Darwin come to his theory of natural selection?",
            "By looking at the finches on Galapagos?",
            "Or how did Newton come to his universal law?",
            "Gravitation by looking at the orbits of the planets and maybe some data about the moon and maybe a few apples.",
            "How did Mendel glimpse the basics of genetics in his experiments with pea pods?",
            "Was it based on finding clusters or correlations in masses of high dimensional data?",
            "It doesn't seem like it right?",
            "It was based on finding some kind of a causal model.",
            "Positing something about the underlying, but unseen causal structure of the world and then see and then comparing different kinds of causal theories and seeing which seems to best explain the data.",
            "Another way to think of it is to pose.",
            "This challenge is to go back to what I think Nick was talking about.",
            "A fundamental challenge for any kind of associational learning Association is learning or statistical learning is.",
            "If you like the discovery of new concepts or new dimensions over which the statistics or the associations have to be computed.",
            "So when we're talking about doing dimensionality reduction or fitting surface to high dimensional data were given, the input to bench and then all we have to do is find the structure, the laws, the constraints in that given space, whereas here.",
            "If you think about these problems, let's say Newton or Mendel, the basic concepts, the basic representational units over which the laws are expressed didn't exist before the theory.",
            "So in Newtons laws here the notion of force and the notion of mass didn't exist.",
            "We could feel weight, but Newton redefined or really introduced the concept of mass in a way that didn't really exist, and Newtonian forces are these funny things which, though I was a physics major in undergrad, I don't think I ever really mastered right?",
            "These forces, which when this thing is sitting here it's exerting a force on the table and the table is exerting a force back on it.",
            "What's that?",
            "Well, that you know that we may not into it that that's the notion that technical notion.",
            "Of course you need for Newtonian mechanics to make sense or take Mendel's genetics, right concepts like gene or allele recessive or dominant.",
            "Those are the concepts in which the laws of genetics are expressed.",
            "The laws which say, well, you inherit two genes or two copies of each gene from one each from your parent and the dominant dominant one will take precedence over the other.",
            "Only if both are recessive do you see the recessive trait express and that sort of thing so.",
            "Those are also, of course, statistical laws, because there are probability distributions.",
            "The basic simple model is you're equally likely to get each each of the two copies from either parent, and by defining these simple statistical laws over these UN invisible and just kind of completely unwarranted, but turns out somewhat correct concepts, he was able to explain the statistical data that he saw in his experiments.",
            "And you know, though, we now know the picture is much more complicated than that by doing statistical inference over some kind of rich representations, inventing some new abstract concepts.",
            "To support those statistics, he was able to move us fundamentally forward, so we need to be able to face that challenge, and I would argue, and there's a long history of research in cognitive development showing that any child, while maybe isn't Mendel or Darwin or Newton, makes similar in some ways even more impressive discoveries just impressive, because they're done mostly intuitively, maybe largely unconsciously.",
            "And when you're very young.",
            "So we can think of."
        ],
        [
            "Intuitive theories these are like scientific theories, their abstract systems of knowledge that you use to interpret your experience and they they govern the same kinds of domains that scientific theories have looked at.",
            "We can talk about intuitive physics, just as we might talk about, say, intuitive biology.",
            "And our intuitive physics is remarkably powerful, right?",
            "So we can look at things like like this, and this is just a few examples of stability and support, right?",
            "So we look at this table here, and that one looks fairly stable, like if you had to set down your laptop somewhere, that might be OK, but if you had to sit down your laptop and this was the only thing around you, probably think twice and move on, right?",
            "Or we can look at these configurations of blocks and just in an instant grasp the stability or potential points of instability, right?",
            "Like where is this one most unstable?",
            "Well, this doesn't look good.",
            "This looks like it's going to fall over.",
            "This thing over here looks relatively stable.",
            "This block here that's resting straight on the ground very stable.",
            "So how do we make those kinds of judgments?",
            "You know, if you ask a physicist to solve that problem, they could solve that problem using the laws of Newtonian mechanics.",
            "They could solve it more accurately, but it would take a long time.",
            "They have to run a complex simulation probably.",
            "I don't think you could solve it analytically using just our standard mathematical tools, but the mind is doing some approximate version of that.",
            "Or here's another example."
        ],
        [
            "Here's at 4 Pictures of Coke cans, and in each one we look at this and our mind does some kind of causal analysis.",
            "It infers something about the processes that gave rise to this data, right?",
            "How these things were smashed or quashed or whatever.",
            "You just sort of read off the physical history of these objects.",
            "Here's another example."
        ],
        [
            "These are I was going to say these are sort of parsing.",
            "If you like the there's, there's a close analogy, or at least a fertile analogy between the concepts in language and the concepts.",
            "Intuitive theory is actually in one of his first papers.",
            "Chomsky introduced that analogy by saying that the grammar of a language is like a theory which you use to interpret data, and at that time, although that's not what Chomsky and most linguists think.",
            "Now, though maybe they should.",
            "But anyway, at that time language acquisition, grammar induction was thought of as being something like the child constructing a theory of the language.",
            "Well here we have the same kind of thing.",
            "What I just showed you when you diagnose these support relations or when you infer the causal history object the coat can.",
            "It's A kind of parsing.",
            "You're using your abstract knowledge of how physical principles work to take this one particular case and infer the right causal structure that's going on there.",
            "But of course, there's also an acquisition problem which is building the theory in the 1st place, and there's a very interesting research about how children's intuitive physics develops.",
            "What it starts off with, just like Chris was saying earlier in the morning.",
            "There is evidence for some interesting kinds of innate knowledge.",
            "If you like innate representations, at least things like the idea of an object in some form.",
            "It has been argued to be present as early as you can look, say, three by three months old.",
            "But those basic physical concepts get articulated and richton very, very interesting ways over just the first few years of cognitive development.",
            "So that's there's a lot of data that you can study there, and there's a very interesting learning problem.",
            "How the child builds up that intuitive theory of physics, just like you can say, how does a child build there?",
            "Intuitive theory of language.",
            "If you like just a couple of neat demos for one other domain of into a."
        ],
        [
            "Theorizing here.",
            "So let's just look at these animations.",
            "What do we see there?",
            "Yep, volunteers.",
            "The red balls trying to escape the blue one.",
            "Anyone else have another interpretation?",
            "Yeah, somebody said the blue one is chasing the red one.",
            "Yeah, well both.",
            "They kind of go together.",
            "You can't really try to escape unless somebody's chasing you, right?",
            "Yeah, the blue 1 looks like he's trying to follow.",
            "He's not very good at it, right?",
            "It's like he doesn't quite realize that he can't fit through those holes, so he keeps kind of going there and going around.",
            "Or maybe he doesn't fully anticipate where the red ball is.",
            "Very elegant, this is from work by children, Southgate, and very elegant series of studies show that even young infants can perceive that they don't just see it as balls moving around on a plane.",
            "They see it as they give a psychological interpretation.",
            "These are not balls, their agents.",
            "They have goals and one is trying to catch or chase the other and the other one is trying to run away and for reasons of time.",
            "I'm not exactly sure, but I'm sure I'm running behind on what I want to cover.",
            "Don't go into the experimental evidence for how they know that, but I'm happy to talk about that.",
            "It's really neat set of experiments.",
            "Here's here's another example, just to show you how rich these things can get.",
            "This is from a classic movie by Hydran symbol, 2 social psychologists.",
            "I think from the 1940s, so it's low quality animation.",
            "So do you see two triangles in a circle here or something more interesting?",
            "So what do we see here?",
            "Well, it's kind of a nice rendering.",
            "This is this is this quote roughly from something Chris said earlier.",
            "Like if you have a mate and there's a rival go impact that rival right?",
            "It seems that that kind of inference that or that those kind of schemas about social interaction are very, very basic to our minds.",
            "I'm not saying they're necessarily innate, but there's evidence for this kind of thing even.",
            "Very early for young children and you just can't help but seeing in these motions of these very simple shapes.",
            "Very high level social interpretations and psychological interpretations.",
            "There's the big one wants to chase that one out, or he's trying to scare him away.",
            "All sorts of stuff.",
            "The movies is somewhat longer than this, and even more fun, but I don't have time to show you the whole thing, so we want to understand what's the knowledge that takes these very, very simple stimuli and go so far beyond what you can see there, right?",
            "Think about the data here.",
            "In some sense we know what's the low dimensional manifold to take to go back to say the way Neil was putting it.",
            "Well, in each case you have some shapes that are moving in a plane, right?",
            "And they're just these shapes, they're just these point like these entities, so you know what is it.",
            "2 two degrees of freedom to specify their position and 3rd one if they can rotate like these guys.",
            "Or maybe you want to add in velocities very low dimensional in some sense, but look at the high level semantic interpretation we put on it.",
            "So what's the knowledge that supports that?",
            "Well, it's something like an intuitive."
        ],
        [
            "Theory of psychology, and here we use that to parse these displays by inferring these again hidden properties.",
            "Just like there you know we parse the physical displays by inferring distributions of mass and so on, and support relations here the hidden properties are beliefs, desires, plans.",
            "If you like this, one wants this.",
            "He believes this has this goal.",
            "Those are the hidden causes that cause behavior.",
            "And what we do in intuitive psychologists, we work backwards from observed dynamic behavior.",
            "To figure out those hidden causes.",
            "And again, there's an acquisition problem and a very long history, very rich set of phenomena.",
            "About how children build up successive and successively better versions of intuitive psychology."
        ],
        [
            "So that's that's the big problem of cognitive science from my point of view.",
            "How do we solve these problems?",
            "And I want to talk a little bit about how machine learning can help here.",
            "I though I started off by saying, you know, there are classic paradigms of statistical learning.",
            "I don't think are able to support this.",
            "These kinds of computations I do think again that there are certain things that are very right and very deep about those paradigms and what makes the field exciting right now is that people are starting to figure out how to take these ideas of statistical inference and learning and combine them with other computational ideas that might be able to solve these problems.",
            "And we, in cognitive science are trying to do that along with people in AI machine learning, and that synergy between those two fields is driving both of them forward."
        ],
        [
            "So here's a way to to start to make progress.",
            "Let's tease out a number of questions that were interested in.",
            "These are all related.",
            "They're all versions of this or aspects of this question about our minds get so much from so little.",
            "They're all basic questions of knowledge and the interaction between knowledge and processes of learning and inference.",
            "So the most basic question is how does some abstract background knowledge of the world guide these inferences from sparse data?",
            "What are the forms and contents of knowledge in these different domains and tasks that support all these different things?",
            "Here?",
            "How is this knowledge itself acquired?",
            "During experience, so when we talk about parsing right?",
            "Whether it's parsing language or parsing a set of physical objects or parsing, those animate displays were talking about using knowledge to make inferences about things that are out there, but then we can ask the acquisition problem.",
            "How does a child build up that that abstract knowledge?",
            "How if we're talking about learning the knowledge that if you like, supports subsequent learning, right?",
            "This is what has sometimes been called learning to learn both in psychology and in machine learning, where you're talking about acquiring knowledge at different levels of abstraction over very different time scales, right?",
            "The knowledge that supports, say, learning that this is a heavy object, and this is a light object, but based on how they balance the knowledge of intuitive physics might be built up over years, though it might then support learning very quickly about this new thing.",
            "Or like take the problem of.",
            "Learning those two fits right?",
            "So there we would say you learned this new concept.",
            "You learn what if was from just a few examples, but there was some more abstract background knowledge about what objects are like and what words do.",
            "What kinds of sets of objects words can label that again builds up over years.",
            "And if you're talking about learning over very long timescales, then there are certain fundamental challenges that you have to face.",
            "And again, these have been elucidated in both early machine learning as well as in cognitive development.",
            "So Piaget, who was the founder of the modern study of cognitive development.",
            "Talked about what he called the problem of assimilation and accommodation.",
            "How does a child, when faced with new data over their life and they're always going to be seeing things that are somehow surprising to them?",
            "How do they adjust the fit between what's in their head and their surprising experience?",
            "You have two basic choices.",
            "You can either take that surprising date and say no, that can't be kind of, ignore it, or somehow try to assimilate it into your scheme.",
            "Explained it away somehow, or you could accommodate.",
            "You could say, well, I'm actually going to.",
            "Change my view of the world.",
            "I'm going to enrich my theory and in machine learning.",
            "Various people.",
            "You know whether you're talking about Occam's Razor or Bayesian Occam's razor, or for example in the neural network tradition, Steve Grossberg talked about what he called the Stability plasticity dilemma.",
            "Any adaptive system has this same problem.",
            "You always have a model of a certain amount of complexity, and there's a basic problem of adjusting the complexity of the model and it fit to the data, and you always have to be worried about overfitting, where if you try to fit a model that's overly complex to a relatively small amount of data.",
            "You'll overfit and you won't generalize well and generalization successful.",
            "Generalization is all about adjusting that balance."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'm going to start and I'm going to be giving the second half of the introduction to cognitive science.",
                    "label": 1
                },
                {
                    "sent": "This is a particularly fun spot.",
                    "label": 0
                },
                {
                    "sent": "I feel like I have maybe the most fun spot on the whole program because it's at the end of the first day.",
                    "label": 0
                },
                {
                    "sent": "I get to talk about big picture, general introductory issues, but also playing off the themes.",
                    "label": 0
                },
                {
                    "sent": "Very interesting ideas and questions for debate that have been raised in all the earlier talks for today, so I hope this will give you further background in what we're interested in cognitive science.",
                    "label": 0
                },
                {
                    "sent": "What these two fields of cognitive science machine learning have to say to each other, and also laid the groundwork for, say, some of the debates were going.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Having today and for the rest of the summer school.",
                    "label": 0
                },
                {
                    "sent": "Now, as many of the speakers have emphasized, there's there's a long history of interplay between these fields of psychology and cognitive science.",
                    "label": 0
                },
                {
                    "sent": "On the one hand, and machine learning here, I just put up a list of not not complete, but representative list of various approaches to machine learning.",
                    "label": 0
                },
                {
                    "sent": "But in some sense have their origins in psychology or cognitive science.",
                    "label": 0
                },
                {
                    "sent": "They were either invented by psychologists or first published in psychology journals, and that includes ones that have been mentioned already in that context, like the perceptron.",
                    "label": 0
                },
                {
                    "sent": "It was published in the Journal Psychological Review, which is the main leading Journal for theoretical psychology.",
                    "label": 0
                },
                {
                    "sent": "Other things which have been mentioned here like factor analysis and multidimensional scaling, right?",
                    "label": 0
                },
                {
                    "sent": "Which are somewhat old techniques.",
                    "label": 0
                },
                {
                    "sent": "And now we call those unsupervised learning techniques, but also things which you might not at all think of as psychological, either psychologically inspired or psychologically motivated learning algorithms.",
                    "label": 0
                },
                {
                    "sent": "Things like spectral clustering, collaborative filtering with low rank factorization.",
                    "label": 1
                },
                {
                    "sent": "Kernel based classification.",
                    "label": 1
                },
                {
                    "sent": "Bayesian concept learning these ideas.",
                    "label": 0
                },
                {
                    "sent": "Although I don't want.",
                    "label": 0
                },
                {
                    "sent": "I'm not trying to claim that psychologist did everything in machine learning is just picking up the pieces, but you can find either the actual idea or key intuition.",
                    "label": 0
                },
                {
                    "sent": "Zanki math.",
                    "label": 0
                },
                {
                    "sent": "It's not the case that psychology is just about cool phenomena and need experiments, or even it's not just that the rigor of psychology is contained to the rigor of experimental design and data analysis, but that field, just like machine learning, has a long theoretical tradition.",
                    "label": 0
                },
                {
                    "sent": "And what's exciting here is that we need to bring these two theoretical traditions into can't.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Act and learn from each other.",
                    "label": 0
                },
                {
                    "sent": "Now as again the earlier speakers have emphasized this history of interaction between these fields.",
                    "label": 0
                },
                {
                    "sent": "It's long, but it kind of goes in waves and they come together and move apart and so on.",
                    "label": 0
                },
                {
                    "sent": "And what, partly, what motivates this summer school is the sense that these two fields are coming back together again after a somewhat long history of having been apart and looking back with for inspiration and lessons learned for the last moment in history.",
                    "label": 0
                },
                {
                    "sent": "When these two fields were really very tightly interacting.",
                    "label": 0
                },
                {
                    "sent": "This was the connectionist neural network boom that the time went.",
                    "label": 0
                },
                {
                    "sent": "Actually I think all the all the speakers today, maybe all the faculty here were bout the right generation.",
                    "label": 0
                },
                {
                    "sent": "We all kind of got into the field around this time and this was probably a lot of what excited us is.",
                    "label": 0
                },
                {
                    "sent": "That is that a fair statement.",
                    "label": 0
                },
                {
                    "sent": "Certainly Neil said that I think would say that I would say that.",
                    "label": 0
                },
                {
                    "sent": "So what was this paradigm about what was incomplete and what lessons can we learn?",
                    "label": 0
                },
                {
                    "sent": "Take forward just to recap my own version of the same kind of history.",
                    "label": 0
                },
                {
                    "sent": "What was exciting about this view was, but it did give in the sense that Nick was talking about at the very end this multi level of analysis perspective on how the mind in the brain work, formulating problems of cognition and really with a focus on learning at what mark called the computational theory level.",
                    "label": 0
                },
                {
                    "sent": "The abstract logic of the computation, the algorithmic level that made contact with traditional ideas from psychology.",
                    "label": 0
                },
                {
                    "sent": "What were the steps of mental processing an even down to the neural implementation level and all these things seem to fit together in a very neat way.",
                    "label": 0
                },
                {
                    "sent": "So learning is some kind of statistics with the general motivation that what our brains do is they find structure in the world.",
                    "label": 0
                },
                {
                    "sent": "This could be unsupervised, it could be task oriented, it could be driven by rewards spread out overtime.",
                    "label": 0
                },
                {
                    "sent": "Those are the paradigms of supervised unsupervised reinforcement learning.",
                    "label": 0
                },
                {
                    "sent": "But it's basically some kind of statistical inference.",
                    "label": 0
                },
                {
                    "sent": "Finding patterns in masses of high dimensional data, finding clusters, low dimensional manifolds, and so on.",
                    "label": 0
                },
                {
                    "sent": "So that's the abstract math problem.",
                    "label": 0
                },
                {
                    "sent": "We then knew how to formulate this statistical inference problem as some kind of an optimization.",
                    "label": 0
                },
                {
                    "sent": "Or if you like some kind of maximum likelihood as Neil said, those are kind of two different takes on the same problem, but there's basically some kind of function, some cost function to be minimized.",
                    "label": 0
                },
                {
                    "sent": "We knew how to write learning rules or sort of algorithms for effectively doing that.",
                    "label": 0
                },
                {
                    "sent": "These gradient descent chain rule backpropagation sorts of things.",
                    "label": 0
                },
                {
                    "sent": "We also this is where the connection to neuroscience comes in.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                },
                {
                    "sent": "Knew how to make a link to these neural networks.",
                    "label": 0
                },
                {
                    "sent": "These networks of neuron, like processing units, where the idea is that this high dimensional data analysis problem that comes down to learning lots and lots of numerical parameters, say the lutely.",
                    "label": 0
                },
                {
                    "sent": "This picture here, which is dimensionality reduction from 2 dimensions down to one.",
                    "label": 0
                },
                {
                    "sent": "Obviously that's a cartoon sketch of a much higher dimensional problem if we think about the data coming through our senses and there you have parameters specifying, say, the slope and Y intercept or the weights of that linear surface.",
                    "label": 0
                },
                {
                    "sent": "In this very high dimensional space, or the parameter specifying, say, means and covariances of clusters, all those numerical parameters would correspond to the weights connecting these units and the learning rules were ways of adjusting the weights in response to.",
                    "label": 0
                },
                {
                    "sent": "Data.",
                    "label": 0
                },
                {
                    "sent": "And then actually making contact with real Duro science.",
                    "label": 0
                },
                {
                    "sent": "These pictures, the reason why we could say these are like the brain is because these circles can be interpreted as neurons.",
                    "label": 0
                },
                {
                    "sent": "These lines as synapses or connections where one neuron sends a signal to another neuron and the weights correspond to the strength of the synapses.",
                    "label": 0
                },
                {
                    "sent": "How much when an electrical impulse comes in from the presynaptic neuron, how much chemical is dumped into the space between the neurons that's then picked up by the postsynaptic neuron and then determines basically how strongly the postsynaptic neuron responds to the input coming in from the presynaptic neuron.",
                    "label": 0
                },
                {
                    "sent": "The more of that neurotransmitter or the more sensitive the postsynaptic cell is to the same amount of neurotransmitter, the stronger the connection.",
                    "label": 0
                },
                {
                    "sent": "And there were rules mapped out empirically of how this strength of these synapses in the brain adjusted in response to experience.",
                    "label": 0
                },
                {
                    "sent": "These are things like long term potentiation.",
                    "label": 0
                },
                {
                    "sent": "That's an empirical phenomenon which was found to follow some of the basic characteristics of, say, heavy and or or Delta rule type learning.",
                    "label": 0
                },
                {
                    "sent": "Just basically just some function of pre and post synaptic or input and output activations and then you can find circuits in the brain.",
                    "label": 0
                },
                {
                    "sent": "This is a synapse in the hippocampus.",
                    "label": 1
                },
                {
                    "sent": "The hippocampus is structuring your brain kind of around there and it's also in other mammals like there approximately there in the mouse brain and a lot of neuropsychology and other kinds of neuroscience showed that basically without this structure working well and without these synapses even doing long term potentiation you can't learn certain basic things.",
                    "label": 0
                },
                {
                    "sent": "So that's a very elegant picture.",
                    "label": 0
                },
                {
                    "sent": "In understanding the mind in the brain in computational terms, but it's also been useful not just for this kind of reverse engineering enter.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Guys, but for forward engineering so on the technology side these basic learning algorithms.",
                    "label": 0
                },
                {
                    "sent": "What we would now call things like principle component analysis or K means clustering or mixture models and so on underlie many of the basic learning technologies that we now take for granted.",
                    "label": 0
                },
                {
                    "sent": "So face detection this is a classic example of eigenfaces and more modern ways of detecting faces and images, which I think Neil was referring to.",
                    "label": 0
                },
                {
                    "sent": "How does Facebook suggests who your friends should be or how does Amazon recommend newproducts?",
                    "label": 0
                },
                {
                    "sent": "Well they do.",
                    "label": 0
                },
                {
                    "sent": "They use very essentially very simple.",
                    "label": 0
                },
                {
                    "sent": "Statistical pattern finding like this, but just scaled up that's you know that's the Google recipe, right?",
                    "label": 0
                },
                {
                    "sent": "Google does this best.",
                    "label": 0
                },
                {
                    "sent": "How does Google organize information on the web and return useful search hits for your query?",
                    "label": 0
                },
                {
                    "sent": "Well, the first note technical innovation of Google there.",
                    "label": 0
                },
                {
                    "sent": "Now of course many.",
                    "label": 0
                },
                {
                    "sent": "But the one that got famous for what distinguish it from earlier generations of search, which by conventional standards now or just worthless, like things like AltaVista.",
                    "label": 0
                },
                {
                    "sent": "If anybody remembers that, was this idea of page rank where you rank web search hits, not just based on the match of the words on the page to the words in the query.",
                    "label": 0
                },
                {
                    "sent": "But to some sense of how important a web pages, how central it is in the great connectivity network of the Web, and Google showed how you could compute a sensible and very efficient notion of authoritativeness or centrality by taking basically the first principle component of the web connectivity matrix.",
                    "label": 0
                },
                {
                    "sent": "So PCA and related techniques massively influential.",
                    "label": 0
                },
                {
                    "sent": "What's missing well again?",
                    "label": 0
                },
                {
                    "sent": "You've seen some of this in all of the talks here, and I want to give you my take.",
                    "label": 0
                },
                {
                    "sent": "What the serious study of cognition, learning, and cognition more generally tells us how we need to go beyond this paradigm, but also what kind of insights can we take from this paradigm and what other stuff do we have to add?",
                    "label": 0
                },
                {
                    "sent": "We want we don't just want to throw this out.",
                    "label": 0
                },
                {
                    "sent": "'cause this has been such a successful paradigm, like in physics or any other successful science.",
                    "label": 0
                },
                {
                    "sent": "We want successive paradigms to build on what was valuable and write about.",
                    "label": 0
                },
                {
                    "sent": "Old paradigms, so the premise of this summer school, I'd say pretty clearly, is that there is some sense in which cognition is heavily dependent on learning and learning should be described as a kind of statistical inference, but the question is what kind of statistics and how does it interact with the other important pieces of the picture?",
                    "label": 0
                },
                {
                    "sent": "In cognition?",
                    "label": 0
                },
                {
                    "sent": "The kinds of symbolic representations, for example, that Nick was talking about.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so the outline for for this talk will be 3 parts.",
                    "label": 0
                },
                {
                    "sent": "I'll give you my take on the big problem of cognitive science, which Nick is already hinted at.",
                    "label": 1
                },
                {
                    "sent": "And of course this is a personal view, but it's one that's widely shared.",
                    "label": 0
                },
                {
                    "sent": "Also, it's not the only problem though.",
                    "label": 0
                },
                {
                    "sent": "Just to be clear, then talk about how machine learning in its modern form can help address this problem, and then a very brief introduction to cognition viewed through the lens of statistical inference and learning like what's an example of a sort of experiment we might do to just give some insight into how and why we might want to view cognition as a kind of statistical inference.",
                    "label": 1
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here's the big question from my point of view, you could put it like this.",
                    "label": 0
                },
                {
                    "sent": "How does the mind get so much from so little all across cognition?",
                    "label": 1
                },
                {
                    "sent": "We see the mind taking in data, say through the senses, and making generalizations, abstractions going beyond the data given, building models, doing things that by saying some conventional standard in statistics, maybe by the standards that earlier paradigm shouldn't be possible to get, it is, and we want to understand how that works.",
                    "label": 0
                },
                {
                    "sent": "So we.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And illustrate this from starting from visual perception.",
                    "label": 0
                },
                {
                    "sent": "That I think it's again widely acknowledged that taking out even learning the study of vision is where we made the most progress in understanding how the brain and the mind work, how cognition spans all these different levels.",
                    "label": 0
                },
                {
                    "sent": "This is a slide from David Mars book, so Mars.",
                    "label": 0
                },
                {
                    "sent": "Remember it in famous these days for a number of reasons, including this way to think about how a cognitive system works at different levels of analysis.",
                    "label": 0
                },
                {
                    "sent": "As Nick talked about, but he was also probably this is his main legacy.",
                    "label": 0
                },
                {
                    "sent": "One of the founders of the field of Computational Vision, a field which has also a long history of interaction between the human and engineering side and in his book that based on a research program developed over a brief time, he died tragically early from cancer.",
                    "label": 0
                },
                {
                    "sent": "This is research that was mostly done in the 1970s and the book was published around 1980, laid out a view of how the visual system might work.",
                    "label": 0
                },
                {
                    "sent": "It was mostly speculation he didn't have time to really work it all out, but there's a lot we can learn by looking at it now.",
                    "label": 0
                },
                {
                    "sent": "This is this figure.",
                    "label": 0
                },
                {
                    "sent": "Here is just meant to illustrate what makes the problem of vision hard.",
                    "label": 0
                },
                {
                    "sent": "How in this context vision is the mind going beyond the data that's given.",
                    "label": 0
                },
                {
                    "sent": "So here's an image.",
                    "label": 0
                },
                {
                    "sent": "Again, this is, you know, circa 1980.",
                    "label": 0
                },
                {
                    "sent": "Digital image, very low, low resolution, low.",
                    "label": 0
                },
                {
                    "sent": "Contrast, but we can still see what is right.",
                    "label": 0
                },
                {
                    "sent": "So what is this?",
                    "label": 0
                },
                {
                    "sent": "Describe it.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "It's a plant.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I heard somebody else say it's a leaf.",
                    "label": 0
                },
                {
                    "sent": "Is it 1 leaf or how many leaves are there?",
                    "label": 0
                },
                {
                    "sent": "For what?",
                    "label": 0
                },
                {
                    "sent": "What else is there?",
                    "label": 0
                },
                {
                    "sent": "There's a stand right there you can.",
                    "label": 0
                },
                {
                    "sent": "You can put in a number of words on this, but you can also talk about the geometry, right?",
                    "label": 0
                },
                {
                    "sent": "Like use your hands to describe the shape of this plant with these leaves.",
                    "label": 0
                },
                {
                    "sent": "Sort of like there's one kind of leaf folding over another one passing behind another one over here, right?",
                    "label": 0
                },
                {
                    "sent": "So just from this image, very low quality image as it is.",
                    "label": 0
                },
                {
                    "sent": "You can extract semantic context and rich surface percepts.",
                    "label": 0
                },
                {
                    "sent": "But what does this look like coming into your eye?",
                    "label": 0
                },
                {
                    "sent": "Well, it looks like this.",
                    "label": 0
                },
                {
                    "sent": "This is just a zoom in in that box there of the pixel brightness is on a scale of 0 to 255.",
                    "label": 0
                },
                {
                    "sent": "Roughly like what might be coming into your retinal ganglion cells, pulling inputs from photoreceptors in your retina and you just see a sea of numbers here, right where there are the surface is, or the Leafs, or the stems, or the plant.",
                    "label": 0
                },
                {
                    "sent": "That's the problem and this particular zooming is an interesting one, because this is a region here 1 leaf crosses over the other, and perceptually, we see a boundary between surface is there, but there's no actual edge or or sharp change in the image.",
                    "label": 0
                },
                {
                    "sent": "Brightness is here.",
                    "label": 0
                },
                {
                    "sent": "It's all these numbers are around.",
                    "label": 0
                },
                {
                    "sent": "You know high 160's low 170, so that's that's interpolated based on of course other data that's here but also rich knowledge about how the world, and indeed the process of image formation, likely works.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As as Nick pointed out or showed some great illustrations of the study of visual illusions, places where our mind plays tricks on us.",
                    "label": 1
                },
                {
                    "sent": "If you like has long been used by cognitive scientists to understand how the problem works, what makes it hard, and what kinds of assumptions or constraints might enable the solution.",
                    "label": 0
                },
                {
                    "sent": "So here's my favorite visual lusion.",
                    "label": 0
                },
                {
                    "sent": "It's a close second, perhaps to the brightness allusions that Nick showed.",
                    "label": 0
                },
                {
                    "sent": "This one is by Roger Shepherd, who is one of the founders of cognitive Psychology, one of the most important figures in cognitive science.",
                    "label": 0
                },
                {
                    "sent": "He was also a very good artist.",
                    "label": 0
                },
                {
                    "sent": "Besides being very creative scientists and so he drew a number of allusions.",
                    "label": 0
                },
                {
                    "sent": "But this is perhaps his most famous these two tables.",
                    "label": 0
                },
                {
                    "sent": "So what's what's the illusion here?",
                    "label": 0
                },
                {
                    "sent": "Well, let's ask you to make a judgment similar to the kind of judgment Nick said, which is a judgment just about what you see here on the plane.",
                    "label": 0
                },
                {
                    "sent": "So let's take these two lines in particular.",
                    "label": 0
                },
                {
                    "sent": "Say this.",
                    "label": 0
                },
                {
                    "sent": "The edge of this table, and this edge of that table, and the question is which one is longer?",
                    "label": 0
                },
                {
                    "sent": "Just here on the plane, this one, or that one.",
                    "label": 0
                },
                {
                    "sent": "The right one.",
                    "label": 0
                },
                {
                    "sent": "Anyone want to?",
                    "label": 0
                },
                {
                    "sent": "The left one?",
                    "label": 0
                },
                {
                    "sent": "Is there another answer?",
                    "label": 0
                },
                {
                    "sent": "The same, yes.",
                    "label": 0
                },
                {
                    "sent": "So some people have already generalized from the one example that when people show you a visual illusion, the correct answer is always there.",
                    "label": 0
                },
                {
                    "sent": "The same.",
                    "label": 1
                },
                {
                    "sent": "That's right, they are the same here.",
                    "label": 0
                },
                {
                    "sent": "Just to convince you of that, I'll do my version of like what what Nick did, which is show you a PowerPoint build up here.",
                    "label": 0
                },
                {
                    "sent": "There's a, you know, an outline I drew.",
                    "label": 0
                },
                {
                    "sent": "On that guy.",
                    "label": 0
                },
                {
                    "sent": "Oh I haven't done this since I switched to the new version of PowerPoint.",
                    "label": 0
                },
                {
                    "sent": "Does anyone know how to rotate?",
                    "label": 0
                },
                {
                    "sent": "Oh, that little green thing, OK?",
                    "label": 0
                },
                {
                    "sent": "Dad.",
                    "label": 0
                },
                {
                    "sent": "There you go, so you can see no tricks here, unless I've actually literally hacked PowerPoint, that it really is the very same shape the whole table top is the same shape in the plane, yet the context of this scene.",
                    "label": 0
                },
                {
                    "sent": "Makes makes them look very different as 2 dimensional shapes.",
                    "label": 0
                },
                {
                    "sent": "So what's going on here?",
                    "label": 0
                },
                {
                    "sent": "Well, you know it's all the stuff that Nick was talking about there.",
                    "label": 0
                },
                {
                    "sent": "Let's get rid of this.",
                    "label": 0
                },
                {
                    "sent": "The problem.",
                    "label": 0
                },
                {
                    "sent": "The problem is ambiguous.",
                    "label": 0
                },
                {
                    "sent": "Or the interpretation of the image.",
                    "label": 0
                },
                {
                    "sent": "The biggest there are multiple ways the 3D World could be that would give rise to the same 2 dimensional image falling onto your retina onto this plane here.",
                    "label": 1
                },
                {
                    "sent": "So that's that's the problem.",
                    "label": 0
                },
                {
                    "sent": "That's the sense in which we're trying to solve in inherently ill posed or under constrained problem, right?",
                    "label": 0
                },
                {
                    "sent": "I mean, just mathematically the world is 3 dimensional, the retinal images 2 dimensional.",
                    "label": 0
                },
                {
                    "sent": "So of course you're losing information, and in principle there's an infinite number of three dimensional geometry that could be compatible with any one 2 dimensional projection.",
                    "label": 0
                },
                {
                    "sent": "Not to mention all the other complexities that come from occlusion.",
                    "label": 0
                },
                {
                    "sent": "The way light interacts with surface properties and so on.",
                    "label": 0
                },
                {
                    "sent": "So how do you solve that impossible problem?",
                    "label": 0
                },
                {
                    "sent": "How do you work backwards from the 2D image to the 3D structure out there?",
                    "label": 1
                },
                {
                    "sent": "Well, our best guess is that the brain makes a good guess.",
                    "label": 0
                },
                {
                    "sent": "It solves a kind of statistical inference problem from a Bayesian point of view.",
                    "label": 0
                },
                {
                    "sent": "There's some hypothesis space of world structures in some prior.",
                    "label": 0
                },
                {
                    "sent": "And by putting probabilities in the right way that correspond to at least sufficiently not in full detail, but correspond just enough to the way the world is yet while still allowing tractable inference, then that's.",
                    "label": 0
                },
                {
                    "sent": "Going to be the form of the solution and by studying what the mind does here, right?",
                    "label": 0
                },
                {
                    "sent": "It's not really getting it wrong.",
                    "label": 0
                },
                {
                    "sent": "It's getting it right in the sense of using the kind of logic needed to solve the real world problem that doesn't involve looking at images displayed on flat computer screens, but involves trying to solve this analogous problem of discovering the 3D structure of the world from the image comment coming onto your retina.",
                    "label": 0
                },
                {
                    "sent": "Now, what is current computer vision which which does rely very heavily on the kind of learning techniques that have long been developed in statistical machine learning?",
                    "label": 0
                },
                {
                    "sent": "Things like for example perceptrons, support vector machines, PCA, dimensionality reduction, various boosting, these kinds of methods which you've probably heard some about, and you'll hear more about in the summer school, can it solve these kinds of scene analysis problems well?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here's an example from a great paper by some of my MIT colleagues.",
                    "label": 0
                },
                {
                    "sent": "Joy Lim Torralba and will sleep.",
                    "label": 1
                },
                {
                    "sent": "I think it was just accepted to CPR 2010 so it's state of the art.",
                    "label": 1
                },
                {
                    "sent": "It uses a very number of different learning based approaches.",
                    "label": 0
                },
                {
                    "sent": "It learns detectors for many classes of real world objects, like for example people, roads, sofas and not only that.",
                    "label": 0
                },
                {
                    "sent": "It also has a notion of context.",
                    "label": 0
                },
                {
                    "sent": "In this particular paper is trying to show how you can put together the result of bottom up detectors which are trained using a boosting.",
                    "label": 0
                },
                {
                    "sent": "Very simple kind of but very powerful supervised.",
                    "label": 0
                },
                {
                    "sent": "Learning method, but also put those together with some kind of top down scene context.",
                    "label": 0
                },
                {
                    "sent": "And here the point of this figure of course is you see this sofa in the middle of the road and it's anomalous, and their model is able to say that it's anomalous, still recognize it.",
                    "label": 0
                },
                {
                    "sent": "It's a sofa, but but say that's kind of a violation of context.",
                    "label": 0
                },
                {
                    "sent": "So here's the input, and here's the output with this very nice method, well.",
                    "label": 0
                },
                {
                    "sent": "What their method does is it draws a few boxes around some regions in the image and puts words on them.",
                    "label": 0
                },
                {
                    "sent": "Rd, sofa, person, person, person with confidence.",
                    "label": 0
                },
                {
                    "sent": "Now that to some extent approximates what you see when you actually look at this input.",
                    "label": 0
                },
                {
                    "sent": "But how closely does it approximate how close to the richness of what you see here?",
                    "label": 0
                },
                {
                    "sent": "Does this come well on a scale from sort of here to here, I would say it's about here, right?",
                    "label": 0
                },
                {
                    "sent": "It's definitely a step in the right direction, but just think about all the things you could say here.",
                    "label": 0
                },
                {
                    "sent": "All the things you could describe all the questions you could answer all the richness of surface is.",
                    "label": 0
                },
                {
                    "sent": "And and different layers of depth that you see.",
                    "label": 0
                },
                {
                    "sent": "You see these windows here.",
                    "label": 0
                },
                {
                    "sent": "This is sort of a glass window.",
                    "label": 0
                },
                {
                    "sent": "You see a car slightly bent and distorted there.",
                    "label": 0
                },
                {
                    "sent": "You don't think there's a weird bent car inside that building, but rather it's reflecting something across the street.",
                    "label": 0
                },
                {
                    "sent": "All these inferences go on unconsciously.",
                    "label": 0
                },
                {
                    "sent": "You're just as Nick was saying, when you consciously introspect what you get is the output of the computation.",
                    "label": 0
                },
                {
                    "sent": "But the richness of that output should tell us a lot about what might and maybe even what has to go on along the way.",
                    "label": 0
                },
                {
                    "sent": "From here to there.",
                    "label": 0
                },
                {
                    "sent": "Now let's turn to.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Example, which is closer to some of the work I do this is, this is from an experiment in our lab where we were inspired by another kind of problem of inference and generalization.",
                    "label": 0
                },
                {
                    "sent": "Children learning concepts or learning the meanings of words.",
                    "label": 1
                },
                {
                    "sent": "Anybody who's been a child or had a child, it's easier to see this if you are looking at somebody else doing this rather than being in the moment yourself.",
                    "label": 0
                },
                {
                    "sent": "Should be familiar with the experience of word learning and the remarkable thing there is, how few examples it takes to learn the meaning of a word.",
                    "label": 0
                },
                {
                    "sent": "So a child might learn what a chair is, or what a horses from just seeing one or a couple of examples labeled in the right context.",
                    "label": 0
                },
                {
                    "sent": "And then they can pretty much pick out all the other horses.",
                    "label": 0
                },
                {
                    "sent": "They might make an occasional confusion.",
                    "label": 0
                },
                {
                    "sent": "Seeing a cow that you know down the field in the same farm and calling that a horse and their parent has to say no.",
                    "label": 0
                },
                {
                    "sent": "No, that's a cow, right?",
                    "label": 0
                },
                {
                    "sent": "But they're not going to be calling the fence post a horse or mom or dad horse, hopefully.",
                    "label": 0
                },
                {
                    "sent": "Unless they're making a joke, right?",
                    "label": 0
                },
                {
                    "sent": "So how does that work?",
                    "label": 0
                },
                {
                    "sent": "I mean, if you think of it as a as a math problem, there's some infinite set of objects.",
                    "label": 0
                },
                {
                    "sent": "There's an infinite subset of those that are the set of horses, and the child is able to mostly grass the boundaries of that subset from just a few points randomly sampled within it.",
                    "label": 0
                },
                {
                    "sent": "If you want to a sense of what this is like.",
                    "label": 0
                },
                {
                    "sent": "As an adult you see we show you these objects here and then we give you a couple of examples say of a tufa.",
                    "label": 0
                },
                {
                    "sent": "These are objects from an alien world, and that's a word in the alien language.",
                    "label": 0
                },
                {
                    "sent": "And now you have a pretty good job.",
                    "label": 0
                },
                {
                    "sent": "Or you can do a pretty good job of telling me which other things are too frozen which aren't, so let's try that out.",
                    "label": 0
                },
                {
                    "sent": "How about this one?",
                    "label": 0
                },
                {
                    "sent": "Yes or no?",
                    "label": 0
                },
                {
                    "sent": "This one.",
                    "label": 0
                },
                {
                    "sent": "OK. More uncertainty there.",
                    "label": 0
                },
                {
                    "sent": "That's why you've got to be Bayesian, OK?",
                    "label": 0
                },
                {
                    "sent": "Right, so most people said no on that one, but there was a brief delay and a little bit of hesitation.",
                    "label": 0
                },
                {
                    "sent": "Which is one way behaviourally in the lab to diagnose uncertainty, reaction time.",
                    "label": 0
                },
                {
                    "sent": "So here you have a demonstration that again from just a few examples and this would work basically the same if I gave you 1 example, you can get it almost perfectly correct with a little bit of uncertainty.",
                    "label": 0
                },
                {
                    "sent": "Kind of at the edges of the concept.",
                    "label": 0
                },
                {
                    "sent": "How does that work well?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To to go back to a theme that Neil raised.",
                    "label": 0
                },
                {
                    "sent": "You know this slogan, according to their dynamics, a bumblebee can't fly.",
                    "label": 1
                },
                {
                    "sent": "Well, you might say according to conventional statistical learning theory.",
                    "label": 1
                },
                {
                    "sent": "Like you know that Nick's theories of generalization or or.",
                    "label": 0
                },
                {
                    "sent": "Valiants PAC learning theory this shouldn't be possible.",
                    "label": 0
                },
                {
                    "sent": "You shouldn't be able to learn a concept from just a few examples, let alone just one positive example.",
                    "label": 1
                },
                {
                    "sent": "Where is all the negative examples?",
                    "label": 0
                },
                {
                    "sent": "Where is the masses of data that you know the positives and negatives that something like a perceptron needs to find the right maximum margin discriminator to take another example where I think we need to raise some questions about our conventional theories of learning, think about the oldest problem in statistics learning about the causal structure of the world from evidence.",
                    "label": 0
                },
                {
                    "sent": "So we learn in a basic statistics class.",
                    "label": 0
                },
                {
                    "sent": "Correlation doesn't imply causation.",
                    "label": 0
                },
                {
                    "sent": "It's a cute causation and within in some cases saying the right randomized controlled experiment.",
                    "label": 0
                },
                {
                    "sent": "It can identify causation.",
                    "label": 0
                },
                {
                    "sent": "But what do people do?",
                    "label": 0
                },
                {
                    "sent": "Do we go out and conduct randomized clinical trials with extensive datasets?",
                    "label": 0
                },
                {
                    "sent": "Well, think about into it.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Really, how you might make a causal inference, that kind of thing.",
                    "label": 1
                },
                {
                    "sent": "That's a clinical trial would, do?",
                    "label": 1
                },
                {
                    "sent": "We know we're always trying to make inferences like this, like, you know, I get a cold.",
                    "label": 0
                },
                {
                    "sent": "Somebody tells you about some new herbal remedy.",
                    "label": 1
                },
                {
                    "sent": "Does it actually help me get over the cold more quickly or not?",
                    "label": 0
                },
                {
                    "sent": "Well, I might do a little informal experiment.",
                    "label": 0
                },
                {
                    "sent": "Or I might not even think about this consciously, but sometimes I remember to take the drug in time.",
                    "label": 0
                },
                {
                    "sent": "Other times I don't.",
                    "label": 0
                },
                {
                    "sent": "I could keep track of whether I had a short code or a long cold, and I might make a data table like this.",
                    "label": 0
                },
                {
                    "sent": "You know, unconsciously, of course, but people are going to be making inferences from there.",
                    "label": 0
                },
                {
                    "sent": "Very sparse data.",
                    "label": 0
                },
                {
                    "sent": "I mean just a few examples is just a few data points in each cell, which you know if you computed Chi Square, tried to do a conventional statistical measure of Association here isn't going to give you anything particularly meaningful, but what will see Tom Griffith will talk about this?",
                    "label": 0
                },
                {
                    "sent": "I believe later on in the in the in the course is that people peoples console inferences from very little data are surprisingly rational and reliable, and it might have something to do with how even a young child is able to learn about the causal structure of the world from not just this little data, but you know.",
                    "label": 0
                },
                {
                    "sent": "Think about to take an example from Hume.",
                    "label": 0
                },
                {
                    "sent": "How does a child learn when they first touch hot stove not to touch the stove again that was touching the stove that burned them, so do.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Do something like this.",
                    "label": 0
                },
                {
                    "sent": "Do they keep track of all the times in which they came up to a stove and they either touched it or didn't touch it and either got burned or didn't get burned?",
                    "label": 1
                },
                {
                    "sent": "Know once is enough right?",
                    "label": 0
                },
                {
                    "sent": "Or to take another example, there isn't actually a button on this wall, but let's say there was an I went over here and pressed it and just at the moment that I pressed it.",
                    "label": 1
                },
                {
                    "sent": "The screen started to go up, So what would we think?",
                    "label": 0
                },
                {
                    "sent": "Well, everybody here would think oh I guess this button makes the screen go up probably makes it go down too.",
                    "label": 0
                },
                {
                    "sent": "If I press it again or suppose I press this button and the light all the lights in the auditorium go off well then just that one suspicious coincidence combined with all the other stuff you know about how causal causality works and how auditoriums work is enough to say, OK, I think that that button makes the lights go off.",
                    "label": 0
                },
                {
                    "sent": "Maybe turn back on again and this ability to infer a new causal relation.",
                    "label": 0
                },
                {
                    "sent": "From one example, this one suspicious coincidence.",
                    "label": 0
                },
                {
                    "sent": "Is really quite powerful.",
                    "label": 0
                },
                {
                    "sent": "I mean almost to the point that it could have a misguided or there's a lot of potential for misuse of this power.",
                    "label": 0
                },
                {
                    "sent": "You think about all the calls of relations you could infer from this.",
                    "label": 1
                },
                {
                    "sent": "So suppose I went over here and press this button and all of a sudden the two halves the auditorium started to split and the and the chairs on.",
                    "label": 0
                },
                {
                    "sent": "This time over here and over there and underneath was revealed a swimming pool.",
                    "label": 0
                },
                {
                    "sent": "Has anybody seen it's A wonderful life that Jimmy Jimmy Stewart movie that actually happens there in a high school gym?",
                    "label": 0
                },
                {
                    "sent": "That's where I got the idea.",
                    "label": 0
                },
                {
                    "sent": "But you know, these crazy Italian architects they could think of anything.",
                    "label": 0
                },
                {
                    "sent": "I mean, that's it's possible.",
                    "label": 0
                },
                {
                    "sent": "And if that happened, I'd say oh that's the button that makes the auditorium split in half to reveal the hidden swimming pool.",
                    "label": 0
                },
                {
                    "sent": "Awesome.",
                    "label": 0
                },
                {
                    "sent": "So that's and that's what it's like to be a child is to be in the world of these surprising and wonderful causal connections, and to get them just like that, and then to be able to use them to achieve all sorts of wonderful and sometimes to your parents annoying effects.",
                    "label": 0
                },
                {
                    "sent": "Again by classical statistical standards, it shouldn't be possible, yet it is.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Language so Nick mentioned language and next vision.",
                    "label": 0
                },
                {
                    "sent": "This is the other great area of progress in cognitive science, not so much endurance science because we don't have good animal models.",
                    "label": 0
                },
                {
                    "sent": "So we know almost nothing about how language works in the brain.",
                    "label": 0
                },
                {
                    "sent": "But we know a lot about the behavior and working backwards.",
                    "label": 0
                },
                {
                    "sent": "Reverse engineering the black box.",
                    "label": 0
                },
                {
                    "sent": "We have a lot of ideas, at least an insights into into the representations and computations underlying language.",
                    "label": 0
                },
                {
                    "sent": "So classically looking at examples of parsing where you take a stream of words in a sentence and extract some representation of meaning like these hierarchical phrase structures.",
                    "label": 0
                },
                {
                    "sent": "Nick showed examples with the sentence.",
                    "label": 0
                },
                {
                    "sent": "The girl saw the boy with the telescope.",
                    "label": 1
                },
                {
                    "sent": "Here are a few more amusing examples of ambiguity in parsing where the same sequence of words could have say, two or more different meanings that Steve Pinker collected in one of his popular books.",
                    "label": 1
                },
                {
                    "sent": "Two cars were reported stolen by The Grove Police yesterday.",
                    "label": 0
                },
                {
                    "sent": "So who was doing the stealing or the reporting there?",
                    "label": 0
                },
                {
                    "sent": "The judge sentence the killer to die in the electric chair for the second time, no one was injured in the blast, which was attributed to a buildup of gas by 1 town official.",
                    "label": 1
                },
                {
                    "sent": "One witness told the commissioners that she'd seen sexual intercourse taking place between two parked cars in front of your house.",
                    "label": 0
                },
                {
                    "sent": "So in all cases, there's kind of a humorous reading and the intended reading and what it has to do with how you group these words together into phrases.",
                    "label": 0
                },
                {
                    "sent": "How you attach the different arguments of different nouns here to the verbs, who's doing what and who and what is it being done too.",
                    "label": 0
                },
                {
                    "sent": "So that's that's the case again, where our minds have to solve this inherently underconstrained problem.",
                    "label": 0
                },
                {
                    "sent": "There's more than one solution, consistent or compatible with the data.",
                    "label": 0
                },
                {
                    "sent": "Somehow we just have to make a good guess.",
                    "label": 0
                },
                {
                    "sent": "And of course you have these cases.",
                    "label": 0
                },
                {
                    "sent": "These are like visual illusions where your mind is kind of getting it wrong, but they show you the assumptions in the logic by which the computation normally works and gets it right now.",
                    "label": 0
                },
                {
                    "sent": "As Nick mentioned, just like in computer vision where there's the current state of the art, a lot of it is based on representations that are way too simple that don't capture the richness of human perception in natural scenes, but are tractable for learning and that we can get some practical mileage out of them.",
                    "label": 0
                },
                {
                    "sent": "Like that work I showed you from MIT well.",
                    "label": 0
                },
                {
                    "sent": "Again, on the language side, you've got the same sort of thing.",
                    "label": 0
                },
                {
                    "sent": "He the version of that quote that I'd heard was from Fernando Pereira saying every time I fire a linguist, the performance of my system goes up much more negative view, not if you add it well.",
                    "label": 0
                },
                {
                    "sent": "I guess they're both pretty negative.",
                    "label": 0
                },
                {
                    "sent": "If you add a linguist, performance goes down anyway.",
                    "label": 0
                },
                {
                    "sent": "But you know, think about how Google does natural language processing massive data, very simple statistical learning algorithms, just because that's what that's what scalable an they can do some surprising amount from masses of data.",
                    "label": 0
                },
                {
                    "sent": "So I just saw some you know, I don't know when they release exactly, but Google released their Google Ngram data set so you can get up to five five word engrams from a massive online data set.",
                    "label": 0
                },
                {
                    "sent": "That's the kind of data that Google say uses to do spelling correction.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is a one place where you can really see both the power and limitations of the simple statistical view of language.",
                    "label": 0
                },
                {
                    "sent": "So here is remarkable thing we're all familiar with.",
                    "label": 0
                },
                {
                    "sent": "You can type in a sort of garbled junk to Google and it somehow figures out what you're talking about and then returns you useful search hits.",
                    "label": 0
                },
                {
                    "sent": "So I typed in this.",
                    "label": 0
                },
                {
                    "sent": "We can all read this, right, it says, well, it says that.",
                    "label": 0
                },
                {
                    "sent": "How does Google Spelling correction work?",
                    "label": 0
                },
                {
                    "sent": "You have no trouble overlooking the spelling errors, and apparently neither does Google.",
                    "label": 0
                },
                {
                    "sent": "Does that mean that Google's got the same model that you do or somewhat human like model of language?",
                    "label": 0
                },
                {
                    "sent": "Well, it does have a model of language.",
                    "label": 0
                },
                {
                    "sent": "It's based on these these N grams and I think it's based on other things like a model of typing errors.",
                    "label": 0
                },
                {
                    "sent": "But to see where your model goes beyond Googles, try this case here.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what does this say?",
                    "label": 0
                },
                {
                    "sent": "Yeah, so if you're not a native English speaker, so most native English speakers can like look at this for about half a second and then just pretty much rattle it off if you're not a native English speaker, it probably took you longer now that both of those are showing you something.",
                    "label": 0
                },
                {
                    "sent": "But even the non native English speakers among you are much better than Google here.",
                    "label": 0
                },
                {
                    "sent": "Why is it?",
                    "label": 0
                },
                {
                    "sent": "Why can you figure this out with these massive misspellings and Google camp?",
                    "label": 0
                },
                {
                    "sent": "Well, it's because to you.",
                    "label": 0
                },
                {
                    "sent": "These words aren't just frequently occurring clusters of letters, they actually have meaning, and they fit together into a sentence which expresses a larger chunk of meaning.",
                    "label": 0
                },
                {
                    "sent": "I thought another way to see the role of this higher level structure.",
                    "label": 0
                },
                {
                    "sent": "The fact that language encodes thoughts right is to say, take the very same words but just mix them.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So same words, but they're just reordered and, well, we haven't done a rigorous controlled experiment here.",
                    "label": 0
                },
                {
                    "sent": "Maybe just trust me, it's a lot harder to read this.",
                    "label": 0
                },
                {
                    "sent": "I mean, even though you've already seen this, but you still have to kind of figure out each word piece by piece, because you can't use the larger structures of semantics.",
                    "label": 0
                },
                {
                    "sent": "The underlying meaning of the font that this is expressing, as well as the syntax, the rules about how words go together in a linear sequence to produce a complex meaning.",
                    "label": 0
                },
                {
                    "sent": "And I think this helps to show you why we need.",
                    "label": 0
                },
                {
                    "sent": "If we're going, you know we we want to apply statistical approaches to understanding parsing and language learning, but they need to be sensitive to a lot more than current natural language processing approaches are.",
                    "label": 0
                },
                {
                    "sent": "They need to be sensitive to the structure of syntax and they need to be struck sensitive to meaning.",
                    "label": 0
                },
                {
                    "sent": "Sure, why not?",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Well, sure, that's what Shannon said.",
                    "label": 0
                },
                {
                    "sent": "I mean, a lot of what what generated the early controversy about statistics and language with Chomsky was, I take it reading Shannon's first paper, information theory, in which he showed how much you could do really cool stuff you could do with, you know, just engrams 4 grams, right?",
                    "label": 0
                },
                {
                    "sent": "I mean everybody.",
                    "label": 0
                },
                {
                    "sent": "If you haven't read Shannon's classic paper on information there you go back and read it.",
                    "label": 0
                },
                {
                    "sent": "He basically introduced that idea.",
                    "label": 0
                },
                {
                    "sent": "Now he didn't have the massive data that Google had, but I think everybody would have agreed.",
                    "label": 0
                },
                {
                    "sent": "Yeah, if you had all the data in the world as we now have.",
                    "label": 0
                },
                {
                    "sent": "But it could work.",
                    "label": 0
                },
                {
                    "sent": "Are you arguing that this fundamental difference between?",
                    "label": 0
                },
                {
                    "sent": "Yes, I'm arguing that the basic technology of of information theory and finding clusters that has been with us and underlies a lot of machine learning.",
                    "label": 0
                },
                {
                    "sent": "Since Shannon can solve this problem, but that is not enough to solve this problem because it doesn't capture meaning, and it doesn't capture the rules by which meaning is projected into linear sequences of words that would be syntax, semantics and syntax, and it's not to say that statistics and information theory relevant is that we need, as I think Nick was suggesting we need to understand how those ideas.",
                    "label": 0
                },
                {
                    "sent": "For learning and inference, operate over the kinds of representations of meaning and syntactic structure that linguists have proposed an.",
                    "label": 0
                },
                {
                    "sent": "I think Google would agree.",
                    "label": 0
                },
                {
                    "sent": "That's why they're not really trying to solve this problem, and that's why they kind of laugh off startups which claim to threaten them.",
                    "label": 0
                },
                {
                    "sent": "Like, for example, Powerset was a hot start up in the Internet world for a little while, saying we're going to use actual syntax from natural language processing, and we're going to be Google at natural language Search and Google just said haha to them right.",
                    "label": 0
                },
                {
                    "sent": "And then I think Microsoft bought them for somewhat in that business is a paltry sum of.",
                    "label": 0
                },
                {
                    "sent": "100 million or something WHI?",
                    "label": 0
                },
                {
                    "sent": "Well because Google said we just don't have the technology yet to solve that problem.",
                    "label": 0
                },
                {
                    "sent": "So we're not.",
                    "label": 0
                },
                {
                    "sent": "We're not even going to try to do that.",
                    "label": 0
                },
                {
                    "sent": "We're going to solve the problems that we know how to do.",
                    "label": 0
                },
                {
                    "sent": "The ones that we're good at.",
                    "label": 0
                },
                {
                    "sent": "I would say we don't have the.",
                    "label": 0
                },
                {
                    "sent": "We don't have the technology to solve it in the way Google wants to solve it, which is you know, very high accuracy, instantaneous across the entire world.",
                    "label": 0
                },
                {
                    "sent": "But for me why I'm excited about this coming together?",
                    "label": 0
                },
                {
                    "sent": "Again of these fields is that I do think we have at least the kinds of ideas and I want to try to just sketch out those things.",
                    "label": 0
                },
                {
                    "sent": "It's just.",
                    "label": 0
                },
                {
                    "sent": "It's much.",
                    "label": 0
                },
                {
                    "sent": "It's not.",
                    "label": 0
                },
                {
                    "sent": "It's not a.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cool level engineering challenge.",
                    "label": 0
                },
                {
                    "sent": "It's more of a basic scientific research and reverse engineering challenge.",
                    "label": 0
                },
                {
                    "sent": "There are of course many other inductive problems in language, and a big focus, which I won't say much more about now, but we'll definitely see this later on this acquisition, so there's not just using your knowledge of language to parse a sentence, but learning your knowledge of language.",
                    "label": 0
                },
                {
                    "sent": "How do you learn the rules of syntax?",
                    "label": 0
                },
                {
                    "sent": "Well, that's another place where there's long, long been study of how the mind goes beyond the data that's given and move here a lot about that.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One last set of examples.",
                    "label": 0
                },
                {
                    "sent": "Which I'll start off with thinking from science and then moved to children's cognitive development.",
                    "label": 0
                },
                {
                    "sent": "The problem of representing and constructing a theory of the world.",
                    "label": 0
                },
                {
                    "sent": "So think about what might be the greatest moments of human learning.",
                    "label": 0
                },
                {
                    "sent": "Greatest accomplishments when scientists or whatever you want to call them natural philosophers or just plain old philosophers, have come to fundamentally new and fundamentally more correct insights about how the world works by in some sense looking at data or observations.",
                    "label": 0
                },
                {
                    "sent": "So how did Darwin come to his theory of natural selection?",
                    "label": 0
                },
                {
                    "sent": "By looking at the finches on Galapagos?",
                    "label": 0
                },
                {
                    "sent": "Or how did Newton come to his universal law?",
                    "label": 0
                },
                {
                    "sent": "Gravitation by looking at the orbits of the planets and maybe some data about the moon and maybe a few apples.",
                    "label": 0
                },
                {
                    "sent": "How did Mendel glimpse the basics of genetics in his experiments with pea pods?",
                    "label": 0
                },
                {
                    "sent": "Was it based on finding clusters or correlations in masses of high dimensional data?",
                    "label": 0
                },
                {
                    "sent": "It doesn't seem like it right?",
                    "label": 0
                },
                {
                    "sent": "It was based on finding some kind of a causal model.",
                    "label": 0
                },
                {
                    "sent": "Positing something about the underlying, but unseen causal structure of the world and then see and then comparing different kinds of causal theories and seeing which seems to best explain the data.",
                    "label": 0
                },
                {
                    "sent": "Another way to think of it is to pose.",
                    "label": 0
                },
                {
                    "sent": "This challenge is to go back to what I think Nick was talking about.",
                    "label": 0
                },
                {
                    "sent": "A fundamental challenge for any kind of associational learning Association is learning or statistical learning is.",
                    "label": 0
                },
                {
                    "sent": "If you like the discovery of new concepts or new dimensions over which the statistics or the associations have to be computed.",
                    "label": 0
                },
                {
                    "sent": "So when we're talking about doing dimensionality reduction or fitting surface to high dimensional data were given, the input to bench and then all we have to do is find the structure, the laws, the constraints in that given space, whereas here.",
                    "label": 0
                },
                {
                    "sent": "If you think about these problems, let's say Newton or Mendel, the basic concepts, the basic representational units over which the laws are expressed didn't exist before the theory.",
                    "label": 0
                },
                {
                    "sent": "So in Newtons laws here the notion of force and the notion of mass didn't exist.",
                    "label": 0
                },
                {
                    "sent": "We could feel weight, but Newton redefined or really introduced the concept of mass in a way that didn't really exist, and Newtonian forces are these funny things which, though I was a physics major in undergrad, I don't think I ever really mastered right?",
                    "label": 0
                },
                {
                    "sent": "These forces, which when this thing is sitting here it's exerting a force on the table and the table is exerting a force back on it.",
                    "label": 0
                },
                {
                    "sent": "What's that?",
                    "label": 0
                },
                {
                    "sent": "Well, that you know that we may not into it that that's the notion that technical notion.",
                    "label": 0
                },
                {
                    "sent": "Of course you need for Newtonian mechanics to make sense or take Mendel's genetics, right concepts like gene or allele recessive or dominant.",
                    "label": 0
                },
                {
                    "sent": "Those are the concepts in which the laws of genetics are expressed.",
                    "label": 0
                },
                {
                    "sent": "The laws which say, well, you inherit two genes or two copies of each gene from one each from your parent and the dominant dominant one will take precedence over the other.",
                    "label": 0
                },
                {
                    "sent": "Only if both are recessive do you see the recessive trait express and that sort of thing so.",
                    "label": 0
                },
                {
                    "sent": "Those are also, of course, statistical laws, because there are probability distributions.",
                    "label": 0
                },
                {
                    "sent": "The basic simple model is you're equally likely to get each each of the two copies from either parent, and by defining these simple statistical laws over these UN invisible and just kind of completely unwarranted, but turns out somewhat correct concepts, he was able to explain the statistical data that he saw in his experiments.",
                    "label": 0
                },
                {
                    "sent": "And you know, though, we now know the picture is much more complicated than that by doing statistical inference over some kind of rich representations, inventing some new abstract concepts.",
                    "label": 0
                },
                {
                    "sent": "To support those statistics, he was able to move us fundamentally forward, so we need to be able to face that challenge, and I would argue, and there's a long history of research in cognitive development showing that any child, while maybe isn't Mendel or Darwin or Newton, makes similar in some ways even more impressive discoveries just impressive, because they're done mostly intuitively, maybe largely unconsciously.",
                    "label": 0
                },
                {
                    "sent": "And when you're very young.",
                    "label": 0
                },
                {
                    "sent": "So we can think of.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Intuitive theories these are like scientific theories, their abstract systems of knowledge that you use to interpret your experience and they they govern the same kinds of domains that scientific theories have looked at.",
                    "label": 0
                },
                {
                    "sent": "We can talk about intuitive physics, just as we might talk about, say, intuitive biology.",
                    "label": 0
                },
                {
                    "sent": "And our intuitive physics is remarkably powerful, right?",
                    "label": 0
                },
                {
                    "sent": "So we can look at things like like this, and this is just a few examples of stability and support, right?",
                    "label": 0
                },
                {
                    "sent": "So we look at this table here, and that one looks fairly stable, like if you had to set down your laptop somewhere, that might be OK, but if you had to sit down your laptop and this was the only thing around you, probably think twice and move on, right?",
                    "label": 0
                },
                {
                    "sent": "Or we can look at these configurations of blocks and just in an instant grasp the stability or potential points of instability, right?",
                    "label": 0
                },
                {
                    "sent": "Like where is this one most unstable?",
                    "label": 0
                },
                {
                    "sent": "Well, this doesn't look good.",
                    "label": 0
                },
                {
                    "sent": "This looks like it's going to fall over.",
                    "label": 0
                },
                {
                    "sent": "This thing over here looks relatively stable.",
                    "label": 0
                },
                {
                    "sent": "This block here that's resting straight on the ground very stable.",
                    "label": 0
                },
                {
                    "sent": "So how do we make those kinds of judgments?",
                    "label": 0
                },
                {
                    "sent": "You know, if you ask a physicist to solve that problem, they could solve that problem using the laws of Newtonian mechanics.",
                    "label": 0
                },
                {
                    "sent": "They could solve it more accurately, but it would take a long time.",
                    "label": 0
                },
                {
                    "sent": "They have to run a complex simulation probably.",
                    "label": 0
                },
                {
                    "sent": "I don't think you could solve it analytically using just our standard mathematical tools, but the mind is doing some approximate version of that.",
                    "label": 0
                },
                {
                    "sent": "Or here's another example.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's at 4 Pictures of Coke cans, and in each one we look at this and our mind does some kind of causal analysis.",
                    "label": 0
                },
                {
                    "sent": "It infers something about the processes that gave rise to this data, right?",
                    "label": 0
                },
                {
                    "sent": "How these things were smashed or quashed or whatever.",
                    "label": 0
                },
                {
                    "sent": "You just sort of read off the physical history of these objects.",
                    "label": 0
                },
                {
                    "sent": "Here's another example.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "These are I was going to say these are sort of parsing.",
                    "label": 0
                },
                {
                    "sent": "If you like the there's, there's a close analogy, or at least a fertile analogy between the concepts in language and the concepts.",
                    "label": 0
                },
                {
                    "sent": "Intuitive theory is actually in one of his first papers.",
                    "label": 1
                },
                {
                    "sent": "Chomsky introduced that analogy by saying that the grammar of a language is like a theory which you use to interpret data, and at that time, although that's not what Chomsky and most linguists think.",
                    "label": 0
                },
                {
                    "sent": "Now, though maybe they should.",
                    "label": 0
                },
                {
                    "sent": "But anyway, at that time language acquisition, grammar induction was thought of as being something like the child constructing a theory of the language.",
                    "label": 0
                },
                {
                    "sent": "Well here we have the same kind of thing.",
                    "label": 0
                },
                {
                    "sent": "What I just showed you when you diagnose these support relations or when you infer the causal history object the coat can.",
                    "label": 1
                },
                {
                    "sent": "It's A kind of parsing.",
                    "label": 0
                },
                {
                    "sent": "You're using your abstract knowledge of how physical principles work to take this one particular case and infer the right causal structure that's going on there.",
                    "label": 0
                },
                {
                    "sent": "But of course, there's also an acquisition problem which is building the theory in the 1st place, and there's a very interesting research about how children's intuitive physics develops.",
                    "label": 0
                },
                {
                    "sent": "What it starts off with, just like Chris was saying earlier in the morning.",
                    "label": 0
                },
                {
                    "sent": "There is evidence for some interesting kinds of innate knowledge.",
                    "label": 1
                },
                {
                    "sent": "If you like innate representations, at least things like the idea of an object in some form.",
                    "label": 0
                },
                {
                    "sent": "It has been argued to be present as early as you can look, say, three by three months old.",
                    "label": 0
                },
                {
                    "sent": "But those basic physical concepts get articulated and richton very, very interesting ways over just the first few years of cognitive development.",
                    "label": 0
                },
                {
                    "sent": "So that's there's a lot of data that you can study there, and there's a very interesting learning problem.",
                    "label": 0
                },
                {
                    "sent": "How the child builds up that intuitive theory of physics, just like you can say, how does a child build there?",
                    "label": 0
                },
                {
                    "sent": "Intuitive theory of language.",
                    "label": 0
                },
                {
                    "sent": "If you like just a couple of neat demos for one other domain of into a.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Theorizing here.",
                    "label": 0
                },
                {
                    "sent": "So let's just look at these animations.",
                    "label": 0
                },
                {
                    "sent": "What do we see there?",
                    "label": 0
                },
                {
                    "sent": "Yep, volunteers.",
                    "label": 0
                },
                {
                    "sent": "The red balls trying to escape the blue one.",
                    "label": 0
                },
                {
                    "sent": "Anyone else have another interpretation?",
                    "label": 0
                },
                {
                    "sent": "Yeah, somebody said the blue one is chasing the red one.",
                    "label": 0
                },
                {
                    "sent": "Yeah, well both.",
                    "label": 0
                },
                {
                    "sent": "They kind of go together.",
                    "label": 0
                },
                {
                    "sent": "You can't really try to escape unless somebody's chasing you, right?",
                    "label": 0
                },
                {
                    "sent": "Yeah, the blue 1 looks like he's trying to follow.",
                    "label": 0
                },
                {
                    "sent": "He's not very good at it, right?",
                    "label": 0
                },
                {
                    "sent": "It's like he doesn't quite realize that he can't fit through those holes, so he keeps kind of going there and going around.",
                    "label": 0
                },
                {
                    "sent": "Or maybe he doesn't fully anticipate where the red ball is.",
                    "label": 0
                },
                {
                    "sent": "Very elegant, this is from work by children, Southgate, and very elegant series of studies show that even young infants can perceive that they don't just see it as balls moving around on a plane.",
                    "label": 0
                },
                {
                    "sent": "They see it as they give a psychological interpretation.",
                    "label": 0
                },
                {
                    "sent": "These are not balls, their agents.",
                    "label": 0
                },
                {
                    "sent": "They have goals and one is trying to catch or chase the other and the other one is trying to run away and for reasons of time.",
                    "label": 0
                },
                {
                    "sent": "I'm not exactly sure, but I'm sure I'm running behind on what I want to cover.",
                    "label": 0
                },
                {
                    "sent": "Don't go into the experimental evidence for how they know that, but I'm happy to talk about that.",
                    "label": 0
                },
                {
                    "sent": "It's really neat set of experiments.",
                    "label": 0
                },
                {
                    "sent": "Here's here's another example, just to show you how rich these things can get.",
                    "label": 0
                },
                {
                    "sent": "This is from a classic movie by Hydran symbol, 2 social psychologists.",
                    "label": 0
                },
                {
                    "sent": "I think from the 1940s, so it's low quality animation.",
                    "label": 0
                },
                {
                    "sent": "So do you see two triangles in a circle here or something more interesting?",
                    "label": 0
                },
                {
                    "sent": "So what do we see here?",
                    "label": 0
                },
                {
                    "sent": "Well, it's kind of a nice rendering.",
                    "label": 0
                },
                {
                    "sent": "This is this is this quote roughly from something Chris said earlier.",
                    "label": 0
                },
                {
                    "sent": "Like if you have a mate and there's a rival go impact that rival right?",
                    "label": 1
                },
                {
                    "sent": "It seems that that kind of inference that or that those kind of schemas about social interaction are very, very basic to our minds.",
                    "label": 0
                },
                {
                    "sent": "I'm not saying they're necessarily innate, but there's evidence for this kind of thing even.",
                    "label": 0
                },
                {
                    "sent": "Very early for young children and you just can't help but seeing in these motions of these very simple shapes.",
                    "label": 0
                },
                {
                    "sent": "Very high level social interpretations and psychological interpretations.",
                    "label": 0
                },
                {
                    "sent": "There's the big one wants to chase that one out, or he's trying to scare him away.",
                    "label": 0
                },
                {
                    "sent": "All sorts of stuff.",
                    "label": 0
                },
                {
                    "sent": "The movies is somewhat longer than this, and even more fun, but I don't have time to show you the whole thing, so we want to understand what's the knowledge that takes these very, very simple stimuli and go so far beyond what you can see there, right?",
                    "label": 0
                },
                {
                    "sent": "Think about the data here.",
                    "label": 0
                },
                {
                    "sent": "In some sense we know what's the low dimensional manifold to take to go back to say the way Neil was putting it.",
                    "label": 0
                },
                {
                    "sent": "Well, in each case you have some shapes that are moving in a plane, right?",
                    "label": 0
                },
                {
                    "sent": "And they're just these shapes, they're just these point like these entities, so you know what is it.",
                    "label": 0
                },
                {
                    "sent": "2 two degrees of freedom to specify their position and 3rd one if they can rotate like these guys.",
                    "label": 0
                },
                {
                    "sent": "Or maybe you want to add in velocities very low dimensional in some sense, but look at the high level semantic interpretation we put on it.",
                    "label": 0
                },
                {
                    "sent": "So what's the knowledge that supports that?",
                    "label": 0
                },
                {
                    "sent": "Well, it's something like an intuitive.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Theory of psychology, and here we use that to parse these displays by inferring these again hidden properties.",
                    "label": 0
                },
                {
                    "sent": "Just like there you know we parse the physical displays by inferring distributions of mass and so on, and support relations here the hidden properties are beliefs, desires, plans.",
                    "label": 1
                },
                {
                    "sent": "If you like this, one wants this.",
                    "label": 0
                },
                {
                    "sent": "He believes this has this goal.",
                    "label": 0
                },
                {
                    "sent": "Those are the hidden causes that cause behavior.",
                    "label": 0
                },
                {
                    "sent": "And what we do in intuitive psychologists, we work backwards from observed dynamic behavior.",
                    "label": 0
                },
                {
                    "sent": "To figure out those hidden causes.",
                    "label": 0
                },
                {
                    "sent": "And again, there's an acquisition problem and a very long history, very rich set of phenomena.",
                    "label": 0
                },
                {
                    "sent": "About how children build up successive and successively better versions of intuitive psychology.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that's that's the big problem of cognitive science from my point of view.",
                    "label": 1
                },
                {
                    "sent": "How do we solve these problems?",
                    "label": 0
                },
                {
                    "sent": "And I want to talk a little bit about how machine learning can help here.",
                    "label": 1
                },
                {
                    "sent": "I though I started off by saying, you know, there are classic paradigms of statistical learning.",
                    "label": 0
                },
                {
                    "sent": "I don't think are able to support this.",
                    "label": 0
                },
                {
                    "sent": "These kinds of computations I do think again that there are certain things that are very right and very deep about those paradigms and what makes the field exciting right now is that people are starting to figure out how to take these ideas of statistical inference and learning and combine them with other computational ideas that might be able to solve these problems.",
                    "label": 0
                },
                {
                    "sent": "And we, in cognitive science are trying to do that along with people in AI machine learning, and that synergy between those two fields is driving both of them forward.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here's a way to to start to make progress.",
                    "label": 0
                },
                {
                    "sent": "Let's tease out a number of questions that were interested in.",
                    "label": 0
                },
                {
                    "sent": "These are all related.",
                    "label": 0
                },
                {
                    "sent": "They're all versions of this or aspects of this question about our minds get so much from so little.",
                    "label": 0
                },
                {
                    "sent": "They're all basic questions of knowledge and the interaction between knowledge and processes of learning and inference.",
                    "label": 0
                },
                {
                    "sent": "So the most basic question is how does some abstract background knowledge of the world guide these inferences from sparse data?",
                    "label": 1
                },
                {
                    "sent": "What are the forms and contents of knowledge in these different domains and tasks that support all these different things?",
                    "label": 1
                },
                {
                    "sent": "Here?",
                    "label": 0
                },
                {
                    "sent": "How is this knowledge itself acquired?",
                    "label": 0
                },
                {
                    "sent": "During experience, so when we talk about parsing right?",
                    "label": 0
                },
                {
                    "sent": "Whether it's parsing language or parsing a set of physical objects or parsing, those animate displays were talking about using knowledge to make inferences about things that are out there, but then we can ask the acquisition problem.",
                    "label": 0
                },
                {
                    "sent": "How does a child build up that that abstract knowledge?",
                    "label": 0
                },
                {
                    "sent": "How if we're talking about learning the knowledge that if you like, supports subsequent learning, right?",
                    "label": 0
                },
                {
                    "sent": "This is what has sometimes been called learning to learn both in psychology and in machine learning, where you're talking about acquiring knowledge at different levels of abstraction over very different time scales, right?",
                    "label": 0
                },
                {
                    "sent": "The knowledge that supports, say, learning that this is a heavy object, and this is a light object, but based on how they balance the knowledge of intuitive physics might be built up over years, though it might then support learning very quickly about this new thing.",
                    "label": 0
                },
                {
                    "sent": "Or like take the problem of.",
                    "label": 0
                },
                {
                    "sent": "Learning those two fits right?",
                    "label": 0
                },
                {
                    "sent": "So there we would say you learned this new concept.",
                    "label": 0
                },
                {
                    "sent": "You learn what if was from just a few examples, but there was some more abstract background knowledge about what objects are like and what words do.",
                    "label": 0
                },
                {
                    "sent": "What kinds of sets of objects words can label that again builds up over years.",
                    "label": 0
                },
                {
                    "sent": "And if you're talking about learning over very long timescales, then there are certain fundamental challenges that you have to face.",
                    "label": 0
                },
                {
                    "sent": "And again, these have been elucidated in both early machine learning as well as in cognitive development.",
                    "label": 0
                },
                {
                    "sent": "So Piaget, who was the founder of the modern study of cognitive development.",
                    "label": 0
                },
                {
                    "sent": "Talked about what he called the problem of assimilation and accommodation.",
                    "label": 0
                },
                {
                    "sent": "How does a child, when faced with new data over their life and they're always going to be seeing things that are somehow surprising to them?",
                    "label": 0
                },
                {
                    "sent": "How do they adjust the fit between what's in their head and their surprising experience?",
                    "label": 0
                },
                {
                    "sent": "You have two basic choices.",
                    "label": 0
                },
                {
                    "sent": "You can either take that surprising date and say no, that can't be kind of, ignore it, or somehow try to assimilate it into your scheme.",
                    "label": 0
                },
                {
                    "sent": "Explained it away somehow, or you could accommodate.",
                    "label": 0
                },
                {
                    "sent": "You could say, well, I'm actually going to.",
                    "label": 0
                },
                {
                    "sent": "Change my view of the world.",
                    "label": 0
                },
                {
                    "sent": "I'm going to enrich my theory and in machine learning.",
                    "label": 0
                },
                {
                    "sent": "Various people.",
                    "label": 0
                },
                {
                    "sent": "You know whether you're talking about Occam's Razor or Bayesian Occam's razor, or for example in the neural network tradition, Steve Grossberg talked about what he called the Stability plasticity dilemma.",
                    "label": 0
                },
                {
                    "sent": "Any adaptive system has this same problem.",
                    "label": 0
                },
                {
                    "sent": "You always have a model of a certain amount of complexity, and there's a basic problem of adjusting the complexity of the model and it fit to the data, and you always have to be worried about overfitting, where if you try to fit a model that's overly complex to a relatively small amount of data.",
                    "label": 0
                },
                {
                    "sent": "You'll overfit and you won't generalize well and generalization successful.",
                    "label": 0
                },
                {
                    "sent": "Generalization is all about adjusting that balance.",
                    "label": 0
                }
            ]
        }
    }
}