{
    "id": "jubjen672rimws54vq77zlv462uxb5vo",
    "title": "Trends in cloud-computing adoption is South-Eastern European region",
    "info": {
        "author": [
            "Sven Marušić, InfoCumulus d.o.o."
        ],
        "published": "Nov. 16, 2012",
        "recorded": "October 2012",
        "category": [
            "Top->Computers->Software"
        ]
    },
    "url": "http://videolectures.net/classconference2012_marusic_region/",
    "segmentation": [
        [
            "For the end of the day, we're going to have bit lighter discussion in terms of of the content.",
            "For for at least my initial overview of cloud computing in the region.",
            "So I'm spend my roof, which has already introduced by by boat.",
            "I set up independent business consulting company from 2 1/2 years ago.",
            "Before that I was employed in Croatian Telecom, actually managing it for T-Mobile and T. Com in Croatia.",
            "So I figured out there was a really big shift going on in the IT industry and I started Cloud Consulting Company helping telcos primarily in the region to develop their cloud offerings, and one of the first well statements I want to make today after after this experience is basically we are in complete dark in terms of statistical data regarding the cloud usage in the region.",
            "So I came up with this Dilbert because this is the way we talk about, you know.",
            "Quantifiable evidence that something is happening in the region, and I'm going to tell you why, so IDC is the only company, at least as far as I know.",
            "That did some serious market research in our region regarding the cloud computing.",
            "And they did that research in a way they try to survey the legacy ID services and how they are doing that is basically calling the IT companies and asking them how much did you sell last year.",
            "So when they are researching the cloud, they're basically doing the same thing asking companies how much did you sell the problem with the cloud is a different thing.",
            "It's a global phenomenon, and that the fact that it's global is actually.",
            "Hurting us and giving us some opportunities and we're going to discuss those briefly as we move on."
        ],
        [
            "The shift in the industry is actually fundamental in terms of business model.",
            "So with the cloud computing where a lot closer to the telecommunications business model rather than the legacy T, you know legacy ID approach.",
            "We would build the, let's say perception of the value of our solution for the end customer.",
            "When that perception of value reaches level high enough to justify the cost of the investment, then the transaction happens.",
            "And this is all that was one regular salesperson in IT focused on how to build the perception of value about the solution or service we are.",
            "We're selling now in the cloud computing era.",
            "Actually, our customers are every month making this decision every month.",
            "They are deciding to remain with us every month.",
            "We have to convince them that it still makes sense to remain with us.",
            "With as a provider.",
            "Obviously we can have a contractual obligations.",
            "We have minimal contract durations.",
            "We give some discounts if they commit for longer periods and so on, but fundamentally this is the relationship rather than transaction says it was as it was before.",
            "If we look at it from the Financial perspective.",
            "Then we're basically merging two completely different industries.",
            "We're merging the IT industry, which you can see on the lower left.",
            "Side of the diagram, which is basically low."
        ],
        [
            "Barrier industry meaning that whomever learned how to code or finished University on electrical engineering can actually set up an IT company.",
            "They can develop an application in next two or three months and they can start selling their applications to the neighbor who is selling whatever shoes.",
            "On the other side of the spectrum of telecommunications companies, extremely high entry barriers and extremely high returns.",
            "So when talking about telecommunications, not everybody can build the access network and start charging for the telco services and therefore we have the oligopoly situations in the markets.",
            "Therefore, we have couple of telco operators and extremely fragmented IT industry.",
            "On the other side, telcos operating at 40 or 45 even 50%, a bit of margins and IT companies operating at 5 to 10%.",
            "Profitability depending on whether they are in hardware running or in services, services, business, so ICT or cloud is somewhere in between.",
            "You have to invest up front in developing solutions for unknown customers in developing your infrastructure in order to be able to get some higher returns later on.",
            "So we are we are in the middle also we are in the middle in terms of these two industries merging together that IT guys do see telcos as a channel for distributing their solutions and telco CIT industry.",
            "Today as a new content for, let's say lacking revenues, they are they are struggling with in in the legacy telecommunications business.",
            "In terms of what's happening in traditional lighting."
        ],
        [
            "Three, I would say that the following phenomenon is something that I really like a lot.",
            "That software as a service is changing the way we are thinking on on IT.",
            "Today you had a whole system integrator niche so far, which is focused on, you know, deploying solutions that are specific to the needs of particular client and every client.",
            "When the consultant would visit them they would say, well, you know we are special case you know and you know that you heard this statement.",
            "And the system integrator would say obviously are special.",
            "Therefore, we're going to make a six month functional requirements analysis with you and the next year or so we're going to customize the ASAP system you so you won't recognize it afterwards, but it will be your specific ASAP system, and the more specific you are actually, the longer the this.",
            "Consulting phase is actually the bigger the profits for the system integrators are now.",
            "Whoever wants to enjoy the benefits of the cloud is actually making a following trade off.",
            "They are accepting the software the way it is.",
            "Of course you can do some customizations and this is the idea, but it's not the operator that is going to charge you for the for these customizations.",
            "So what people are saying today is actually the software is standard and we're going to adopt our business process to fit exactly the software as it is today.",
            "And that's why I call it a nerd power.",
            "This is the first time that it is dictating how things are developing on the business side.",
            "So far it was the other way around.",
            "It was kind of a service to everybody else in the company starting from accounting to, you know, to the door openers in the in the lobby of the building.",
            "So so there is a big thing going on in the system integrator business and the whole business model is under threat with.",
            "Computing and this is also true for our region.",
            "They're trying to reinvent their business models, and they're trying to migrate to more profitable areas, for example, to being business process management experts trying to help their clients to adopt different cloud solutions to their particular need.",
            "Trying to help their clients to re engineer their processes in order so they can use actually the cloud solutions, which are standard.",
            "And finally, customers do like more music for less money, which means that as soon as they would start realizing the benefits from the cloud, they would be willing to forget about privacy security.",
            "All these issues that we today see as inhibitors for the cloud.",
            "You know, there is a special in this region.",
            "There is a while this concept of having my data in my own control, which means that you have the server under the table and today the customers are realizing basically that the servers in.",
            "In a data center which is professionally managed or is probably more secure than data under the table which they have under their own control in the in the office.",
            "And what are we doing is as the region in."
        ],
        [
            "In this respect and now maybe, maybe we can.",
            "But this deal Burton as as the answer to this question.",
            "So we are talking a lot, that's for sure, so at least 90% of the conferences were having the the main topic you know is the cloud computing in the last couple of couple of years.",
            "Of course this is this is a joke, but one another phenomenon which I want to discuss today is actually the phenomenon of private cloud, and I would argue that everything we do in the area of private cloud is not a cloud at all, so it just has the name private cloud and I think it's the perfect match for the IT managers who are asked by their board members or the presidents of the world.",
            "So there is this cloud computing going on.",
            "What are we doing with regards to that?",
            "And the answer probably goes.",
            "We have our own cloud.",
            "Why would we use the cloud services?",
            "We have our own cloud.",
            "So the public, well, the private cloud story is all about automating the existing IT environment, and it's actually the virtualization plus automated provisioning.",
            "And end of the day.",
            "I'm not sure if it's even fair to call this a cloud computing.",
            "It's basically just how to improve the existing ID, but with more when we did virtualization 10 years ago is not a new thing, so we only gave a new name to basically what I industry is doing today and we gave a great excuse for the managers not to do anything with regards to with regards to cloud.",
            "Even the IDC research which I had, the only one which I had was basically the one for Croatia for 2010 and it's not.",
            "Dramatically changed in this year and All in all the cloud revenues in Croatia is counted by the IDC.",
            "We're at about 1212 million euros, which means that these were the improvements in the data centers of existing legacy ID deployements.",
            "The remaining part of the public cloud kind of public cloud was the services sold by the big system integrators to the big cloud providers like.",
            "Creation telecom like you know Ericsson, who is doing some kind of private cloud hosting for the rest of the group and so on.",
            "So the actual public cloud revenue is counted by IDC is around 11 million euros.",
            "What the companies really reported that they've solved in the in the market?",
            "But the."
        ],
        [
            "It is that everybody has some kind of offering and I just looked through the websites of the telecommunications companies in the in the region and this is the Macedonian Telecom.",
            "This is the creation telecom.",
            "This is the telecom Serbia.",
            "This is the Deutsche Telekom.",
            "In this is the symbol here in Slovenia and finally even alternative operators.",
            "I took only example of Metro Net in creation.",
            "They're doing mainly some kind of sauce aggregator offerings.",
            "Basically being a application store for four different ice fees in the region that are seeing them as a as a distribution channel.",
            "Now let's talk about the segments."
        ],
        [
            "For awhile and mainly we can differentiate those three main groups, consumers, SMBs and enterprises.",
            "And Cloud was all about SMBs initially when it was well, first time going in 2008.",
            "We promised to the SMB is that with cloud computing they would be able to use the enterprise scale solutions for the price affordable to the SMB.",
            "So we will be in some sense, you know, remove the barriers for competition between the small guys in the big guys so the small guys could easily become big guys because they would be able to use the same technologies, or at least they will be able to accept the same technologies as the big companies have reserved for themselves the consumers.",
            "They are enjoying the cloud for free since the day one since the Internet was born, you know.",
            "So this cloud cloud term was coined in 2008.",
            "But actually, Salesforce.com was founded in 1998, and from the day one they never did anything but cloud.",
            "They didn't know that they are in the cloud business, but.",
            "This is the kind of old business model the SMBs well.",
            "It is it is a.",
            "Developing in the SMB segment, especially in also in our region, especially in United States where but in our region as well, and the SMB Czar are going through this mind shift in terms of privacy and security, they're starting to realize that the benefits are far greater than the risks related to the cloud.",
            "And for the enterprise customers.",
            "So this is the sweet spots.",
            "And they the sweet spot for the IT industry in any in any market.",
            "Enterprises want to reduce risk and if you look at this from the IT director perspective or the CTO, so technology director perspective in in any company what their job is.",
            "Their job is to spend the budget wisely, which means that they shouldn't make wrong investments, which means that they should have successful projects.",
            "The greater the investment is, the bigger the risk associated to it is.",
            "I think is kind of risky business and the way that clouds mitigates risks for those customers is actually the fact that it enables them to test some solutions before buying significant hardware resources or before buying licenses.",
            "Imagine a big CRM deployment and imagine the failure rates of CRM projects.",
            "All major analyst companies in the world are talking about 3040%.",
            "Failure rates on on a CRM implementations and here with clouds.",
            "Actually you can just try it by, you know paying for the for the test drive or using the licenses.",
            "Paying as you go without upfront investment in Siebel hardware and software deployment that you would have to do other other way around now.",
            "So this is probably what drives the enterprise is in this respect."
        ],
        [
            "But look at our company so this is the micro micro business and we are six consultants company.",
            "And this is how our cloud stack looks like.",
            "So basically this is our it.",
            "We don't use anything but this.",
            "We use Dropbox for file sharing and backup.",
            "So basically all our collaboration needs are kind of sold through Dropbox, hosted, exchange and messaging platform calendars on Rackspace.",
            "Zoho for CRM, an GoDaddy for the web hosting.",
            "All in all, this is at around 2002 thousand US dollars.",
            "The cloud spent of my own company.",
            "The question here is what remains in the local economy.",
            "What remains in the sea region?",
            "Not in Croatia, but in the in the region in general.",
            "From our side actually nothing.",
            "And this is the greatest challenge that cloud computing is bringing to this region.",
            "It's a global game.",
            "Unfortunately, we are losing in the global game.",
            "The cloud computing is all about economies of scale, nothing, nothing else.",
            "There was an idea.",
            "Let's bring as much as possible computing resources to single location, so the unitary price surprised per user per transaction per server, per virtual server, per whatever story.",
            "Megabytes of storage is actually cheaper.",
            "We are unfortunately not able to compete in this in this area, and I'm going to tell you tell you why is that."
        ],
        [
            "So we are bombarded with offerings, which are, you know, all over the all over the Internet.",
            "And I'm just putting some of the really kind of great and well known examples around here, and we don't have to go into a lot into lot details.",
            "Also, you have one very specific sort of companies here.",
            "You have companies that are acting both as cloud enablers and cloud providers.",
            "So the big technology vendors like HP like Microsoft like IBM like Oracle.",
            "They're all both selling cloud solutions to the third party, so the third parties could become the cloud service providers, and they're selling the cloud services directly.",
            "What they're doing with this approach, they're just managing carefully their transition to the cloud business.",
            "They're protecting their old business models while migrating gradually in kind of under controlled environment.",
            "Their customer base to the to the cloud business model.",
            "And they're still partnering with us with the IT industry.",
            "There are partnering with local telcos in order to in order to migrate their own customer base to the cloud.",
            "So on the local level, I think we can only come."
        ],
        [
            "Eat with economies of scope rather than economies of scale, which is basically saying that we shall be looking into more aggregator offerings in the region rather than specific niche solutions.",
            "When I say aggregater offerings, meaning that there would be be a company in Slovenia that is doing Slovenian specific accounting, Slovenian specific some kind of HR solutions, solutions that are dependent on the local legal requirements, solutions that are dependent on.",
            "Local language.",
            "And in that respect, in that respect, they when setting up the cloud infrastructure, we shall be looking into how to make every new service cheaper rather than how to make every new user cheaper from the operational perspective.",
            "From the cost perspective of the of the provider.",
            "And this is the only way we can actually differentiate.",
            "So how to offer more services so that each new service would be would be less expensive for for the provider?"
        ],
        [
            "Themselves and what it really means, and I gave one Slovenian example in one Rackspace example.",
            "So the yellow highlight is basically the price of SharePoint in the cloud.",
            "SharePoint Microsoft collaboration platform.",
            "On the rack space, if you buy a mailbox you get a share point for free as addition to the mailbox for $10 per month in Telekom Slovenia.",
            "I've seen this offering here.",
            "You cannot read this, but it says 19.95.",
            "19.95 euros.",
            "Per share point.",
            "So we may argue that the product is different that the specification do not fit and so on.",
            "But if you have the customer who is looking for a collaboration solution on the Internet.",
            "He is very likely that due to the Google Local settings he would browse probably this site and also this this side of the Rackspace and then he would compare you know.",
            "SharePoint is add on to the Mailbox or SharePoint as a standalone solution for 20 euros a month.",
            "So basically I."
        ],
        [
            "I would like to introduce a new segmentation for the cloud services and that segmentations is basically according to the understanding of IT.",
            "Benefits are the benefits of fighting industry.",
            "As such I say we have the companies or a big chunk of companies in our region especially do not understand that it helps the business at all.",
            "So it's not about cloud for them, it's about why I T at the 1st place.",
            "So whoever is selling the cloud solutions.",
            "Shouldn't be worrying about how to pitch the cloud against legacy ITR on Premise ID.",
            "We should be worrying on how to explain why I T at the first place.",
            "Not only this second group is actually the companies that do understand the benefits, but are still cost cautious that are doing the cost benchmarks that are trying to figure out the cheapest ways on how to enter into the solution.",
            "These are the companies that that would make sense for them to pitch some kind of regular cloud argumentation and finally have the customers that are already already lost that are already selling their cloud euros or dollars to the abroad to somebody outside."
        ],
        [
            "So to conclude, the story, especially in the countries in the region that are not yet in the EU, and it's basically the whole region but Slovenia, we do still have some kind of regulatory honeymoon in terms of.",
            "Customer data protection of being prohibited.",
            "To export the customer data outside of the of the country and this is the strong.",
            "This is a strong argument for building the local local clouds.",
            "I think there would be more and more consolidation of the localize the offerings, and probably the telcos just because of the marketing money they can spend our good channel for this to become the application aggregators application ISV solution aggregators.",
            "We are still very often in in what I call a restaurant economy.",
            "You know which is basically at most deals are made rather in the in the restaurants.",
            "Then in the offices.",
            "So in this type of relationship it's also important to have one on one relationship which we have the local, the local sales people an that means you know, smart alliances, how to use different different channels.",
            "And I gave an example of how to use banks, how to use the industrial chambers.",
            "So industrial Chamber of lawyers of.",
            "Public notaries are sewn are actually good channels for selling different kinds of solutions.",
            "We don't see a lot of freemium models.",
            "We are not really coping with pride.",
            "What's already there on the web we we rather like it.",
            "You know, as a standard sales process.",
            "So I think in the region we will see more freemium freemium models in the future and simplicity, especially for the telcos as a channel is something that's killing them in all.",
            "Simplicity doesn't exist in the telecommunications industry.",
            "But if they want to be really successful in the classroom, but if they want to lower their own risk, actually there should be more similar in a way they are approaching their customers, and in a way they're rolling out the new cloud cloud services.",
            "And finally, what we're selling infrastructure as a service.",
            "It's extremely tough sale if you're competing with Amazon with Rackspace with Terremark and those kind of companies they're operating on the economies of scale that we cannot even imagine on Amazon they're instantiating.",
            "1150 thousand virtual servers on the EC2 service per day.",
            "I'm not saying it's all new service being incrementally added because people are, you know, hibernating their their images, but restoring them.",
            "Again, this is the scale of scale of Amazon, and Amazon is not always the biggest one.",
            "There are months and months when Rackspace is actually creating more virtual servers than than Amazon on EC2.",
            "The platform as a service offerings provided by a local companies.",
            "I don't believe it makes any sense, so the core of the platform as a service is basically elasticity, which means almost indefinite resources, which means that we cannot achieve it here in this in this region.",
            "Finally, we have the software as a service as the last remaining resort for our cloud activities, and I believe that that's where the industry is going and this is where we can make a difference in the local economies because it's still local specific.",
            "This is the.",
            "This is a local offering.",
            "So for maybe a late."
        ],
        [
            "Your discussion I just leave these questions there, I don't.",
            "I ran over my time more or less but we will see a lot of discussion about cloud interoperability.",
            "I raised this question already about the private cloud.",
            "Then, is it fair to call it a cloud at all?",
            "The global competition is hurting us as much as it's giving us opportunities to go out and offer our services around the world.",
            "We're seeing big IT companies transforming themselves into different kind of companies, figuring out how to compete on this on this.",
            "Area we are seeing this phenomenon of global vendors that are both enablers and providers.",
            "And finally I see that is reinventing their role in the future.",
            "So I T directors have today 2 two ways on how to compete against the let's say, key account sales director who goes out to the Internet to thesalesforce.com and buys 10 accounts for sales force automation because he couldn't cannot wait.",
            "For the last five years, he's been waiting for a new CRM solution from his IT department.",
            "He's not getting anything, so he takes a credit cards.",
            "He buys 10 accounts on Salesforce an from tomorrow.",
            "Each of the sales person in his companies actually entering their opportunities in Salesforce.",
            "This is something that local ID directors are facing seeing and trying to fight with.",
            "That one approach would be to help those sales guys to betterusethesalesforce.com or try to integrate that into existing systems in the company.",
            "This is 1 approach and other approaches actually to go to the president of the Board and complain.",
            "And then the president comes out with a statement which says whomever buys an IT service outside from RIT Department wouldn't get refunded for the purchase he made.",
            "So as simple as that.",
            "So we'll see these two these two options in the future and I would say that you know the more successful ID directors would be the first first group of the of the people having said this."
        ],
        [
            "Thank you very much for and.",
            "I hope this is OK. Introduction for the remaining speakers.",
            "Thanks."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For the end of the day, we're going to have bit lighter discussion in terms of of the content.",
                    "label": 0
                },
                {
                    "sent": "For for at least my initial overview of cloud computing in the region.",
                    "label": 0
                },
                {
                    "sent": "So I'm spend my roof, which has already introduced by by boat.",
                    "label": 0
                },
                {
                    "sent": "I set up independent business consulting company from 2 1/2 years ago.",
                    "label": 0
                },
                {
                    "sent": "Before that I was employed in Croatian Telecom, actually managing it for T-Mobile and T. Com in Croatia.",
                    "label": 0
                },
                {
                    "sent": "So I figured out there was a really big shift going on in the IT industry and I started Cloud Consulting Company helping telcos primarily in the region to develop their cloud offerings, and one of the first well statements I want to make today after after this experience is basically we are in complete dark in terms of statistical data regarding the cloud usage in the region.",
                    "label": 0
                },
                {
                    "sent": "So I came up with this Dilbert because this is the way we talk about, you know.",
                    "label": 0
                },
                {
                    "sent": "Quantifiable evidence that something is happening in the region, and I'm going to tell you why, so IDC is the only company, at least as far as I know.",
                    "label": 0
                },
                {
                    "sent": "That did some serious market research in our region regarding the cloud computing.",
                    "label": 0
                },
                {
                    "sent": "And they did that research in a way they try to survey the legacy ID services and how they are doing that is basically calling the IT companies and asking them how much did you sell last year.",
                    "label": 0
                },
                {
                    "sent": "So when they are researching the cloud, they're basically doing the same thing asking companies how much did you sell the problem with the cloud is a different thing.",
                    "label": 0
                },
                {
                    "sent": "It's a global phenomenon, and that the fact that it's global is actually.",
                    "label": 0
                },
                {
                    "sent": "Hurting us and giving us some opportunities and we're going to discuss those briefly as we move on.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The shift in the industry is actually fundamental in terms of business model.",
                    "label": 0
                },
                {
                    "sent": "So with the cloud computing where a lot closer to the telecommunications business model rather than the legacy T, you know legacy ID approach.",
                    "label": 0
                },
                {
                    "sent": "We would build the, let's say perception of the value of our solution for the end customer.",
                    "label": 0
                },
                {
                    "sent": "When that perception of value reaches level high enough to justify the cost of the investment, then the transaction happens.",
                    "label": 0
                },
                {
                    "sent": "And this is all that was one regular salesperson in IT focused on how to build the perception of value about the solution or service we are.",
                    "label": 0
                },
                {
                    "sent": "We're selling now in the cloud computing era.",
                    "label": 0
                },
                {
                    "sent": "Actually, our customers are every month making this decision every month.",
                    "label": 0
                },
                {
                    "sent": "They are deciding to remain with us every month.",
                    "label": 0
                },
                {
                    "sent": "We have to convince them that it still makes sense to remain with us.",
                    "label": 0
                },
                {
                    "sent": "With as a provider.",
                    "label": 0
                },
                {
                    "sent": "Obviously we can have a contractual obligations.",
                    "label": 0
                },
                {
                    "sent": "We have minimal contract durations.",
                    "label": 0
                },
                {
                    "sent": "We give some discounts if they commit for longer periods and so on, but fundamentally this is the relationship rather than transaction says it was as it was before.",
                    "label": 0
                },
                {
                    "sent": "If we look at it from the Financial perspective.",
                    "label": 0
                },
                {
                    "sent": "Then we're basically merging two completely different industries.",
                    "label": 0
                },
                {
                    "sent": "We're merging the IT industry, which you can see on the lower left.",
                    "label": 0
                },
                {
                    "sent": "Side of the diagram, which is basically low.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Barrier industry meaning that whomever learned how to code or finished University on electrical engineering can actually set up an IT company.",
                    "label": 0
                },
                {
                    "sent": "They can develop an application in next two or three months and they can start selling their applications to the neighbor who is selling whatever shoes.",
                    "label": 0
                },
                {
                    "sent": "On the other side of the spectrum of telecommunications companies, extremely high entry barriers and extremely high returns.",
                    "label": 1
                },
                {
                    "sent": "So when talking about telecommunications, not everybody can build the access network and start charging for the telco services and therefore we have the oligopoly situations in the markets.",
                    "label": 1
                },
                {
                    "sent": "Therefore, we have couple of telco operators and extremely fragmented IT industry.",
                    "label": 1
                },
                {
                    "sent": "On the other side, telcos operating at 40 or 45 even 50%, a bit of margins and IT companies operating at 5 to 10%.",
                    "label": 0
                },
                {
                    "sent": "Profitability depending on whether they are in hardware running or in services, services, business, so ICT or cloud is somewhere in between.",
                    "label": 0
                },
                {
                    "sent": "You have to invest up front in developing solutions for unknown customers in developing your infrastructure in order to be able to get some higher returns later on.",
                    "label": 0
                },
                {
                    "sent": "So we are we are in the middle also we are in the middle in terms of these two industries merging together that IT guys do see telcos as a channel for distributing their solutions and telco CIT industry.",
                    "label": 0
                },
                {
                    "sent": "Today as a new content for, let's say lacking revenues, they are they are struggling with in in the legacy telecommunications business.",
                    "label": 0
                },
                {
                    "sent": "In terms of what's happening in traditional lighting.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Three, I would say that the following phenomenon is something that I really like a lot.",
                    "label": 0
                },
                {
                    "sent": "That software as a service is changing the way we are thinking on on IT.",
                    "label": 1
                },
                {
                    "sent": "Today you had a whole system integrator niche so far, which is focused on, you know, deploying solutions that are specific to the needs of particular client and every client.",
                    "label": 0
                },
                {
                    "sent": "When the consultant would visit them they would say, well, you know we are special case you know and you know that you heard this statement.",
                    "label": 0
                },
                {
                    "sent": "And the system integrator would say obviously are special.",
                    "label": 0
                },
                {
                    "sent": "Therefore, we're going to make a six month functional requirements analysis with you and the next year or so we're going to customize the ASAP system you so you won't recognize it afterwards, but it will be your specific ASAP system, and the more specific you are actually, the longer the this.",
                    "label": 0
                },
                {
                    "sent": "Consulting phase is actually the bigger the profits for the system integrators are now.",
                    "label": 0
                },
                {
                    "sent": "Whoever wants to enjoy the benefits of the cloud is actually making a following trade off.",
                    "label": 1
                },
                {
                    "sent": "They are accepting the software the way it is.",
                    "label": 0
                },
                {
                    "sent": "Of course you can do some customizations and this is the idea, but it's not the operator that is going to charge you for the for these customizations.",
                    "label": 0
                },
                {
                    "sent": "So what people are saying today is actually the software is standard and we're going to adopt our business process to fit exactly the software as it is today.",
                    "label": 0
                },
                {
                    "sent": "And that's why I call it a nerd power.",
                    "label": 0
                },
                {
                    "sent": "This is the first time that it is dictating how things are developing on the business side.",
                    "label": 0
                },
                {
                    "sent": "So far it was the other way around.",
                    "label": 0
                },
                {
                    "sent": "It was kind of a service to everybody else in the company starting from accounting to, you know, to the door openers in the in the lobby of the building.",
                    "label": 0
                },
                {
                    "sent": "So so there is a big thing going on in the system integrator business and the whole business model is under threat with.",
                    "label": 1
                },
                {
                    "sent": "Computing and this is also true for our region.",
                    "label": 1
                },
                {
                    "sent": "They're trying to reinvent their business models, and they're trying to migrate to more profitable areas, for example, to being business process management experts trying to help their clients to adopt different cloud solutions to their particular need.",
                    "label": 0
                },
                {
                    "sent": "Trying to help their clients to re engineer their processes in order so they can use actually the cloud solutions, which are standard.",
                    "label": 0
                },
                {
                    "sent": "And finally, customers do like more music for less money, which means that as soon as they would start realizing the benefits from the cloud, they would be willing to forget about privacy security.",
                    "label": 0
                },
                {
                    "sent": "All these issues that we today see as inhibitors for the cloud.",
                    "label": 0
                },
                {
                    "sent": "You know, there is a special in this region.",
                    "label": 0
                },
                {
                    "sent": "There is a while this concept of having my data in my own control, which means that you have the server under the table and today the customers are realizing basically that the servers in.",
                    "label": 0
                },
                {
                    "sent": "In a data center which is professionally managed or is probably more secure than data under the table which they have under their own control in the in the office.",
                    "label": 0
                },
                {
                    "sent": "And what are we doing is as the region in.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In this respect and now maybe, maybe we can.",
                    "label": 0
                },
                {
                    "sent": "But this deal Burton as as the answer to this question.",
                    "label": 0
                },
                {
                    "sent": "So we are talking a lot, that's for sure, so at least 90% of the conferences were having the the main topic you know is the cloud computing in the last couple of couple of years.",
                    "label": 0
                },
                {
                    "sent": "Of course this is this is a joke, but one another phenomenon which I want to discuss today is actually the phenomenon of private cloud, and I would argue that everything we do in the area of private cloud is not a cloud at all, so it just has the name private cloud and I think it's the perfect match for the IT managers who are asked by their board members or the presidents of the world.",
                    "label": 0
                },
                {
                    "sent": "So there is this cloud computing going on.",
                    "label": 0
                },
                {
                    "sent": "What are we doing with regards to that?",
                    "label": 1
                },
                {
                    "sent": "And the answer probably goes.",
                    "label": 0
                },
                {
                    "sent": "We have our own cloud.",
                    "label": 0
                },
                {
                    "sent": "Why would we use the cloud services?",
                    "label": 0
                },
                {
                    "sent": "We have our own cloud.",
                    "label": 0
                },
                {
                    "sent": "So the public, well, the private cloud story is all about automating the existing IT environment, and it's actually the virtualization plus automated provisioning.",
                    "label": 0
                },
                {
                    "sent": "And end of the day.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure if it's even fair to call this a cloud computing.",
                    "label": 0
                },
                {
                    "sent": "It's basically just how to improve the existing ID, but with more when we did virtualization 10 years ago is not a new thing, so we only gave a new name to basically what I industry is doing today and we gave a great excuse for the managers not to do anything with regards to with regards to cloud.",
                    "label": 0
                },
                {
                    "sent": "Even the IDC research which I had, the only one which I had was basically the one for Croatia for 2010 and it's not.",
                    "label": 0
                },
                {
                    "sent": "Dramatically changed in this year and All in all the cloud revenues in Croatia is counted by the IDC.",
                    "label": 0
                },
                {
                    "sent": "We're at about 1212 million euros, which means that these were the improvements in the data centers of existing legacy ID deployements.",
                    "label": 0
                },
                {
                    "sent": "The remaining part of the public cloud kind of public cloud was the services sold by the big system integrators to the big cloud providers like.",
                    "label": 0
                },
                {
                    "sent": "Creation telecom like you know Ericsson, who is doing some kind of private cloud hosting for the rest of the group and so on.",
                    "label": 0
                },
                {
                    "sent": "So the actual public cloud revenue is counted by IDC is around 11 million euros.",
                    "label": 0
                },
                {
                    "sent": "What the companies really reported that they've solved in the in the market?",
                    "label": 0
                },
                {
                    "sent": "But the.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It is that everybody has some kind of offering and I just looked through the websites of the telecommunications companies in the in the region and this is the Macedonian Telecom.",
                    "label": 0
                },
                {
                    "sent": "This is the creation telecom.",
                    "label": 0
                },
                {
                    "sent": "This is the telecom Serbia.",
                    "label": 0
                },
                {
                    "sent": "This is the Deutsche Telekom.",
                    "label": 0
                },
                {
                    "sent": "In this is the symbol here in Slovenia and finally even alternative operators.",
                    "label": 1
                },
                {
                    "sent": "I took only example of Metro Net in creation.",
                    "label": 0
                },
                {
                    "sent": "They're doing mainly some kind of sauce aggregator offerings.",
                    "label": 0
                },
                {
                    "sent": "Basically being a application store for four different ice fees in the region that are seeing them as a as a distribution channel.",
                    "label": 0
                },
                {
                    "sent": "Now let's talk about the segments.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For awhile and mainly we can differentiate those three main groups, consumers, SMBs and enterprises.",
                    "label": 0
                },
                {
                    "sent": "And Cloud was all about SMBs initially when it was well, first time going in 2008.",
                    "label": 0
                },
                {
                    "sent": "We promised to the SMB is that with cloud computing they would be able to use the enterprise scale solutions for the price affordable to the SMB.",
                    "label": 0
                },
                {
                    "sent": "So we will be in some sense, you know, remove the barriers for competition between the small guys in the big guys so the small guys could easily become big guys because they would be able to use the same technologies, or at least they will be able to accept the same technologies as the big companies have reserved for themselves the consumers.",
                    "label": 0
                },
                {
                    "sent": "They are enjoying the cloud for free since the day one since the Internet was born, you know.",
                    "label": 1
                },
                {
                    "sent": "So this cloud cloud term was coined in 2008.",
                    "label": 0
                },
                {
                    "sent": "But actually, Salesforce.com was founded in 1998, and from the day one they never did anything but cloud.",
                    "label": 0
                },
                {
                    "sent": "They didn't know that they are in the cloud business, but.",
                    "label": 1
                },
                {
                    "sent": "This is the kind of old business model the SMBs well.",
                    "label": 0
                },
                {
                    "sent": "It is it is a.",
                    "label": 1
                },
                {
                    "sent": "Developing in the SMB segment, especially in also in our region, especially in United States where but in our region as well, and the SMB Czar are going through this mind shift in terms of privacy and security, they're starting to realize that the benefits are far greater than the risks related to the cloud.",
                    "label": 0
                },
                {
                    "sent": "And for the enterprise customers.",
                    "label": 0
                },
                {
                    "sent": "So this is the sweet spots.",
                    "label": 0
                },
                {
                    "sent": "And they the sweet spot for the IT industry in any in any market.",
                    "label": 0
                },
                {
                    "sent": "Enterprises want to reduce risk and if you look at this from the IT director perspective or the CTO, so technology director perspective in in any company what their job is.",
                    "label": 0
                },
                {
                    "sent": "Their job is to spend the budget wisely, which means that they shouldn't make wrong investments, which means that they should have successful projects.",
                    "label": 0
                },
                {
                    "sent": "The greater the investment is, the bigger the risk associated to it is.",
                    "label": 0
                },
                {
                    "sent": "I think is kind of risky business and the way that clouds mitigates risks for those customers is actually the fact that it enables them to test some solutions before buying significant hardware resources or before buying licenses.",
                    "label": 0
                },
                {
                    "sent": "Imagine a big CRM deployment and imagine the failure rates of CRM projects.",
                    "label": 0
                },
                {
                    "sent": "All major analyst companies in the world are talking about 3040%.",
                    "label": 0
                },
                {
                    "sent": "Failure rates on on a CRM implementations and here with clouds.",
                    "label": 0
                },
                {
                    "sent": "Actually you can just try it by, you know paying for the for the test drive or using the licenses.",
                    "label": 0
                },
                {
                    "sent": "Paying as you go without upfront investment in Siebel hardware and software deployment that you would have to do other other way around now.",
                    "label": 0
                },
                {
                    "sent": "So this is probably what drives the enterprise is in this respect.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But look at our company so this is the micro micro business and we are six consultants company.",
                    "label": 0
                },
                {
                    "sent": "And this is how our cloud stack looks like.",
                    "label": 0
                },
                {
                    "sent": "So basically this is our it.",
                    "label": 0
                },
                {
                    "sent": "We don't use anything but this.",
                    "label": 0
                },
                {
                    "sent": "We use Dropbox for file sharing and backup.",
                    "label": 1
                },
                {
                    "sent": "So basically all our collaboration needs are kind of sold through Dropbox, hosted, exchange and messaging platform calendars on Rackspace.",
                    "label": 0
                },
                {
                    "sent": "Zoho for CRM, an GoDaddy for the web hosting.",
                    "label": 1
                },
                {
                    "sent": "All in all, this is at around 2002 thousand US dollars.",
                    "label": 0
                },
                {
                    "sent": "The cloud spent of my own company.",
                    "label": 0
                },
                {
                    "sent": "The question here is what remains in the local economy.",
                    "label": 1
                },
                {
                    "sent": "What remains in the sea region?",
                    "label": 0
                },
                {
                    "sent": "Not in Croatia, but in the in the region in general.",
                    "label": 0
                },
                {
                    "sent": "From our side actually nothing.",
                    "label": 0
                },
                {
                    "sent": "And this is the greatest challenge that cloud computing is bringing to this region.",
                    "label": 0
                },
                {
                    "sent": "It's a global game.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, we are losing in the global game.",
                    "label": 0
                },
                {
                    "sent": "The cloud computing is all about economies of scale, nothing, nothing else.",
                    "label": 0
                },
                {
                    "sent": "There was an idea.",
                    "label": 0
                },
                {
                    "sent": "Let's bring as much as possible computing resources to single location, so the unitary price surprised per user per transaction per server, per virtual server, per whatever story.",
                    "label": 0
                },
                {
                    "sent": "Megabytes of storage is actually cheaper.",
                    "label": 0
                },
                {
                    "sent": "We are unfortunately not able to compete in this in this area, and I'm going to tell you tell you why is that.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we are bombarded with offerings, which are, you know, all over the all over the Internet.",
                    "label": 0
                },
                {
                    "sent": "And I'm just putting some of the really kind of great and well known examples around here, and we don't have to go into a lot into lot details.",
                    "label": 0
                },
                {
                    "sent": "Also, you have one very specific sort of companies here.",
                    "label": 0
                },
                {
                    "sent": "You have companies that are acting both as cloud enablers and cloud providers.",
                    "label": 0
                },
                {
                    "sent": "So the big technology vendors like HP like Microsoft like IBM like Oracle.",
                    "label": 0
                },
                {
                    "sent": "They're all both selling cloud solutions to the third party, so the third parties could become the cloud service providers, and they're selling the cloud services directly.",
                    "label": 0
                },
                {
                    "sent": "What they're doing with this approach, they're just managing carefully their transition to the cloud business.",
                    "label": 0
                },
                {
                    "sent": "They're protecting their old business models while migrating gradually in kind of under controlled environment.",
                    "label": 0
                },
                {
                    "sent": "Their customer base to the to the cloud business model.",
                    "label": 0
                },
                {
                    "sent": "And they're still partnering with us with the IT industry.",
                    "label": 0
                },
                {
                    "sent": "There are partnering with local telcos in order to in order to migrate their own customer base to the cloud.",
                    "label": 0
                },
                {
                    "sent": "So on the local level, I think we can only come.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Eat with economies of scope rather than economies of scale, which is basically saying that we shall be looking into more aggregator offerings in the region rather than specific niche solutions.",
                    "label": 1
                },
                {
                    "sent": "When I say aggregater offerings, meaning that there would be be a company in Slovenia that is doing Slovenian specific accounting, Slovenian specific some kind of HR solutions, solutions that are dependent on the local legal requirements, solutions that are dependent on.",
                    "label": 0
                },
                {
                    "sent": "Local language.",
                    "label": 0
                },
                {
                    "sent": "And in that respect, in that respect, they when setting up the cloud infrastructure, we shall be looking into how to make every new service cheaper rather than how to make every new user cheaper from the operational perspective.",
                    "label": 0
                },
                {
                    "sent": "From the cost perspective of the of the provider.",
                    "label": 0
                },
                {
                    "sent": "And this is the only way we can actually differentiate.",
                    "label": 0
                },
                {
                    "sent": "So how to offer more services so that each new service would be would be less expensive for for the provider?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Themselves and what it really means, and I gave one Slovenian example in one Rackspace example.",
                    "label": 1
                },
                {
                    "sent": "So the yellow highlight is basically the price of SharePoint in the cloud.",
                    "label": 0
                },
                {
                    "sent": "SharePoint Microsoft collaboration platform.",
                    "label": 0
                },
                {
                    "sent": "On the rack space, if you buy a mailbox you get a share point for free as addition to the mailbox for $10 per month in Telekom Slovenia.",
                    "label": 0
                },
                {
                    "sent": "I've seen this offering here.",
                    "label": 0
                },
                {
                    "sent": "You cannot read this, but it says 19.95.",
                    "label": 0
                },
                {
                    "sent": "19.95 euros.",
                    "label": 0
                },
                {
                    "sent": "Per share point.",
                    "label": 0
                },
                {
                    "sent": "So we may argue that the product is different that the specification do not fit and so on.",
                    "label": 0
                },
                {
                    "sent": "But if you have the customer who is looking for a collaboration solution on the Internet.",
                    "label": 0
                },
                {
                    "sent": "He is very likely that due to the Google Local settings he would browse probably this site and also this this side of the Rackspace and then he would compare you know.",
                    "label": 0
                },
                {
                    "sent": "SharePoint is add on to the Mailbox or SharePoint as a standalone solution for 20 euros a month.",
                    "label": 0
                },
                {
                    "sent": "So basically I.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I would like to introduce a new segmentation for the cloud services and that segmentations is basically according to the understanding of IT.",
                    "label": 0
                },
                {
                    "sent": "Benefits are the benefits of fighting industry.",
                    "label": 0
                },
                {
                    "sent": "As such I say we have the companies or a big chunk of companies in our region especially do not understand that it helps the business at all.",
                    "label": 0
                },
                {
                    "sent": "So it's not about cloud for them, it's about why I T at the 1st place.",
                    "label": 0
                },
                {
                    "sent": "So whoever is selling the cloud solutions.",
                    "label": 1
                },
                {
                    "sent": "Shouldn't be worrying about how to pitch the cloud against legacy ITR on Premise ID.",
                    "label": 1
                },
                {
                    "sent": "We should be worrying on how to explain why I T at the first place.",
                    "label": 1
                },
                {
                    "sent": "Not only this second group is actually the companies that do understand the benefits, but are still cost cautious that are doing the cost benchmarks that are trying to figure out the cheapest ways on how to enter into the solution.",
                    "label": 0
                },
                {
                    "sent": "These are the companies that that would make sense for them to pitch some kind of regular cloud argumentation and finally have the customers that are already already lost that are already selling their cloud euros or dollars to the abroad to somebody outside.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to conclude, the story, especially in the countries in the region that are not yet in the EU, and it's basically the whole region but Slovenia, we do still have some kind of regulatory honeymoon in terms of.",
                    "label": 0
                },
                {
                    "sent": "Customer data protection of being prohibited.",
                    "label": 1
                },
                {
                    "sent": "To export the customer data outside of the of the country and this is the strong.",
                    "label": 0
                },
                {
                    "sent": "This is a strong argument for building the local local clouds.",
                    "label": 0
                },
                {
                    "sent": "I think there would be more and more consolidation of the localize the offerings, and probably the telcos just because of the marketing money they can spend our good channel for this to become the application aggregators application ISV solution aggregators.",
                    "label": 0
                },
                {
                    "sent": "We are still very often in in what I call a restaurant economy.",
                    "label": 0
                },
                {
                    "sent": "You know which is basically at most deals are made rather in the in the restaurants.",
                    "label": 0
                },
                {
                    "sent": "Then in the offices.",
                    "label": 0
                },
                {
                    "sent": "So in this type of relationship it's also important to have one on one relationship which we have the local, the local sales people an that means you know, smart alliances, how to use different different channels.",
                    "label": 0
                },
                {
                    "sent": "And I gave an example of how to use banks, how to use the industrial chambers.",
                    "label": 1
                },
                {
                    "sent": "So industrial Chamber of lawyers of.",
                    "label": 0
                },
                {
                    "sent": "Public notaries are sewn are actually good channels for selling different kinds of solutions.",
                    "label": 0
                },
                {
                    "sent": "We don't see a lot of freemium models.",
                    "label": 0
                },
                {
                    "sent": "We are not really coping with pride.",
                    "label": 0
                },
                {
                    "sent": "What's already there on the web we we rather like it.",
                    "label": 0
                },
                {
                    "sent": "You know, as a standard sales process.",
                    "label": 0
                },
                {
                    "sent": "So I think in the region we will see more freemium freemium models in the future and simplicity, especially for the telcos as a channel is something that's killing them in all.",
                    "label": 1
                },
                {
                    "sent": "Simplicity doesn't exist in the telecommunications industry.",
                    "label": 0
                },
                {
                    "sent": "But if they want to be really successful in the classroom, but if they want to lower their own risk, actually there should be more similar in a way they are approaching their customers, and in a way they're rolling out the new cloud cloud services.",
                    "label": 1
                },
                {
                    "sent": "And finally, what we're selling infrastructure as a service.",
                    "label": 0
                },
                {
                    "sent": "It's extremely tough sale if you're competing with Amazon with Rackspace with Terremark and those kind of companies they're operating on the economies of scale that we cannot even imagine on Amazon they're instantiating.",
                    "label": 0
                },
                {
                    "sent": "1150 thousand virtual servers on the EC2 service per day.",
                    "label": 0
                },
                {
                    "sent": "I'm not saying it's all new service being incrementally added because people are, you know, hibernating their their images, but restoring them.",
                    "label": 0
                },
                {
                    "sent": "Again, this is the scale of scale of Amazon, and Amazon is not always the biggest one.",
                    "label": 0
                },
                {
                    "sent": "There are months and months when Rackspace is actually creating more virtual servers than than Amazon on EC2.",
                    "label": 0
                },
                {
                    "sent": "The platform as a service offerings provided by a local companies.",
                    "label": 0
                },
                {
                    "sent": "I don't believe it makes any sense, so the core of the platform as a service is basically elasticity, which means almost indefinite resources, which means that we cannot achieve it here in this in this region.",
                    "label": 1
                },
                {
                    "sent": "Finally, we have the software as a service as the last remaining resort for our cloud activities, and I believe that that's where the industry is going and this is where we can make a difference in the local economies because it's still local specific.",
                    "label": 0
                },
                {
                    "sent": "This is the.",
                    "label": 0
                },
                {
                    "sent": "This is a local offering.",
                    "label": 0
                },
                {
                    "sent": "So for maybe a late.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Your discussion I just leave these questions there, I don't.",
                    "label": 0
                },
                {
                    "sent": "I ran over my time more or less but we will see a lot of discussion about cloud interoperability.",
                    "label": 1
                },
                {
                    "sent": "I raised this question already about the private cloud.",
                    "label": 1
                },
                {
                    "sent": "Then, is it fair to call it a cloud at all?",
                    "label": 1
                },
                {
                    "sent": "The global competition is hurting us as much as it's giving us opportunities to go out and offer our services around the world.",
                    "label": 1
                },
                {
                    "sent": "We're seeing big IT companies transforming themselves into different kind of companies, figuring out how to compete on this on this.",
                    "label": 0
                },
                {
                    "sent": "Area we are seeing this phenomenon of global vendors that are both enablers and providers.",
                    "label": 0
                },
                {
                    "sent": "And finally I see that is reinventing their role in the future.",
                    "label": 0
                },
                {
                    "sent": "So I T directors have today 2 two ways on how to compete against the let's say, key account sales director who goes out to the Internet to thesalesforce.com and buys 10 accounts for sales force automation because he couldn't cannot wait.",
                    "label": 0
                },
                {
                    "sent": "For the last five years, he's been waiting for a new CRM solution from his IT department.",
                    "label": 0
                },
                {
                    "sent": "He's not getting anything, so he takes a credit cards.",
                    "label": 0
                },
                {
                    "sent": "He buys 10 accounts on Salesforce an from tomorrow.",
                    "label": 0
                },
                {
                    "sent": "Each of the sales person in his companies actually entering their opportunities in Salesforce.",
                    "label": 0
                },
                {
                    "sent": "This is something that local ID directors are facing seeing and trying to fight with.",
                    "label": 0
                },
                {
                    "sent": "That one approach would be to help those sales guys to betterusethesalesforce.com or try to integrate that into existing systems in the company.",
                    "label": 0
                },
                {
                    "sent": "This is 1 approach and other approaches actually to go to the president of the Board and complain.",
                    "label": 0
                },
                {
                    "sent": "And then the president comes out with a statement which says whomever buys an IT service outside from RIT Department wouldn't get refunded for the purchase he made.",
                    "label": 0
                },
                {
                    "sent": "So as simple as that.",
                    "label": 0
                },
                {
                    "sent": "So we'll see these two these two options in the future and I would say that you know the more successful ID directors would be the first first group of the of the people having said this.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you very much for and.",
                    "label": 0
                },
                {
                    "sent": "I hope this is OK. Introduction for the remaining speakers.",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                }
            ]
        }
    }
}