{
    "id": "jwbtqlyufd76rjikgjpj6wyjeabkdvjy",
    "title": "Differential Adaptive Diffusion: Understanding Diversity and Learning Whom to Trust in Viral Marketing",
    "info": {
        "author": [
            "Hossam Sharara, Department of Computer Science, University of Maryland"
        ],
        "published": "Aug. 18, 2011",
        "recorded": "July 2011",
        "category": [
            "Top->Computer Science->Social Media"
        ]
    },
    "url": "http://videolectures.net/icwsm2011_sharara_viral/",
    "segmentation": [
        [
            "My name is Sam, Sarah and today I'll be presenting our work on a differential adaptive diffusion for understanding the diversity and learning whom to trust in viral marketing settings.",
            "This is joint work with my advisor, Professor Lisa Carter in the University of Maryland, and Professor William Rand from Robert Smith School of Business."
        ],
        [
            "To start, viral marketing techniques have become very popular.",
            "They rely mainly on the social network structure between customers to spread the products among the target population.",
            "There are numerous websites that rely on the ideas of viral marketing to transmit their products.",
            "However, there are two key assumptions in most of the diffusion processes in these websites, which is basically that the peer influences both static and independent of the product type."
        ],
        [
            "So in order to show that these key assumptions have some flaws and in them we start by small motivating example from a very small social network among five users.",
            "In this social network, if we assume that Mary saw an advertisement about a new woman's fashion store that.",
            "Encouraging her to send a recommendation for her friends to get further discounts on her future purchase.",
            "What Mary thinks is OK. She's interested in the in this new fashion store.",
            "She's thinking OK, what do I have to lose?",
            "I'll send the recommendation to everyone to get the maximum discount that they can get.",
            "And that's what exactly happens.",
            "You send the recommendation to all her friends.",
            "What turns out to be is that Anne and Janet are both interested in this advertisement and actually accept the recommendation and act upon it while John and Bob are see that this is irrelevant for them, they are not interested in women's fashion and they don't accept the recommendation.",
            "What's happening in the underlying social network after this recommendation round goes on is that now Anne and Janet have more confidence in Marys recommendations because the last recommendation should send them was for something relevant to them.",
            "While John and Bob start losing confidence in Mary's recommendation.",
            "Cause hair loss recommendation was basically error.",
            "We now move to the behavior of another user in the same social network.",
            "So again, John now sees an advertisement for a new movie rental website that again has an offer for referring a friend and getting a discount on the future rental.",
            "However, John's behavior or reaction to this advertisement is different from Mary.",
            "So now John starts taking into consideration the preferences of his peers.",
            "So now he thinks that OK, Bob and Mary are will definitely be interested because he knows that they are interested in movies.",
            "But Ann is not much into movies, so she will not be interested about this offer.",
            "So he decides to send a recommendation only for Mary and Bob.",
            "And what happens is that both of them are interested.",
            "They both accept the recommendation and act upon it.",
            "Again, what's happening in the underlying social network is that now both of them have higher confidence in John's recommendations in general.",
            "As this situation falls on time, what we can see is that Mary end up having lower confidence values from most of her peers because of her attitude of forwarding all the recommendations you can get.",
            "While John, on the other hand gets higher confidence overtime from here from his peers.",
            "So we end up with a social network that structurally equivalent to what we started with, but the weights on the edges corresponding to the confidence values between peers are significantly different.",
            "So if we are to choose a seed individual foreign marketing, new product, for instance, choosing Mary in this case won't be the best choice because of the confidence values of her peers.",
            "But choosing John might end up being a better choice."
        ],
        [
            "So to motivate our to summarize our motivations, P influences dynamic is dependent on the previous user interactions.",
            "Anvaya market strategies have an implicit effect on the underlying social network itself.",
            "Actually, sometimes it might even change the structure of the underlying network altogether, so there is 1 extreme example where Burger King had a marketing campaign on Facebook where you can delete ten of your friends and get a free one.",
            "So what happens on these friends get notified?",
            "Actually, that you sacrificed them for 110th of all.",
            "So what happens in this extreme case is that the social network structure is even completely changed after this marketing campaign."
        ],
        [
            "The second point is that as we saw in this example, is that peer influence is dependent on the type of the product being spread.",
            "So because users have varying preferences for different product."
        ],
        [
            "So to give you a little bit of a background, there are basically 2 popular diffusion diffusion models.",
            "The first type of models are the threshold models where a user adopts the product if given percentage of her friends adopted product as well.",
            "The second type of diffusion models are the cascade models such as the independent Cascade model, where each user have a single.",
            "When a user adopts the product, she has a single chance of convincing each of her neighbors to adopt the product as well, and she succeeds in that with a given probability we refer to as the influence probability.",
            "So that returning back to the key assumptions that we start with that the key assumptions of the basic diffusion models is that these influence probabilities are assumed to be static, insensitive to the product type, and known to the model in advance."
        ],
        [
            "So the main objectives of our work is basically to capture that diversity in user preferences for different products for different product types, model the change in influence probabilities across multiple campaigns, and design of our marketing strategy that takes these factors into account."
        ],
        [
            "So the outline of my talk.",
            "I'll start with a case study from dig.com to analyze the kinds of behaviors that we talked about.",
            "Next I will introduce our proposed differential adaptive diffusion model to capture these aspects.",
            "Afterwards, I'll talk.",
            "I'll talk about the implications of our findings on existing viral marketing strategies and I'll end up with a conclusion."
        ],
        [
            "Starting with our case study, so we crawled the come from during a six month period.",
            "Big is a social news website where users can submit stories in different topics which then can be big by there by other users in the in the website.",
            "Users can follow other users to see their submissions and Dicks on their homepage."
        ],
        [
            "So the following links define the social network among the big users.",
            "The user submissions serve as a proxy for user preferences for different topics.",
            "So if I submit a story in politics, for example, that indicates that I have higher preference for politics.",
            "User digs are analogous to this case in product product adoptions and the story topics are analogous to the product types."
        ],
        [
            "So there is set with we used as I mentioned was called from did that come over a six month period from July 2010 to December 2010?",
            "The social network part of it contains about 12,000 users with about 1.3 million following edges.",
            "The big network contains about 48,000 news posts with about 1.9 million Dick edges."
        ],
        [
            "So the first type of analysis we did is basically characterizing the relationship between the user submissions versus the.",
            "So in this graph we see on the X axis the KL diversions between the topic distributions of the user submissions, which is in this case the.",
            "Recommendations versus the decks or adoption?",
            "So on the Y axis we have the actual percentage of users."
        ],
        [
            "We can see from this graph that most users adopt only stories of interest.",
            "To them.",
            "This is characterized by having very low values of KL diversions between the actual recommendations an adoption.",
            "However."
        ],
        [
            "Are there still also a smaller percentage of users who dig stores in topics that are significant vary significantly from the ones that they posted?",
            "One interpretation for this set of users is that they are imitators or easily influenced by their peers, so they can actually dig the stories that their peers post irrespective of their own preferences."
        ],
        [
            "So we took one step ahead and also tried to characterize the user submissions themselves.",
            "So on this graph we see the kill diversions between the topic distributions of the user submission and a uniform distribution across all topics in dig.",
            "As we can see here, we can."
        ],
        [
            "We can find see groups of users.",
            "The first group is the focused users which have highly skewed preferences towards one or two topics.",
            "They are characterized by very high values of scale diversions between their submission, distribution, and actually the uniform distribution."
        ],
        [
            "The second set of users that are biased users which have less skewed preference towards the larger set of topics."
        ],
        [
            "Finally, we have the balanced or the casual users which have almost uniform preference across all teams."
        ],
        [
            "The second step of our analysis is to characterize the effect of homophily between peers on the adoption levels.",
            "So on this heat map, we.",
            "We see each cell represent the number of follow Dicks.",
            "So if a user submits a story.",
            "The intensity of the set represents the number or the percentage of the stories that users submit that her peers follow or dig as well.",
            "On the X axis we have time and on the Y axis we have the diversions between the user's preferences, the peers preferences.",
            "So as we can see on the lower part.",
            "Peers with similar topic preferences that are characterized by low values of diversions between their topic preference, gain confidence in each other's recommendations.",
            "Overtime, we can see this as the heat map is getting darker as we progress in time, indicating that there are more followed digs or more adoptions as we go further in time."
        ],
        [
            "The second set of the upper part of the heat map represents the users that have large values of diversions between their topic distributions, indicating that their preferences vary significantly from each other, and we can see that the heat map gets lighter as we progress in time, indicating that for these users, they start losing confidence in each other recommendations as time progress is resulting in that the number of followed digs or adoptions actually decreasing.",
            "So now we get.",
            "We have shown through this analysis that the assumptions made by the diffusion models doesn't much hold."
        ],
        [
            "So the next part is OK. How do we design a new ad diffusion model that takes this factors into?"
        ],
        [
            "Now.",
            "For that we break down the influence probability between any two pairs for a given product into two components.",
            "The first component is a weight factor that represents the confidence of user V in use.",
            "Recommendation at the time of the campaign line.",
            "The second part represent the preference of the user for the product that's being marketed at this campaign.",
            "We note here that the preferences for the users to different products is.",
            "We consider this as a static value.",
            "However, the confidence of users in her peers change overtime.",
            "And they are updated at the end of each campaign according to the outcome of the recommendations."
        ],
        [
            "We use kernel functions for updating the weight values or confidence values between peers.",
            "I put here an example of a linear kernel.",
            "I won't go into like the details of the math, but generally what it says is that if we adopt the product, then each peer who recommended that product to be.",
            "Gets a credit proportional to the time elapsed between the recommendation and actual adoption, so the last one to recommend the product.",
            "Get the maximum credit.",
            "However, if he does end up, doesn't not adopting the product, then each peer who recommended the product for V gets penalized as well.",
            "Again proportional to the time elapsed."
        ],
        [
            "To evaluate our model performance.",
            "We use the 1st four months of the data set that we have for training or learning the influence probabilities and the last two months for predicting the future dates."
        ],
        [
            "We compared our model, I guess two baselines that were proposed by Gov.",
            "Al and his colleagues in Wisdom 2010.",
            "That proposed the model for incorporating temporal dynamics for learning the influence properties.",
            "Namely, the two models that we compare against the first model is the Bernoulli model, in which each recommendation is regarded as a Bernoulli trial.",
            "And the influence probabilities are estimated using maximum likelihood estimate over a given contingent time for each user.",
            "The second baseline that we compare against is the Bernoulli PC baseline, which have the same Bernoulli representation.",
            "But each recommender gets partial credit during the contagion."
        ],
        [
            "Here we show the results of the three algorithm on a narrow C curve.",
            "As we can see, our proposed adaptive model that takes into account both the diffusion dynamics and the users heterogeneity into account.",
            "Yields better performance.",
            "Actually, we can get fairly high through positive rates for relatively low false positive rates."
        ],
        [
            "So next we discuss the implications of our findings on existing viral marketing strategy."
        ],
        [
            "As we saw in our examples of throughout the talk, users recommendations are most effective if they are recommended to the right subset of users.",
            "The right subset of friends so highly selective behavior where we have limited exposure because now the product will not reach out through the whole network, while if the users resort to spamming behavior, you will get limited returns as well due to the decreased levels of confidence between peers.",
            "So the question we ask now is OK. What is the appropriate mechanism for maximizing both the product adoption and spread?"
        ],
        [
            "So for that we propose an adaptive rewarding mechanism where successful recommendations are awarded Alpha Time is our units while unsuccessful recommendations or firm recommendations are penalized 1 minus Alpha times, are you?",
            "The Alpha here represents a conservation parameter, so as Alpha increases, we give more reward than penalty.",
            "Most existing viral marketing strategies assume that Alpha equals one where the users are rewarded if their recommendations are successful, but they don't get penalized if the recommendations is not successful.",
            "The penalty term that we introduce here help maintains the average overall confidence levels between different peers."
        ],
        [
            "So for experimenting, our adaptive reward mechanism, we used an agent based model to simulate the behavior of customers in different settings.",
            "So when an agent adopts the product.",
            "It makes a probabilistic decision to send the recommendation for its peers.",
            "This probabilistic decision is mainly based on the knowledge on the agent knowledge about the peers preferences.",
            "So the object of each agent at each step is to maximize its expected reward according to the current rewarding strategy."
        ],
        [
            "We did two sets of experiments.",
            "The first set of experiment are we call a fully observable set of experiment where the agent can actually observe the preferences of its peers, while the second set of experiments where.",
            "Where we have the agent learned, appears preferences through the outcomes of the recommendation.",
            "We simulate the diffusion for 500 campaigns for products from 5 different categories and we use the linear kernel we just described for adjusting the confidence levels between peers after each campaign."
        ],
        [
            "Here we see that results for the fully observable experiment mode.",
            "Which basically as we can see here, we varied the value of Alpha or the conservation parameters and see what's the outcome, the adoption or the average adoption percentage and the average confidence levels in after each campaign.",
            "As we see here, we when we resort to very high values of Alpha such as Alpha equals one.",
            "We start off by having higher adoption percentages at the beginning, But then this adoption percentage is full as we.",
            "As more campaigns are being marketed due to the decrease in the confidence levels because of using an unconservative behavior of the users.",
            "On the other extreme, if we choose Alpha to be very small, like 0, then there is no incentive for the users to send any recommendations, so the product doesn't spell.",
            "However, we found that intermediate values of Alpha such as Alpha equals .5, which is the yellow line here.",
            "Actually consistently maintains the adoption rates and the overall confidence levels between users among different marketing campaigns."
        ],
        [
            "In the second set of experiments for the learning preference, we have the same behavior.",
            "And actually here for moderate values of Alpha we see that the adoption levels and average confidence is actually even higher.",
            "The interpretation for that is that when we allow the agent to learn the preferences of her peers, depending on the outcome of the recommendation, we take into account both the peers preferences as well as the confidence as well."
        ],
        [
            "Finally, to test the robustness of our model, we inserted spamming agents in the network, so spamming agent will forward the recommendations for all the product that it adopts, regardless of the preferences of their peers.",
            "And we set Alpha equals .5 for all the other agents in the network."
        ],
        [
            "Here we show that.",
            "The result of having different levels of spammers.",
            "Using our proposed approach, and as we can see, after some period of time the network actually adapts to the presence of spammers dropping the confidence levels between of the links for these spammers and continues to maintain the adoption levels among the trusted links."
        ],
        [
            "So to conclude, the network dynamics and user history ginnity have a considerable impact on the user interaction on user interactions.",
            "The proposed adaptive diffusion model incorporate both aspects to better model the diffusion process.",
            "And the adaptive rewarding mechanism for viral marketing maintains higher confidence levels among use."
        ],
        [
            "For future work we are currently looking at potential applications such as social recommendations and collaborative filtering.",
            "We are also considering analyzing the impact of the proposed model opinion leadership identification.",
            "And finally, how to incorporate the?",
            "As I said at the beginning, I we are assuming that the preferences for the different for different product categories for each user is static, so we are also investigating how to incorporate a time varying preference for each user in our model."
        ],
        [
            "Thank you animals.",
            "Oh, it's on, but thanks.",
            "There's a nice tie into, you know this thing about what do interests have to do with.",
            "So I was I was curious about how you had this nice slide.",
            "That said, if you look at the KL divergences on dig between people there overtime that it's sort of the number of people who have low KL, divergent sort of goes down and the number who have.",
            "Big Kelly vergence.",
            "It sort of goes up overtime.",
            "I was just curious how you calculated KL divergent.",
            "Maybe I just missed it because you know that you do.",
            "If the topics were changing overtime or something, then maybe the maximum khalda vergence that was possible could go down.",
            "You know something like that, so I was just curious what the idea was.",
            "So yeah, so the topics are actually set by dig.com and stuff.",
            "So when you submit a story you have to specify the topic in which this toys submitted so that there are 10 topics that are don't change and hear what we're doing is basically.",
            "Computing the difference in the submission of two peers in different topics across the display specific page all across all time until this month.",
            "So for like October, for instance, that include the all the submissions of these given two peers over all the months from July 12.",
            "I am Brendan from crying melon.",
            "How do you control 4?",
            "How do you control for user activity during the period?",
            "So do you know what fraction of the user like do you require that users demonstrated activity during the whole period of the crawl?",
            "Or what happens if a user?",
            "Say in July.",
            "Was active, but then they became inactive.",
            "So for in the crawling setting we actually told the topics and then we got the social network and the user submitting these topics.",
            "So we have for each user, enough number of topics that covers the whole crawling.",
            "So we didn't crowd for the users and then they could then get their topics we cloud for the stories and then get there."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My name is Sam, Sarah and today I'll be presenting our work on a differential adaptive diffusion for understanding the diversity and learning whom to trust in viral marketing settings.",
                    "label": 0
                },
                {
                    "sent": "This is joint work with my advisor, Professor Lisa Carter in the University of Maryland, and Professor William Rand from Robert Smith School of Business.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To start, viral marketing techniques have become very popular.",
                    "label": 1
                },
                {
                    "sent": "They rely mainly on the social network structure between customers to spread the products among the target population.",
                    "label": 1
                },
                {
                    "sent": "There are numerous websites that rely on the ideas of viral marketing to transmit their products.",
                    "label": 0
                },
                {
                    "sent": "However, there are two key assumptions in most of the diffusion processes in these websites, which is basically that the peer influences both static and independent of the product type.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in order to show that these key assumptions have some flaws and in them we start by small motivating example from a very small social network among five users.",
                    "label": 0
                },
                {
                    "sent": "In this social network, if we assume that Mary saw an advertisement about a new woman's fashion store that.",
                    "label": 0
                },
                {
                    "sent": "Encouraging her to send a recommendation for her friends to get further discounts on her future purchase.",
                    "label": 0
                },
                {
                    "sent": "What Mary thinks is OK. She's interested in the in this new fashion store.",
                    "label": 0
                },
                {
                    "sent": "She's thinking OK, what do I have to lose?",
                    "label": 0
                },
                {
                    "sent": "I'll send the recommendation to everyone to get the maximum discount that they can get.",
                    "label": 0
                },
                {
                    "sent": "And that's what exactly happens.",
                    "label": 0
                },
                {
                    "sent": "You send the recommendation to all her friends.",
                    "label": 0
                },
                {
                    "sent": "What turns out to be is that Anne and Janet are both interested in this advertisement and actually accept the recommendation and act upon it while John and Bob are see that this is irrelevant for them, they are not interested in women's fashion and they don't accept the recommendation.",
                    "label": 0
                },
                {
                    "sent": "What's happening in the underlying social network after this recommendation round goes on is that now Anne and Janet have more confidence in Marys recommendations because the last recommendation should send them was for something relevant to them.",
                    "label": 0
                },
                {
                    "sent": "While John and Bob start losing confidence in Mary's recommendation.",
                    "label": 0
                },
                {
                    "sent": "Cause hair loss recommendation was basically error.",
                    "label": 0
                },
                {
                    "sent": "We now move to the behavior of another user in the same social network.",
                    "label": 0
                },
                {
                    "sent": "So again, John now sees an advertisement for a new movie rental website that again has an offer for referring a friend and getting a discount on the future rental.",
                    "label": 0
                },
                {
                    "sent": "However, John's behavior or reaction to this advertisement is different from Mary.",
                    "label": 0
                },
                {
                    "sent": "So now John starts taking into consideration the preferences of his peers.",
                    "label": 0
                },
                {
                    "sent": "So now he thinks that OK, Bob and Mary are will definitely be interested because he knows that they are interested in movies.",
                    "label": 1
                },
                {
                    "sent": "But Ann is not much into movies, so she will not be interested about this offer.",
                    "label": 1
                },
                {
                    "sent": "So he decides to send a recommendation only for Mary and Bob.",
                    "label": 0
                },
                {
                    "sent": "And what happens is that both of them are interested.",
                    "label": 0
                },
                {
                    "sent": "They both accept the recommendation and act upon it.",
                    "label": 0
                },
                {
                    "sent": "Again, what's happening in the underlying social network is that now both of them have higher confidence in John's recommendations in general.",
                    "label": 0
                },
                {
                    "sent": "As this situation falls on time, what we can see is that Mary end up having lower confidence values from most of her peers because of her attitude of forwarding all the recommendations you can get.",
                    "label": 0
                },
                {
                    "sent": "While John, on the other hand gets higher confidence overtime from here from his peers.",
                    "label": 0
                },
                {
                    "sent": "So we end up with a social network that structurally equivalent to what we started with, but the weights on the edges corresponding to the confidence values between peers are significantly different.",
                    "label": 0
                },
                {
                    "sent": "So if we are to choose a seed individual foreign marketing, new product, for instance, choosing Mary in this case won't be the best choice because of the confidence values of her peers.",
                    "label": 0
                },
                {
                    "sent": "But choosing John might end up being a better choice.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to motivate our to summarize our motivations, P influences dynamic is dependent on the previous user interactions.",
                    "label": 0
                },
                {
                    "sent": "Anvaya market strategies have an implicit effect on the underlying social network itself.",
                    "label": 1
                },
                {
                    "sent": "Actually, sometimes it might even change the structure of the underlying network altogether, so there is 1 extreme example where Burger King had a marketing campaign on Facebook where you can delete ten of your friends and get a free one.",
                    "label": 0
                },
                {
                    "sent": "So what happens on these friends get notified?",
                    "label": 0
                },
                {
                    "sent": "Actually, that you sacrificed them for 110th of all.",
                    "label": 0
                },
                {
                    "sent": "So what happens in this extreme case is that the social network structure is even completely changed after this marketing campaign.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second point is that as we saw in this example, is that peer influence is dependent on the type of the product being spread.",
                    "label": 0
                },
                {
                    "sent": "So because users have varying preferences for different product.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to give you a little bit of a background, there are basically 2 popular diffusion diffusion models.",
                    "label": 0
                },
                {
                    "sent": "The first type of models are the threshold models where a user adopts the product if given percentage of her friends adopted product as well.",
                    "label": 0
                },
                {
                    "sent": "The second type of diffusion models are the cascade models such as the independent Cascade model, where each user have a single.",
                    "label": 0
                },
                {
                    "sent": "When a user adopts the product, she has a single chance of convincing each of her neighbors to adopt the product as well, and she succeeds in that with a given probability we refer to as the influence probability.",
                    "label": 0
                },
                {
                    "sent": "So that returning back to the key assumptions that we start with that the key assumptions of the basic diffusion models is that these influence probabilities are assumed to be static, insensitive to the product type, and known to the model in advance.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the main objectives of our work is basically to capture that diversity in user preferences for different products for different product types, model the change in influence probabilities across multiple campaigns, and design of our marketing strategy that takes these factors into account.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the outline of my talk.",
                    "label": 0
                },
                {
                    "sent": "I'll start with a case study from dig.com to analyze the kinds of behaviors that we talked about.",
                    "label": 0
                },
                {
                    "sent": "Next I will introduce our proposed differential adaptive diffusion model to capture these aspects.",
                    "label": 1
                },
                {
                    "sent": "Afterwards, I'll talk.",
                    "label": 0
                },
                {
                    "sent": "I'll talk about the implications of our findings on existing viral marketing strategies and I'll end up with a conclusion.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Starting with our case study, so we crawled the come from during a six month period.",
                    "label": 0
                },
                {
                    "sent": "Big is a social news website where users can submit stories in different topics which then can be big by there by other users in the in the website.",
                    "label": 1
                },
                {
                    "sent": "Users can follow other users to see their submissions and Dicks on their homepage.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the following links define the social network among the big users.",
                    "label": 1
                },
                {
                    "sent": "The user submissions serve as a proxy for user preferences for different topics.",
                    "label": 1
                },
                {
                    "sent": "So if I submit a story in politics, for example, that indicates that I have higher preference for politics.",
                    "label": 0
                },
                {
                    "sent": "User digs are analogous to this case in product product adoptions and the story topics are analogous to the product types.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So there is set with we used as I mentioned was called from did that come over a six month period from July 2010 to December 2010?",
                    "label": 0
                },
                {
                    "sent": "The social network part of it contains about 12,000 users with about 1.3 million following edges.",
                    "label": 0
                },
                {
                    "sent": "The big network contains about 48,000 news posts with about 1.9 million Dick edges.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the first type of analysis we did is basically characterizing the relationship between the user submissions versus the.",
                    "label": 0
                },
                {
                    "sent": "So in this graph we see on the X axis the KL diversions between the topic distributions of the user submissions, which is in this case the.",
                    "label": 1
                },
                {
                    "sent": "Recommendations versus the decks or adoption?",
                    "label": 1
                },
                {
                    "sent": "So on the Y axis we have the actual percentage of users.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We can see from this graph that most users adopt only stories of interest.",
                    "label": 1
                },
                {
                    "sent": "To them.",
                    "label": 0
                },
                {
                    "sent": "This is characterized by having very low values of KL diversions between the actual recommendations an adoption.",
                    "label": 0
                },
                {
                    "sent": "However.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are there still also a smaller percentage of users who dig stores in topics that are significant vary significantly from the ones that they posted?",
                    "label": 0
                },
                {
                    "sent": "One interpretation for this set of users is that they are imitators or easily influenced by their peers, so they can actually dig the stories that their peers post irrespective of their own preferences.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we took one step ahead and also tried to characterize the user submissions themselves.",
                    "label": 0
                },
                {
                    "sent": "So on this graph we see the kill diversions between the topic distributions of the user submission and a uniform distribution across all topics in dig.",
                    "label": 1
                },
                {
                    "sent": "As we can see here, we can.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We can find see groups of users.",
                    "label": 1
                },
                {
                    "sent": "The first group is the focused users which have highly skewed preferences towards one or two topics.",
                    "label": 1
                },
                {
                    "sent": "They are characterized by very high values of scale diversions between their submission, distribution, and actually the uniform distribution.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second set of users that are biased users which have less skewed preference towards the larger set of topics.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Finally, we have the balanced or the casual users which have almost uniform preference across all teams.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The second step of our analysis is to characterize the effect of homophily between peers on the adoption levels.",
                    "label": 0
                },
                {
                    "sent": "So on this heat map, we.",
                    "label": 0
                },
                {
                    "sent": "We see each cell represent the number of follow Dicks.",
                    "label": 0
                },
                {
                    "sent": "So if a user submits a story.",
                    "label": 0
                },
                {
                    "sent": "The intensity of the set represents the number or the percentage of the stories that users submit that her peers follow or dig as well.",
                    "label": 0
                },
                {
                    "sent": "On the X axis we have time and on the Y axis we have the diversions between the user's preferences, the peers preferences.",
                    "label": 0
                },
                {
                    "sent": "So as we can see on the lower part.",
                    "label": 0
                },
                {
                    "sent": "Peers with similar topic preferences that are characterized by low values of diversions between their topic preference, gain confidence in each other's recommendations.",
                    "label": 1
                },
                {
                    "sent": "Overtime, we can see this as the heat map is getting darker as we progress in time, indicating that there are more followed digs or more adoptions as we go further in time.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second set of the upper part of the heat map represents the users that have large values of diversions between their topic distributions, indicating that their preferences vary significantly from each other, and we can see that the heat map gets lighter as we progress in time, indicating that for these users, they start losing confidence in each other recommendations as time progress is resulting in that the number of followed digs or adoptions actually decreasing.",
                    "label": 0
                },
                {
                    "sent": "So now we get.",
                    "label": 0
                },
                {
                    "sent": "We have shown through this analysis that the assumptions made by the diffusion models doesn't much hold.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the next part is OK. How do we design a new ad diffusion model that takes this factors into?",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "For that we break down the influence probability between any two pairs for a given product into two components.",
                    "label": 0
                },
                {
                    "sent": "The first component is a weight factor that represents the confidence of user V in use.",
                    "label": 1
                },
                {
                    "sent": "Recommendation at the time of the campaign line.",
                    "label": 0
                },
                {
                    "sent": "The second part represent the preference of the user for the product that's being marketed at this campaign.",
                    "label": 0
                },
                {
                    "sent": "We note here that the preferences for the users to different products is.",
                    "label": 0
                },
                {
                    "sent": "We consider this as a static value.",
                    "label": 0
                },
                {
                    "sent": "However, the confidence of users in her peers change overtime.",
                    "label": 0
                },
                {
                    "sent": "And they are updated at the end of each campaign according to the outcome of the recommendations.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We use kernel functions for updating the weight values or confidence values between peers.",
                    "label": 0
                },
                {
                    "sent": "I put here an example of a linear kernel.",
                    "label": 0
                },
                {
                    "sent": "I won't go into like the details of the math, but generally what it says is that if we adopt the product, then each peer who recommended that product to be.",
                    "label": 1
                },
                {
                    "sent": "Gets a credit proportional to the time elapsed between the recommendation and actual adoption, so the last one to recommend the product.",
                    "label": 1
                },
                {
                    "sent": "Get the maximum credit.",
                    "label": 1
                },
                {
                    "sent": "However, if he does end up, doesn't not adopting the product, then each peer who recommended the product for V gets penalized as well.",
                    "label": 0
                },
                {
                    "sent": "Again proportional to the time elapsed.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To evaluate our model performance.",
                    "label": 0
                },
                {
                    "sent": "We use the 1st four months of the data set that we have for training or learning the influence probabilities and the last two months for predicting the future dates.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We compared our model, I guess two baselines that were proposed by Gov.",
                    "label": 0
                },
                {
                    "sent": "Al and his colleagues in Wisdom 2010.",
                    "label": 0
                },
                {
                    "sent": "That proposed the model for incorporating temporal dynamics for learning the influence properties.",
                    "label": 0
                },
                {
                    "sent": "Namely, the two models that we compare against the first model is the Bernoulli model, in which each recommendation is regarded as a Bernoulli trial.",
                    "label": 0
                },
                {
                    "sent": "And the influence probabilities are estimated using maximum likelihood estimate over a given contingent time for each user.",
                    "label": 1
                },
                {
                    "sent": "The second baseline that we compare against is the Bernoulli PC baseline, which have the same Bernoulli representation.",
                    "label": 1
                },
                {
                    "sent": "But each recommender gets partial credit during the contagion.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here we show the results of the three algorithm on a narrow C curve.",
                    "label": 0
                },
                {
                    "sent": "As we can see, our proposed adaptive model that takes into account both the diffusion dynamics and the users heterogeneity into account.",
                    "label": 1
                },
                {
                    "sent": "Yields better performance.",
                    "label": 0
                },
                {
                    "sent": "Actually, we can get fairly high through positive rates for relatively low false positive rates.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So next we discuss the implications of our findings on existing viral marketing strategy.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As we saw in our examples of throughout the talk, users recommendations are most effective if they are recommended to the right subset of users.",
                    "label": 1
                },
                {
                    "sent": "The right subset of friends so highly selective behavior where we have limited exposure because now the product will not reach out through the whole network, while if the users resort to spamming behavior, you will get limited returns as well due to the decreased levels of confidence between peers.",
                    "label": 0
                },
                {
                    "sent": "So the question we ask now is OK. What is the appropriate mechanism for maximizing both the product adoption and spread?",
                    "label": 1
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for that we propose an adaptive rewarding mechanism where successful recommendations are awarded Alpha Time is our units while unsuccessful recommendations or firm recommendations are penalized 1 minus Alpha times, are you?",
                    "label": 0
                },
                {
                    "sent": "The Alpha here represents a conservation parameter, so as Alpha increases, we give more reward than penalty.",
                    "label": 0
                },
                {
                    "sent": "Most existing viral marketing strategies assume that Alpha equals one where the users are rewarded if their recommendations are successful, but they don't get penalized if the recommendations is not successful.",
                    "label": 1
                },
                {
                    "sent": "The penalty term that we introduce here help maintains the average overall confidence levels between different peers.",
                    "label": 1
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for experimenting, our adaptive reward mechanism, we used an agent based model to simulate the behavior of customers in different settings.",
                    "label": 1
                },
                {
                    "sent": "So when an agent adopts the product.",
                    "label": 1
                },
                {
                    "sent": "It makes a probabilistic decision to send the recommendation for its peers.",
                    "label": 0
                },
                {
                    "sent": "This probabilistic decision is mainly based on the knowledge on the agent knowledge about the peers preferences.",
                    "label": 0
                },
                {
                    "sent": "So the object of each agent at each step is to maximize its expected reward according to the current rewarding strategy.",
                    "label": 1
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We did two sets of experiments.",
                    "label": 1
                },
                {
                    "sent": "The first set of experiment are we call a fully observable set of experiment where the agent can actually observe the preferences of its peers, while the second set of experiments where.",
                    "label": 0
                },
                {
                    "sent": "Where we have the agent learned, appears preferences through the outcomes of the recommendation.",
                    "label": 0
                },
                {
                    "sent": "We simulate the diffusion for 500 campaigns for products from 5 different categories and we use the linear kernel we just described for adjusting the confidence levels between peers after each campaign.",
                    "label": 1
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here we see that results for the fully observable experiment mode.",
                    "label": 0
                },
                {
                    "sent": "Which basically as we can see here, we varied the value of Alpha or the conservation parameters and see what's the outcome, the adoption or the average adoption percentage and the average confidence levels in after each campaign.",
                    "label": 0
                },
                {
                    "sent": "As we see here, we when we resort to very high values of Alpha such as Alpha equals one.",
                    "label": 0
                },
                {
                    "sent": "We start off by having higher adoption percentages at the beginning, But then this adoption percentage is full as we.",
                    "label": 0
                },
                {
                    "sent": "As more campaigns are being marketed due to the decrease in the confidence levels because of using an unconservative behavior of the users.",
                    "label": 0
                },
                {
                    "sent": "On the other extreme, if we choose Alpha to be very small, like 0, then there is no incentive for the users to send any recommendations, so the product doesn't spell.",
                    "label": 0
                },
                {
                    "sent": "However, we found that intermediate values of Alpha such as Alpha equals .5, which is the yellow line here.",
                    "label": 0
                },
                {
                    "sent": "Actually consistently maintains the adoption rates and the overall confidence levels between users among different marketing campaigns.",
                    "label": 1
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the second set of experiments for the learning preference, we have the same behavior.",
                    "label": 0
                },
                {
                    "sent": "And actually here for moderate values of Alpha we see that the adoption levels and average confidence is actually even higher.",
                    "label": 0
                },
                {
                    "sent": "The interpretation for that is that when we allow the agent to learn the preferences of her peers, depending on the outcome of the recommendation, we take into account both the peers preferences as well as the confidence as well.",
                    "label": 1
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Finally, to test the robustness of our model, we inserted spamming agents in the network, so spamming agent will forward the recommendations for all the product that it adopts, regardless of the preferences of their peers.",
                    "label": 0
                },
                {
                    "sent": "And we set Alpha equals .5 for all the other agents in the network.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here we show that.",
                    "label": 0
                },
                {
                    "sent": "The result of having different levels of spammers.",
                    "label": 0
                },
                {
                    "sent": "Using our proposed approach, and as we can see, after some period of time the network actually adapts to the presence of spammers dropping the confidence levels between of the links for these spammers and continues to maintain the adoption levels among the trusted links.",
                    "label": 1
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to conclude, the network dynamics and user history ginnity have a considerable impact on the user interaction on user interactions.",
                    "label": 1
                },
                {
                    "sent": "The proposed adaptive diffusion model incorporate both aspects to better model the diffusion process.",
                    "label": 1
                },
                {
                    "sent": "And the adaptive rewarding mechanism for viral marketing maintains higher confidence levels among use.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For future work we are currently looking at potential applications such as social recommendations and collaborative filtering.",
                    "label": 1
                },
                {
                    "sent": "We are also considering analyzing the impact of the proposed model opinion leadership identification.",
                    "label": 1
                },
                {
                    "sent": "And finally, how to incorporate the?",
                    "label": 0
                },
                {
                    "sent": "As I said at the beginning, I we are assuming that the preferences for the different for different product categories for each user is static, so we are also investigating how to incorporate a time varying preference for each user in our model.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you animals.",
                    "label": 0
                },
                {
                    "sent": "Oh, it's on, but thanks.",
                    "label": 0
                },
                {
                    "sent": "There's a nice tie into, you know this thing about what do interests have to do with.",
                    "label": 0
                },
                {
                    "sent": "So I was I was curious about how you had this nice slide.",
                    "label": 0
                },
                {
                    "sent": "That said, if you look at the KL divergences on dig between people there overtime that it's sort of the number of people who have low KL, divergent sort of goes down and the number who have.",
                    "label": 0
                },
                {
                    "sent": "Big Kelly vergence.",
                    "label": 0
                },
                {
                    "sent": "It sort of goes up overtime.",
                    "label": 0
                },
                {
                    "sent": "I was just curious how you calculated KL divergent.",
                    "label": 0
                },
                {
                    "sent": "Maybe I just missed it because you know that you do.",
                    "label": 0
                },
                {
                    "sent": "If the topics were changing overtime or something, then maybe the maximum khalda vergence that was possible could go down.",
                    "label": 0
                },
                {
                    "sent": "You know something like that, so I was just curious what the idea was.",
                    "label": 0
                },
                {
                    "sent": "So yeah, so the topics are actually set by dig.com and stuff.",
                    "label": 0
                },
                {
                    "sent": "So when you submit a story you have to specify the topic in which this toys submitted so that there are 10 topics that are don't change and hear what we're doing is basically.",
                    "label": 0
                },
                {
                    "sent": "Computing the difference in the submission of two peers in different topics across the display specific page all across all time until this month.",
                    "label": 0
                },
                {
                    "sent": "So for like October, for instance, that include the all the submissions of these given two peers over all the months from July 12.",
                    "label": 0
                },
                {
                    "sent": "I am Brendan from crying melon.",
                    "label": 0
                },
                {
                    "sent": "How do you control 4?",
                    "label": 0
                },
                {
                    "sent": "How do you control for user activity during the period?",
                    "label": 0
                },
                {
                    "sent": "So do you know what fraction of the user like do you require that users demonstrated activity during the whole period of the crawl?",
                    "label": 0
                },
                {
                    "sent": "Or what happens if a user?",
                    "label": 0
                },
                {
                    "sent": "Say in July.",
                    "label": 0
                },
                {
                    "sent": "Was active, but then they became inactive.",
                    "label": 0
                },
                {
                    "sent": "So for in the crawling setting we actually told the topics and then we got the social network and the user submitting these topics.",
                    "label": 0
                },
                {
                    "sent": "So we have for each user, enough number of topics that covers the whole crawling.",
                    "label": 0
                },
                {
                    "sent": "So we didn't crowd for the users and then they could then get their topics we cloud for the stories and then get there.",
                    "label": 0
                }
            ]
        }
    }
}