{
    "id": "jwn5fqibecl7alsmkopkvhohv3gt33gd",
    "title": "On Detection of Multiple Object Instances using Hough Transforms",
    "info": {
        "author": [
            "Olga Barinova, Faculty of Computational Mathematics and Cybernetics, Lomonosov Moscow State University"
        ],
        "published": "July 19, 2010",
        "recorded": "June 2010",
        "category": [
            "Top->Computer Science->Computer Vision->Object Recognition"
        ]
    },
    "url": "http://videolectures.net/cvpr2010_barinova_odmo/",
    "segmentation": [
        [
            "Hello, my name is Olga Baranova and I'm presenting our joint work with Victor limpets key and push me to Cali on detection of multiple object instances using Hough transforms."
        ],
        [
            "So so just a short reminder about half transform, basically a half transform was initially suggested as a method for detecting lines in edge Maps.",
            "So how does it work?",
            "Each line in the edge map is projected into one point in a so called half space and half transform looks at every pixel in the edge map and for every line passing through it, it adds a vote to the corresponding point in the half image.",
            "After that we obtain half image and the peaks are in this image usually correspond to the lines in the edge map.",
            "So basically object.",
            "So basically half transform renders the task of object detection into the task of peaks identification in half images.",
            "But in recent years, half transform has grown.",
            "Sorry.",
            "Has grown much larger than just two 4 lines detection and great many paper addressed has half transform and construct of general object category detection.",
            "Here are just some landmark papers on this topic and just to underline how popular this approach is.",
            "Now only on the last CPR there were at least three papers devoted to object detection using Hough transforms."
        ],
        [
            "Let's have a closer look at.",
            "One of them are worked by gold and limpets key.",
            "What they do, they basically learner aggression, which Maps and appearance of or image patches to the position of object centers in the image.",
            "And here you can see the relative positions of objects enter let for the free patches and they're color coded after summing up all the votes from every Patch.",
            "We get a half image and the peak in this image correspond to an object, so that works fine if we have only one object."
        ],
        [
            "The image, but if we have many we face a problem becausw finding peaks in such a half map is difficult, and it's a difficult task in itself."
        ],
        [
            "So this problem holds going back to the line detection.",
            "And the.",
            "Actually identifying the peaks and half images is highly nontrivial in case of multiple close objects.",
            "What people usually do in this case the perform some kind of post processing, for example, not much maximum suppression is widely used, and actually this post processing means introducing some additional parameters which are not very meaningful and difficult to tune.",
            "But in this work we are presenting a normal framework which is very similar to half transform, although it doesn't require finding local maximum and so it doesn't need to perform non maximum suppression, it performs it automatically."
        ],
        [
            "So how does it work in our framework we also have elements voting elements which can be edge pixels in case of line detections.",
            "Or they they can be image patches in case of object detection and also we have a hypothesis which live in half space and the voting element vote for those hypothesis would have transform would do.",
            "It would just some old devotes.",
            "From high pull from voting elements and then pick the hypothesis which gets the highest vote.",
            "But we take a different approach.",
            "We see that each voting element has to choose."
        ],
        [
            "Which hypothesis it belongs to and or it can say that it belongs to background.",
            "To formalize that, we say that we introduce.",
            "Binary variables Y for hypothesis.",
            "Which take label one if hypothesis corresponds to an object which is present in the image or zero if there is no object and we introduce discrete variables X which denote which hypothesis the voting element votes for.",
            "Or it can also take the value 0 if element retains from voting and says that it's part of background.",
            "The key idea of our."
        ],
        [
            "Approach then is to perform map inference in X&Y jointly and get the most probable configuration of labeling."
        ],
        [
            "So.",
            "To do that, we make some assumptions.",
            "On the likelihood term of a posterior, we make an assumption that if we are given the labeling on X&Y's, the distributions of descriptors of voting elements are independent.",
            "Actually, in our paper we discuss in detail why this assumption is less crude than the one which is implicitly made by the traditional half transform, and for the product term we just take a very simple Occam razor or MDL prior, which just penalizes the number of active hypothesis."
        ],
        [
            "After doing some algebra and taking the log of posterior, we get the log posterior which has the following form and it corresponds to a graphical model which is shown in the graphical model.",
            "Sorry.",
            "It contains both X&Y variables and it has a form of bipartite graph so that each X variable is connected to each Y.",
            "Let's have a closer look at the log posterior.",
            "The first term corresponds to the unary on X, and it says how likely is that voting element belongs to a particular object, so.",
            "The good thing about this term is it just corresponds to the votes and traditional half transform, so we don't need any different training procedures.",
            "We don't have to come up with some new training schemes, we just can reuse the model's trained for the approaches that use half transform for object detection.",
            "The second term just incorporates our MDL prior so it just penalizes wise for taking value one.",
            "And the last term is a pairwise.",
            "It basically, uh.",
            "Just restricts.",
            "Voting element to vote for existent hypothesis and doesn't allow them voting for hypothesis which are switched off.",
            "The problem of map inference in such model is known in operational research community as the facility location and you can find.",
            "Another application in the paper by the longer poster session today.",
            "So."
        ],
        [
            "We tried different method for map inference in this model.",
            "And they all worked well.",
            "Bottom Actually, there was only one problem.",
            "If we took the two large set of hypothesis we graph becomes huge and.",
            "Inference becomes intractable, So what we did, we basically chose the most representative set of hypothesis and then performed inference only using that set.",
            "And it's not very nice becausw.",
            "We can lose some detections using this method, but if we have a."
        ],
        [
            "Closer look at the model.",
            "We can see that as long as the graph is bipartite, if we come up with some labeling on wise, this automatically implies labeling of X.",
            "So if we just need to do map inference, we can first maximize out X variables and get a low posterior in form of function or Y variables only.",
            "And what is good about this function is that it is submodular, so.",
            "We can be sure that using greedy algorithm is as good as using anything else.",
            "For example, belief propagation or simulated annealing, at least in terms of the approximation factor.",
            "So this suggests just using a simple greedy algorithm, and the interesting thing about grid error in our framework is that it is very similar to iterative."
        ],
        [
            "Can't transform how does it work?",
            "The general idea of greedy algorithm is that it starts with the empty set of deductions and adds detections one by one at each iteration, it chooses the greedy optimal direction.",
            "So in our case, choosing the greedy optimal detection means voting again, but votes change over iterations at each iteration.",
            "The vote of Element I for hypothesis H is expressed with the formula and.",
            "Represents represented by difference between standard half vote for Element I and a maximum over half votes for the hypothesis that have already been switched on, including background.",
            "So this is just an expression for again that you get if you switch on hypothesis age.",
            "Two then after summing up all the votes from all voting elements, we get a half image and choosing the greedy optimal hypothesis is just choosing the overall maximum in this half image.",
            "So after that we need to compare the value of this maximum to our penalty for adding a new hypothesis and if it is larger than we add a new detection to our set of detection.",
            "Or otherwise the process terminates."
        ],
        [
            "So this is just an example for pedestrian detection's.",
            "The algorithm starts with the half image shown on the left and we need to find the overall maximum in this half image.",
            "We find this maximum comparably value to the penalty, which is a parameter how algorithm and.",
            "It's higher, so we modify the votes of all voting elements, sum them, and obtain the second half image and you can see that in the second half image the.",
            "Peak that corresponds to the first detected object has gone, so you can see that non maximum suppression is performed automatically, so the algorithm proceeds and finds objects one by one and modifies half image.",
            "And at some point we get the maximum value of image which is lower than our penalty, and so the algorithm terminates."
        ],
        [
            "This is the result of comparison of our framework to standard health transform plus non maximum suppression.",
            "Both methods use the same trained half forest.",
            "A wide frames correspond to correct detections.",
            "Green frames correspond to missing objects, and red correspond to false positives."
        ],
        [
            "OK, so here you can see the quantitative comparison of our method to traditional half transform with non maximum suppression and in terms of precision recall it outperforms existing method."
        ],
        [
            "So we also experimented with Lions detection and you can find quantitative results in our paper, but I would like to show you that our method can find very close lines, those that non maximum suppression could never find without making very many false positives.",
            "And to sum up."
        ],
        [
            "Framework for detecting multiple objects performs grid inference, which is very similar to iterated half transform and with our framework there is no need to find local maximums and suppressing maximum we just need to take the global maximum and the training procedure stays the same so we don't need to come up with news training procedures.",
            "So thank you for attention.",
            "If there is any question, please come to the microphone.",
            "It's better if you go to the microphone so you don't have to repeat your question.",
            "Thank you.",
            "So in your graphical model, you have both X nodes and wine notes, right?",
            "So how do you determine the total number of wine notes?",
            "OK, the question was how we ended up with having only wine notes.",
            "Actually.",
            "OK, I'll say just in words.",
            "As long as our model is bipartite, if we know the labels of wise, the labels of access come automatically.",
            "So label of X is just a function of labels of eyes, so.",
            "So how many why notes are you going to put on the right hand side of OK, so how many white knows we want to put on the right side?",
            "Basically, in case of pedestrian detection's every pixel in an image is hypothesis for position of object center.",
            "So we have as many wives as pixels in the image I see.",
            "Thank you.",
            "Anymore questions.",
            "OK, so let's thank the speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello, my name is Olga Baranova and I'm presenting our joint work with Victor limpets key and push me to Cali on detection of multiple object instances using Hough transforms.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So so just a short reminder about half transform, basically a half transform was initially suggested as a method for detecting lines in edge Maps.",
                    "label": 0
                },
                {
                    "sent": "So how does it work?",
                    "label": 0
                },
                {
                    "sent": "Each line in the edge map is projected into one point in a so called half space and half transform looks at every pixel in the edge map and for every line passing through it, it adds a vote to the corresponding point in the half image.",
                    "label": 0
                },
                {
                    "sent": "After that we obtain half image and the peaks are in this image usually correspond to the lines in the edge map.",
                    "label": 0
                },
                {
                    "sent": "So basically object.",
                    "label": 0
                },
                {
                    "sent": "So basically half transform renders the task of object detection into the task of peaks identification in half images.",
                    "label": 1
                },
                {
                    "sent": "But in recent years, half transform has grown.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Has grown much larger than just two 4 lines detection and great many paper addressed has half transform and construct of general object category detection.",
                    "label": 0
                },
                {
                    "sent": "Here are just some landmark papers on this topic and just to underline how popular this approach is.",
                    "label": 1
                },
                {
                    "sent": "Now only on the last CPR there were at least three papers devoted to object detection using Hough transforms.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's have a closer look at.",
                    "label": 0
                },
                {
                    "sent": "One of them are worked by gold and limpets key.",
                    "label": 0
                },
                {
                    "sent": "What they do, they basically learner aggression, which Maps and appearance of or image patches to the position of object centers in the image.",
                    "label": 0
                },
                {
                    "sent": "And here you can see the relative positions of objects enter let for the free patches and they're color coded after summing up all the votes from every Patch.",
                    "label": 0
                },
                {
                    "sent": "We get a half image and the peak in this image correspond to an object, so that works fine if we have only one object.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The image, but if we have many we face a problem becausw finding peaks in such a half map is difficult, and it's a difficult task in itself.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this problem holds going back to the line detection.",
                    "label": 0
                },
                {
                    "sent": "And the.",
                    "label": 0
                },
                {
                    "sent": "Actually identifying the peaks and half images is highly nontrivial in case of multiple close objects.",
                    "label": 1
                },
                {
                    "sent": "What people usually do in this case the perform some kind of post processing, for example, not much maximum suppression is widely used, and actually this post processing means introducing some additional parameters which are not very meaningful and difficult to tune.",
                    "label": 0
                },
                {
                    "sent": "But in this work we are presenting a normal framework which is very similar to half transform, although it doesn't require finding local maximum and so it doesn't need to perform non maximum suppression, it performs it automatically.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So how does it work in our framework we also have elements voting elements which can be edge pixels in case of line detections.",
                    "label": 1
                },
                {
                    "sent": "Or they they can be image patches in case of object detection and also we have a hypothesis which live in half space and the voting element vote for those hypothesis would have transform would do.",
                    "label": 0
                },
                {
                    "sent": "It would just some old devotes.",
                    "label": 0
                },
                {
                    "sent": "From high pull from voting elements and then pick the hypothesis which gets the highest vote.",
                    "label": 0
                },
                {
                    "sent": "But we take a different approach.",
                    "label": 0
                },
                {
                    "sent": "We see that each voting element has to choose.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which hypothesis it belongs to and or it can say that it belongs to background.",
                    "label": 0
                },
                {
                    "sent": "To formalize that, we say that we introduce.",
                    "label": 0
                },
                {
                    "sent": "Binary variables Y for hypothesis.",
                    "label": 1
                },
                {
                    "sent": "Which take label one if hypothesis corresponds to an object which is present in the image or zero if there is no object and we introduce discrete variables X which denote which hypothesis the voting element votes for.",
                    "label": 0
                },
                {
                    "sent": "Or it can also take the value 0 if element retains from voting and says that it's part of background.",
                    "label": 0
                },
                {
                    "sent": "The key idea of our.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Approach then is to perform map inference in X&Y jointly and get the most probable configuration of labeling.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "To do that, we make some assumptions.",
                    "label": 0
                },
                {
                    "sent": "On the likelihood term of a posterior, we make an assumption that if we are given the labeling on X&Y's, the distributions of descriptors of voting elements are independent.",
                    "label": 1
                },
                {
                    "sent": "Actually, in our paper we discuss in detail why this assumption is less crude than the one which is implicitly made by the traditional half transform, and for the product term we just take a very simple Occam razor or MDL prior, which just penalizes the number of active hypothesis.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "After doing some algebra and taking the log of posterior, we get the log posterior which has the following form and it corresponds to a graphical model which is shown in the graphical model.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "It contains both X&Y variables and it has a form of bipartite graph so that each X variable is connected to each Y.",
                    "label": 0
                },
                {
                    "sent": "Let's have a closer look at the log posterior.",
                    "label": 0
                },
                {
                    "sent": "The first term corresponds to the unary on X, and it says how likely is that voting element belongs to a particular object, so.",
                    "label": 1
                },
                {
                    "sent": "The good thing about this term is it just corresponds to the votes and traditional half transform, so we don't need any different training procedures.",
                    "label": 0
                },
                {
                    "sent": "We don't have to come up with some new training schemes, we just can reuse the model's trained for the approaches that use half transform for object detection.",
                    "label": 0
                },
                {
                    "sent": "The second term just incorporates our MDL prior so it just penalizes wise for taking value one.",
                    "label": 0
                },
                {
                    "sent": "And the last term is a pairwise.",
                    "label": 0
                },
                {
                    "sent": "It basically, uh.",
                    "label": 0
                },
                {
                    "sent": "Just restricts.",
                    "label": 0
                },
                {
                    "sent": "Voting element to vote for existent hypothesis and doesn't allow them voting for hypothesis which are switched off.",
                    "label": 0
                },
                {
                    "sent": "The problem of map inference in such model is known in operational research community as the facility location and you can find.",
                    "label": 0
                },
                {
                    "sent": "Another application in the paper by the longer poster session today.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We tried different method for map inference in this model.",
                    "label": 1
                },
                {
                    "sent": "And they all worked well.",
                    "label": 0
                },
                {
                    "sent": "Bottom Actually, there was only one problem.",
                    "label": 1
                },
                {
                    "sent": "If we took the two large set of hypothesis we graph becomes huge and.",
                    "label": 0
                },
                {
                    "sent": "Inference becomes intractable, So what we did, we basically chose the most representative set of hypothesis and then performed inference only using that set.",
                    "label": 0
                },
                {
                    "sent": "And it's not very nice becausw.",
                    "label": 0
                },
                {
                    "sent": "We can lose some detections using this method, but if we have a.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Closer look at the model.",
                    "label": 0
                },
                {
                    "sent": "We can see that as long as the graph is bipartite, if we come up with some labeling on wise, this automatically implies labeling of X.",
                    "label": 0
                },
                {
                    "sent": "So if we just need to do map inference, we can first maximize out X variables and get a low posterior in form of function or Y variables only.",
                    "label": 0
                },
                {
                    "sent": "And what is good about this function is that it is submodular, so.",
                    "label": 0
                },
                {
                    "sent": "We can be sure that using greedy algorithm is as good as using anything else.",
                    "label": 1
                },
                {
                    "sent": "For example, belief propagation or simulated annealing, at least in terms of the approximation factor.",
                    "label": 0
                },
                {
                    "sent": "So this suggests just using a simple greedy algorithm, and the interesting thing about grid error in our framework is that it is very similar to iterative.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Can't transform how does it work?",
                    "label": 0
                },
                {
                    "sent": "The general idea of greedy algorithm is that it starts with the empty set of deductions and adds detections one by one at each iteration, it chooses the greedy optimal direction.",
                    "label": 0
                },
                {
                    "sent": "So in our case, choosing the greedy optimal detection means voting again, but votes change over iterations at each iteration.",
                    "label": 0
                },
                {
                    "sent": "The vote of Element I for hypothesis H is expressed with the formula and.",
                    "label": 0
                },
                {
                    "sent": "Represents represented by difference between standard half vote for Element I and a maximum over half votes for the hypothesis that have already been switched on, including background.",
                    "label": 1
                },
                {
                    "sent": "So this is just an expression for again that you get if you switch on hypothesis age.",
                    "label": 0
                },
                {
                    "sent": "Two then after summing up all the votes from all voting elements, we get a half image and choosing the greedy optimal hypothesis is just choosing the overall maximum in this half image.",
                    "label": 0
                },
                {
                    "sent": "So after that we need to compare the value of this maximum to our penalty for adding a new hypothesis and if it is larger than we add a new detection to our set of detection.",
                    "label": 0
                },
                {
                    "sent": "Or otherwise the process terminates.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is just an example for pedestrian detection's.",
                    "label": 0
                },
                {
                    "sent": "The algorithm starts with the half image shown on the left and we need to find the overall maximum in this half image.",
                    "label": 0
                },
                {
                    "sent": "We find this maximum comparably value to the penalty, which is a parameter how algorithm and.",
                    "label": 0
                },
                {
                    "sent": "It's higher, so we modify the votes of all voting elements, sum them, and obtain the second half image and you can see that in the second half image the.",
                    "label": 0
                },
                {
                    "sent": "Peak that corresponds to the first detected object has gone, so you can see that non maximum suppression is performed automatically, so the algorithm proceeds and finds objects one by one and modifies half image.",
                    "label": 0
                },
                {
                    "sent": "And at some point we get the maximum value of image which is lower than our penalty, and so the algorithm terminates.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the result of comparison of our framework to standard health transform plus non maximum suppression.",
                    "label": 0
                },
                {
                    "sent": "Both methods use the same trained half forest.",
                    "label": 0
                },
                {
                    "sent": "A wide frames correspond to correct detections.",
                    "label": 0
                },
                {
                    "sent": "Green frames correspond to missing objects, and red correspond to false positives.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so here you can see the quantitative comparison of our method to traditional half transform with non maximum suppression and in terms of precision recall it outperforms existing method.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we also experimented with Lions detection and you can find quantitative results in our paper, but I would like to show you that our method can find very close lines, those that non maximum suppression could never find without making very many false positives.",
                    "label": 0
                },
                {
                    "sent": "And to sum up.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Framework for detecting multiple objects performs grid inference, which is very similar to iterated half transform and with our framework there is no need to find local maximums and suppressing maximum we just need to take the global maximum and the training procedure stays the same so we don't need to come up with news training procedures.",
                    "label": 1
                },
                {
                    "sent": "So thank you for attention.",
                    "label": 0
                },
                {
                    "sent": "If there is any question, please come to the microphone.",
                    "label": 0
                },
                {
                    "sent": "It's better if you go to the microphone so you don't have to repeat your question.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "So in your graphical model, you have both X nodes and wine notes, right?",
                    "label": 0
                },
                {
                    "sent": "So how do you determine the total number of wine notes?",
                    "label": 0
                },
                {
                    "sent": "OK, the question was how we ended up with having only wine notes.",
                    "label": 0
                },
                {
                    "sent": "Actually.",
                    "label": 0
                },
                {
                    "sent": "OK, I'll say just in words.",
                    "label": 0
                },
                {
                    "sent": "As long as our model is bipartite, if we know the labels of wise, the labels of access come automatically.",
                    "label": 0
                },
                {
                    "sent": "So label of X is just a function of labels of eyes, so.",
                    "label": 0
                },
                {
                    "sent": "So how many why notes are you going to put on the right hand side of OK, so how many white knows we want to put on the right side?",
                    "label": 0
                },
                {
                    "sent": "Basically, in case of pedestrian detection's every pixel in an image is hypothesis for position of object center.",
                    "label": 0
                },
                {
                    "sent": "So we have as many wives as pixels in the image I see.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Anymore questions.",
                    "label": 0
                },
                {
                    "sent": "OK, so let's thank the speaker again.",
                    "label": 0
                }
            ]
        }
    }
}