{
    "id": "jx5l4etx4raptbzt5st65sorhpvvicv6",
    "title": "Kernlab",
    "info": {
        "author": [
            "Alexandros Karatzoglou, INSA of Rouen"
        ],
        "published": "Dec. 20, 2008",
        "recorded": "December 2008",
        "category": [
            "Top->Computer Science->Machine Learning->Software"
        ]
    },
    "url": "http://videolectures.net/mloss08_karatzoglou_kernlab/",
    "segmentation": [
        [
            "I will talk about kernel of, which is basically a machine learning package.",
            "We're 4, four R, and it's based around kernel methods.",
            "Obviously right?",
            "And this is joint work with Alex Moreland quote tonic."
        ],
        [
            "So.",
            "My talk is slightly different from the previous ones, so I'll give you a short introduction of kernel and then I'll try to go through demo.",
            "I hope it works."
        ],
        [
            "So currently up is in our package.",
            "Obviously it contains a wide range of kernel based machine learning methods.",
            "It uses R, it's based.",
            "It's it's written in our mostly and it it works in our effectively right?",
            "So it's 60 minutes extendable, extensible by exploiting the inherent modularity of kernel methods, and it's distributed under the GPL 2 license."
        ],
        [
            "So.",
            "Probably I mean probably all machine learners and you're probably using mostly as probably controversial statement, but mostly Matlab now are when you start are.",
            "I don't know now when you start on your computer.",
            "And in this case, on a Mac, this is what you get.",
            "You get a window with a terminal and you type commands.",
            "So in that respect it's quite similar to Matlab.",
            "And you can do all sorts of things you can do graphics you can do statistics analysis an.",
            "And with kernel up you can also do kernel based machine learning."
        ],
        [
            "So.",
            "Few details about our it's an environment for statistical data analysis, inference in visualization.",
            "It is.",
            "It is basically written by a team of statisticians worldwide team of statisticians, their ports for Unix windows.",
            "Anyway, you know your flavor of operating system?",
            "I mean, they're obviously also obviously also the source available and you can compile them anywhere you want.",
            "It's highly extensible through user.",
            "Defined functions.",
            "There's a number, a nice nice feature of ours that there's a number of generic functions.",
            "Which a lot of packages and models implement, and this gives it a uniform feeling, right?",
            "So you can implement your favorite method, your favorite algorithm.",
            "And then you can implement a plot method for it predict method for it, and a set of other methods.",
            "So once you get familiar with one set of functionality in are, you can kind of use that up.",
            "Sorry, use that too.",
            "Use that on other packages so there's about about 1200 add-on packages contributed by developers, so the world.",
            "The can be downloaded from from a central repository.",
            "It's called CC Ron.",
            "You might have heard of it and there are packages for multivariate statistics, machine learning, NLP, bioinformatics, this this quite big project bioconductor, you might have heard of it.",
            "And our is it has interface is fairly simple and fast interface to C, C + + 4 permainan Java."
        ],
        [
            "So how does the kernel package look like?",
            "So basically it is it is written in our right, so it uses the infrastructure of our.",
            "And you have the kernel components here, so you have 99 built-in kernel functions.",
            "And for what I call kernel expression functions, because usually when you when you want to write the kernel functions, kernel function or kernel algorithm, you don't, you don't use individual values of the kernel, you tend to use a kernel matrix apart of a kernel matrix are oh so you can use this function to compute this expressions and they actually vectorize them fairly for efficient.",
            "And there's also a set of utility functions now.",
            "Kernel kernel methods usually.",
            "Kernel algorithms often end up in a quadratic problem or in an eigenvalue decomposition or something like that, so their functions to deal with us with this optimization problems.",
            "And so, for example, this quadratic problem solver is an implementation of Smosh.",
            "There's an incomplete Cholesky decomposition, things like that, and they sit on this side of the diagram if you want.",
            "And then using using this functionality and the functionality.",
            "Now we implement the kernel methods.",
            "Now the kernel methods are we have about 18 kernel methods at the moment.",
            "In other kernel methods for regression, quantile regression, multiclass classification, novelty detection, what we have herbs there the SVM?",
            "So obviously Gaussian processes their clustering algorithms like kernel can mean spectral clustering is a ranking in dimension dimensionality reduction like kernel PCA.",
            "There's a kernel based to sample test and some other methods."
        ],
        [
            "Now these are four or five five of the kernels implemented in kernel up.",
            "This is obviously a kernel linear kernel, Gaussian kernel, hyperbolic tangent curve, the string kernel, and there's a neat feature to that you can actually.",
            "You can actually use text files, and I mean direct text.",
            "In most of the kernel functions in kernel up, so you can just load the text from your files.",
            "On your hard drive and do direct direct computations using the kernel methods in the string kernel using uh in kernel app, and then there's obviously the polynomial curve.",
            "I'll yeah, and I think another four building kernels.",
            "Oh, I forgot to mention actually that."
        ],
        [
            "Apart from the building kernels.",
            "The methods here.",
            "Can use.",
            "User defined curls and to define a user kernel.",
            "It's very simple.",
            "You only need to define a function that computes an inner product in your feature space.",
            "So it takes 2 arguments, two data points and returns a scalar which is the inner product in your feature space and that's it.",
            "You can take that function then I use it as an argument in all the existing methods in kernel app.",
            "And another feature is that if you're not happy with that, you can also use a precomputed kernel matrix so you can do all your computations, end up with a kernel matrix, and feed this basically into the kernel methods in the package."
        ],
        [
            "I mentioned that so.",
            "How do kernel functions in kernel it look like or they take as an input a kernel, the data or a kernel matrix?",
            "The kernel can be either user defined kernel or a building kernel.",
            "And the data.",
            "Obviously it can can be text or numeric data in a matrix or something like that.",
            "And along with this data in the kernel.",
            "There's a set of parameters for each function, which is given as an argument to the function and what you get back is an object is an object that contains the model parameters and some additional information on the computation.",
            "Maybe a cross validation or something like that and this objects can then be used with this generic functions I mentioned before.",
            "To predict or to plot.",
            "Or or any other thing you want to do with your model, right?"
        ],
        [
            "So we took.",
            "We took particular care in when we were programming kernel up to make it fairly.",
            "It's fairly easy to use with large datasets.",
            "I won't claim that's the best large scale system instead, but it's fairly it's fairly.",
            "We can deal with some real size datasets.",
            "We for example we used Nissan method for adding decomposition based methods.",
            "So you only need to use a slice of your kernel matrix to calculate a fairly good approximation of your eigenvectors.",
            "This scales scales linearly with size of the data set and quadratically with the size of your cubically.",
            "Excuse me, the size of your sample.",
            "The building kernel functions and the kernel function computations.",
            "The computation of a kernel matrix are vectorized, so this is a gives a lot of performance we.",
            "Sorry about that and we used to see plus plus on performance bottlenecks and we also to try to use algorithms to scale fairly well."
        ],
        [
            "Most yeah, most functions also implement additional features such as cross validation for SVM, synjyn processes.",
            "Model selection, in particular hyperparameter estimation, data scaling, and there is also extensive documentation of all the methods and the options in the methods."
        ],
        [
            "Just try I will.",
            "I will not try to go through this day more prepared.",
            "Let's hope it works.",
            "So.",
            "This is when you start are in on a Mac.",
            "That's what you get, right?",
            "You get a window with a prompt.",
            "And you have to start.",
            "Running some commands I prepared here script and I'll go through it as I won't type just.",
            "Just to gain some time.",
            "So how do you lower the library?",
            "There's a command in our code library curl up.",
            "So basically now the package in the functionality in the package is available.",
            "We're going to create a kernel function and for the building kernel functions there are this creator functions which taken the hyperparameters as an argument and return a real kernel function, right?",
            "So for the Gaussian kernel, it's called RBF DOT and the hyperparameter there is the width of the kernel.",
            "Obviously we set it to one and we get a kernel function.",
            "So let's have a look at this kernel function.",
            "You can see it says it's a Gaussian radial basis kernel function and the hyperparameter.",
            "So create a toy data set now.",
            "So it's basically a sample out of two Gaussian distributions with some labels.",
            "Here you can see right too.",
            "Sample sort of discussion distributions, and I will train the support vector machine.",
            "So let me explain to you what's happening now so this case VM function implements a support vector machine.",
            "X&YRU Dayton labels the kernel is the kernel we just initialized here.",
            "This is a C support vector classification algorithm.",
            "And we have a cross validation here.",
            "Parameter three fold cross validation.",
            "And the cost, the cost parameter of the SVM is set to five.",
            "Now we have the support vector machine.",
            "I think there I think there are seven different support vector machines multiclass.",
            "Novelty detection Native Multi class one against one regression, new SVC regression and some other ones.",
            "So now we have our model which is in this object in this object here which is called SVP.",
            "So let's have a quick look at this model so you can see it tells you what kernel has been used, what cost parameter has been used, the number of support vectors found.",
            "The objective function value the training error, the cross validation or so.",
            "We can now have a.",
            "We can now use this generic function I mentioned before.",
            "Plot on this object and see what we get.",
            "And in our case we get a contour plot.",
            "The actual decision function.",
            "OK, so we have the Gaussians sample of the Gaussian.",
            "The Contour Plot is a Contra plot of the actual decision function of the support vector machine.",
            "Blue is for positive labels, ready from negative labels.",
            "And this black points are the support vectors and triangles.",
            "I don't know if you can see them are labeled this minus one and the circle is plus one, right?",
            "Now this is so fine, but you might want to use your own kernel function.",
            "So we can go and define the current function, and this is fairly simple.",
            "So you can see here I define a function that takes 2 arguments X&Y, so this these are two data points and this expression here implements my kernel function.",
            "In this case it's just product between linear kernel in a Gaussian kernel.",
            "And cases what my function is, right?",
            "So I need to.",
            "I need to set the class of the function as a kernel now.",
            "And I can take note this function and use it in my support vector machine so you can see I set the kernel to be this function here.",
            "And now let's have a look again in the contour plot, so you can see it's slightly different contour plot, but it still works fairly well.",
            "I.",
            "So I'm gonna I'm going to give you another example using in our text data, so this is obviously using.",
            "Datamatrix labels the nice thing.",
            "The nice thing about Colonel is that you can actually use a text data directly with all these methods, so I'm going to lot part of the writer writer status.",
            "It's it's about 100 news.",
            "News text from these two topics.",
            "Cruden ayscue.",
            "I don't know if you're familiar with that.",
            "So we'll just load the data from the.",
            "From the hard drive and we will do a principle component analysis using our string kernel.",
            "Aspect spectral to string kernel.",
            "If you're familiar with string kernels.",
            "And we're going to calculate 2 principal components.",
            "So it's gonna take visit Bout 100 text files.",
            "It takes a couple of seconds.",
            "So it's finished.",
            "And.",
            "We're going to try now to plot the projection of the text files into these two principal components, and we're going to use the actual labels of the text files to call over the plot, so.",
            "That is what you get, I think.",
            "Here you have the acq text documents and here you have the crude text documents.",
            "And and by the way, let me let me go maybe a bit over this kernel PCA function you can see in this case you can actually there are two ways of giving of passing kernels as arguments to the function ones.",
            "You create your kernel function and you pass this argument.",
            "The other one is you can actually just state as a character string.",
            "The type of kernel function you want and then pass its arguments also as a list to the function.",
            "So so this is essentially the same thing, but it's more convenient way if you want to to pass the kernel method to carry the kernel into the kernel method.",
            "And now we're going to use a spectral clustering algorithm to see if we can retrieve clusters into this in these two.",
            "Groups of text document if you want.",
            "So we use this SPCSPCC function which implements a spectral clustering algorithm.",
            "We pass the actual text data as an argument, number of clusters two, and the.",
            "String kernel.",
            "And we get these TCL upscaling.",
            "This TCL object which contains the model or the actual cluster cluster assignments.",
            "So.",
            "Let's have a quick look at that.",
            "So you have the cluster memberships here and some additional information about the clustering 53.",
            "Type documents were clustered in one class to 49 into the other one.",
            "And we are going to use now this cluster membership to color this plot.",
            "And you can see the plot actually looks almost exactly the same as as before, when we were using the actual labels, so it's fairly good clustering.",
            "I'm going to give you a short demo of the.",
            "Colonel quantile regression method.",
            "So I don't know if you're familiar with quantile regression so, but I'll just give you a demonstration.",
            "Maybe you understand what it does, so I will create some regression data heteroskedastic with.",
            "Variable variability if you want or a viable standard deviation.",
            "So let's do that and let's plot it.",
            "So that's how the data actually looks like, OK, just.",
            "And.",
            "And I'm going to run the kernel quantile regression method.",
            "And I will use the predict function to draw a line on this plot.",
            "So I do the predict on the training data.",
            "And they use the lines to actually plot and you can see this is the 0.5 quantile, so it's in effect is the median through the data.",
            "OK, now if you want to use the Calculator 0.9 quantile you just change this to parameter here to 0.9.",
            "And let me go quickly through it.",
            "And you can see.",
            "You can calculate 0.9 quantile and very similarly.",
            "I'm running out of time.",
            "You can also do that for the lower 0.1 quantile.",
            "OK, so that's basically curl up and it's obviously it's free and you can download it just sits on, see run.",
            "Thank."
        ],
        [
            "Yeah.",
            "So we have time for one quick question, but in.",
            "And so you know, connected computer why we're taking questions.",
            "Fuck you.",
            "Do you make can you increase the sparse anymore?",
            "Don't express data.",
            "I'm working on that.",
            "That's actually yeah yeah that's on there.",
            "We will implement the sparse the matrix sparse.",
            "There's this past library now called Matrix and we will interface with that.",
            "So thanks, so I suppose I have to give you this.",
            "OK, so let's thank the speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I will talk about kernel of, which is basically a machine learning package.",
                    "label": 0
                },
                {
                    "sent": "We're 4, four R, and it's based around kernel methods.",
                    "label": 0
                },
                {
                    "sent": "Obviously right?",
                    "label": 0
                },
                {
                    "sent": "And this is joint work with Alex Moreland quote tonic.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "My talk is slightly different from the previous ones, so I'll give you a short introduction of kernel and then I'll try to go through demo.",
                    "label": 0
                },
                {
                    "sent": "I hope it works.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So currently up is in our package.",
                    "label": 0
                },
                {
                    "sent": "Obviously it contains a wide range of kernel based machine learning methods.",
                    "label": 1
                },
                {
                    "sent": "It uses R, it's based.",
                    "label": 0
                },
                {
                    "sent": "It's it's written in our mostly and it it works in our effectively right?",
                    "label": 0
                },
                {
                    "sent": "So it's 60 minutes extendable, extensible by exploiting the inherent modularity of kernel methods, and it's distributed under the GPL 2 license.",
                    "label": 1
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Probably I mean probably all machine learners and you're probably using mostly as probably controversial statement, but mostly Matlab now are when you start are.",
                    "label": 0
                },
                {
                    "sent": "I don't know now when you start on your computer.",
                    "label": 0
                },
                {
                    "sent": "And in this case, on a Mac, this is what you get.",
                    "label": 0
                },
                {
                    "sent": "You get a window with a terminal and you type commands.",
                    "label": 0
                },
                {
                    "sent": "So in that respect it's quite similar to Matlab.",
                    "label": 0
                },
                {
                    "sent": "And you can do all sorts of things you can do graphics you can do statistics analysis an.",
                    "label": 0
                },
                {
                    "sent": "And with kernel up you can also do kernel based machine learning.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Few details about our it's an environment for statistical data analysis, inference in visualization.",
                    "label": 1
                },
                {
                    "sent": "It is.",
                    "label": 1
                },
                {
                    "sent": "It is basically written by a team of statisticians worldwide team of statisticians, their ports for Unix windows.",
                    "label": 0
                },
                {
                    "sent": "Anyway, you know your flavor of operating system?",
                    "label": 0
                },
                {
                    "sent": "I mean, they're obviously also obviously also the source available and you can compile them anywhere you want.",
                    "label": 1
                },
                {
                    "sent": "It's highly extensible through user.",
                    "label": 0
                },
                {
                    "sent": "Defined functions.",
                    "label": 0
                },
                {
                    "sent": "There's a number, a nice nice feature of ours that there's a number of generic functions.",
                    "label": 0
                },
                {
                    "sent": "Which a lot of packages and models implement, and this gives it a uniform feeling, right?",
                    "label": 0
                },
                {
                    "sent": "So you can implement your favorite method, your favorite algorithm.",
                    "label": 0
                },
                {
                    "sent": "And then you can implement a plot method for it predict method for it, and a set of other methods.",
                    "label": 0
                },
                {
                    "sent": "So once you get familiar with one set of functionality in are, you can kind of use that up.",
                    "label": 0
                },
                {
                    "sent": "Sorry, use that too.",
                    "label": 0
                },
                {
                    "sent": "Use that on other packages so there's about about 1200 add-on packages contributed by developers, so the world.",
                    "label": 1
                },
                {
                    "sent": "The can be downloaded from from a central repository.",
                    "label": 0
                },
                {
                    "sent": "It's called CC Ron.",
                    "label": 0
                },
                {
                    "sent": "You might have heard of it and there are packages for multivariate statistics, machine learning, NLP, bioinformatics, this this quite big project bioconductor, you might have heard of it.",
                    "label": 0
                },
                {
                    "sent": "And our is it has interface is fairly simple and fast interface to C, C + + 4 permainan Java.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So how does the kernel package look like?",
                    "label": 0
                },
                {
                    "sent": "So basically it is it is written in our right, so it uses the infrastructure of our.",
                    "label": 0
                },
                {
                    "sent": "And you have the kernel components here, so you have 99 built-in kernel functions.",
                    "label": 0
                },
                {
                    "sent": "And for what I call kernel expression functions, because usually when you when you want to write the kernel functions, kernel function or kernel algorithm, you don't, you don't use individual values of the kernel, you tend to use a kernel matrix apart of a kernel matrix are oh so you can use this function to compute this expressions and they actually vectorize them fairly for efficient.",
                    "label": 0
                },
                {
                    "sent": "And there's also a set of utility functions now.",
                    "label": 0
                },
                {
                    "sent": "Kernel kernel methods usually.",
                    "label": 0
                },
                {
                    "sent": "Kernel algorithms often end up in a quadratic problem or in an eigenvalue decomposition or something like that, so their functions to deal with us with this optimization problems.",
                    "label": 0
                },
                {
                    "sent": "And so, for example, this quadratic problem solver is an implementation of Smosh.",
                    "label": 1
                },
                {
                    "sent": "There's an incomplete Cholesky decomposition, things like that, and they sit on this side of the diagram if you want.",
                    "label": 0
                },
                {
                    "sent": "And then using using this functionality and the functionality.",
                    "label": 0
                },
                {
                    "sent": "Now we implement the kernel methods.",
                    "label": 0
                },
                {
                    "sent": "Now the kernel methods are we have about 18 kernel methods at the moment.",
                    "label": 0
                },
                {
                    "sent": "In other kernel methods for regression, quantile regression, multiclass classification, novelty detection, what we have herbs there the SVM?",
                    "label": 1
                },
                {
                    "sent": "So obviously Gaussian processes their clustering algorithms like kernel can mean spectral clustering is a ranking in dimension dimensionality reduction like kernel PCA.",
                    "label": 1
                },
                {
                    "sent": "There's a kernel based to sample test and some other methods.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now these are four or five five of the kernels implemented in kernel up.",
                    "label": 0
                },
                {
                    "sent": "This is obviously a kernel linear kernel, Gaussian kernel, hyperbolic tangent curve, the string kernel, and there's a neat feature to that you can actually.",
                    "label": 1
                },
                {
                    "sent": "You can actually use text files, and I mean direct text.",
                    "label": 0
                },
                {
                    "sent": "In most of the kernel functions in kernel up, so you can just load the text from your files.",
                    "label": 0
                },
                {
                    "sent": "On your hard drive and do direct direct computations using the kernel methods in the string kernel using uh in kernel app, and then there's obviously the polynomial curve.",
                    "label": 0
                },
                {
                    "sent": "I'll yeah, and I think another four building kernels.",
                    "label": 0
                },
                {
                    "sent": "Oh, I forgot to mention actually that.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Apart from the building kernels.",
                    "label": 0
                },
                {
                    "sent": "The methods here.",
                    "label": 0
                },
                {
                    "sent": "Can use.",
                    "label": 0
                },
                {
                    "sent": "User defined curls and to define a user kernel.",
                    "label": 0
                },
                {
                    "sent": "It's very simple.",
                    "label": 0
                },
                {
                    "sent": "You only need to define a function that computes an inner product in your feature space.",
                    "label": 0
                },
                {
                    "sent": "So it takes 2 arguments, two data points and returns a scalar which is the inner product in your feature space and that's it.",
                    "label": 0
                },
                {
                    "sent": "You can take that function then I use it as an argument in all the existing methods in kernel app.",
                    "label": 0
                },
                {
                    "sent": "And another feature is that if you're not happy with that, you can also use a precomputed kernel matrix so you can do all your computations, end up with a kernel matrix, and feed this basically into the kernel methods in the package.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I mentioned that so.",
                    "label": 0
                },
                {
                    "sent": "How do kernel functions in kernel it look like or they take as an input a kernel, the data or a kernel matrix?",
                    "label": 1
                },
                {
                    "sent": "The kernel can be either user defined kernel or a building kernel.",
                    "label": 0
                },
                {
                    "sent": "And the data.",
                    "label": 0
                },
                {
                    "sent": "Obviously it can can be text or numeric data in a matrix or something like that.",
                    "label": 1
                },
                {
                    "sent": "And along with this data in the kernel.",
                    "label": 0
                },
                {
                    "sent": "There's a set of parameters for each function, which is given as an argument to the function and what you get back is an object is an object that contains the model parameters and some additional information on the computation.",
                    "label": 0
                },
                {
                    "sent": "Maybe a cross validation or something like that and this objects can then be used with this generic functions I mentioned before.",
                    "label": 1
                },
                {
                    "sent": "To predict or to plot.",
                    "label": 0
                },
                {
                    "sent": "Or or any other thing you want to do with your model, right?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we took.",
                    "label": 0
                },
                {
                    "sent": "We took particular care in when we were programming kernel up to make it fairly.",
                    "label": 0
                },
                {
                    "sent": "It's fairly easy to use with large datasets.",
                    "label": 0
                },
                {
                    "sent": "I won't claim that's the best large scale system instead, but it's fairly it's fairly.",
                    "label": 0
                },
                {
                    "sent": "We can deal with some real size datasets.",
                    "label": 0
                },
                {
                    "sent": "We for example we used Nissan method for adding decomposition based methods.",
                    "label": 1
                },
                {
                    "sent": "So you only need to use a slice of your kernel matrix to calculate a fairly good approximation of your eigenvectors.",
                    "label": 0
                },
                {
                    "sent": "This scales scales linearly with size of the data set and quadratically with the size of your cubically.",
                    "label": 0
                },
                {
                    "sent": "Excuse me, the size of your sample.",
                    "label": 1
                },
                {
                    "sent": "The building kernel functions and the kernel function computations.",
                    "label": 1
                },
                {
                    "sent": "The computation of a kernel matrix are vectorized, so this is a gives a lot of performance we.",
                    "label": 0
                },
                {
                    "sent": "Sorry about that and we used to see plus plus on performance bottlenecks and we also to try to use algorithms to scale fairly well.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Most yeah, most functions also implement additional features such as cross validation for SVM, synjyn processes.",
                    "label": 0
                },
                {
                    "sent": "Model selection, in particular hyperparameter estimation, data scaling, and there is also extensive documentation of all the methods and the options in the methods.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just try I will.",
                    "label": 0
                },
                {
                    "sent": "I will not try to go through this day more prepared.",
                    "label": 0
                },
                {
                    "sent": "Let's hope it works.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This is when you start are in on a Mac.",
                    "label": 0
                },
                {
                    "sent": "That's what you get, right?",
                    "label": 0
                },
                {
                    "sent": "You get a window with a prompt.",
                    "label": 0
                },
                {
                    "sent": "And you have to start.",
                    "label": 0
                },
                {
                    "sent": "Running some commands I prepared here script and I'll go through it as I won't type just.",
                    "label": 0
                },
                {
                    "sent": "Just to gain some time.",
                    "label": 0
                },
                {
                    "sent": "So how do you lower the library?",
                    "label": 0
                },
                {
                    "sent": "There's a command in our code library curl up.",
                    "label": 0
                },
                {
                    "sent": "So basically now the package in the functionality in the package is available.",
                    "label": 0
                },
                {
                    "sent": "We're going to create a kernel function and for the building kernel functions there are this creator functions which taken the hyperparameters as an argument and return a real kernel function, right?",
                    "label": 0
                },
                {
                    "sent": "So for the Gaussian kernel, it's called RBF DOT and the hyperparameter there is the width of the kernel.",
                    "label": 0
                },
                {
                    "sent": "Obviously we set it to one and we get a kernel function.",
                    "label": 0
                },
                {
                    "sent": "So let's have a look at this kernel function.",
                    "label": 0
                },
                {
                    "sent": "You can see it says it's a Gaussian radial basis kernel function and the hyperparameter.",
                    "label": 0
                },
                {
                    "sent": "So create a toy data set now.",
                    "label": 0
                },
                {
                    "sent": "So it's basically a sample out of two Gaussian distributions with some labels.",
                    "label": 0
                },
                {
                    "sent": "Here you can see right too.",
                    "label": 0
                },
                {
                    "sent": "Sample sort of discussion distributions, and I will train the support vector machine.",
                    "label": 0
                },
                {
                    "sent": "So let me explain to you what's happening now so this case VM function implements a support vector machine.",
                    "label": 0
                },
                {
                    "sent": "X&YRU Dayton labels the kernel is the kernel we just initialized here.",
                    "label": 0
                },
                {
                    "sent": "This is a C support vector classification algorithm.",
                    "label": 0
                },
                {
                    "sent": "And we have a cross validation here.",
                    "label": 0
                },
                {
                    "sent": "Parameter three fold cross validation.",
                    "label": 0
                },
                {
                    "sent": "And the cost, the cost parameter of the SVM is set to five.",
                    "label": 0
                },
                {
                    "sent": "Now we have the support vector machine.",
                    "label": 0
                },
                {
                    "sent": "I think there I think there are seven different support vector machines multiclass.",
                    "label": 0
                },
                {
                    "sent": "Novelty detection Native Multi class one against one regression, new SVC regression and some other ones.",
                    "label": 0
                },
                {
                    "sent": "So now we have our model which is in this object in this object here which is called SVP.",
                    "label": 0
                },
                {
                    "sent": "So let's have a quick look at this model so you can see it tells you what kernel has been used, what cost parameter has been used, the number of support vectors found.",
                    "label": 0
                },
                {
                    "sent": "The objective function value the training error, the cross validation or so.",
                    "label": 0
                },
                {
                    "sent": "We can now have a.",
                    "label": 0
                },
                {
                    "sent": "We can now use this generic function I mentioned before.",
                    "label": 0
                },
                {
                    "sent": "Plot on this object and see what we get.",
                    "label": 0
                },
                {
                    "sent": "And in our case we get a contour plot.",
                    "label": 0
                },
                {
                    "sent": "The actual decision function.",
                    "label": 0
                },
                {
                    "sent": "OK, so we have the Gaussians sample of the Gaussian.",
                    "label": 0
                },
                {
                    "sent": "The Contour Plot is a Contra plot of the actual decision function of the support vector machine.",
                    "label": 0
                },
                {
                    "sent": "Blue is for positive labels, ready from negative labels.",
                    "label": 0
                },
                {
                    "sent": "And this black points are the support vectors and triangles.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you can see them are labeled this minus one and the circle is plus one, right?",
                    "label": 0
                },
                {
                    "sent": "Now this is so fine, but you might want to use your own kernel function.",
                    "label": 0
                },
                {
                    "sent": "So we can go and define the current function, and this is fairly simple.",
                    "label": 0
                },
                {
                    "sent": "So you can see here I define a function that takes 2 arguments X&Y, so this these are two data points and this expression here implements my kernel function.",
                    "label": 0
                },
                {
                    "sent": "In this case it's just product between linear kernel in a Gaussian kernel.",
                    "label": 0
                },
                {
                    "sent": "And cases what my function is, right?",
                    "label": 0
                },
                {
                    "sent": "So I need to.",
                    "label": 0
                },
                {
                    "sent": "I need to set the class of the function as a kernel now.",
                    "label": 0
                },
                {
                    "sent": "And I can take note this function and use it in my support vector machine so you can see I set the kernel to be this function here.",
                    "label": 0
                },
                {
                    "sent": "And now let's have a look again in the contour plot, so you can see it's slightly different contour plot, but it still works fairly well.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "So I'm gonna I'm going to give you another example using in our text data, so this is obviously using.",
                    "label": 0
                },
                {
                    "sent": "Datamatrix labels the nice thing.",
                    "label": 0
                },
                {
                    "sent": "The nice thing about Colonel is that you can actually use a text data directly with all these methods, so I'm going to lot part of the writer writer status.",
                    "label": 0
                },
                {
                    "sent": "It's it's about 100 news.",
                    "label": 0
                },
                {
                    "sent": "News text from these two topics.",
                    "label": 0
                },
                {
                    "sent": "Cruden ayscue.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you're familiar with that.",
                    "label": 0
                },
                {
                    "sent": "So we'll just load the data from the.",
                    "label": 0
                },
                {
                    "sent": "From the hard drive and we will do a principle component analysis using our string kernel.",
                    "label": 0
                },
                {
                    "sent": "Aspect spectral to string kernel.",
                    "label": 0
                },
                {
                    "sent": "If you're familiar with string kernels.",
                    "label": 0
                },
                {
                    "sent": "And we're going to calculate 2 principal components.",
                    "label": 0
                },
                {
                    "sent": "So it's gonna take visit Bout 100 text files.",
                    "label": 0
                },
                {
                    "sent": "It takes a couple of seconds.",
                    "label": 0
                },
                {
                    "sent": "So it's finished.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "We're going to try now to plot the projection of the text files into these two principal components, and we're going to use the actual labels of the text files to call over the plot, so.",
                    "label": 0
                },
                {
                    "sent": "That is what you get, I think.",
                    "label": 0
                },
                {
                    "sent": "Here you have the acq text documents and here you have the crude text documents.",
                    "label": 0
                },
                {
                    "sent": "And and by the way, let me let me go maybe a bit over this kernel PCA function you can see in this case you can actually there are two ways of giving of passing kernels as arguments to the function ones.",
                    "label": 0
                },
                {
                    "sent": "You create your kernel function and you pass this argument.",
                    "label": 0
                },
                {
                    "sent": "The other one is you can actually just state as a character string.",
                    "label": 0
                },
                {
                    "sent": "The type of kernel function you want and then pass its arguments also as a list to the function.",
                    "label": 0
                },
                {
                    "sent": "So so this is essentially the same thing, but it's more convenient way if you want to to pass the kernel method to carry the kernel into the kernel method.",
                    "label": 0
                },
                {
                    "sent": "And now we're going to use a spectral clustering algorithm to see if we can retrieve clusters into this in these two.",
                    "label": 0
                },
                {
                    "sent": "Groups of text document if you want.",
                    "label": 0
                },
                {
                    "sent": "So we use this SPCSPCC function which implements a spectral clustering algorithm.",
                    "label": 0
                },
                {
                    "sent": "We pass the actual text data as an argument, number of clusters two, and the.",
                    "label": 0
                },
                {
                    "sent": "String kernel.",
                    "label": 0
                },
                {
                    "sent": "And we get these TCL upscaling.",
                    "label": 0
                },
                {
                    "sent": "This TCL object which contains the model or the actual cluster cluster assignments.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Let's have a quick look at that.",
                    "label": 0
                },
                {
                    "sent": "So you have the cluster memberships here and some additional information about the clustering 53.",
                    "label": 0
                },
                {
                    "sent": "Type documents were clustered in one class to 49 into the other one.",
                    "label": 0
                },
                {
                    "sent": "And we are going to use now this cluster membership to color this plot.",
                    "label": 0
                },
                {
                    "sent": "And you can see the plot actually looks almost exactly the same as as before, when we were using the actual labels, so it's fairly good clustering.",
                    "label": 0
                },
                {
                    "sent": "I'm going to give you a short demo of the.",
                    "label": 0
                },
                {
                    "sent": "Colonel quantile regression method.",
                    "label": 0
                },
                {
                    "sent": "So I don't know if you're familiar with quantile regression so, but I'll just give you a demonstration.",
                    "label": 0
                },
                {
                    "sent": "Maybe you understand what it does, so I will create some regression data heteroskedastic with.",
                    "label": 0
                },
                {
                    "sent": "Variable variability if you want or a viable standard deviation.",
                    "label": 0
                },
                {
                    "sent": "So let's do that and let's plot it.",
                    "label": 0
                },
                {
                    "sent": "So that's how the data actually looks like, OK, just.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And I'm going to run the kernel quantile regression method.",
                    "label": 0
                },
                {
                    "sent": "And I will use the predict function to draw a line on this plot.",
                    "label": 0
                },
                {
                    "sent": "So I do the predict on the training data.",
                    "label": 0
                },
                {
                    "sent": "And they use the lines to actually plot and you can see this is the 0.5 quantile, so it's in effect is the median through the data.",
                    "label": 0
                },
                {
                    "sent": "OK, now if you want to use the Calculator 0.9 quantile you just change this to parameter here to 0.9.",
                    "label": 0
                },
                {
                    "sent": "And let me go quickly through it.",
                    "label": 0
                },
                {
                    "sent": "And you can see.",
                    "label": 0
                },
                {
                    "sent": "You can calculate 0.9 quantile and very similarly.",
                    "label": 0
                },
                {
                    "sent": "I'm running out of time.",
                    "label": 0
                },
                {
                    "sent": "You can also do that for the lower 0.1 quantile.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's basically curl up and it's obviously it's free and you can download it just sits on, see run.",
                    "label": 0
                },
                {
                    "sent": "Thank.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "So we have time for one quick question, but in.",
                    "label": 0
                },
                {
                    "sent": "And so you know, connected computer why we're taking questions.",
                    "label": 0
                },
                {
                    "sent": "Fuck you.",
                    "label": 0
                },
                {
                    "sent": "Do you make can you increase the sparse anymore?",
                    "label": 0
                },
                {
                    "sent": "Don't express data.",
                    "label": 0
                },
                {
                    "sent": "I'm working on that.",
                    "label": 0
                },
                {
                    "sent": "That's actually yeah yeah that's on there.",
                    "label": 0
                },
                {
                    "sent": "We will implement the sparse the matrix sparse.",
                    "label": 0
                },
                {
                    "sent": "There's this past library now called Matrix and we will interface with that.",
                    "label": 0
                },
                {
                    "sent": "So thanks, so I suppose I have to give you this.",
                    "label": 0
                },
                {
                    "sent": "OK, so let's thank the speaker again.",
                    "label": 0
                }
            ]
        }
    }
}