{
    "id": "jyomcnxbqd4cteixju2eyqhe7kcce73u",
    "title": "An Efficient Ontology-Based Expert Peering System",
    "info": {
        "author": [
            "Tansu Alpcan, Deutsche Telekom Laboratories"
        ],
        "published": "July 12, 2007",
        "recorded": "June 2007",
        "category": [
            "Top->Computer Science->Semantic Web->Ontologies"
        ]
    },
    "url": "http://videolectures.net/gbr07_alpcan_aeobeps/",
    "segmentation": [
        [
            "Thank you so that makes this is joint work with my quarters Christian bulk.",
            "Again.",
            "Who's actually more expert in graph based methods and computer vision?",
            "I should start with a disclaimer.",
            "I'm very new to this idea or outside this idea.",
            "I'm even knew to the machine learning itself and this one.",
            "One disclaimer.",
            "The second disclaimer is this is more applied work that is part of an applied research project with development part.",
            "Actually I want to.",
            "If time permits, show you the application itself that the prototype that we have developed in the laps, and therefore it's light on the theory when compared to all the nice work here that's shown here.",
            "On the other hand, I would really welcome your feedback and comments.",
            "It's a project that we started only in last November and we have got good students working on it and we will continue improving our."
        ],
        [
            "So essentially this is the outline of my toy."
        ],
        [
            "And the application areas drastically different from any any vision and related stuff.",
            "It is about expert piering system for community based information exchanged and we use natural graph based scheme that consists of a taxonomy where each node represents a topic.",
            "And what we do is the users ask a question and we try to find the best experts who can answer that question.",
            "The two that we map the profiles of the experts and the questions too.",
            "Subtrees of this ontology.",
            "So this is kind of used.",
            "This ontology as a space ontology space.",
            "And then the problem becomes matching queries.",
            "Assigning courage to the relevant experts becomes a problem of graph matching, but this is easy problem because we have a fixed graph.",
            "Ontologist fixed currently at least then we use a serialization of this ontology three or the taxonomy which enables us to use simple dot products to find to find the experts.",
            "And efficiency is important for this problem because we.",
            "This has to work in real time."
        ],
        [
            "Real time not not, not necessarily, so this is the ontology, that tree that we consider.",
            "How are we identify the topic?",
            "So here assume this is art.",
            "This is computer science, the other ones is physics.",
            "For example, the subtopics could be the theoretical physics quantum physics and and subtopics of quantum physics.",
            "Quantum mechanics, for example an.",
            "So each topic is identified by a bag of verts, and then these bag of words are later aggregated.",
            "Going up so the parents bag of words contains the children nodes bag of words as one of the advantages of this hierarchical graph based approach is when we try to solve this problem from top to down.",
            "It enables us to do it in level wise and innocence brings some robustness to the picture because we solve start with a simple classification problem.",
            "When assigning the query to the experts and then go down to more and more complex."
        ],
        [
            "Fication problems, so as I say, how we handle this mathematically, essentially we take a serialization of the tree and serialization works and create associated vector representation for the query or the respective expert and represent these entities as subtrees of tautology on this ontology space.",
            "To be able to do that.",
            "Of course we need to 1st define a similarity measure between the two entities being the expert or the query to the topics on the tree.",
            "And we do this.",
            "Anything can be used to, but this simple version is a cosine similarity.",
            "This started with that one."
        ],
        [
            "So this is.",
            "Let's picture pictorially.",
            "To make it simpler for the audience, an expert on two topics is represented by, for example, as the subtree that you see there with two leaves and go up each subtree answering the leaves, of course, and then the query.",
            "For example, on a topic of this leave will be represented by this other subtree, and then through the DOT product one finds the you have.",
            "Of course, an experts for the case A.",
            "And then the query is compared with DOT products with each of the experts and the best expert is."
        ],
        [
            "After the query.",
            "So the properties are this ontology spaces when compared to the other methods.",
            "Trying to address this problem has a much smaller dimension.",
            "That is an advantage than than the term by document spaces and avoids the need for maintaining large static dictionaries and each dimension of this ontology space corresponds to node or subject, and it has some inherent semantic relations with other nodes, not only the parent children relationships in the tree, but also.",
            "It can have some other relationships.",
            "We're exploring exploring that direction as right now in the subsequent works with overlay graphs, and again, hierarchical nature is helpful to bring some robots to the problem to the solution."
        ],
        [
            "Methods and we have started with experiments first before going to the.",
            "Going to the prototype development, one simple one was we have chosen at three as some categorization from the United Kingdom Education Agency that categorizes topics and then how did we populate this ontology tree that I've shown these vertices bag of words come from the answer is 1 way of doing it again.",
            "There can be multiple ways.",
            "We used the nodes name in find finding top ten documents from the Yahoo search web services and got the HTML documents concrete.",
            "Catenate them to convert a single document and process that through the natural language toolkit to tokenize, stop word removal, etc.",
            "To get the bag of hurt, and this.",
            "This actually is, as you can see, the method is not specifically trained.",
            "Given a data set, it is some wide applicability.",
            "That's another nice aspect of the of the approach, and then we used some random expert and."
        ],
        [
            "Every generation than the each set of experts with the highest matching scores are taken that as a result of the DOT product, the ground truth vectors are used to calculate the set of correct experts in quotations.",
            "We didn't do hand labeling.",
            "The details are on the paper that boring details and then we computed recall and precision for average of thousand such queries."
        ],
        [
            "And if you have questions, I can answer them.",
            "And when we when we see the value, we assign the set of top three ranking experts to each query.",
            "We see these precision precision on the left.",
            "Recall on the right graphs and versus the number of keywords contained in the query itself.",
            "So what we observe, we were surprised to see that the curves are quite flat, which means the number of words after appointment does not matter anymore.",
            "So it looks like the classification is done with small number of votes too.",
            "Small number of important words and this Alpha values on the graphs represent the branching mechanism.",
            "The higher the Alpha, the less the branching.",
            "The smaller the Alpha hired the branching.",
            "When we do that, we have and we do the matching from query to the to the.",
            "To the subtree."
        ],
        [
            "And the top six ranking this is, this is what we observe is the precision does not change that much, so it is quite robust with respect to that aspect.",
            "And recall is, as you can see, one interesting aspect of this problem is psychological in nature.",
            "When you try to find the set of experts to a question, press precision is slightly more important than the recall.",
            "If I can get if there are, for example, 10 experts available on that topic, I get you.",
            "If you five of them, but the correct five of them, the users happy.",
            "But if I get you a ton of them, but five of them are really wrong.",
            "The recall recall is bad, the precision is back down.",
            "That is at least a disappointing experiment from the user side.",
            "So that is maybe a slightly differ."
        ],
        [
            "Perspective of the problem.",
            "Done a list and other observations are.",
            "Well, the choosing the higher Alpha districting, Restrick Ting unnecessary branching lead to better results, the Antwi precision remains high regardless of the number of experts an Alpha.",
            "So this we attribute this to the hierarchical approach and we have seen that.",
            "That with the correct set of parameters, precision, recall are also not not very sensitive to the number of experts, so which which indicates some scalable later simulations also confirmed that of course, as the number of experts increase increases, the the problem becomes more difficult and the performance drops, but not drastically.",
            "Fortunately, and again, this flat curves represent the number of even with limited information the classification task."
        ],
        [
            "Be done.",
            "So as I said, there is and there is an application that we developed after this.",
            "It's called this pre is River in Berlin and its internal name essentially the application part of it.",
            "The prototype part of it is a member of this community asks the question and then our engine forwards the question to the proper experts.",
            "Hopefully the right ones and then one of them agrees to answer the question and then they start chatting over over the web interface and actually."
        ],
        [
            "We have used some nice Web 2.0 ish technologies to implement this prototype which I can show you Now if you wish so.",
            "To bring a different flavor.",
            "So this is the stock page.",
            "Sit down if you don't mind.",
            "So well, I have to shout I guess for the audience.",
            "Well I give the my username and.",
            "Enter the system.",
            "So we.",
            "You see incoming requests and my questions are on the left side and I can.",
            "Ask a question to an expert.",
            "Thank you, thank you very much for.",
            "For example, we can ask any questions but one question occur to me is how can we use graph based representations?",
            "Santation methods in web technologies.",
            "You can see live how this classification works.",
            "When I click search expert.",
            "You see it classified it.",
            "The numbers are for debugging purposes.",
            "Computers, algorithms, searching, computer science, artificial intelligence, and vision is Interestingly because of the connection between graph based methods and vision.",
            "I guess that it also shows up here.",
            "In this version we used a bigger tree that looks like this and each user, for example.",
            "This is my profile.",
            "These are the topics that I'm supposed expert on and then I can change the level and the bigger tree looks like this.",
            "1000 nodes that are little bit deeper in the areas of computers and ransone because in our research lab, that's the more interesting.",
            "Ontology ontology that is more interesting for the audience.",
            "And if I ask a question, maybe actually there are seven people online right now, maybe.",
            "I have asked my colleagues to be online for the purpose of.",
            "Purpose of this demonstration, and these are the contacted experts.",
            "That that looks like and then we can.",
            "We can wait if someone accepts it then we start chat between the expert and user and that's the best main idea.",
            "I don't have problem probably.",
            "Go further than that, thank you, thank you.",
            "So if I get response so I can show you the chat part.",
            "But this is essentially it's done done.",
            "This is a nice application like with the history that notebook entries and so on.",
            "The rest is scientifically not interesting I guess."
        ],
        [
            "So in conclusion.",
            "See the presentation search.",
            "In conclusion, the I've presented the ontology based approach for this expert peering and search system.",
            "Different kind of application, but the main idea is similar graph based representation scheme consisting of an ontology tree where each node corresponds to the topic is associated with the bag of words that represents this topic.",
            "Then we address this graph matching problem of assigning queries to relevant experts on this on this vector space of the ontology instead of term by document space.",
            "Which follows from serialization of the Ontology Ontology Tree Ascentia, leading to a simple dot product, but in this in this in this vector space, the each dimension has some semantic meaning being associated with the topic, and therefore one can be built.",
            "Built some overlay graphs on this space, and I think they're on interesting right path and this research continues with more sophisticated algorithms and hopefully it will be even better with.",
            "Suggestions and comments of the of the audience here.",
            "So without yeah, this this is essentially its entire thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you so that makes this is joint work with my quarters Christian bulk.",
                    "label": 0
                },
                {
                    "sent": "Again.",
                    "label": 0
                },
                {
                    "sent": "Who's actually more expert in graph based methods and computer vision?",
                    "label": 0
                },
                {
                    "sent": "I should start with a disclaimer.",
                    "label": 0
                },
                {
                    "sent": "I'm very new to this idea or outside this idea.",
                    "label": 0
                },
                {
                    "sent": "I'm even knew to the machine learning itself and this one.",
                    "label": 0
                },
                {
                    "sent": "One disclaimer.",
                    "label": 0
                },
                {
                    "sent": "The second disclaimer is this is more applied work that is part of an applied research project with development part.",
                    "label": 0
                },
                {
                    "sent": "Actually I want to.",
                    "label": 0
                },
                {
                    "sent": "If time permits, show you the application itself that the prototype that we have developed in the laps, and therefore it's light on the theory when compared to all the nice work here that's shown here.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, I would really welcome your feedback and comments.",
                    "label": 0
                },
                {
                    "sent": "It's a project that we started only in last November and we have got good students working on it and we will continue improving our.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So essentially this is the outline of my toy.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the application areas drastically different from any any vision and related stuff.",
                    "label": 0
                },
                {
                    "sent": "It is about expert piering system for community based information exchanged and we use natural graph based scheme that consists of a taxonomy where each node represents a topic.",
                    "label": 1
                },
                {
                    "sent": "And what we do is the users ask a question and we try to find the best experts who can answer that question.",
                    "label": 1
                },
                {
                    "sent": "The two that we map the profiles of the experts and the questions too.",
                    "label": 0
                },
                {
                    "sent": "Subtrees of this ontology.",
                    "label": 0
                },
                {
                    "sent": "So this is kind of used.",
                    "label": 0
                },
                {
                    "sent": "This ontology as a space ontology space.",
                    "label": 0
                },
                {
                    "sent": "And then the problem becomes matching queries.",
                    "label": 1
                },
                {
                    "sent": "Assigning courage to the relevant experts becomes a problem of graph matching, but this is easy problem because we have a fixed graph.",
                    "label": 0
                },
                {
                    "sent": "Ontologist fixed currently at least then we use a serialization of this ontology three or the taxonomy which enables us to use simple dot products to find to find the experts.",
                    "label": 0
                },
                {
                    "sent": "And efficiency is important for this problem because we.",
                    "label": 0
                },
                {
                    "sent": "This has to work in real time.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Real time not not, not necessarily, so this is the ontology, that tree that we consider.",
                    "label": 1
                },
                {
                    "sent": "How are we identify the topic?",
                    "label": 0
                },
                {
                    "sent": "So here assume this is art.",
                    "label": 0
                },
                {
                    "sent": "This is computer science, the other ones is physics.",
                    "label": 0
                },
                {
                    "sent": "For example, the subtopics could be the theoretical physics quantum physics and and subtopics of quantum physics.",
                    "label": 0
                },
                {
                    "sent": "Quantum mechanics, for example an.",
                    "label": 0
                },
                {
                    "sent": "So each topic is identified by a bag of verts, and then these bag of words are later aggregated.",
                    "label": 0
                },
                {
                    "sent": "Going up so the parents bag of words contains the children nodes bag of words as one of the advantages of this hierarchical graph based approach is when we try to solve this problem from top to down.",
                    "label": 0
                },
                {
                    "sent": "It enables us to do it in level wise and innocence brings some robustness to the picture because we solve start with a simple classification problem.",
                    "label": 0
                },
                {
                    "sent": "When assigning the query to the experts and then go down to more and more complex.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fication problems, so as I say, how we handle this mathematically, essentially we take a serialization of the tree and serialization works and create associated vector representation for the query or the respective expert and represent these entities as subtrees of tautology on this ontology space.",
                    "label": 1
                },
                {
                    "sent": "To be able to do that.",
                    "label": 0
                },
                {
                    "sent": "Of course we need to 1st define a similarity measure between the two entities being the expert or the query to the topics on the tree.",
                    "label": 1
                },
                {
                    "sent": "And we do this.",
                    "label": 0
                },
                {
                    "sent": "Anything can be used to, but this simple version is a cosine similarity.",
                    "label": 0
                },
                {
                    "sent": "This started with that one.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is.",
                    "label": 0
                },
                {
                    "sent": "Let's picture pictorially.",
                    "label": 0
                },
                {
                    "sent": "To make it simpler for the audience, an expert on two topics is represented by, for example, as the subtree that you see there with two leaves and go up each subtree answering the leaves, of course, and then the query.",
                    "label": 1
                },
                {
                    "sent": "For example, on a topic of this leave will be represented by this other subtree, and then through the DOT product one finds the you have.",
                    "label": 0
                },
                {
                    "sent": "Of course, an experts for the case A.",
                    "label": 0
                },
                {
                    "sent": "And then the query is compared with DOT products with each of the experts and the best expert is.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "After the query.",
                    "label": 0
                },
                {
                    "sent": "So the properties are this ontology spaces when compared to the other methods.",
                    "label": 0
                },
                {
                    "sent": "Trying to address this problem has a much smaller dimension.",
                    "label": 1
                },
                {
                    "sent": "That is an advantage than than the term by document spaces and avoids the need for maintaining large static dictionaries and each dimension of this ontology space corresponds to node or subject, and it has some inherent semantic relations with other nodes, not only the parent children relationships in the tree, but also.",
                    "label": 1
                },
                {
                    "sent": "It can have some other relationships.",
                    "label": 0
                },
                {
                    "sent": "We're exploring exploring that direction as right now in the subsequent works with overlay graphs, and again, hierarchical nature is helpful to bring some robots to the problem to the solution.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Methods and we have started with experiments first before going to the.",
                    "label": 0
                },
                {
                    "sent": "Going to the prototype development, one simple one was we have chosen at three as some categorization from the United Kingdom Education Agency that categorizes topics and then how did we populate this ontology tree that I've shown these vertices bag of words come from the answer is 1 way of doing it again.",
                    "label": 0
                },
                {
                    "sent": "There can be multiple ways.",
                    "label": 0
                },
                {
                    "sent": "We used the nodes name in find finding top ten documents from the Yahoo search web services and got the HTML documents concrete.",
                    "label": 1
                },
                {
                    "sent": "Catenate them to convert a single document and process that through the natural language toolkit to tokenize, stop word removal, etc.",
                    "label": 1
                },
                {
                    "sent": "To get the bag of hurt, and this.",
                    "label": 0
                },
                {
                    "sent": "This actually is, as you can see, the method is not specifically trained.",
                    "label": 0
                },
                {
                    "sent": "Given a data set, it is some wide applicability.",
                    "label": 0
                },
                {
                    "sent": "That's another nice aspect of the of the approach, and then we used some random expert and.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Every generation than the each set of experts with the highest matching scores are taken that as a result of the DOT product, the ground truth vectors are used to calculate the set of correct experts in quotations.",
                    "label": 1
                },
                {
                    "sent": "We didn't do hand labeling.",
                    "label": 1
                },
                {
                    "sent": "The details are on the paper that boring details and then we computed recall and precision for average of thousand such queries.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And if you have questions, I can answer them.",
                    "label": 0
                },
                {
                    "sent": "And when we when we see the value, we assign the set of top three ranking experts to each query.",
                    "label": 1
                },
                {
                    "sent": "We see these precision precision on the left.",
                    "label": 1
                },
                {
                    "sent": "Recall on the right graphs and versus the number of keywords contained in the query itself.",
                    "label": 1
                },
                {
                    "sent": "So what we observe, we were surprised to see that the curves are quite flat, which means the number of words after appointment does not matter anymore.",
                    "label": 0
                },
                {
                    "sent": "So it looks like the classification is done with small number of votes too.",
                    "label": 0
                },
                {
                    "sent": "Small number of important words and this Alpha values on the graphs represent the branching mechanism.",
                    "label": 0
                },
                {
                    "sent": "The higher the Alpha, the less the branching.",
                    "label": 0
                },
                {
                    "sent": "The smaller the Alpha hired the branching.",
                    "label": 0
                },
                {
                    "sent": "When we do that, we have and we do the matching from query to the to the.",
                    "label": 0
                },
                {
                    "sent": "To the subtree.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the top six ranking this is, this is what we observe is the precision does not change that much, so it is quite robust with respect to that aspect.",
                    "label": 1
                },
                {
                    "sent": "And recall is, as you can see, one interesting aspect of this problem is psychological in nature.",
                    "label": 0
                },
                {
                    "sent": "When you try to find the set of experts to a question, press precision is slightly more important than the recall.",
                    "label": 1
                },
                {
                    "sent": "If I can get if there are, for example, 10 experts available on that topic, I get you.",
                    "label": 0
                },
                {
                    "sent": "If you five of them, but the correct five of them, the users happy.",
                    "label": 0
                },
                {
                    "sent": "But if I get you a ton of them, but five of them are really wrong.",
                    "label": 0
                },
                {
                    "sent": "The recall recall is bad, the precision is back down.",
                    "label": 0
                },
                {
                    "sent": "That is at least a disappointing experiment from the user side.",
                    "label": 0
                },
                {
                    "sent": "So that is maybe a slightly differ.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Perspective of the problem.",
                    "label": 0
                },
                {
                    "sent": "Done a list and other observations are.",
                    "label": 0
                },
                {
                    "sent": "Well, the choosing the higher Alpha districting, Restrick Ting unnecessary branching lead to better results, the Antwi precision remains high regardless of the number of experts an Alpha.",
                    "label": 1
                },
                {
                    "sent": "So this we attribute this to the hierarchical approach and we have seen that.",
                    "label": 0
                },
                {
                    "sent": "That with the correct set of parameters, precision, recall are also not not very sensitive to the number of experts, so which which indicates some scalable later simulations also confirmed that of course, as the number of experts increase increases, the the problem becomes more difficult and the performance drops, but not drastically.",
                    "label": 1
                },
                {
                    "sent": "Fortunately, and again, this flat curves represent the number of even with limited information the classification task.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Be done.",
                    "label": 0
                },
                {
                    "sent": "So as I said, there is and there is an application that we developed after this.",
                    "label": 0
                },
                {
                    "sent": "It's called this pre is River in Berlin and its internal name essentially the application part of it.",
                    "label": 0
                },
                {
                    "sent": "The prototype part of it is a member of this community asks the question and then our engine forwards the question to the proper experts.",
                    "label": 0
                },
                {
                    "sent": "Hopefully the right ones and then one of them agrees to answer the question and then they start chatting over over the web interface and actually.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have used some nice Web 2.0 ish technologies to implement this prototype which I can show you Now if you wish so.",
                    "label": 0
                },
                {
                    "sent": "To bring a different flavor.",
                    "label": 0
                },
                {
                    "sent": "So this is the stock page.",
                    "label": 0
                },
                {
                    "sent": "Sit down if you don't mind.",
                    "label": 0
                },
                {
                    "sent": "So well, I have to shout I guess for the audience.",
                    "label": 0
                },
                {
                    "sent": "Well I give the my username and.",
                    "label": 0
                },
                {
                    "sent": "Enter the system.",
                    "label": 0
                },
                {
                    "sent": "So we.",
                    "label": 0
                },
                {
                    "sent": "You see incoming requests and my questions are on the left side and I can.",
                    "label": 0
                },
                {
                    "sent": "Ask a question to an expert.",
                    "label": 0
                },
                {
                    "sent": "Thank you, thank you very much for.",
                    "label": 0
                },
                {
                    "sent": "For example, we can ask any questions but one question occur to me is how can we use graph based representations?",
                    "label": 0
                },
                {
                    "sent": "Santation methods in web technologies.",
                    "label": 0
                },
                {
                    "sent": "You can see live how this classification works.",
                    "label": 0
                },
                {
                    "sent": "When I click search expert.",
                    "label": 0
                },
                {
                    "sent": "You see it classified it.",
                    "label": 0
                },
                {
                    "sent": "The numbers are for debugging purposes.",
                    "label": 0
                },
                {
                    "sent": "Computers, algorithms, searching, computer science, artificial intelligence, and vision is Interestingly because of the connection between graph based methods and vision.",
                    "label": 0
                },
                {
                    "sent": "I guess that it also shows up here.",
                    "label": 0
                },
                {
                    "sent": "In this version we used a bigger tree that looks like this and each user, for example.",
                    "label": 0
                },
                {
                    "sent": "This is my profile.",
                    "label": 0
                },
                {
                    "sent": "These are the topics that I'm supposed expert on and then I can change the level and the bigger tree looks like this.",
                    "label": 0
                },
                {
                    "sent": "1000 nodes that are little bit deeper in the areas of computers and ransone because in our research lab, that's the more interesting.",
                    "label": 0
                },
                {
                    "sent": "Ontology ontology that is more interesting for the audience.",
                    "label": 0
                },
                {
                    "sent": "And if I ask a question, maybe actually there are seven people online right now, maybe.",
                    "label": 0
                },
                {
                    "sent": "I have asked my colleagues to be online for the purpose of.",
                    "label": 0
                },
                {
                    "sent": "Purpose of this demonstration, and these are the contacted experts.",
                    "label": 0
                },
                {
                    "sent": "That that looks like and then we can.",
                    "label": 0
                },
                {
                    "sent": "We can wait if someone accepts it then we start chat between the expert and user and that's the best main idea.",
                    "label": 0
                },
                {
                    "sent": "I don't have problem probably.",
                    "label": 0
                },
                {
                    "sent": "Go further than that, thank you, thank you.",
                    "label": 0
                },
                {
                    "sent": "So if I get response so I can show you the chat part.",
                    "label": 0
                },
                {
                    "sent": "But this is essentially it's done done.",
                    "label": 0
                },
                {
                    "sent": "This is a nice application like with the history that notebook entries and so on.",
                    "label": 0
                },
                {
                    "sent": "The rest is scientifically not interesting I guess.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in conclusion.",
                    "label": 0
                },
                {
                    "sent": "See the presentation search.",
                    "label": 0
                },
                {
                    "sent": "In conclusion, the I've presented the ontology based approach for this expert peering and search system.",
                    "label": 1
                },
                {
                    "sent": "Different kind of application, but the main idea is similar graph based representation scheme consisting of an ontology tree where each node corresponds to the topic is associated with the bag of words that represents this topic.",
                    "label": 1
                },
                {
                    "sent": "Then we address this graph matching problem of assigning queries to relevant experts on this on this vector space of the ontology instead of term by document space.",
                    "label": 0
                },
                {
                    "sent": "Which follows from serialization of the Ontology Ontology Tree Ascentia, leading to a simple dot product, but in this in this in this vector space, the each dimension has some semantic meaning being associated with the topic, and therefore one can be built.",
                    "label": 0
                },
                {
                    "sent": "Built some overlay graphs on this space, and I think they're on interesting right path and this research continues with more sophisticated algorithms and hopefully it will be even better with.",
                    "label": 0
                },
                {
                    "sent": "Suggestions and comments of the of the audience here.",
                    "label": 0
                },
                {
                    "sent": "So without yeah, this this is essentially its entire thank you.",
                    "label": 0
                }
            ]
        }
    }
}