{
    "id": "k5anyklh556w5ib5yfvqbe7fj65ag7ay",
    "title": "Self-reinforcing expectancy effects on pain: Behavioral and brain mechanisms",
    "info": {
        "author": [
            "Marieke Jepma, Faculty of Social and Behavioural Sciences, Leiden University"
        ],
        "published": "July 28, 2015",
        "recorded": "June 2015",
        "category": [
            "Top->Computer Science->Machine Learning",
            "Top->Computer Science->Artificial Intelligence",
            "Top->Social Sciences->Psychology",
            "Top->Social Sciences->Economics",
            "Top->Medicine->Neuroscience",
            "Top->Technology->Engineering->Electrical Engineering->Control Engineering"
        ]
    },
    "url": "http://videolectures.net/rldm2015_jepma_expectancy_effects/",
    "segmentation": [
        [
            "I will talk about learning in the first domain, namely learning to predict pain and how this can be influenced by our prior expectancies.",
            "Um?"
        ],
        [
            "It is well known that Spain, like many other types of experiences and judgments, can be strongly shaped by what we expect or by our prior beliefs.",
            "Prominent example of this is placebo analgesia, where the expectancy of getting an analgesic treatment can produce pain relief even though there's no actual treatments administered.",
            "I have the feeling something is not working with the microphone.",
            "It is oh OK, good.",
            "Um?"
        ],
        [
            "So experiments on this typically induced expectancies using cues that have been conditioned to predict either low or high pain intensity.",
            "Using this classical conditioning procedure.",
            "An after this they typically test the effects of these conditions huge on pain responses during a subsequent test or extinction phase, during which the alcu Shar actually paired with identical pain stimuli.",
            "And the subject of course, not aware, that's the queues are no longer productive.",
            "The typical finding in these studies is that pain responses are stronger when they are preceded by the hike.",
            "Use them by the locution.",
            "For example, we found here that both self reports and also skin conductance responses to noxious heat stimuli were much larger when they were parented to haikyu Dimitar Lo Que."
        ],
        [
            "And something interesting here is that various according to extinction learning principles, you would expect these effects to extinguish during the test phase.",
            "But this is often not the case.",
            "So for example, here we found that the queues.",
            "Kept affecting dependences throughout the entire extinction phase.",
            "And some studies even find the effect growth overtime.",
            "So it seems to be a self reinforcing effect that these expectancies have on pain."
        ],
        [
            "And such self reinforcing expectancy effects or self fulfilling prophecies actually exist in many domains of human behavior and a.",
            "They have been proposed to contribute to your to variety of phenomena, ranging from stereotype effects to even economic inflation.",
            "This is just one famous example of how teachers expectancies about students potential can.",
            "Can actually lead to an actual change in students performance via this mechanism.",
            "Anne."
        ],
        [
            "An indication of pain.",
            "There are often no no external behaviors that actually change the objective pain situation.",
            "But it is well known that expectancy scan can interact with pain processing fire farrish neural pathways.",
            "One well known pathway is this descending top down pain modulation system fire, which higher level brain areas that are involved in cognitive processes like expectancies and project all the way down, fire the midbrain and medulla to the spinal cord where they can modify the incoming pain signals.",
            "So this is of course one way in which expectancy scan can have self reinforcing effects on pain."
        ],
        [
            "However, I always feel like something seems to be missing in this process, namely the presence of prediction errors which.",
            "Which would be expected to occur when people notice that there's a mismatch between the expectancy and the actual pain experience.",
            "Well, of course if this descending pain modulation system is so strong that there's no prediction error Dender this is not an issue, but.",
            "I think it's hard to believe that this is always the case, especially when the difference between expectancy and actual pain experience is very large.",
            "It's likely that, at least to some degree, people do notice some kind of prediction error."
        ],
        [
            "For example, this was the case in our recent study where we induced pretty strong expectancies about different cues.",
            "And then in the test phase, the actual differences or cure actually followed by the same pretty moderates pain intensity.",
            "And we ask people to report both their expected pain following each Q on each trial and also the report.",
            "The actual experience pain following each heat stimulus.",
            "And you see that the accused it did affect actual pain, experience about 10 points in our rating scale, but they had a much stronger effect on the expected pain ratings an people did not seem to effectively update their expectancies.",
            "SD disc pain associations remained really strong and only very slowly were updated.",
            "Um, yeah, so this suggests people did experience prediction errors, but just did not effectively learn from this.",
            "And here we aim to test potential mechanism for this that has to do with the biased learning of these Q pain associations during the test phase."
        ],
        [
            "Well, previous studies have already provided evidence that prior beliefs induced by, for example, instructions or advice from others, can bias peoples choice behavior in instrumental learning tasks.",
            "For example here belittle, found that people were much more likely to choose or recommend it over a non recommended option even though they had identical outcomes.",
            "Anne Bradley Dullen with Michael Frank.",
            "They also found it when you instruct people about.",
            "Reinforcement probabilities of specific.",
            "Specific options people.",
            "Or this seems to bias people's learning of the actual probabilities.",
            "And their findings could be accounted for by this confirmation bias mechanism, fire, which instructions that are putatively represented in the prefrontal cortex as well as stable campus, can bias experience based learning that happens in the stratum.",
            "In such a way that.",
            "Evidence that is kind of confirming the prior belief is amplified, so enhances learning breasts evidence that's inconsistent with those prior releases discounted.",
            "However, these previous studies all used well either abstract or secondary reinforcer, so it's still an open question if a similar mechanism operates on learning about primary aversive stimuli like pain.",
            "And if So what are what's underlying brain mechanisms are?",
            "So we aim to test it."
        ],
        [
            "In the present study, so we specifically tested this hypothesis of the confirmation bias.",
            "That's when a prediction error suggest that's the predicted value of Q is even stronger than expected.",
            "People will update their beliefs allowed based on this, so you should high learning rates.",
            "Rest if a precautionary indicates that huge are less predictive than expected, they kind of do not learn from this.",
            "So you should lower learning rates.",
            "So when you plot learning rate as a function of weather prediction error is well appetitive which I refer to are which I mean that the pain is less less painful than expected or refer shifts so more painful than expected an as function of the preceding Q.",
            "This would predict that if following an appetitive prediction error, people would learn lots of distrust preceded by a low paying Q, but not so much if it was preceded by a high thank you and the opposite, if the if the prediction error suggested pages version and expect that they would specifically.",
            "Update strongly their beliefs.",
            "If it was preceded by also a high pain predictive cue.",
            "So this would predict an interaction between the direction of the prediction error and mediq was high or low."
        ],
        [
            "So we tested this hypothesis in this study, in which we first condition different cues to predict either low or high heat intensity.",
            "And then in the test phase, all the queues were followed by the same moderately painful heat simulator applied using this term out to either there are more their leg."
        ],
        [
            "Each test file looks like this, so people first saw the queue, then they indicated how much pain are expected.",
            "Then they got actual heat stab Lish an indicated how much pain they experienced.",
            "And as I already showed you before, the queues affected both experienced and the expected pain, but expected pain was affected much stronger, and this effect is very persistent."
        ],
        [
            "And a nice feature of our paradigm is that it provides direct measures of the prediction error and the learning rate on each trial.",
            "Of course, the prediction error is simply the difference between the expected and the experienced pain.",
            "And the learning rate is the degree to which people updates their expectancy from one trial to the next based on based on their prediction error.",
            "So we use this trial to trial measures of prediction error.",
            "An learning rates too.",
            "To see if we could find evidence for confirmation bias that could explain the persistence of those expectancy effects."
        ],
        [
            "So let's go to the results.",
            "So remember this hypothesis.",
            "That learning rate should be higher for appetitive prediction error with low Q&A first friction air show with a high Q.",
            "And this is what we found so consistent with the hypothesis.",
            "We also replicated this in a separate experiments which showed the same pattern in another group of participants.",
            "So overall people seem to use higher learning rates then the prediction error was suggesting that these queues for even more productive than expected and compared to when they suggested that the creature not as productive as expected.",
            "However, there are strong individual differences in this bias effects."
        ],
        [
            "So here I plot the size of this bias for each individual subjects.",
            "So some people showed it really strongly.",
            "But other short it's not so strong and a few even showed the opposite effect.",
            "And so we next looked into the brain mechanisms that could explain this.",
            "This these individual differences in this confirmation bias, as this was an MRI study."
        ],
        [
            "So first we examined if the confirmation bias is also reflected in brain activation at the time.",
            "That's the prediction error occurs.",
            "So during each stimulus.",
            "And specifically here I tested for activation that is stronger than in response to confirming and disconfirming prediction errors.",
            "That could predict the behavioral confirmation measure effects.",
            "And this analysis reveals well actually 2 main clusters, one in the dorsomedial prefrontal cortex.",
            "And another one in the rights century motor regions, and I think especially this area is kind of interesting.",
            "It's really close to the dorsal ACC which has been.",
            "Um?",
            "Yeah, suggested to be involved in the regulation of learning rate based on various environmental statistics like volatility or reward probability and also the.",
            "The surprise elicited by stimulus.",
            "So our findings here suggests similar region is involved in regulation of learning based on our prior beliefs."
        ],
        [
            "Finally, actually went better.",
            "Disconfirmation bias on the updating of beliefs is also reflected in the updating of anticipatory brain activation.",
            "So during the interval before the heat stimulus is presented.",
            "So to do this, I modeled each each individual and sufficient periods, so the interval before that.",
            "Yet for the stimulus.",
            "As a separate regressor, using a single trial approach, and then I computed the change.",
            "In this activation across subsequent trials in which the same Q as presented to get this updated activation updates across trials and looked at how this was dependent on the direction of the prediction error an on the preceding Q."
        ],
        [
            "So first I will show you the results from the updates in anticipatory brain activation following an aversive prediction error that was higher on the Hayden on the low Q trials.",
            "This well revealed several clusters of activation.",
            "Again, one was in the dorsal ACC, extending into the supplementary motor area and there was also some.",
            "Bilateral motor regions.",
            "Which could reflect that people were more like or kind of had some increased readiness to response on these trials or increased alertness.",
            "We also found basal ganglia mostly the dorsal stratum extending a bit centrally as well.",
            "And left Instagram, which are more affective regions which.",
            "In a previous study, have also been associated with trial to trial variation in anticipatory anxiety.",
            "So this is consistent with the idea that if you have an unexpectedly strong pain stimulus following a high versus low Q, this results in increased anticipatory anxiety and alertness."
        ],
        [
            "And finally, I looked at similar contrast with now comparing the updating of these anticipatory brain activations following appetitive prediction error that was bigger on node and on high Q trials.",
            "And this showed many deactivations in this well in lateral prefrontal as well as parietal dorsal premotor regions which are strongly right lateralized and this this kind of resembles an attentional orienting network.",
            "So this suggests that repetitive prediction errors resulted in a decreased anticipatory attention on the next trial and they were preceded by a low compared to a high Q.",
            "Potentially less attention to the location of the upcoming pen stimulus, which was always on the left."
        ],
        [
            "So to conclude, our findings suggest that expectancies not only.",
            "Modify pain, fire such a descending pain modulation system, but also biased to learning in response to.",
            "If a prediction error occurs between the expectancy and the actual pin.",
            "And together these two mechanisms can explain the persistence of expectancy effects or pain, even if there's no evidence that actually reinforces these expectancies anymore.",
            "Our from Ryan Elesis showed that the confirmation bias was not only reflected in the updating of beliefs, but also in D. In the updating of anticipatory brain activation.",
            "And this may be implemented by dorsal medial prefrontal cortex."
        ],
        [
            "Um, so that's it.",
            "I'd like to end by thanking my collaborators and thank you for your attention."
        ],
        [
            "It was like a slight circularity in the definition of prediction error.",
            "'cause you're you're, it's nice to be able to get this measure directly of what people, reporters there pain versus what their expectancy was.",
            "But if you're expecting the expectancy to change the the the the experience as well in the sense in which it's not clear that it's really a political report of what the pain actually is, and so we don't really know what that the prediction error that controls changes as a project which is already manipulated by people's own manipulation of their company.",
            "Yeah, yeah, that's a good point.",
            "Yeah, you need to experience rating.",
            "That's partial prediction areas already biased.",
            "Yeah, so it's actually that's true.",
            "So if a prediction error according to our definition happens, it's just means that.",
            "Um?",
            "The experience pain was even stronger than the already biased kind of pain experience.",
            "So yeah, that's that's right.",
            "One thing I wonder, I know you showed some SCR data at the beginning, but I wonder if some of these phenomena have something to do with the way people use these scales, which of course don't really have units rather than.",
            "Pain per say, and so I wonder to what extent you've looked at these more kind of learning type phenomena with objective measurements, like a CR's rather than the self reports.",
            "Um, yeah.",
            "Well we have looked into pain modulation in itself, which is also reflected in the brain, like in pain processing areas and fish logical responses to to the heat.",
            "This updating I have.",
            "Well, besides the updating of the industry brain exploration, I haven't looked at as he or she adds on this.",
            "It would be interesting.",
            "I think there possibly multiple.",
            "At different levels, multiple learning process is going on like one that's open to introspection.",
            "Like what I'm focusing on now and.",
            "Maybe some more habitual process that's could be different.",
            "Time for one more I you plotted, I think on there is the subject correlations with their difference in expectancy.",
            "For the confirmation bias, but did you track the single trial prediction errors in the brain at all, like a classic just regressing prediction error on a single trial and did not show up in those same areas or or in stratum?",
            "Medial prefrontal yeah.",
            "I did.",
            "Of course.",
            "I just used the prediction errors of parametric modulator of all the DT box.",
            "An not that much actually came out, but I think that's because it strongly.",
            "Correlated with both the Q&A heat intensity so I had to kind of control for deaths and then.",
            "Um, I think this trailer wasn't there and also another PhD which which I kind of expected based on a recent study.",
            "I did say I have one additional thing.",
            "This is just a first bigger than appetitive prediction errors, for example.",
            "And you also see the dorsal.",
            "Yes he did or slashy again thanks.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will talk about learning in the first domain, namely learning to predict pain and how this can be influenced by our prior expectancies.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It is well known that Spain, like many other types of experiences and judgments, can be strongly shaped by what we expect or by our prior beliefs.",
                    "label": 1
                },
                {
                    "sent": "Prominent example of this is placebo analgesia, where the expectancy of getting an analgesic treatment can produce pain relief even though there's no actual treatments administered.",
                    "label": 0
                },
                {
                    "sent": "I have the feeling something is not working with the microphone.",
                    "label": 0
                },
                {
                    "sent": "It is oh OK, good.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So experiments on this typically induced expectancies using cues that have been conditioned to predict either low or high pain intensity.",
                    "label": 0
                },
                {
                    "sent": "Using this classical conditioning procedure.",
                    "label": 0
                },
                {
                    "sent": "An after this they typically test the effects of these conditions huge on pain responses during a subsequent test or extinction phase, during which the alcu Shar actually paired with identical pain stimuli.",
                    "label": 0
                },
                {
                    "sent": "And the subject of course, not aware, that's the queues are no longer productive.",
                    "label": 0
                },
                {
                    "sent": "The typical finding in these studies is that pain responses are stronger when they are preceded by the hike.",
                    "label": 0
                },
                {
                    "sent": "Use them by the locution.",
                    "label": 0
                },
                {
                    "sent": "For example, we found here that both self reports and also skin conductance responses to noxious heat stimuli were much larger when they were parented to haikyu Dimitar Lo Que.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And something interesting here is that various according to extinction learning principles, you would expect these effects to extinguish during the test phase.",
                    "label": 0
                },
                {
                    "sent": "But this is often not the case.",
                    "label": 0
                },
                {
                    "sent": "So for example, here we found that the queues.",
                    "label": 0
                },
                {
                    "sent": "Kept affecting dependences throughout the entire extinction phase.",
                    "label": 0
                },
                {
                    "sent": "And some studies even find the effect growth overtime.",
                    "label": 0
                },
                {
                    "sent": "So it seems to be a self reinforcing effect that these expectancies have on pain.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And such self reinforcing expectancy effects or self fulfilling prophecies actually exist in many domains of human behavior and a.",
                    "label": 1
                },
                {
                    "sent": "They have been proposed to contribute to your to variety of phenomena, ranging from stereotype effects to even economic inflation.",
                    "label": 0
                },
                {
                    "sent": "This is just one famous example of how teachers expectancies about students potential can.",
                    "label": 0
                },
                {
                    "sent": "Can actually lead to an actual change in students performance via this mechanism.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "An indication of pain.",
                    "label": 0
                },
                {
                    "sent": "There are often no no external behaviors that actually change the objective pain situation.",
                    "label": 0
                },
                {
                    "sent": "But it is well known that expectancy scan can interact with pain processing fire farrish neural pathways.",
                    "label": 0
                },
                {
                    "sent": "One well known pathway is this descending top down pain modulation system fire, which higher level brain areas that are involved in cognitive processes like expectancies and project all the way down, fire the midbrain and medulla to the spinal cord where they can modify the incoming pain signals.",
                    "label": 0
                },
                {
                    "sent": "So this is of course one way in which expectancy scan can have self reinforcing effects on pain.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "However, I always feel like something seems to be missing in this process, namely the presence of prediction errors which.",
                    "label": 0
                },
                {
                    "sent": "Which would be expected to occur when people notice that there's a mismatch between the expectancy and the actual pain experience.",
                    "label": 0
                },
                {
                    "sent": "Well, of course if this descending pain modulation system is so strong that there's no prediction error Dender this is not an issue, but.",
                    "label": 0
                },
                {
                    "sent": "I think it's hard to believe that this is always the case, especially when the difference between expectancy and actual pain experience is very large.",
                    "label": 0
                },
                {
                    "sent": "It's likely that, at least to some degree, people do notice some kind of prediction error.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For example, this was the case in our recent study where we induced pretty strong expectancies about different cues.",
                    "label": 0
                },
                {
                    "sent": "And then in the test phase, the actual differences or cure actually followed by the same pretty moderates pain intensity.",
                    "label": 0
                },
                {
                    "sent": "And we ask people to report both their expected pain following each Q on each trial and also the report.",
                    "label": 0
                },
                {
                    "sent": "The actual experience pain following each heat stimulus.",
                    "label": 0
                },
                {
                    "sent": "And you see that the accused it did affect actual pain, experience about 10 points in our rating scale, but they had a much stronger effect on the expected pain ratings an people did not seem to effectively update their expectancies.",
                    "label": 0
                },
                {
                    "sent": "SD disc pain associations remained really strong and only very slowly were updated.",
                    "label": 0
                },
                {
                    "sent": "Um, yeah, so this suggests people did experience prediction errors, but just did not effectively learn from this.",
                    "label": 0
                },
                {
                    "sent": "And here we aim to test potential mechanism for this that has to do with the biased learning of these Q pain associations during the test phase.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, previous studies have already provided evidence that prior beliefs induced by, for example, instructions or advice from others, can bias peoples choice behavior in instrumental learning tasks.",
                    "label": 1
                },
                {
                    "sent": "For example here belittle, found that people were much more likely to choose or recommend it over a non recommended option even though they had identical outcomes.",
                    "label": 0
                },
                {
                    "sent": "Anne Bradley Dullen with Michael Frank.",
                    "label": 0
                },
                {
                    "sent": "They also found it when you instruct people about.",
                    "label": 0
                },
                {
                    "sent": "Reinforcement probabilities of specific.",
                    "label": 0
                },
                {
                    "sent": "Specific options people.",
                    "label": 0
                },
                {
                    "sent": "Or this seems to bias people's learning of the actual probabilities.",
                    "label": 0
                },
                {
                    "sent": "And their findings could be accounted for by this confirmation bias mechanism, fire, which instructions that are putatively represented in the prefrontal cortex as well as stable campus, can bias experience based learning that happens in the stratum.",
                    "label": 0
                },
                {
                    "sent": "In such a way that.",
                    "label": 1
                },
                {
                    "sent": "Evidence that is kind of confirming the prior belief is amplified, so enhances learning breasts evidence that's inconsistent with those prior releases discounted.",
                    "label": 0
                },
                {
                    "sent": "However, these previous studies all used well either abstract or secondary reinforcer, so it's still an open question if a similar mechanism operates on learning about primary aversive stimuli like pain.",
                    "label": 0
                },
                {
                    "sent": "And if So what are what's underlying brain mechanisms are?",
                    "label": 0
                },
                {
                    "sent": "So we aim to test it.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the present study, so we specifically tested this hypothesis of the confirmation bias.",
                    "label": 0
                },
                {
                    "sent": "That's when a prediction error suggest that's the predicted value of Q is even stronger than expected.",
                    "label": 1
                },
                {
                    "sent": "People will update their beliefs allowed based on this, so you should high learning rates.",
                    "label": 1
                },
                {
                    "sent": "Rest if a precautionary indicates that huge are less predictive than expected, they kind of do not learn from this.",
                    "label": 0
                },
                {
                    "sent": "So you should lower learning rates.",
                    "label": 0
                },
                {
                    "sent": "So when you plot learning rate as a function of weather prediction error is well appetitive which I refer to are which I mean that the pain is less less painful than expected or refer shifts so more painful than expected an as function of the preceding Q.",
                    "label": 0
                },
                {
                    "sent": "This would predict that if following an appetitive prediction error, people would learn lots of distrust preceded by a low paying Q, but not so much if it was preceded by a high thank you and the opposite, if the if the prediction error suggested pages version and expect that they would specifically.",
                    "label": 0
                },
                {
                    "sent": "Update strongly their beliefs.",
                    "label": 0
                },
                {
                    "sent": "If it was preceded by also a high pain predictive cue.",
                    "label": 0
                },
                {
                    "sent": "So this would predict an interaction between the direction of the prediction error and mediq was high or low.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we tested this hypothesis in this study, in which we first condition different cues to predict either low or high heat intensity.",
                    "label": 0
                },
                {
                    "sent": "And then in the test phase, all the queues were followed by the same moderately painful heat simulator applied using this term out to either there are more their leg.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Each test file looks like this, so people first saw the queue, then they indicated how much pain are expected.",
                    "label": 0
                },
                {
                    "sent": "Then they got actual heat stab Lish an indicated how much pain they experienced.",
                    "label": 0
                },
                {
                    "sent": "And as I already showed you before, the queues affected both experienced and the expected pain, but expected pain was affected much stronger, and this effect is very persistent.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And a nice feature of our paradigm is that it provides direct measures of the prediction error and the learning rate on each trial.",
                    "label": 1
                },
                {
                    "sent": "Of course, the prediction error is simply the difference between the expected and the experienced pain.",
                    "label": 0
                },
                {
                    "sent": "And the learning rate is the degree to which people updates their expectancy from one trial to the next based on based on their prediction error.",
                    "label": 0
                },
                {
                    "sent": "So we use this trial to trial measures of prediction error.",
                    "label": 0
                },
                {
                    "sent": "An learning rates too.",
                    "label": 0
                },
                {
                    "sent": "To see if we could find evidence for confirmation bias that could explain the persistence of those expectancy effects.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's go to the results.",
                    "label": 0
                },
                {
                    "sent": "So remember this hypothesis.",
                    "label": 0
                },
                {
                    "sent": "That learning rate should be higher for appetitive prediction error with low Q&A first friction air show with a high Q.",
                    "label": 1
                },
                {
                    "sent": "And this is what we found so consistent with the hypothesis.",
                    "label": 0
                },
                {
                    "sent": "We also replicated this in a separate experiments which showed the same pattern in another group of participants.",
                    "label": 0
                },
                {
                    "sent": "So overall people seem to use higher learning rates then the prediction error was suggesting that these queues for even more productive than expected and compared to when they suggested that the creature not as productive as expected.",
                    "label": 0
                },
                {
                    "sent": "However, there are strong individual differences in this bias effects.",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here I plot the size of this bias for each individual subjects.",
                    "label": 0
                },
                {
                    "sent": "So some people showed it really strongly.",
                    "label": 0
                },
                {
                    "sent": "But other short it's not so strong and a few even showed the opposite effect.",
                    "label": 0
                },
                {
                    "sent": "And so we next looked into the brain mechanisms that could explain this.",
                    "label": 0
                },
                {
                    "sent": "This these individual differences in this confirmation bias, as this was an MRI study.",
                    "label": 1
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first we examined if the confirmation bias is also reflected in brain activation at the time.",
                    "label": 0
                },
                {
                    "sent": "That's the prediction error occurs.",
                    "label": 0
                },
                {
                    "sent": "So during each stimulus.",
                    "label": 0
                },
                {
                    "sent": "And specifically here I tested for activation that is stronger than in response to confirming and disconfirming prediction errors.",
                    "label": 0
                },
                {
                    "sent": "That could predict the behavioral confirmation measure effects.",
                    "label": 0
                },
                {
                    "sent": "And this analysis reveals well actually 2 main clusters, one in the dorsomedial prefrontal cortex.",
                    "label": 0
                },
                {
                    "sent": "And another one in the rights century motor regions, and I think especially this area is kind of interesting.",
                    "label": 0
                },
                {
                    "sent": "It's really close to the dorsal ACC which has been.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Yeah, suggested to be involved in the regulation of learning rate based on various environmental statistics like volatility or reward probability and also the.",
                    "label": 0
                },
                {
                    "sent": "The surprise elicited by stimulus.",
                    "label": 0
                },
                {
                    "sent": "So our findings here suggests similar region is involved in regulation of learning based on our prior beliefs.",
                    "label": 1
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Finally, actually went better.",
                    "label": 0
                },
                {
                    "sent": "Disconfirmation bias on the updating of beliefs is also reflected in the updating of anticipatory brain activation.",
                    "label": 0
                },
                {
                    "sent": "So during the interval before the heat stimulus is presented.",
                    "label": 0
                },
                {
                    "sent": "So to do this, I modeled each each individual and sufficient periods, so the interval before that.",
                    "label": 0
                },
                {
                    "sent": "Yet for the stimulus.",
                    "label": 0
                },
                {
                    "sent": "As a separate regressor, using a single trial approach, and then I computed the change.",
                    "label": 0
                },
                {
                    "sent": "In this activation across subsequent trials in which the same Q as presented to get this updated activation updates across trials and looked at how this was dependent on the direction of the prediction error an on the preceding Q.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first I will show you the results from the updates in anticipatory brain activation following an aversive prediction error that was higher on the Hayden on the low Q trials.",
                    "label": 0
                },
                {
                    "sent": "This well revealed several clusters of activation.",
                    "label": 0
                },
                {
                    "sent": "Again, one was in the dorsal ACC, extending into the supplementary motor area and there was also some.",
                    "label": 0
                },
                {
                    "sent": "Bilateral motor regions.",
                    "label": 0
                },
                {
                    "sent": "Which could reflect that people were more like or kind of had some increased readiness to response on these trials or increased alertness.",
                    "label": 0
                },
                {
                    "sent": "We also found basal ganglia mostly the dorsal stratum extending a bit centrally as well.",
                    "label": 1
                },
                {
                    "sent": "And left Instagram, which are more affective regions which.",
                    "label": 1
                },
                {
                    "sent": "In a previous study, have also been associated with trial to trial variation in anticipatory anxiety.",
                    "label": 0
                },
                {
                    "sent": "So this is consistent with the idea that if you have an unexpectedly strong pain stimulus following a high versus low Q, this results in increased anticipatory anxiety and alertness.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And finally, I looked at similar contrast with now comparing the updating of these anticipatory brain activations following appetitive prediction error that was bigger on node and on high Q trials.",
                    "label": 0
                },
                {
                    "sent": "And this showed many deactivations in this well in lateral prefrontal as well as parietal dorsal premotor regions which are strongly right lateralized and this this kind of resembles an attentional orienting network.",
                    "label": 0
                },
                {
                    "sent": "So this suggests that repetitive prediction errors resulted in a decreased anticipatory attention on the next trial and they were preceded by a low compared to a high Q.",
                    "label": 1
                },
                {
                    "sent": "Potentially less attention to the location of the upcoming pen stimulus, which was always on the left.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to conclude, our findings suggest that expectancies not only.",
                    "label": 0
                },
                {
                    "sent": "Modify pain, fire such a descending pain modulation system, but also biased to learning in response to.",
                    "label": 0
                },
                {
                    "sent": "If a prediction error occurs between the expectancy and the actual pin.",
                    "label": 0
                },
                {
                    "sent": "And together these two mechanisms can explain the persistence of expectancy effects or pain, even if there's no evidence that actually reinforces these expectancies anymore.",
                    "label": 0
                },
                {
                    "sent": "Our from Ryan Elesis showed that the confirmation bias was not only reflected in the updating of beliefs, but also in D. In the updating of anticipatory brain activation.",
                    "label": 1
                },
                {
                    "sent": "And this may be implemented by dorsal medial prefrontal cortex.",
                    "label": 1
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um, so that's it.",
                    "label": 0
                },
                {
                    "sent": "I'd like to end by thanking my collaborators and thank you for your attention.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It was like a slight circularity in the definition of prediction error.",
                    "label": 0
                },
                {
                    "sent": "'cause you're you're, it's nice to be able to get this measure directly of what people, reporters there pain versus what their expectancy was.",
                    "label": 0
                },
                {
                    "sent": "But if you're expecting the expectancy to change the the the the experience as well in the sense in which it's not clear that it's really a political report of what the pain actually is, and so we don't really know what that the prediction error that controls changes as a project which is already manipulated by people's own manipulation of their company.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, that's a good point.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you need to experience rating.",
                    "label": 0
                },
                {
                    "sent": "That's partial prediction areas already biased.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so it's actually that's true.",
                    "label": 0
                },
                {
                    "sent": "So if a prediction error according to our definition happens, it's just means that.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "The experience pain was even stronger than the already biased kind of pain experience.",
                    "label": 0
                },
                {
                    "sent": "So yeah, that's that's right.",
                    "label": 0
                },
                {
                    "sent": "One thing I wonder, I know you showed some SCR data at the beginning, but I wonder if some of these phenomena have something to do with the way people use these scales, which of course don't really have units rather than.",
                    "label": 0
                },
                {
                    "sent": "Pain per say, and so I wonder to what extent you've looked at these more kind of learning type phenomena with objective measurements, like a CR's rather than the self reports.",
                    "label": 0
                },
                {
                    "sent": "Um, yeah.",
                    "label": 0
                },
                {
                    "sent": "Well we have looked into pain modulation in itself, which is also reflected in the brain, like in pain processing areas and fish logical responses to to the heat.",
                    "label": 0
                },
                {
                    "sent": "This updating I have.",
                    "label": 0
                },
                {
                    "sent": "Well, besides the updating of the industry brain exploration, I haven't looked at as he or she adds on this.",
                    "label": 0
                },
                {
                    "sent": "It would be interesting.",
                    "label": 0
                },
                {
                    "sent": "I think there possibly multiple.",
                    "label": 0
                },
                {
                    "sent": "At different levels, multiple learning process is going on like one that's open to introspection.",
                    "label": 0
                },
                {
                    "sent": "Like what I'm focusing on now and.",
                    "label": 0
                },
                {
                    "sent": "Maybe some more habitual process that's could be different.",
                    "label": 0
                },
                {
                    "sent": "Time for one more I you plotted, I think on there is the subject correlations with their difference in expectancy.",
                    "label": 0
                },
                {
                    "sent": "For the confirmation bias, but did you track the single trial prediction errors in the brain at all, like a classic just regressing prediction error on a single trial and did not show up in those same areas or or in stratum?",
                    "label": 0
                },
                {
                    "sent": "Medial prefrontal yeah.",
                    "label": 0
                },
                {
                    "sent": "I did.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                },
                {
                    "sent": "I just used the prediction errors of parametric modulator of all the DT box.",
                    "label": 0
                },
                {
                    "sent": "An not that much actually came out, but I think that's because it strongly.",
                    "label": 0
                },
                {
                    "sent": "Correlated with both the Q&A heat intensity so I had to kind of control for deaths and then.",
                    "label": 0
                },
                {
                    "sent": "Um, I think this trailer wasn't there and also another PhD which which I kind of expected based on a recent study.",
                    "label": 0
                },
                {
                    "sent": "I did say I have one additional thing.",
                    "label": 0
                },
                {
                    "sent": "This is just a first bigger than appetitive prediction errors, for example.",
                    "label": 0
                },
                {
                    "sent": "And you also see the dorsal.",
                    "label": 0
                },
                {
                    "sent": "Yes he did or slashy again thanks.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}