{
    "id": "k6akahetidjboiaqsaoobchojtd3k4bx",
    "title": "Pattern Discovery in Bioinformatics",
    "info": {
        "author": [
            "Jaak Vilo, University of Tartu"
        ],
        "published": "Dec. 14, 2007",
        "recorded": "October 2007",
        "category": [
            "Top->Computer Science->Bioinformatics"
        ]
    },
    "url": "http://videolectures.net/aop07_vilo_pdb/",
    "segmentation": [
        [
            "OK, good morning everybody.",
            "I will be talking about more on the applications side in by Infomatics, so there will be lots of lots of information about informatics.",
            "The task that we want to solve in biometrics and some very practical aspects.",
            "How we can approach these problems so it will be much less theoretical talk than than many of the previous ones.",
            "So I'm at the University of Tattoo and the research group is related to by informatics and data mining.",
            "And also the company Kurtyka basically for data management purposes these develop."
        ],
        [
            "Software.",
            "So by informatics pattern discovery, microarray data will be some of the topics.",
            "Who of you here first time have you know exactly what microarrays are?",
            "Who doesn't know who?",
            "Who does know?",
            "So who does not know?",
            "So we will be talking about micro arrays as well.",
            "Who's listening?",
            "That's a good question.",
            "OK and for.",
            "Keep yourself awake, you will be seeing some some pictures of."
        ],
        [
            "Of Estonia, so pattern discovery.",
            "In the first day tell was presenting this narrow.",
            "So basically we want to find some interesting features in the data.",
            "The features.",
            "Basically how are these?",
            "Maybe we can say that this is pattern some.",
            "First we need to have some sort of language in which we say that this is a pattern.",
            "Some kind of formal is the next we have to have some sort of quality criteria.",
            "Why do we say that this pattern is good or this pattern is better than the other one?",
            "So some sort of rating between them?",
            "And 3rd, we have the question how to find the best patterns that would fit the data data well.",
            "And hopefully we can do that fast, because the amounts of data are growing as we speak."
        ],
        [
            "What bioinformatics esta?",
            "This kind of a very small twist is that first of all we have to have the very right data to work with.",
            "It's a real data, it's being produced, it needs to be analyzed so it has to be relevant and interesting, and the results that we get out of that.",
            "Really, we need to interpret what the results are.",
            "What does the data tell us?",
            "And by informatics we have to contribute to the field of biology to some biological knowledge."
        ],
        [
            "So, but for Matics would be like a study of biological data with a goal to better understand biology.",
            "So it's not only algorithmics research on toy examples, but the IT has to also deliver to the biology."
        ],
        [
            "Yeah.",
            "So now we have we have a crash course into the biology part.",
            "DNA is safe, you know.",
            "They say acctg huge long letter of long sequence of nucleotides.",
            "This is the basis of everything in nature, really.",
            "The sequence letters, of course, correspond to molecules which which are packed in this double stranded Helix.",
            "So one copy is the perfect copy of the other strand, almost perfect copy.",
            "Then there are multiple level of organization wrapping this in around the new nucleosomes.",
            "Packing these together and basically the chromosomes would look like very tightly packed thing, so we treat this as a human sequence as a 3.2 giga.",
            "Gigabyte sequence file of four letters.",
            "But in fact it's a molecular end."
        ],
        [
            "80 in this DNA.",
            "The.",
            "Common knowledge of course says that somewhere are coded protein sequences that genes encode for proteins, and we have the molecules, DNA and proteins and these may interact with each other.",
            "Proteins interact with each other and so forth.",
            "So sequencing ideally should tell us everything should be more or less encoded in this DNA.",
            "So from the sequencing, we should actually somehow be able to list all the parts which are encoded in their every feature and then look for these features are, but they might be in three dimensional structure.",
            "How they might interact and most importantly, what is the function of each of these features?",
            "So the hypothesis, of course, is that DNA really determines what is the what is the function of these?",
            "Of the biological.",
            "Entity the cells the Organism."
        ],
        [
            "So this is example of very extremely simple gene.",
            "We know we have exons, we have introns.",
            "Multiple action insert entrance so this can be encoded put together to encode for a very gene.",
            "It can be Alternatively spliced so some parts can be skipped over and basically every possibility is there it can start from earlier from different places can and in the different place every X on the interim boundary can have differences.",
            "So basically almost everything can happen.",
            "Of course in reality in most of the cases genes in code for stable for one or the other feature.",
            "But reality is also that in human genome at least 3/4 of the genes have multiple variants coming from from a single gene locus in the genome.",
            "At the next year, of course it's not enough to have the magnetic tape there.",
            "They have the program on, so there must be some machine that reads the tape.",
            "The Turing machine that reads the tape, does the state changes outputs into different tape, perhaps so there must be also some kind of machines which at the right time read the tape produce these M RNA molecules, produce the proteins and.",
            "Allows the cell to function."
        ],
        [
            "So this is a truly valid for all of the.",
            "Kingdoms of life basically 4 four animals, plants, lower organisms.",
            "And the small differences or big differences in the genome?",
            "Or that's what makes us different species and unique.",
            "What makes us unique as individuals are the small, tiny changes in the DNA in majority are exactly the same DNA, 99.9% of whatever but the rest of us makes the small changes make US individuals, and we're living at the time when this start is about to come out in very high pace at the moment.",
            "And it's of course increasing."
        ],
        [
            "Now.",
            "We have this one single piece of tape given to us in the 1st.",
            "So the when the sperm meets the egg, so basically forms the cell and we have this one single tail.",
            "What happens later is just we multiply, copy that into each and every.",
            "Cell in our body.",
            "But it's interesting is that the program, the tape, the DNA is exactly the same or more or less exactly the same, with allowing some mutations in the errors in this copying process.",
            "But The thing is that these cells will take very different shapes.",
            "Actions activities there will be obviously the neurons will be very different from from from the muscle or from the liver cells, yet all of them have exactly the same DNA, so there must be something in the in the state of the cell that determines how it functions.",
            "How this differentiation happens when it is committed so that it's irreversible.",
            "You know about the stem cells?",
            "These are some types of cells which are able to produce different issues.",
            "And then there are stem cells which which are capable to produce the whole living organisms, the whole human.",
            "Individual yeah.",
            "And there are some features which can produce certain types of like mirror neurons only sandwich, which are able to produce other types of cells.",
            "So the intriguing question is really, what is determining this regulation?",
            "Given exactly the same."
        ],
        [
            "DNA.",
            "So this is these are now some pictures into how the regulation happens.",
            "So basically it's a picture of a cell outer membrane.",
            "When specific signals come they can be ions from the photons from the light.",
            "It can be some some.",
            "Hormones whatever, so our cell can send some signals to other cells.",
            "It comes in.",
            "The signal launches a signaling cascade.",
            "Make some small changes in the proteins.",
            "For example, phosphorylates activates the protein protein that may be a transcription factor.",
            "Then it gets activated and the whole machinery of making one specific gene is launched.",
            "There is a huge number of these interacting proteins in here that are needed that interact with the DNA, makes the first M RNA, then in the M RNA.",
            "These splices places out the introns.",
            "Export the remaining of the M RNA out from the new clothes when it is so, first it's transcribed, processed and then by ribosome it will be translated into the protein.",
            "Very schematic picture."
        ],
        [
            "It's a very recent review actually.",
            "What they say is the steps that were outlined in the previous sort of like one step follows.",
            "The other follows the other, but what they say is that it's very dynamic process where immediately everything is happening.",
            "As we transcribe already, the other proteins will act in here the splicing it will be immediately output output to the out from the nucleus, and so forth.",
            "So it's a very dynamic process.",
            "But we need to simplify of course.",
            "We can have a watcher look at the.",
            "Video.",
            "And they begin to.",
            "I don't know if you probably don't hear this.",
            "Paters bind to enhancer sequences.",
            "These factors are joined by general transcription factors, SRPSKI and RNA polymerase two at the promoter.",
            "To assemble a transcription initiation complex.",
            "When transcription begins, the carboxyl terminal domain of Paul two becomes heavily phosphorylated.",
            "The five prime end of the growing RNA is protected from 5 prime exonuclease icbi account of seven methyl G. Account binding complex and different kinds of HNR NPS bind to the RNA.",
            "The spice is self made up of SN RNA's and proteins removes the introns from the RNA.",
            "At a polyadenylation signal, a protein complex cleaves the M RNA and adds a Poly a tail.",
            "On the three prime end.",
            "A Poly, a binding protein and a cap binding complex protect the M RNA nad RNAs export into the cytoplasm.",
            "An initiation factor binds the cap while other proteins bind the M RNA and Poly a tail.",
            "The message is now prepared for translation initiation factors.",
            "The 40, S ribosomal subunit, and the initiator T RNA scan for the nearest Aug start codon translation begins.",
            "When the 60 S subunit binds to form the ribosome and ends when the ribosome encounters a stop codon.",
            "As translation continues, the Poly a tail shortens below a critical length.",
            "the M RNA loses its by prime cap and is degraded.",
            "That's it, very simple, right?",
            "Nothing else is happening in the cell at the same time, only this one thing, right?",
            "So it all of this happens so that there are almost no other interactions.",
            "This is this kind of be true, can it?",
            "So so we have."
        ],
        [
            "We have this problem of of the gene regulation.",
            "So how are all these different entities that are needed?",
            "How they are being activated?",
            "And and also more importantly, what are going to be these networks that that all these interactions that are needed in order for something to happen in the cell?",
            "So all these relationships between the entities will will.",
            "Basis of the networks so that we have the entities and we have the activities between them.",
            "Activates the transcription, allows to be interacting etc etc.",
            "So we want to have the parts list.",
            "Now we don't give it, but we should have more or less order parts described in the DNA, don't we?",
            "So we want to have the auto parts list and the connections and then to describe all these connections between the parts.",
            "What are the relationships?"
        ],
        [
            "So this is again the picture of signaling cascades.",
            "Activating transcription of a single gene, and there is a big machinery that needs to be activated at exactly the right time.",
            "And the question is, what are these DNA determinants that that allow exactly the right place?",
            "Something to be activated?"
        ],
        [
            "These are some networks of cell cycle, so you can see that there are lots of different entities in the cell that are somehow.",
            "Working together"
        ],
        [
            "And when there are."
        ],
        [
            "Huge machinery."
        ],
        [
            "Hopefully there are also some some some tiny or some regulating activities.",
            "So basically some triggers that trigger huge events so that cell can respond for a small trigger panic attack, the cell can activate the whole set of defense functions or or shutdown mode.",
            "Some activities launch the other activities, so this is the question, what are these major regulating?"
        ],
        [
            "Effect.",
            "In this machinery there will be.",
            "Yeah, it's nice to draw big balls but but there will be.",
            "This will be, for example, compressing over 85 so close to 100 different proteins are needed in order to have the full complex functional in the first place.",
            "And each of these entities actually encoded in some other place of the genome as a as a gene encoding for that protein polypeptide."
        ],
        [
            "OK. Just a little bit of how much do we know about all these regulation activities?",
            "So what I told so far there are these transcription factor interacting with the DNA and M RNA is being produced.",
            "There are also some other interesting features which have been discovered not too late to go.",
            "Actually the short micro RNA's who has never heard of the micro RNA before.",
            "All the rest have heard."
        ],
        [
            "But these so these are really discovered first in 9315.",
            "Years ago, less than 15 years ago, but 2001.",
            "They were given names and the name Micron in the 1st Place and Science published the set of articles.",
            "Basically that was a molecule of the year."
        ],
        [
            "What does this micro RNA do is interesting.",
            "It's itself is encoded in the DNA.",
            "When you make the RNA that doesn't get produced in the protein, but it stays as RNA.",
            "But out of these actually 1/2 is taken very short RNA sequence is, but it's functional.",
            "And what this very short RNA sequence can do, is it combined the other M RNA's.",
            "This is a picture of them are never the same sequence.",
            "RNA sequence can bind to 7 different places and you can see how how precise or flexible this interaction is really.",
            "So predominantly these M RNA micro RNA's affect the translation rate so that you have them RNA.",
            "But if there are micronase present that are attached to that M RNA, then the translation rates usually is much lower."
        ],
        [
            "So this is another set of genes that can regulate the other genes, but also the question remains, how are these genes being regulated that nobody knows about about that much anything?",
            "So these micro RNA genes are basically there.",
            "As.",
            "Again, exported on these in these short short RNAs are produced at Inter."
        ],
        [
            "With other molecules.",
            "So in the beginning there were very few actual knowledge of the micro Renee and actual regulation of this type.",
            "So people had to predict all of these and there are databases which methods that have been predicting these target sites for a given microarray micro RNA to predict."
        ],
        [
            "Target sites.",
            "And this is 1 example where we had to look at these sites.",
            "So basically you can see how much how much flexibility there is potentially in the binding of that micro RNA onto the onto the M RNA's."
        ],
        [
            "So given all these DNA sequences RNA."
        ],
        [
            "And so we would really like to find some some of the signals.",
            "Why exactly the right place something is encoded and what are these features in the DNA?"
        ],
        [
            "So for pattern discovery, the biological applications are really DNA, RNA and protein sequences, and in all of these when we when we treat them as linear structures this strings.",
            "Then we want to find some features."
        ],
        [
            "In most of the path we look at.",
            "At the transcription factors interacting with the DNA, so looking at DNA motifs that would be used as signals for transcription factors."
        ],
        [
            "So how can we?",
            "Really, there is a huge variety of transcription factors in yeast.",
            "There can be several 100 in human.",
            "It can be thousands.",
            "Then how can we find for each of them the possible targets?"
        ],
        [
            "In past Herbologist have produced some some wet lab very hard to do experiments and they have produced some data that says that transcription factor binds in here.",
            "We always kind of do exactly that.",
            "We may have to look at the indirect evidence indirectly.",
            "We know that all the genes are activated at the same time, so let's hope that they are activated by the same mechanism.",
            "So let's hope that most of these genes have something in common in their DNA.",
            "And there are some new techniques that will allow."
        ],
        [
            "Show show.",
            "Let's assume that the wet lab bench biologist or PhD student has produced this set of examples.",
            "I know that this is going to be the exact place where the sum binding has a curd.",
            "These six 6 characters long examples.",
            "So how do you generalize from that?",
            "It's obvious that you can count the letters of a Sgt in each position.",
            "In first position you have six days to tease.",
            "And so forth.",
            "So you get the count matrix when you want to visualize what this represents.",
            "You can count information content in every position, for example in the conserved Jeep.",
            "In here we know that.",
            "Phone if this position is always a G, then that position does not carry any additional information.",
            "We already knew that it's going to be G, so this is going to be 2 minus information content.",
            "Visualized big letter.",
            "So you can read out sort of consensus sequence.",
            "And what people usually do is that apply very simple formula.",
            "Look at the probabilities of each letter.",
            "The observed probabilities over the expected probability in the perfect random sequence.",
            "The expected would be .25 for every letter in real applications India in years, for example A&T are both 3 and GC2 frequency and then you get this kind of matrix.",
            "So from this count matrix you get similar position weight matrix and then you can given that you can give.",
            "Any any sequence you can give a score, So what would be the best score achieved by these metrics?",
            "Is that if you feel that if you ask to be scored a CG?",
            "T. GG ACG.",
            "The GG it's I don't even know if this is present in this set.",
            "I wasn't looking at that probably is not even present in that set, so it's sort of generalizes makes.",
            "The generalization of these examples, and this seems to work really very very well.",
            "We can give every sequence, every position in the DNA the score if the score is high.",
            "The position based metrics has the match.",
            "If the score is low, then we say it's a no match.",
            "And of course, in some positions we don't really know which letter is used.",
            "In here in here, the situation is the same, but because I use some prior knowledge that is in general should be more frequent.",
            "So that's G. That's why G gets rewarded more in this position.",
            "So.",
            "Very simple formula producing very powerful concept."
        ],
        [
            "Once you have these motives, of course you would like to do the motive matching.",
            "Ask where these entities occur in the DNA.",
            "I will be coming back to that a bit later."
        ],
        [
            "What we want to do is motive discovery.",
            "We are not in the beginning.",
            "Given these examples, we're given sequences and bio.",
            "She says that these sequences may share some common pattern, so we have to find something which is relatively common in this set of input sequences.",
            "Or of course, it's politicians don't say that we have to figure it out.",
            "Which which genes may which sequences measure the pattern?",
            "I will."
        ],
        [
            "Back to this.",
            "So why can we say that this some number of genes is going to have some common pattern?",
            "Because maybe the genes are known to have some common biological role.",
            "Or we can measure by microarrays the activities of this cheese.",
            "We can say if the genes are switched on and off at the same time in coherent manner, then hopefully they have some common signals that allowed to do this kind of switching."
        ],
        [
            "So microarrays.",
            "Measure gene expression activity so it's really something that we would like to understand how genes are expressed.",
            "There are many different variants now.",
            "We can also look at different things like where we can actually make lab experiments to figure out where the transcription factor has found in the in the cell in vitro.",
            "So these would be this chromatin immunoprecipitation on the microarray.",
            "So chromatin, immuno process chip chip experiments from precipitation on the micro arrays."
        ],
        [
            "OK, how does the microwave work?",
            "We have the cells and let's say we want to figure out how many M RNA's are produced or in this in this cell present at the given time.",
            "So we have first policies can extract all the M RNA's get rid of everything else.",
            "OK, we have the M RNA's in the in the tube.",
            "But next how can we tell which genes this M RNA's correspond to?",
            "So this is really what microarrays allowed to do."
        ],
        [
            "Let's do one trick in here.",
            "Let's add some.",
            "Reagent color the.",
            "Come on.",
            "First, basically the we can add some color which will later light on the name.",
            "No, no, this red color in here then.",
            "Give the name now.",
            "For basically the 1st for unit, the color to the."
        ],
        [
            "There are amazing.",
            "OK, so once we have that.",
            "What the micro arrays are their measurement devices?",
            "So we can take this content of M RNA's and measure every G. So for every gene what we what is being produced in the microwave in the beginning in the production is the single stranded DNA that is a that would be complementary to that M RNA on the previous slide.",
            "So we have this measurement device and now we take the previous content from the previous."
        ],
        [
            "Hybridize over and what will happen is that these entities will find their perfect partners in this measurement device so they will hybridize fixed together to the molecules that are present in the on the microarray.",
            "And we have these labels.",
            "Color color dyes.",
            "When we when you scan then this picture with the laser to the scanning or photo basically.",
            "Then you can read out which spots are lighting up.",
            "So for this gene there have been many M RNA is present in the in the in the cellular content so we can say that this gene is being active now."
        ],
        [
            "The same thing can be with the two colors.",
            "You can mix red and green.",
            "DICE and look at these."
        ],
        [
            "Which is so this would be like five years ago, I think already.",
            "Institute produced microarrays with all physical human genes present.",
            "So each gene would be sorry.",
            "Each spot in here would correspond to 1 gene of the genome and you can read out basically by image analysis.",
            "The features tell this is overlay of this red and green.",
            "So basically when it's yellow then it's almost the equal equality's.",
            "If it's red then only one.",
            "This present is in only one sample.",
            "When it's green, it's present in the other one."
        ],
        [
            "Affymetrix Illumina, some of the commercial different types of these measurement devices can use single channel dual channel.",
            "There are different variants, but basically the idea is the same.",
            "You hybridize your samples and you read out the Photo by photo, which spots are active.",
            "Which are not so these can contain millions of features, millions of different spots, and Affymetrix produces these chips using the old generation Silicon chip manufacturing techniques, masking out the thing and adding the new class."
        ],
        [
            "Eyes etc.",
            "OK, when you do.",
            "Just reading out one measurement is not enough.",
            "You want to have some experiment.",
            "You want to look at what is going on at different points in time, so you produce many of these images from each image.",
            "We know that we can extract all these features, but what we would like to have and what we will analyze later is that for each of these biological samples in this condition, this gene will have this activity.",
            "So this is this gene expression matrix for for every gene.",
            "And every year, in every sample you will have one measurement, which roughly tells some sort of level of activity of that gene in that sample.",
            "So basically we have the numerical matrix.",
            "There may be some, obviously this noisy.",
            "It's going to have errors, mistakes, missing values, noise, but we have this numerical table and now we want to interpret that."
        ],
        [
            "So these are the 10 year old first works, making the bike race first.",
            "I'm looking at the micro race by exploratory techniques clustering.",
            "Hierarchical clustering in here and visualization.",
            "So instead of looking at these."
        ],
        [
            "Numbers.",
            "Who can understand what's in the Big Excel table?",
            "You can't really read out all the numbers.",
            "Let's add the color on top of that cell to color."
        ],
        [
            "And here you can read out which values are positive values or negative easily, unless you are in this style tone and color blindness.",
            "Sorry about that so, but you can use different colors.",
            "This one is not clustering, but this one is taking the cell cycle experiment and Fourier transform by prior transform looking which.",
            "Which genes have cyclic behavior and then just sorting based on this activity?",
            "And these are very, very famous, groundbreaking works.",
            "The techniques of this are being used routinely."
        ],
        [
            "Also now.",
            "Obviously you can do cancer classification.",
            "Many of you may work on these.",
            "You can look at the different cancer samples, different patients and look which genes are able to classify.",
            "These two cancer crosses from each other.",
            "You can predict new cancer subtypes etc."
        ],
        [
            "This is example.",
            "There are different gene knockouts now that it's samples are rose in here.",
            "So you can observe let's Knockout 1 gene and let's observe what's happening.",
            "So in here the red line shows that when you two knockouts knocking out one or the other actually produced very similar effect.",
            "Both of them produce the effect that many genes will be upregulated after that.",
            "So they're both are needed to keep the gene expression down for these.",
            "For all these jeans in here.",
            "So this is already.",
            "You can see that this is the basis of building them some networks there is going to be some relationship from these two genes to all these genes, which are normally suppressed by these two."
        ],
        [
            "OK, now we have the micro arrays.",
            "We know that we can measure some some profiles.",
            "We can say that let's take all the genes which react in the similar manner.",
            "Let's take all the changes that are being shut down or activated at one at one time and then what we really want to look at is in the DNA sequences of these respective genes to see if there are features in the DNA.",
            "That are somehow enriched for this set of genes, and that was something that we did, 1998.",
            "A long time ago now and this is one of the very well.",
            "I don't know if it's still growing, but it was really huge topic in between 2000 and after that beyond so many many people have been working on this this type of."
        ],
        [
            "This.",
            "In the simplest form, you can just ask what is being enriched in this chain cluster in the manner that this is more frequent in the cluster than in the background and in the background.",
            "Now we can take the whole genomes.",
            "We can really look is something really being enriched in that in this data set and we can add very easily some enrichment scores or P values to each individual motive."
        ],
        [
            "I will come back to this motif finding soon.",
            "Let's think of this microarray as a measurement device for some other type of data.",
            "We know that in the DNA somewhere.",
            "Must this binding occur so when transcription factor is bound to the DNA?",
            "It may look something like this.",
            "So what you can do then is that.",
            "You can add some random enzyme.",
            "Basically cut again science, which would cut this DNA randomly chop into pieces."
        ],
        [
            "Something like this?",
            "Some will have no translation factor bound to it.",
            "Some will have binding still there.",
            "Now, if you are interested in this this green guy.",
            "How can we know where this green transcription factor is found in the whole DNA?",
            "You need something to fish out.",
            "These take out these DNA with the green factor."
        ],
        [
            "And this is done by this antibody.",
            "So for the protein you have the antibody, you pull that out and now you are left with all these cases of that green guy has been bound to.",
            "When you get rid now of this green guy, you have the same question, but which are these DNA pieces in here where that binding occurs and that's."
        ],
        [
            "Sure you can.",
            "You can actually use immediately the same micro array format.",
            "To do this kind of readout.",
            "Or nowadays people also start to sequence these pieces of DNA because sequencing technologies are becoming cheaper and cheaper.",
            "More and more high throughput.",
            "So we will have lots of lots of sequencing to happening in next years.",
            "So this is sort of like direct experiment, but of course it doesn't reveal you the whole that all the truth it gives you some strong binding, but it's still not the whole truth.",
            "And even in the case that you know that this is the wrong region, maybe 500 base pairs where something's bound to you still don't know exactly where that binding occurs, so you still have the problem of.",
            "OK, I have these examples of long sequences.",
            "Where exactly this short range signal was present on the?"
        ],
        [
            "Sequences I it would be of course very wrong to say that biologists would be interested only finding out these where this finding more curves.",
            "So biologists, when you do the experiment, they have produced some micro datasets, they do the clustering, some T test looking at the genes which are being enriched for one cancer type versus the other one, you have a G list to work with.",
            "So first question is actually not what is regulating this cheat list, but what this cheat list is doing in the first place.",
            "Just to characterize the cheat list to understand what's going on with these jeans.",
            "So.",
            "We can say that the G list is really as a set or a ranked list, because depending on the technology, T test can give you the rank list or some clustering.",
            "Partitioning based clustering would give you the set of genes."
        ],
        [
            "Since we had very strong, very nice presentations about the clustering, I wanted to show some very simple way how we produce actually user interface which biologists can be really working with.",
            "To look at the data and clustering.",
            "So this is.",
            "You can look to see that this is hierarchical clustering in here, but in fact what happens before this hierarchical clustering is that we apply K means on the whole data on the left, the K was chosen.",
            "200 and on the right it was 50.",
            "So basically first can do say 50K means clusters and then you take these clusters.",
            "You don't want to because K means doesn't give you any ordering between the clusters, we just had the ordering by hierarchical clustering.",
            "So this is representing the hierarchical clustering of 50 clusters.",
            "The first column is that cluster number and the 2nd is the size.",
            "So for cluster is this line and it has 70 genes.",
            "In that and you can see that there are.",
            "Some clusters which look quite similar to each other, so apologies can have the interface look at individual clusters, or they can combine all of these together.",
            "So this is exactly the same with 200 clusters and you can see that most of the features, yeah?",
            "What are your individual investor into you saved up for what exactly?",
            "We usually this to.",
            "Each color is really working for us.",
            "OK so this is.",
            "This is this numerical table from Excel, right?",
            "You have you have 10 time points, dimensionality 10.",
            "And in this case I think about 20,000 genes.",
            "First you take this 20,000 objects chains of length 10 vectors and you cluster these by K means.",
            "Into 50 clusters.",
            "So you have 5050 groups, 50 clusters.",
            "And for each of these 50 clusters, of course you have cheese that belong to that cluster, and you also have the mean in the center of that cluster.",
            "So basically what is being visualized in here is is by color code, but the typical center, the typical example in that cluster or the center in that cluster would look like.",
            "In this 10 dimensional space.",
            "So basically the.",
            "For example, in here you can see the activation is in these they 5, six and seven are being active when you look at this cluster.",
            "Reading here is positive, green is negative, so so being active or non active.",
            "Yes, we saw as you cited the person to talk about clustering.",
            "So did you do a stability analysis?",
            "You try to check with.",
            "There's not some OK means or how stated that so.",
            "So we.",
            "Another collaborator, yes, TK means stability analysis.",
            "Looking at many different runs and looking which cheese tend to stick together and that result cause producing 115 clusters of size more than one.",
            "Yeah, so you are not interested in singletons anymore, but basically the stability kind of looking at this would produce this 115 clusters.",
            "OK, you can show up and show them like this is the biggest cluster having 200 genes.",
            "50 genes 3015.",
            "Six at very rapidly growing down.",
            "And then you have lots of clusters with the 333GS.",
            "Two genes in this 115.",
            "And if you look only at this table classified GS, then you basically getting rid of something which is in between the clusters, which can be one or the other.",
            "So in here because this is a first illustration tool you really visualize versus what is in the data.",
            "It is unsupervised kind of thing.",
            "But I'm claiming in here if you do this sort of many enough clusters you do more dense clustering than what is the true number, whatever that means, yeah, then.",
            "You can still get the general picture of very high dimensional space.",
            "It's a 10 dimensional space visualized in very nice in a very compact manner actually.",
            "OK.",
            "I have a.",
            "Different OK, this is a time series of showing how embroid party of the mouse would develop from day 012, basically growing starting to develop different issues starting to.",
            "Yeah, basically the first 10 days of the development.",
            "So you can see which genes are active in the beginning of that development, which are more active after they 45.",
            "So basically you have biological background is like that.",
            "Now all this is your first question would which would be.",
            "I'm very interested in jeans which are turned on at specific moment, say at day three.",
            "What are the main things that happen in the data?"
        ],
        [
            "Once we have produced this first look at the data, we came out the update.",
            "Very simple question OK, but balances are really interested in jeans which are being activated at say 456 and then the activated OK we can produce clustering and say that go and look for him for that cluster yourself or we can provide this template and say that everything that resembles this template.",
            "000111000 everything that is correlated to that template, you can provide as the answer right?",
            "You can look at the upregulation.",
            "You can look at the downregulation.",
            "And you can look at which which is represented in this manner."
        ],
        [
            "When you do this.",
            "For all the possible templates.",
            "You can have a look at at now very detailed sort of, at which stage something is being activated or deactivated.",
            "So the up regulation that is only staying active for one day.",
            "These which are staying active for.",
            "For.",
            "Start from day to stay up in either one day, two days, three days, four days, and so forth.",
            "So basically giving different view on the data and the numbers in here in here show how many.",
            "How many genes are present?",
            "I don't want to spill water over there.",
            "Certificates."
        ],
        [
            "So these were sort of like sharp porters and there are more subtle.",
            "Changes, so these are visualized in here.",
            "So we have the."
        ],
        [
            "We divided the space into meaningful sort of cluster templates which have the interpretation.",
            "It does not mean.",
            "What is normal graphic likenesses?"
        ],
        [
            "Babes, sorry."
        ],
        [
            "That means that that to this template, which would be.",
            "At Day 3, going down and staying down for two days and we're basically a deep.",
            "There was nothing at correlation more than .8, so of course you can choose the correlation in here.",
            "In this case, how many how many correlated genes you want to have, and then you have the question do you want to vote annoyed?",
            "Diagram G belongs only to one cluster or chain can both be in both kind of easy to partitioning, or is it?",
            "More general and the user interface, then they can actually look and combine these things.",
            "OK, I don't care if it's stays down deactivated for one day longer.",
            "I can combine different things and get this chain lists."
        ],
        [
            "So these are some comparisons with printouts from this from the web."
        ],
        [
            "From the website.",
            "OK, so.",
            "Clustering I was I was in this example where the number cluster #4 at 78 jeans.",
            "You can click on this row or you could merge the clusters.",
            "OK now you have 78 cheese So what?",
            "What do the 78 G is really real?"
        ],
        [
            "You do OK. First you can present what these genes are.",
            "The list of genes.",
            "But their names are what their function is.",
            "Biologists probably would be able to recognize at least couple of these team names.",
            "Yeah, they would say that.",
            "Oh yeah, I know this one.",
            "I know this one interesting.",
            "OK, So what next?"
        ],
        [
            "We want to find some."
        ],
        [
            "A common feature or theme.",
            "What this cluster tells us."
        ],
        [
            "So we want to somehow characterize this cluster.",
            "By some biological meaning.",
            "And as a meaning we can use, we can look at every page in the respective in their respective gene databases.",
            "We can we could do some text mining to observe some frequent words.",
            "We can use the gene ontology classified.",
            "So basically the very standardized way to classify gene functions, molecular function, biological process function is something very specific like enzymatic activity.",
            "And process is a more general like like like energy metabolism or cell cycle and and they speak processes or they also characterized the cellular content localization basically is it.",
            "Is it a membrane bound protein?",
            "Is it in the new closes it in the cytoplasm which complex it belongs to?",
            "These are like.",
            "I would like to say orthogonal ways to characterize genes, although of course they're not entirely orthogonal orthogonal, because there are some constraints in that space.",
            "But anyway we can use this genealogy.",
            "We can look at the previously known pathway descriptions.",
            "We can look at the shared regulatory motifs or micro RNA target sites, you name it.",
            "The.",
            "The way how we would like to characterize things is from generic to more specific.",
            "So this is example of go.",
            "DNA metabolism is different, more specific, more and more specific.",
            "Activities in the process is under this class, and it's a.",
            "It's a directed acyclic graph.",
            "So basically one node in here can have multiple different parents, so it is a relationship.",
            "And of course, for different organisms the genes have been mapped by previous knowledge into this class."
        ],
        [
            "This is and we can use that so we have a question that we have some previously known classes.",
            "Or function one that within that it holds function 2, function 3.",
            "There will be overlaps.",
            "Between these classes and so forth.",
            "So these are our previously known knowledge, previously known associated gene lists."
        ],
        [
            "And now we have the query possible queries query one or query two and we would like to characterize what is being represented by that query.",
            "So in the query one you can see that oh it's so nicely with the function one, so basically.",
            "The most descriptive pattern would be to say that query one player has genes that belong to function one.",
            "And query two can hit several functions.",
            "Maybe the overlap is random, maybe not.",
            "We don't know that at this stage, right?",
            "So, but we want to make."
        ],
        [
            "These kinds of queries.",
            "And this is again something that that is really needed in biology and many tools are around."
        ],
        [
            "So we published our version which for this gene list in here tells which classes are statistically significantly enriched and also by color coding.",
            "We show exactly that this gene was previously known to belong to this power.",
            "Synthesis of steroids pathway.",
            "So out of the query.",
            "In here you can try it out, but basically 99G in South of 26 in here hit this pathway that normally has only 16 Members, so 9 out of 16 were present in the query, so it's significant overlap.",
            "When you think that there are overall is 20,000 genes characterized in this man."
        ],
        [
            "No."
        ],
        [
            "So it produces this P values categories looking at different different data points.",
            "The color coding shows different evidence codes which."
        ],
        [
            "Just jumped over."
        ],
        [
            "So basically, the knowledge that something belongs to a class is not always exactly the same knowledge.",
            "We have better or weaker assumptions about that.",
            "So these are."
        ],
        [
            "Like Direct Direct says, direct biological experiments making sure that this function is true or some some indirect evidence carrying this function prediction over by homology based and so forth.",
            "And it's running means."
        ],
        [
            "If you think of this as a set query, you have a query or just a set, then that's."
        ],
        [
            "First, telling before, but we can also look at this as a ranked list query, so the rank list would be telling that.",
            "First 26 genes, then nine out of these belong to this pathway and to fetch 26.",
            "Chains out of 2020 thousand so that we have 9 out of 16 present in this in this would give us P value 10 to minus 21 something it's significant.",
            "But you can see that this is a ranked list.",
            "So basically we could draw the line almost in here or there.",
            "And of course we're looking for the locally the the optimum cut point."
        ],
        [
            "So this P value is very simple.",
            "Basically we can do this combinatorial thing if we fetch out so many things without replacement, what is the probability to observe as many hits to the pathway?",
            "It's a hypergeometric probability and we can look at the tail basically of that probability distribution.",
            "But there is a multiple testing problem.",
            "Yes, we have one G1 queryset.",
            "But what we are comparing against is not one set subset in that in the in the database, but we are comparing against thousands of sets.",
            "So by random chance, some of these would give us some overlaps anyway and we have to somehow quantify, quantify this multiple testing, take into account that the database has sets of different sizes and the queries can be of different sizes."
        ],
        [
            "So what we've?",
            "What would be the normal standard procedure would be one ferroni correction is the easiest.",
            "If you do so many tests, your chances of hitting something are the same number of times higher.",
            "So point ironic correction in here.",
            "This is a randomization illustrating randomization experiment.",
            "The point Veronica correction would be this blue line saying that.",
            "The significance threshold in here for a query of size 70, the P value would should be 10 to minus.",
            "Minus five is in here, something like below 10 to minus 5 -- 6.",
            "So it would say that everything that would be better than that would be called significant.",
            "Forced discovery rate at 5% level is this line and of course you can see that given this false discovery rate FPR pantalones actually rather strict correction.",
            "The true line, the true correction from this randomization experiment in here is the observed empirical rate.",
            "Is this black line?",
            "So in this case it lies between the FDR line and a point thrown correction line.",
            "And what we used in the previous examples, of course you can use it upon Peroni or FDR, but what we are using is this Gray line in here which we were able to basically analytically looking at the looking at the whole database structure.",
            "We know that we have these sets of different sizes and counting these sets looking at the probabilities of the overlaps, we could actually pretty well over overlay.",
            "That prediction that predicted multiple testing correction with the randomized.",
            "A test, so basically randomizing the query in total random queries, how often.",
            "If you allow 5 * 5% of the times to produce something more significant results than where we where, we should put a cut of.",
            "But of course, sometimes people biologist is not interested only in significant enrichment, but basically any hint about that class would be already useful, so you can sort of very this.",
            "Level of scrutiny, basically."
        ],
        [
            "So we we will have coffee break at half past, right?",
            "So.",
            "I've been talking now about this biological motivation micro race, some, some clustering, exploratory analysis, and analyzing the gene set enrichment.",
            "Looking at the function that is concerned for that set of genes.",
            "Now I would like to slowly move into this motive discovery in the DNA or the sequence data.",
            "And there will be.",
            "Yeah, so basically we will have the questions of this terministic and probabilistic.",
            "Language is to describe the patterns and then how can we really find these motifs in the DNA sequences?",
            "Do we want to describe a set of genes set of sequences, or do we want to discriminate one set of the sequences from the other set?",
            "So these are kind of the questions that are important.",
            "And in the algorithmic part.",
            "So basically you can say that.",
            "OK, to find something significant.",
            "To find some significant motif.",
            "The easiest would be to use the Oracle.",
            "Oracle tells us that this is the motif.",
            "Go and check it on the on your data.",
            "It has an extremely good P value.",
            "But we would not somehow need to simulate that Oracle to find the correct representation that gives us the best P value or whatever score we want to achieve."
        ],
        [
            "Explain this."
        ],
        [
            "Picture."
        ],
        [
            "OK.",
            "Multiple testing problem in here.",
            "We can produce these clusters in so many different ways.",
            "We can cluster too.",
            "All basically permutations of different sizes of the clusters.",
            "We can have many clusters, many, many, many data sets to be analyzed.",
            "So for one data set, I mean that produced the set of sequences and ask is there anything significantly enriched for that set of sequences?",
            "So first of the first is multiple testing.",
            "Problem is that because I asked the same question from many different data sets, how significant is this going to be?",
            "Right?",
            "The second source of multiple testing is.",
            "That, given all these sequences.",
            "And this extremely powerful Oracle.",
            "What was the search space that the Oracle search for?",
            "How many different patterns there are in the 1st place that can have some sort of enrichment?",
            "So you have.",
            "Enumerate all possible patterns.",
            "You can enumerate all possible configurations of your position, weight matrices and with the position weight matrices.",
            "Of course it's infinite if you treat this as as really true floating point numbers, yeah.",
            "This is not the infinite, but it's finite set.",
            "But still it's basically huge huge number.",
            "So.",
            "Do we have any chance to find something biologically significant?",
            "Would be the first question."
        ],
        [
            "And then.",
            "This is now.",
            "Representing randomization experiment.",
            "Taking 50 / 50,000 times a set of genes set of sequences.",
            "Just a random set.",
            "And asking for that random set, would there be some motive which is enriched in that set and just plotting the best P value that can that could be observed from that randomization?",
            "Based experiment.",
            "So basically you need to look at only at this this P values in here because it's a random set.",
            "This doesn't mean make any, but this doesn't mean anything at this moment the X axis, only the Y axis.",
            "You can see sort of the density that.",
            "In this 50,000 times repeating the experiment or slightly varying sizes.",
            "So basically there are a couple of times we hate this 10 to minus 8.",
            "P value.",
            "Without correcting it, it's not that would be non corrected P value exactly the same kind of set of P value the set overlapped.",
            "Kind of thing.",
            "What is the significance of this overlap motif?",
            "And the sequence data set."
        ],
        [
            "This is what the same experiment was for the real data.",
            "The 50,000 clusters in this time there were produced from the from the clustering of the data.",
            "And exactly the same thing, plotting at finding the motives.",
            "The motif in here is just a substring holige of length 5678.",
            "Without restricting the length of the motif, and you cannot."
        ],
        [
            "Clearly see that there is something is going on that that clusters were not produced randomly.",
            "That is very important thing.",
            "The measurement device the microwave gave us something that was not random.",
            "So we could say that every all of these motifs below this red line, some of the motifs are exactly the same, just having different P values doesn't matter at this moment, all of them are something which should have some biologically meaningful.",
            "Reason behind them.",
            "What is on the X axis now in here is.",
            "Is some one of the possible?",
            "Quality criterions for saying how good a cluster is, and this is a silhouette value.",
            "It wasn't mentioned yesterday, but it would just basically say that.",
            "Inter cluster distances versus that distances to the next closest cluster?",
            "How much better the intra within the cluster the distances are?",
            "How much shorter they are in average than the crossing over to the next closest cluster.",
            "So basically isolated cluster would have very high positive.",
            "Select value and in some cases you can have negative values because it seems that on average the objects could be placed also to the next cluster.",
            "So of course the question was sort of like Buddha better clusters in this micro data space deliver us better signal detection in the motive space.",
            "Well, you could say that that there is some correlation.",
            "We really didn't want to even go much further to say that this is significant or the correlation coefficient like that, but there may be something that.",
            "At least we attempted to look at back then.",
            "That is a study in 2000 to look at the.",
            "Correlation between how good the cluster is versus how good motive detected from the.",
            "Promoter sequences from that cluster where."
        ],
        [
            "This picture.",
            "So basically we as a motif.",
            "In this case, we used substrings of any length in the DNA.",
            "There is fixed substring.",
            "It occurs or does not occur is a very precise deterministic thing."
        ],
        [
            "How can we count that?",
            "So suffix trees is the natural choice.",
            "Of course, the first choice becausw given.",
            "The input sequence you can produce in linear time.",
            "In linear space.",
            "You can produce the structure that enumerates every possible.",
            "Substring in this in this structure.",
            "Basically it represents all these different suffixes from from the first character from the second character position.",
            "Third, 4th, 5th and just added end of string symbol.",
            "So basically it takes all of these possible suffixes.",
            "You have North suffixes of length N, N -- 1 and minus 2.",
            "But you can put them all in the tree data structure.",
            "In the linear space you can enumerate everything.",
            "So.",
            "But what would this note tell you?",
            "So it will tell that 8080.",
            "Can be spelled out from the position #2.",
            "1 two position from two 8080.",
            "End of string.",
            "So that's what the data structure tells you.",
            "Of course, when you look at all the path lengths when you look at all the labelings then you have.",
            "Path should spell out any length N length N -- N length, N -- 2, etc.",
            "It's clearly quadratic or the path lengths right?",
            "How come this suffix trees linear size?",
            "Anybody knows the answer?",
            "Who does not know the answer yet?",
            "Very careful, very careful so.",
            "How many leaves would this tree have?",
            "Every different suffix is different from each other.",
            "It must be because it has different length.",
            "It has different content.",
            "So every because we added this$ in here every suffix is different.",
            "Every path is leaf is different, so we have how many leaves exactly and possible leads 123456.",
            "That's simple, the problem was.",
            "Yeah, this is simple and what we have ensured in here is that within the tree above, the leaves every node is a branching node.",
            "Even, even if it's a binary tree, the simplest 1 one Note 2 leaves we have always.",
            "And if you require this feature, you can buy inductive proof.",
            "You can easily prove that that given end leaves there is N -- 1 internal nodes.",
            "So basically every every leaf, every internal node is branching.",
            "That means that there is less than N branching nodes in the tree.",
            "What happens to these labels?",
            "Because that was the source of this quadratic size.",
            "These would be.",
            "Actually possible to replace by a very simple pair or 1 pointer and the length.",
            "So basically this would be a pointer to position one and length 6, so this label.",
            "You can read out from the original sequence any label you can read out from the original sequence.",
            "This 80 you can read out from the position two length 2.",
            "So now in this very simple trick.",
            "Every label in this linear size tree is constant size.",
            "And then that's why the world this suffix trees the first linear time constructions were proposed.",
            "I think in 1973 they were independent, not independent, but different algorithms.",
            "Proposed linear that linear time are able to generate these things.",
            "A lot of research in this combinatorial pattern matching in the string algorithm a space has been tossed.",
            "These kinds of indexing structures suffix trees are being used in your favorite compression algorithms.",
            "Beat zip I think uses this suffix tree like now.",
            "They use suffix arrays.",
            "Suffix array is a different thing is fixed or it would be just a readout of these labels.",
            "241356 you put into array and that is your perfect.",
            "Indexing structure because that allows to do binary search over the over these strings.",
            "I've not going to this two years ago in bertinoro this.",
            "Linear time suffix array construction was was described that was, that is a very recent algorithmic development, like about three years ago, three independent groups proposed linear time construction for the suffix array.",
            "Suffix array can be constructed linear time.",
            "When you look at this algorithm, you produce linear time, the suffix tree and you just read out the labels in in the leaves.",
            "That is your linear time construction, but trick there was to have without the suffix tree step.",
            "So that's a very very nice field of research.",
            "OK, so 80 how many times 80 occurs now in the input input data.",
            "80 occurs.",
            "Twice two different suffixes have 80 as a prefix.",
            "T occurs twice because two different suffixes occur.",
            "Have T in the first letter.",
            "So it's very simple counting machine for how many different substrings you have in the data.",
            "So to just count substrings, you can enumerate all the substrings, look at every every node and last time.",
            "Again Apostolic was presenting this how to how to then further if you use some significance criteria which would be monotonic, how you only need to look at these internal nodes and these can be also calculated in polynomial in linear time."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, good morning everybody.",
                    "label": 0
                },
                {
                    "sent": "I will be talking about more on the applications side in by Infomatics, so there will be lots of lots of information about informatics.",
                    "label": 0
                },
                {
                    "sent": "The task that we want to solve in biometrics and some very practical aspects.",
                    "label": 0
                },
                {
                    "sent": "How we can approach these problems so it will be much less theoretical talk than than many of the previous ones.",
                    "label": 0
                },
                {
                    "sent": "So I'm at the University of Tattoo and the research group is related to by informatics and data mining.",
                    "label": 0
                },
                {
                    "sent": "And also the company Kurtyka basically for data management purposes these develop.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Software.",
                    "label": 0
                },
                {
                    "sent": "So by informatics pattern discovery, microarray data will be some of the topics.",
                    "label": 1
                },
                {
                    "sent": "Who of you here first time have you know exactly what microarrays are?",
                    "label": 0
                },
                {
                    "sent": "Who doesn't know who?",
                    "label": 0
                },
                {
                    "sent": "Who does know?",
                    "label": 0
                },
                {
                    "sent": "So who does not know?",
                    "label": 0
                },
                {
                    "sent": "So we will be talking about micro arrays as well.",
                    "label": 0
                },
                {
                    "sent": "Who's listening?",
                    "label": 0
                },
                {
                    "sent": "That's a good question.",
                    "label": 0
                },
                {
                    "sent": "OK and for.",
                    "label": 0
                },
                {
                    "sent": "Keep yourself awake, you will be seeing some some pictures of.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of Estonia, so pattern discovery.",
                    "label": 1
                },
                {
                    "sent": "In the first day tell was presenting this narrow.",
                    "label": 0
                },
                {
                    "sent": "So basically we want to find some interesting features in the data.",
                    "label": 0
                },
                {
                    "sent": "The features.",
                    "label": 0
                },
                {
                    "sent": "Basically how are these?",
                    "label": 0
                },
                {
                    "sent": "Maybe we can say that this is pattern some.",
                    "label": 0
                },
                {
                    "sent": "First we need to have some sort of language in which we say that this is a pattern.",
                    "label": 0
                },
                {
                    "sent": "Some kind of formal is the next we have to have some sort of quality criteria.",
                    "label": 0
                },
                {
                    "sent": "Why do we say that this pattern is good or this pattern is better than the other one?",
                    "label": 1
                },
                {
                    "sent": "So some sort of rating between them?",
                    "label": 1
                },
                {
                    "sent": "And 3rd, we have the question how to find the best patterns that would fit the data data well.",
                    "label": 0
                },
                {
                    "sent": "And hopefully we can do that fast, because the amounts of data are growing as we speak.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What bioinformatics esta?",
                    "label": 0
                },
                {
                    "sent": "This kind of a very small twist is that first of all we have to have the very right data to work with.",
                    "label": 0
                },
                {
                    "sent": "It's a real data, it's being produced, it needs to be analyzed so it has to be relevant and interesting, and the results that we get out of that.",
                    "label": 0
                },
                {
                    "sent": "Really, we need to interpret what the results are.",
                    "label": 0
                },
                {
                    "sent": "What does the data tell us?",
                    "label": 0
                },
                {
                    "sent": "And by informatics we have to contribute to the field of biology to some biological knowledge.",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So, but for Matics would be like a study of biological data with a goal to better understand biology.",
                    "label": 0
                },
                {
                    "sent": "So it's not only algorithmics research on toy examples, but the IT has to also deliver to the biology.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "So now we have we have a crash course into the biology part.",
                    "label": 0
                },
                {
                    "sent": "DNA is safe, you know.",
                    "label": 0
                },
                {
                    "sent": "They say acctg huge long letter of long sequence of nucleotides.",
                    "label": 0
                },
                {
                    "sent": "This is the basis of everything in nature, really.",
                    "label": 0
                },
                {
                    "sent": "The sequence letters, of course, correspond to molecules which which are packed in this double stranded Helix.",
                    "label": 0
                },
                {
                    "sent": "So one copy is the perfect copy of the other strand, almost perfect copy.",
                    "label": 0
                },
                {
                    "sent": "Then there are multiple level of organization wrapping this in around the new nucleosomes.",
                    "label": 0
                },
                {
                    "sent": "Packing these together and basically the chromosomes would look like very tightly packed thing, so we treat this as a human sequence as a 3.2 giga.",
                    "label": 0
                },
                {
                    "sent": "Gigabyte sequence file of four letters.",
                    "label": 0
                },
                {
                    "sent": "But in fact it's a molecular end.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "80 in this DNA.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Common knowledge of course says that somewhere are coded protein sequences that genes encode for proteins, and we have the molecules, DNA and proteins and these may interact with each other.",
                    "label": 0
                },
                {
                    "sent": "Proteins interact with each other and so forth.",
                    "label": 0
                },
                {
                    "sent": "So sequencing ideally should tell us everything should be more or less encoded in this DNA.",
                    "label": 0
                },
                {
                    "sent": "So from the sequencing, we should actually somehow be able to list all the parts which are encoded in their every feature and then look for these features are, but they might be in three dimensional structure.",
                    "label": 0
                },
                {
                    "sent": "How they might interact and most importantly, what is the function of each of these features?",
                    "label": 0
                },
                {
                    "sent": "So the hypothesis, of course, is that DNA really determines what is the what is the function of these?",
                    "label": 0
                },
                {
                    "sent": "Of the biological.",
                    "label": 0
                },
                {
                    "sent": "Entity the cells the Organism.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is example of very extremely simple gene.",
                    "label": 1
                },
                {
                    "sent": "We know we have exons, we have introns.",
                    "label": 0
                },
                {
                    "sent": "Multiple action insert entrance so this can be encoded put together to encode for a very gene.",
                    "label": 0
                },
                {
                    "sent": "It can be Alternatively spliced so some parts can be skipped over and basically every possibility is there it can start from earlier from different places can and in the different place every X on the interim boundary can have differences.",
                    "label": 0
                },
                {
                    "sent": "So basically almost everything can happen.",
                    "label": 0
                },
                {
                    "sent": "Of course in reality in most of the cases genes in code for stable for one or the other feature.",
                    "label": 0
                },
                {
                    "sent": "But reality is also that in human genome at least 3/4 of the genes have multiple variants coming from from a single gene locus in the genome.",
                    "label": 0
                },
                {
                    "sent": "At the next year, of course it's not enough to have the magnetic tape there.",
                    "label": 0
                },
                {
                    "sent": "They have the program on, so there must be some machine that reads the tape.",
                    "label": 0
                },
                {
                    "sent": "The Turing machine that reads the tape, does the state changes outputs into different tape, perhaps so there must be also some kind of machines which at the right time read the tape produce these M RNA molecules, produce the proteins and.",
                    "label": 0
                },
                {
                    "sent": "Allows the cell to function.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is a truly valid for all of the.",
                    "label": 0
                },
                {
                    "sent": "Kingdoms of life basically 4 four animals, plants, lower organisms.",
                    "label": 1
                },
                {
                    "sent": "And the small differences or big differences in the genome?",
                    "label": 0
                },
                {
                    "sent": "Or that's what makes us different species and unique.",
                    "label": 1
                },
                {
                    "sent": "What makes us unique as individuals are the small, tiny changes in the DNA in majority are exactly the same DNA, 99.9% of whatever but the rest of us makes the small changes make US individuals, and we're living at the time when this start is about to come out in very high pace at the moment.",
                    "label": 0
                },
                {
                    "sent": "And it's of course increasing.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "We have this one single piece of tape given to us in the 1st.",
                    "label": 0
                },
                {
                    "sent": "So the when the sperm meets the egg, so basically forms the cell and we have this one single tail.",
                    "label": 0
                },
                {
                    "sent": "What happens later is just we multiply, copy that into each and every.",
                    "label": 0
                },
                {
                    "sent": "Cell in our body.",
                    "label": 0
                },
                {
                    "sent": "But it's interesting is that the program, the tape, the DNA is exactly the same or more or less exactly the same, with allowing some mutations in the errors in this copying process.",
                    "label": 0
                },
                {
                    "sent": "But The thing is that these cells will take very different shapes.",
                    "label": 0
                },
                {
                    "sent": "Actions activities there will be obviously the neurons will be very different from from from the muscle or from the liver cells, yet all of them have exactly the same DNA, so there must be something in the in the state of the cell that determines how it functions.",
                    "label": 0
                },
                {
                    "sent": "How this differentiation happens when it is committed so that it's irreversible.",
                    "label": 0
                },
                {
                    "sent": "You know about the stem cells?",
                    "label": 0
                },
                {
                    "sent": "These are some types of cells which are able to produce different issues.",
                    "label": 0
                },
                {
                    "sent": "And then there are stem cells which which are capable to produce the whole living organisms, the whole human.",
                    "label": 0
                },
                {
                    "sent": "Individual yeah.",
                    "label": 0
                },
                {
                    "sent": "And there are some features which can produce certain types of like mirror neurons only sandwich, which are able to produce other types of cells.",
                    "label": 0
                },
                {
                    "sent": "So the intriguing question is really, what is determining this regulation?",
                    "label": 0
                },
                {
                    "sent": "Given exactly the same.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "DNA.",
                    "label": 0
                },
                {
                    "sent": "So this is these are now some pictures into how the regulation happens.",
                    "label": 0
                },
                {
                    "sent": "So basically it's a picture of a cell outer membrane.",
                    "label": 0
                },
                {
                    "sent": "When specific signals come they can be ions from the photons from the light.",
                    "label": 0
                },
                {
                    "sent": "It can be some some.",
                    "label": 0
                },
                {
                    "sent": "Hormones whatever, so our cell can send some signals to other cells.",
                    "label": 0
                },
                {
                    "sent": "It comes in.",
                    "label": 0
                },
                {
                    "sent": "The signal launches a signaling cascade.",
                    "label": 0
                },
                {
                    "sent": "Make some small changes in the proteins.",
                    "label": 0
                },
                {
                    "sent": "For example, phosphorylates activates the protein protein that may be a transcription factor.",
                    "label": 0
                },
                {
                    "sent": "Then it gets activated and the whole machinery of making one specific gene is launched.",
                    "label": 0
                },
                {
                    "sent": "There is a huge number of these interacting proteins in here that are needed that interact with the DNA, makes the first M RNA, then in the M RNA.",
                    "label": 0
                },
                {
                    "sent": "These splices places out the introns.",
                    "label": 0
                },
                {
                    "sent": "Export the remaining of the M RNA out from the new clothes when it is so, first it's transcribed, processed and then by ribosome it will be translated into the protein.",
                    "label": 0
                },
                {
                    "sent": "Very schematic picture.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's a very recent review actually.",
                    "label": 0
                },
                {
                    "sent": "What they say is the steps that were outlined in the previous sort of like one step follows.",
                    "label": 0
                },
                {
                    "sent": "The other follows the other, but what they say is that it's very dynamic process where immediately everything is happening.",
                    "label": 0
                },
                {
                    "sent": "As we transcribe already, the other proteins will act in here the splicing it will be immediately output output to the out from the nucleus, and so forth.",
                    "label": 0
                },
                {
                    "sent": "So it's a very dynamic process.",
                    "label": 0
                },
                {
                    "sent": "But we need to simplify of course.",
                    "label": 0
                },
                {
                    "sent": "We can have a watcher look at the.",
                    "label": 0
                },
                {
                    "sent": "Video.",
                    "label": 0
                },
                {
                    "sent": "And they begin to.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you probably don't hear this.",
                    "label": 0
                },
                {
                    "sent": "Paters bind to enhancer sequences.",
                    "label": 0
                },
                {
                    "sent": "These factors are joined by general transcription factors, SRPSKI and RNA polymerase two at the promoter.",
                    "label": 0
                },
                {
                    "sent": "To assemble a transcription initiation complex.",
                    "label": 0
                },
                {
                    "sent": "When transcription begins, the carboxyl terminal domain of Paul two becomes heavily phosphorylated.",
                    "label": 0
                },
                {
                    "sent": "The five prime end of the growing RNA is protected from 5 prime exonuclease icbi account of seven methyl G. Account binding complex and different kinds of HNR NPS bind to the RNA.",
                    "label": 0
                },
                {
                    "sent": "The spice is self made up of SN RNA's and proteins removes the introns from the RNA.",
                    "label": 0
                },
                {
                    "sent": "At a polyadenylation signal, a protein complex cleaves the M RNA and adds a Poly a tail.",
                    "label": 0
                },
                {
                    "sent": "On the three prime end.",
                    "label": 0
                },
                {
                    "sent": "A Poly, a binding protein and a cap binding complex protect the M RNA nad RNAs export into the cytoplasm.",
                    "label": 0
                },
                {
                    "sent": "An initiation factor binds the cap while other proteins bind the M RNA and Poly a tail.",
                    "label": 0
                },
                {
                    "sent": "The message is now prepared for translation initiation factors.",
                    "label": 0
                },
                {
                    "sent": "The 40, S ribosomal subunit, and the initiator T RNA scan for the nearest Aug start codon translation begins.",
                    "label": 0
                },
                {
                    "sent": "When the 60 S subunit binds to form the ribosome and ends when the ribosome encounters a stop codon.",
                    "label": 0
                },
                {
                    "sent": "As translation continues, the Poly a tail shortens below a critical length.",
                    "label": 0
                },
                {
                    "sent": "the M RNA loses its by prime cap and is degraded.",
                    "label": 0
                },
                {
                    "sent": "That's it, very simple, right?",
                    "label": 0
                },
                {
                    "sent": "Nothing else is happening in the cell at the same time, only this one thing, right?",
                    "label": 0
                },
                {
                    "sent": "So it all of this happens so that there are almost no other interactions.",
                    "label": 0
                },
                {
                    "sent": "This is this kind of be true, can it?",
                    "label": 0
                },
                {
                    "sent": "So so we have.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have this problem of of the gene regulation.",
                    "label": 1
                },
                {
                    "sent": "So how are all these different entities that are needed?",
                    "label": 1
                },
                {
                    "sent": "How they are being activated?",
                    "label": 0
                },
                {
                    "sent": "And and also more importantly, what are going to be these networks that that all these interactions that are needed in order for something to happen in the cell?",
                    "label": 0
                },
                {
                    "sent": "So all these relationships between the entities will will.",
                    "label": 0
                },
                {
                    "sent": "Basis of the networks so that we have the entities and we have the activities between them.",
                    "label": 0
                },
                {
                    "sent": "Activates the transcription, allows to be interacting etc etc.",
                    "label": 0
                },
                {
                    "sent": "So we want to have the parts list.",
                    "label": 0
                },
                {
                    "sent": "Now we don't give it, but we should have more or less order parts described in the DNA, don't we?",
                    "label": 0
                },
                {
                    "sent": "So we want to have the auto parts list and the connections and then to describe all these connections between the parts.",
                    "label": 0
                },
                {
                    "sent": "What are the relationships?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is again the picture of signaling cascades.",
                    "label": 0
                },
                {
                    "sent": "Activating transcription of a single gene, and there is a big machinery that needs to be activated at exactly the right time.",
                    "label": 0
                },
                {
                    "sent": "And the question is, what are these DNA determinants that that allow exactly the right place?",
                    "label": 0
                },
                {
                    "sent": "Something to be activated?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These are some networks of cell cycle, so you can see that there are lots of different entities in the cell that are somehow.",
                    "label": 0
                },
                {
                    "sent": "Working together",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And when there are.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Huge machinery.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hopefully there are also some some some tiny or some regulating activities.",
                    "label": 0
                },
                {
                    "sent": "So basically some triggers that trigger huge events so that cell can respond for a small trigger panic attack, the cell can activate the whole set of defense functions or or shutdown mode.",
                    "label": 0
                },
                {
                    "sent": "Some activities launch the other activities, so this is the question, what are these major regulating?",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Effect.",
                    "label": 0
                },
                {
                    "sent": "In this machinery there will be.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's nice to draw big balls but but there will be.",
                    "label": 0
                },
                {
                    "sent": "This will be, for example, compressing over 85 so close to 100 different proteins are needed in order to have the full complex functional in the first place.",
                    "label": 0
                },
                {
                    "sent": "And each of these entities actually encoded in some other place of the genome as a as a gene encoding for that protein polypeptide.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK. Just a little bit of how much do we know about all these regulation activities?",
                    "label": 0
                },
                {
                    "sent": "So what I told so far there are these transcription factor interacting with the DNA and M RNA is being produced.",
                    "label": 0
                },
                {
                    "sent": "There are also some other interesting features which have been discovered not too late to go.",
                    "label": 0
                },
                {
                    "sent": "Actually the short micro RNA's who has never heard of the micro RNA before.",
                    "label": 0
                },
                {
                    "sent": "All the rest have heard.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But these so these are really discovered first in 9315.",
                    "label": 0
                },
                {
                    "sent": "Years ago, less than 15 years ago, but 2001.",
                    "label": 0
                },
                {
                    "sent": "They were given names and the name Micron in the 1st Place and Science published the set of articles.",
                    "label": 0
                },
                {
                    "sent": "Basically that was a molecule of the year.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What does this micro RNA do is interesting.",
                    "label": 0
                },
                {
                    "sent": "It's itself is encoded in the DNA.",
                    "label": 0
                },
                {
                    "sent": "When you make the RNA that doesn't get produced in the protein, but it stays as RNA.",
                    "label": 0
                },
                {
                    "sent": "But out of these actually 1/2 is taken very short RNA sequence is, but it's functional.",
                    "label": 0
                },
                {
                    "sent": "And what this very short RNA sequence can do, is it combined the other M RNA's.",
                    "label": 0
                },
                {
                    "sent": "This is a picture of them are never the same sequence.",
                    "label": 0
                },
                {
                    "sent": "RNA sequence can bind to 7 different places and you can see how how precise or flexible this interaction is really.",
                    "label": 0
                },
                {
                    "sent": "So predominantly these M RNA micro RNA's affect the translation rate so that you have them RNA.",
                    "label": 0
                },
                {
                    "sent": "But if there are micronase present that are attached to that M RNA, then the translation rates usually is much lower.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is another set of genes that can regulate the other genes, but also the question remains, how are these genes being regulated that nobody knows about about that much anything?",
                    "label": 0
                },
                {
                    "sent": "So these micro RNA genes are basically there.",
                    "label": 0
                },
                {
                    "sent": "As.",
                    "label": 0
                },
                {
                    "sent": "Again, exported on these in these short short RNAs are produced at Inter.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With other molecules.",
                    "label": 0
                },
                {
                    "sent": "So in the beginning there were very few actual knowledge of the micro Renee and actual regulation of this type.",
                    "label": 0
                },
                {
                    "sent": "So people had to predict all of these and there are databases which methods that have been predicting these target sites for a given microarray micro RNA to predict.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Target sites.",
                    "label": 0
                },
                {
                    "sent": "And this is 1 example where we had to look at these sites.",
                    "label": 0
                },
                {
                    "sent": "So basically you can see how much how much flexibility there is potentially in the binding of that micro RNA onto the onto the M RNA's.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So given all these DNA sequences RNA.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so we would really like to find some some of the signals.",
                    "label": 0
                },
                {
                    "sent": "Why exactly the right place something is encoded and what are these features in the DNA?",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for pattern discovery, the biological applications are really DNA, RNA and protein sequences, and in all of these when we when we treat them as linear structures this strings.",
                    "label": 0
                },
                {
                    "sent": "Then we want to find some features.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In most of the path we look at.",
                    "label": 0
                },
                {
                    "sent": "At the transcription factors interacting with the DNA, so looking at DNA motifs that would be used as signals for transcription factors.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So how can we?",
                    "label": 0
                },
                {
                    "sent": "Really, there is a huge variety of transcription factors in yeast.",
                    "label": 0
                },
                {
                    "sent": "There can be several 100 in human.",
                    "label": 0
                },
                {
                    "sent": "It can be thousands.",
                    "label": 0
                },
                {
                    "sent": "Then how can we find for each of them the possible targets?",
                    "label": 1
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In past Herbologist have produced some some wet lab very hard to do experiments and they have produced some data that says that transcription factor binds in here.",
                    "label": 1
                },
                {
                    "sent": "We always kind of do exactly that.",
                    "label": 0
                },
                {
                    "sent": "We may have to look at the indirect evidence indirectly.",
                    "label": 1
                },
                {
                    "sent": "We know that all the genes are activated at the same time, so let's hope that they are activated by the same mechanism.",
                    "label": 0
                },
                {
                    "sent": "So let's hope that most of these genes have something in common in their DNA.",
                    "label": 0
                },
                {
                    "sent": "And there are some new techniques that will allow.",
                    "label": 1
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Show show.",
                    "label": 0
                },
                {
                    "sent": "Let's assume that the wet lab bench biologist or PhD student has produced this set of examples.",
                    "label": 0
                },
                {
                    "sent": "I know that this is going to be the exact place where the sum binding has a curd.",
                    "label": 0
                },
                {
                    "sent": "These six 6 characters long examples.",
                    "label": 0
                },
                {
                    "sent": "So how do you generalize from that?",
                    "label": 0
                },
                {
                    "sent": "It's obvious that you can count the letters of a Sgt in each position.",
                    "label": 0
                },
                {
                    "sent": "In first position you have six days to tease.",
                    "label": 0
                },
                {
                    "sent": "And so forth.",
                    "label": 0
                },
                {
                    "sent": "So you get the count matrix when you want to visualize what this represents.",
                    "label": 0
                },
                {
                    "sent": "You can count information content in every position, for example in the conserved Jeep.",
                    "label": 0
                },
                {
                    "sent": "In here we know that.",
                    "label": 0
                },
                {
                    "sent": "Phone if this position is always a G, then that position does not carry any additional information.",
                    "label": 0
                },
                {
                    "sent": "We already knew that it's going to be G, so this is going to be 2 minus information content.",
                    "label": 0
                },
                {
                    "sent": "Visualized big letter.",
                    "label": 0
                },
                {
                    "sent": "So you can read out sort of consensus sequence.",
                    "label": 0
                },
                {
                    "sent": "And what people usually do is that apply very simple formula.",
                    "label": 0
                },
                {
                    "sent": "Look at the probabilities of each letter.",
                    "label": 0
                },
                {
                    "sent": "The observed probabilities over the expected probability in the perfect random sequence.",
                    "label": 0
                },
                {
                    "sent": "The expected would be .25 for every letter in real applications India in years, for example A&T are both 3 and GC2 frequency and then you get this kind of matrix.",
                    "label": 0
                },
                {
                    "sent": "So from this count matrix you get similar position weight matrix and then you can given that you can give.",
                    "label": 0
                },
                {
                    "sent": "Any any sequence you can give a score, So what would be the best score achieved by these metrics?",
                    "label": 0
                },
                {
                    "sent": "Is that if you feel that if you ask to be scored a CG?",
                    "label": 0
                },
                {
                    "sent": "T. GG ACG.",
                    "label": 0
                },
                {
                    "sent": "The GG it's I don't even know if this is present in this set.",
                    "label": 0
                },
                {
                    "sent": "I wasn't looking at that probably is not even present in that set, so it's sort of generalizes makes.",
                    "label": 0
                },
                {
                    "sent": "The generalization of these examples, and this seems to work really very very well.",
                    "label": 0
                },
                {
                    "sent": "We can give every sequence, every position in the DNA the score if the score is high.",
                    "label": 0
                },
                {
                    "sent": "The position based metrics has the match.",
                    "label": 0
                },
                {
                    "sent": "If the score is low, then we say it's a no match.",
                    "label": 0
                },
                {
                    "sent": "And of course, in some positions we don't really know which letter is used.",
                    "label": 0
                },
                {
                    "sent": "In here in here, the situation is the same, but because I use some prior knowledge that is in general should be more frequent.",
                    "label": 0
                },
                {
                    "sent": "So that's G. That's why G gets rewarded more in this position.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Very simple formula producing very powerful concept.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Once you have these motives, of course you would like to do the motive matching.",
                    "label": 0
                },
                {
                    "sent": "Ask where these entities occur in the DNA.",
                    "label": 0
                },
                {
                    "sent": "I will be coming back to that a bit later.",
                    "label": 1
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What we want to do is motive discovery.",
                    "label": 0
                },
                {
                    "sent": "We are not in the beginning.",
                    "label": 0
                },
                {
                    "sent": "Given these examples, we're given sequences and bio.",
                    "label": 0
                },
                {
                    "sent": "She says that these sequences may share some common pattern, so we have to find something which is relatively common in this set of input sequences.",
                    "label": 1
                },
                {
                    "sent": "Or of course, it's politicians don't say that we have to figure it out.",
                    "label": 0
                },
                {
                    "sent": "Which which genes may which sequences measure the pattern?",
                    "label": 0
                },
                {
                    "sent": "I will.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Back to this.",
                    "label": 0
                },
                {
                    "sent": "So why can we say that this some number of genes is going to have some common pattern?",
                    "label": 0
                },
                {
                    "sent": "Because maybe the genes are known to have some common biological role.",
                    "label": 1
                },
                {
                    "sent": "Or we can measure by microarrays the activities of this cheese.",
                    "label": 0
                },
                {
                    "sent": "We can say if the genes are switched on and off at the same time in coherent manner, then hopefully they have some common signals that allowed to do this kind of switching.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So microarrays.",
                    "label": 0
                },
                {
                    "sent": "Measure gene expression activity so it's really something that we would like to understand how genes are expressed.",
                    "label": 1
                },
                {
                    "sent": "There are many different variants now.",
                    "label": 0
                },
                {
                    "sent": "We can also look at different things like where we can actually make lab experiments to figure out where the transcription factor has found in the in the cell in vitro.",
                    "label": 0
                },
                {
                    "sent": "So these would be this chromatin immunoprecipitation on the microarray.",
                    "label": 0
                },
                {
                    "sent": "So chromatin, immuno process chip chip experiments from precipitation on the micro arrays.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, how does the microwave work?",
                    "label": 0
                },
                {
                    "sent": "We have the cells and let's say we want to figure out how many M RNA's are produced or in this in this cell present at the given time.",
                    "label": 1
                },
                {
                    "sent": "So we have first policies can extract all the M RNA's get rid of everything else.",
                    "label": 1
                },
                {
                    "sent": "OK, we have the M RNA's in the in the tube.",
                    "label": 0
                },
                {
                    "sent": "But next how can we tell which genes this M RNA's correspond to?",
                    "label": 0
                },
                {
                    "sent": "So this is really what microarrays allowed to do.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's do one trick in here.",
                    "label": 0
                },
                {
                    "sent": "Let's add some.",
                    "label": 0
                },
                {
                    "sent": "Reagent color the.",
                    "label": 0
                },
                {
                    "sent": "Come on.",
                    "label": 0
                },
                {
                    "sent": "First, basically the we can add some color which will later light on the name.",
                    "label": 0
                },
                {
                    "sent": "No, no, this red color in here then.",
                    "label": 0
                },
                {
                    "sent": "Give the name now.",
                    "label": 0
                },
                {
                    "sent": "For basically the 1st for unit, the color to the.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are amazing.",
                    "label": 0
                },
                {
                    "sent": "OK, so once we have that.",
                    "label": 0
                },
                {
                    "sent": "What the micro arrays are their measurement devices?",
                    "label": 0
                },
                {
                    "sent": "So we can take this content of M RNA's and measure every G. So for every gene what we what is being produced in the microwave in the beginning in the production is the single stranded DNA that is a that would be complementary to that M RNA on the previous slide.",
                    "label": 0
                },
                {
                    "sent": "So we have this measurement device and now we take the previous content from the previous.",
                    "label": 1
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hybridize over and what will happen is that these entities will find their perfect partners in this measurement device so they will hybridize fixed together to the molecules that are present in the on the microarray.",
                    "label": 0
                },
                {
                    "sent": "And we have these labels.",
                    "label": 0
                },
                {
                    "sent": "Color color dyes.",
                    "label": 0
                },
                {
                    "sent": "When we when you scan then this picture with the laser to the scanning or photo basically.",
                    "label": 0
                },
                {
                    "sent": "Then you can read out which spots are lighting up.",
                    "label": 0
                },
                {
                    "sent": "So for this gene there have been many M RNA is present in the in the in the cellular content so we can say that this gene is being active now.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The same thing can be with the two colors.",
                    "label": 0
                },
                {
                    "sent": "You can mix red and green.",
                    "label": 0
                },
                {
                    "sent": "DICE and look at these.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which is so this would be like five years ago, I think already.",
                    "label": 0
                },
                {
                    "sent": "Institute produced microarrays with all physical human genes present.",
                    "label": 0
                },
                {
                    "sent": "So each gene would be sorry.",
                    "label": 0
                },
                {
                    "sent": "Each spot in here would correspond to 1 gene of the genome and you can read out basically by image analysis.",
                    "label": 0
                },
                {
                    "sent": "The features tell this is overlay of this red and green.",
                    "label": 0
                },
                {
                    "sent": "So basically when it's yellow then it's almost the equal equality's.",
                    "label": 0
                },
                {
                    "sent": "If it's red then only one.",
                    "label": 0
                },
                {
                    "sent": "This present is in only one sample.",
                    "label": 0
                },
                {
                    "sent": "When it's green, it's present in the other one.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Affymetrix Illumina, some of the commercial different types of these measurement devices can use single channel dual channel.",
                    "label": 0
                },
                {
                    "sent": "There are different variants, but basically the idea is the same.",
                    "label": 0
                },
                {
                    "sent": "You hybridize your samples and you read out the Photo by photo, which spots are active.",
                    "label": 0
                },
                {
                    "sent": "Which are not so these can contain millions of features, millions of different spots, and Affymetrix produces these chips using the old generation Silicon chip manufacturing techniques, masking out the thing and adding the new class.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Eyes etc.",
                    "label": 0
                },
                {
                    "sent": "OK, when you do.",
                    "label": 0
                },
                {
                    "sent": "Just reading out one measurement is not enough.",
                    "label": 0
                },
                {
                    "sent": "You want to have some experiment.",
                    "label": 0
                },
                {
                    "sent": "You want to look at what is going on at different points in time, so you produce many of these images from each image.",
                    "label": 0
                },
                {
                    "sent": "We know that we can extract all these features, but what we would like to have and what we will analyze later is that for each of these biological samples in this condition, this gene will have this activity.",
                    "label": 0
                },
                {
                    "sent": "So this is this gene expression matrix for for every gene.",
                    "label": 1
                },
                {
                    "sent": "And every year, in every sample you will have one measurement, which roughly tells some sort of level of activity of that gene in that sample.",
                    "label": 0
                },
                {
                    "sent": "So basically we have the numerical matrix.",
                    "label": 0
                },
                {
                    "sent": "There may be some, obviously this noisy.",
                    "label": 0
                },
                {
                    "sent": "It's going to have errors, mistakes, missing values, noise, but we have this numerical table and now we want to interpret that.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So these are the 10 year old first works, making the bike race first.",
                    "label": 0
                },
                {
                    "sent": "I'm looking at the micro race by exploratory techniques clustering.",
                    "label": 0
                },
                {
                    "sent": "Hierarchical clustering in here and visualization.",
                    "label": 0
                },
                {
                    "sent": "So instead of looking at these.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Numbers.",
                    "label": 0
                },
                {
                    "sent": "Who can understand what's in the Big Excel table?",
                    "label": 0
                },
                {
                    "sent": "You can't really read out all the numbers.",
                    "label": 0
                },
                {
                    "sent": "Let's add the color on top of that cell to color.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here you can read out which values are positive values or negative easily, unless you are in this style tone and color blindness.",
                    "label": 0
                },
                {
                    "sent": "Sorry about that so, but you can use different colors.",
                    "label": 0
                },
                {
                    "sent": "This one is not clustering, but this one is taking the cell cycle experiment and Fourier transform by prior transform looking which.",
                    "label": 0
                },
                {
                    "sent": "Which genes have cyclic behavior and then just sorting based on this activity?",
                    "label": 0
                },
                {
                    "sent": "And these are very, very famous, groundbreaking works.",
                    "label": 0
                },
                {
                    "sent": "The techniques of this are being used routinely.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also now.",
                    "label": 0
                },
                {
                    "sent": "Obviously you can do cancer classification.",
                    "label": 0
                },
                {
                    "sent": "Many of you may work on these.",
                    "label": 0
                },
                {
                    "sent": "You can look at the different cancer samples, different patients and look which genes are able to classify.",
                    "label": 0
                },
                {
                    "sent": "These two cancer crosses from each other.",
                    "label": 0
                },
                {
                    "sent": "You can predict new cancer subtypes etc.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is example.",
                    "label": 0
                },
                {
                    "sent": "There are different gene knockouts now that it's samples are rose in here.",
                    "label": 0
                },
                {
                    "sent": "So you can observe let's Knockout 1 gene and let's observe what's happening.",
                    "label": 0
                },
                {
                    "sent": "So in here the red line shows that when you two knockouts knocking out one or the other actually produced very similar effect.",
                    "label": 0
                },
                {
                    "sent": "Both of them produce the effect that many genes will be upregulated after that.",
                    "label": 0
                },
                {
                    "sent": "So they're both are needed to keep the gene expression down for these.",
                    "label": 0
                },
                {
                    "sent": "For all these jeans in here.",
                    "label": 0
                },
                {
                    "sent": "So this is already.",
                    "label": 0
                },
                {
                    "sent": "You can see that this is the basis of building them some networks there is going to be some relationship from these two genes to all these genes, which are normally suppressed by these two.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, now we have the micro arrays.",
                    "label": 0
                },
                {
                    "sent": "We know that we can measure some some profiles.",
                    "label": 0
                },
                {
                    "sent": "We can say that let's take all the genes which react in the similar manner.",
                    "label": 0
                },
                {
                    "sent": "Let's take all the changes that are being shut down or activated at one at one time and then what we really want to look at is in the DNA sequences of these respective genes to see if there are features in the DNA.",
                    "label": 0
                },
                {
                    "sent": "That are somehow enriched for this set of genes, and that was something that we did, 1998.",
                    "label": 0
                },
                {
                    "sent": "A long time ago now and this is one of the very well.",
                    "label": 0
                },
                {
                    "sent": "I don't know if it's still growing, but it was really huge topic in between 2000 and after that beyond so many many people have been working on this this type of.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "In the simplest form, you can just ask what is being enriched in this chain cluster in the manner that this is more frequent in the cluster than in the background and in the background.",
                    "label": 0
                },
                {
                    "sent": "Now we can take the whole genomes.",
                    "label": 0
                },
                {
                    "sent": "We can really look is something really being enriched in that in this data set and we can add very easily some enrichment scores or P values to each individual motive.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will come back to this motif finding soon.",
                    "label": 0
                },
                {
                    "sent": "Let's think of this microarray as a measurement device for some other type of data.",
                    "label": 0
                },
                {
                    "sent": "We know that in the DNA somewhere.",
                    "label": 0
                },
                {
                    "sent": "Must this binding occur so when transcription factor is bound to the DNA?",
                    "label": 0
                },
                {
                    "sent": "It may look something like this.",
                    "label": 0
                },
                {
                    "sent": "So what you can do then is that.",
                    "label": 0
                },
                {
                    "sent": "You can add some random enzyme.",
                    "label": 0
                },
                {
                    "sent": "Basically cut again science, which would cut this DNA randomly chop into pieces.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Something like this?",
                    "label": 0
                },
                {
                    "sent": "Some will have no translation factor bound to it.",
                    "label": 0
                },
                {
                    "sent": "Some will have binding still there.",
                    "label": 0
                },
                {
                    "sent": "Now, if you are interested in this this green guy.",
                    "label": 0
                },
                {
                    "sent": "How can we know where this green transcription factor is found in the whole DNA?",
                    "label": 0
                },
                {
                    "sent": "You need something to fish out.",
                    "label": 0
                },
                {
                    "sent": "These take out these DNA with the green factor.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is done by this antibody.",
                    "label": 0
                },
                {
                    "sent": "So for the protein you have the antibody, you pull that out and now you are left with all these cases of that green guy has been bound to.",
                    "label": 0
                },
                {
                    "sent": "When you get rid now of this green guy, you have the same question, but which are these DNA pieces in here where that binding occurs and that's.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sure you can.",
                    "label": 0
                },
                {
                    "sent": "You can actually use immediately the same micro array format.",
                    "label": 0
                },
                {
                    "sent": "To do this kind of readout.",
                    "label": 0
                },
                {
                    "sent": "Or nowadays people also start to sequence these pieces of DNA because sequencing technologies are becoming cheaper and cheaper.",
                    "label": 0
                },
                {
                    "sent": "More and more high throughput.",
                    "label": 0
                },
                {
                    "sent": "So we will have lots of lots of sequencing to happening in next years.",
                    "label": 0
                },
                {
                    "sent": "So this is sort of like direct experiment, but of course it doesn't reveal you the whole that all the truth it gives you some strong binding, but it's still not the whole truth.",
                    "label": 0
                },
                {
                    "sent": "And even in the case that you know that this is the wrong region, maybe 500 base pairs where something's bound to you still don't know exactly where that binding occurs, so you still have the problem of.",
                    "label": 0
                },
                {
                    "sent": "OK, I have these examples of long sequences.",
                    "label": 0
                },
                {
                    "sent": "Where exactly this short range signal was present on the?",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sequences I it would be of course very wrong to say that biologists would be interested only finding out these where this finding more curves.",
                    "label": 0
                },
                {
                    "sent": "So biologists, when you do the experiment, they have produced some micro datasets, they do the clustering, some T test looking at the genes which are being enriched for one cancer type versus the other one, you have a G list to work with.",
                    "label": 0
                },
                {
                    "sent": "So first question is actually not what is regulating this cheat list, but what this cheat list is doing in the first place.",
                    "label": 0
                },
                {
                    "sent": "Just to characterize the cheat list to understand what's going on with these jeans.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We can say that the G list is really as a set or a ranked list, because depending on the technology, T test can give you the rank list or some clustering.",
                    "label": 0
                },
                {
                    "sent": "Partitioning based clustering would give you the set of genes.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Since we had very strong, very nice presentations about the clustering, I wanted to show some very simple way how we produce actually user interface which biologists can be really working with.",
                    "label": 0
                },
                {
                    "sent": "To look at the data and clustering.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                },
                {
                    "sent": "You can look to see that this is hierarchical clustering in here, but in fact what happens before this hierarchical clustering is that we apply K means on the whole data on the left, the K was chosen.",
                    "label": 0
                },
                {
                    "sent": "200 and on the right it was 50.",
                    "label": 0
                },
                {
                    "sent": "So basically first can do say 50K means clusters and then you take these clusters.",
                    "label": 0
                },
                {
                    "sent": "You don't want to because K means doesn't give you any ordering between the clusters, we just had the ordering by hierarchical clustering.",
                    "label": 0
                },
                {
                    "sent": "So this is representing the hierarchical clustering of 50 clusters.",
                    "label": 0
                },
                {
                    "sent": "The first column is that cluster number and the 2nd is the size.",
                    "label": 0
                },
                {
                    "sent": "So for cluster is this line and it has 70 genes.",
                    "label": 0
                },
                {
                    "sent": "In that and you can see that there are.",
                    "label": 0
                },
                {
                    "sent": "Some clusters which look quite similar to each other, so apologies can have the interface look at individual clusters, or they can combine all of these together.",
                    "label": 0
                },
                {
                    "sent": "So this is exactly the same with 200 clusters and you can see that most of the features, yeah?",
                    "label": 0
                },
                {
                    "sent": "What are your individual investor into you saved up for what exactly?",
                    "label": 0
                },
                {
                    "sent": "We usually this to.",
                    "label": 0
                },
                {
                    "sent": "Each color is really working for us.",
                    "label": 0
                },
                {
                    "sent": "OK so this is.",
                    "label": 0
                },
                {
                    "sent": "This is this numerical table from Excel, right?",
                    "label": 0
                },
                {
                    "sent": "You have you have 10 time points, dimensionality 10.",
                    "label": 0
                },
                {
                    "sent": "And in this case I think about 20,000 genes.",
                    "label": 0
                },
                {
                    "sent": "First you take this 20,000 objects chains of length 10 vectors and you cluster these by K means.",
                    "label": 0
                },
                {
                    "sent": "Into 50 clusters.",
                    "label": 0
                },
                {
                    "sent": "So you have 5050 groups, 50 clusters.",
                    "label": 0
                },
                {
                    "sent": "And for each of these 50 clusters, of course you have cheese that belong to that cluster, and you also have the mean in the center of that cluster.",
                    "label": 0
                },
                {
                    "sent": "So basically what is being visualized in here is is by color code, but the typical center, the typical example in that cluster or the center in that cluster would look like.",
                    "label": 0
                },
                {
                    "sent": "In this 10 dimensional space.",
                    "label": 0
                },
                {
                    "sent": "So basically the.",
                    "label": 0
                },
                {
                    "sent": "For example, in here you can see the activation is in these they 5, six and seven are being active when you look at this cluster.",
                    "label": 0
                },
                {
                    "sent": "Reading here is positive, green is negative, so so being active or non active.",
                    "label": 0
                },
                {
                    "sent": "Yes, we saw as you cited the person to talk about clustering.",
                    "label": 0
                },
                {
                    "sent": "So did you do a stability analysis?",
                    "label": 0
                },
                {
                    "sent": "You try to check with.",
                    "label": 0
                },
                {
                    "sent": "There's not some OK means or how stated that so.",
                    "label": 0
                },
                {
                    "sent": "So we.",
                    "label": 0
                },
                {
                    "sent": "Another collaborator, yes, TK means stability analysis.",
                    "label": 0
                },
                {
                    "sent": "Looking at many different runs and looking which cheese tend to stick together and that result cause producing 115 clusters of size more than one.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so you are not interested in singletons anymore, but basically the stability kind of looking at this would produce this 115 clusters.",
                    "label": 0
                },
                {
                    "sent": "OK, you can show up and show them like this is the biggest cluster having 200 genes.",
                    "label": 0
                },
                {
                    "sent": "50 genes 3015.",
                    "label": 0
                },
                {
                    "sent": "Six at very rapidly growing down.",
                    "label": 0
                },
                {
                    "sent": "And then you have lots of clusters with the 333GS.",
                    "label": 0
                },
                {
                    "sent": "Two genes in this 115.",
                    "label": 0
                },
                {
                    "sent": "And if you look only at this table classified GS, then you basically getting rid of something which is in between the clusters, which can be one or the other.",
                    "label": 0
                },
                {
                    "sent": "So in here because this is a first illustration tool you really visualize versus what is in the data.",
                    "label": 0
                },
                {
                    "sent": "It is unsupervised kind of thing.",
                    "label": 0
                },
                {
                    "sent": "But I'm claiming in here if you do this sort of many enough clusters you do more dense clustering than what is the true number, whatever that means, yeah, then.",
                    "label": 0
                },
                {
                    "sent": "You can still get the general picture of very high dimensional space.",
                    "label": 0
                },
                {
                    "sent": "It's a 10 dimensional space visualized in very nice in a very compact manner actually.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "I have a.",
                    "label": 0
                },
                {
                    "sent": "Different OK, this is a time series of showing how embroid party of the mouse would develop from day 012, basically growing starting to develop different issues starting to.",
                    "label": 0
                },
                {
                    "sent": "Yeah, basically the first 10 days of the development.",
                    "label": 0
                },
                {
                    "sent": "So you can see which genes are active in the beginning of that development, which are more active after they 45.",
                    "label": 0
                },
                {
                    "sent": "So basically you have biological background is like that.",
                    "label": 0
                },
                {
                    "sent": "Now all this is your first question would which would be.",
                    "label": 0
                },
                {
                    "sent": "I'm very interested in jeans which are turned on at specific moment, say at day three.",
                    "label": 0
                },
                {
                    "sent": "What are the main things that happen in the data?",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Once we have produced this first look at the data, we came out the update.",
                    "label": 0
                },
                {
                    "sent": "Very simple question OK, but balances are really interested in jeans which are being activated at say 456 and then the activated OK we can produce clustering and say that go and look for him for that cluster yourself or we can provide this template and say that everything that resembles this template.",
                    "label": 0
                },
                {
                    "sent": "000111000 everything that is correlated to that template, you can provide as the answer right?",
                    "label": 0
                },
                {
                    "sent": "You can look at the upregulation.",
                    "label": 0
                },
                {
                    "sent": "You can look at the downregulation.",
                    "label": 0
                },
                {
                    "sent": "And you can look at which which is represented in this manner.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When you do this.",
                    "label": 0
                },
                {
                    "sent": "For all the possible templates.",
                    "label": 0
                },
                {
                    "sent": "You can have a look at at now very detailed sort of, at which stage something is being activated or deactivated.",
                    "label": 0
                },
                {
                    "sent": "So the up regulation that is only staying active for one day.",
                    "label": 0
                },
                {
                    "sent": "These which are staying active for.",
                    "label": 0
                },
                {
                    "sent": "For.",
                    "label": 0
                },
                {
                    "sent": "Start from day to stay up in either one day, two days, three days, four days, and so forth.",
                    "label": 0
                },
                {
                    "sent": "So basically giving different view on the data and the numbers in here in here show how many.",
                    "label": 0
                },
                {
                    "sent": "How many genes are present?",
                    "label": 0
                },
                {
                    "sent": "I don't want to spill water over there.",
                    "label": 0
                },
                {
                    "sent": "Certificates.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So these were sort of like sharp porters and there are more subtle.",
                    "label": 0
                },
                {
                    "sent": "Changes, so these are visualized in here.",
                    "label": 0
                },
                {
                    "sent": "So we have the.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We divided the space into meaningful sort of cluster templates which have the interpretation.",
                    "label": 0
                },
                {
                    "sent": "It does not mean.",
                    "label": 0
                },
                {
                    "sent": "What is normal graphic likenesses?",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Babes, sorry.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That means that that to this template, which would be.",
                    "label": 0
                },
                {
                    "sent": "At Day 3, going down and staying down for two days and we're basically a deep.",
                    "label": 0
                },
                {
                    "sent": "There was nothing at correlation more than .8, so of course you can choose the correlation in here.",
                    "label": 0
                },
                {
                    "sent": "In this case, how many how many correlated genes you want to have, and then you have the question do you want to vote annoyed?",
                    "label": 0
                },
                {
                    "sent": "Diagram G belongs only to one cluster or chain can both be in both kind of easy to partitioning, or is it?",
                    "label": 0
                },
                {
                    "sent": "More general and the user interface, then they can actually look and combine these things.",
                    "label": 0
                },
                {
                    "sent": "OK, I don't care if it's stays down deactivated for one day longer.",
                    "label": 0
                },
                {
                    "sent": "I can combine different things and get this chain lists.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So these are some comparisons with printouts from this from the web.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From the website.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "Clustering I was I was in this example where the number cluster #4 at 78 jeans.",
                    "label": 0
                },
                {
                    "sent": "You can click on this row or you could merge the clusters.",
                    "label": 0
                },
                {
                    "sent": "OK now you have 78 cheese So what?",
                    "label": 0
                },
                {
                    "sent": "What do the 78 G is really real?",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You do OK. First you can present what these genes are.",
                    "label": 0
                },
                {
                    "sent": "The list of genes.",
                    "label": 0
                },
                {
                    "sent": "But their names are what their function is.",
                    "label": 0
                },
                {
                    "sent": "Biologists probably would be able to recognize at least couple of these team names.",
                    "label": 0
                },
                {
                    "sent": "Yeah, they would say that.",
                    "label": 0
                },
                {
                    "sent": "Oh yeah, I know this one.",
                    "label": 0
                },
                {
                    "sent": "I know this one interesting.",
                    "label": 0
                },
                {
                    "sent": "OK, So what next?",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We want to find some.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A common feature or theme.",
                    "label": 0
                },
                {
                    "sent": "What this cluster tells us.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we want to somehow characterize this cluster.",
                    "label": 0
                },
                {
                    "sent": "By some biological meaning.",
                    "label": 0
                },
                {
                    "sent": "And as a meaning we can use, we can look at every page in the respective in their respective gene databases.",
                    "label": 0
                },
                {
                    "sent": "We can we could do some text mining to observe some frequent words.",
                    "label": 0
                },
                {
                    "sent": "We can use the gene ontology classified.",
                    "label": 1
                },
                {
                    "sent": "So basically the very standardized way to classify gene functions, molecular function, biological process function is something very specific like enzymatic activity.",
                    "label": 0
                },
                {
                    "sent": "And process is a more general like like like energy metabolism or cell cycle and and they speak processes or they also characterized the cellular content localization basically is it.",
                    "label": 0
                },
                {
                    "sent": "Is it a membrane bound protein?",
                    "label": 0
                },
                {
                    "sent": "Is it in the new closes it in the cytoplasm which complex it belongs to?",
                    "label": 0
                },
                {
                    "sent": "These are like.",
                    "label": 0
                },
                {
                    "sent": "I would like to say orthogonal ways to characterize genes, although of course they're not entirely orthogonal orthogonal, because there are some constraints in that space.",
                    "label": 0
                },
                {
                    "sent": "But anyway we can use this genealogy.",
                    "label": 0
                },
                {
                    "sent": "We can look at the previously known pathway descriptions.",
                    "label": 1
                },
                {
                    "sent": "We can look at the shared regulatory motifs or micro RNA target sites, you name it.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "The way how we would like to characterize things is from generic to more specific.",
                    "label": 0
                },
                {
                    "sent": "So this is example of go.",
                    "label": 0
                },
                {
                    "sent": "DNA metabolism is different, more specific, more and more specific.",
                    "label": 0
                },
                {
                    "sent": "Activities in the process is under this class, and it's a.",
                    "label": 1
                },
                {
                    "sent": "It's a directed acyclic graph.",
                    "label": 0
                },
                {
                    "sent": "So basically one node in here can have multiple different parents, so it is a relationship.",
                    "label": 0
                },
                {
                    "sent": "And of course, for different organisms the genes have been mapped by previous knowledge into this class.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is and we can use that so we have a question that we have some previously known classes.",
                    "label": 0
                },
                {
                    "sent": "Or function one that within that it holds function 2, function 3.",
                    "label": 0
                },
                {
                    "sent": "There will be overlaps.",
                    "label": 0
                },
                {
                    "sent": "Between these classes and so forth.",
                    "label": 0
                },
                {
                    "sent": "So these are our previously known knowledge, previously known associated gene lists.",
                    "label": 1
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And now we have the query possible queries query one or query two and we would like to characterize what is being represented by that query.",
                    "label": 0
                },
                {
                    "sent": "So in the query one you can see that oh it's so nicely with the function one, so basically.",
                    "label": 0
                },
                {
                    "sent": "The most descriptive pattern would be to say that query one player has genes that belong to function one.",
                    "label": 0
                },
                {
                    "sent": "And query two can hit several functions.",
                    "label": 0
                },
                {
                    "sent": "Maybe the overlap is random, maybe not.",
                    "label": 0
                },
                {
                    "sent": "We don't know that at this stage, right?",
                    "label": 0
                },
                {
                    "sent": "So, but we want to make.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These kinds of queries.",
                    "label": 0
                },
                {
                    "sent": "And this is again something that that is really needed in biology and many tools are around.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we published our version which for this gene list in here tells which classes are statistically significantly enriched and also by color coding.",
                    "label": 0
                },
                {
                    "sent": "We show exactly that this gene was previously known to belong to this power.",
                    "label": 0
                },
                {
                    "sent": "Synthesis of steroids pathway.",
                    "label": 0
                },
                {
                    "sent": "So out of the query.",
                    "label": 0
                },
                {
                    "sent": "In here you can try it out, but basically 99G in South of 26 in here hit this pathway that normally has only 16 Members, so 9 out of 16 were present in the query, so it's significant overlap.",
                    "label": 0
                },
                {
                    "sent": "When you think that there are overall is 20,000 genes characterized in this man.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it produces this P values categories looking at different different data points.",
                    "label": 0
                },
                {
                    "sent": "The color coding shows different evidence codes which.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just jumped over.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So basically, the knowledge that something belongs to a class is not always exactly the same knowledge.",
                    "label": 0
                },
                {
                    "sent": "We have better or weaker assumptions about that.",
                    "label": 0
                },
                {
                    "sent": "So these are.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like Direct Direct says, direct biological experiments making sure that this function is true or some some indirect evidence carrying this function prediction over by homology based and so forth.",
                    "label": 0
                },
                {
                    "sent": "And it's running means.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you think of this as a set query, you have a query or just a set, then that's.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "First, telling before, but we can also look at this as a ranked list query, so the rank list would be telling that.",
                    "label": 0
                },
                {
                    "sent": "First 26 genes, then nine out of these belong to this pathway and to fetch 26.",
                    "label": 0
                },
                {
                    "sent": "Chains out of 2020 thousand so that we have 9 out of 16 present in this in this would give us P value 10 to minus 21 something it's significant.",
                    "label": 0
                },
                {
                    "sent": "But you can see that this is a ranked list.",
                    "label": 0
                },
                {
                    "sent": "So basically we could draw the line almost in here or there.",
                    "label": 0
                },
                {
                    "sent": "And of course we're looking for the locally the the optimum cut point.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this P value is very simple.",
                    "label": 0
                },
                {
                    "sent": "Basically we can do this combinatorial thing if we fetch out so many things without replacement, what is the probability to observe as many hits to the pathway?",
                    "label": 0
                },
                {
                    "sent": "It's a hypergeometric probability and we can look at the tail basically of that probability distribution.",
                    "label": 0
                },
                {
                    "sent": "But there is a multiple testing problem.",
                    "label": 0
                },
                {
                    "sent": "Yes, we have one G1 queryset.",
                    "label": 0
                },
                {
                    "sent": "But what we are comparing against is not one set subset in that in the in the database, but we are comparing against thousands of sets.",
                    "label": 0
                },
                {
                    "sent": "So by random chance, some of these would give us some overlaps anyway and we have to somehow quantify, quantify this multiple testing, take into account that the database has sets of different sizes and the queries can be of different sizes.",
                    "label": 1
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what we've?",
                    "label": 0
                },
                {
                    "sent": "What would be the normal standard procedure would be one ferroni correction is the easiest.",
                    "label": 0
                },
                {
                    "sent": "If you do so many tests, your chances of hitting something are the same number of times higher.",
                    "label": 0
                },
                {
                    "sent": "So point ironic correction in here.",
                    "label": 0
                },
                {
                    "sent": "This is a randomization illustrating randomization experiment.",
                    "label": 0
                },
                {
                    "sent": "The point Veronica correction would be this blue line saying that.",
                    "label": 0
                },
                {
                    "sent": "The significance threshold in here for a query of size 70, the P value would should be 10 to minus.",
                    "label": 0
                },
                {
                    "sent": "Minus five is in here, something like below 10 to minus 5 -- 6.",
                    "label": 0
                },
                {
                    "sent": "So it would say that everything that would be better than that would be called significant.",
                    "label": 0
                },
                {
                    "sent": "Forced discovery rate at 5% level is this line and of course you can see that given this false discovery rate FPR pantalones actually rather strict correction.",
                    "label": 0
                },
                {
                    "sent": "The true line, the true correction from this randomization experiment in here is the observed empirical rate.",
                    "label": 0
                },
                {
                    "sent": "Is this black line?",
                    "label": 0
                },
                {
                    "sent": "So in this case it lies between the FDR line and a point thrown correction line.",
                    "label": 0
                },
                {
                    "sent": "And what we used in the previous examples, of course you can use it upon Peroni or FDR, but what we are using is this Gray line in here which we were able to basically analytically looking at the looking at the whole database structure.",
                    "label": 0
                },
                {
                    "sent": "We know that we have these sets of different sizes and counting these sets looking at the probabilities of the overlaps, we could actually pretty well over overlay.",
                    "label": 0
                },
                {
                    "sent": "That prediction that predicted multiple testing correction with the randomized.",
                    "label": 0
                },
                {
                    "sent": "A test, so basically randomizing the query in total random queries, how often.",
                    "label": 0
                },
                {
                    "sent": "If you allow 5 * 5% of the times to produce something more significant results than where we where, we should put a cut of.",
                    "label": 0
                },
                {
                    "sent": "But of course, sometimes people biologist is not interested only in significant enrichment, but basically any hint about that class would be already useful, so you can sort of very this.",
                    "label": 0
                },
                {
                    "sent": "Level of scrutiny, basically.",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we we will have coffee break at half past, right?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I've been talking now about this biological motivation micro race, some, some clustering, exploratory analysis, and analyzing the gene set enrichment.",
                    "label": 0
                },
                {
                    "sent": "Looking at the function that is concerned for that set of genes.",
                    "label": 0
                },
                {
                    "sent": "Now I would like to slowly move into this motive discovery in the DNA or the sequence data.",
                    "label": 1
                },
                {
                    "sent": "And there will be.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so basically we will have the questions of this terministic and probabilistic.",
                    "label": 1
                },
                {
                    "sent": "Language is to describe the patterns and then how can we really find these motifs in the DNA sequences?",
                    "label": 0
                },
                {
                    "sent": "Do we want to describe a set of genes set of sequences, or do we want to discriminate one set of the sequences from the other set?",
                    "label": 0
                },
                {
                    "sent": "So these are kind of the questions that are important.",
                    "label": 0
                },
                {
                    "sent": "And in the algorithmic part.",
                    "label": 0
                },
                {
                    "sent": "So basically you can say that.",
                    "label": 0
                },
                {
                    "sent": "OK, to find something significant.",
                    "label": 0
                },
                {
                    "sent": "To find some significant motif.",
                    "label": 0
                },
                {
                    "sent": "The easiest would be to use the Oracle.",
                    "label": 0
                },
                {
                    "sent": "Oracle tells us that this is the motif.",
                    "label": 0
                },
                {
                    "sent": "Go and check it on the on your data.",
                    "label": 0
                },
                {
                    "sent": "It has an extremely good P value.",
                    "label": 0
                },
                {
                    "sent": "But we would not somehow need to simulate that Oracle to find the correct representation that gives us the best P value or whatever score we want to achieve.",
                    "label": 0
                }
            ]
        },
        "clip_85": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Explain this.",
                    "label": 0
                }
            ]
        },
        "clip_86": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Picture.",
                    "label": 0
                }
            ]
        },
        "clip_87": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Multiple testing problem in here.",
                    "label": 0
                },
                {
                    "sent": "We can produce these clusters in so many different ways.",
                    "label": 0
                },
                {
                    "sent": "We can cluster too.",
                    "label": 0
                },
                {
                    "sent": "All basically permutations of different sizes of the clusters.",
                    "label": 0
                },
                {
                    "sent": "We can have many clusters, many, many, many data sets to be analyzed.",
                    "label": 0
                },
                {
                    "sent": "So for one data set, I mean that produced the set of sequences and ask is there anything significantly enriched for that set of sequences?",
                    "label": 0
                },
                {
                    "sent": "So first of the first is multiple testing.",
                    "label": 0
                },
                {
                    "sent": "Problem is that because I asked the same question from many different data sets, how significant is this going to be?",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "The second source of multiple testing is.",
                    "label": 0
                },
                {
                    "sent": "That, given all these sequences.",
                    "label": 0
                },
                {
                    "sent": "And this extremely powerful Oracle.",
                    "label": 0
                },
                {
                    "sent": "What was the search space that the Oracle search for?",
                    "label": 0
                },
                {
                    "sent": "How many different patterns there are in the 1st place that can have some sort of enrichment?",
                    "label": 0
                },
                {
                    "sent": "So you have.",
                    "label": 0
                },
                {
                    "sent": "Enumerate all possible patterns.",
                    "label": 0
                },
                {
                    "sent": "You can enumerate all possible configurations of your position, weight matrices and with the position weight matrices.",
                    "label": 0
                },
                {
                    "sent": "Of course it's infinite if you treat this as as really true floating point numbers, yeah.",
                    "label": 0
                },
                {
                    "sent": "This is not the infinite, but it's finite set.",
                    "label": 0
                },
                {
                    "sent": "But still it's basically huge huge number.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Do we have any chance to find something biologically significant?",
                    "label": 0
                },
                {
                    "sent": "Would be the first question.",
                    "label": 0
                }
            ]
        },
        "clip_88": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "This is now.",
                    "label": 0
                },
                {
                    "sent": "Representing randomization experiment.",
                    "label": 0
                },
                {
                    "sent": "Taking 50 / 50,000 times a set of genes set of sequences.",
                    "label": 0
                },
                {
                    "sent": "Just a random set.",
                    "label": 0
                },
                {
                    "sent": "And asking for that random set, would there be some motive which is enriched in that set and just plotting the best P value that can that could be observed from that randomization?",
                    "label": 0
                },
                {
                    "sent": "Based experiment.",
                    "label": 0
                },
                {
                    "sent": "So basically you need to look at only at this this P values in here because it's a random set.",
                    "label": 0
                },
                {
                    "sent": "This doesn't mean make any, but this doesn't mean anything at this moment the X axis, only the Y axis.",
                    "label": 0
                },
                {
                    "sent": "You can see sort of the density that.",
                    "label": 0
                },
                {
                    "sent": "In this 50,000 times repeating the experiment or slightly varying sizes.",
                    "label": 0
                },
                {
                    "sent": "So basically there are a couple of times we hate this 10 to minus 8.",
                    "label": 0
                },
                {
                    "sent": "P value.",
                    "label": 0
                },
                {
                    "sent": "Without correcting it, it's not that would be non corrected P value exactly the same kind of set of P value the set overlapped.",
                    "label": 0
                },
                {
                    "sent": "Kind of thing.",
                    "label": 0
                },
                {
                    "sent": "What is the significance of this overlap motif?",
                    "label": 0
                },
                {
                    "sent": "And the sequence data set.",
                    "label": 0
                }
            ]
        },
        "clip_89": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is what the same experiment was for the real data.",
                    "label": 0
                },
                {
                    "sent": "The 50,000 clusters in this time there were produced from the from the clustering of the data.",
                    "label": 0
                },
                {
                    "sent": "And exactly the same thing, plotting at finding the motives.",
                    "label": 0
                },
                {
                    "sent": "The motif in here is just a substring holige of length 5678.",
                    "label": 0
                },
                {
                    "sent": "Without restricting the length of the motif, and you cannot.",
                    "label": 0
                }
            ]
        },
        "clip_90": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Clearly see that there is something is going on that that clusters were not produced randomly.",
                    "label": 0
                },
                {
                    "sent": "That is very important thing.",
                    "label": 0
                },
                {
                    "sent": "The measurement device the microwave gave us something that was not random.",
                    "label": 0
                },
                {
                    "sent": "So we could say that every all of these motifs below this red line, some of the motifs are exactly the same, just having different P values doesn't matter at this moment, all of them are something which should have some biologically meaningful.",
                    "label": 0
                },
                {
                    "sent": "Reason behind them.",
                    "label": 0
                },
                {
                    "sent": "What is on the X axis now in here is.",
                    "label": 0
                },
                {
                    "sent": "Is some one of the possible?",
                    "label": 0
                },
                {
                    "sent": "Quality criterions for saying how good a cluster is, and this is a silhouette value.",
                    "label": 0
                },
                {
                    "sent": "It wasn't mentioned yesterday, but it would just basically say that.",
                    "label": 0
                },
                {
                    "sent": "Inter cluster distances versus that distances to the next closest cluster?",
                    "label": 0
                },
                {
                    "sent": "How much better the intra within the cluster the distances are?",
                    "label": 1
                },
                {
                    "sent": "How much shorter they are in average than the crossing over to the next closest cluster.",
                    "label": 0
                },
                {
                    "sent": "So basically isolated cluster would have very high positive.",
                    "label": 0
                },
                {
                    "sent": "Select value and in some cases you can have negative values because it seems that on average the objects could be placed also to the next cluster.",
                    "label": 0
                },
                {
                    "sent": "So of course the question was sort of like Buddha better clusters in this micro data space deliver us better signal detection in the motive space.",
                    "label": 0
                },
                {
                    "sent": "Well, you could say that that there is some correlation.",
                    "label": 0
                },
                {
                    "sent": "We really didn't want to even go much further to say that this is significant or the correlation coefficient like that, but there may be something that.",
                    "label": 0
                },
                {
                    "sent": "At least we attempted to look at back then.",
                    "label": 0
                },
                {
                    "sent": "That is a study in 2000 to look at the.",
                    "label": 0
                },
                {
                    "sent": "Correlation between how good the cluster is versus how good motive detected from the.",
                    "label": 0
                },
                {
                    "sent": "Promoter sequences from that cluster where.",
                    "label": 0
                }
            ]
        },
        "clip_91": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_92": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This picture.",
                    "label": 0
                },
                {
                    "sent": "So basically we as a motif.",
                    "label": 0
                },
                {
                    "sent": "In this case, we used substrings of any length in the DNA.",
                    "label": 0
                },
                {
                    "sent": "There is fixed substring.",
                    "label": 0
                },
                {
                    "sent": "It occurs or does not occur is a very precise deterministic thing.",
                    "label": 0
                }
            ]
        },
        "clip_93": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How can we count that?",
                    "label": 0
                },
                {
                    "sent": "So suffix trees is the natural choice.",
                    "label": 0
                },
                {
                    "sent": "Of course, the first choice becausw given.",
                    "label": 0
                },
                {
                    "sent": "The input sequence you can produce in linear time.",
                    "label": 0
                },
                {
                    "sent": "In linear space.",
                    "label": 0
                },
                {
                    "sent": "You can produce the structure that enumerates every possible.",
                    "label": 0
                },
                {
                    "sent": "Substring in this in this structure.",
                    "label": 0
                },
                {
                    "sent": "Basically it represents all these different suffixes from from the first character from the second character position.",
                    "label": 0
                },
                {
                    "sent": "Third, 4th, 5th and just added end of string symbol.",
                    "label": 0
                },
                {
                    "sent": "So basically it takes all of these possible suffixes.",
                    "label": 0
                },
                {
                    "sent": "You have North suffixes of length N, N -- 1 and minus 2.",
                    "label": 0
                },
                {
                    "sent": "But you can put them all in the tree data structure.",
                    "label": 0
                },
                {
                    "sent": "In the linear space you can enumerate everything.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "But what would this note tell you?",
                    "label": 0
                },
                {
                    "sent": "So it will tell that 8080.",
                    "label": 0
                },
                {
                    "sent": "Can be spelled out from the position #2.",
                    "label": 0
                },
                {
                    "sent": "1 two position from two 8080.",
                    "label": 0
                },
                {
                    "sent": "End of string.",
                    "label": 0
                },
                {
                    "sent": "So that's what the data structure tells you.",
                    "label": 0
                },
                {
                    "sent": "Of course, when you look at all the path lengths when you look at all the labelings then you have.",
                    "label": 0
                },
                {
                    "sent": "Path should spell out any length N length N -- N length, N -- 2, etc.",
                    "label": 0
                },
                {
                    "sent": "It's clearly quadratic or the path lengths right?",
                    "label": 0
                },
                {
                    "sent": "How come this suffix trees linear size?",
                    "label": 0
                },
                {
                    "sent": "Anybody knows the answer?",
                    "label": 0
                },
                {
                    "sent": "Who does not know the answer yet?",
                    "label": 0
                },
                {
                    "sent": "Very careful, very careful so.",
                    "label": 0
                },
                {
                    "sent": "How many leaves would this tree have?",
                    "label": 0
                },
                {
                    "sent": "Every different suffix is different from each other.",
                    "label": 0
                },
                {
                    "sent": "It must be because it has different length.",
                    "label": 0
                },
                {
                    "sent": "It has different content.",
                    "label": 0
                },
                {
                    "sent": "So every because we added this$ in here every suffix is different.",
                    "label": 0
                },
                {
                    "sent": "Every path is leaf is different, so we have how many leaves exactly and possible leads 123456.",
                    "label": 0
                },
                {
                    "sent": "That's simple, the problem was.",
                    "label": 0
                },
                {
                    "sent": "Yeah, this is simple and what we have ensured in here is that within the tree above, the leaves every node is a branching node.",
                    "label": 0
                },
                {
                    "sent": "Even, even if it's a binary tree, the simplest 1 one Note 2 leaves we have always.",
                    "label": 0
                },
                {
                    "sent": "And if you require this feature, you can buy inductive proof.",
                    "label": 0
                },
                {
                    "sent": "You can easily prove that that given end leaves there is N -- 1 internal nodes.",
                    "label": 0
                },
                {
                    "sent": "So basically every every leaf, every internal node is branching.",
                    "label": 0
                },
                {
                    "sent": "That means that there is less than N branching nodes in the tree.",
                    "label": 0
                },
                {
                    "sent": "What happens to these labels?",
                    "label": 0
                },
                {
                    "sent": "Because that was the source of this quadratic size.",
                    "label": 0
                },
                {
                    "sent": "These would be.",
                    "label": 0
                },
                {
                    "sent": "Actually possible to replace by a very simple pair or 1 pointer and the length.",
                    "label": 0
                },
                {
                    "sent": "So basically this would be a pointer to position one and length 6, so this label.",
                    "label": 0
                },
                {
                    "sent": "You can read out from the original sequence any label you can read out from the original sequence.",
                    "label": 0
                },
                {
                    "sent": "This 80 you can read out from the position two length 2.",
                    "label": 0
                },
                {
                    "sent": "So now in this very simple trick.",
                    "label": 0
                },
                {
                    "sent": "Every label in this linear size tree is constant size.",
                    "label": 0
                },
                {
                    "sent": "And then that's why the world this suffix trees the first linear time constructions were proposed.",
                    "label": 0
                },
                {
                    "sent": "I think in 1973 they were independent, not independent, but different algorithms.",
                    "label": 0
                },
                {
                    "sent": "Proposed linear that linear time are able to generate these things.",
                    "label": 0
                },
                {
                    "sent": "A lot of research in this combinatorial pattern matching in the string algorithm a space has been tossed.",
                    "label": 0
                },
                {
                    "sent": "These kinds of indexing structures suffix trees are being used in your favorite compression algorithms.",
                    "label": 0
                },
                {
                    "sent": "Beat zip I think uses this suffix tree like now.",
                    "label": 1
                },
                {
                    "sent": "They use suffix arrays.",
                    "label": 0
                },
                {
                    "sent": "Suffix array is a different thing is fixed or it would be just a readout of these labels.",
                    "label": 0
                },
                {
                    "sent": "241356 you put into array and that is your perfect.",
                    "label": 0
                },
                {
                    "sent": "Indexing structure because that allows to do binary search over the over these strings.",
                    "label": 0
                },
                {
                    "sent": "I've not going to this two years ago in bertinoro this.",
                    "label": 0
                },
                {
                    "sent": "Linear time suffix array construction was was described that was, that is a very recent algorithmic development, like about three years ago, three independent groups proposed linear time construction for the suffix array.",
                    "label": 0
                },
                {
                    "sent": "Suffix array can be constructed linear time.",
                    "label": 0
                },
                {
                    "sent": "When you look at this algorithm, you produce linear time, the suffix tree and you just read out the labels in in the leaves.",
                    "label": 1
                },
                {
                    "sent": "That is your linear time construction, but trick there was to have without the suffix tree step.",
                    "label": 0
                },
                {
                    "sent": "So that's a very very nice field of research.",
                    "label": 0
                },
                {
                    "sent": "OK, so 80 how many times 80 occurs now in the input input data.",
                    "label": 0
                },
                {
                    "sent": "80 occurs.",
                    "label": 0
                },
                {
                    "sent": "Twice two different suffixes have 80 as a prefix.",
                    "label": 0
                },
                {
                    "sent": "T occurs twice because two different suffixes occur.",
                    "label": 0
                },
                {
                    "sent": "Have T in the first letter.",
                    "label": 0
                },
                {
                    "sent": "So it's very simple counting machine for how many different substrings you have in the data.",
                    "label": 0
                },
                {
                    "sent": "So to just count substrings, you can enumerate all the substrings, look at every every node and last time.",
                    "label": 0
                },
                {
                    "sent": "Again Apostolic was presenting this how to how to then further if you use some significance criteria which would be monotonic, how you only need to look at these internal nodes and these can be also calculated in polynomial in linear time.",
                    "label": 0
                }
            ]
        }
    }
}