{
    "id": "kfv4yret3bl7dbq3snuap6xmlltj5yci",
    "title": "What will it take to give machines a real sense of humour",
    "info": {
        "author": [
            "Tony Veale, UCD School of Computer Science and Informatics, University College Dublin"
        ],
        "published": "March 30, 2018",
        "recorded": "March 2018",
        "category": [
            "Top->Philosophy",
            "Top->Computer Science->Machine Learning",
            "Top->Computer Science->Artificial Intelligence"
        ]
    },
    "url": "http://videolectures.net/dnevi_veale_sense_of_humour/",
    "segmentation": [
        [
            "Welcome to the final lecture of yourself.",
            "Stephen days.",
            "The whole week was very full of very exciting lectures and events, so the final speaker is Professor Tony will from Dublin.",
            "He is into computational creativity research.",
            "His he started his research career with a PhD in Dublin from Trinity College.",
            "It was about the subject of creative language processing.",
            "Then he was partially in academia, partially in industry including Cycorp Corporation, where some of our colleagues know very well about the psych ontology and there he did.",
            "Some reasoning tools for that.",
            "Nowadays he's professor at University College Dublin.",
            "And his research area is computational creativity.",
            "We were part of two projects together with Tony.",
            "One was pro Seco concerted action, where Tony was coordinator.",
            "The other one was swim the what if machine where we both contributed to that kind of research?",
            "Tony is very well known for his work in computational creativity.",
            "He wrote more than 100 research papers.",
            "He wrote several books, some in comics form, and today's lectures will be in comics form, so this is slightly unusual, but I'm sure you will enjoy it a lot.",
            "His book, in 2012 Exploding the Creativity Myths, the computational foundations of linguistic creativity.",
            "Then he's very much interested in metaphors.",
            "Automatic metaphor creation simile, analogy, blending and irony.",
            "There is a forthcoming book in this year about Twitter bots, and he will tell you more about it.",
            "And of course he was very active and still is active in the Association of Computational Creativity.",
            "He organized international Conference on Computational Creativity in Dublin, and while he performs in.",
            "Summer schools on computational creativity.",
            "So we're very much forward looking forward to your lecture.",
            "Thank you, Nora.",
            "I'm delighted to be here.",
            "Thank you for inviting me.",
            "So it was great to be in Ljubljana.",
            "It's a lovely city and thanks for coming to listen to me today.",
            "I want to talk about humor because humor is one of the capacities that we humans have that demonstrate our everyday creativity.",
            "We think of creativity sometimes as being the preserve of special people, but everyone has a sense of humor and we're all creative in a lower level way when it comes to humor.",
            "And I think the goal of computational creativity is not to try to replicate the creativity of geniuses, but to replicate the creativity of all of us in a way that we can create conversational and collaborative partners to make us more creative.",
            "Computational creativity is about creating creative partners that make the human in the partnership more creative, too.",
            "It's about adding more creativity to the world.",
            "I want to talk about humor because I love humor.",
            "And jokes are really a kind of perverted metapher.",
            "So I got into joke analysis and joke generation because I was interested in the conditions under which metaphors became silly while still being informative.",
            "OK, so I'm going to talk about building a sense of humor from the point of view of a machine.",
            "OK."
        ],
        [
            "And give you some examples of popular culture.",
            "This is K2 SL from the film Rogue One in 2016.",
            "I think he's the best Star Wars robot because he's the only one with a sense of humor.",
            "We can presuppose that R2 has a sense of humor.",
            "We don't really know what he's saying, but K2 or so sounds like a really sarcastic human.",
            "The kind of person that you work with, perhaps, and that you enjoyed our humor, but at the same time you find them very difficult people.",
            "So here's a couple of examples from the movie that is a bad idea, but what do I know?",
            "My specialty is only strategic analysis, so that's passive aggressive.",
            "There's a problem on the horizon.",
            "There is no horizon.",
            "OK, so that's a navigating joke.",
            "Two of the characters are meant to blend in as spies and steal something and get out without anyone noticing.",
            "But of course there's huge explosions and people dying, and he says there were a lot of explosions for two people blending in, so he's kind of difficult, but he expresses this frustration through humor, and he becomes a good team player.",
            "And we're very sad to see what happens to him at the end."
        ],
        [
            "An interesting thing about K2S oh is that in the film he actually works for the empire.",
            "He's an Imperial battle Droid and he's been reprogrammed by the rebellion, right?",
            "So they've taken something that was programmed to kill them and turned it into a collaborator.",
            "We're told the character Cassion did this, but he didn't reprogram the robot completely, he just changed the programming of the robot.",
            "So on the right here, this is my version of a conceptual blending diagram.",
            "We have.",
            "What an Imperial battle Droid is probably meant to be.",
            "Aggressive, ruthless, direct, no nonsense, right?",
            "And on the left we have something like C3 PEO passive, helpful, informative, and what the characters in the film did was they took something from the right.",
            "And they imposed onto it passivity.",
            "Informativeness and a sense of teamwork and what you end up getting in the blend of course is passive aggressiveness.",
            "The physical aggressiveness of killing the enemy is now turned into passive aggressiveness, where language is used to verbally attack the people that he works with.",
            "So he is not designed to be humorous.",
            "This is my point, no one decided to give this guy a sense of humor.",
            "What happened is that his sense of humor emerged out of other characteristics, and that is what makes humans so difficult.",
            "We do not evolve a sense of humor.",
            "Humor is an emergent phenomenon that comes out of order.",
            "Faculties that we have for teamwork and socialization and for problem solving."
        ],
        [
            "Another example from popular culture, which I really like is the robot tars from Interstellar 2014.",
            "One of my favorite films.",
            "Now the robot looks like a big slab.",
            "And it's a reference to the Monolith in 2001, this film.",
            "Is an homage to Kubrick's 1968 movie, Not Ours has a somewhat nicer sense of humor than K2S.",
            "Oh, but he's still very sarcastic and at one stage Cooper the astronaut when he finds out that Taurus has a sense of humor, he says.",
            "A giant sarcastic robot.",
            "What a great idea.",
            "So he shows that he's sarcastic to Antorus is very very witty.",
            "I mean, he suggests at one stage that he's going to take the humans and turn them into slaves for his robot colony and so forth, and he tells them I'll put on Aculight.",
            "If you don't know when I'm joking.",
            "Which is also sarcastic, and then when he tells jokes, the light comes on.",
            "So he's aware of his own sense of humor."
        ],
        [
            "And in fact, later in the film when he's being repaired.",
            "We find out that he's highly parameterized Cooper size.",
            "I want you to set your honesty to 95%, which means, don't be absolutely honest, because absolute honesty can be hurtful.",
            "He says.",
            "Confirmed make, set your humor to 75% and he says confirmed self destruct sequence in ten T -- 10 Nine 8.",
            "So he's joking about having a sense of humor by pretending to be in self destruct mode.",
            "So Cooper says, let's make that 60%.",
            "And he responds with a lower quality joke.",
            "He says, knock, knock.",
            "So he's aware that 1975% is associated with a sophisticated sense of humor and 60% is associated with childlike humor.",
            "And he's making fun of that.",
            "So he has a meta model of what it is to have a sense of humor.",
            "He isn't just using humorous statements, he understands fundamentally what it is to be humorous in the movie.",
            "He's an old robot and the newer robots case.",
            "And Kip have faster processors but they are not funny.",
            "Why is stars funny?",
            "Becausw humor is not about processing speed, it's about experience of the world and this old robot has seen a lot."
        ],
        [
            "Let's talk about a real robot, Alexa.",
            "Amazon's Echo with the Alexa interface, you might have noticed recently that there are stories about Alexa laughing inappropriately.",
            "Which is kind of creepy.",
            "It's nighttime and you're sitting at home with your wife and you say, Alexa, turn on the lights and Alexa goes.",
            "And then you say Alexa, turn on the lights and she goes.",
            "And then you say Alexa, for goodness sake, turn on the lights and she goes he.",
            "But the lights don't come on.",
            "That is kind of frightening, right?",
            "Because you don't know what Alexa is going to do.",
            "Maybe she'll shut all the doors, turn the heating off, freezing to death.",
            "So Alexa doesn't have a sense of humor, but she has a program for when to laugh and because she doesn't have a sense of humor, the program for laughing is not very accurate and she laughs inappropriately.",
            "And her laugh isn't very attractive.",
            "It's kind of creepy.",
            "So you can say, Alexa.",
            "Please laugh and you'll get the that's not interesting.",
            "It's not a real laugh, it's not.",
            "It's like it's not a real smile when human smile fakely, you can tell from your eyes that they don't mean it and she doesn't mean it.",
            "'cause she doesn't really have a sense of humor."
        ],
        [
            "Now.",
            "What does it mean for a human to have a sense of humor?",
            "Well, let's take some software.",
            "Analyze words which analyzes peoples personality on Twitter as exhibited in their text and see what a funny account on Twitter looks like when analyzed.",
            "This is funny one liners someone collects all of these favorite jokes and just tweets them.",
            "So this account is just constant comedy.",
            "And if we look at the analyzed words profile, this comes out of the Texas group James Pennebaker and his team who came up with the LIWC.",
            "We find that the humor, the personality behind all of these collective jokes tends to be downbeat.",
            "Moderately angry, not angry, but quite depressed.",
            "Personable, personable is defined by Pennebaker to be equivocal when you're not stridently telling people what to think, but you're saying I could be right.",
            "I could be wrong.",
            "You're opening the possibility of being wrong.",
            "Not at all arrogant.",
            "Quite analytic and very much in touch with one's feelings right now.",
            "This is a personality of its self deprecating person who sees the world is full of problems and goes.",
            "What are you going to do?",
            "Look at this, that's a classic form of humor, but comedians don't all have the same sense of humor, right?",
            "Somewhere, argant, some are personable, summer upbeat, some more neurotic, right kind of Woody Allen style.",
            "So can we learn anything at all from human personality to build a computer personality that's funny?",
            "And you might think this isn't very useful."
        ],
        [
            "One of my students and I we've built a neural sarcasm detector.",
            "It's a neural model, which means there's a lot of black magic.",
            "You just hook up lots of different components, convolution layers, pooling layers, recurrent neural networks and LST EMS, and you just feed in a network or a vector representation of a tweet, and it tells you whether it thinks the tweeters sarcastic or not.",
            "We found that we got a significant statistically significant.",
            "Increase in performance when we fed in the personality analysis of the person who was writing the tweet.",
            "So if the tweet came from Realdonaldtrump then we would analyze his personality."
        ],
        [
            "Using analyze words at the moment the tweet was generated and the analyzed words profile is built from the last 100 tweets and by."
        ],
        [
            "Eating in that personality, the system can better detect whether a Twitter sarcastic or not, because we all know people who are very sarcastic.",
            "We say they have a sarcastic personality.",
            "Now, if you're in a bad mood, if you're in a sarcastic mood, your tweets are more likely to be sarcastic.",
            "So personality does count."
        ],
        [
            "But how?",
            "How should we model humor?",
            "I've been talking about humor now for 10 minutes, but I didn't tell you what.",
            "How to define humor.",
            "Can anyone give me a definition of what it is to be humorous?",
            "And don't use a synonym like, funny.",
            "What is humor?",
            "They theories of humor that we work with and humor studies and which have been around for hundreds of years.",
            "People find out a very funny phrase.",
            "Humor studies.",
            "They must think you guys have great fun studying humor all day.",
            "Let me tell you, it's not fun.",
            "The jokes are as old as as ancient bread and just tasty people analyze simple jokes because no one disagrees about their meaning.",
            "But after a while, everyone forgets what a joke is funny.",
            "But the basic theory behind humor is that it is a form of incongruity.",
            "Incongruity is.",
            "A sudden realization that the world is not as it should be.",
            "OK, so you come to work and you look down and you realize that you're wearing two different shoes.",
            "How did that happen right?",
            "Or your car keys aren't where you left them.",
            "Right or you wake up and you're not at home and you're in some strange bedroom you go.",
            "What's going on?",
            "That's incongruity right now.",
            "There are all sorts of incongruities in the world.",
            "You order pizza and the waiter brings you lasagna.",
            "That's incongruous.",
            "But not all incongruity is funny, is it?",
            "So what makes incongruity funny?",
            "While there are, there are two minimal criteria.",
            "One is the incongruity must be resolve aghbal, which means that you must be able to understand why the incongruity arose.",
            "So, we call humor.",
            "An act of incongruity resolution and that view goes back all the way to a manual count.",
            "Who said that humor arises when we are faced with a conceptual dilemma and by thinking about it, the dilemma disappears into nothingness under relief and joy that that gives us causes humor.",
            "It's kind of a steroid theory.",
            "I think you find, but it's a very useful one.",
            "The idea actually goes back to a Scottish philosopher named James BC, who came up with it earlier, but everyone credits can't.",
            "And everyone since has been talking about incongruity resolution.",
            "And you probably came across a lot of incongruity.",
            "If you grew up like me watching Star Trek, right?"
        ],
        [
            "Or this TV show lost in space?",
            "Do anyone ever see this?",
            "You're probably too young.",
            "You seen it.",
            "I used to watch this every Saturday and when I watched it, it was old when I watched it, I should say we had this robot B9.",
            "His name was B9 or as a benign and his creator Professor Smith Smith was a wicked selfish man and he was always trying to get the robot to be part of his schemes.",
            "But the robot was always reporting him to the rest of the family or saying does not compute, does not compute, and in fact this is the TV show where we get this phrase from.",
            "Whenever you hear people talking about computers saying does not compute, it comes from this TV show.",
            "Now the comedy comes.",
            "This was quite a funny show.",
            "The robot is very rigid, not humorous at all and Smith is.",
            "Not particularly funny either, but he's wicked and the combination of the two of them, his frustrations caused by the robot and his reaction to the robot by saying you, bubu, idiot dismantle you for this is quite funny and lots of comedy acts work this way.",
            "We have a very literal minded straight man and we have what is sometimes called the banana man or the comedian.",
            "So Jerry Lewis and Dean Martin, lots of comedy Jewelers work where you don't have two very funny people.",
            "You have a very serious person who represents us and then you have the clown.",
            "Who represents chaos and it's the connection between the two that creates the humor."
        ],
        [
            "I'll give you an example of incongruity from Star Trek and the early Star Trek.",
            "The enterprise crew were always meeting supercomputers with evil intent and Kirk always destroyed them by getting contemplate a contradiction.",
            "Now we know that computers don't work this way, don't we?",
            "When the computer gets a contradiction, it throws a Java exception or it says does not compute, but it certainly doesn't go.",
            "I must destroy myself, which is what was what happened in Star Trek.",
            "So here Kirk gets this robot, which is actually like a flying teapot.",
            "You can even see the wire in the TV show.",
            "I am Kirk, the creator.",
            "You order creator, you're wrong.",
            "Jackson Roy Kirk, your creator is dead.",
            "You have mistaken me for him.",
            "You are an error error, error.",
            "You did not discover your mistake.",
            "You made two errors.",
            "Error, error examined, it explodes.",
            "And he does this about five times over the tree.",
            "Star Trek series.",
            "Clearly this is a false model of how computers handle incongruity.",
            "So if we think that incongruity is the basis of humor, TV shows, too."
        ],
        [
            "Plus that computers cannot handle incongruity and therefore cannot be humorous.",
            "But that is wrong.",
            "I hope you'll agree with me by the end of this lecture that that is wrong.",
            "Humor, by the way, is probably the hardest thing that will ever give a computer everything else.",
            "Making them drive around on their own, making them do shopping for us, making them write letters and books for us.",
            "Easy compared to giving them a sense of humor.",
            "The sense of humor is the pinnacle of human development."
        ],
        [
            "OK so I should say that.",
            "Having said those high minded words, most computer models of humor focus on the most ridiculous and annoying form of humor.",
            "The pun now can anyone think of a form of humor that people actually apologize for when they do it accidentally?",
            "It's the pod.",
            "Have you ever had someone say?",
            "Pardon the pun or excuse the pun.",
            "We are so embarrassed by this form of humor that when we do it accidentally we apologize.",
            "Abjectly I please excuse the pun.",
            "I didn't mean it, but computers are very good at puns and early work in the 90s by Graeme Ritchie and his students showed that computers could develop or generate novel puns that schoolchildren would find just as funny as the puns that were published in official Joke Books and in Christmas crackers.",
            "That's a really lower level.",
            "Right, what do you say?",
            "What do you call?",
            "A murderer who eats corn flakes for breakfast.",
            "A serial killer problem, right?",
            "Quickly move on past up now.",
            "Why should?",
            "If anyone?",
            "If any of you are here because you came to see the Nobel laureate talk about physics, you might think why does anyone care about giving computers a sense of humor?",
            "Well, there was a fundamental relationship between scientific creativity and humor.",
            "Isaac Asimov famously said, and I think very truly said the most exciting phrase to hear in science, the one that heralds new discoveries, is not Eureka.",
            "Archimedes, jumping naked out of his bat and running down the streets of Syracuse because he just discovered a way of calculating the density of gold and thereby saved his head from being chopped off.",
            "Eureka, the Greek.",
            "For I discover it's also the basis for the computer science word heuristic.",
            "It is not Eureka, that's the myth about science.",
            "According to Asimov, the most exciting phrase in science, the one that says, I'm on the verge of a big discovery."
        ],
        [
            "Is that funny?",
            "Right, the data does not meet your expectations.",
            "Kepler was looking at T. Cobra has data for the orbit of Mars for decades.",
            "He expected to solve the problem and weeks he could not figure out why the hell Mars was moving the way it did.",
            "Eventually, he realized his Kepler's law that the planet was moving in an ellipse and he said water dirty bird.",
            "I was.",
            "He wasn't a very funny person, but you can see that he could see this sense that there's something funny here.",
            "And it took him 20 years to get the joke.",
            "But most scientists, when they see something odd, this doesn't right?",
            "Consider dark matter.",
            "What the hell is up with the universe where most of the matter that seems to be needed to create gravitational forces that we observe is not observable?",
            "Q discovery of dark matter, so that's unusual.",
            "That's funny.",
            "That's the foundation for scientific curiosity.",
            "Some people go in the direction of jokes.",
            "Some people go in the direction of theorems and scientific progress, but the foundational ideas are the same incongruity Spurs curiosity, which creates either humor or science, or both."
        ],
        [
            "OK, does anyone recognize this guy?",
            "This is a very local thing.",
            "This is.",
            "This character's name is Victor Meldrew from a TV show called 1 Foot in The Grave.",
            "He's an angry old man and bad things happen to him all the time.",
            "For instance, he's always cutting a loaf of bread and he finds something hairy in the bread and he pulls it out.",
            "And it's a man's wig, right?",
            "Or he's eating fish and chips and he finds something that doesn't look like a chip.",
            "And it turns out to be a man's pinky finger.",
            "Now these are very these are incongruities, right?",
            "I hope it never happens to anyone of you, but it's not a funny incongruity until Victor says his catch phrase, Victor is very famous for his catch phrase.",
            "He looks at the incongruity.",
            "And he says, I don't believe it.",
            "And that's the point at which everyone loves.",
            "Now, why is it that we need him to say his catch phrase before the incongruity becomes funny?",
            "Let me ask you another question.",
            "Supposing you're sitting in this room on your own one night, just studying, catching up with email, and that Clock falls off the wall.",
            "Ducks in Congress, right?",
            "Clocks aren't supposed to do that.",
            "But you understand that maybe the nail was rusty or something.",
            "Now it's not funny when the Clock falls off the wall and you're here on your own.",
            "It's just weird, right?",
            "Now, supposing you're here with friends, you're having a study group and the Clock falls off the wall.",
            "Is it funny then?",
            "Yes, you'd laugh, right?",
            "Now, why is it that the incongruity is funny when there are multiple people and it's not funny when they are not?",
            "There's only one because humans are social phenomenon and it requires what psychologists call theory of mind.",
            "TM theory of mind is this faculty that children develop around two years where they can imagine what is inside someone else's head.",
            "It's a fundamental part of human cognition.",
            "Right, and psychologists do experiments with children where they, the children, see two people playing with a toy and one of them puts the toy in the box and the other child leaves.",
            "And when the other child leaves, the first child takes a toy out of the box and hides it behind the curtains.",
            "And when the second child comes back the test subject, a young child is asked where will he look for the toy?",
            "Now children, about one years old will indicate that he will look for the toy in the box becausw already that he will look for the toy behind the curtain, because that's the last place you saw the toy being put.",
            "But children about two or three years of age will say he will look in the box because that's the last place he saw the toy right?",
            "So being able to put yourself into other peoples minds and seeing the world through their limited access to facts is called theory of mind and humor.",
            "Is all about seeing the incongruity through the minds of other people and imagining how they react?",
            "So, Victor, I don't believe it.",
            "His frustration is humorous to us because we can step into his mind and see how he reacts.",
            "But what out?",
            "This catalyzing agent of the other person without the theory of mind component.",
            "Irresolvable incongruity is not funny.",
            "This makes it difficult for humans for machines to be humorous because they don't really have theories of mind or socialization skills.",
            "I would say that humor becomes incongruity becomes funny at human scale.",
            "When it becomes about humans and we see it through the eyes of humans.",
            "Incongruity and its resolution become funny."
        ],
        [
            "And it's also to do with.",
            "Imagining.",
            "How it feels to be powerful until lose power or to be powerless and to suddenly momentarily be quite powerful, right?",
            "So lots of jokes.",
            "Cut the legs from under pompous people and they elevate the week over the strong momentarily, and that's a very primal force to us.",
            "Humor is a great equalizer.",
            "There's a certain form of humor called superiority humor where we laugh at disabled people and so forth is a disgusting kind of humor and in fact.",
            "Are Stottle says that that's how humor works, that we laugh at the deformed and the weekends, or we do not.",
            "I mean, some people do, but there are broken people.",
            "We laugh when the week are made powerful, when the incongruency is felt at human scale and social relations are temporarily upended.",
            "OK, very important dimension when you're modeling humor, you have to put aside the ugliness of some of the early theories."
        ],
        [
            "I'll tell you a joke to show you an incongruity.",
            "This is an Irish joke.",
            "I don't know if you've been to Dublin the Guinness factory in Dublin has the biggest beer VAT.",
            "It's like a big swimming pool of beer in the world because they produced the world's largest amount of Guinness, and you go do a tour of it and you'll see people with Nets.",
            "Cleaning the beer because you know things fall in from the roof, kind of bird droppings and cigarette butts, and birds.",
            "Drop twigs and seeds.",
            "And people have to clean out the beer 'cause it's a good beer.",
            "You want good quality beer and one day one of the guys with the next falls in trash is about.",
            "The cut a Long story short, he drowns.",
            "It's a tragedy and the manager of the factory says Oh no, that's Paddy.",
            "His wife just had a baby she would be devastated.",
            "I better go around and tell her.",
            "So he goes around to Patty's house and Mary the wife opens the door and she's got the baby in her arms.",
            "Hello Tom, how is Paddy?",
            "Tom says if you can see his face he's devastated and she starts crying.",
            "No no padding is dead isn't he?",
            "And Tom says yes, I'm afraid he is married.",
            "He fell into the beer.",
            "At work.",
            "And to cut a Long story short, he drowned.",
            "She's devastated, she's crying, she's scratching at the door.",
            "And then, she says, give me some comfort.",
            "Give me some comfort, tell me it was a quick death.",
            "And Tom shakes his head and goes.",
            "I'm sorry Mary.",
            "I wish I could, but the fact is Paddy got out twice to use the toilet.",
            "OK, so this is what happens when an Irishman falls into beer.",
            "He trans, but he trans happily after along along fights, right?"
        ],
        [
            "So this is the theories of humor that are dominant at the moment.",
            "The general theory of verbal humor GTH, which has its roots in the semantic script theory of humor, by Victor Raskin from 1985.",
            "Our AI theories, raskins STH, says that a joke is.",
            "Partially compatible with two different scripts.",
            "You hear the text of the joke.",
            "And you activate in your mind just xiangqi and schematic script.",
            "But you get to a point in the joke where the script doesn't fit anymore and you have an incongruity.",
            "Oh my God, I've actually misunderstood what's happening.",
            "And then the mind jumps to a second script.",
            "And that second script resolves.",
            "The incongruity partially resolves it because the joke is still silly, right?",
            "We know that a man who fell into beer wouldn't really get out to use the toilet and then fall back in accidentally and do that twice.",
            "But there's an exaggerated archetype of the Irishman there.",
            "But this is actually the model.",
            "You have two scripts.",
            "One is dominant until you get to the punch line, and then you are forced to do a script switch or a frame switch.",
            "And conceptual blending theory is called frame switching.",
            "In frame shifting, an in humor theory it's called script switching, but the idea is that there are two scripts, one dominant, one minor and at the punchline.",
            "The minor script becomes a dominant script, and there's a reversal of activation, so compelling theory, but we have in AI we don't really know how to model these scripts effectively, and how many there are."
        ],
        [
            "By the way, this cut up I drew scissors.",
            "Here is a generalization of a technique that was developed by William S. Burroughs and Brian Geisen in the 60s called The Cut Up Method.",
            "They would cut up poetry in newspapers and reassemble it randomly to get original new compositions, and it's a very prevalent technique.",
            "I'm going to plug my new book here that Nada was mentioning myself and my cook have written a book with MIT press called Twitter Bots.",
            "Making machines that make meaning.",
            "It's a computational creativity book that is very practically oriented towards building Twitter, box autonomous creative agents that have their own Twitter accounts and tweet for you so you never have to use Twitter yourself.",
            "I never use Twitter myself, but my machines are tweeting away all the time and getting me into trouble.",
            "And I've been banned from Twitter several times.",
            "Notice how to the guy who drew discover wasn't me.",
            "They just quickly looked at the text and came up with this.",
            "Robot legs birdhead you see the mixture of fonts looks like a blackmail note.",
            "Making machines that make meaning.",
            "That's the cut up technique.",
            "It's a very intuitive and commonplace technique, and descriptive theory of humor where you slice and dice scripts to create an incongruity that you can resolve is the most common technique, and this suggests that, by the way I drew a robot, David Bowie there, because he was very famous for using the cut up technique as well, and he wrote some of his lyrics using the cut up technique like the spiders from Mars lyrics.",
            "And in fact, he had a piece of software called of herbicides are written for him to help him do cutups.",
            "There was no AI in there, was pure or what we call mere generation."
        ],
        [
            "Now, this idea of cutting up and reusing old text.",
            "It doesn't, doesn't please everybody.",
            "Very famously, in 1946, George Orwell, a brilliant writer, but really.",
            "Hectoring personality.",
            "He famously said every joke is a tiny revolution against common sense and received wisdom, which I believe, but he also disagreed with this idea of reusing and cutting up familiar language."
        ],
        [
            "He said a good writer chooses his words carefully, but the world is full of lazy writers who are ruining English, he said.",
            "You are not obliged to go to all this trouble.",
            "You can shirk it by simply throwing your mind open and letting the ready made phrases come.",
            "Crowding in.",
            "They will construct your sentences for you, even think your thoughts for you.",
            "He hated the idea of people using cliche and working with idioms and familiar language, when in fact that's one of the dominant models for getting computers to be creative with language is reusing familiar language and cutting it up in new ways.",
            "So no to you, Mr. Orwell."
        ],
        [
            "Right here.",
            "In fact, he's a bit like Big Brother.",
            "If you read his work on his essays on language.",
            "He doesn't sound like.",
            "Winston Smith from 1984.",
            "He sounds like O'Brien and he sounds like Big Brother fact.",
            "He is what he hated in many ways.",
            "He would say things like never use a metaphor or another figure of speech that you're used to seeing in print.",
            "This is a very authoritarian view of language that is not supported by anyone who actually studies language professionally, and it leaves no room for the creativity of reuse."
        ],
        [
            "I'll give you an example.",
            "There was a critic called William Empson of the same generation.",
            "He wrote a book called Seven types of Ambiguity, and he famously criticized Orwell with this phrase.",
            "I really love this phrase.",
            "And may mean less to you if you're not a native English speaker.",
            "But he said poor George, the Eagle eye with the flat feet.",
            "Eagle Eye is a cliche, meaning sharp, sharp with it.",
            "On flat feet means.",
            "Plodding dull, banal, incompetent.",
            "So he says, basically you can spot other people's problems, but you can't avoid them yourself, can you?",
            "Notice how he combines two cliches.",
            "For a creative way of reusing cliches, and that's basically the computational approach that many of us taken linguistic creativity on a machine, we get the system to work with very familiar language, but we cut it up in ways that tried to bring out novelty, an incongruity, and we measured the incongruity, and we filter the results by incongruity."
        ],
        [
            "Here's an example from one of our Twitter bots.",
            "It's called Trump scuttle bot.",
            "He looks very extremely orange on this slide here.",
            "I didn't mean him to be this orange.",
            "This may actually be more accurate though.",
            "And here's a simple roses are red poem that the bot generates on its own.",
            "Bible Belt states are red aristocratic veins or blue.",
            "My human children love me and would lick dirt from my shoe.",
            "OK, so notice how it's caught up.",
            "All of these different phrases to make this poem that rhymes and poetry generation is one of the areas that we study in computational creativity.",
            "But notice all the cliches, Bible Belt states, aristocratic blue veins, the idea of someone who's humble licking dirt from your shoe, and a combined them in ways that try to give new value to these phrases and in."
        ],
        [
            "Fact the system uses a grammar.",
            "The formalism is called tracery.",
            "I won't go into it here."
        ],
        [
            "But the grammar is built on all of these cliches which are written into the grammar.",
            "So for instance, up here we have all of the gold things that the grammar knows about.",
            "My underpants.",
            "Trump tower toilets.",
            "Willy Wonka's ticket, Beyonce's toenails, and so forth.",
            "And it uses those to compose.",
            "To combine into these.",
            "Poems, but they're all given by us.",
            "So to be creative, the machine should really learn its own cliches and use them automatically."
        ],
        [
            "So we need to give the computer the ability to go out onto the web and to find its own commonplace, highly visual imagination tickling cliches.",
            "And we can find them on the Internet and harvest them automatically.",
            "How do we do that?"
        ],
        [
            "Here's an example of another famous comparison from one of my favorite orders, Raymond Chandler.",
            "He's the undisputed master of the simile.",
            "He wrote detective fiction, but he elevated into a literary art form.",
            "He's talking about a guy who's as big as me, maybe twice as wide.",
            "Moose Malloy.",
            "Shockingly white.",
            "He's been imprisoned for 20 years.",
            "He's looking for his wife, who ran away, and he's in the black area of town, or only black people live there.",
            "So there's this huge white guy angry, running around, frightening all of the black people.",
            "And Chandler says this even on Central Ave, not the quietest dress street in the world.",
            "Malloy looked about as inconspicuous.",
            "As a tarantula on a slice of Angel food, Angel food is a really white cake.",
            "Trash is a big, disgusting black spider.",
            "Notice how is comparing a white man and a black neighborhood to a black spider on a white cake.",
            "This is not about visual similarity, it's about the ability to evoke a frightening image you reach for that piece of cake.",
            "Ohmygod there's a spider and he wants to give you that same feeling that the people who see Malloy have, and it works wonderfully.",
            "But notice that he uses the word about.",
            "In English, we tend to mark our ironic similes with subtle hints to say I'm not serious.",
            "He's not inconspicuous, he's in.",
            "He's completely conspicuous.",
            "We mark our playful intent with the word about."
        ],
        [
            "And if we start harvesting as X about as X as Y from the web, we can get all of these visual images automatically and we know that they're playful because they've been taken from ironic comparisons and we created an inventory so the computer gets 215 ironic visual images for subtlety.",
            "OK, as subtle as a train station toilet right now, you see that's a funny image, right?",
            "What's funny about that?",
            "It's just odd.",
            "We just love comparisons that are antagonistic and incongruous.",
            "As appealing as a trip to the dentist to have all of your teeth removed right again, what a horrible visual image, but great fun.",
            "And so on.",
            "About as useful as seeking tips on humility from Donald Trump is one of the examples in there as well, so we used."
        ],
        [
            "But and we recombine them in the way that Empson recombined cliches to generate new cliches.",
            "Louis B. Mayer famously said Hollywood needs new cliches and we can build machines to give new cliches.",
            "So here's an example.",
            "It's kind of rude this.",
            "I don't know if you're rich.",
            "If you watch Rick and Morty, but we've built a bot called interdimensional cable TV.",
            "It's called Inter cable bot.",
            "Imagine what TV is like in other universes.",
            "By the way, it's really bad.",
            "I'll say this art film is about as subtle as a loud fart during morning mass, and you see what a great composition, composition of images and one and usual thing to say during science week."
        ],
        [
            "Oh here's here's a few examples from interdimensional cable.",
            "We now return to our addictive soap opera.",
            "Hell we now return to our coordinated dance movie The Dead Slug.",
            "Watch Mata Hari selling military secrets in the exotic spy caper, cashier's at a suburban mall, the titles of the films are deliberately chosen to be the opposite of what they should be.",
            "Stay tuned for the next installment in the family film, the Priesthood Tree.",
            "The porn store, right?",
            "So again, it's imagining an idiotic universe where the films or not, what it should be.",
            "And in fact it's kind of satire in Hollywood."
        ],
        [
            "And you can build these.",
            "You can reuse these images, we build them into a grammar thousands and thousands, and thousands of them, and you can harness them for ironic and literal uses.",
            "So we have this little grammar that says 1000 metaphors for Trump's America.",
            "And then it generates a number between one and 1000 and then it puts in.",
            "A visual image and the whole idea of course, is that it's meant to make you think newly about things.",
            "Does everybody know what a subpoena is?",
            "A subpoena is when a judge says you have to testify, you're in big trouble.",
            "Mr Right turns out to be very apt.",
            "Let's hope."
        ],
        [
            "OK, here's some more root stuff.",
            "We have a bot called comedy Dinosaur Anna generates a spoof of.",
            "Hipster culture.",
            "So fancy going down to new microbrewery, the questionnaire and magazine for a pint of academic paper lager.",
            "It's the most boring name for lager.",
            "It could invent academic paper and the pub sounds dreadful.",
            "The questionnaire and magazine, or I've just been down my local gastropub to fart in spacecraft pile of horseshit.",
            "This is not a good gastropub is it?"
        ],
        [
            "Kids nowadays have their GPS for back in the day are only fun, was changing sheets in a bed wetting clinic.",
            "OK, so we've what we've done in case I'm sure lots of people are saying what the hell is he talking about?",
            "We've."
        ],
        [
            "Taken.",
            "The collective humor of the web as expressed through all of these imaginative similes, and we've deconstructed the similes, and recombine them in new ways and new containers."
        ],
        [
            "So.",
            "The first one is repurposed from a simile as.",
            "As pleasant as a fart in a spacecraft, Can you imagine that confined space and the fact that the air isn't being recycled and you go?",
            "Oh my God, that's not pleasant at all.",
            "And then it says, let's name in English Pub.",
            "After that, English pubs are always named the X and the Y, the Lamb and Pony, right?",
            "The King and Queen, the fart and spacecraft.",
            "The questionnaire and magazine.",
            "Maybe this is a bit English."
        ],
        [
            "OK group may enjoy guarding the Galaxy, but back in our day are only fun with seeking out Donald Trump for tips on humility right?",
            "So you get you see how it's repurposing things."
        ],
        [
            "Now the book I mentioned, the book on Twitter bots.",
            "The editor who commissioned the book said Tony.",
            "She said this the day before Christmas Eve, Tony.",
            "We'd really like some of the reviews on the book to come from Twitter bots.",
            "Just as a bit of fun, right?",
            "You know, the way you look at the back of the book and it says a Tour de force couldn't put it down right?",
            "Stephen Hawking something like that then?",
            "Couldn't pick it up anyway, sorry, that's not the worst thing I've said about forward Mr Hawking.",
            "Anyway, they wanted Twitter bots to invent humorous.",
            "Slightly sick reviews for our book so they could put them on the back of the book to show what you'd find in the book.",
            "So it generates things like.",
            "This moral new book about bots makes Bickel Bulgakov's the Master and Margarita seem as moral as the insect world, which is actually quite accurate, right?",
            "Because our bots have no morality, they're like ants, or according to Amazon people who bought this valuable book about two robots also bought.",
            "F Scott Fitzgerald, The Great Gatsby, Maia Stevenson's the 1st edition of Genesis.",
            "This thing here, that bought imagines what could be the most valuable book ever.",
            "Well, it goes to the similes, and it says as valuable as the 1st edition of Genesis, and that repurposes the 1st edition of Genesis as the name of a book.",
            "And it says, now that's a valuable book, and it knows that Great Gatsby is about this rich guy.",
            "He's valuable, so it compares them, say somewhere between The Great Gatsby and.",
            "1st Edition of Genesis.",
            "Really good pitch for our book by the way.",
            "We want our book to be the kind of bought Genesis."
        ],
        [
            "So I'll end there by summarizing very briefly.",
            "What is it that we've done?",
            "Have we come closer to giving computers a sense of humor?",
            "Well, we've given our Twitter bots a sense of humor, and it's not a sense of humor for everybody, is it?",
            "Book.",
            "We've taken this idea of incongruity.",
            "This internal contradiction of ideas, which isn't funny in itself.",
            "And the idea that it could be resolved, which again is not funny in itself and made it human scale by making it about certain kinds of people.",
            "OK, so."
        ],
        [
            "This is the kind of people who buy books on Amazon."
        ],
        [
            "This is the kind of people who enjoy technology.",
            "You have your GPS, but back in my day we had great fun changing the sheets on the bed wetting clinic which not in comparison act or this makes fun of the people who go to trendy pubs with fancy names and drink bad beer and terrible foods, right?"
        ],
        [
            "So all of."
        ],
        [
            "Those approaches are really repackaging the visual images that are free to harvest on the web in huge quantities and says how do I frame these in a ways in a way that makes them human scale?",
            "How do I make these be a negative comment on certain kind of person that we can then laugh at or appreciate their response to?",
            "And in effect, what we're doing is trying to collect the sense of humor of the Internet and package it in some discreet way in some new context that demands a new purpose.",
            "This is not especially serious work.",
            "Humor is not an area that attracts Nobel Prize winners.",
            "You might find a few IG Nobel Prize winner is working in the humour field, but I hope I've left you regardless of what you think about the computers jokes.",
            "With the idea that humor is a fundamental human faculty, it is built pyramid like on top of all of our other faculties.",
            "And it really cannot work on a machine until we've either modeled all of those other faculties or we've taken a shortcut.",
            "And harnessed the collective human humor of the web, which is where we're at at the moment.",
            "If you want non pun humor.",
            "I would be very happy to take some questions or some criticisms or some bemused looks now.",
            "Thanks everyone.",
            "So when you have a state that does bad things, and if you don't know how to express it and you start to use humor, so you make an Association is called the Banana Republic and then insert calling all the officials and try to be serious regarding hey, you're doing this job, but you're in a Banana Republic.",
            "How would you model reactions to the humorous aspect of solving a problem instead of using or?",
            "Instead of using.",
            "Oh OK, well that's it.",
            "Huge question.",
            "I would say that our work is not really designed for preventing war.",
            "In that sense, where almost everyone else in computer science but I will say that I think your question arises out of the use of humor to diffuse interpersonal hostility so people are arguing and one of them uses a joke to remove the tension from the situation.",
            "Now, is it possible that you could elevate that to a geopolitical level while the Americans elected a joke and it's only gotten worse, right?",
            "So no, I would say that humor is dangerous in the wrong hands.",
            "Seen people who use humor to change people's minds.",
            "And to turn them against immigrants, or to turn them against people who are the other.",
            "So there are there are comedians who are liberal and they draw people in and there are people who are reactionary and they push people away.",
            "Humor is a very powerful human force and it can be misused as easily as it can be properly used.",
            "So I think if we were to try to use it for something truly serious, the chances of it being misused are is greater.",
            "As it being used I. I mean, it's an interesting idea.",
            "I'll think about it and I'll get back to you.",
            "Sorry, do you have a way of to measure what's funny with the computer?",
            "Like a neural net or something?",
            "How do you know what's funny?",
            "OK, that's a very good question, becausw.",
            "We get funny in a sort of visceral level.",
            "I mean, sometimes something is so funny it hurts 'cause we laugh so much, right?",
            "I've been in situations like that where I can't stop laughing and I'm thinking, Oh my God, I'm going to.",
            "We say I'm going to die.",
            "Some people say that when you're laughing so hard, obviously they feel it in this deeply physical way.",
            "So I was at an event in Oxford in November where a professional comedy writer.",
            "Got a bunch of his Co professionals.",
            "They write TV shows like Qi and Mock the Week and all of these shows were comedians are pretending to be spontaneous and to come up with a really witty joke.",
            "They've all been written two weeks earlier about this team of people and was quite depressing.",
            "Insight into the commercialization of comedy.",
            "And so half of the audience professional comedy writers in half, or AI people.",
            "And the goal was to make us talk to each other.",
            "We'd say to the comedy writers, what can we give you in terms of technology to make your humor better?",
            "And we wanted to learn from them.",
            "What can you tell us about the process of generating original jokes that we can turn into algorithms and knowledge representations as an idea?",
            "It was great as a reality is a terrible failure, the professionals.",
            "Didn't really have anything to say to us except computers have no soul.",
            "They have nobody.",
            "Therefore they cannot be funny, right?",
            "And we were saying to them, you've got no soul and you're funny, right?",
            "They didn't get the joke.",
            "But yes, they feel the pod embodiment is key and humans use the laughter test.",
            "How much do you laugh and comedians use?",
            "That tested, the comedian would stand up here and tell a joke and no one laughed in the community, so that's not funny.",
            "And in fact the keynote speaker at this event in Oxford with Jimmy Carr and very professional and quite famous British comedian and he has this technique when he's developing a new show of writing all of his jokes down a checklist and going into a small venue like a pub.",
            "And testing the jokes and when he gets a lot of laughter he goes and when no one laughs he goes and then he filters his jokes and that's how he gets a stage show.",
            "You see these stage shows in the big arena and everyone's laughing at every joke.",
            "That's because all of the jokes that no one laughed would have been removed through this Darwinian process.",
            "Now, how does a computer substitute for laughter?",
            "Doesn't have a sense of humor.",
            "You're right, we can sense of humor is mysterious.",
            "And whenever someone wants to model something mysterious in a practical way without actually deriving any understanding, we use neural networks.",
            "So you throw a neural network at it and you train it, and you still say this works, but I have no idea why it works.",
            "I have students who do it.",
            "Of course."
        ],
        [
            "When you say I use a neural network, you have to ask them 100 questions to figure out what kind of network and what kind of parameters and how did they do overfitting and so forth.",
            "That's a really nightmare black magic problem.",
            "So on Twitter there's a simple solution.",
            "When the computer is generating its own original outputs, if people retweet it, you can tell that it's popular.",
            "Now you can take the ones that have the most retweets and you can put them into a neural net model so that the system can analyze its own outputs before their retweeted.",
            "To say I think this joke will get so many retweets, this version of will get X more.",
            "Therefore I will use this.",
            "In fact people are Cornell have been quite successful at predicting which version of A twist will get the most retweets.",
            "I did it for party announcements so they had different Twitter announcements of the same student party and their system learned that when you mentioned free beer that you get more retweets.",
            "Basically what the neural network was doing, free beer, no parents open house, right swimming pool.",
            "If you just said party at my house, we're going to watch documentaries, no retweets.",
            "Party at my house.",
            "Parents away, free beer, swimming pool, chaos.",
            "1000 retweets right so you can get a neural network to learn that kind of thing.",
            "So we're not immune to that, but that is no substitute for giving a computer a body and giving it to physical feedback.",
            "And we joke one of the comedians said to be comic is to feel pain because when your job fails, you feel this deep pain.",
            "You know, we say that the comic died on stage.",
            "And only when you have that fear and that that feedback when jokes don't work can you really feel the joy when jokes do work and that joy is addictive.",
            "And if you can train a computer to seek out the joy of telling a good joke and give it that feedback reward, then that is what we call a sense of humor.",
            "So you say that in humor oftentimes consists of incurring incongruences and their possibility resolve them.",
            "Oh yes, humor theory said it's always incongruity based.",
            "OK, so yeah, my question was, indeed, is there other ways to make humor?",
            "Oh well, there are many ways to be humorous.",
            "But the theories are consistent in viewing all jokes as being fundamentally about a violation of expectations.",
            "Now this is problematic.",
            "On its own, if you ever watch a TV show called Little Britain, it's a British comedy show where it's all about the same scenario every week with the same catch phrase at the end, you know exactly how to sketch is going to end, but it's your anticipation of how the people in the sketch will react when they hear the catch phrase that makes it funny.",
            "There was nothing surprising about the sketches in Little Britain.",
            "It's almost like a thought experiment.",
            "Can we make the most predictable show in the world?",
            "And still make people laugh and people.",
            "How would laughter and the.",
            "The key to the jokes and shows like that.",
            "Is not the incongruity.",
            "The incongruity is present throughout.",
            "But what makes the joke funny?",
            "Is the theory of mind.",
            "You are projecting yourself into the mind of the person in the sketch who was hearing the sketch for the first time.",
            "You've heard it 100 times 'cause you've watched the show every week for two years.",
            "But the person in the sketch you imagine this as an innocent person being faced with this incongruity and being faced with this horror and having to somehow deal with it.",
            "So theory of mind.",
            "Is an underlooked element of humor.",
            "All of the theories look at the incongruity, but they don't look at the elements that make the incongruity humorous.",
            "It's a mystery, really.",
            "I think that missing component is theory of mind.",
            "Our ability to empathize with the people in the story, which means that a computer that has a sense of humor is like much closer to being a truly empathic machine.",
            "Even if it laughs of us.",
            "But I don't know what it's like in Sylvania, but in Ireland we show affection to each other by.",
            "Humorously insulting each other right?",
            "It demonstrates that we have the freedom to do this.",
            "We are so close, I can insult your hair and your shoes and your mother and you won't get upset.",
            "And it's a sign of closeness.",
            "And it creates closeness.",
            "So empathy and humor are very closely related.",
            "Big cause of theory of mind and that thank you for raising the topic cause by giving our machines a genuine sense of humor, we are taking them closer to being truly empathic and sharing our value system machines that share a value system won't eradicate us.",
            "That's a good point, right?",
            "I think we shouldn't take other questions because this was a very pompous end of the talk.",
            "OK, more questions.",
            "One more maybe?",
            "Home.",
            "I have a question, if you know there's some analogue of methods to get people to laugh like in situational comedy on TV.",
            "When the laughter is montaged into.",
            "The video by something funny happens.",
            "You hear laughter that is recorded.",
            "Yes, it's called the laugh Track is is there some interlock in written kind of humor or like free beer?",
            "Yes, I think you bring up that point."
        ],
        [
            "Is an interesting about laugh tracks.",
            "You've watched friends or some TV comedy and you know when to laugh cause.",
            "You hear this disembodied laughter, and you imagine it is the laughter of the audience.",
            "And some of these TV shows are filmed in front of a live studio audience, so you imagine this is the laughter of the people watching the show as it's being recorded.",
            "In fact, you are hearing the laughter of dead people.",
            "These laugh tracks were recorded in the 1950s and are still used today, so you are hearing dead people laughing.",
            "At situated comedies, but it the laughter of dead people, is still very effective.",
            "If you want to sophisticated comedy with no laugh track, it can be sometimes very confusing.",
            "Should I laugh with that?",
            "Should I not?",
            "But if there's two of you watching it, you have mutual laughter to guide you.",
            "And again, it comes down to theory of mind.",
            "Someone else finds this funny.",
            "Let me find out why.",
            "And of course, if you watch a funny film like let's say Young Frankenstein hilarious firm, we showed it recently added.",
            "As spring school in Germany, just having 50 people in the room laughing at this was complete joy, whereas one person would smile.",
            "50 people are howling with laughter.",
            "Question was, is there something that we can do at the textual level?",
            "Well, let's consider another subtle sign of a less subtle sign.",
            "Is humor or is laughter are more subtle sign as a wink, right?",
            "Or nudge some symbol that it's OK to laugh?",
            "Here the about is the signal right?",
            "So about this as a word.",
            "It means proxamol near, but not quite right.",
            "It's a marker of imprecision and we use it in English, and I'm certain that in in serbo Croatian Slovenian there is an equivalent marker.",
            "We call it a hedge.",
            "It says don't take me at my word.",
            "I am being proximate right, and it turns out that in.",
            "English we use this word to introduce our our ideas when we're being very playfully ironic and in fact in.",
            "Some of the empirical work we've done, we've looked at determining whether automatically determining whether a simile is ironic or not, and.",
            "The presence of about is highly deterministic, and if someone gives you a simile that doesn't have about our system goes to the web and sees how many times other people have used that simile with about and how many times they've used it would act.",
            "If it's dominant in the about form, it is very highly likely to be humorous.",
            "Notice that Chandler doesn't need the word about here.",
            "He's subtly cueing you to laugh because he's going to give you something creative.",
            "Now.",
            "This is a really compressed form of laughter.",
            "But it's so subtle we don't notice it at a conscious level.",
            "Subconsciously we pick it up and we say he's wandering into the realms of the imprecise.",
            "I better hold on 'cause it's going to be funny, right?",
            "And that's.",
            "The detection of humor by neural Nets or by statistical machinery is all about recognizing these subtle markers.",
            "It's not about recognizing that tarantulas are scary because the system doesn't know what that means in terms of humor.",
            "It uses words like a bat.",
            "It uses these closed class words, which is kind of cheating.",
            "But humans use them all the time to say get ready.",
            "I'm going to make it.",
            "I'm going to tickle you with language.",
            "No more questions, thank you very much Tony.",
            "Thank you guys.",
            "Fuck you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Welcome to the final lecture of yourself.",
                    "label": 0
                },
                {
                    "sent": "Stephen days.",
                    "label": 0
                },
                {
                    "sent": "The whole week was very full of very exciting lectures and events, so the final speaker is Professor Tony will from Dublin.",
                    "label": 0
                },
                {
                    "sent": "He is into computational creativity research.",
                    "label": 0
                },
                {
                    "sent": "His he started his research career with a PhD in Dublin from Trinity College.",
                    "label": 0
                },
                {
                    "sent": "It was about the subject of creative language processing.",
                    "label": 0
                },
                {
                    "sent": "Then he was partially in academia, partially in industry including Cycorp Corporation, where some of our colleagues know very well about the psych ontology and there he did.",
                    "label": 0
                },
                {
                    "sent": "Some reasoning tools for that.",
                    "label": 0
                },
                {
                    "sent": "Nowadays he's professor at University College Dublin.",
                    "label": 0
                },
                {
                    "sent": "And his research area is computational creativity.",
                    "label": 0
                },
                {
                    "sent": "We were part of two projects together with Tony.",
                    "label": 0
                },
                {
                    "sent": "One was pro Seco concerted action, where Tony was coordinator.",
                    "label": 0
                },
                {
                    "sent": "The other one was swim the what if machine where we both contributed to that kind of research?",
                    "label": 0
                },
                {
                    "sent": "Tony is very well known for his work in computational creativity.",
                    "label": 0
                },
                {
                    "sent": "He wrote more than 100 research papers.",
                    "label": 0
                },
                {
                    "sent": "He wrote several books, some in comics form, and today's lectures will be in comics form, so this is slightly unusual, but I'm sure you will enjoy it a lot.",
                    "label": 0
                },
                {
                    "sent": "His book, in 2012 Exploding the Creativity Myths, the computational foundations of linguistic creativity.",
                    "label": 0
                },
                {
                    "sent": "Then he's very much interested in metaphors.",
                    "label": 0
                },
                {
                    "sent": "Automatic metaphor creation simile, analogy, blending and irony.",
                    "label": 0
                },
                {
                    "sent": "There is a forthcoming book in this year about Twitter bots, and he will tell you more about it.",
                    "label": 0
                },
                {
                    "sent": "And of course he was very active and still is active in the Association of Computational Creativity.",
                    "label": 0
                },
                {
                    "sent": "He organized international Conference on Computational Creativity in Dublin, and while he performs in.",
                    "label": 0
                },
                {
                    "sent": "Summer schools on computational creativity.",
                    "label": 0
                },
                {
                    "sent": "So we're very much forward looking forward to your lecture.",
                    "label": 0
                },
                {
                    "sent": "Thank you, Nora.",
                    "label": 0
                },
                {
                    "sent": "I'm delighted to be here.",
                    "label": 0
                },
                {
                    "sent": "Thank you for inviting me.",
                    "label": 0
                },
                {
                    "sent": "So it was great to be in Ljubljana.",
                    "label": 0
                },
                {
                    "sent": "It's a lovely city and thanks for coming to listen to me today.",
                    "label": 0
                },
                {
                    "sent": "I want to talk about humor because humor is one of the capacities that we humans have that demonstrate our everyday creativity.",
                    "label": 0
                },
                {
                    "sent": "We think of creativity sometimes as being the preserve of special people, but everyone has a sense of humor and we're all creative in a lower level way when it comes to humor.",
                    "label": 0
                },
                {
                    "sent": "And I think the goal of computational creativity is not to try to replicate the creativity of geniuses, but to replicate the creativity of all of us in a way that we can create conversational and collaborative partners to make us more creative.",
                    "label": 0
                },
                {
                    "sent": "Computational creativity is about creating creative partners that make the human in the partnership more creative, too.",
                    "label": 0
                },
                {
                    "sent": "It's about adding more creativity to the world.",
                    "label": 0
                },
                {
                    "sent": "I want to talk about humor because I love humor.",
                    "label": 0
                },
                {
                    "sent": "And jokes are really a kind of perverted metapher.",
                    "label": 0
                },
                {
                    "sent": "So I got into joke analysis and joke generation because I was interested in the conditions under which metaphors became silly while still being informative.",
                    "label": 0
                },
                {
                    "sent": "OK, so I'm going to talk about building a sense of humor from the point of view of a machine.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And give you some examples of popular culture.",
                    "label": 0
                },
                {
                    "sent": "This is K2 SL from the film Rogue One in 2016.",
                    "label": 0
                },
                {
                    "sent": "I think he's the best Star Wars robot because he's the only one with a sense of humor.",
                    "label": 0
                },
                {
                    "sent": "We can presuppose that R2 has a sense of humor.",
                    "label": 0
                },
                {
                    "sent": "We don't really know what he's saying, but K2 or so sounds like a really sarcastic human.",
                    "label": 0
                },
                {
                    "sent": "The kind of person that you work with, perhaps, and that you enjoyed our humor, but at the same time you find them very difficult people.",
                    "label": 0
                },
                {
                    "sent": "So here's a couple of examples from the movie that is a bad idea, but what do I know?",
                    "label": 0
                },
                {
                    "sent": "My specialty is only strategic analysis, so that's passive aggressive.",
                    "label": 1
                },
                {
                    "sent": "There's a problem on the horizon.",
                    "label": 0
                },
                {
                    "sent": "There is no horizon.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's a navigating joke.",
                    "label": 0
                },
                {
                    "sent": "Two of the characters are meant to blend in as spies and steal something and get out without anyone noticing.",
                    "label": 0
                },
                {
                    "sent": "But of course there's huge explosions and people dying, and he says there were a lot of explosions for two people blending in, so he's kind of difficult, but he expresses this frustration through humor, and he becomes a good team player.",
                    "label": 0
                },
                {
                    "sent": "And we're very sad to see what happens to him at the end.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An interesting thing about K2S oh is that in the film he actually works for the empire.",
                    "label": 0
                },
                {
                    "sent": "He's an Imperial battle Droid and he's been reprogrammed by the rebellion, right?",
                    "label": 0
                },
                {
                    "sent": "So they've taken something that was programmed to kill them and turned it into a collaborator.",
                    "label": 0
                },
                {
                    "sent": "We're told the character Cassion did this, but he didn't reprogram the robot completely, he just changed the programming of the robot.",
                    "label": 0
                },
                {
                    "sent": "So on the right here, this is my version of a conceptual blending diagram.",
                    "label": 0
                },
                {
                    "sent": "We have.",
                    "label": 0
                },
                {
                    "sent": "What an Imperial battle Droid is probably meant to be.",
                    "label": 0
                },
                {
                    "sent": "Aggressive, ruthless, direct, no nonsense, right?",
                    "label": 0
                },
                {
                    "sent": "And on the left we have something like C3 PEO passive, helpful, informative, and what the characters in the film did was they took something from the right.",
                    "label": 0
                },
                {
                    "sent": "And they imposed onto it passivity.",
                    "label": 0
                },
                {
                    "sent": "Informativeness and a sense of teamwork and what you end up getting in the blend of course is passive aggressiveness.",
                    "label": 0
                },
                {
                    "sent": "The physical aggressiveness of killing the enemy is now turned into passive aggressiveness, where language is used to verbally attack the people that he works with.",
                    "label": 0
                },
                {
                    "sent": "So he is not designed to be humorous.",
                    "label": 0
                },
                {
                    "sent": "This is my point, no one decided to give this guy a sense of humor.",
                    "label": 0
                },
                {
                    "sent": "What happened is that his sense of humor emerged out of other characteristics, and that is what makes humans so difficult.",
                    "label": 0
                },
                {
                    "sent": "We do not evolve a sense of humor.",
                    "label": 0
                },
                {
                    "sent": "Humor is an emergent phenomenon that comes out of order.",
                    "label": 0
                },
                {
                    "sent": "Faculties that we have for teamwork and socialization and for problem solving.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another example from popular culture, which I really like is the robot tars from Interstellar 2014.",
                    "label": 0
                },
                {
                    "sent": "One of my favorite films.",
                    "label": 0
                },
                {
                    "sent": "Now the robot looks like a big slab.",
                    "label": 0
                },
                {
                    "sent": "And it's a reference to the Monolith in 2001, this film.",
                    "label": 0
                },
                {
                    "sent": "Is an homage to Kubrick's 1968 movie, Not Ours has a somewhat nicer sense of humor than K2S.",
                    "label": 0
                },
                {
                    "sent": "Oh, but he's still very sarcastic and at one stage Cooper the astronaut when he finds out that Taurus has a sense of humor, he says.",
                    "label": 0
                },
                {
                    "sent": "A giant sarcastic robot.",
                    "label": 0
                },
                {
                    "sent": "What a great idea.",
                    "label": 0
                },
                {
                    "sent": "So he shows that he's sarcastic to Antorus is very very witty.",
                    "label": 0
                },
                {
                    "sent": "I mean, he suggests at one stage that he's going to take the humans and turn them into slaves for his robot colony and so forth, and he tells them I'll put on Aculight.",
                    "label": 0
                },
                {
                    "sent": "If you don't know when I'm joking.",
                    "label": 0
                },
                {
                    "sent": "Which is also sarcastic, and then when he tells jokes, the light comes on.",
                    "label": 0
                },
                {
                    "sent": "So he's aware of his own sense of humor.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in fact, later in the film when he's being repaired.",
                    "label": 0
                },
                {
                    "sent": "We find out that he's highly parameterized Cooper size.",
                    "label": 0
                },
                {
                    "sent": "I want you to set your honesty to 95%, which means, don't be absolutely honest, because absolute honesty can be hurtful.",
                    "label": 0
                },
                {
                    "sent": "He says.",
                    "label": 0
                },
                {
                    "sent": "Confirmed make, set your humor to 75% and he says confirmed self destruct sequence in ten T -- 10 Nine 8.",
                    "label": 0
                },
                {
                    "sent": "So he's joking about having a sense of humor by pretending to be in self destruct mode.",
                    "label": 0
                },
                {
                    "sent": "So Cooper says, let's make that 60%.",
                    "label": 0
                },
                {
                    "sent": "And he responds with a lower quality joke.",
                    "label": 0
                },
                {
                    "sent": "He says, knock, knock.",
                    "label": 0
                },
                {
                    "sent": "So he's aware that 1975% is associated with a sophisticated sense of humor and 60% is associated with childlike humor.",
                    "label": 0
                },
                {
                    "sent": "And he's making fun of that.",
                    "label": 0
                },
                {
                    "sent": "So he has a meta model of what it is to have a sense of humor.",
                    "label": 0
                },
                {
                    "sent": "He isn't just using humorous statements, he understands fundamentally what it is to be humorous in the movie.",
                    "label": 0
                },
                {
                    "sent": "He's an old robot and the newer robots case.",
                    "label": 0
                },
                {
                    "sent": "And Kip have faster processors but they are not funny.",
                    "label": 0
                },
                {
                    "sent": "Why is stars funny?",
                    "label": 0
                },
                {
                    "sent": "Becausw humor is not about processing speed, it's about experience of the world and this old robot has seen a lot.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's talk about a real robot, Alexa.",
                    "label": 0
                },
                {
                    "sent": "Amazon's Echo with the Alexa interface, you might have noticed recently that there are stories about Alexa laughing inappropriately.",
                    "label": 0
                },
                {
                    "sent": "Which is kind of creepy.",
                    "label": 0
                },
                {
                    "sent": "It's nighttime and you're sitting at home with your wife and you say, Alexa, turn on the lights and Alexa goes.",
                    "label": 0
                },
                {
                    "sent": "And then you say Alexa, turn on the lights and she goes.",
                    "label": 0
                },
                {
                    "sent": "And then you say Alexa, for goodness sake, turn on the lights and she goes he.",
                    "label": 0
                },
                {
                    "sent": "But the lights don't come on.",
                    "label": 0
                },
                {
                    "sent": "That is kind of frightening, right?",
                    "label": 0
                },
                {
                    "sent": "Because you don't know what Alexa is going to do.",
                    "label": 0
                },
                {
                    "sent": "Maybe she'll shut all the doors, turn the heating off, freezing to death.",
                    "label": 0
                },
                {
                    "sent": "So Alexa doesn't have a sense of humor, but she has a program for when to laugh and because she doesn't have a sense of humor, the program for laughing is not very accurate and she laughs inappropriately.",
                    "label": 0
                },
                {
                    "sent": "And her laugh isn't very attractive.",
                    "label": 0
                },
                {
                    "sent": "It's kind of creepy.",
                    "label": 0
                },
                {
                    "sent": "So you can say, Alexa.",
                    "label": 0
                },
                {
                    "sent": "Please laugh and you'll get the that's not interesting.",
                    "label": 0
                },
                {
                    "sent": "It's not a real laugh, it's not.",
                    "label": 0
                },
                {
                    "sent": "It's like it's not a real smile when human smile fakely, you can tell from your eyes that they don't mean it and she doesn't mean it.",
                    "label": 0
                },
                {
                    "sent": "'cause she doesn't really have a sense of humor.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "What does it mean for a human to have a sense of humor?",
                    "label": 0
                },
                {
                    "sent": "Well, let's take some software.",
                    "label": 0
                },
                {
                    "sent": "Analyze words which analyzes peoples personality on Twitter as exhibited in their text and see what a funny account on Twitter looks like when analyzed.",
                    "label": 0
                },
                {
                    "sent": "This is funny one liners someone collects all of these favorite jokes and just tweets them.",
                    "label": 0
                },
                {
                    "sent": "So this account is just constant comedy.",
                    "label": 0
                },
                {
                    "sent": "And if we look at the analyzed words profile, this comes out of the Texas group James Pennebaker and his team who came up with the LIWC.",
                    "label": 0
                },
                {
                    "sent": "We find that the humor, the personality behind all of these collective jokes tends to be downbeat.",
                    "label": 0
                },
                {
                    "sent": "Moderately angry, not angry, but quite depressed.",
                    "label": 0
                },
                {
                    "sent": "Personable, personable is defined by Pennebaker to be equivocal when you're not stridently telling people what to think, but you're saying I could be right.",
                    "label": 0
                },
                {
                    "sent": "I could be wrong.",
                    "label": 0
                },
                {
                    "sent": "You're opening the possibility of being wrong.",
                    "label": 0
                },
                {
                    "sent": "Not at all arrogant.",
                    "label": 0
                },
                {
                    "sent": "Quite analytic and very much in touch with one's feelings right now.",
                    "label": 0
                },
                {
                    "sent": "This is a personality of its self deprecating person who sees the world is full of problems and goes.",
                    "label": 0
                },
                {
                    "sent": "What are you going to do?",
                    "label": 0
                },
                {
                    "sent": "Look at this, that's a classic form of humor, but comedians don't all have the same sense of humor, right?",
                    "label": 0
                },
                {
                    "sent": "Somewhere, argant, some are personable, summer upbeat, some more neurotic, right kind of Woody Allen style.",
                    "label": 0
                },
                {
                    "sent": "So can we learn anything at all from human personality to build a computer personality that's funny?",
                    "label": 0
                },
                {
                    "sent": "And you might think this isn't very useful.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One of my students and I we've built a neural sarcasm detector.",
                    "label": 0
                },
                {
                    "sent": "It's a neural model, which means there's a lot of black magic.",
                    "label": 0
                },
                {
                    "sent": "You just hook up lots of different components, convolution layers, pooling layers, recurrent neural networks and LST EMS, and you just feed in a network or a vector representation of a tweet, and it tells you whether it thinks the tweeters sarcastic or not.",
                    "label": 0
                },
                {
                    "sent": "We found that we got a significant statistically significant.",
                    "label": 0
                },
                {
                    "sent": "Increase in performance when we fed in the personality analysis of the person who was writing the tweet.",
                    "label": 0
                },
                {
                    "sent": "So if the tweet came from Realdonaldtrump then we would analyze his personality.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Using analyze words at the moment the tweet was generated and the analyzed words profile is built from the last 100 tweets and by.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Eating in that personality, the system can better detect whether a Twitter sarcastic or not, because we all know people who are very sarcastic.",
                    "label": 0
                },
                {
                    "sent": "We say they have a sarcastic personality.",
                    "label": 0
                },
                {
                    "sent": "Now, if you're in a bad mood, if you're in a sarcastic mood, your tweets are more likely to be sarcastic.",
                    "label": 0
                },
                {
                    "sent": "So personality does count.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But how?",
                    "label": 0
                },
                {
                    "sent": "How should we model humor?",
                    "label": 0
                },
                {
                    "sent": "I've been talking about humor now for 10 minutes, but I didn't tell you what.",
                    "label": 0
                },
                {
                    "sent": "How to define humor.",
                    "label": 0
                },
                {
                    "sent": "Can anyone give me a definition of what it is to be humorous?",
                    "label": 0
                },
                {
                    "sent": "And don't use a synonym like, funny.",
                    "label": 0
                },
                {
                    "sent": "What is humor?",
                    "label": 0
                },
                {
                    "sent": "They theories of humor that we work with and humor studies and which have been around for hundreds of years.",
                    "label": 0
                },
                {
                    "sent": "People find out a very funny phrase.",
                    "label": 0
                },
                {
                    "sent": "Humor studies.",
                    "label": 0
                },
                {
                    "sent": "They must think you guys have great fun studying humor all day.",
                    "label": 0
                },
                {
                    "sent": "Let me tell you, it's not fun.",
                    "label": 0
                },
                {
                    "sent": "The jokes are as old as as ancient bread and just tasty people analyze simple jokes because no one disagrees about their meaning.",
                    "label": 0
                },
                {
                    "sent": "But after a while, everyone forgets what a joke is funny.",
                    "label": 0
                },
                {
                    "sent": "But the basic theory behind humor is that it is a form of incongruity.",
                    "label": 0
                },
                {
                    "sent": "Incongruity is.",
                    "label": 0
                },
                {
                    "sent": "A sudden realization that the world is not as it should be.",
                    "label": 0
                },
                {
                    "sent": "OK, so you come to work and you look down and you realize that you're wearing two different shoes.",
                    "label": 0
                },
                {
                    "sent": "How did that happen right?",
                    "label": 0
                },
                {
                    "sent": "Or your car keys aren't where you left them.",
                    "label": 0
                },
                {
                    "sent": "Right or you wake up and you're not at home and you're in some strange bedroom you go.",
                    "label": 0
                },
                {
                    "sent": "What's going on?",
                    "label": 0
                },
                {
                    "sent": "That's incongruity right now.",
                    "label": 0
                },
                {
                    "sent": "There are all sorts of incongruities in the world.",
                    "label": 0
                },
                {
                    "sent": "You order pizza and the waiter brings you lasagna.",
                    "label": 0
                },
                {
                    "sent": "That's incongruous.",
                    "label": 0
                },
                {
                    "sent": "But not all incongruity is funny, is it?",
                    "label": 0
                },
                {
                    "sent": "So what makes incongruity funny?",
                    "label": 0
                },
                {
                    "sent": "While there are, there are two minimal criteria.",
                    "label": 0
                },
                {
                    "sent": "One is the incongruity must be resolve aghbal, which means that you must be able to understand why the incongruity arose.",
                    "label": 0
                },
                {
                    "sent": "So, we call humor.",
                    "label": 0
                },
                {
                    "sent": "An act of incongruity resolution and that view goes back all the way to a manual count.",
                    "label": 0
                },
                {
                    "sent": "Who said that humor arises when we are faced with a conceptual dilemma and by thinking about it, the dilemma disappears into nothingness under relief and joy that that gives us causes humor.",
                    "label": 0
                },
                {
                    "sent": "It's kind of a steroid theory.",
                    "label": 0
                },
                {
                    "sent": "I think you find, but it's a very useful one.",
                    "label": 0
                },
                {
                    "sent": "The idea actually goes back to a Scottish philosopher named James BC, who came up with it earlier, but everyone credits can't.",
                    "label": 0
                },
                {
                    "sent": "And everyone since has been talking about incongruity resolution.",
                    "label": 0
                },
                {
                    "sent": "And you probably came across a lot of incongruity.",
                    "label": 0
                },
                {
                    "sent": "If you grew up like me watching Star Trek, right?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or this TV show lost in space?",
                    "label": 0
                },
                {
                    "sent": "Do anyone ever see this?",
                    "label": 0
                },
                {
                    "sent": "You're probably too young.",
                    "label": 0
                },
                {
                    "sent": "You seen it.",
                    "label": 0
                },
                {
                    "sent": "I used to watch this every Saturday and when I watched it, it was old when I watched it, I should say we had this robot B9.",
                    "label": 0
                },
                {
                    "sent": "His name was B9 or as a benign and his creator Professor Smith Smith was a wicked selfish man and he was always trying to get the robot to be part of his schemes.",
                    "label": 0
                },
                {
                    "sent": "But the robot was always reporting him to the rest of the family or saying does not compute, does not compute, and in fact this is the TV show where we get this phrase from.",
                    "label": 0
                },
                {
                    "sent": "Whenever you hear people talking about computers saying does not compute, it comes from this TV show.",
                    "label": 0
                },
                {
                    "sent": "Now the comedy comes.",
                    "label": 0
                },
                {
                    "sent": "This was quite a funny show.",
                    "label": 0
                },
                {
                    "sent": "The robot is very rigid, not humorous at all and Smith is.",
                    "label": 0
                },
                {
                    "sent": "Not particularly funny either, but he's wicked and the combination of the two of them, his frustrations caused by the robot and his reaction to the robot by saying you, bubu, idiot dismantle you for this is quite funny and lots of comedy acts work this way.",
                    "label": 0
                },
                {
                    "sent": "We have a very literal minded straight man and we have what is sometimes called the banana man or the comedian.",
                    "label": 0
                },
                {
                    "sent": "So Jerry Lewis and Dean Martin, lots of comedy Jewelers work where you don't have two very funny people.",
                    "label": 0
                },
                {
                    "sent": "You have a very serious person who represents us and then you have the clown.",
                    "label": 0
                },
                {
                    "sent": "Who represents chaos and it's the connection between the two that creates the humor.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'll give you an example of incongruity from Star Trek and the early Star Trek.",
                    "label": 0
                },
                {
                    "sent": "The enterprise crew were always meeting supercomputers with evil intent and Kirk always destroyed them by getting contemplate a contradiction.",
                    "label": 0
                },
                {
                    "sent": "Now we know that computers don't work this way, don't we?",
                    "label": 0
                },
                {
                    "sent": "When the computer gets a contradiction, it throws a Java exception or it says does not compute, but it certainly doesn't go.",
                    "label": 0
                },
                {
                    "sent": "I must destroy myself, which is what was what happened in Star Trek.",
                    "label": 0
                },
                {
                    "sent": "So here Kirk gets this robot, which is actually like a flying teapot.",
                    "label": 0
                },
                {
                    "sent": "You can even see the wire in the TV show.",
                    "label": 0
                },
                {
                    "sent": "I am Kirk, the creator.",
                    "label": 0
                },
                {
                    "sent": "You order creator, you're wrong.",
                    "label": 0
                },
                {
                    "sent": "Jackson Roy Kirk, your creator is dead.",
                    "label": 0
                },
                {
                    "sent": "You have mistaken me for him.",
                    "label": 0
                },
                {
                    "sent": "You are an error error, error.",
                    "label": 0
                },
                {
                    "sent": "You did not discover your mistake.",
                    "label": 0
                },
                {
                    "sent": "You made two errors.",
                    "label": 0
                },
                {
                    "sent": "Error, error examined, it explodes.",
                    "label": 1
                },
                {
                    "sent": "And he does this about five times over the tree.",
                    "label": 0
                },
                {
                    "sent": "Star Trek series.",
                    "label": 0
                },
                {
                    "sent": "Clearly this is a false model of how computers handle incongruity.",
                    "label": 0
                },
                {
                    "sent": "So if we think that incongruity is the basis of humor, TV shows, too.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Plus that computers cannot handle incongruity and therefore cannot be humorous.",
                    "label": 0
                },
                {
                    "sent": "But that is wrong.",
                    "label": 0
                },
                {
                    "sent": "I hope you'll agree with me by the end of this lecture that that is wrong.",
                    "label": 0
                },
                {
                    "sent": "Humor, by the way, is probably the hardest thing that will ever give a computer everything else.",
                    "label": 0
                },
                {
                    "sent": "Making them drive around on their own, making them do shopping for us, making them write letters and books for us.",
                    "label": 0
                },
                {
                    "sent": "Easy compared to giving them a sense of humor.",
                    "label": 0
                },
                {
                    "sent": "The sense of humor is the pinnacle of human development.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK so I should say that.",
                    "label": 0
                },
                {
                    "sent": "Having said those high minded words, most computer models of humor focus on the most ridiculous and annoying form of humor.",
                    "label": 0
                },
                {
                    "sent": "The pun now can anyone think of a form of humor that people actually apologize for when they do it accidentally?",
                    "label": 0
                },
                {
                    "sent": "It's the pod.",
                    "label": 0
                },
                {
                    "sent": "Have you ever had someone say?",
                    "label": 0
                },
                {
                    "sent": "Pardon the pun or excuse the pun.",
                    "label": 0
                },
                {
                    "sent": "We are so embarrassed by this form of humor that when we do it accidentally we apologize.",
                    "label": 0
                },
                {
                    "sent": "Abjectly I please excuse the pun.",
                    "label": 0
                },
                {
                    "sent": "I didn't mean it, but computers are very good at puns and early work in the 90s by Graeme Ritchie and his students showed that computers could develop or generate novel puns that schoolchildren would find just as funny as the puns that were published in official Joke Books and in Christmas crackers.",
                    "label": 0
                },
                {
                    "sent": "That's a really lower level.",
                    "label": 0
                },
                {
                    "sent": "Right, what do you say?",
                    "label": 0
                },
                {
                    "sent": "What do you call?",
                    "label": 0
                },
                {
                    "sent": "A murderer who eats corn flakes for breakfast.",
                    "label": 0
                },
                {
                    "sent": "A serial killer problem, right?",
                    "label": 0
                },
                {
                    "sent": "Quickly move on past up now.",
                    "label": 0
                },
                {
                    "sent": "Why should?",
                    "label": 0
                },
                {
                    "sent": "If anyone?",
                    "label": 0
                },
                {
                    "sent": "If any of you are here because you came to see the Nobel laureate talk about physics, you might think why does anyone care about giving computers a sense of humor?",
                    "label": 0
                },
                {
                    "sent": "Well, there was a fundamental relationship between scientific creativity and humor.",
                    "label": 0
                },
                {
                    "sent": "Isaac Asimov famously said, and I think very truly said the most exciting phrase to hear in science, the one that heralds new discoveries, is not Eureka.",
                    "label": 0
                },
                {
                    "sent": "Archimedes, jumping naked out of his bat and running down the streets of Syracuse because he just discovered a way of calculating the density of gold and thereby saved his head from being chopped off.",
                    "label": 0
                },
                {
                    "sent": "Eureka, the Greek.",
                    "label": 0
                },
                {
                    "sent": "For I discover it's also the basis for the computer science word heuristic.",
                    "label": 0
                },
                {
                    "sent": "It is not Eureka, that's the myth about science.",
                    "label": 0
                },
                {
                    "sent": "According to Asimov, the most exciting phrase in science, the one that says, I'm on the verge of a big discovery.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is that funny?",
                    "label": 0
                },
                {
                    "sent": "Right, the data does not meet your expectations.",
                    "label": 0
                },
                {
                    "sent": "Kepler was looking at T. Cobra has data for the orbit of Mars for decades.",
                    "label": 0
                },
                {
                    "sent": "He expected to solve the problem and weeks he could not figure out why the hell Mars was moving the way it did.",
                    "label": 0
                },
                {
                    "sent": "Eventually, he realized his Kepler's law that the planet was moving in an ellipse and he said water dirty bird.",
                    "label": 0
                },
                {
                    "sent": "I was.",
                    "label": 0
                },
                {
                    "sent": "He wasn't a very funny person, but you can see that he could see this sense that there's something funny here.",
                    "label": 0
                },
                {
                    "sent": "And it took him 20 years to get the joke.",
                    "label": 0
                },
                {
                    "sent": "But most scientists, when they see something odd, this doesn't right?",
                    "label": 0
                },
                {
                    "sent": "Consider dark matter.",
                    "label": 0
                },
                {
                    "sent": "What the hell is up with the universe where most of the matter that seems to be needed to create gravitational forces that we observe is not observable?",
                    "label": 0
                },
                {
                    "sent": "Q discovery of dark matter, so that's unusual.",
                    "label": 0
                },
                {
                    "sent": "That's funny.",
                    "label": 0
                },
                {
                    "sent": "That's the foundation for scientific curiosity.",
                    "label": 0
                },
                {
                    "sent": "Some people go in the direction of jokes.",
                    "label": 0
                },
                {
                    "sent": "Some people go in the direction of theorems and scientific progress, but the foundational ideas are the same incongruity Spurs curiosity, which creates either humor or science, or both.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, does anyone recognize this guy?",
                    "label": 0
                },
                {
                    "sent": "This is a very local thing.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "This character's name is Victor Meldrew from a TV show called 1 Foot in The Grave.",
                    "label": 0
                },
                {
                    "sent": "He's an angry old man and bad things happen to him all the time.",
                    "label": 0
                },
                {
                    "sent": "For instance, he's always cutting a loaf of bread and he finds something hairy in the bread and he pulls it out.",
                    "label": 0
                },
                {
                    "sent": "And it's a man's wig, right?",
                    "label": 0
                },
                {
                    "sent": "Or he's eating fish and chips and he finds something that doesn't look like a chip.",
                    "label": 0
                },
                {
                    "sent": "And it turns out to be a man's pinky finger.",
                    "label": 0
                },
                {
                    "sent": "Now these are very these are incongruities, right?",
                    "label": 0
                },
                {
                    "sent": "I hope it never happens to anyone of you, but it's not a funny incongruity until Victor says his catch phrase, Victor is very famous for his catch phrase.",
                    "label": 0
                },
                {
                    "sent": "He looks at the incongruity.",
                    "label": 0
                },
                {
                    "sent": "And he says, I don't believe it.",
                    "label": 0
                },
                {
                    "sent": "And that's the point at which everyone loves.",
                    "label": 0
                },
                {
                    "sent": "Now, why is it that we need him to say his catch phrase before the incongruity becomes funny?",
                    "label": 0
                },
                {
                    "sent": "Let me ask you another question.",
                    "label": 0
                },
                {
                    "sent": "Supposing you're sitting in this room on your own one night, just studying, catching up with email, and that Clock falls off the wall.",
                    "label": 0
                },
                {
                    "sent": "Ducks in Congress, right?",
                    "label": 0
                },
                {
                    "sent": "Clocks aren't supposed to do that.",
                    "label": 0
                },
                {
                    "sent": "But you understand that maybe the nail was rusty or something.",
                    "label": 0
                },
                {
                    "sent": "Now it's not funny when the Clock falls off the wall and you're here on your own.",
                    "label": 0
                },
                {
                    "sent": "It's just weird, right?",
                    "label": 0
                },
                {
                    "sent": "Now, supposing you're here with friends, you're having a study group and the Clock falls off the wall.",
                    "label": 0
                },
                {
                    "sent": "Is it funny then?",
                    "label": 0
                },
                {
                    "sent": "Yes, you'd laugh, right?",
                    "label": 0
                },
                {
                    "sent": "Now, why is it that the incongruity is funny when there are multiple people and it's not funny when they are not?",
                    "label": 0
                },
                {
                    "sent": "There's only one because humans are social phenomenon and it requires what psychologists call theory of mind.",
                    "label": 0
                },
                {
                    "sent": "TM theory of mind is this faculty that children develop around two years where they can imagine what is inside someone else's head.",
                    "label": 0
                },
                {
                    "sent": "It's a fundamental part of human cognition.",
                    "label": 0
                },
                {
                    "sent": "Right, and psychologists do experiments with children where they, the children, see two people playing with a toy and one of them puts the toy in the box and the other child leaves.",
                    "label": 0
                },
                {
                    "sent": "And when the other child leaves, the first child takes a toy out of the box and hides it behind the curtains.",
                    "label": 0
                },
                {
                    "sent": "And when the second child comes back the test subject, a young child is asked where will he look for the toy?",
                    "label": 0
                },
                {
                    "sent": "Now children, about one years old will indicate that he will look for the toy in the box becausw already that he will look for the toy behind the curtain, because that's the last place you saw the toy being put.",
                    "label": 0
                },
                {
                    "sent": "But children about two or three years of age will say he will look in the box because that's the last place he saw the toy right?",
                    "label": 0
                },
                {
                    "sent": "So being able to put yourself into other peoples minds and seeing the world through their limited access to facts is called theory of mind and humor.",
                    "label": 0
                },
                {
                    "sent": "Is all about seeing the incongruity through the minds of other people and imagining how they react?",
                    "label": 0
                },
                {
                    "sent": "So, Victor, I don't believe it.",
                    "label": 0
                },
                {
                    "sent": "His frustration is humorous to us because we can step into his mind and see how he reacts.",
                    "label": 0
                },
                {
                    "sent": "But what out?",
                    "label": 0
                },
                {
                    "sent": "This catalyzing agent of the other person without the theory of mind component.",
                    "label": 0
                },
                {
                    "sent": "Irresolvable incongruity is not funny.",
                    "label": 0
                },
                {
                    "sent": "This makes it difficult for humans for machines to be humorous because they don't really have theories of mind or socialization skills.",
                    "label": 0
                },
                {
                    "sent": "I would say that humor becomes incongruity becomes funny at human scale.",
                    "label": 0
                },
                {
                    "sent": "When it becomes about humans and we see it through the eyes of humans.",
                    "label": 0
                },
                {
                    "sent": "Incongruity and its resolution become funny.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it's also to do with.",
                    "label": 0
                },
                {
                    "sent": "Imagining.",
                    "label": 0
                },
                {
                    "sent": "How it feels to be powerful until lose power or to be powerless and to suddenly momentarily be quite powerful, right?",
                    "label": 0
                },
                {
                    "sent": "So lots of jokes.",
                    "label": 0
                },
                {
                    "sent": "Cut the legs from under pompous people and they elevate the week over the strong momentarily, and that's a very primal force to us.",
                    "label": 0
                },
                {
                    "sent": "Humor is a great equalizer.",
                    "label": 0
                },
                {
                    "sent": "There's a certain form of humor called superiority humor where we laugh at disabled people and so forth is a disgusting kind of humor and in fact.",
                    "label": 0
                },
                {
                    "sent": "Are Stottle says that that's how humor works, that we laugh at the deformed and the weekends, or we do not.",
                    "label": 0
                },
                {
                    "sent": "I mean, some people do, but there are broken people.",
                    "label": 0
                },
                {
                    "sent": "We laugh when the week are made powerful, when the incongruency is felt at human scale and social relations are temporarily upended.",
                    "label": 0
                },
                {
                    "sent": "OK, very important dimension when you're modeling humor, you have to put aside the ugliness of some of the early theories.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'll tell you a joke to show you an incongruity.",
                    "label": 0
                },
                {
                    "sent": "This is an Irish joke.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you've been to Dublin the Guinness factory in Dublin has the biggest beer VAT.",
                    "label": 0
                },
                {
                    "sent": "It's like a big swimming pool of beer in the world because they produced the world's largest amount of Guinness, and you go do a tour of it and you'll see people with Nets.",
                    "label": 0
                },
                {
                    "sent": "Cleaning the beer because you know things fall in from the roof, kind of bird droppings and cigarette butts, and birds.",
                    "label": 0
                },
                {
                    "sent": "Drop twigs and seeds.",
                    "label": 0
                },
                {
                    "sent": "And people have to clean out the beer 'cause it's a good beer.",
                    "label": 0
                },
                {
                    "sent": "You want good quality beer and one day one of the guys with the next falls in trash is about.",
                    "label": 0
                },
                {
                    "sent": "The cut a Long story short, he drowns.",
                    "label": 0
                },
                {
                    "sent": "It's a tragedy and the manager of the factory says Oh no, that's Paddy.",
                    "label": 0
                },
                {
                    "sent": "His wife just had a baby she would be devastated.",
                    "label": 0
                },
                {
                    "sent": "I better go around and tell her.",
                    "label": 0
                },
                {
                    "sent": "So he goes around to Patty's house and Mary the wife opens the door and she's got the baby in her arms.",
                    "label": 0
                },
                {
                    "sent": "Hello Tom, how is Paddy?",
                    "label": 0
                },
                {
                    "sent": "Tom says if you can see his face he's devastated and she starts crying.",
                    "label": 0
                },
                {
                    "sent": "No no padding is dead isn't he?",
                    "label": 0
                },
                {
                    "sent": "And Tom says yes, I'm afraid he is married.",
                    "label": 0
                },
                {
                    "sent": "He fell into the beer.",
                    "label": 0
                },
                {
                    "sent": "At work.",
                    "label": 0
                },
                {
                    "sent": "And to cut a Long story short, he drowned.",
                    "label": 0
                },
                {
                    "sent": "She's devastated, she's crying, she's scratching at the door.",
                    "label": 0
                },
                {
                    "sent": "And then, she says, give me some comfort.",
                    "label": 0
                },
                {
                    "sent": "Give me some comfort, tell me it was a quick death.",
                    "label": 0
                },
                {
                    "sent": "And Tom shakes his head and goes.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry Mary.",
                    "label": 0
                },
                {
                    "sent": "I wish I could, but the fact is Paddy got out twice to use the toilet.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is what happens when an Irishman falls into beer.",
                    "label": 0
                },
                {
                    "sent": "He trans, but he trans happily after along along fights, right?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is the theories of humor that are dominant at the moment.",
                    "label": 0
                },
                {
                    "sent": "The general theory of verbal humor GTH, which has its roots in the semantic script theory of humor, by Victor Raskin from 1985.",
                    "label": 0
                },
                {
                    "sent": "Our AI theories, raskins STH, says that a joke is.",
                    "label": 0
                },
                {
                    "sent": "Partially compatible with two different scripts.",
                    "label": 0
                },
                {
                    "sent": "You hear the text of the joke.",
                    "label": 0
                },
                {
                    "sent": "And you activate in your mind just xiangqi and schematic script.",
                    "label": 0
                },
                {
                    "sent": "But you get to a point in the joke where the script doesn't fit anymore and you have an incongruity.",
                    "label": 0
                },
                {
                    "sent": "Oh my God, I've actually misunderstood what's happening.",
                    "label": 0
                },
                {
                    "sent": "And then the mind jumps to a second script.",
                    "label": 0
                },
                {
                    "sent": "And that second script resolves.",
                    "label": 0
                },
                {
                    "sent": "The incongruity partially resolves it because the joke is still silly, right?",
                    "label": 0
                },
                {
                    "sent": "We know that a man who fell into beer wouldn't really get out to use the toilet and then fall back in accidentally and do that twice.",
                    "label": 0
                },
                {
                    "sent": "But there's an exaggerated archetype of the Irishman there.",
                    "label": 0
                },
                {
                    "sent": "But this is actually the model.",
                    "label": 0
                },
                {
                    "sent": "You have two scripts.",
                    "label": 0
                },
                {
                    "sent": "One is dominant until you get to the punch line, and then you are forced to do a script switch or a frame switch.",
                    "label": 0
                },
                {
                    "sent": "And conceptual blending theory is called frame switching.",
                    "label": 0
                },
                {
                    "sent": "In frame shifting, an in humor theory it's called script switching, but the idea is that there are two scripts, one dominant, one minor and at the punchline.",
                    "label": 0
                },
                {
                    "sent": "The minor script becomes a dominant script, and there's a reversal of activation, so compelling theory, but we have in AI we don't really know how to model these scripts effectively, and how many there are.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "By the way, this cut up I drew scissors.",
                    "label": 0
                },
                {
                    "sent": "Here is a generalization of a technique that was developed by William S. Burroughs and Brian Geisen in the 60s called The Cut Up Method.",
                    "label": 0
                },
                {
                    "sent": "They would cut up poetry in newspapers and reassemble it randomly to get original new compositions, and it's a very prevalent technique.",
                    "label": 0
                },
                {
                    "sent": "I'm going to plug my new book here that Nada was mentioning myself and my cook have written a book with MIT press called Twitter Bots.",
                    "label": 0
                },
                {
                    "sent": "Making machines that make meaning.",
                    "label": 0
                },
                {
                    "sent": "It's a computational creativity book that is very practically oriented towards building Twitter, box autonomous creative agents that have their own Twitter accounts and tweet for you so you never have to use Twitter yourself.",
                    "label": 0
                },
                {
                    "sent": "I never use Twitter myself, but my machines are tweeting away all the time and getting me into trouble.",
                    "label": 0
                },
                {
                    "sent": "And I've been banned from Twitter several times.",
                    "label": 0
                },
                {
                    "sent": "Notice how to the guy who drew discover wasn't me.",
                    "label": 0
                },
                {
                    "sent": "They just quickly looked at the text and came up with this.",
                    "label": 0
                },
                {
                    "sent": "Robot legs birdhead you see the mixture of fonts looks like a blackmail note.",
                    "label": 0
                },
                {
                    "sent": "Making machines that make meaning.",
                    "label": 0
                },
                {
                    "sent": "That's the cut up technique.",
                    "label": 0
                },
                {
                    "sent": "It's a very intuitive and commonplace technique, and descriptive theory of humor where you slice and dice scripts to create an incongruity that you can resolve is the most common technique, and this suggests that, by the way I drew a robot, David Bowie there, because he was very famous for using the cut up technique as well, and he wrote some of his lyrics using the cut up technique like the spiders from Mars lyrics.",
                    "label": 0
                },
                {
                    "sent": "And in fact, he had a piece of software called of herbicides are written for him to help him do cutups.",
                    "label": 0
                },
                {
                    "sent": "There was no AI in there, was pure or what we call mere generation.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, this idea of cutting up and reusing old text.",
                    "label": 0
                },
                {
                    "sent": "It doesn't, doesn't please everybody.",
                    "label": 0
                },
                {
                    "sent": "Very famously, in 1946, George Orwell, a brilliant writer, but really.",
                    "label": 0
                },
                {
                    "sent": "Hectoring personality.",
                    "label": 0
                },
                {
                    "sent": "He famously said every joke is a tiny revolution against common sense and received wisdom, which I believe, but he also disagreed with this idea of reusing and cutting up familiar language.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "He said a good writer chooses his words carefully, but the world is full of lazy writers who are ruining English, he said.",
                    "label": 0
                },
                {
                    "sent": "You are not obliged to go to all this trouble.",
                    "label": 0
                },
                {
                    "sent": "You can shirk it by simply throwing your mind open and letting the ready made phrases come.",
                    "label": 0
                },
                {
                    "sent": "Crowding in.",
                    "label": 0
                },
                {
                    "sent": "They will construct your sentences for you, even think your thoughts for you.",
                    "label": 0
                },
                {
                    "sent": "He hated the idea of people using cliche and working with idioms and familiar language, when in fact that's one of the dominant models for getting computers to be creative with language is reusing familiar language and cutting it up in new ways.",
                    "label": 0
                },
                {
                    "sent": "So no to you, Mr. Orwell.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right here.",
                    "label": 0
                },
                {
                    "sent": "In fact, he's a bit like Big Brother.",
                    "label": 0
                },
                {
                    "sent": "If you read his work on his essays on language.",
                    "label": 0
                },
                {
                    "sent": "He doesn't sound like.",
                    "label": 0
                },
                {
                    "sent": "Winston Smith from 1984.",
                    "label": 0
                },
                {
                    "sent": "He sounds like O'Brien and he sounds like Big Brother fact.",
                    "label": 0
                },
                {
                    "sent": "He is what he hated in many ways.",
                    "label": 0
                },
                {
                    "sent": "He would say things like never use a metaphor or another figure of speech that you're used to seeing in print.",
                    "label": 0
                },
                {
                    "sent": "This is a very authoritarian view of language that is not supported by anyone who actually studies language professionally, and it leaves no room for the creativity of reuse.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'll give you an example.",
                    "label": 0
                },
                {
                    "sent": "There was a critic called William Empson of the same generation.",
                    "label": 0
                },
                {
                    "sent": "He wrote a book called Seven types of Ambiguity, and he famously criticized Orwell with this phrase.",
                    "label": 0
                },
                {
                    "sent": "I really love this phrase.",
                    "label": 0
                },
                {
                    "sent": "And may mean less to you if you're not a native English speaker.",
                    "label": 0
                },
                {
                    "sent": "But he said poor George, the Eagle eye with the flat feet.",
                    "label": 0
                },
                {
                    "sent": "Eagle Eye is a cliche, meaning sharp, sharp with it.",
                    "label": 0
                },
                {
                    "sent": "On flat feet means.",
                    "label": 0
                },
                {
                    "sent": "Plodding dull, banal, incompetent.",
                    "label": 0
                },
                {
                    "sent": "So he says, basically you can spot other people's problems, but you can't avoid them yourself, can you?",
                    "label": 0
                },
                {
                    "sent": "Notice how he combines two cliches.",
                    "label": 0
                },
                {
                    "sent": "For a creative way of reusing cliches, and that's basically the computational approach that many of us taken linguistic creativity on a machine, we get the system to work with very familiar language, but we cut it up in ways that tried to bring out novelty, an incongruity, and we measured the incongruity, and we filter the results by incongruity.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's an example from one of our Twitter bots.",
                    "label": 0
                },
                {
                    "sent": "It's called Trump scuttle bot.",
                    "label": 0
                },
                {
                    "sent": "He looks very extremely orange on this slide here.",
                    "label": 0
                },
                {
                    "sent": "I didn't mean him to be this orange.",
                    "label": 0
                },
                {
                    "sent": "This may actually be more accurate though.",
                    "label": 0
                },
                {
                    "sent": "And here's a simple roses are red poem that the bot generates on its own.",
                    "label": 0
                },
                {
                    "sent": "Bible Belt states are red aristocratic veins or blue.",
                    "label": 0
                },
                {
                    "sent": "My human children love me and would lick dirt from my shoe.",
                    "label": 0
                },
                {
                    "sent": "OK, so notice how it's caught up.",
                    "label": 0
                },
                {
                    "sent": "All of these different phrases to make this poem that rhymes and poetry generation is one of the areas that we study in computational creativity.",
                    "label": 0
                },
                {
                    "sent": "But notice all the cliches, Bible Belt states, aristocratic blue veins, the idea of someone who's humble licking dirt from your shoe, and a combined them in ways that try to give new value to these phrases and in.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Fact the system uses a grammar.",
                    "label": 0
                },
                {
                    "sent": "The formalism is called tracery.",
                    "label": 0
                },
                {
                    "sent": "I won't go into it here.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But the grammar is built on all of these cliches which are written into the grammar.",
                    "label": 0
                },
                {
                    "sent": "So for instance, up here we have all of the gold things that the grammar knows about.",
                    "label": 0
                },
                {
                    "sent": "My underpants.",
                    "label": 0
                },
                {
                    "sent": "Trump tower toilets.",
                    "label": 0
                },
                {
                    "sent": "Willy Wonka's ticket, Beyonce's toenails, and so forth.",
                    "label": 0
                },
                {
                    "sent": "And it uses those to compose.",
                    "label": 0
                },
                {
                    "sent": "To combine into these.",
                    "label": 0
                },
                {
                    "sent": "Poems, but they're all given by us.",
                    "label": 0
                },
                {
                    "sent": "So to be creative, the machine should really learn its own cliches and use them automatically.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we need to give the computer the ability to go out onto the web and to find its own commonplace, highly visual imagination tickling cliches.",
                    "label": 0
                },
                {
                    "sent": "And we can find them on the Internet and harvest them automatically.",
                    "label": 0
                },
                {
                    "sent": "How do we do that?",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here's an example of another famous comparison from one of my favorite orders, Raymond Chandler.",
                    "label": 0
                },
                {
                    "sent": "He's the undisputed master of the simile.",
                    "label": 0
                },
                {
                    "sent": "He wrote detective fiction, but he elevated into a literary art form.",
                    "label": 0
                },
                {
                    "sent": "He's talking about a guy who's as big as me, maybe twice as wide.",
                    "label": 0
                },
                {
                    "sent": "Moose Malloy.",
                    "label": 0
                },
                {
                    "sent": "Shockingly white.",
                    "label": 0
                },
                {
                    "sent": "He's been imprisoned for 20 years.",
                    "label": 0
                },
                {
                    "sent": "He's looking for his wife, who ran away, and he's in the black area of town, or only black people live there.",
                    "label": 0
                },
                {
                    "sent": "So there's this huge white guy angry, running around, frightening all of the black people.",
                    "label": 0
                },
                {
                    "sent": "And Chandler says this even on Central Ave, not the quietest dress street in the world.",
                    "label": 1
                },
                {
                    "sent": "Malloy looked about as inconspicuous.",
                    "label": 0
                },
                {
                    "sent": "As a tarantula on a slice of Angel food, Angel food is a really white cake.",
                    "label": 1
                },
                {
                    "sent": "Trash is a big, disgusting black spider.",
                    "label": 0
                },
                {
                    "sent": "Notice how is comparing a white man and a black neighborhood to a black spider on a white cake.",
                    "label": 0
                },
                {
                    "sent": "This is not about visual similarity, it's about the ability to evoke a frightening image you reach for that piece of cake.",
                    "label": 0
                },
                {
                    "sent": "Ohmygod there's a spider and he wants to give you that same feeling that the people who see Malloy have, and it works wonderfully.",
                    "label": 0
                },
                {
                    "sent": "But notice that he uses the word about.",
                    "label": 0
                },
                {
                    "sent": "In English, we tend to mark our ironic similes with subtle hints to say I'm not serious.",
                    "label": 0
                },
                {
                    "sent": "He's not inconspicuous, he's in.",
                    "label": 0
                },
                {
                    "sent": "He's completely conspicuous.",
                    "label": 0
                },
                {
                    "sent": "We mark our playful intent with the word about.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And if we start harvesting as X about as X as Y from the web, we can get all of these visual images automatically and we know that they're playful because they've been taken from ironic comparisons and we created an inventory so the computer gets 215 ironic visual images for subtlety.",
                    "label": 0
                },
                {
                    "sent": "OK, as subtle as a train station toilet right now, you see that's a funny image, right?",
                    "label": 0
                },
                {
                    "sent": "What's funny about that?",
                    "label": 0
                },
                {
                    "sent": "It's just odd.",
                    "label": 0
                },
                {
                    "sent": "We just love comparisons that are antagonistic and incongruous.",
                    "label": 0
                },
                {
                    "sent": "As appealing as a trip to the dentist to have all of your teeth removed right again, what a horrible visual image, but great fun.",
                    "label": 0
                },
                {
                    "sent": "And so on.",
                    "label": 0
                },
                {
                    "sent": "About as useful as seeking tips on humility from Donald Trump is one of the examples in there as well, so we used.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But and we recombine them in the way that Empson recombined cliches to generate new cliches.",
                    "label": 0
                },
                {
                    "sent": "Louis B. Mayer famously said Hollywood needs new cliches and we can build machines to give new cliches.",
                    "label": 0
                },
                {
                    "sent": "So here's an example.",
                    "label": 0
                },
                {
                    "sent": "It's kind of rude this.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you're rich.",
                    "label": 0
                },
                {
                    "sent": "If you watch Rick and Morty, but we've built a bot called interdimensional cable TV.",
                    "label": 0
                },
                {
                    "sent": "It's called Inter cable bot.",
                    "label": 0
                },
                {
                    "sent": "Imagine what TV is like in other universes.",
                    "label": 0
                },
                {
                    "sent": "By the way, it's really bad.",
                    "label": 0
                },
                {
                    "sent": "I'll say this art film is about as subtle as a loud fart during morning mass, and you see what a great composition, composition of images and one and usual thing to say during science week.",
                    "label": 1
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Oh here's here's a few examples from interdimensional cable.",
                    "label": 0
                },
                {
                    "sent": "We now return to our addictive soap opera.",
                    "label": 0
                },
                {
                    "sent": "Hell we now return to our coordinated dance movie The Dead Slug.",
                    "label": 0
                },
                {
                    "sent": "Watch Mata Hari selling military secrets in the exotic spy caper, cashier's at a suburban mall, the titles of the films are deliberately chosen to be the opposite of what they should be.",
                    "label": 0
                },
                {
                    "sent": "Stay tuned for the next installment in the family film, the Priesthood Tree.",
                    "label": 0
                },
                {
                    "sent": "The porn store, right?",
                    "label": 0
                },
                {
                    "sent": "So again, it's imagining an idiotic universe where the films or not, what it should be.",
                    "label": 0
                },
                {
                    "sent": "And in fact it's kind of satire in Hollywood.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you can build these.",
                    "label": 0
                },
                {
                    "sent": "You can reuse these images, we build them into a grammar thousands and thousands, and thousands of them, and you can harness them for ironic and literal uses.",
                    "label": 0
                },
                {
                    "sent": "So we have this little grammar that says 1000 metaphors for Trump's America.",
                    "label": 0
                },
                {
                    "sent": "And then it generates a number between one and 1000 and then it puts in.",
                    "label": 0
                },
                {
                    "sent": "A visual image and the whole idea of course, is that it's meant to make you think newly about things.",
                    "label": 0
                },
                {
                    "sent": "Does everybody know what a subpoena is?",
                    "label": 0
                },
                {
                    "sent": "A subpoena is when a judge says you have to testify, you're in big trouble.",
                    "label": 0
                },
                {
                    "sent": "Mr Right turns out to be very apt.",
                    "label": 0
                },
                {
                    "sent": "Let's hope.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, here's some more root stuff.",
                    "label": 0
                },
                {
                    "sent": "We have a bot called comedy Dinosaur Anna generates a spoof of.",
                    "label": 0
                },
                {
                    "sent": "Hipster culture.",
                    "label": 0
                },
                {
                    "sent": "So fancy going down to new microbrewery, the questionnaire and magazine for a pint of academic paper lager.",
                    "label": 0
                },
                {
                    "sent": "It's the most boring name for lager.",
                    "label": 0
                },
                {
                    "sent": "It could invent academic paper and the pub sounds dreadful.",
                    "label": 0
                },
                {
                    "sent": "The questionnaire and magazine, or I've just been down my local gastropub to fart in spacecraft pile of horseshit.",
                    "label": 0
                },
                {
                    "sent": "This is not a good gastropub is it?",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Kids nowadays have their GPS for back in the day are only fun, was changing sheets in a bed wetting clinic.",
                    "label": 0
                },
                {
                    "sent": "OK, so we've what we've done in case I'm sure lots of people are saying what the hell is he talking about?",
                    "label": 0
                },
                {
                    "sent": "We've.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Taken.",
                    "label": 0
                },
                {
                    "sent": "The collective humor of the web as expressed through all of these imaginative similes, and we've deconstructed the similes, and recombine them in new ways and new containers.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The first one is repurposed from a simile as.",
                    "label": 0
                },
                {
                    "sent": "As pleasant as a fart in a spacecraft, Can you imagine that confined space and the fact that the air isn't being recycled and you go?",
                    "label": 0
                },
                {
                    "sent": "Oh my God, that's not pleasant at all.",
                    "label": 0
                },
                {
                    "sent": "And then it says, let's name in English Pub.",
                    "label": 0
                },
                {
                    "sent": "After that, English pubs are always named the X and the Y, the Lamb and Pony, right?",
                    "label": 0
                },
                {
                    "sent": "The King and Queen, the fart and spacecraft.",
                    "label": 0
                },
                {
                    "sent": "The questionnaire and magazine.",
                    "label": 0
                },
                {
                    "sent": "Maybe this is a bit English.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK group may enjoy guarding the Galaxy, but back in our day are only fun with seeking out Donald Trump for tips on humility right?",
                    "label": 0
                },
                {
                    "sent": "So you get you see how it's repurposing things.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now the book I mentioned, the book on Twitter bots.",
                    "label": 0
                },
                {
                    "sent": "The editor who commissioned the book said Tony.",
                    "label": 0
                },
                {
                    "sent": "She said this the day before Christmas Eve, Tony.",
                    "label": 0
                },
                {
                    "sent": "We'd really like some of the reviews on the book to come from Twitter bots.",
                    "label": 0
                },
                {
                    "sent": "Just as a bit of fun, right?",
                    "label": 0
                },
                {
                    "sent": "You know, the way you look at the back of the book and it says a Tour de force couldn't put it down right?",
                    "label": 0
                },
                {
                    "sent": "Stephen Hawking something like that then?",
                    "label": 0
                },
                {
                    "sent": "Couldn't pick it up anyway, sorry, that's not the worst thing I've said about forward Mr Hawking.",
                    "label": 0
                },
                {
                    "sent": "Anyway, they wanted Twitter bots to invent humorous.",
                    "label": 0
                },
                {
                    "sent": "Slightly sick reviews for our book so they could put them on the back of the book to show what you'd find in the book.",
                    "label": 0
                },
                {
                    "sent": "So it generates things like.",
                    "label": 0
                },
                {
                    "sent": "This moral new book about bots makes Bickel Bulgakov's the Master and Margarita seem as moral as the insect world, which is actually quite accurate, right?",
                    "label": 0
                },
                {
                    "sent": "Because our bots have no morality, they're like ants, or according to Amazon people who bought this valuable book about two robots also bought.",
                    "label": 0
                },
                {
                    "sent": "F Scott Fitzgerald, The Great Gatsby, Maia Stevenson's the 1st edition of Genesis.",
                    "label": 0
                },
                {
                    "sent": "This thing here, that bought imagines what could be the most valuable book ever.",
                    "label": 0
                },
                {
                    "sent": "Well, it goes to the similes, and it says as valuable as the 1st edition of Genesis, and that repurposes the 1st edition of Genesis as the name of a book.",
                    "label": 0
                },
                {
                    "sent": "And it says, now that's a valuable book, and it knows that Great Gatsby is about this rich guy.",
                    "label": 0
                },
                {
                    "sent": "He's valuable, so it compares them, say somewhere between The Great Gatsby and.",
                    "label": 0
                },
                {
                    "sent": "1st Edition of Genesis.",
                    "label": 0
                },
                {
                    "sent": "Really good pitch for our book by the way.",
                    "label": 0
                },
                {
                    "sent": "We want our book to be the kind of bought Genesis.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'll end there by summarizing very briefly.",
                    "label": 0
                },
                {
                    "sent": "What is it that we've done?",
                    "label": 0
                },
                {
                    "sent": "Have we come closer to giving computers a sense of humor?",
                    "label": 0
                },
                {
                    "sent": "Well, we've given our Twitter bots a sense of humor, and it's not a sense of humor for everybody, is it?",
                    "label": 0
                },
                {
                    "sent": "Book.",
                    "label": 0
                },
                {
                    "sent": "We've taken this idea of incongruity.",
                    "label": 0
                },
                {
                    "sent": "This internal contradiction of ideas, which isn't funny in itself.",
                    "label": 0
                },
                {
                    "sent": "And the idea that it could be resolved, which again is not funny in itself and made it human scale by making it about certain kinds of people.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the kind of people who buy books on Amazon.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the kind of people who enjoy technology.",
                    "label": 0
                },
                {
                    "sent": "You have your GPS, but back in my day we had great fun changing the sheets on the bed wetting clinic which not in comparison act or this makes fun of the people who go to trendy pubs with fancy names and drink bad beer and terrible foods, right?",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So all of.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Those approaches are really repackaging the visual images that are free to harvest on the web in huge quantities and says how do I frame these in a ways in a way that makes them human scale?",
                    "label": 0
                },
                {
                    "sent": "How do I make these be a negative comment on certain kind of person that we can then laugh at or appreciate their response to?",
                    "label": 0
                },
                {
                    "sent": "And in effect, what we're doing is trying to collect the sense of humor of the Internet and package it in some discreet way in some new context that demands a new purpose.",
                    "label": 0
                },
                {
                    "sent": "This is not especially serious work.",
                    "label": 0
                },
                {
                    "sent": "Humor is not an area that attracts Nobel Prize winners.",
                    "label": 0
                },
                {
                    "sent": "You might find a few IG Nobel Prize winner is working in the humour field, but I hope I've left you regardless of what you think about the computers jokes.",
                    "label": 0
                },
                {
                    "sent": "With the idea that humor is a fundamental human faculty, it is built pyramid like on top of all of our other faculties.",
                    "label": 0
                },
                {
                    "sent": "And it really cannot work on a machine until we've either modeled all of those other faculties or we've taken a shortcut.",
                    "label": 0
                },
                {
                    "sent": "And harnessed the collective human humor of the web, which is where we're at at the moment.",
                    "label": 0
                },
                {
                    "sent": "If you want non pun humor.",
                    "label": 0
                },
                {
                    "sent": "I would be very happy to take some questions or some criticisms or some bemused looks now.",
                    "label": 0
                },
                {
                    "sent": "Thanks everyone.",
                    "label": 0
                },
                {
                    "sent": "So when you have a state that does bad things, and if you don't know how to express it and you start to use humor, so you make an Association is called the Banana Republic and then insert calling all the officials and try to be serious regarding hey, you're doing this job, but you're in a Banana Republic.",
                    "label": 0
                },
                {
                    "sent": "How would you model reactions to the humorous aspect of solving a problem instead of using or?",
                    "label": 0
                },
                {
                    "sent": "Instead of using.",
                    "label": 0
                },
                {
                    "sent": "Oh OK, well that's it.",
                    "label": 0
                },
                {
                    "sent": "Huge question.",
                    "label": 0
                },
                {
                    "sent": "I would say that our work is not really designed for preventing war.",
                    "label": 0
                },
                {
                    "sent": "In that sense, where almost everyone else in computer science but I will say that I think your question arises out of the use of humor to diffuse interpersonal hostility so people are arguing and one of them uses a joke to remove the tension from the situation.",
                    "label": 0
                },
                {
                    "sent": "Now, is it possible that you could elevate that to a geopolitical level while the Americans elected a joke and it's only gotten worse, right?",
                    "label": 0
                },
                {
                    "sent": "So no, I would say that humor is dangerous in the wrong hands.",
                    "label": 0
                },
                {
                    "sent": "Seen people who use humor to change people's minds.",
                    "label": 0
                },
                {
                    "sent": "And to turn them against immigrants, or to turn them against people who are the other.",
                    "label": 0
                },
                {
                    "sent": "So there are there are comedians who are liberal and they draw people in and there are people who are reactionary and they push people away.",
                    "label": 0
                },
                {
                    "sent": "Humor is a very powerful human force and it can be misused as easily as it can be properly used.",
                    "label": 0
                },
                {
                    "sent": "So I think if we were to try to use it for something truly serious, the chances of it being misused are is greater.",
                    "label": 0
                },
                {
                    "sent": "As it being used I. I mean, it's an interesting idea.",
                    "label": 0
                },
                {
                    "sent": "I'll think about it and I'll get back to you.",
                    "label": 0
                },
                {
                    "sent": "Sorry, do you have a way of to measure what's funny with the computer?",
                    "label": 0
                },
                {
                    "sent": "Like a neural net or something?",
                    "label": 0
                },
                {
                    "sent": "How do you know what's funny?",
                    "label": 0
                },
                {
                    "sent": "OK, that's a very good question, becausw.",
                    "label": 0
                },
                {
                    "sent": "We get funny in a sort of visceral level.",
                    "label": 0
                },
                {
                    "sent": "I mean, sometimes something is so funny it hurts 'cause we laugh so much, right?",
                    "label": 0
                },
                {
                    "sent": "I've been in situations like that where I can't stop laughing and I'm thinking, Oh my God, I'm going to.",
                    "label": 0
                },
                {
                    "sent": "We say I'm going to die.",
                    "label": 0
                },
                {
                    "sent": "Some people say that when you're laughing so hard, obviously they feel it in this deeply physical way.",
                    "label": 0
                },
                {
                    "sent": "So I was at an event in Oxford in November where a professional comedy writer.",
                    "label": 0
                },
                {
                    "sent": "Got a bunch of his Co professionals.",
                    "label": 0
                },
                {
                    "sent": "They write TV shows like Qi and Mock the Week and all of these shows were comedians are pretending to be spontaneous and to come up with a really witty joke.",
                    "label": 0
                },
                {
                    "sent": "They've all been written two weeks earlier about this team of people and was quite depressing.",
                    "label": 0
                },
                {
                    "sent": "Insight into the commercialization of comedy.",
                    "label": 0
                },
                {
                    "sent": "And so half of the audience professional comedy writers in half, or AI people.",
                    "label": 0
                },
                {
                    "sent": "And the goal was to make us talk to each other.",
                    "label": 0
                },
                {
                    "sent": "We'd say to the comedy writers, what can we give you in terms of technology to make your humor better?",
                    "label": 0
                },
                {
                    "sent": "And we wanted to learn from them.",
                    "label": 0
                },
                {
                    "sent": "What can you tell us about the process of generating original jokes that we can turn into algorithms and knowledge representations as an idea?",
                    "label": 0
                },
                {
                    "sent": "It was great as a reality is a terrible failure, the professionals.",
                    "label": 0
                },
                {
                    "sent": "Didn't really have anything to say to us except computers have no soul.",
                    "label": 0
                },
                {
                    "sent": "They have nobody.",
                    "label": 0
                },
                {
                    "sent": "Therefore they cannot be funny, right?",
                    "label": 0
                },
                {
                    "sent": "And we were saying to them, you've got no soul and you're funny, right?",
                    "label": 0
                },
                {
                    "sent": "They didn't get the joke.",
                    "label": 0
                },
                {
                    "sent": "But yes, they feel the pod embodiment is key and humans use the laughter test.",
                    "label": 0
                },
                {
                    "sent": "How much do you laugh and comedians use?",
                    "label": 0
                },
                {
                    "sent": "That tested, the comedian would stand up here and tell a joke and no one laughed in the community, so that's not funny.",
                    "label": 0
                },
                {
                    "sent": "And in fact the keynote speaker at this event in Oxford with Jimmy Carr and very professional and quite famous British comedian and he has this technique when he's developing a new show of writing all of his jokes down a checklist and going into a small venue like a pub.",
                    "label": 0
                },
                {
                    "sent": "And testing the jokes and when he gets a lot of laughter he goes and when no one laughs he goes and then he filters his jokes and that's how he gets a stage show.",
                    "label": 0
                },
                {
                    "sent": "You see these stage shows in the big arena and everyone's laughing at every joke.",
                    "label": 0
                },
                {
                    "sent": "That's because all of the jokes that no one laughed would have been removed through this Darwinian process.",
                    "label": 0
                },
                {
                    "sent": "Now, how does a computer substitute for laughter?",
                    "label": 0
                },
                {
                    "sent": "Doesn't have a sense of humor.",
                    "label": 0
                },
                {
                    "sent": "You're right, we can sense of humor is mysterious.",
                    "label": 0
                },
                {
                    "sent": "And whenever someone wants to model something mysterious in a practical way without actually deriving any understanding, we use neural networks.",
                    "label": 0
                },
                {
                    "sent": "So you throw a neural network at it and you train it, and you still say this works, but I have no idea why it works.",
                    "label": 0
                },
                {
                    "sent": "I have students who do it.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When you say I use a neural network, you have to ask them 100 questions to figure out what kind of network and what kind of parameters and how did they do overfitting and so forth.",
                    "label": 0
                },
                {
                    "sent": "That's a really nightmare black magic problem.",
                    "label": 0
                },
                {
                    "sent": "So on Twitter there's a simple solution.",
                    "label": 0
                },
                {
                    "sent": "When the computer is generating its own original outputs, if people retweet it, you can tell that it's popular.",
                    "label": 0
                },
                {
                    "sent": "Now you can take the ones that have the most retweets and you can put them into a neural net model so that the system can analyze its own outputs before their retweeted.",
                    "label": 0
                },
                {
                    "sent": "To say I think this joke will get so many retweets, this version of will get X more.",
                    "label": 0
                },
                {
                    "sent": "Therefore I will use this.",
                    "label": 0
                },
                {
                    "sent": "In fact people are Cornell have been quite successful at predicting which version of A twist will get the most retweets.",
                    "label": 0
                },
                {
                    "sent": "I did it for party announcements so they had different Twitter announcements of the same student party and their system learned that when you mentioned free beer that you get more retweets.",
                    "label": 0
                },
                {
                    "sent": "Basically what the neural network was doing, free beer, no parents open house, right swimming pool.",
                    "label": 0
                },
                {
                    "sent": "If you just said party at my house, we're going to watch documentaries, no retweets.",
                    "label": 0
                },
                {
                    "sent": "Party at my house.",
                    "label": 0
                },
                {
                    "sent": "Parents away, free beer, swimming pool, chaos.",
                    "label": 0
                },
                {
                    "sent": "1000 retweets right so you can get a neural network to learn that kind of thing.",
                    "label": 0
                },
                {
                    "sent": "So we're not immune to that, but that is no substitute for giving a computer a body and giving it to physical feedback.",
                    "label": 0
                },
                {
                    "sent": "And we joke one of the comedians said to be comic is to feel pain because when your job fails, you feel this deep pain.",
                    "label": 0
                },
                {
                    "sent": "You know, we say that the comic died on stage.",
                    "label": 0
                },
                {
                    "sent": "And only when you have that fear and that that feedback when jokes don't work can you really feel the joy when jokes do work and that joy is addictive.",
                    "label": 0
                },
                {
                    "sent": "And if you can train a computer to seek out the joy of telling a good joke and give it that feedback reward, then that is what we call a sense of humor.",
                    "label": 0
                },
                {
                    "sent": "So you say that in humor oftentimes consists of incurring incongruences and their possibility resolve them.",
                    "label": 0
                },
                {
                    "sent": "Oh yes, humor theory said it's always incongruity based.",
                    "label": 0
                },
                {
                    "sent": "OK, so yeah, my question was, indeed, is there other ways to make humor?",
                    "label": 0
                },
                {
                    "sent": "Oh well, there are many ways to be humorous.",
                    "label": 0
                },
                {
                    "sent": "But the theories are consistent in viewing all jokes as being fundamentally about a violation of expectations.",
                    "label": 0
                },
                {
                    "sent": "Now this is problematic.",
                    "label": 0
                },
                {
                    "sent": "On its own, if you ever watch a TV show called Little Britain, it's a British comedy show where it's all about the same scenario every week with the same catch phrase at the end, you know exactly how to sketch is going to end, but it's your anticipation of how the people in the sketch will react when they hear the catch phrase that makes it funny.",
                    "label": 0
                },
                {
                    "sent": "There was nothing surprising about the sketches in Little Britain.",
                    "label": 0
                },
                {
                    "sent": "It's almost like a thought experiment.",
                    "label": 0
                },
                {
                    "sent": "Can we make the most predictable show in the world?",
                    "label": 0
                },
                {
                    "sent": "And still make people laugh and people.",
                    "label": 0
                },
                {
                    "sent": "How would laughter and the.",
                    "label": 0
                },
                {
                    "sent": "The key to the jokes and shows like that.",
                    "label": 0
                },
                {
                    "sent": "Is not the incongruity.",
                    "label": 0
                },
                {
                    "sent": "The incongruity is present throughout.",
                    "label": 0
                },
                {
                    "sent": "But what makes the joke funny?",
                    "label": 0
                },
                {
                    "sent": "Is the theory of mind.",
                    "label": 0
                },
                {
                    "sent": "You are projecting yourself into the mind of the person in the sketch who was hearing the sketch for the first time.",
                    "label": 0
                },
                {
                    "sent": "You've heard it 100 times 'cause you've watched the show every week for two years.",
                    "label": 0
                },
                {
                    "sent": "But the person in the sketch you imagine this as an innocent person being faced with this incongruity and being faced with this horror and having to somehow deal with it.",
                    "label": 0
                },
                {
                    "sent": "So theory of mind.",
                    "label": 0
                },
                {
                    "sent": "Is an underlooked element of humor.",
                    "label": 0
                },
                {
                    "sent": "All of the theories look at the incongruity, but they don't look at the elements that make the incongruity humorous.",
                    "label": 0
                },
                {
                    "sent": "It's a mystery, really.",
                    "label": 0
                },
                {
                    "sent": "I think that missing component is theory of mind.",
                    "label": 0
                },
                {
                    "sent": "Our ability to empathize with the people in the story, which means that a computer that has a sense of humor is like much closer to being a truly empathic machine.",
                    "label": 0
                },
                {
                    "sent": "Even if it laughs of us.",
                    "label": 0
                },
                {
                    "sent": "But I don't know what it's like in Sylvania, but in Ireland we show affection to each other by.",
                    "label": 0
                },
                {
                    "sent": "Humorously insulting each other right?",
                    "label": 0
                },
                {
                    "sent": "It demonstrates that we have the freedom to do this.",
                    "label": 0
                },
                {
                    "sent": "We are so close, I can insult your hair and your shoes and your mother and you won't get upset.",
                    "label": 0
                },
                {
                    "sent": "And it's a sign of closeness.",
                    "label": 0
                },
                {
                    "sent": "And it creates closeness.",
                    "label": 0
                },
                {
                    "sent": "So empathy and humor are very closely related.",
                    "label": 0
                },
                {
                    "sent": "Big cause of theory of mind and that thank you for raising the topic cause by giving our machines a genuine sense of humor, we are taking them closer to being truly empathic and sharing our value system machines that share a value system won't eradicate us.",
                    "label": 0
                },
                {
                    "sent": "That's a good point, right?",
                    "label": 0
                },
                {
                    "sent": "I think we shouldn't take other questions because this was a very pompous end of the talk.",
                    "label": 0
                },
                {
                    "sent": "OK, more questions.",
                    "label": 0
                },
                {
                    "sent": "One more maybe?",
                    "label": 0
                },
                {
                    "sent": "Home.",
                    "label": 0
                },
                {
                    "sent": "I have a question, if you know there's some analogue of methods to get people to laugh like in situational comedy on TV.",
                    "label": 0
                },
                {
                    "sent": "When the laughter is montaged into.",
                    "label": 0
                },
                {
                    "sent": "The video by something funny happens.",
                    "label": 0
                },
                {
                    "sent": "You hear laughter that is recorded.",
                    "label": 0
                },
                {
                    "sent": "Yes, it's called the laugh Track is is there some interlock in written kind of humor or like free beer?",
                    "label": 0
                },
                {
                    "sent": "Yes, I think you bring up that point.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is an interesting about laugh tracks.",
                    "label": 0
                },
                {
                    "sent": "You've watched friends or some TV comedy and you know when to laugh cause.",
                    "label": 0
                },
                {
                    "sent": "You hear this disembodied laughter, and you imagine it is the laughter of the audience.",
                    "label": 0
                },
                {
                    "sent": "And some of these TV shows are filmed in front of a live studio audience, so you imagine this is the laughter of the people watching the show as it's being recorded.",
                    "label": 0
                },
                {
                    "sent": "In fact, you are hearing the laughter of dead people.",
                    "label": 0
                },
                {
                    "sent": "These laugh tracks were recorded in the 1950s and are still used today, so you are hearing dead people laughing.",
                    "label": 0
                },
                {
                    "sent": "At situated comedies, but it the laughter of dead people, is still very effective.",
                    "label": 0
                },
                {
                    "sent": "If you want to sophisticated comedy with no laugh track, it can be sometimes very confusing.",
                    "label": 0
                },
                {
                    "sent": "Should I laugh with that?",
                    "label": 0
                },
                {
                    "sent": "Should I not?",
                    "label": 0
                },
                {
                    "sent": "But if there's two of you watching it, you have mutual laughter to guide you.",
                    "label": 0
                },
                {
                    "sent": "And again, it comes down to theory of mind.",
                    "label": 0
                },
                {
                    "sent": "Someone else finds this funny.",
                    "label": 0
                },
                {
                    "sent": "Let me find out why.",
                    "label": 0
                },
                {
                    "sent": "And of course, if you watch a funny film like let's say Young Frankenstein hilarious firm, we showed it recently added.",
                    "label": 0
                },
                {
                    "sent": "As spring school in Germany, just having 50 people in the room laughing at this was complete joy, whereas one person would smile.",
                    "label": 0
                },
                {
                    "sent": "50 people are howling with laughter.",
                    "label": 0
                },
                {
                    "sent": "Question was, is there something that we can do at the textual level?",
                    "label": 0
                },
                {
                    "sent": "Well, let's consider another subtle sign of a less subtle sign.",
                    "label": 0
                },
                {
                    "sent": "Is humor or is laughter are more subtle sign as a wink, right?",
                    "label": 0
                },
                {
                    "sent": "Or nudge some symbol that it's OK to laugh?",
                    "label": 0
                },
                {
                    "sent": "Here the about is the signal right?",
                    "label": 0
                },
                {
                    "sent": "So about this as a word.",
                    "label": 1
                },
                {
                    "sent": "It means proxamol near, but not quite right.",
                    "label": 0
                },
                {
                    "sent": "It's a marker of imprecision and we use it in English, and I'm certain that in in serbo Croatian Slovenian there is an equivalent marker.",
                    "label": 0
                },
                {
                    "sent": "We call it a hedge.",
                    "label": 0
                },
                {
                    "sent": "It says don't take me at my word.",
                    "label": 0
                },
                {
                    "sent": "I am being proximate right, and it turns out that in.",
                    "label": 0
                },
                {
                    "sent": "English we use this word to introduce our our ideas when we're being very playfully ironic and in fact in.",
                    "label": 0
                },
                {
                    "sent": "Some of the empirical work we've done, we've looked at determining whether automatically determining whether a simile is ironic or not, and.",
                    "label": 0
                },
                {
                    "sent": "The presence of about is highly deterministic, and if someone gives you a simile that doesn't have about our system goes to the web and sees how many times other people have used that simile with about and how many times they've used it would act.",
                    "label": 1
                },
                {
                    "sent": "If it's dominant in the about form, it is very highly likely to be humorous.",
                    "label": 0
                },
                {
                    "sent": "Notice that Chandler doesn't need the word about here.",
                    "label": 0
                },
                {
                    "sent": "He's subtly cueing you to laugh because he's going to give you something creative.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "This is a really compressed form of laughter.",
                    "label": 0
                },
                {
                    "sent": "But it's so subtle we don't notice it at a conscious level.",
                    "label": 0
                },
                {
                    "sent": "Subconsciously we pick it up and we say he's wandering into the realms of the imprecise.",
                    "label": 0
                },
                {
                    "sent": "I better hold on 'cause it's going to be funny, right?",
                    "label": 0
                },
                {
                    "sent": "And that's.",
                    "label": 0
                },
                {
                    "sent": "The detection of humor by neural Nets or by statistical machinery is all about recognizing these subtle markers.",
                    "label": 0
                },
                {
                    "sent": "It's not about recognizing that tarantulas are scary because the system doesn't know what that means in terms of humor.",
                    "label": 0
                },
                {
                    "sent": "It uses words like a bat.",
                    "label": 0
                },
                {
                    "sent": "It uses these closed class words, which is kind of cheating.",
                    "label": 0
                },
                {
                    "sent": "But humans use them all the time to say get ready.",
                    "label": 0
                },
                {
                    "sent": "I'm going to make it.",
                    "label": 0
                },
                {
                    "sent": "I'm going to tickle you with language.",
                    "label": 0
                },
                {
                    "sent": "No more questions, thank you very much Tony.",
                    "label": 0
                },
                {
                    "sent": "Thank you guys.",
                    "label": 0
                },
                {
                    "sent": "Fuck you.",
                    "label": 0
                }
            ]
        }
    }
}