{
    "id": "kkmuxsvz3iw5zqtydgo2lvztsqnlkd67",
    "title": "Core Decomposition of Uncertain Graphs",
    "info": {
        "author": [
            "Yana Volkovich, Barcelona Media"
        ],
        "published": "Oct. 7, 2014",
        "recorded": "August 2014",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Knowledge Extraction"
        ]
    },
    "url": "http://videolectures.net/kdd2014_volkovich_uncertain_graphs/",
    "segmentation": [
        [
            "This is joint work.",
            "Visio collapse Barcelona, Francesco Gola, an Francesco Bonchi an address counter bonus.",
            "My colleague from Barcelona medium."
        ],
        [
            "So the title of my talk is.",
            "And Sikora, decomposition of certain graphs, and to give a short introduction at first start."
        ],
        [
            "Explaining what is actually required decomposition."
        ],
        [
            "The idea of culture decomposition come from I come from ideas finding some dense subgraphs and finding advance some graph is a fundamental primitive in many graph problems and."
        ],
        [
            "There's of course several enormous amount of definition of dense subgraphs like clicks and clicks and clients, complexes, cake wars, etc."
        ],
        [
            "The problem, however, most of them are computationally prohibitive that MP hard, or at least quadratic an in this case, according composition has."
        ],
        [
            "Some particular building features it could be computed in linear time an it relates to many definition of dense subgraphs, so it could be used as approximation for computation as ardelle sub graph.",
            "So what is it called the composite?"
        ],
        [
            "So if you have a non direct graph G of this vertex set V&E as a H set the key Cora is a maximum maximal subgraph H such that every vertex visit this sub graph has degree.",
            "Hodges and Kate so um."
        ],
        [
            "Here is a short example.",
            "I have a small small graph of six months and you will find a find the cake or perform a cake order composition.",
            "On such graph.",
            "You need to kind of peel the nodes with the smallest degree.",
            "So here is my."
        ],
        [
            "Degrees one, so we take a one.",
            "We find old nodes with us more smaller this this degree one.",
            "All right, so in this case we remove them."
        ],
        [
            "Not SMB again Caesar.",
            "Still a note with degree one, so we remove this note as well and."
        ],
        [
            "Then there is only nodes with degree two and this is a key marks in this game maximum in this case and this is the innermost core of this small example graph."
        ],
        [
            "So using this quality composition, we can actually produce a degenerative order on declarative degenerative ordering on a node set, and it's based on a query index.",
            "So for every vertex we can find our harder, the highest order.",
            "Of course, that contains this vertex.",
            "So in this case we have like the notes on the 1st row they have.",
            "Kicking index one and then the triangles has a key next to."
        ],
        [
            "OK so I was a short introduction in what the score is the composition.",
            "So now let me shortly introduce what is actually uncertain graphs."
        ],
        [
            "So there are uncertain grounds come from many real life application.",
            "And actually, what happens?",
            "So in many real life networks you don't know the account for some kind of associated uncertainties, so there's some things are connected, but you not completely sure huaian how well they are connected.",
            "It could be, it could be because of several reasons.",
            "So for example, a data collection process, you do some measurements and you because of the because of the process you're not sure it could be because you employ some machine learning method.",
            "And sometimes it could be a special social networks.",
            "It's good because of our privacy preserving reasons.",
            "There are many examples could be covered by uncertain graphs, biological networks, protein interaction networks and social networks as well."
        ],
        [
            "Go in more details.",
            "I mean definitely more details and certain graphs would be seen as graphs with ages.",
            "This age is to have associated probability of existence, so here's an example from a previous slide.",
            "But here we have this red probabilities associated with every H within this graph.",
            "So then."
        ],
        [
            "Then uncertain graphs is actually a generative model for deterministic graphs, so how?"
        ],
        [
            "Is it work so we have a G against the?",
            "The set of vertices we have Easter set of edges and we have also the probability function P that accentuate probability.",
            "Of existence for the science of probability, of existence to every age.",
            "So here you have.",
            "That's right now like this left side, so we have this uncertain graph and then we can create a number."
        ],
        [
            "Of.",
            "The terministic graph and probability of existence of each over this deterministic graph can be calculated."
        ],
        [
            "As easily as probability is product of probabilities of ages that are using this graph multiplied by the product of probabilities of 1 minus probabilities of edges that are not in this graph.",
            "And this we have an assumption that the existence of the H like ages existing over age is independent so.",
            "OK."
        ],
        [
            "So here is a short introduction and there's.",
            "Core decomposition of certain graphs.",
            "So why we decided to bring this two things together?"
        ],
        [
            "So we actually wanted to extend the graph tool of core decomposition and of course in the context of uncertain graphs.",
            "So you might be wondering on come on why is it important?"
        ],
        [
            "They actually because some complications.",
            "And the fact is that if you can perform according composition in a case of deterministic graph in linear time, it doesn't.",
            "It's still not guarantee US efficiency as in the case of uncertain T graph in that certain graph."
        ],
        [
            "So for example, if you ask this simple question."
        ],
        [
            "Any two vertices in the graph connected."
        ],
        [
            "In deterministic graph it would be.",
            "It would be just a simple scanner for graph, but in the case of uncertain graph it become.",
            "Sharpie complete problem because you need to compute the probability that we have to connect.",
            "It is.",
            "I think it'd be paper two years ago."
        ],
        [
            "OK, so in order to define the key core decomposition of uncertain graph, we actually had to introduce the kind of level of uncertainty threshold 1 certain seatta, so we.",
            "Using this threshold uncertain severe, able to introduce probabilistic ahead, of course, which are in a waste like repeating a definition for deterministic graph, but use this uncertainty.",
            "Hello so probabilistic kayaker of uncertain graph G is a maximal sub graph such that the probability that not.",
            "In this sub graph has degree at least large is an equation, K is larger than at a, so we kind of we have we have like 2 levels, so we first have a level of having degree and having a degree with such probability as large as an editor."
        ],
        [
            "So in general, what when we need to calculate probabilistic categories graph, we need to find the probability of some node to have degree larger than K. So in this case I mean they have small example.",
            "Again we have node V with degree 3.",
            "In some uncertain graph, and then for example, probability of not having degree larger than two is some of the probability.",
            "Some of the probability to have degree two and the craft degree three and so."
        ],
        [
            "Then gently so you actually can find it.",
            "Simple formula by summing probability of being.",
            "Summing probabilities, So what you can see in this case we actually get gives an idea.",
            "This probability is monotonically nonincreasing whiskey, and by using this this property we were able to define a special notion again and so uncertain degree 4."
        ],
        [
            "Graph, which I'm going to introduce in this slide so we have again this address code and then we have A at a degree of.",
            "Every repair techs in uncertain graph is defined as a maximum K such the probability of having the largest key is larger than ever."
        ],
        [
            "So here's an example, depending of course on the level of uncertainty you can, you can have different degrees.",
            "So like you can have degree 3, two or one or like a simple case when uncertainties like level of service should be one, then you have degree 0."
        ],
        [
            "OK.",
            "So this is a defining set.",
            "The degree was one of the main.",
            "My dear, on this paper an by by using this as a degree.",
            "You cannot.",
            "We were able actually to define a key at the core decomposition in a similar way as in deterministic K, But in this case, in this case, instead of like considering degree degrees, we had to consider at the degrees there is a lot of theorems and formulas, and in our paper and I decided that we will get."
        ],
        [
            "Parents are just show you the main results and if you are interested more details you can come to me or like read the paper.",
            "OK, so first of all.",
            "Define exist in keota decomposition.",
            "Such way we were able to prove uniqueness and existence scare according composition or for uncertain graphs, which is if you would define that a bit different way.",
            "It's not always the truth."
        ],
        [
            "2nd, If you actually start to compute the naive way like.",
            "If you start the computer computing at a degree so naive way you can get into exponential time.",
            "And to our process, we had to be managed to define a dynamic programming method for Chaotic or decompositions and."
        ],
        [
            "Using this this problem, but by using this method we were able to show that running time of care course decomposition could be again.",
            "The baby and linear as a parameters with them.",
            "Of course.",
            "Number of edges in the graph and Delta is a maximum at a degree of all vertices.",
            "OK, so using this showing the linearity of the composition was one of the biggest things."
        ],
        [
            "But when we start to look later.",
            "5 minutes OK. We start to calculate that.",
            "We found that sometimes it was very slow because at the beginning you had to actually calculate all initial at degrees.",
            "So we proposed also faster compute lower bounds on at the degree.",
            "So like at beginning you can use a lower bound for this degree, and then when I actually.",
            "You process is not during the key, so you can position.",
            "You can find the exact value and it's actually speed up very much.",
            "The real computation, OK?"
        ],
        [
            "So this is like my results of my results have shown in this work I'm going to show you quickly two applications where the key at the decomposition could be successful.",
            "Useful, successfully used, can be successfully used, so one is test driven team formation and the second influence maximization problem."
        ],
        [
            "So in the task driven team formation, we have a collaboration graph versus AI.",
            "Individuals ages exhibited probabilistic topic models representing the topics of past collaborations.",
            "So I mean if I'm connecting to somebody, I'd like probably have like some some distribution in math, graph theory and so on."
        ],
        [
            "And then we have a curious setup, cure Cura para ti, que TE is a set of terms describing a new task and Q is a set of vertices.",
            "So set of individuals you want to include this new team."
        ],
        [
            "And the goal is to find an answer, search to find a team which would be a good theme for this task.",
            "Describe I see.",
            "So you using this probabilistic topic model and using this collaboration graph, we can actually built in a certain graph and by performing key key data quality composition we can solve this problem easily."
        ],
        [
            "OK, the second problem is the 2nd application is influence mechanization problem and in this case we have chosen.",
            "To look on the independent Cascade model, so independent Cascade model links have associated probabilities and every active node like only single chance to activate each of its each of currently inactive neighbors.",
            "With this probability age probably."
        ],
        [
            "So here's a short example.",
            "Again, we have us not V. Each accident this moment so."
        ],
        [
            "Then you toss a coin and then I got the two of the neighbors of the gold activated WNY and then again."
        ],
        [
            "This process continues until there is no more notes to activate."
        ],
        [
            "So the idea of course, for influence maximization problem is to find a set given us some fixed size small S such that this set is maximized.",
            "The overall spread over network and it could be useful, for example for viral market marketing."
        ],
        [
            "So in general this of course is NP hard problem.",
            "Not a big surprise, but this greedy algorithms that helps solve it in some way so you can add every every vertex, bring his largest here again in the picture function an."
        ],
        [
            "It would be super super good, but still of course because it's crazy.",
            "It's a super slow.",
            "So then what we can do, we can actually.",
            "I mean we don't need to run it sometimes in the whole graph we can actually reduce the graph by some room and run the greedy algorithm, OK?",
            "This crazy algorithm on on this graph."
        ],
        [
            "So we were opposed in this case to use a category decomposition for this problem.",
            "Why?",
            "Because in a deterministic case, apparently the key core index was a direct indicator of expected spread of any vertex.",
            "At least it was experimentally shown."
        ],
        [
            "So here's a small example of.",
            "Run on Twitter, graph based.",
            "The influence probability will learn from fast propagation of funerals, and here is we consume the.",
            "Right one the chaotic war."
        ],
        [
            "Based method outperforms all the best lines which is like just out degree at a degree.",
            "OK query and this for different set."
        ],
        [
            "So in general, let me conclude the general we have extended the graph tool of core decomposition to context of uncertain graphs."
        ],
        [
            "We have defined at the key at the current concept and device efficient algorithm for computing an active acquired composition."
        ],
        [
            "We have extensively evaluated if you look at our work, you can see there's much more many more experiments.",
            "We have extensively investigated our definitions and methods on a number of real life datasets and application."
        ],
        [
            "And there's a future work we think about investigate this relationship between kata course, another definition, probably probabilistic dense subgraphs."
        ],
        [
            "So here is it.",
            "I'm saying I'm right on time.",
            "Is there any questions?"
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is joint work.",
                    "label": 0
                },
                {
                    "sent": "Visio collapse Barcelona, Francesco Gola, an Francesco Bonchi an address counter bonus.",
                    "label": 1
                },
                {
                    "sent": "My colleague from Barcelona medium.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the title of my talk is.",
                    "label": 0
                },
                {
                    "sent": "And Sikora, decomposition of certain graphs, and to give a short introduction at first start.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Explaining what is actually required decomposition.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The idea of culture decomposition come from I come from ideas finding some dense subgraphs and finding advance some graph is a fundamental primitive in many graph problems and.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's of course several enormous amount of definition of dense subgraphs like clicks and clicks and clients, complexes, cake wars, etc.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The problem, however, most of them are computationally prohibitive that MP hard, or at least quadratic an in this case, according composition has.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some particular building features it could be computed in linear time an it relates to many definition of dense subgraphs, so it could be used as approximation for computation as ardelle sub graph.",
                    "label": 0
                },
                {
                    "sent": "So what is it called the composite?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if you have a non direct graph G of this vertex set V&E as a H set the key Cora is a maximum maximal subgraph H such that every vertex visit this sub graph has degree.",
                    "label": 0
                },
                {
                    "sent": "Hodges and Kate so um.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here is a short example.",
                    "label": 1
                },
                {
                    "sent": "I have a small small graph of six months and you will find a find the cake or perform a cake order composition.",
                    "label": 0
                },
                {
                    "sent": "On such graph.",
                    "label": 0
                },
                {
                    "sent": "You need to kind of peel the nodes with the smallest degree.",
                    "label": 0
                },
                {
                    "sent": "So here is my.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Degrees one, so we take a one.",
                    "label": 0
                },
                {
                    "sent": "We find old nodes with us more smaller this this degree one.",
                    "label": 0
                },
                {
                    "sent": "All right, so in this case we remove them.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not SMB again Caesar.",
                    "label": 0
                },
                {
                    "sent": "Still a note with degree one, so we remove this note as well and.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then there is only nodes with degree two and this is a key marks in this game maximum in this case and this is the innermost core of this small example graph.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So using this quality composition, we can actually produce a degenerative order on declarative degenerative ordering on a node set, and it's based on a query index.",
                    "label": 0
                },
                {
                    "sent": "So for every vertex we can find our harder, the highest order.",
                    "label": 1
                },
                {
                    "sent": "Of course, that contains this vertex.",
                    "label": 0
                },
                {
                    "sent": "So in this case we have like the notes on the 1st row they have.",
                    "label": 0
                },
                {
                    "sent": "Kicking index one and then the triangles has a key next to.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK so I was a short introduction in what the score is the composition.",
                    "label": 0
                },
                {
                    "sent": "So now let me shortly introduce what is actually uncertain graphs.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So there are uncertain grounds come from many real life application.",
                    "label": 1
                },
                {
                    "sent": "And actually, what happens?",
                    "label": 0
                },
                {
                    "sent": "So in many real life networks you don't know the account for some kind of associated uncertainties, so there's some things are connected, but you not completely sure huaian how well they are connected.",
                    "label": 0
                },
                {
                    "sent": "It could be, it could be because of several reasons.",
                    "label": 0
                },
                {
                    "sent": "So for example, a data collection process, you do some measurements and you because of the because of the process you're not sure it could be because you employ some machine learning method.",
                    "label": 0
                },
                {
                    "sent": "And sometimes it could be a special social networks.",
                    "label": 0
                },
                {
                    "sent": "It's good because of our privacy preserving reasons.",
                    "label": 0
                },
                {
                    "sent": "There are many examples could be covered by uncertain graphs, biological networks, protein interaction networks and social networks as well.",
                    "label": 1
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Go in more details.",
                    "label": 0
                },
                {
                    "sent": "I mean definitely more details and certain graphs would be seen as graphs with ages.",
                    "label": 0
                },
                {
                    "sent": "This age is to have associated probability of existence, so here's an example from a previous slide.",
                    "label": 1
                },
                {
                    "sent": "But here we have this red probabilities associated with every H within this graph.",
                    "label": 0
                },
                {
                    "sent": "So then.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then uncertain graphs is actually a generative model for deterministic graphs, so how?",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is it work so we have a G against the?",
                    "label": 0
                },
                {
                    "sent": "The set of vertices we have Easter set of edges and we have also the probability function P that accentuate probability.",
                    "label": 0
                },
                {
                    "sent": "Of existence for the science of probability, of existence to every age.",
                    "label": 1
                },
                {
                    "sent": "So here you have.",
                    "label": 0
                },
                {
                    "sent": "That's right now like this left side, so we have this uncertain graph and then we can create a number.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of.",
                    "label": 0
                },
                {
                    "sent": "The terministic graph and probability of existence of each over this deterministic graph can be calculated.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As easily as probability is product of probabilities of ages that are using this graph multiplied by the product of probabilities of 1 minus probabilities of edges that are not in this graph.",
                    "label": 0
                },
                {
                    "sent": "And this we have an assumption that the existence of the H like ages existing over age is independent so.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here is a short introduction and there's.",
                    "label": 0
                },
                {
                    "sent": "Core decomposition of certain graphs.",
                    "label": 1
                },
                {
                    "sent": "So why we decided to bring this two things together?",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we actually wanted to extend the graph tool of core decomposition and of course in the context of uncertain graphs.",
                    "label": 0
                },
                {
                    "sent": "So you might be wondering on come on why is it important?",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "They actually because some complications.",
                    "label": 0
                },
                {
                    "sent": "And the fact is that if you can perform according composition in a case of deterministic graph in linear time, it doesn't.",
                    "label": 1
                },
                {
                    "sent": "It's still not guarantee US efficiency as in the case of uncertain T graph in that certain graph.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for example, if you ask this simple question.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Any two vertices in the graph connected.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In deterministic graph it would be.",
                    "label": 1
                },
                {
                    "sent": "It would be just a simple scanner for graph, but in the case of uncertain graph it become.",
                    "label": 1
                },
                {
                    "sent": "Sharpie complete problem because you need to compute the probability that we have to connect.",
                    "label": 0
                },
                {
                    "sent": "It is.",
                    "label": 0
                },
                {
                    "sent": "I think it'd be paper two years ago.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so in order to define the key core decomposition of uncertain graph, we actually had to introduce the kind of level of uncertainty threshold 1 certain seatta, so we.",
                    "label": 0
                },
                {
                    "sent": "Using this threshold uncertain severe, able to introduce probabilistic ahead, of course, which are in a waste like repeating a definition for deterministic graph, but use this uncertainty.",
                    "label": 0
                },
                {
                    "sent": "Hello so probabilistic kayaker of uncertain graph G is a maximal sub graph such that the probability that not.",
                    "label": 1
                },
                {
                    "sent": "In this sub graph has degree at least large is an equation, K is larger than at a, so we kind of we have we have like 2 levels, so we first have a level of having degree and having a degree with such probability as large as an editor.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in general, what when we need to calculate probabilistic categories graph, we need to find the probability of some node to have degree larger than K. So in this case I mean they have small example.",
                    "label": 0
                },
                {
                    "sent": "Again we have node V with degree 3.",
                    "label": 0
                },
                {
                    "sent": "In some uncertain graph, and then for example, probability of not having degree larger than two is some of the probability.",
                    "label": 0
                },
                {
                    "sent": "Some of the probability to have degree two and the craft degree three and so.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then gently so you actually can find it.",
                    "label": 0
                },
                {
                    "sent": "Simple formula by summing probability of being.",
                    "label": 0
                },
                {
                    "sent": "Summing probabilities, So what you can see in this case we actually get gives an idea.",
                    "label": 0
                },
                {
                    "sent": "This probability is monotonically nonincreasing whiskey, and by using this this property we were able to define a special notion again and so uncertain degree 4.",
                    "label": 1
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Graph, which I'm going to introduce in this slide so we have again this address code and then we have A at a degree of.",
                    "label": 0
                },
                {
                    "sent": "Every repair techs in uncertain graph is defined as a maximum K such the probability of having the largest key is larger than ever.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here's an example, depending of course on the level of uncertainty you can, you can have different degrees.",
                    "label": 0
                },
                {
                    "sent": "So like you can have degree 3, two or one or like a simple case when uncertainties like level of service should be one, then you have degree 0.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So this is a defining set.",
                    "label": 0
                },
                {
                    "sent": "The degree was one of the main.",
                    "label": 0
                },
                {
                    "sent": "My dear, on this paper an by by using this as a degree.",
                    "label": 0
                },
                {
                    "sent": "You cannot.",
                    "label": 0
                },
                {
                    "sent": "We were able actually to define a key at the core decomposition in a similar way as in deterministic K, But in this case, in this case, instead of like considering degree degrees, we had to consider at the degrees there is a lot of theorems and formulas, and in our paper and I decided that we will get.",
                    "label": 1
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Parents are just show you the main results and if you are interested more details you can come to me or like read the paper.",
                    "label": 0
                },
                {
                    "sent": "OK, so first of all.",
                    "label": 0
                },
                {
                    "sent": "Define exist in keota decomposition.",
                    "label": 0
                },
                {
                    "sent": "Such way we were able to prove uniqueness and existence scare according composition or for uncertain graphs, which is if you would define that a bit different way.",
                    "label": 1
                },
                {
                    "sent": "It's not always the truth.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "2nd, If you actually start to compute the naive way like.",
                    "label": 0
                },
                {
                    "sent": "If you start the computer computing at a degree so naive way you can get into exponential time.",
                    "label": 1
                },
                {
                    "sent": "And to our process, we had to be managed to define a dynamic programming method for Chaotic or decompositions and.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Using this this problem, but by using this method we were able to show that running time of care course decomposition could be again.",
                    "label": 0
                },
                {
                    "sent": "The baby and linear as a parameters with them.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                },
                {
                    "sent": "Number of edges in the graph and Delta is a maximum at a degree of all vertices.",
                    "label": 1
                },
                {
                    "sent": "OK, so using this showing the linearity of the composition was one of the biggest things.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But when we start to look later.",
                    "label": 0
                },
                {
                    "sent": "5 minutes OK. We start to calculate that.",
                    "label": 0
                },
                {
                    "sent": "We found that sometimes it was very slow because at the beginning you had to actually calculate all initial at degrees.",
                    "label": 0
                },
                {
                    "sent": "So we proposed also faster compute lower bounds on at the degree.",
                    "label": 0
                },
                {
                    "sent": "So like at beginning you can use a lower bound for this degree, and then when I actually.",
                    "label": 1
                },
                {
                    "sent": "You process is not during the key, so you can position.",
                    "label": 0
                },
                {
                    "sent": "You can find the exact value and it's actually speed up very much.",
                    "label": 1
                },
                {
                    "sent": "The real computation, OK?",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is like my results of my results have shown in this work I'm going to show you quickly two applications where the key at the decomposition could be successful.",
                    "label": 0
                },
                {
                    "sent": "Useful, successfully used, can be successfully used, so one is test driven team formation and the second influence maximization problem.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in the task driven team formation, we have a collaboration graph versus AI.",
                    "label": 1
                },
                {
                    "sent": "Individuals ages exhibited probabilistic topic models representing the topics of past collaborations.",
                    "label": 1
                },
                {
                    "sent": "So I mean if I'm connecting to somebody, I'd like probably have like some some distribution in math, graph theory and so on.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we have a curious setup, cure Cura para ti, que TE is a set of terms describing a new task and Q is a set of vertices.",
                    "label": 0
                },
                {
                    "sent": "So set of individuals you want to include this new team.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the goal is to find an answer, search to find a team which would be a good theme for this task.",
                    "label": 1
                },
                {
                    "sent": "Describe I see.",
                    "label": 1
                },
                {
                    "sent": "So you using this probabilistic topic model and using this collaboration graph, we can actually built in a certain graph and by performing key key data quality composition we can solve this problem easily.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, the second problem is the 2nd application is influence mechanization problem and in this case we have chosen.",
                    "label": 0
                },
                {
                    "sent": "To look on the independent Cascade model, so independent Cascade model links have associated probabilities and every active node like only single chance to activate each of its each of currently inactive neighbors.",
                    "label": 1
                },
                {
                    "sent": "With this probability age probably.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here's a short example.",
                    "label": 0
                },
                {
                    "sent": "Again, we have us not V. Each accident this moment so.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then you toss a coin and then I got the two of the neighbors of the gold activated WNY and then again.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This process continues until there is no more notes to activate.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the idea of course, for influence maximization problem is to find a set given us some fixed size small S such that this set is maximized.",
                    "label": 0
                },
                {
                    "sent": "The overall spread over network and it could be useful, for example for viral market marketing.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in general this of course is NP hard problem.",
                    "label": 0
                },
                {
                    "sent": "Not a big surprise, but this greedy algorithms that helps solve it in some way so you can add every every vertex, bring his largest here again in the picture function an.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It would be super super good, but still of course because it's crazy.",
                    "label": 0
                },
                {
                    "sent": "It's a super slow.",
                    "label": 0
                },
                {
                    "sent": "So then what we can do, we can actually.",
                    "label": 0
                },
                {
                    "sent": "I mean we don't need to run it sometimes in the whole graph we can actually reduce the graph by some room and run the greedy algorithm, OK?",
                    "label": 1
                },
                {
                    "sent": "This crazy algorithm on on this graph.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we were opposed in this case to use a category decomposition for this problem.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because in a deterministic case, apparently the key core index was a direct indicator of expected spread of any vertex.",
                    "label": 1
                },
                {
                    "sent": "At least it was experimentally shown.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here's a small example of.",
                    "label": 0
                },
                {
                    "sent": "Run on Twitter, graph based.",
                    "label": 0
                },
                {
                    "sent": "The influence probability will learn from fast propagation of funerals, and here is we consume the.",
                    "label": 0
                },
                {
                    "sent": "Right one the chaotic war.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Based method outperforms all the best lines which is like just out degree at a degree.",
                    "label": 0
                },
                {
                    "sent": "OK query and this for different set.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in general, let me conclude the general we have extended the graph tool of core decomposition to context of uncertain graphs.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have defined at the key at the current concept and device efficient algorithm for computing an active acquired composition.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have extensively evaluated if you look at our work, you can see there's much more many more experiments.",
                    "label": 0
                },
                {
                    "sent": "We have extensively investigated our definitions and methods on a number of real life datasets and application.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there's a future work we think about investigate this relationship between kata course, another definition, probably probabilistic dense subgraphs.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here is it.",
                    "label": 0
                },
                {
                    "sent": "I'm saying I'm right on time.",
                    "label": 0
                },
                {
                    "sent": "Is there any questions?",
                    "label": 0
                }
            ]
        }
    }
}