{
    "id": "kns6rinhqfrw3bwopyuhhnbcarchonkm",
    "title": "Towards a cloud-enabled Java EE platform",
    "info": {
        "author": [
            "Robert Dukarić, Faculty of Computer and Information Science, University of Ljubljana"
        ],
        "published": "Nov. 16, 2012",
        "recorded": "October 2012",
        "category": [
            "Top->Computers->Software"
        ]
    },
    "url": "http://videolectures.net/classconference2012_dukaric_platform/",
    "segmentation": [
        [
            "Hello everyone, my name is Robert do karic.",
            "I come from the University of Ljubljana, Faculty of Computer and Information Science, so I will talk instead of my colleague rock push here.",
            "So we will be discussing synergies between two complementary technologies, Javaee platform and cloud computing."
        ],
        [
            "So I would like to begin with introducing and destroy, describing each of those technologies.",
            "So what exactly is Javaee platform?",
            "It's actually a set of technologies specification and an actual standard that allows developers and end users to implement their own information systems that are multi tier, so it actually enables development of multi tier applications where each tier.",
            "Can run on a separate location, so those tiers are that database tier, business tier, presentation tier and of course the client website.",
            "The challenges that lie ahead here, especially from the highly highly highly high availability and scalability, is actually present at this middle tier with business team presentation tier, so those middle middle tier actually has to has to be architected in a way so it can achieve high high availability and scalability."
        ],
        [
            "So concerning cloud computing, cloud computing is not only a new delivery model, it's also apparent digging for provisioning computing resources.",
            "So the most attention was recently given to three types of cloud computing, free service deliveries.",
            "First of all, infrastructure as a service.",
            "Second of all platform as a service.",
            "An fir type is software as a service and for all work.",
            "The most important, the most relevant type of cloud computing.",
            "It will be platform as a service.",
            "As you already probably know the value the most known well known past providers.",
            "We've already heard something about Windows Azure today or first speaker, or actually put their model system on top of it.",
            "Then Google App Engine, Elastic Beanstalk, San.",
            "We could find the several others that several other vendors.",
            "Since there are a lot of them out there in the market."
        ],
        [
            "So what is actually the problem domain here?",
            "The problem here actually is that current Java EE containers are not fully architected to execute applications in the cloud.",
            "Why is this so?",
            "This is so because there is no support for first multi tenancy.",
            "There is no support for elasticity and there is no support for monitoring an, at least when we talk about a cloud specific cloud specific features that we want to.",
            "That we want to harness.",
            "So what is multi tenancy?",
            "Multi tenancy is principle of sharing resources among several tenants elasticities scaling is about is about meeting the demand by scaling up or down the resources according to users needs and monitoring will know it's about monitoring usage, scalability but also service level agreements and service level objectives.",
            "So our method or methodology in designing a model that defines this synergy between those two components was, first of all to identify models for multi tenant environment identifying metrics to support scaling, identifying monitoring metrics, defining the parameter system for identified metrics and actually later on to map this parameter system into Java a specific.",
            "Mutation types which we later on also validated on the metadata system."
        ],
        [
            "So about multitenancy I will just briefly introduce some basic multitenancy concept.",
            "It's actually pretty much connected with where the application should run the model type specified the application runs on individual on separate standalone machine."
        ],
        [
            "The model Type 2 specifies that they actually tenants have to share share physical resources, but are actually segregated in terms of virtualization."
        ],
        [
            "And the model model Type 3 specifies that.",
            "Tenants have to share both virtual machine and physical resources, but are actually segregated in terms of application server and their application running on top of it."
        ],
        [
            "So the model Type 4 is an extension of Type 2 and what it actually does it goes.",
            "It goes to the one lower less, and it actually segregates different different components different.",
            "In this concrete example, our session bids.",
            "So with this architecture we can achieve that different tenants can be actually present in the same EJB container."
        ],
        [
            "So about our model about our parameter system.",
            "This is actually the contribution in this article.",
            "So actually structured several parameters in free groups.",
            "First group was monitoring Group, second Group was LST, Citigroup and the first group was Multitenancy Group.",
            "The monitoring group later on includes global application parameters and local parameters.",
            "Global application parameter specifies the annotation for server related meta data and descriptor for controlling the location of application execution.",
            "So in this application deployment descriptor we can actually specify.",
            "There are data with run where are middle tier, Ronan Warfront anger and so and the local parameters stations for content delivery, network caching, annotations for triggering methods upon creation of new web container.",
            "And of course rotations for pushing the modifications in terms when SLO violations occur.",
            "Electricity, on the other hand, list ecity group.",
            "On the other hand, introduces horizontal elasticities parameters.",
            "Those parameters are descriptors for defining number of GP web containers, rules for defining auto scaling and descriptor for defining session replication type.",
            "We didn't see the last group includes includes six parameter groups.",
            "Subgroups, first subgroup is EJB parameters.",
            "Those parameters are uh, notations for declaring it should be container that are either shared or nonshared GPA parameters.",
            "There are annotations for defining type of tenant insulation in a database server server at parameters that include annotations for declaring web container shared.",
            "I'm sure you have a message, service, annotations or parameters are Papa annotations for consuming tenant specific topics and queues than min, scope parameters and Mail session and data sources parameters.",
            "So I don't stay too long at this."
        ],
        [
            "Is slide."
        ],
        [
            "So actually, what did we do?",
            "So we designed a parameter system.",
            "It's actually a generalized picture.",
            "What an application has to be aware when we put it in the cloud, so later on then we use this metadata system and applied it in a particular technology.",
            "This technology is Java, a platform.",
            "So within this metadata system with the ballot we developed actually 9 monitoring for electricity.",
            "The 9 multitenancy meta data meta data actually include the extensions of existing declarations within the specification definition of definitions of new annotation types and extension of global application configuration.",
            "Document.",
            "And that actually describes the global behavior of application 01 concrete example.",
            "So on the left side you have a multitenancy parameter.",
            "That was derived into five different annotation types that we introduced into Java EE platform.",
            "Multi tenant JMS consumer tenant scoped data source definition and Mail session.",
            "This is only one of such examples examples.",
            "Those annotations are actually there are much there.",
            "There are many different notations involved in our in our model.",
            "So."
        ],
        [
            "If we if we show this in more detail, so on the left upper corner left Upper Corner you can see the declaration how the Declaration looks like according to the specification.",
            "This is declaration of a new brand new annotation type and then I use case we put annotation multi tenant on top of a concrete server.",
            "Let that set that this server.",
            "It will have to be executed in a shared environment.",
            "Example two shows extension of a global application descriptor.",
            "In this case we extended the application XML schema to be cloud aware.",
            "So when we specify the number of instance count, the EJB containers have initially be instantiated with this amount of number."
        ],
        [
            "So metadata metadata for specifying number of GB and number of web containers were actually implemented and tested in Java EE compliant Oracle Glassfish Server.",
            "We actually developed an application that we that we will be tested on.",
            "A real scenario for the Postal Bank of Slovenia once was implemented on server without cloud specific extensions and once on the server with cloud specific.",
            "Extensions and what we did.",
            "We measured the configuration time and in first case it took the user on average 54 seconds of manual intervention to configure the cluster so it included triggering VM deployment, configuring server contextualization's etc and in second case configuration tests were executed in just over 2 seconds and even more important there was no need for personnel on standby waiting to take the scaling.",
            "Actions."
        ],
        [
            "So that's all for my side.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello everyone, my name is Robert do karic.",
                    "label": 0
                },
                {
                    "sent": "I come from the University of Ljubljana, Faculty of Computer and Information Science, so I will talk instead of my colleague rock push here.",
                    "label": 0
                },
                {
                    "sent": "So we will be discussing synergies between two complementary technologies, Javaee platform and cloud computing.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I would like to begin with introducing and destroy, describing each of those technologies.",
                    "label": 0
                },
                {
                    "sent": "So what exactly is Javaee platform?",
                    "label": 0
                },
                {
                    "sent": "It's actually a set of technologies specification and an actual standard that allows developers and end users to implement their own information systems that are multi tier, so it actually enables development of multi tier applications where each tier.",
                    "label": 0
                },
                {
                    "sent": "Can run on a separate location, so those tiers are that database tier, business tier, presentation tier and of course the client website.",
                    "label": 1
                },
                {
                    "sent": "The challenges that lie ahead here, especially from the highly highly highly high availability and scalability, is actually present at this middle tier with business team presentation tier, so those middle middle tier actually has to has to be architected in a way so it can achieve high high availability and scalability.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So concerning cloud computing, cloud computing is not only a new delivery model, it's also apparent digging for provisioning computing resources.",
                    "label": 0
                },
                {
                    "sent": "So the most attention was recently given to three types of cloud computing, free service deliveries.",
                    "label": 1
                },
                {
                    "sent": "First of all, infrastructure as a service.",
                    "label": 1
                },
                {
                    "sent": "Second of all platform as a service.",
                    "label": 0
                },
                {
                    "sent": "An fir type is software as a service and for all work.",
                    "label": 0
                },
                {
                    "sent": "The most important, the most relevant type of cloud computing.",
                    "label": 0
                },
                {
                    "sent": "It will be platform as a service.",
                    "label": 0
                },
                {
                    "sent": "As you already probably know the value the most known well known past providers.",
                    "label": 0
                },
                {
                    "sent": "We've already heard something about Windows Azure today or first speaker, or actually put their model system on top of it.",
                    "label": 1
                },
                {
                    "sent": "Then Google App Engine, Elastic Beanstalk, San.",
                    "label": 0
                },
                {
                    "sent": "We could find the several others that several other vendors.",
                    "label": 0
                },
                {
                    "sent": "Since there are a lot of them out there in the market.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is actually the problem domain here?",
                    "label": 0
                },
                {
                    "sent": "The problem here actually is that current Java EE containers are not fully architected to execute applications in the cloud.",
                    "label": 1
                },
                {
                    "sent": "Why is this so?",
                    "label": 0
                },
                {
                    "sent": "This is so because there is no support for first multi tenancy.",
                    "label": 0
                },
                {
                    "sent": "There is no support for elasticity and there is no support for monitoring an, at least when we talk about a cloud specific cloud specific features that we want to.",
                    "label": 0
                },
                {
                    "sent": "That we want to harness.",
                    "label": 0
                },
                {
                    "sent": "So what is multi tenancy?",
                    "label": 1
                },
                {
                    "sent": "Multi tenancy is principle of sharing resources among several tenants elasticities scaling is about is about meeting the demand by scaling up or down the resources according to users needs and monitoring will know it's about monitoring usage, scalability but also service level agreements and service level objectives.",
                    "label": 1
                },
                {
                    "sent": "So our method or methodology in designing a model that defines this synergy between those two components was, first of all to identify models for multi tenant environment identifying metrics to support scaling, identifying monitoring metrics, defining the parameter system for identified metrics and actually later on to map this parameter system into Java a specific.",
                    "label": 0
                },
                {
                    "sent": "Mutation types which we later on also validated on the metadata system.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So about multitenancy I will just briefly introduce some basic multitenancy concept.",
                    "label": 0
                },
                {
                    "sent": "It's actually pretty much connected with where the application should run the model type specified the application runs on individual on separate standalone machine.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The model Type 2 specifies that they actually tenants have to share share physical resources, but are actually segregated in terms of virtualization.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the model model Type 3 specifies that.",
                    "label": 0
                },
                {
                    "sent": "Tenants have to share both virtual machine and physical resources, but are actually segregated in terms of application server and their application running on top of it.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the model Type 4 is an extension of Type 2 and what it actually does it goes.",
                    "label": 1
                },
                {
                    "sent": "It goes to the one lower less, and it actually segregates different different components different.",
                    "label": 0
                },
                {
                    "sent": "In this concrete example, our session bids.",
                    "label": 0
                },
                {
                    "sent": "So with this architecture we can achieve that different tenants can be actually present in the same EJB container.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So about our model about our parameter system.",
                    "label": 0
                },
                {
                    "sent": "This is actually the contribution in this article.",
                    "label": 0
                },
                {
                    "sent": "So actually structured several parameters in free groups.",
                    "label": 0
                },
                {
                    "sent": "First group was monitoring Group, second Group was LST, Citigroup and the first group was Multitenancy Group.",
                    "label": 0
                },
                {
                    "sent": "The monitoring group later on includes global application parameters and local parameters.",
                    "label": 0
                },
                {
                    "sent": "Global application parameter specifies the annotation for server related meta data and descriptor for controlling the location of application execution.",
                    "label": 1
                },
                {
                    "sent": "So in this application deployment descriptor we can actually specify.",
                    "label": 1
                },
                {
                    "sent": "There are data with run where are middle tier, Ronan Warfront anger and so and the local parameters stations for content delivery, network caching, annotations for triggering methods upon creation of new web container.",
                    "label": 0
                },
                {
                    "sent": "And of course rotations for pushing the modifications in terms when SLO violations occur.",
                    "label": 0
                },
                {
                    "sent": "Electricity, on the other hand, list ecity group.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, introduces horizontal elasticities parameters.",
                    "label": 1
                },
                {
                    "sent": "Those parameters are descriptors for defining number of GP web containers, rules for defining auto scaling and descriptor for defining session replication type.",
                    "label": 1
                },
                {
                    "sent": "We didn't see the last group includes includes six parameter groups.",
                    "label": 0
                },
                {
                    "sent": "Subgroups, first subgroup is EJB parameters.",
                    "label": 1
                },
                {
                    "sent": "Those parameters are uh, notations for declaring it should be container that are either shared or nonshared GPA parameters.",
                    "label": 0
                },
                {
                    "sent": "There are annotations for defining type of tenant insulation in a database server server at parameters that include annotations for declaring web container shared.",
                    "label": 0
                },
                {
                    "sent": "I'm sure you have a message, service, annotations or parameters are Papa annotations for consuming tenant specific topics and queues than min, scope parameters and Mail session and data sources parameters.",
                    "label": 0
                },
                {
                    "sent": "So I don't stay too long at this.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is slide.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So actually, what did we do?",
                    "label": 0
                },
                {
                    "sent": "So we designed a parameter system.",
                    "label": 1
                },
                {
                    "sent": "It's actually a generalized picture.",
                    "label": 0
                },
                {
                    "sent": "What an application has to be aware when we put it in the cloud, so later on then we use this metadata system and applied it in a particular technology.",
                    "label": 0
                },
                {
                    "sent": "This technology is Java, a platform.",
                    "label": 0
                },
                {
                    "sent": "So within this metadata system with the ballot we developed actually 9 monitoring for electricity.",
                    "label": 1
                },
                {
                    "sent": "The 9 multitenancy meta data meta data actually include the extensions of existing declarations within the specification definition of definitions of new annotation types and extension of global application configuration.",
                    "label": 0
                },
                {
                    "sent": "Document.",
                    "label": 0
                },
                {
                    "sent": "And that actually describes the global behavior of application 01 concrete example.",
                    "label": 1
                },
                {
                    "sent": "So on the left side you have a multitenancy parameter.",
                    "label": 1
                },
                {
                    "sent": "That was derived into five different annotation types that we introduced into Java EE platform.",
                    "label": 0
                },
                {
                    "sent": "Multi tenant JMS consumer tenant scoped data source definition and Mail session.",
                    "label": 0
                },
                {
                    "sent": "This is only one of such examples examples.",
                    "label": 0
                },
                {
                    "sent": "Those annotations are actually there are much there.",
                    "label": 0
                },
                {
                    "sent": "There are many different notations involved in our in our model.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If we if we show this in more detail, so on the left upper corner left Upper Corner you can see the declaration how the Declaration looks like according to the specification.",
                    "label": 0
                },
                {
                    "sent": "This is declaration of a new brand new annotation type and then I use case we put annotation multi tenant on top of a concrete server.",
                    "label": 1
                },
                {
                    "sent": "Let that set that this server.",
                    "label": 0
                },
                {
                    "sent": "It will have to be executed in a shared environment.",
                    "label": 0
                },
                {
                    "sent": "Example two shows extension of a global application descriptor.",
                    "label": 1
                },
                {
                    "sent": "In this case we extended the application XML schema to be cloud aware.",
                    "label": 1
                },
                {
                    "sent": "So when we specify the number of instance count, the EJB containers have initially be instantiated with this amount of number.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So metadata metadata for specifying number of GB and number of web containers were actually implemented and tested in Java EE compliant Oracle Glassfish Server.",
                    "label": 1
                },
                {
                    "sent": "We actually developed an application that we that we will be tested on.",
                    "label": 1
                },
                {
                    "sent": "A real scenario for the Postal Bank of Slovenia once was implemented on server without cloud specific extensions and once on the server with cloud specific.",
                    "label": 0
                },
                {
                    "sent": "Extensions and what we did.",
                    "label": 0
                },
                {
                    "sent": "We measured the configuration time and in first case it took the user on average 54 seconds of manual intervention to configure the cluster so it included triggering VM deployment, configuring server contextualization's etc and in second case configuration tests were executed in just over 2 seconds and even more important there was no need for personnel on standby waiting to take the scaling.",
                    "label": 1
                },
                {
                    "sent": "Actions.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's all for my side.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}