{
    "id": "knsgwyozhtudift2fevcs4irxgd6gy36",
    "title": "Harnessing nanopores for single-molecule enzymology and protein sequencing",
    "info": {
        "author": [
            "Giovanni Maglia, Faculty of Science and Engineering, University of Groningen"
        ],
        "published": "Sept. 25, 2018",
        "recorded": "April 2017",
        "category": [
            "Top->Chemistry"
        ]
    },
    "url": "http://videolectures.net/preglov_maglia_harnessing_nanopores/",
    "segmentation": [
        [
            "So today I'm going to talk about a couple of projects that are going on in my lab.",
            "Actually you mentioned there see Grant.",
            "The first is was about my first year C grant.",
            "Which is, you know, single currency, myologie nanopore switch, very surprisingly, because when you right there you see Grant needs to be very kind of ambitious kind of project actually works particularly well.",
            "I really didn't believe that would happen.",
            "I'm very lucky as a scientist cause a lot of projects they started actually.",
            "Work against any odd, which is really not my merit really.",
            "Just luck clear lack.",
            "The merit is in doing something very ambitious and don't remember about all the failures and justice.",
            "Concentrate about the things they work because when they work they're really pretty good.",
            "And then the second is about something that's starting now, which I just received the second year.",
            "See Grant on protein sequencing, which again is something they want to start because it was incredibly difficult.",
            "And again, I can.",
            "Tell you something that seems to be working.",
            "That direction is just the first step, but I think is quite promising.",
            "So like today I'm going to talk about these two things about you know how to use non reports for for these two subjects."
        ],
        [
            "One is going to tell you about what is now poor technology, so if you already know some that don't.",
            "So I'm going to just go through the basics of an airport technology and then I'm going to tell you how you know you're going to actually do single markers emoji, but also how to harness this kind of new system to do new sensors which may come to light in the future.",
            "Then I'm going to tell you how you can take some to identify some proteins.",
            "Using the same the same thing, but the underlying kind of subject that we have, is that really we are trying to learn from the physical point of view how to control the transport of proteins across nanopore.",
            "So like they all talk is going to be about single molecules, so we're going to work with one molecule at a time, and then if you're not used to thinking single molecules real, the main challenge that you have there is that.",
            "When you get to that sort of dimension, you have thermal motions.",
            "There really dominate your world, so you really need to find a way harness and forces that can actually allow you to manipulate single molecules and test to fight thermal fluctuations.",
            "And now of course you know you can do that without of course, and they're going to tell you how you can do that."
        ],
        [
            "But you know, there is also the reason why you might be interested in this kind of research.",
            "Is that because we don't see very well out of focus, but you know in the cell protein are extruded through nanoscale aperture all the time that you know if you wouldn't happen that we will be alive.",
            "For example, you have a project.",
            "Transport which is you know, core transitionally while you make a protein, you know protein are actually extruded through another portal which is the translate cone into different kind of.",
            "Part of the membrane, so you might have a potential applied there.",
            "In this case it's not, but sometimes you actually apply potential.",
            "An is not really known.",
            "How are the physical level that kind of process happens, so this is called transitional.",
            "Sometimes is after you know after is already folded, protein is actually channeled through a poor, or sometimes you even have folded protein that has folded.",
            "There are transported across a poor across membrane and this is even.",
            "Less understood is really not known how this happened, and then you have nanomachines in the cell that actually they do that to destroy proteins.",
            "So when you protein is labeled for with a big team, for example, the signal that tells that this protein is not necessary anymore, so it gets the words into this system where you have protein that is unfolding is called clip X that unfolded protein, fed it through what is actually another poor, and there's a linear kind of segment here is cleaved.",
            "In different pieces, so it can be recycled, but undestroyed by the cell.",
            "So there are many prospect that we have is not very easy."
        ],
        [
            "To study this kind of system, especially if you want to do it at the single molecule level and the way we do it, is by using biological nanopores this nanopore, slightly different?",
            "They're not.",
            "They don't do that is not a set translator that transport approaching, but what they do, they are usually water soluble monomer that are made by certain cells that script out the cell, and then when they recognize a certain membrane they normally recognized membrane, they form oligomers, often deformity report.",
            "And then they eventually span the lipid barrier, so all the nutrients can go across and pour all the ions go across the across the pour through the membranes and the and the cell is killed all the pores.",
            "They're actually format the outer membranes to allow a transport of several nutrients between the outer membrane.",
            "But the important part here is that you have this little hole here, which actually creates what we want for the for this talk.",
            "And the fact that important part here is that they are really very stable.",
            "So like people think about proteins are really unstable entities.",
            "But actually if you have this poor most the time, you can really boil them and still active.",
            "Or you can put in PH-2 and still nothing happens to them.",
            "They are the GI Joe of the cell release or something that really need to kill other cells.",
            "So like this credit.",
            "So they're really tough most of the time and it's very good for what we wanted."
        ],
        [
            "But now we don't really need the poor.",
            "We need to have a system that actually studied molecule.",
            "The single molecule level.",
            "So how they work?",
            "So we have ways to actually have a logical membranes.",
            "Here we isolate like a lipid bilayer.",
            "So what is made by the cell we can make it chemically well.",
            "Company makes for us and we can have a way to actually separate 2 chambers by this sleeping membrane.",
            "So if you apply a potential which is very important, you apply a potential here across the nanopore.",
            "And if there is nothing here, just remember you have the ions here from both sides of the poor.",
            "They cannot go across the North Pole, so you have 0 current that you can see there.",
            "As soon as you have a single pour that penat."
        ],
        [
            "Traits the nipping bilayer that's stochastic events just happens once in awhile.",
            "When you have a little amount of this protein going to the nanopore, then we're going to see that the current jumps to a certain level, and this is the signal that actually we're going to use to study proteins and to actually control transport across the nanopore, just to give an example, this signal is given by about 10 to the nine irons, like what billions per second, so is quite a large number of ions, and we seek and very small difference about this.",
            "The science and you know, just you know this step here tells you that you have only one of these nanopore inside your system inside your lipid bilayer, and that's really crucial.",
            "We want to do is just to give an example.",
            "You know when you know when you go out in the evening, and then you come back next day a bit with a headache and you take your tablet.",
            "So if you proof and you have a bit more molecule in that 10 to 21, so it's actually very hard normally to actually work with single molecules, and we can do that in a very simple way.",
            "This is actually the first single molecule technique.",
            "They haven't been invented in 1970s.",
            "An basically really leave work in the same sort of technology.",
            "We just have computer now.",
            "They make our life easier rather than see all the signal on papers, but basically."
        ],
        [
            "The same sort of technique now.",
            "What are the forces that allow us to manipulate this molecule at the single molecule level?",
            "So when you work with DNA, when you want to sequence in a or want to just work with you, in general the only force that you really want to consider is the electrophoretically force.",
            "So I told you already that you apply a potential across the map, or in this case a negative potential.",
            "So you're going to have the positive molecule that you're going to place right in the middle of the poor will be attracted.",
            "And you want to go towards the negative potential is not linear.",
            "I mean that's how the potential goes inside this non core is about linear about this point.",
            "And then here are all the charges.",
            "In red is the charge of the nanopore is negative charge, and in blue the positive charge also influenced this kind of potential that you have quite complex doesn't matter for what we want to do now, but the point here is that you have this force here literally force, which is directly proportional to the applied potential.",
            "That you apply there and the charges that you have.",
            "So that's a very strong force.",
            "About Tampico newtons.",
            "When you work with DNA, when applied 150 millivolts and that kind of is the limits of forces that you really want to use in nature anyway.",
            "If you want to go really much higher forces you start to denature and start to kind of not breaking bonds, but kind of change the property of.",
            "System, so that's kind of good force that you want to use the problem when you start to use proteins is that they don't have really a charge well defined charge like DNA.",
            "The protein also are folded, so it's different than DNA, so we actually need to kind of have another force really to actually start to manipulate proteins.",
            "Fortunately, this force."
        ],
        [
            "Cyst and it's called electromatic flow.",
            "So is a little bit less obvious to understand.",
            "What is this lattice multiflow?",
            "So basically you can imagine as the flow of water an iron that happen across another person.",
            "But like when you go against the wind you get a force against you because the wind is blowing quite fast.",
            "You can lean on the window, sometimes you can even support all the weight your body weight.",
            "So it's the same kind of idea that you have is brilliant sort of force.",
            "Don't know why this counting happened.",
            "But this was nothing embarrassing is going to come up now.",
            "Anne.",
            "So this kind of force here also is on the typical of few Pico Newtons, an basically what you have the charges around the size of the Northport.",
            "I'll show you before they're quite negatively charged so you have a flux of positive ion from top to bottom when you plan a trip potential they will bring about water and then create a force in the same way that the wind creative force or knew that can actually act on the poor.",
            "This force is not constant, so like in this part of the poor.",
            "Is about constant.",
            "You can see here is rugs but quite constant.",
            "But it's much much stronger when there's a construction which is really accelerate and it becomes much stronger and that is the force that really work in our system.",
            "There's the first they want to use for if you want to sequence proteins, this is the force that you want to use if you want to actually do single molecules emoji.",
            "That means that if you want to track molecule in there, you use the letters multi flow which is does not depend on the charge, only depends on the size of the molecule.",
            "And an intensity of the water flow, which depends ultimately on how much charge you have.",
            "An well the sign of the charge in your pour that you have.",
            "Movies in the opposite direction no.",
            "It depends.",
            "So in this case you apply a negative potential.",
            "You have the port.",
            "You can imagine the poor is like a cylinder full of charge.",
            "Because these ports are negatively charged, is full of positive charge.",
            "So you can imagine that you have the full of positive charge.",
            "You apply negative charge.",
            "The publisher is going to be that way.",
            "Let us multi flow going to go that way if you apply a positive charge, the charge is going to be opposite way, so we're going to the opposite way.",
            "So it depends.",
            "On you know the application of force an of your potential now.",
            "It is usually at the opposite as they let 40 fours.",
            "Becausw getting complicated, but usually you're right and that's one thing they're going to go to the end if you get to that point, but you need to remember that you have to think about these elaborate.",
            "If course let US model flow as the main force to actually keep the protein inside another port on the physical level.",
            "If you don't want to think in that way, just play something that keeps the protein inside."
        ],
        [
            "Now I need to put these slides because that's kind of his.",
            "You know, most of the popularity of the nanopores come from that was actually my postdoctoral work, the one that I thought it would never work, that I started my post Doc.",
            "And that's actually how to sequence DNA with airport is just one slide, because on the work on that anymore.",
            "But just to let you know, you have a double strand DNA, you have a motorhome molecular machine that can unzip the DNA base by base, and then if it's it through the nanopore.",
            "And then you have this electric field, not let's model flow electric field.",
            "In this case the cause is the dominant force.",
            "If you have a holy uniformly charged polymer, they actually really stretch.",
            "But tentacle neutral force the inside portion makes it very nicely there.",
            "So the ionic current issue at the beginning can actually pass through the poran recognize base by base effectively doesn't recognize one base that I'm recognize.",
            "A bunch of them, but that's not really important important part that you have.",
            "Machine that actually unzip 1 by 1. the DNA fits base by base and then you have a unique current pass to the poor, which is sensitive enough to see tiny differences in the basis in the in the kind of composition of the DNA.",
            "That's how DNA sequence works.",
            "You can buy one of these machines to sequence your DNA.",
            "You can take it to the moon or the Amazon forest wherever they people try to sell you.",
            "The machine will tell you, but it works and you can actually sequenced DNA right now.",
            "Best kind of the swiggle signal that you see."
        ],
        [
            "When you want to do that now, but the problem when you do with proteins, well, I told you already, you cannot use letter for the force you need to use the Let's Matic flow, which we find out as we went along is actually very strong and it works pretty well.",
            "Before I started where we pretend we didn't know existed, I mean you know existed by we didn't really know it was good enough to do what we do.",
            "Another update there already know how.",
            "Congratulations Anne, so this works works very well.",
            "Again, we were lucky we didn't know existed exist, but then we also need to convince the project to get into the poor, right?",
            "You know this, you know this difference between this multi floral parade force then we need to actually recognize the property of the protein itself.",
            "You know.",
            "So if you do single McKinsey myologie you want to recognize different confirmation in the protein.",
            "Want to recognize?",
            "A subset comes in, substrate comes out and etc.",
            "Is this ionic current good enough to do what we want to do, and then on top of that, is that even if you can do all these kind of things together, you know what is the environment inside the poor will unfold a protein that you have in there will actually have a different effect.",
            "You know people build a career telling us that the crowd NIS inside the cell is really bad or really good for proteins.",
            "This is something that really has a huge effect on the way the protein works.",
            "You know, inside the poor is actually a crowded environment.",
            "Will have going to have a difference in whatever we want to do, so this is basically all the things that when I started my UC granting as independent scientists thought that it was really very hard to get it to work.",
            "These kind of things but eventually one by one we find out that actually all these things can be addressed by our system.",
            "This."
        ],
        [
            "Check on application is going to be about what one application is going to be about sequencing protein.",
            "So like this picture is here because it's just kind of the most simple schematic that you're going to have.",
            "How to sync with the protein's like DNA, right?",
            "So you have a poor construction here.",
            "You have more protein in this case called Young full days.",
            "The first slide show you is one of these protein that take protein from the protein set cell.",
            "They unfold them and they threaded through this through this nonpolar they do exist.",
            "We can pair him to that one, and then we're going to recognize base by base problem here is that you know why the protein on Earth should go that direction, right?",
            "So you could go in any other direction because there is not really an electric field, so we went to see if this let's multik flow is strong enough to actually draw the protein across the polypeptide across the nanopore.",
            "But even if you actually can get a super strong electric model flow, if you have a positive charge is going to go One Direction where next show is going to be.",
            "It's in direction, so actually that is multi flow should be much much bigger than the little phoretic force on the single positive charge.",
            "We can go up high few Pico Newton, so really should be a really super strong kind of feel that actually pull the protein, which is something that is, you know, be proven if you can actually do that, but actually."
        ],
        [
            "Also good news.",
            "When you started proteins and proteins are actually not the DNA in other ways.",
            "So actually we know the sequence of proteins that we want to sequence, so you have a problem in our human body.",
            "We know how many protein we have.",
            "We know the sequence.",
            "So actually we don't have to sequence of protein.",
            "We just have to recognize them, right?",
            "So we actually can do a lot of things simply by recognizing that protein rather than sequencing them, so you don't actually have to sequence 20 minute acids.",
            "Maybe you can sequence two or three.",
            "That's going to be enough.",
            "Let's say tryptophan, tyrosine, and liesing, and then you can actually get a fingerprint of your protein that is good enough.",
            "Or you can actually use chemistry.",
            "You can, you know you can label, assisting or liesing.",
            "There's a lot of our technical chemistry.",
            "They allow you to do that.",
            "You put huge kind of stuff on it and then when you can thread that through another port, you just read two amino acids rather than you know that you actually modify, so there are a lot of intermediate steps that you can use that be very successful.",
            "To actually recognize protein and why you want to recognize protein as because there are lot of protein bio market, they are linked to disease so you can actually make a sensor for biomarker linked to disease.",
            "Or simply you want to see post translation, modification or just simply want to measure how many protein you have in a certain sample with certain kind of properties.",
            "So a lot of things you can do.",
            "Not only that."
        ],
        [
            "You actually can sequence.",
            "You can identify proteins that are folded.",
            "You don't need to unfold them.",
            "This would be more complicated.",
            "Probably you will have to separate them, but that's how people in proteomics do it anyway.",
            "The separately column.",
            "They put two 2D gels, and instead of doing mass spec you can actually do some narrow paralysis and then you can have some sort of signal like that.",
            "And if you have signal like that, what you can see, you can recognize a specific protein because specific blockade or is staying there in the port for long enough or short enough you have a specific event here in the.",
            "Height of the current of the duration of the blockades, and then you actually can get you to actually recognize the protein that you want.",
            "You can also integrate this in microfluidic device in the lab on chip device to make everything automated.",
            "There are problems with that.",
            "Indeed, in the way that you need to know have a prior information about the protein so you know that the protein ever certain kind of steps or step counter signal.",
            "You probably cannot get 25,000 signals from the same bunch of proteins, so you probably.",
            "We have to separate the signal and as well at the same time.",
            "You probably want to have a range of different non reports of different size.",
            "That we allowed to sample different kind of protein from the small polypeptides from the large complex of proteins and all kind of things.",
            "So like is a little bit more complex, but actually is another chewable."
        ],
        [
            "Problem that we can find to resolve in that way?",
            "But you know, I'm another kind of approach that we have and is the one that got me much more excited, protein, biochemists, originally, and I really want to do is to actually devise a new technology to actually study proteins.",
            "So proteins are studied, having symbol level for many, many years now and about 20 years ago people started to look at them at the single molecule level, thinking a revolution in the way that we look at produce.",
            "Anne.",
            "Revolution didn't happen really.",
            "Looks like the protein works in a similar way at the single molecule level and multi or on the bulk level, but mainly I hope and I think is because we don't really have right technique to look at them.",
            "So you look a single protein with presence.",
            "So either you need to have a fluorescent substrate that becomes known, fluorescence or non precious subset of conference and they were the first example or you put fresh labeling the protein and you can focus only very small.",
            "Property of the proteins, or using FMT, which is going to form and change the property of the protein.",
            "He don't really have any technique, they look at the single native protein you know, as it is, they don't really exist.",
            "Not only that, you cannot really.",
            "You can only now watch protein for a few seconds and then it's gone.",
            "So you want really to watch the same protein for let's say an hour and see if it goes from different confirmation.",
            "High works really for a long time and then you know how it works.",
            "In the same way that you know if you want if you're an alien.",
            "In space, and you want to see how people work or leave or they behave, you're not going to go to a rock star concert and say, oh, you know they all clap their hands together.",
            "You know they they can leave one arm and just do different kind of things while you want to do is follow one person.",
            "You know when you go home, go to sleep, wake up, kiss goodbye to his kids, etc.",
            "So you want to see they all same person for very long time.",
            "Right and this technique here might just be able to do that because there's not really intrinsic time limitation for this.",
            "Single model and theology allow you to look at a native proteins, but like what also can allow to do here is actually to build new sensors while you build your sensors is because you're going to have an enzyme here that convert whatever it does from you know whatever signal you can have into electrical signal.",
            "So that's a good signal can be powered very easily without trying devices, so therefore you can actually now have your.",
            "Sensor you're touching your under your skin or you just blow your skins.",
            "If you can measure you know whatever about the food you want and then maybe just connected to your mobile phone and can just give you live kind of.",
            "Information about you know whatever concentration of analyte that binds this protein, here you have, so you can actually make sensor to study metabolites right so?"
        ],
        [
            "So I probably should check how much time I have so to see.",
            "Where is that?",
            "Oh yeah, so.",
            "I don't know if I'm going to talk about everything today.",
            "Let's focus on single marker in theology here and then I'll give you a few kind of kind of insights about how we use this non report, specially the frac protein that puts special for you.",
            "Then about how we can actually do it to actually detect in sequence peptides or find information about."
        ],
        [
            "Actors and how to use these letters multi float.",
            "How to induce it to actually do what we want to do and you gotta be quicker.",
            "So there are a lot.",
            "Of course in literature if you want to know more.",
            "I mean you have an expert here that can tell you all about all these pores and we're going to talk to."
        ],
        [
            "Say it's about these two, one is called frac and one is called clay frac is small and you know and it's kind of nice construction there.",
            "Clay is big, is really this kind of nanotube that creates these kind of interior kind of nanoscale test tube to actually start a single molecule, a single protein.",
            "So that's how they look from the inside negatively charged here plus the charge there.",
            "That's kind of what you see a lot in this non recourse.",
            "It's gotten very nicely shaped form here which is a construction about 1.2 nanometers, so that's.",
            "Anne.",
            "Play A which is much bigger.",
            "Here is really a nice kind of cylinder where you actually can keep nicely approaching in there, that's why."
        ],
        [
            "We choose this poor.",
            "So this application you don't see very well, but this is Perry peptide that is threaded through the poor.",
            "You want to sequence.",
            "You can see there very little space exactly what you want.",
            "If you want to sequence polypeptides.",
            "And here is like approach is about 25 kilometers we are going to talk in a second, which it fits very nicely into this kind of literally this is nanotube.",
            "Other nanoscale is attested by the nanoscale, really looks very nicely.",
            "And this kind of dimension that you have."
        ],
        [
            "Right, so how we gonna do this, right?",
            "So I got so you already about all the forces we have there an week.",
            "Actually harness all these forces to do exactly what we want.",
            "I don't have time to go into details.",
            "Maybe I can see you later and I can tell you all you want if you're really interested, but these kind of things we want to do is like firstly do protein enter inside the pore.",
            "Charge is always a problem.",
            "The confinement doesn't make any problem to the protein.",
            "Can we observe the banning of analytes?",
            "The proteins?",
            "That's confirming as a problem.",
            "In all the surface effects you know the water inside there are a lot of things that we need to be need to be talked and described in this kind of way.",
            "So first thing is that the letter."
        ],
        [
            "Multi flow with proteins is really a huge dominant force.",
            "You can see that you put here your nanopore negative potential, so you need to think the other way around at this point.",
            "So here is where there is nothing.",
            "This is a current this negative.",
            "This is zero.",
            "Then you start adding the protein you see all this kind of nice blockades of the protein enter inside an airport, because this letter smart flow is actually quite strong and allow this protein to get into the nanopore.",
            "If you reverse the potential so you put the protein on the top, there's multiple goes that direction.",
            "Goes inside you reverse the potentials, now is plus you can see here the sun is different so an you see that no problem can get in.",
            "You switch it again.",
            "You see protein coding up again in there.",
            "That's really slow.",
            "It works pretty well with some."
        ],
        [
            "For the proton here I just put a few of them.",
            "We test them anymore, they all work.",
            "They will get in by the time that it gets in is different, so this is relatively big.",
            "About 35 kildalton stay there for hours and you just need to manually take it off.",
            "You put like GFP.",
            "It's very boring protein.",
            "If you don't do fluorescence, but basically stayed there for only milliseconds, then you add a protein that we're going to talk later.",
            "It's called software binding protein.",
            "Qualify killed almost there for minutes.",
            "Same thing for out B which is mass produced.",
            "There for me is very important protein that is a stereotype for enzymatic reaction.",
            "Beach faster there only for milliseconds, which is a pity for us.",
            "And then a very small protein.",
            "14 killed autumn, therefore microsecond because it flies to the pool very quickly.",
            "So basically we can study with this poor this kind of rigid proteins.",
            "They all kind of work one way or the other.",
            "Today I'm do.",
            "I have time, but we actually can change the time that this protein stains at the port from milliseconds to 10s of seconds just by playing these forces that was telling before."
        ],
        [
            "Right now I'm going to talk today about this SBD protein, so this is B proteins are called substrate binding proteins.",
            "There are hundreds of them, you know they all work in the same way is called the Venus Flytrap domain.",
            "So it's like the Venus Flytrap plant insect and what they do in bacteria, they just.",
            "Trap mataba lights what they want to put inside the poor, then they take it to a challenge open and that goes inside the cell through a channel that you have inside the cell.",
            "Why we choose them is because they have this quite big conformational change.",
            "So inside another port we hope that you can see this conformational change is reflected by changes in the structure in the current that we see inside the full instead of poor.",
            "We tested several them.",
            "We checked three of them so far from actually more, but you know, basically we really check very well they want from glucose.",
            "They want from glutamine and one for."
        ],
        [
            "Arjun so that's what happens.",
            "Work in the same way.",
            "Stay there for many seconds.",
            "Let's see.",
            "Oh well, too fast maybe so like enter there, stay there for awhile comes out and you can see here you have this little dips in the in the current so if you expn."
        ],
        [
            "And then these dips here are real, so there goes now and then.",
            "Then you add spurgin and becomes much more frequent than you had alotta spurgin and the substrate.",
            "So if you take the area he ran the I are there in increasing here and then sat right there and then you can actually measure the time that it takes this kind of dip to happen.",
            "The distance between these two time we call them on and off rate.",
            "And we can get here the rates.",
            "You take mutants of this SPD.",
            "Proteins that suppose not work and you don't see all these kind of changes.",
            "So we infer in today's that's what we measure.",
            "In fact, is the binding of the substrate into the protein.",
            "You have this protein, they have some intrinsic opening closing that's known, and then as much as you are sparging, you have the binding, and you can actually measure the KD from the area under this curve, and you can measure on and off rates, but this kind of.",
            "Adjust the time that it takes taking the two states so."
        ],
        [
            "That's how you do it.",
            "You have a KD about .5 micromolar and then the onrait nicely change with the concentration of the substrate.",
            "The offered slightly decreased with concentration of substrate.",
            "We find out why we're not going to talk about that.",
            "I can tell you later.",
            "But what they really want?"
        ],
        [
            "Show you is this.",
            "This is a threat experiment with exactly the same protein where colleagues in Groningen and that's how they did it.",
            "They take a coverslip, they covered passivated with peg.",
            "Then they put like and you traveled in.",
            "Then they put an antibody that binds to the historic and they take this protein.",
            "Then they put an acceptor and then eternal here for threats.",
            "They test about 20 different kind of concert.",
            "Nobody really work very well.",
            "They found one work very well.",
            "Three years later they got this kind of data here right?",
            "And this girl is here.",
            "Exactly the same thing like you know, opening, closing, intrinsic, you know, more sparging ANAN saturation here.",
            "What we did is we take a single channel.",
            "It took an hour.",
            "We purify the protein we put into things and we got the same day, the same experiment.",
            "So about two years difference in the process that we did, we didn't have any optimization that now I have to admit the protein works in this way, But this one did and when we went to see about the KD.",
            "He was pretty much exactly the same.",
            "If you measure from bulk is very similar.",
            "The off rate is about two fold difference.",
            "The on rate is identical now.",
            "I'm not going to spend too much time here, but that's amazing.",
            "I mean, I know nobody could expect that, right?",
            "So it's like is just, you know, God really likes me because you know that works like.",
            "Physically, I don't know why it happens, causes confined inside the pore.",
            "It's got the same run rate.",
            "That means that the kind of diffusion is at the poor somehow is the same as the diffusion outside port.",
            "That doesn't really kind of get compressed by the port, doesn't move too much against the walls.",
            "The opening is a bit different, but I could be also the threat that can be.",
            "You know, the problem, not necessarily the components of the poor, and it just doesn't unfold, just perfect.",
            "Just just like you have.",
            "And outside the port works like this inside the port already and expect that whatsoever."
        ],
        [
            "Right, so this kind of the thing that is a big thing for us, because now we have a technique that allow us to see at the single molecule level of protein in the same way that is at the bulk level.",
            "And we can follow it for minutes or hours, right?",
            "I don't have the data here because we're still learning, but we have one problem we can really see all the kinetic activity, which is, you know something like, you know, I really, I think this is the first single molecule.",
            "You know real single molecule kind of data, because when you do with the threat you really can only do it for a few seconds and then you know the threat is gone because you probably choose SSD."
        ],
        [
            "So if you really want to see a single molecule, you really need to do in this way.",
            "Now I really need to go much quicker.",
            "I'm going to skip this kind of part here, which is when you have a different kind of so the glucose bound."
        ],
        [
            "Protein works in exactly the same way precise.",
            "They another binding protein works slightly different."
        ],
        [
            "I'm going to cut short a Long story short.",
            "Basically, what happens that the protein here is gone?"
        ],
        [
            "Dipole moment, which is exactly perpendicular to the poor.",
            "So when is inside the pore, either goes in this direction and that direction.",
            "This have different current levels, so actually we can see the protein goes in wonder confirmation.",
            "The other confirmation by morning."
        ],
        [
            "Fortunately, by simply just put in different charges in different partly protein, we can actually render protein going this way or that way, and that's actually called some implication because there are like little feelings that itself.",
            "So you can imagine if you have a protein and you put a position modification like a phosphorylation, you can actually change the way it works, and that could be also be a way to actually control the way that actually protein work inside the cell, which is very against something really unexpected.",
            "And that's"
        ],
        [
            "What you have from a prospective making the device you want to make something like that which is before it was gone all the place and then really you can see the binding of glutamine in the same way anyway."
        ],
        [
            "That's just quick."
        ],
        [
            "What we're going to do with that?",
            "We tested actually this we took blood right?",
            "So without purification without anything, we do a triple block.",
            "We put in our simple and we can actually measure the concentration of glucose inside the blood we."
        ],
        [
            "Not only put that we put 2 adapter in the same machine, so we put in the same solution.",
            "We put glucose, an Argentine.",
            "They first enter one.",
            "They bind glucose and you see this correspondence.",
            "Certain concentration of glucose in blood.",
            "We take another one that comes out of the poor automatically.",
            "Another one comes in and you can actually measure the concentration of asparagine in blood, which is, you know.",
            "Happens to be also like in indoor range that we can measure.",
            "So now we went to check and we see that you know from one of these way to actually measure the concentration of blood and we can see that just without any optimization or anything.",
            "This system can actually measure concentration.",
            "Of glucose, an asparagine from blood and pretty well not only from blood, but also can get from sweat.",
            "You can measure pretty well from different kind of system that we use, so you can imagine now that we can have new phone or in your watch kind of like one of the system, perhaps soon, not really, but you know, at some point and then you can actually measure the concentration of all your metabolites that you have at least a few of them, and they can tell you directly.",
            "Alright, OK, did you drink last night?",
            "Right, because if you drink is OK for being drink, go to the doctor to have you know a couple of blood tests because he's out of the normal bar.",
            "So maybe there's something more serious so it could actually be something that tells you you know, like if if it's something more serious that happened happened to you.",
            "So like we actually collaborating with Oksana report, which."
        ],
        [
            "We have this system where you can connect to a device to actually develop a system for 10s of different metabolites and try to link them to the health of an individual and hopefully we can get it too."
        ],
        [
            "New generation devices for from a tab."
        ],
        [
            "Now the last five minutes I can read maybe less what I'm going to tell you about this frac and how we actually try to kind of engineer these poor or changes.",
            "Portrait find out the reason why this poor can actually be used to sequence proteins.",
            "So like frac, unless Clay A he's got a different shape you can see he Razavi sort of shapes is very interesting and the construction here is very good to actually look at polymer as the translator report.",
            "We already checked this one in concept in the framework of DNA can actually have differences between different DNA strands.",
            "So like we work with protein.",
            "So like the idea is something like that.",
            "Use frac.",
            "At some point you put a model protein."
        ],
        [
            "On top of that, unfolds outside the poor, then it read it and then can we get something that you know this energy that pulls the constant force to the poor protein or amino acids have different charge.",
            "That is the problem."
        ],
        [
            "Right, so the other thing is that we want to.",
            "Also, you know in the more immediate future we want to actually have poor, they actually recognize something that is smaller than this 14 kilodaltons that client does.",
            "So we want to have another port that is able to discriminate biomarkers that are actually much smaller.",
            "So we choose five biomarkers of different size from 25 to 1.3 kilo.",
            "So this is about 12 amino acids and say, alright, the old bio market also kind of disease.",
            "Can we actually see that?",
            "From frac and can we actually discriminate between them?",
            "Right, so we started with the big one is called, trypsin."
        ],
        [
            "Those inside the poor and in the same way that I showed before that all works fine, stay there for actually quite short time because the poor is actually much smaller.",
            "It's not hostal.",
            "So in and out very quickly."
        ],
        [
            "We see that from this kind of analysis, which we measure how long it stays at the pour.",
            "The more you press it, so the more power you put, the longer stay there.",
            "So we we showed here that this.",
            "Molecule here does not translocate across the number.",
            "That's what you know.",
            "That's what you expect.",
            "Nothing new here.",
            "Everything goes according to plan.",
            "Then we choose another one and determine which is quite."
        ],
        [
            "You can see here is the peptides.",
            "Basically there, half Alyx, just put together with the sulfide bridges is a negative charge, a pH 7, and that's kind of how it looks like.",
            "So we test this one."
        ],
        [
            "Nothing happened, so it doesn't get into the pore, nothing happens.",
            "Then we got a little bit scared here.",
            "We said alright, so let's negatively charged.",
            "Let this model flow is not strong enough to put it across the nanopore."
        ],
        [
            "And that's why because this is the kind of energy bar that is to go through.",
            "This is the construction of the nanoporous.",
            "Too much electron negative.",
            "So the protein here is not like the big protein, they actually stops at this level here, where the semantic flow is strong enough to put it, it needs to be a negative charge.",
            "Going against this really heavily charged construction and that doesn't work.",
            "And we know that because when we muted that into a positive charge, now we see translocation of this polypeptide.",
            "So basically we know.",
            "And that's very bad news for protein sequencing.",
            "So that if something is negatively charged, it cannot translocate through a negative charge kind of construction.",
            "We need the construction to read.",
            "Basis or the protein kind of amino acids, but also with the charge to get these letters multiflow without the charge have not resulted flow, so is a catch 22 situation.",
            "Either you take a positive to actually sequence negatively charged or negatively positively charged, but you both right?",
            "How can you do that?",
            "Well, it happened that.",
            "There is a magic pH.",
            "Lucky."
        ],
        [
            "So if you go to Page 4.5.",
            "It works.",
            "I don't know why.",
            "Well, I know why, but that's again another of this miracle that happens when you do science.",
            "So a pH 4.5 this is much less charge you can see here.",
            "It's much heavier this read.",
            "This is much less red, so that's still strong enough to have less model flow.",
            "So it is a bit less than normal, but you have it.",
            "But the charges on the peptide get neutralized just enough.",
            "To actually have another multi flow dominates.",
            "The transport mechanism.",
            "So now if you go up each 4.5.",
            "You have translocation of polypeptides.",
            "All of them.",
            "Another thing in the."
        ],
        [
            "Littlest promise 2 minutes I. I think this interests you.",
            "I think is that when you use this larger larger protein here it's about 11.6 kilometers.",
            "We didn't really expect to translocate because you can see here is actually larger than the pull itself, But what we saw our pH.",
            "4.5 That's when you increase the force that you pull your protein.",
            "You're going to have that the time that is still inside the port decreases, which is indication of translocation.",
            "You need to trust me there.",
            "Another thing we see is that the current that is.",
            "You know, during this process is always 0, right?",
            "So means that this thing here kind of plug the AL Phoenix in the protein and it doesn't allow any protein.",
            "Any items to go through until it kind of forced the translocation by just moving the Helix on the side.",
            "We saw that with DNA we prove that that happens with DNA and also we saw that with the builder report that I showed you before the client report."
        ],
        [
            "Then we saw that others they have a threshold potential in which the first translocator translocate went a bit smaller and then."
        ],
        [
            "And we saw that this one is Constance in one which is only 12 amino acid.",
            "You can really see again the translocation nicely.",
            "Remember that doesn't work appear 7.5, only work at this magic pH."
        ],
        [
            "And finally, just the last light before you know the things is that if you're using detailing which is the quantity issue before the very small peptide that the link by system bridges we took under 10100 times in, do they are both linked to different disease?",
            "The only difference they have is this kind of tryptophan here, right?",
            "And you can see when the translocate across the nanopore, you see the difference between one and the other.",
            "You can clearly see the difference between these two population here, and why?",
            "Put that it was important.",
            "Firstly, because the ratio between these two.",
            "Tells about the progression of certain disease model only for that 'cause that tells you that if you have a trip to fund, probably in the linearized strength, you can translocate to report you actually can see the difference between tryptophan and tryptophan.",
            "Most likely I mean that we need to do the experiment, but most likely that so now we are really very hopeful that we created this kind of system, in which you can push a single peptide across an app or a most likely, maybe not with this poor but with another one, but probably also with this one you can see the difference between at least a big pack.",
            "Big, I mean acid in this morning classes that you have there.",
            "So really we can actually start to move towards protein sequencing, right?",
            "Conclusion?",
            "Slide is that?"
        ],
        [
            "I'm very glad that any current Ronald ports we can use to study proteins.",
            "We're really on the verge here to create a new technique to study proteins in single molecule proteins.",
            "Emoji is really unfortunate.",
            "Cannot show you.",
            "I have amazing data which we don't understand yet, so maybe next time when you invite me, I'm going to take you that.",
            "But really, we can see these kind of cycling through a lot of different structure in a protein.",
            "Why is important?",
            "Because their native proteins, the first in the world that would get an edge proteins, is got high bandwidth.",
            "So you can actually measure down to microseconds up two hours for many hours, which is again something that is really something you Ryan Air wants me to go, so it'll be quick confirmation dynamics.",
            "We can see the compression timing protein issue that you can measure banning costs, which incredibly there exactly the same inside or outside the poor.",
            "We don't understand why.",
            "Probably confirm it's not an issue.",
            "Probably crowding is not an issue.",
            "All these kind of crowding effects in protein, actin, etc.",
            "We don't have that much data, but for at least for this protein is not initial whatsoever.",
            "We can actually see biomarkers.",
            "Protein biomarkers.",
            "You know I didn't show the data, but they're very nice.",
            "Different kind of.",
            "Currents we can see metabolites.",
            "We can really make tomorrow if you want somebody needs you know sensor for glucose.",
            "Maybe somebody needs so for us packaging and glutamine we can actually sell it tomorrow.",
            "If somebody is interested.",
            "One thing is important for menopause.",
            "I think we need to finish multiplexing.",
            "We can do with different ports, or different analytes and really want to push into this wearable devices because we can re analyze sweat in the same way that we can analyze any other body fluids.",
            "And then."
        ],
        [
            "Finally, the people who actually did the work so.",
            "Michelle was the 1st Post Oak ahead again.",
            "Very lucky to have somebody like him was really good.",
            "He just left for a startup in Paris an not to do nanopores.",
            "Not yet.",
            "Then Carsten also did some work with the SPD proteins.",
            "Then you have valid that did all the work with the speedy proteins and I believe one which Kevin one here he did all the work with the peptides and thank you very much for your attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So today I'm going to talk about a couple of projects that are going on in my lab.",
                    "label": 0
                },
                {
                    "sent": "Actually you mentioned there see Grant.",
                    "label": 0
                },
                {
                    "sent": "The first is was about my first year C grant.",
                    "label": 0
                },
                {
                    "sent": "Which is, you know, single currency, myologie nanopore switch, very surprisingly, because when you right there you see Grant needs to be very kind of ambitious kind of project actually works particularly well.",
                    "label": 0
                },
                {
                    "sent": "I really didn't believe that would happen.",
                    "label": 0
                },
                {
                    "sent": "I'm very lucky as a scientist cause a lot of projects they started actually.",
                    "label": 0
                },
                {
                    "sent": "Work against any odd, which is really not my merit really.",
                    "label": 0
                },
                {
                    "sent": "Just luck clear lack.",
                    "label": 0
                },
                {
                    "sent": "The merit is in doing something very ambitious and don't remember about all the failures and justice.",
                    "label": 0
                },
                {
                    "sent": "Concentrate about the things they work because when they work they're really pretty good.",
                    "label": 0
                },
                {
                    "sent": "And then the second is about something that's starting now, which I just received the second year.",
                    "label": 0
                },
                {
                    "sent": "See Grant on protein sequencing, which again is something they want to start because it was incredibly difficult.",
                    "label": 0
                },
                {
                    "sent": "And again, I can.",
                    "label": 0
                },
                {
                    "sent": "Tell you something that seems to be working.",
                    "label": 0
                },
                {
                    "sent": "That direction is just the first step, but I think is quite promising.",
                    "label": 0
                },
                {
                    "sent": "So like today I'm going to talk about these two things about you know how to use non reports for for these two subjects.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One is going to tell you about what is now poor technology, so if you already know some that don't.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to just go through the basics of an airport technology and then I'm going to tell you how you know you're going to actually do single markers emoji, but also how to harness this kind of new system to do new sensors which may come to light in the future.",
                    "label": 0
                },
                {
                    "sent": "Then I'm going to tell you how you can take some to identify some proteins.",
                    "label": 0
                },
                {
                    "sent": "Using the same the same thing, but the underlying kind of subject that we have, is that really we are trying to learn from the physical point of view how to control the transport of proteins across nanopore.",
                    "label": 1
                },
                {
                    "sent": "So like they all talk is going to be about single molecules, so we're going to work with one molecule at a time, and then if you're not used to thinking single molecules real, the main challenge that you have there is that.",
                    "label": 0
                },
                {
                    "sent": "When you get to that sort of dimension, you have thermal motions.",
                    "label": 0
                },
                {
                    "sent": "There really dominate your world, so you really need to find a way harness and forces that can actually allow you to manipulate single molecules and test to fight thermal fluctuations.",
                    "label": 0
                },
                {
                    "sent": "And now of course you know you can do that without of course, and they're going to tell you how you can do that.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But you know, there is also the reason why you might be interested in this kind of research.",
                    "label": 0
                },
                {
                    "sent": "Is that because we don't see very well out of focus, but you know in the cell protein are extruded through nanoscale aperture all the time that you know if you wouldn't happen that we will be alive.",
                    "label": 0
                },
                {
                    "sent": "For example, you have a project.",
                    "label": 0
                },
                {
                    "sent": "Transport which is you know, core transitionally while you make a protein, you know protein are actually extruded through another portal which is the translate cone into different kind of.",
                    "label": 0
                },
                {
                    "sent": "Part of the membrane, so you might have a potential applied there.",
                    "label": 0
                },
                {
                    "sent": "In this case it's not, but sometimes you actually apply potential.",
                    "label": 0
                },
                {
                    "sent": "An is not really known.",
                    "label": 0
                },
                {
                    "sent": "How are the physical level that kind of process happens, so this is called transitional.",
                    "label": 0
                },
                {
                    "sent": "Sometimes is after you know after is already folded, protein is actually channeled through a poor, or sometimes you even have folded protein that has folded.",
                    "label": 0
                },
                {
                    "sent": "There are transported across a poor across membrane and this is even.",
                    "label": 0
                },
                {
                    "sent": "Less understood is really not known how this happened, and then you have nanomachines in the cell that actually they do that to destroy proteins.",
                    "label": 0
                },
                {
                    "sent": "So when you protein is labeled for with a big team, for example, the signal that tells that this protein is not necessary anymore, so it gets the words into this system where you have protein that is unfolding is called clip X that unfolded protein, fed it through what is actually another poor, and there's a linear kind of segment here is cleaved.",
                    "label": 0
                },
                {
                    "sent": "In different pieces, so it can be recycled, but undestroyed by the cell.",
                    "label": 0
                },
                {
                    "sent": "So there are many prospect that we have is not very easy.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To study this kind of system, especially if you want to do it at the single molecule level and the way we do it, is by using biological nanopores this nanopore, slightly different?",
                    "label": 0
                },
                {
                    "sent": "They're not.",
                    "label": 0
                },
                {
                    "sent": "They don't do that is not a set translator that transport approaching, but what they do, they are usually water soluble monomer that are made by certain cells that script out the cell, and then when they recognize a certain membrane they normally recognized membrane, they form oligomers, often deformity report.",
                    "label": 1
                },
                {
                    "sent": "And then they eventually span the lipid barrier, so all the nutrients can go across and pour all the ions go across the across the pour through the membranes and the and the cell is killed all the pores.",
                    "label": 0
                },
                {
                    "sent": "They're actually format the outer membranes to allow a transport of several nutrients between the outer membrane.",
                    "label": 0
                },
                {
                    "sent": "But the important part here is that you have this little hole here, which actually creates what we want for the for this talk.",
                    "label": 0
                },
                {
                    "sent": "And the fact that important part here is that they are really very stable.",
                    "label": 0
                },
                {
                    "sent": "So like people think about proteins are really unstable entities.",
                    "label": 0
                },
                {
                    "sent": "But actually if you have this poor most the time, you can really boil them and still active.",
                    "label": 0
                },
                {
                    "sent": "Or you can put in PH-2 and still nothing happens to them.",
                    "label": 0
                },
                {
                    "sent": "They are the GI Joe of the cell release or something that really need to kill other cells.",
                    "label": 0
                },
                {
                    "sent": "So like this credit.",
                    "label": 0
                },
                {
                    "sent": "So they're really tough most of the time and it's very good for what we wanted.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But now we don't really need the poor.",
                    "label": 0
                },
                {
                    "sent": "We need to have a system that actually studied molecule.",
                    "label": 0
                },
                {
                    "sent": "The single molecule level.",
                    "label": 0
                },
                {
                    "sent": "So how they work?",
                    "label": 0
                },
                {
                    "sent": "So we have ways to actually have a logical membranes.",
                    "label": 0
                },
                {
                    "sent": "Here we isolate like a lipid bilayer.",
                    "label": 1
                },
                {
                    "sent": "So what is made by the cell we can make it chemically well.",
                    "label": 0
                },
                {
                    "sent": "Company makes for us and we can have a way to actually separate 2 chambers by this sleeping membrane.",
                    "label": 0
                },
                {
                    "sent": "So if you apply a potential which is very important, you apply a potential here across the nanopore.",
                    "label": 0
                },
                {
                    "sent": "And if there is nothing here, just remember you have the ions here from both sides of the poor.",
                    "label": 0
                },
                {
                    "sent": "They cannot go across the North Pole, so you have 0 current that you can see there.",
                    "label": 0
                },
                {
                    "sent": "As soon as you have a single pour that penat.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Traits the nipping bilayer that's stochastic events just happens once in awhile.",
                    "label": 0
                },
                {
                    "sent": "When you have a little amount of this protein going to the nanopore, then we're going to see that the current jumps to a certain level, and this is the signal that actually we're going to use to study proteins and to actually control transport across the nanopore, just to give an example, this signal is given by about 10 to the nine irons, like what billions per second, so is quite a large number of ions, and we seek and very small difference about this.",
                    "label": 0
                },
                {
                    "sent": "The science and you know, just you know this step here tells you that you have only one of these nanopore inside your system inside your lipid bilayer, and that's really crucial.",
                    "label": 0
                },
                {
                    "sent": "We want to do is just to give an example.",
                    "label": 0
                },
                {
                    "sent": "You know when you know when you go out in the evening, and then you come back next day a bit with a headache and you take your tablet.",
                    "label": 0
                },
                {
                    "sent": "So if you proof and you have a bit more molecule in that 10 to 21, so it's actually very hard normally to actually work with single molecules, and we can do that in a very simple way.",
                    "label": 0
                },
                {
                    "sent": "This is actually the first single molecule technique.",
                    "label": 0
                },
                {
                    "sent": "They haven't been invented in 1970s.",
                    "label": 0
                },
                {
                    "sent": "An basically really leave work in the same sort of technology.",
                    "label": 0
                },
                {
                    "sent": "We just have computer now.",
                    "label": 0
                },
                {
                    "sent": "They make our life easier rather than see all the signal on papers, but basically.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The same sort of technique now.",
                    "label": 0
                },
                {
                    "sent": "What are the forces that allow us to manipulate this molecule at the single molecule level?",
                    "label": 0
                },
                {
                    "sent": "So when you work with DNA, when you want to sequence in a or want to just work with you, in general the only force that you really want to consider is the electrophoretically force.",
                    "label": 0
                },
                {
                    "sent": "So I told you already that you apply a potential across the map, or in this case a negative potential.",
                    "label": 0
                },
                {
                    "sent": "So you're going to have the positive molecule that you're going to place right in the middle of the poor will be attracted.",
                    "label": 0
                },
                {
                    "sent": "And you want to go towards the negative potential is not linear.",
                    "label": 0
                },
                {
                    "sent": "I mean that's how the potential goes inside this non core is about linear about this point.",
                    "label": 0
                },
                {
                    "sent": "And then here are all the charges.",
                    "label": 0
                },
                {
                    "sent": "In red is the charge of the nanopore is negative charge, and in blue the positive charge also influenced this kind of potential that you have quite complex doesn't matter for what we want to do now, but the point here is that you have this force here literally force, which is directly proportional to the applied potential.",
                    "label": 0
                },
                {
                    "sent": "That you apply there and the charges that you have.",
                    "label": 0
                },
                {
                    "sent": "So that's a very strong force.",
                    "label": 0
                },
                {
                    "sent": "About Tampico newtons.",
                    "label": 0
                },
                {
                    "sent": "When you work with DNA, when applied 150 millivolts and that kind of is the limits of forces that you really want to use in nature anyway.",
                    "label": 0
                },
                {
                    "sent": "If you want to go really much higher forces you start to denature and start to kind of not breaking bonds, but kind of change the property of.",
                    "label": 0
                },
                {
                    "sent": "System, so that's kind of good force that you want to use the problem when you start to use proteins is that they don't have really a charge well defined charge like DNA.",
                    "label": 0
                },
                {
                    "sent": "The protein also are folded, so it's different than DNA, so we actually need to kind of have another force really to actually start to manipulate proteins.",
                    "label": 0
                },
                {
                    "sent": "Fortunately, this force.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cyst and it's called electromatic flow.",
                    "label": 0
                },
                {
                    "sent": "So is a little bit less obvious to understand.",
                    "label": 0
                },
                {
                    "sent": "What is this lattice multiflow?",
                    "label": 0
                },
                {
                    "sent": "So basically you can imagine as the flow of water an iron that happen across another person.",
                    "label": 0
                },
                {
                    "sent": "But like when you go against the wind you get a force against you because the wind is blowing quite fast.",
                    "label": 0
                },
                {
                    "sent": "You can lean on the window, sometimes you can even support all the weight your body weight.",
                    "label": 0
                },
                {
                    "sent": "So it's the same kind of idea that you have is brilliant sort of force.",
                    "label": 0
                },
                {
                    "sent": "Don't know why this counting happened.",
                    "label": 0
                },
                {
                    "sent": "But this was nothing embarrassing is going to come up now.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "So this kind of force here also is on the typical of few Pico Newtons, an basically what you have the charges around the size of the Northport.",
                    "label": 0
                },
                {
                    "sent": "I'll show you before they're quite negatively charged so you have a flux of positive ion from top to bottom when you plan a trip potential they will bring about water and then create a force in the same way that the wind creative force or knew that can actually act on the poor.",
                    "label": 0
                },
                {
                    "sent": "This force is not constant, so like in this part of the poor.",
                    "label": 0
                },
                {
                    "sent": "Is about constant.",
                    "label": 0
                },
                {
                    "sent": "You can see here is rugs but quite constant.",
                    "label": 0
                },
                {
                    "sent": "But it's much much stronger when there's a construction which is really accelerate and it becomes much stronger and that is the force that really work in our system.",
                    "label": 0
                },
                {
                    "sent": "There's the first they want to use for if you want to sequence proteins, this is the force that you want to use if you want to actually do single molecules emoji.",
                    "label": 0
                },
                {
                    "sent": "That means that if you want to track molecule in there, you use the letters multi flow which is does not depend on the charge, only depends on the size of the molecule.",
                    "label": 0
                },
                {
                    "sent": "And an intensity of the water flow, which depends ultimately on how much charge you have.",
                    "label": 0
                },
                {
                    "sent": "An well the sign of the charge in your pour that you have.",
                    "label": 0
                },
                {
                    "sent": "Movies in the opposite direction no.",
                    "label": 0
                },
                {
                    "sent": "It depends.",
                    "label": 0
                },
                {
                    "sent": "So in this case you apply a negative potential.",
                    "label": 0
                },
                {
                    "sent": "You have the port.",
                    "label": 0
                },
                {
                    "sent": "You can imagine the poor is like a cylinder full of charge.",
                    "label": 0
                },
                {
                    "sent": "Because these ports are negatively charged, is full of positive charge.",
                    "label": 0
                },
                {
                    "sent": "So you can imagine that you have the full of positive charge.",
                    "label": 0
                },
                {
                    "sent": "You apply negative charge.",
                    "label": 0
                },
                {
                    "sent": "The publisher is going to be that way.",
                    "label": 0
                },
                {
                    "sent": "Let us multi flow going to go that way if you apply a positive charge, the charge is going to be opposite way, so we're going to the opposite way.",
                    "label": 0
                },
                {
                    "sent": "So it depends.",
                    "label": 0
                },
                {
                    "sent": "On you know the application of force an of your potential now.",
                    "label": 0
                },
                {
                    "sent": "It is usually at the opposite as they let 40 fours.",
                    "label": 0
                },
                {
                    "sent": "Becausw getting complicated, but usually you're right and that's one thing they're going to go to the end if you get to that point, but you need to remember that you have to think about these elaborate.",
                    "label": 0
                },
                {
                    "sent": "If course let US model flow as the main force to actually keep the protein inside another port on the physical level.",
                    "label": 0
                },
                {
                    "sent": "If you don't want to think in that way, just play something that keeps the protein inside.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now I need to put these slides because that's kind of his.",
                    "label": 0
                },
                {
                    "sent": "You know, most of the popularity of the nanopores come from that was actually my postdoctoral work, the one that I thought it would never work, that I started my post Doc.",
                    "label": 0
                },
                {
                    "sent": "And that's actually how to sequence DNA with airport is just one slide, because on the work on that anymore.",
                    "label": 0
                },
                {
                    "sent": "But just to let you know, you have a double strand DNA, you have a motorhome molecular machine that can unzip the DNA base by base, and then if it's it through the nanopore.",
                    "label": 1
                },
                {
                    "sent": "And then you have this electric field, not let's model flow electric field.",
                    "label": 0
                },
                {
                    "sent": "In this case the cause is the dominant force.",
                    "label": 0
                },
                {
                    "sent": "If you have a holy uniformly charged polymer, they actually really stretch.",
                    "label": 0
                },
                {
                    "sent": "But tentacle neutral force the inside portion makes it very nicely there.",
                    "label": 0
                },
                {
                    "sent": "So the ionic current issue at the beginning can actually pass through the poran recognize base by base effectively doesn't recognize one base that I'm recognize.",
                    "label": 0
                },
                {
                    "sent": "A bunch of them, but that's not really important important part that you have.",
                    "label": 0
                },
                {
                    "sent": "Machine that actually unzip 1 by 1. the DNA fits base by base and then you have a unique current pass to the poor, which is sensitive enough to see tiny differences in the basis in the in the kind of composition of the DNA.",
                    "label": 0
                },
                {
                    "sent": "That's how DNA sequence works.",
                    "label": 0
                },
                {
                    "sent": "You can buy one of these machines to sequence your DNA.",
                    "label": 0
                },
                {
                    "sent": "You can take it to the moon or the Amazon forest wherever they people try to sell you.",
                    "label": 0
                },
                {
                    "sent": "The machine will tell you, but it works and you can actually sequenced DNA right now.",
                    "label": 0
                },
                {
                    "sent": "Best kind of the swiggle signal that you see.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When you want to do that now, but the problem when you do with proteins, well, I told you already, you cannot use letter for the force you need to use the Let's Matic flow, which we find out as we went along is actually very strong and it works pretty well.",
                    "label": 0
                },
                {
                    "sent": "Before I started where we pretend we didn't know existed, I mean you know existed by we didn't really know it was good enough to do what we do.",
                    "label": 0
                },
                {
                    "sent": "Another update there already know how.",
                    "label": 0
                },
                {
                    "sent": "Congratulations Anne, so this works works very well.",
                    "label": 0
                },
                {
                    "sent": "Again, we were lucky we didn't know existed exist, but then we also need to convince the project to get into the poor, right?",
                    "label": 0
                },
                {
                    "sent": "You know this, you know this difference between this multi floral parade force then we need to actually recognize the property of the protein itself.",
                    "label": 0
                },
                {
                    "sent": "You know.",
                    "label": 0
                },
                {
                    "sent": "So if you do single McKinsey myologie you want to recognize different confirmation in the protein.",
                    "label": 0
                },
                {
                    "sent": "Want to recognize?",
                    "label": 0
                },
                {
                    "sent": "A subset comes in, substrate comes out and etc.",
                    "label": 0
                },
                {
                    "sent": "Is this ionic current good enough to do what we want to do, and then on top of that, is that even if you can do all these kind of things together, you know what is the environment inside the poor will unfold a protein that you have in there will actually have a different effect.",
                    "label": 0
                },
                {
                    "sent": "You know people build a career telling us that the crowd NIS inside the cell is really bad or really good for proteins.",
                    "label": 0
                },
                {
                    "sent": "This is something that really has a huge effect on the way the protein works.",
                    "label": 0
                },
                {
                    "sent": "You know, inside the poor is actually a crowded environment.",
                    "label": 0
                },
                {
                    "sent": "Will have going to have a difference in whatever we want to do, so this is basically all the things that when I started my UC granting as independent scientists thought that it was really very hard to get it to work.",
                    "label": 0
                },
                {
                    "sent": "These kind of things but eventually one by one we find out that actually all these things can be addressed by our system.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Check on application is going to be about what one application is going to be about sequencing protein.",
                    "label": 0
                },
                {
                    "sent": "So like this picture is here because it's just kind of the most simple schematic that you're going to have.",
                    "label": 0
                },
                {
                    "sent": "How to sync with the protein's like DNA, right?",
                    "label": 0
                },
                {
                    "sent": "So you have a poor construction here.",
                    "label": 0
                },
                {
                    "sent": "You have more protein in this case called Young full days.",
                    "label": 0
                },
                {
                    "sent": "The first slide show you is one of these protein that take protein from the protein set cell.",
                    "label": 0
                },
                {
                    "sent": "They unfold them and they threaded through this through this nonpolar they do exist.",
                    "label": 0
                },
                {
                    "sent": "We can pair him to that one, and then we're going to recognize base by base problem here is that you know why the protein on Earth should go that direction, right?",
                    "label": 0
                },
                {
                    "sent": "So you could go in any other direction because there is not really an electric field, so we went to see if this let's multik flow is strong enough to actually draw the protein across the polypeptide across the nanopore.",
                    "label": 0
                },
                {
                    "sent": "But even if you actually can get a super strong electric model flow, if you have a positive charge is going to go One Direction where next show is going to be.",
                    "label": 0
                },
                {
                    "sent": "It's in direction, so actually that is multi flow should be much much bigger than the little phoretic force on the single positive charge.",
                    "label": 0
                },
                {
                    "sent": "We can go up high few Pico Newton, so really should be a really super strong kind of feel that actually pull the protein, which is something that is, you know, be proven if you can actually do that, but actually.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also good news.",
                    "label": 0
                },
                {
                    "sent": "When you started proteins and proteins are actually not the DNA in other ways.",
                    "label": 0
                },
                {
                    "sent": "So actually we know the sequence of proteins that we want to sequence, so you have a problem in our human body.",
                    "label": 0
                },
                {
                    "sent": "We know how many protein we have.",
                    "label": 0
                },
                {
                    "sent": "We know the sequence.",
                    "label": 0
                },
                {
                    "sent": "So actually we don't have to sequence of protein.",
                    "label": 0
                },
                {
                    "sent": "We just have to recognize them, right?",
                    "label": 0
                },
                {
                    "sent": "So we actually can do a lot of things simply by recognizing that protein rather than sequencing them, so you don't actually have to sequence 20 minute acids.",
                    "label": 0
                },
                {
                    "sent": "Maybe you can sequence two or three.",
                    "label": 0
                },
                {
                    "sent": "That's going to be enough.",
                    "label": 0
                },
                {
                    "sent": "Let's say tryptophan, tyrosine, and liesing, and then you can actually get a fingerprint of your protein that is good enough.",
                    "label": 0
                },
                {
                    "sent": "Or you can actually use chemistry.",
                    "label": 0
                },
                {
                    "sent": "You can, you know you can label, assisting or liesing.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of our technical chemistry.",
                    "label": 0
                },
                {
                    "sent": "They allow you to do that.",
                    "label": 0
                },
                {
                    "sent": "You put huge kind of stuff on it and then when you can thread that through another port, you just read two amino acids rather than you know that you actually modify, so there are a lot of intermediate steps that you can use that be very successful.",
                    "label": 0
                },
                {
                    "sent": "To actually recognize protein and why you want to recognize protein as because there are lot of protein bio market, they are linked to disease so you can actually make a sensor for biomarker linked to disease.",
                    "label": 1
                },
                {
                    "sent": "Or simply you want to see post translation, modification or just simply want to measure how many protein you have in a certain sample with certain kind of properties.",
                    "label": 0
                },
                {
                    "sent": "So a lot of things you can do.",
                    "label": 0
                },
                {
                    "sent": "Not only that.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You actually can sequence.",
                    "label": 0
                },
                {
                    "sent": "You can identify proteins that are folded.",
                    "label": 0
                },
                {
                    "sent": "You don't need to unfold them.",
                    "label": 0
                },
                {
                    "sent": "This would be more complicated.",
                    "label": 0
                },
                {
                    "sent": "Probably you will have to separate them, but that's how people in proteomics do it anyway.",
                    "label": 0
                },
                {
                    "sent": "The separately column.",
                    "label": 0
                },
                {
                    "sent": "They put two 2D gels, and instead of doing mass spec you can actually do some narrow paralysis and then you can have some sort of signal like that.",
                    "label": 0
                },
                {
                    "sent": "And if you have signal like that, what you can see, you can recognize a specific protein because specific blockade or is staying there in the port for long enough or short enough you have a specific event here in the.",
                    "label": 0
                },
                {
                    "sent": "Height of the current of the duration of the blockades, and then you actually can get you to actually recognize the protein that you want.",
                    "label": 0
                },
                {
                    "sent": "You can also integrate this in microfluidic device in the lab on chip device to make everything automated.",
                    "label": 1
                },
                {
                    "sent": "There are problems with that.",
                    "label": 0
                },
                {
                    "sent": "Indeed, in the way that you need to know have a prior information about the protein so you know that the protein ever certain kind of steps or step counter signal.",
                    "label": 1
                },
                {
                    "sent": "You probably cannot get 25,000 signals from the same bunch of proteins, so you probably.",
                    "label": 0
                },
                {
                    "sent": "We have to separate the signal and as well at the same time.",
                    "label": 1
                },
                {
                    "sent": "You probably want to have a range of different non reports of different size.",
                    "label": 0
                },
                {
                    "sent": "That we allowed to sample different kind of protein from the small polypeptides from the large complex of proteins and all kind of things.",
                    "label": 0
                },
                {
                    "sent": "So like is a little bit more complex, but actually is another chewable.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Problem that we can find to resolve in that way?",
                    "label": 0
                },
                {
                    "sent": "But you know, I'm another kind of approach that we have and is the one that got me much more excited, protein, biochemists, originally, and I really want to do is to actually devise a new technology to actually study proteins.",
                    "label": 0
                },
                {
                    "sent": "So proteins are studied, having symbol level for many, many years now and about 20 years ago people started to look at them at the single molecule level, thinking a revolution in the way that we look at produce.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Revolution didn't happen really.",
                    "label": 0
                },
                {
                    "sent": "Looks like the protein works in a similar way at the single molecule level and multi or on the bulk level, but mainly I hope and I think is because we don't really have right technique to look at them.",
                    "label": 0
                },
                {
                    "sent": "So you look a single protein with presence.",
                    "label": 0
                },
                {
                    "sent": "So either you need to have a fluorescent substrate that becomes known, fluorescence or non precious subset of conference and they were the first example or you put fresh labeling the protein and you can focus only very small.",
                    "label": 0
                },
                {
                    "sent": "Property of the proteins, or using FMT, which is going to form and change the property of the protein.",
                    "label": 0
                },
                {
                    "sent": "He don't really have any technique, they look at the single native protein you know, as it is, they don't really exist.",
                    "label": 0
                },
                {
                    "sent": "Not only that, you cannot really.",
                    "label": 0
                },
                {
                    "sent": "You can only now watch protein for a few seconds and then it's gone.",
                    "label": 0
                },
                {
                    "sent": "So you want really to watch the same protein for let's say an hour and see if it goes from different confirmation.",
                    "label": 0
                },
                {
                    "sent": "High works really for a long time and then you know how it works.",
                    "label": 0
                },
                {
                    "sent": "In the same way that you know if you want if you're an alien.",
                    "label": 0
                },
                {
                    "sent": "In space, and you want to see how people work or leave or they behave, you're not going to go to a rock star concert and say, oh, you know they all clap their hands together.",
                    "label": 0
                },
                {
                    "sent": "You know they they can leave one arm and just do different kind of things while you want to do is follow one person.",
                    "label": 0
                },
                {
                    "sent": "You know when you go home, go to sleep, wake up, kiss goodbye to his kids, etc.",
                    "label": 0
                },
                {
                    "sent": "So you want to see they all same person for very long time.",
                    "label": 0
                },
                {
                    "sent": "Right and this technique here might just be able to do that because there's not really intrinsic time limitation for this.",
                    "label": 0
                },
                {
                    "sent": "Single model and theology allow you to look at a native proteins, but like what also can allow to do here is actually to build new sensors while you build your sensors is because you're going to have an enzyme here that convert whatever it does from you know whatever signal you can have into electrical signal.",
                    "label": 0
                },
                {
                    "sent": "So that's a good signal can be powered very easily without trying devices, so therefore you can actually now have your.",
                    "label": 0
                },
                {
                    "sent": "Sensor you're touching your under your skin or you just blow your skins.",
                    "label": 0
                },
                {
                    "sent": "If you can measure you know whatever about the food you want and then maybe just connected to your mobile phone and can just give you live kind of.",
                    "label": 0
                },
                {
                    "sent": "Information about you know whatever concentration of analyte that binds this protein, here you have, so you can actually make sensor to study metabolites right so?",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I probably should check how much time I have so to see.",
                    "label": 0
                },
                {
                    "sent": "Where is that?",
                    "label": 0
                },
                {
                    "sent": "Oh yeah, so.",
                    "label": 0
                },
                {
                    "sent": "I don't know if I'm going to talk about everything today.",
                    "label": 0
                },
                {
                    "sent": "Let's focus on single marker in theology here and then I'll give you a few kind of kind of insights about how we use this non report, specially the frac protein that puts special for you.",
                    "label": 0
                },
                {
                    "sent": "Then about how we can actually do it to actually detect in sequence peptides or find information about.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actors and how to use these letters multi float.",
                    "label": 0
                },
                {
                    "sent": "How to induce it to actually do what we want to do and you gotta be quicker.",
                    "label": 0
                },
                {
                    "sent": "So there are a lot.",
                    "label": 0
                },
                {
                    "sent": "Of course in literature if you want to know more.",
                    "label": 0
                },
                {
                    "sent": "I mean you have an expert here that can tell you all about all these pores and we're going to talk to.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Say it's about these two, one is called frac and one is called clay frac is small and you know and it's kind of nice construction there.",
                    "label": 1
                },
                {
                    "sent": "Clay is big, is really this kind of nanotube that creates these kind of interior kind of nanoscale test tube to actually start a single molecule, a single protein.",
                    "label": 0
                },
                {
                    "sent": "So that's how they look from the inside negatively charged here plus the charge there.",
                    "label": 0
                },
                {
                    "sent": "That's kind of what you see a lot in this non recourse.",
                    "label": 0
                },
                {
                    "sent": "It's gotten very nicely shaped form here which is a construction about 1.2 nanometers, so that's.",
                    "label": 1
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Play A which is much bigger.",
                    "label": 0
                },
                {
                    "sent": "Here is really a nice kind of cylinder where you actually can keep nicely approaching in there, that's why.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We choose this poor.",
                    "label": 0
                },
                {
                    "sent": "So this application you don't see very well, but this is Perry peptide that is threaded through the poor.",
                    "label": 0
                },
                {
                    "sent": "You want to sequence.",
                    "label": 0
                },
                {
                    "sent": "You can see there very little space exactly what you want.",
                    "label": 0
                },
                {
                    "sent": "If you want to sequence polypeptides.",
                    "label": 0
                },
                {
                    "sent": "And here is like approach is about 25 kilometers we are going to talk in a second, which it fits very nicely into this kind of literally this is nanotube.",
                    "label": 0
                },
                {
                    "sent": "Other nanoscale is attested by the nanoscale, really looks very nicely.",
                    "label": 0
                },
                {
                    "sent": "And this kind of dimension that you have.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right, so how we gonna do this, right?",
                    "label": 0
                },
                {
                    "sent": "So I got so you already about all the forces we have there an week.",
                    "label": 0
                },
                {
                    "sent": "Actually harness all these forces to do exactly what we want.",
                    "label": 0
                },
                {
                    "sent": "I don't have time to go into details.",
                    "label": 0
                },
                {
                    "sent": "Maybe I can see you later and I can tell you all you want if you're really interested, but these kind of things we want to do is like firstly do protein enter inside the pore.",
                    "label": 0
                },
                {
                    "sent": "Charge is always a problem.",
                    "label": 0
                },
                {
                    "sent": "The confinement doesn't make any problem to the protein.",
                    "label": 1
                },
                {
                    "sent": "Can we observe the banning of analytes?",
                    "label": 1
                },
                {
                    "sent": "The proteins?",
                    "label": 0
                },
                {
                    "sent": "That's confirming as a problem.",
                    "label": 0
                },
                {
                    "sent": "In all the surface effects you know the water inside there are a lot of things that we need to be need to be talked and described in this kind of way.",
                    "label": 0
                },
                {
                    "sent": "So first thing is that the letter.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Multi flow with proteins is really a huge dominant force.",
                    "label": 0
                },
                {
                    "sent": "You can see that you put here your nanopore negative potential, so you need to think the other way around at this point.",
                    "label": 0
                },
                {
                    "sent": "So here is where there is nothing.",
                    "label": 0
                },
                {
                    "sent": "This is a current this negative.",
                    "label": 0
                },
                {
                    "sent": "This is zero.",
                    "label": 0
                },
                {
                    "sent": "Then you start adding the protein you see all this kind of nice blockades of the protein enter inside an airport, because this letter smart flow is actually quite strong and allow this protein to get into the nanopore.",
                    "label": 0
                },
                {
                    "sent": "If you reverse the potential so you put the protein on the top, there's multiple goes that direction.",
                    "label": 0
                },
                {
                    "sent": "Goes inside you reverse the potentials, now is plus you can see here the sun is different so an you see that no problem can get in.",
                    "label": 0
                },
                {
                    "sent": "You switch it again.",
                    "label": 0
                },
                {
                    "sent": "You see protein coding up again in there.",
                    "label": 0
                },
                {
                    "sent": "That's really slow.",
                    "label": 0
                },
                {
                    "sent": "It works pretty well with some.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For the proton here I just put a few of them.",
                    "label": 0
                },
                {
                    "sent": "We test them anymore, they all work.",
                    "label": 0
                },
                {
                    "sent": "They will get in by the time that it gets in is different, so this is relatively big.",
                    "label": 0
                },
                {
                    "sent": "About 35 kildalton stay there for hours and you just need to manually take it off.",
                    "label": 0
                },
                {
                    "sent": "You put like GFP.",
                    "label": 0
                },
                {
                    "sent": "It's very boring protein.",
                    "label": 0
                },
                {
                    "sent": "If you don't do fluorescence, but basically stayed there for only milliseconds, then you add a protein that we're going to talk later.",
                    "label": 0
                },
                {
                    "sent": "It's called software binding protein.",
                    "label": 0
                },
                {
                    "sent": "Qualify killed almost there for minutes.",
                    "label": 0
                },
                {
                    "sent": "Same thing for out B which is mass produced.",
                    "label": 0
                },
                {
                    "sent": "There for me is very important protein that is a stereotype for enzymatic reaction.",
                    "label": 0
                },
                {
                    "sent": "Beach faster there only for milliseconds, which is a pity for us.",
                    "label": 0
                },
                {
                    "sent": "And then a very small protein.",
                    "label": 0
                },
                {
                    "sent": "14 killed autumn, therefore microsecond because it flies to the pool very quickly.",
                    "label": 0
                },
                {
                    "sent": "So basically we can study with this poor this kind of rigid proteins.",
                    "label": 0
                },
                {
                    "sent": "They all kind of work one way or the other.",
                    "label": 0
                },
                {
                    "sent": "Today I'm do.",
                    "label": 0
                },
                {
                    "sent": "I have time, but we actually can change the time that this protein stains at the port from milliseconds to 10s of seconds just by playing these forces that was telling before.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right now I'm going to talk today about this SBD protein, so this is B proteins are called substrate binding proteins.",
                    "label": 0
                },
                {
                    "sent": "There are hundreds of them, you know they all work in the same way is called the Venus Flytrap domain.",
                    "label": 0
                },
                {
                    "sent": "So it's like the Venus Flytrap plant insect and what they do in bacteria, they just.",
                    "label": 1
                },
                {
                    "sent": "Trap mataba lights what they want to put inside the poor, then they take it to a challenge open and that goes inside the cell through a channel that you have inside the cell.",
                    "label": 1
                },
                {
                    "sent": "Why we choose them is because they have this quite big conformational change.",
                    "label": 0
                },
                {
                    "sent": "So inside another port we hope that you can see this conformational change is reflected by changes in the structure in the current that we see inside the full instead of poor.",
                    "label": 0
                },
                {
                    "sent": "We tested several them.",
                    "label": 0
                },
                {
                    "sent": "We checked three of them so far from actually more, but you know, basically we really check very well they want from glucose.",
                    "label": 0
                },
                {
                    "sent": "They want from glutamine and one for.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Arjun so that's what happens.",
                    "label": 0
                },
                {
                    "sent": "Work in the same way.",
                    "label": 0
                },
                {
                    "sent": "Stay there for many seconds.",
                    "label": 0
                },
                {
                    "sent": "Let's see.",
                    "label": 0
                },
                {
                    "sent": "Oh well, too fast maybe so like enter there, stay there for awhile comes out and you can see here you have this little dips in the in the current so if you expn.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then these dips here are real, so there goes now and then.",
                    "label": 0
                },
                {
                    "sent": "Then you add spurgin and becomes much more frequent than you had alotta spurgin and the substrate.",
                    "label": 0
                },
                {
                    "sent": "So if you take the area he ran the I are there in increasing here and then sat right there and then you can actually measure the time that it takes this kind of dip to happen.",
                    "label": 0
                },
                {
                    "sent": "The distance between these two time we call them on and off rate.",
                    "label": 0
                },
                {
                    "sent": "And we can get here the rates.",
                    "label": 0
                },
                {
                    "sent": "You take mutants of this SPD.",
                    "label": 0
                },
                {
                    "sent": "Proteins that suppose not work and you don't see all these kind of changes.",
                    "label": 0
                },
                {
                    "sent": "So we infer in today's that's what we measure.",
                    "label": 0
                },
                {
                    "sent": "In fact, is the binding of the substrate into the protein.",
                    "label": 0
                },
                {
                    "sent": "You have this protein, they have some intrinsic opening closing that's known, and then as much as you are sparging, you have the binding, and you can actually measure the KD from the area under this curve, and you can measure on and off rates, but this kind of.",
                    "label": 0
                },
                {
                    "sent": "Adjust the time that it takes taking the two states so.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's how you do it.",
                    "label": 0
                },
                {
                    "sent": "You have a KD about .5 micromolar and then the onrait nicely change with the concentration of the substrate.",
                    "label": 0
                },
                {
                    "sent": "The offered slightly decreased with concentration of substrate.",
                    "label": 0
                },
                {
                    "sent": "We find out why we're not going to talk about that.",
                    "label": 0
                },
                {
                    "sent": "I can tell you later.",
                    "label": 0
                },
                {
                    "sent": "But what they really want?",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Show you is this.",
                    "label": 0
                },
                {
                    "sent": "This is a threat experiment with exactly the same protein where colleagues in Groningen and that's how they did it.",
                    "label": 0
                },
                {
                    "sent": "They take a coverslip, they covered passivated with peg.",
                    "label": 0
                },
                {
                    "sent": "Then they put like and you traveled in.",
                    "label": 0
                },
                {
                    "sent": "Then they put an antibody that binds to the historic and they take this protein.",
                    "label": 0
                },
                {
                    "sent": "Then they put an acceptor and then eternal here for threats.",
                    "label": 0
                },
                {
                    "sent": "They test about 20 different kind of concert.",
                    "label": 0
                },
                {
                    "sent": "Nobody really work very well.",
                    "label": 0
                },
                {
                    "sent": "They found one work very well.",
                    "label": 0
                },
                {
                    "sent": "Three years later they got this kind of data here right?",
                    "label": 0
                },
                {
                    "sent": "And this girl is here.",
                    "label": 0
                },
                {
                    "sent": "Exactly the same thing like you know, opening, closing, intrinsic, you know, more sparging ANAN saturation here.",
                    "label": 0
                },
                {
                    "sent": "What we did is we take a single channel.",
                    "label": 0
                },
                {
                    "sent": "It took an hour.",
                    "label": 0
                },
                {
                    "sent": "We purify the protein we put into things and we got the same day, the same experiment.",
                    "label": 0
                },
                {
                    "sent": "So about two years difference in the process that we did, we didn't have any optimization that now I have to admit the protein works in this way, But this one did and when we went to see about the KD.",
                    "label": 0
                },
                {
                    "sent": "He was pretty much exactly the same.",
                    "label": 0
                },
                {
                    "sent": "If you measure from bulk is very similar.",
                    "label": 0
                },
                {
                    "sent": "The off rate is about two fold difference.",
                    "label": 0
                },
                {
                    "sent": "The on rate is identical now.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to spend too much time here, but that's amazing.",
                    "label": 0
                },
                {
                    "sent": "I mean, I know nobody could expect that, right?",
                    "label": 0
                },
                {
                    "sent": "So it's like is just, you know, God really likes me because you know that works like.",
                    "label": 0
                },
                {
                    "sent": "Physically, I don't know why it happens, causes confined inside the pore.",
                    "label": 0
                },
                {
                    "sent": "It's got the same run rate.",
                    "label": 0
                },
                {
                    "sent": "That means that the kind of diffusion is at the poor somehow is the same as the diffusion outside port.",
                    "label": 0
                },
                {
                    "sent": "That doesn't really kind of get compressed by the port, doesn't move too much against the walls.",
                    "label": 0
                },
                {
                    "sent": "The opening is a bit different, but I could be also the threat that can be.",
                    "label": 0
                },
                {
                    "sent": "You know, the problem, not necessarily the components of the poor, and it just doesn't unfold, just perfect.",
                    "label": 0
                },
                {
                    "sent": "Just just like you have.",
                    "label": 0
                },
                {
                    "sent": "And outside the port works like this inside the port already and expect that whatsoever.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right, so this kind of the thing that is a big thing for us, because now we have a technique that allow us to see at the single molecule level of protein in the same way that is at the bulk level.",
                    "label": 0
                },
                {
                    "sent": "And we can follow it for minutes or hours, right?",
                    "label": 0
                },
                {
                    "sent": "I don't have the data here because we're still learning, but we have one problem we can really see all the kinetic activity, which is, you know something like, you know, I really, I think this is the first single molecule.",
                    "label": 0
                },
                {
                    "sent": "You know real single molecule kind of data, because when you do with the threat you really can only do it for a few seconds and then you know the threat is gone because you probably choose SSD.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if you really want to see a single molecule, you really need to do in this way.",
                    "label": 0
                },
                {
                    "sent": "Now I really need to go much quicker.",
                    "label": 0
                },
                {
                    "sent": "I'm going to skip this kind of part here, which is when you have a different kind of so the glucose bound.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Protein works in exactly the same way precise.",
                    "label": 0
                },
                {
                    "sent": "They another binding protein works slightly different.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm going to cut short a Long story short.",
                    "label": 0
                },
                {
                    "sent": "Basically, what happens that the protein here is gone?",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Dipole moment, which is exactly perpendicular to the poor.",
                    "label": 0
                },
                {
                    "sent": "So when is inside the pore, either goes in this direction and that direction.",
                    "label": 0
                },
                {
                    "sent": "This have different current levels, so actually we can see the protein goes in wonder confirmation.",
                    "label": 0
                },
                {
                    "sent": "The other confirmation by morning.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Fortunately, by simply just put in different charges in different partly protein, we can actually render protein going this way or that way, and that's actually called some implication because there are like little feelings that itself.",
                    "label": 0
                },
                {
                    "sent": "So you can imagine if you have a protein and you put a position modification like a phosphorylation, you can actually change the way it works, and that could be also be a way to actually control the way that actually protein work inside the cell, which is very against something really unexpected.",
                    "label": 0
                },
                {
                    "sent": "And that's",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What you have from a prospective making the device you want to make something like that which is before it was gone all the place and then really you can see the binding of glutamine in the same way anyway.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's just quick.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What we're going to do with that?",
                    "label": 0
                },
                {
                    "sent": "We tested actually this we took blood right?",
                    "label": 0
                },
                {
                    "sent": "So without purification without anything, we do a triple block.",
                    "label": 0
                },
                {
                    "sent": "We put in our simple and we can actually measure the concentration of glucose inside the blood we.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not only put that we put 2 adapter in the same machine, so we put in the same solution.",
                    "label": 0
                },
                {
                    "sent": "We put glucose, an Argentine.",
                    "label": 0
                },
                {
                    "sent": "They first enter one.",
                    "label": 0
                },
                {
                    "sent": "They bind glucose and you see this correspondence.",
                    "label": 0
                },
                {
                    "sent": "Certain concentration of glucose in blood.",
                    "label": 0
                },
                {
                    "sent": "We take another one that comes out of the poor automatically.",
                    "label": 0
                },
                {
                    "sent": "Another one comes in and you can actually measure the concentration of asparagine in blood, which is, you know.",
                    "label": 0
                },
                {
                    "sent": "Happens to be also like in indoor range that we can measure.",
                    "label": 0
                },
                {
                    "sent": "So now we went to check and we see that you know from one of these way to actually measure the concentration of blood and we can see that just without any optimization or anything.",
                    "label": 0
                },
                {
                    "sent": "This system can actually measure concentration.",
                    "label": 0
                },
                {
                    "sent": "Of glucose, an asparagine from blood and pretty well not only from blood, but also can get from sweat.",
                    "label": 0
                },
                {
                    "sent": "You can measure pretty well from different kind of system that we use, so you can imagine now that we can have new phone or in your watch kind of like one of the system, perhaps soon, not really, but you know, at some point and then you can actually measure the concentration of all your metabolites that you have at least a few of them, and they can tell you directly.",
                    "label": 0
                },
                {
                    "sent": "Alright, OK, did you drink last night?",
                    "label": 0
                },
                {
                    "sent": "Right, because if you drink is OK for being drink, go to the doctor to have you know a couple of blood tests because he's out of the normal bar.",
                    "label": 0
                },
                {
                    "sent": "So maybe there's something more serious so it could actually be something that tells you you know, like if if it's something more serious that happened happened to you.",
                    "label": 0
                },
                {
                    "sent": "So like we actually collaborating with Oksana report, which.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have this system where you can connect to a device to actually develop a system for 10s of different metabolites and try to link them to the health of an individual and hopefully we can get it too.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "New generation devices for from a tab.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now the last five minutes I can read maybe less what I'm going to tell you about this frac and how we actually try to kind of engineer these poor or changes.",
                    "label": 0
                },
                {
                    "sent": "Portrait find out the reason why this poor can actually be used to sequence proteins.",
                    "label": 1
                },
                {
                    "sent": "So like frac, unless Clay A he's got a different shape you can see he Razavi sort of shapes is very interesting and the construction here is very good to actually look at polymer as the translator report.",
                    "label": 0
                },
                {
                    "sent": "We already checked this one in concept in the framework of DNA can actually have differences between different DNA strands.",
                    "label": 0
                },
                {
                    "sent": "So like we work with protein.",
                    "label": 0
                },
                {
                    "sent": "So like the idea is something like that.",
                    "label": 0
                },
                {
                    "sent": "Use frac.",
                    "label": 0
                },
                {
                    "sent": "At some point you put a model protein.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On top of that, unfolds outside the poor, then it read it and then can we get something that you know this energy that pulls the constant force to the poor protein or amino acids have different charge.",
                    "label": 0
                },
                {
                    "sent": "That is the problem.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right, so the other thing is that we want to.",
                    "label": 0
                },
                {
                    "sent": "Also, you know in the more immediate future we want to actually have poor, they actually recognize something that is smaller than this 14 kilodaltons that client does.",
                    "label": 0
                },
                {
                    "sent": "So we want to have another port that is able to discriminate biomarkers that are actually much smaller.",
                    "label": 0
                },
                {
                    "sent": "So we choose five biomarkers of different size from 25 to 1.3 kilo.",
                    "label": 1
                },
                {
                    "sent": "So this is about 12 amino acids and say, alright, the old bio market also kind of disease.",
                    "label": 0
                },
                {
                    "sent": "Can we actually see that?",
                    "label": 0
                },
                {
                    "sent": "From frac and can we actually discriminate between them?",
                    "label": 0
                },
                {
                    "sent": "Right, so we started with the big one is called, trypsin.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Those inside the poor and in the same way that I showed before that all works fine, stay there for actually quite short time because the poor is actually much smaller.",
                    "label": 0
                },
                {
                    "sent": "It's not hostal.",
                    "label": 0
                },
                {
                    "sent": "So in and out very quickly.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We see that from this kind of analysis, which we measure how long it stays at the pour.",
                    "label": 0
                },
                {
                    "sent": "The more you press it, so the more power you put, the longer stay there.",
                    "label": 0
                },
                {
                    "sent": "So we we showed here that this.",
                    "label": 0
                },
                {
                    "sent": "Molecule here does not translocate across the number.",
                    "label": 1
                },
                {
                    "sent": "That's what you know.",
                    "label": 0
                },
                {
                    "sent": "That's what you expect.",
                    "label": 0
                },
                {
                    "sent": "Nothing new here.",
                    "label": 0
                },
                {
                    "sent": "Everything goes according to plan.",
                    "label": 0
                },
                {
                    "sent": "Then we choose another one and determine which is quite.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can see here is the peptides.",
                    "label": 0
                },
                {
                    "sent": "Basically there, half Alyx, just put together with the sulfide bridges is a negative charge, a pH 7, and that's kind of how it looks like.",
                    "label": 0
                },
                {
                    "sent": "So we test this one.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nothing happened, so it doesn't get into the pore, nothing happens.",
                    "label": 0
                },
                {
                    "sent": "Then we got a little bit scared here.",
                    "label": 0
                },
                {
                    "sent": "We said alright, so let's negatively charged.",
                    "label": 0
                },
                {
                    "sent": "Let this model flow is not strong enough to put it across the nanopore.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And that's why because this is the kind of energy bar that is to go through.",
                    "label": 0
                },
                {
                    "sent": "This is the construction of the nanoporous.",
                    "label": 0
                },
                {
                    "sent": "Too much electron negative.",
                    "label": 0
                },
                {
                    "sent": "So the protein here is not like the big protein, they actually stops at this level here, where the semantic flow is strong enough to put it, it needs to be a negative charge.",
                    "label": 0
                },
                {
                    "sent": "Going against this really heavily charged construction and that doesn't work.",
                    "label": 0
                },
                {
                    "sent": "And we know that because when we muted that into a positive charge, now we see translocation of this polypeptide.",
                    "label": 1
                },
                {
                    "sent": "So basically we know.",
                    "label": 0
                },
                {
                    "sent": "And that's very bad news for protein sequencing.",
                    "label": 1
                },
                {
                    "sent": "So that if something is negatively charged, it cannot translocate through a negative charge kind of construction.",
                    "label": 0
                },
                {
                    "sent": "We need the construction to read.",
                    "label": 0
                },
                {
                    "sent": "Basis or the protein kind of amino acids, but also with the charge to get these letters multiflow without the charge have not resulted flow, so is a catch 22 situation.",
                    "label": 0
                },
                {
                    "sent": "Either you take a positive to actually sequence negatively charged or negatively positively charged, but you both right?",
                    "label": 0
                },
                {
                    "sent": "How can you do that?",
                    "label": 0
                },
                {
                    "sent": "Well, it happened that.",
                    "label": 0
                },
                {
                    "sent": "There is a magic pH.",
                    "label": 0
                },
                {
                    "sent": "Lucky.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So if you go to Page 4.5.",
                    "label": 0
                },
                {
                    "sent": "It works.",
                    "label": 0
                },
                {
                    "sent": "I don't know why.",
                    "label": 0
                },
                {
                    "sent": "Well, I know why, but that's again another of this miracle that happens when you do science.",
                    "label": 0
                },
                {
                    "sent": "So a pH 4.5 this is much less charge you can see here.",
                    "label": 1
                },
                {
                    "sent": "It's much heavier this read.",
                    "label": 0
                },
                {
                    "sent": "This is much less red, so that's still strong enough to have less model flow.",
                    "label": 0
                },
                {
                    "sent": "So it is a bit less than normal, but you have it.",
                    "label": 0
                },
                {
                    "sent": "But the charges on the peptide get neutralized just enough.",
                    "label": 0
                },
                {
                    "sent": "To actually have another multi flow dominates.",
                    "label": 0
                },
                {
                    "sent": "The transport mechanism.",
                    "label": 0
                },
                {
                    "sent": "So now if you go up each 4.5.",
                    "label": 0
                },
                {
                    "sent": "You have translocation of polypeptides.",
                    "label": 0
                },
                {
                    "sent": "All of them.",
                    "label": 0
                },
                {
                    "sent": "Another thing in the.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Littlest promise 2 minutes I. I think this interests you.",
                    "label": 0
                },
                {
                    "sent": "I think is that when you use this larger larger protein here it's about 11.6 kilometers.",
                    "label": 0
                },
                {
                    "sent": "We didn't really expect to translocate because you can see here is actually larger than the pull itself, But what we saw our pH.",
                    "label": 0
                },
                {
                    "sent": "4.5 That's when you increase the force that you pull your protein.",
                    "label": 0
                },
                {
                    "sent": "You're going to have that the time that is still inside the port decreases, which is indication of translocation.",
                    "label": 0
                },
                {
                    "sent": "You need to trust me there.",
                    "label": 0
                },
                {
                    "sent": "Another thing we see is that the current that is.",
                    "label": 0
                },
                {
                    "sent": "You know, during this process is always 0, right?",
                    "label": 0
                },
                {
                    "sent": "So means that this thing here kind of plug the AL Phoenix in the protein and it doesn't allow any protein.",
                    "label": 0
                },
                {
                    "sent": "Any items to go through until it kind of forced the translocation by just moving the Helix on the side.",
                    "label": 0
                },
                {
                    "sent": "We saw that with DNA we prove that that happens with DNA and also we saw that with the builder report that I showed you before the client report.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then we saw that others they have a threshold potential in which the first translocator translocate went a bit smaller and then.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we saw that this one is Constance in one which is only 12 amino acid.",
                    "label": 0
                },
                {
                    "sent": "You can really see again the translocation nicely.",
                    "label": 0
                },
                {
                    "sent": "Remember that doesn't work appear 7.5, only work at this magic pH.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally, just the last light before you know the things is that if you're using detailing which is the quantity issue before the very small peptide that the link by system bridges we took under 10100 times in, do they are both linked to different disease?",
                    "label": 0
                },
                {
                    "sent": "The only difference they have is this kind of tryptophan here, right?",
                    "label": 0
                },
                {
                    "sent": "And you can see when the translocate across the nanopore, you see the difference between one and the other.",
                    "label": 0
                },
                {
                    "sent": "You can clearly see the difference between these two population here, and why?",
                    "label": 0
                },
                {
                    "sent": "Put that it was important.",
                    "label": 0
                },
                {
                    "sent": "Firstly, because the ratio between these two.",
                    "label": 0
                },
                {
                    "sent": "Tells about the progression of certain disease model only for that 'cause that tells you that if you have a trip to fund, probably in the linearized strength, you can translocate to report you actually can see the difference between tryptophan and tryptophan.",
                    "label": 0
                },
                {
                    "sent": "Most likely I mean that we need to do the experiment, but most likely that so now we are really very hopeful that we created this kind of system, in which you can push a single peptide across an app or a most likely, maybe not with this poor but with another one, but probably also with this one you can see the difference between at least a big pack.",
                    "label": 0
                },
                {
                    "sent": "Big, I mean acid in this morning classes that you have there.",
                    "label": 0
                },
                {
                    "sent": "So really we can actually start to move towards protein sequencing, right?",
                    "label": 0
                },
                {
                    "sent": "Conclusion?",
                    "label": 0
                },
                {
                    "sent": "Slide is that?",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm very glad that any current Ronald ports we can use to study proteins.",
                    "label": 1
                },
                {
                    "sent": "We're really on the verge here to create a new technique to study proteins in single molecule proteins.",
                    "label": 0
                },
                {
                    "sent": "Emoji is really unfortunate.",
                    "label": 0
                },
                {
                    "sent": "Cannot show you.",
                    "label": 0
                },
                {
                    "sent": "I have amazing data which we don't understand yet, so maybe next time when you invite me, I'm going to take you that.",
                    "label": 0
                },
                {
                    "sent": "But really, we can see these kind of cycling through a lot of different structure in a protein.",
                    "label": 0
                },
                {
                    "sent": "Why is important?",
                    "label": 0
                },
                {
                    "sent": "Because their native proteins, the first in the world that would get an edge proteins, is got high bandwidth.",
                    "label": 0
                },
                {
                    "sent": "So you can actually measure down to microseconds up two hours for many hours, which is again something that is really something you Ryan Air wants me to go, so it'll be quick confirmation dynamics.",
                    "label": 0
                },
                {
                    "sent": "We can see the compression timing protein issue that you can measure banning costs, which incredibly there exactly the same inside or outside the poor.",
                    "label": 0
                },
                {
                    "sent": "We don't understand why.",
                    "label": 0
                },
                {
                    "sent": "Probably confirm it's not an issue.",
                    "label": 0
                },
                {
                    "sent": "Probably crowding is not an issue.",
                    "label": 1
                },
                {
                    "sent": "All these kind of crowding effects in protein, actin, etc.",
                    "label": 1
                },
                {
                    "sent": "We don't have that much data, but for at least for this protein is not initial whatsoever.",
                    "label": 0
                },
                {
                    "sent": "We can actually see biomarkers.",
                    "label": 0
                },
                {
                    "sent": "Protein biomarkers.",
                    "label": 0
                },
                {
                    "sent": "You know I didn't show the data, but they're very nice.",
                    "label": 0
                },
                {
                    "sent": "Different kind of.",
                    "label": 1
                },
                {
                    "sent": "Currents we can see metabolites.",
                    "label": 0
                },
                {
                    "sent": "We can really make tomorrow if you want somebody needs you know sensor for glucose.",
                    "label": 1
                },
                {
                    "sent": "Maybe somebody needs so for us packaging and glutamine we can actually sell it tomorrow.",
                    "label": 0
                },
                {
                    "sent": "If somebody is interested.",
                    "label": 0
                },
                {
                    "sent": "One thing is important for menopause.",
                    "label": 0
                },
                {
                    "sent": "I think we need to finish multiplexing.",
                    "label": 0
                },
                {
                    "sent": "We can do with different ports, or different analytes and really want to push into this wearable devices because we can re analyze sweat in the same way that we can analyze any other body fluids.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Finally, the people who actually did the work so.",
                    "label": 0
                },
                {
                    "sent": "Michelle was the 1st Post Oak ahead again.",
                    "label": 0
                },
                {
                    "sent": "Very lucky to have somebody like him was really good.",
                    "label": 0
                },
                {
                    "sent": "He just left for a startup in Paris an not to do nanopores.",
                    "label": 0
                },
                {
                    "sent": "Not yet.",
                    "label": 0
                },
                {
                    "sent": "Then Carsten also did some work with the SPD proteins.",
                    "label": 0
                },
                {
                    "sent": "Then you have valid that did all the work with the speedy proteins and I believe one which Kevin one here he did all the work with the peptides and thank you very much for your attention.",
                    "label": 0
                }
            ]
        }
    }
}