{
    "id": "kr4zy3s65tu7sjcixkvemb5i4rdulgvw",
    "title": "Complex Networks Analysis",
    "info": {
        "author": [
            "Ljupčo Kocarev, Macedonian Academy of Sciences and Arts (MANU)"
        ],
        "published": "Jan. 31, 2017",
        "recorded": "September 2016",
        "category": [
            "Top->Computer Science",
            "Top->Data Science"
        ]
    },
    "url": "http://videolectures.net/miningdata2016_kocarev_networks_analysis/",
    "segmentation": [
        [
            "I decided to talk about my talk rule.",
            "I will not have friends, but my group or what I'm doing, but I will just give you a brief overview of the brief overview of some aspects of the network analysis.",
            "Since this is a really a huge topic, I decided to talk about so we did the network analysis.",
            "I will talk mostly on the exponential."
        ],
        [
            "I start with the trip.",
            "Why the called the weekend?",
            "Actually this is the guy who I've met some families who wrote a book theoretical mathematical theory of communication with functional boot and they say in 1948 with the title science and complexity.",
            "He argued in this paper.",
            "According to him, he said your science could be violating free periods.",
            "Eat out implicitly, the cycle is disorganized complexity, and the last one which is he called it organized again, according to Kim and this is the code from this paper.",
            "Science must, over the next 50 years learning to deal with these problems of the organized complexity.",
            "Um?",
            "This is indeed happening in the last 50 years ago, and as a part of these understanding of organized complexity and new cyantific distributors worse, which is today called for whatever network science or within the machine learning, we could say network analysis and so on and so forth.",
            "Yeah, at least the couple of scientists who contributed to this.",
            "My oldest brother magician, scientist from social science, psychologists, and so on so forth.",
            "Here is a Noble prize winner who are working very flattering networks.",
            "We all know about water there displayed on advanced graph theory and the rest is on screen.",
            "So as a consequence of these.",
            "Emerging of this new science."
        ],
        [
            "Existing please.",
            "For example, this has emerged, which is truly multidisciplinary, advent involving different sampling disciplines involving math, physics, social science, computer science and not natural science.",
            "However, this caused some problem and since this letter is sent to the students, the PhD students.",
            "This is how we understand the school basically.",
            "So this is the reason I'm not talking about my group or what I'm doing.",
            "Unfortunately, these group of scholars often guilty I quite often do not agree.",
            "Moreover, they don't talk to each other.",
            "Test created quite as tensions between different groups and for the students, which is much more difficult actually.",
            "This should type understanding how to read the papers from the different scientific disciplines.",
            "There's another problem.",
            "The second problem, which comes from from that one from the development of the science in the last 56 years, is that even the publishing has shifted.",
            "Unfortunately, so we can, even if we were to publish something unique science with some fucking statements in the title in the offset of the papers, which unfortunately very often.",
            "Leave the money collection.",
            "So at least.",
            "In the case of the random graphs nature science are the home of the 1010 seconds from Python's leading open loop, often to manipulation, and I'll give you one example.",
            "I want to say.",
            "Hong Kong weather.",
            "This money Collations Woodbury preventive care."
        ],
        [
            "So basically this is not full form of very solid paper publishing.",
            "I don't know science image.",
            "You can read it basically permanently surpassing yet fragile 95% of the landscaping removed and the gradual steel statement.",
            "However, targeting removal of only two point 3% of the has to disconnect the Internet.",
            "And again, as it has a student before whatever the searcher who is reading this is always.",
            "Be careful because behind that this is just taking.",
            "You should check whether the statement is correct.",
            "No, just do it.",
            "Google Maps you can actually check that.",
            "If you remove 95% of the beings from 6 billion people.",
            "Which were initially connected after that, after removing you will have only 56 people who can check email and this is not really the Netflix connector installed.",
            "This is something we sleep together.",
            "Same is true for the second statement of these.",
            "Please quote."
        ],
        [
            "Network science.",
            "Model factory what the net for pieces is whatever we can have a different definition.",
            "Anatomy definition would be a phenomenon or our process or data, whatever which could be approximately as a first information with a graph.",
            "The underlying network action graph again sees.",
            "It seems this is a very multidisciplinary research here.",
            "Sam, please invented different names for the basic notion of the open graph.",
            "For example, vertex and edge in a different scientific community at different different names are used for that point in physics side, and then on the computer science.",
            "Normally in social science security intact.",
            "These are the basic problems.",
            "I will not do with with all of them.",
            "Of course it's not possible in one dollar 45 minutes, so some of the problems which may provide a space in the recent 10 of 20 years defending network from that data.",
            "That's very crucial question and just the construction of the network that pending on down that they had invented what you are doing.",
            "Actually the note would be fine in a different way.",
            "It can be and you run or our region of interest depending on the under level.",
            "And at least you're characterizing them.",
            "And when you have a graph then how to explain the structure?",
            "The properties of the graph?",
            "Understanding processes that take place on the networks.",
            "Each network actually support different processes and then filed, understand, and finally at the models which are connected with both of US first topics and this is so from all these network analysis, filter forward.",
            "This will I will talk about this part here so very, globally speaking, so that's I will concentrate on this part here.",
            "Again, this is huge and I cannot cover everything so."
        ],
        [
            "Again, I will reduce to something or be more specific and I will talk about this financial documents that two distinct level or two types of network models.",
            "One is not well known overhead.",
            "Now these relational model models.",
            "And from these two levels.",
            "How?",
            "What is it that you don't actually, I will concentrate on the on these type of models and especially the exponential random graph.",
            "Just to show you.",
            "How?",
            "What usually scientists would cover what type of models scientists are working with?",
            "Before starting."
        ],
        [
            "I will give you 3 examples of three papers which has been have been published recently and which gives our kind.",
            "Overview of the of the network model.",
            "The 1st is a human paper publishing silently you 2003 and this number is how much this thing recited.",
            "It's really cited paper it has this.",
            "Is it covered different topics but also covers from the different type of models here.",
            "The Black one graph and then the models of network programming.",
            "So basically what I will talk today is this one and since this also included in this one which means this part, I will not talk about these models here.",
            "Another"
        ],
        [
            "Quite nice paper which I recommend to read the Paper Publishing Foundation trained machine learning written by matching learning community.",
            "These are the with the title survey on this optical network models.",
            "These are the models which were over used in this paper and again what I will discuss here then just this part of the talk about P1 model exponential random graph model Markov model.",
            "But I will not discuss these models here, so just one part I will concentrate on the one specific specific apparel models.",
            "Which are from my point of view, very important of course."
        ],
        [
            "And finally a paper.",
            "Which does not do which, do not overview.",
            "It's not overview network models, but this is the paper from Westport is covered.",
            "Describing the the library.",
            "The stuff like that, which I'm certain that you are familiar with and these are the models which does not have it in it.",
            "Surprisingly, I couldn't find here exponentially.",
            "Models that several models that offer you there, and he's called watches are some well known models but not exponential random graph model.",
            "1 Snap snap is a very common but.",
            "Stanford network analysis.",
            "Something like that is a is a tool which is very long.",
            "Good level of incentive for himself or four network analysis and you raise a professor over there.",
            "I think that social problems.",
            "Don't look back."
        ],
        [
            "Not before starting with the exponential random graph model, I should just say a few words about the financial family of distribution, because this is.",
            "Oh, part of the whole concept.",
            "The exponential family of distribution, something which is well known in statistics.",
            "It has been done alone almost 100 years ago and it has a huge number of paper and books on the subject.",
            "Some of the well known distributions belong to include this expansion family includes many of the most common distributions I could hear.",
            "Some of them these are examples of common distribution.",
            "Better know their financial well.",
            "I want to stress here the reason why financial formalism so important because they provide provide general framework for selecting.",
            "The problem is this and for defining the Yugo samples, autistics usually called sufficient services, so these are the two reasons why we need why actually scientists use exponential family distribution parameters, and then the sample of the sufficient statistics.",
            "You know, natural way in which they could then models for their support for the data."
        ],
        [
            "This is the definition family distribution, so these are the basics.",
            "Other functions of the parameters and A is a lower visual function normal function which is used for normalization.",
            "So solid exponential family of distributions of the exponential family he said to belong to the exponential family.",
            "That we go to the connection family.",
            "If the probability function can be written in these four 2A2, two things I would like to mention.",
            "The first is that you draw.",
            "Hey tell which means that we have the family said to be in for.",
            "However very often it can happen and he will see this in a moment that actually you have much.",
            "Do you have more?",
            "Function of.",
            "In this case, definition family safety with curved and this is used in.",
            "I will explain you.",
            "In a meeting, why when it misses you so he said that exponential family.",
            "How is our define exponential family of distribution?",
            "How the family?"
        ],
        [
            "Quit Lambeau logisticians the Paramenters disappearance of the normalization factor bernouilli."
        ],
        [
            "Really is this way this is apparent matter and again something which is well known, so I will not go to detail.",
            "I will keep this life."
        ],
        [
            "No, the grass.",
            "We need we all know how the final graph, but I would like to stress the differences in the division of graph well from the computer science statistics.",
            "Of course, that if we went into reticle, computer science graph is defined in terms of nodes and edges here is defined in terms of nodes and a corresponding measurement, which is usually a Jesse Maddox.",
            "Usually identity metrics, so that's the.",
            "Definition"
        ],
        [
            "And now the exponential random graph model.",
            "Finally, we will define the exponential random graph models.",
            "This is Doug.",
            "Exponential random graph model with the probability distribution briefly with Gen 4.",
            "I got it so so this is the probability of an item being what being connected or be of existing.",
            "X is a random metrics random pile up, so it's just semantics, so this is if you have a set of all graphs downsample.",
            "So this is the whole approach is you don't consider a single graph.",
            "You consider us at all graphs and samples, so this is the probability that this man is so This is why I'm saying will have this.",
            "So this specific location we have, these, the probability will have these values, so it's a realization matrix of the adjacency matrix Raptor network.",
            "It's just this formulation allow or zero values, for example zero or one of the values inside me.",
            "So this is the set of all of which means that you your graph is not connected, so it's a matrix of just zeros and ones, yes?",
            "So you're talking about the probability of a connection.",
            "It's a it's a model.",
            "As I said, this is an ensemble model.",
            "You have the set of all and all the questions are."
        ],
        [
            "It is simple actually.",
            "So here was the major configuration.",
            "Set of the of the graph, some sub graph, whatever clicks will will will see what will happen.",
            "Social services.",
            "These are the methods of plastic folder configuration for the page.",
            "This is about you, and this is a normalizing constant which you need in order to define probability.",
            "So the main questions are very simple.",
            "Actually you would like.",
            "Again, think about the set of all that's simple guys that this data in in when you do much whatever you don't.",
            "You just consider the set of all graphs.",
            "You cannot do anything.",
            "You need some kind of structure to set you.",
            "Really, this is a measurable structure in this case, so you need that one.",
            "So this is actually a measure space and you consider that one that two.",
            "Again.",
            "General question why to answering this.",
            "The first one, given this measure?",
            "Given this, what are the properties of the graph and the 2nd is?",
            "Given that on how to find the power so this is one of the question is from the map.",
            "The other question is from machine learning community or from statistical and this has been developed in the in the last 30 years.",
            "Really, I may be 100 years along in many papers and it's very well developed.",
            "The whole topic is.",
            "Is really multidisciplinary, Ann.",
            "I will not.",
            "You will not be surprised when I say that different scientist invented different names for different things, so he remembers the service is called component.",
            "So from physics from statistical physics and it has some meaning across.",
            "But I will not go further in that.",
            "I just want to stress that actually this type of.",
            "Of type of probability distribution has been studied in physics in statistics in martial law in management.",
            "Just to so say X is would be some measurable statistics on some configuration of adjacency matrix, so would say for this matrix I would assign this value for example with some of that number pages member of three.",
            "And this would be the statistics.",
            "Yeah, you would want yes."
        ],
        [
            "So this is the Hamiltonian.",
            "Sign written, I'll skip this one.",
            "I just want to stress that actually.",
            "And even not here today, if you read the paper published this year by statisticians, they use the terms phase transition in this set of because terms which are used in physics because actually this is what they want.",
            "Building"
        ],
        [
            "Examples.",
            "The simple is.",
            "Number of edges Andrew have one part of it, so this is a sufficient sophistic.",
            "What do you think?",
            "What what model is in?",
            "Give you the simplest one.",
            "What is a stimulus one model in in graph theory training?",
            "So this is the abstract.",
            "The second one is the number of edges and number of two stars.",
            "We have two partners, that's this one, but one is the number of edges, number 300.",
            "This is mine."
        ],
        [
            "Number.",
            "And as number of neutralize number of our degree number filigree.",
            "So here you have one environmental two and parameters.",
            "And probably this is very famous P1 model in social science.",
            "In social networking, very very these are.",
            "Numbers, numbers K stars #301 with panic didn't want understand these are just artistic.",
            "This is what this called Markov Markov graph again.",
            "Yeah.",
            "So that the rest of my talk.",
            "I want to call this just to show how they important, how that they have been derelict.",
            "Who?"
        ],
        [
            "I.",
            "Training this simple Swan.",
            "The car."
        ],
        [
            "Two different violence.",
            "I assume that you're familiar, so I will not go into details.",
            "One is the number of cells number set of Milton, set of edges and the man is the set of proton.",
            "The probability that the edge will connect to not yes."
        ],
        [
            "Just again.",
            "Why this is called the training?",
            "Because of that, several papers published almost invisible on the same model.",
            "Actually I don't remember.",
            "I think that the first model is."
        ],
        [
            "The models feel better and the 2nd is elevated or they want you be selected.",
            "We answer as you can find that this model is also called the evidence rainy Gilbert model but."
        ],
        [
            "Usually it's hard to get it ready.",
            "Why?",
            "Because it proved this.",
            "They prove very nice tour and saying that there is a parliamentary interface in addition on the one when the giant component component exist in these streets.",
            "Actually you try to in each diesel for each of these models.",
            "Before using the models."
        ],
        [
            "The second one is to start model.",
            "And I will do that.",
            "I will not go into detail, but will the analytical solution has been leveled up recently and this is the paper in which they published analytical solution."
        ],
        [
            "3rd one is the South model that all this is a focal families is published this paper his paper.",
            "This model in 86. Review Journal.",
            "So this is a common problem.",
            "This is a Surface division services and number of regions, #3 angles, undirected graph.",
            "He found America without the model behaves strangely.",
            "They could visit.",
            "Kind of popular.",
            "Of them of apologies, the model, but you couldn't prove anything.",
            "Actually the the proof."
        ],
        [
            "Has appeared almost 10 years ago.",
            "Nice 2005.",
            "The paper what they say that along musical solution for this model solution seems to be exactly someone, so I don't see that what is important.",
            "The solution indicates that the model has no regime in which display moderate levels of clustering Steve allowed to go see it in real networks, so it should be good it will be necessary.",
            "It is true that things into the construction to avoid this pathology, and this is the problem.",
            "This pathology we see in all these models, and that's one of the main problems in exponential random graph here or exponential 100 points you say they don't represent reality well, yes, unfortunately.",
            "What's this?",
            "We don't understand basically still yet exponential random graph models.",
            "We don't understand them in the sense that in the sense of what happened.",
            "Well, what were they?",
            "OK.",
            "I should be very careful with this understanding if I'm in mathematician.",
            "This would mean when N goes to Infinity, what how the model if I'm a proficient then I have a data and I would like to fit my data together with practitioners.",
            "They have plenty nice nice paper written models.",
            "They can feed the data and so on.",
            "This side this college fun, but from the theoretical point compute, there's still some open questions which need to be answered.",
            "Even this year the the paper which has been published papers which have been published this year, still do not answer this question.",
            "It's really, it's really an open question.",
            "It's a very difficult."
        ],
        [
            "I'm running out of time.",
            "This is the Model B1 visa.",
            "What I want to stress here is that the.",
            "How does it and how they develop actually from the formerly the smallest group of people in the group of two people?",
            "Business called via and is defined with these, so this is it.",
            "Actually if the network is, the graph is directed.",
            "You may have four possibilities and descenders.",
            "So you have mutual, you have a symmetric and you don't have any connection, and assuming that these are independent.",
            "Somebody else, then you can build the model and this is the model.",
            "It's a very nice model and a lot of work has been done on these works have been done and so once and for all skip this slide because of the."
        ],
        [
            "I'm."
        ],
        [
            "But you will have it.",
            "And if you want you can read it or you can contact me because students and you like to use this model.",
            "Basically it's a very."
        ],
        [
            "This model has been OK.",
            "Exercise.",
            "I went through model or when the people were used to help the student random model.",
            "This is very easy to answer, but the second is the battle of I didn't talk about these exponential random graph models using the statistiques.",
            "It's very easy to do.",
            "Ability distribution function will have this one part for the in another part for old degree distribution out in the League sequence, but nevertheless some of the questions for bees.",
            "Fun without the paper.",
            "We just appeared on opportunistic approval here.",
            "So even for this simple as possible, one of the simplest, most possible got model.",
            "Yeah you can find papers proving something in this.",
            "English for this model."
        ],
        [
            "Marco graph it seems that this is the same guys I was wishing I only mentioned that so the idea here is."
        ],
        [
            "It's very nice baby.",
            "I wish I like it so this is the model why This is why is this number of register number of K stars?",
            "Number printables one really smart why the idea is very simple.",
            "The proof actually is based on that one and I."
        ],
        [
            "Give you a sheet of getting into the Java Jee you considered to be which is called the temples graph in which your notes are actually the links of the garbage.",
            "So the notes of this month are delete, assuming that.",
            "Assume that.",
            "Because of the fat properties defined in the in the.",
            "Usual way for the.",
            "Mark off of my photographs graphic novels you come up with a conclusion.",
            "Actually yes, history place so that the Greek techniques will be correspond rules for response to the three angles and stars in the in the set in the set in the South.",
            "Lucky.",
            "Yeah, I know it's a it's a difficult you cannot understand, but if you read the paper is very simple and straightforward while.",
            "The idea is like perfect.",
            "Are you really like it?",
            "So not considering the graph G But together with G. Considering the graph be another graph which actually the notes of these are the links of the Jeep, and then assuming that this we have market independence on the Markovian properties on this crappy reflects actually prove the fact that your function or your distribution funk."
        ],
        [
            "To Japanese is this?",
            "Is this some sort of dual problem?",
            "When you transform it from this is."
        ],
        [
            "We start this is a French model.",
            "636 and we have this one.",
            "Weather well known order this could be."
        ],
        [
            "Connected via 100 graphical model, you can find it every textbooks in machine learning, basically in which you stuff Markovian dependence on the variables."
        ],
        [
            "Connectivity.",
            "This is a paper.",
            "Actually it's not.",
            "The paper in the book in which you can, if you're interested in the in the graphical models Pharmacy mini foundation fancy machine learning.",
            "Actually, there's a lot of work in.",
            "But we actually think that so the main problem here, I didn't have time to talk about these.",
            "Basically the main problem here is to compute that.",
            "That's the main problem.",
            "You need different techniques approximation to compute, because you need all the realization of the graph all the possible.",
            "And if you have even independence this is huge and you cannot do it.",
            "So that's the.",
            "So all the subway gift, something and different techniques, actually our dialogue.",
            "That's the main problem here.",
            "Of course, conditional model, Goshen Field or random field are developed just to avoid these.",
            "'cause when you consider conditional then you are you actually don't compute.",
            "Best for the phone network and set these.",
            "But for for the part of the metric basically so this is the bees.",
            "You avoid.",
            "Simulation will do that."
        ],
        [
            "The whole field of exponential random graph models had been exploring the last couple of years and this is some papers which done by foster families, some of them about.",
            "Of course I mentioned this one here."
        ],
        [
            "Bye bye bye machine learning community but the different."
        ],
        [
            "Different papers offer different groups working in Unison.",
            "Working with the exponential random graph model papers which I mentioned here are not going to details I have."
        ],
        [
            "12 minutes more.",
            "One of the problem is this big analysis issue and this is all with the current curves exponential random graph models, business models actually.",
            "It may happen that largely or give the probability distribution is placed.",
            "Either man killed the full graph.",
            "You don't have this.",
            "You have this pathology.",
            "Actually, that's one of the problems would like to solve it.",
            "Working on that one.",
            "There's a paper prank of efficiently connecting this problem with instability.",
            "Or stability defined in a way how this is defined in the in.",
            "I'm consistent theory definition of the fuel.",
            "There's something about you just wanna live event for people using differential values.",
            "Models don't mention fearful want to use it."
        ],
        [
            "And finally, I would like to mention some recent work by statisticians by mathematicians in the field of of the large glass.",
            "So these are several papers published this year book Reading by author Lowers Who's Extra in Graph Theory.",
            "They said the question here is if we have an ensemble of objects, the set of all graphs and you have a a measure on that one or probability distribution, how bees behave, how these set with the matter behaves.",
            "Again with the title of this paper here.",
            "Is the faces and the table of my.",
            "Slide here faces and face innovations.",
            "This again shows that their connection with statistical physics they still work with that with prime proof.",
            "Actually, what happens in that?",
            "In the set of all sets of all graphs, one way how to do it is."
        ],
        [
            "Using.",
            "It holds and this I really like this one and This is why the reason I put it here.",
            "See if we have adjusted symmetrics you mark you are just Cymetrix to that.",
            "Square 010 how you do that?",
            "You divided streets, you impul everywhere.",
            "In this.",
            "Put the values 01 in each sub square.",
            "Of this sampling this point.",
            "And this is the zero correspond to the zero agency value of 0 Jessie metrics between J and car notes.",
            "Or one if this belongs to the if the value of the adjacency matrix is 1.",
            "So then you have a function from the service at which somehow Max Yordesta metrics and then you can define different measure that one and study the.",
            "The the space and how these space behave when it goes through."
        ],
        [
            "I will skip that front.",
            "This is what my group is working actually and move."
        ],
        [
            "Level, which is now something connected with.",
            "Remove the layers network and there's some work here aswell with the how to develop an exponential random graph models for the movie layer."
        ],
        [
            "That works."
        ],
        [
            "But I'll skip that one."
        ],
        [
            "Because I think that's that's not how come up.",
            "I'll I'll, I'll."
        ],
        [
            "She did this my last life.",
            "So far from this act, understanding of financial steal, something problem probably.",
            "I don't know.",
            "We will stay open for a long time.",
            "As I said, exponential random graphs models graph models have been used.",
            "I I didn't even shows we are, but having using in social science in machine learning in different roles in physics, I never mentioned that actually or Now what this deep learning.",
            "All this Boltzmann machine hopeful machine actually belong to the class of the exponential random graph.",
            "I could even talk about them beast, but this is quite different, completely different subjects.",
            "I didn't want to mess with that one, but basically.",
            "This is the same, so it was developed by physicists hope over the furnace is running better and then machine learning or statistician took it and now there are four but basically the mark is very similar and the question you're trying to answer answer or address is very.",
            "I know what is here, but from my point of view.",
            "That's something which I would like to work and I'm still working with my students.",
            "Is organizing hotel nuclear Arsenal.",
            "That's something which is.",
            "Michelangelo talk about this multi level.",
            "When you have a date you have a actors.",
            "We have a film makers, we have studios or something.",
            "So this is a classical.",
            "An example is for full science of the multi level and that's even some of the already."
        ],
        [
            "The paper appeared though, so this is the first page where we fit this disgusting mother for multi level in physics.",
            "This is called whoopie Multilayers, and recently has become very popular.",
            "But I didn't have time to talk about that one."
        ],
        [
            "And finally, I didn't talk anything about.",
            "Some very basic stuff from machine learning.",
            "How to connect them to what?",
            "The subject of my talk and with the network.",
            "Basically because all these there's a lot of work done in machine learning in network science and white fence, thanks.",
            "Definition for.",
            "Thank you.",
            "Sadly I'm too very very similar with any questions and I don't think there is a good answer to give, but I will say that I don't love to hear for you here.",
            "I think the top of the topic that is really curious is a goodness of fit of these models.",
            "Because yeah, if you if you if you got the best of the right structure as the minimal sufficient would be amazing.",
            "The best thing you can do to estimation, but how the hell do you know that you got the right model for this network and so the goodness of fit?",
            "Is the question how do you what does it mean to do a testing?",
            "And the second question, which is actually very similar, so we have things like this CLT which helps us understand why we see normal distribution everywhere.",
            "Do we have something similar that easily makes us understand why some types of networks would be more likely to appear in nature?",
            "So these are the two question because I'm trying to send.",
            "When would this there we would be applicable, right?",
            "When could we assume that it would make sense to use?",
            "OK, yeah, second question.",
            "The the.",
            "I don't think that the dancers.",
            "Yeah, then you can.",
            "There's no answer to that question.",
            "There's only examples even in this paper which I manage."
        ],
        [
            "And here they only consider a very small number of not general set of the distribution, but very simple distribution.",
            "So you can prove something for very simple distribution, not for the general an.",
            "Even for that you have.",
            "Usually it's I don't want to say that in Matthew assuming many things and then you prove something which whether this is useful or not is another question, but that's.",
            "From for the second question, what's that it is statistician do or whatever social scientists were that big they are.",
            "They don't have this.",
            "What you measure measure for the quality of the fitness.",
            "Unfortunately they compare they they use this.",
            "They put some hypothesis and then they use the data to see whether they can predict this hypothesis.",
            "Filter with the this is the usual thing, but there is no.",
            "As far as I know.",
            "Measuring, which is to say OK, your your data or whatever your model or fitting quite well with the data.",
            "It's a, it's a.",
            "It's a quite mess.",
            "Basically because it sounds like yes, it's tricky to use.",
            "Yes, it's a very difficult and you end up very often with when you use.",
            "When you find the paramaters, you end up very open with the models in which your graph is either empty or full connections is useless.",
            "You you know that you should have a natural creature, files, network or whatever, just a few connections, yes, and then you come up with a different technique setting pop with these so the.",
            "OK, well I have."
        ],
        [
            "Thanks.",
            "You can use alternate peak.",
            "I also like to different you.",
            "Actually you you not you don't work only with the paramaters, but you extend different function of the parliamentary extent is just to have it more reasonable to mortgage right fitting data.",
            "But why nobody knows just attend.",
            "Last question, is it true that in your case is the nodes are in a sense independent, so the random assignment of the nodes and everything?",
            "All these are IID?",
            "Or is there a dependency structure inside when you decide?",
            "Who would be connected to it so it 'cause it seems like from the exponential family you showed, I asked how many connections I would have between nodes and in some way that would be.",
            "It depends what you want.",
            "If you if you.",
            "If you have a, if your data is somehow it has some structure of the network, then you don't care if your data is just data would like to infer network.",
            "Then you can do it in different ways.",
            "You can assume that the days are some structure and then you model is a is an app in the graphical model.",
            "If you assume that the dependence between random variables actually reflect your graph, so it depends is defense.",
            "It depends what color is it?",
            "Hello microphone."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I decided to talk about my talk rule.",
                    "label": 0
                },
                {
                    "sent": "I will not have friends, but my group or what I'm doing, but I will just give you a brief overview of the brief overview of some aspects of the network analysis.",
                    "label": 0
                },
                {
                    "sent": "Since this is a really a huge topic, I decided to talk about so we did the network analysis.",
                    "label": 0
                },
                {
                    "sent": "I will talk mostly on the exponential.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I start with the trip.",
                    "label": 0
                },
                {
                    "sent": "Why the called the weekend?",
                    "label": 0
                },
                {
                    "sent": "Actually this is the guy who I've met some families who wrote a book theoretical mathematical theory of communication with functional boot and they say in 1948 with the title science and complexity.",
                    "label": 0
                },
                {
                    "sent": "He argued in this paper.",
                    "label": 0
                },
                {
                    "sent": "According to him, he said your science could be violating free periods.",
                    "label": 0
                },
                {
                    "sent": "Eat out implicitly, the cycle is disorganized complexity, and the last one which is he called it organized again, according to Kim and this is the code from this paper.",
                    "label": 0
                },
                {
                    "sent": "Science must, over the next 50 years learning to deal with these problems of the organized complexity.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "This is indeed happening in the last 50 years ago, and as a part of these understanding of organized complexity and new cyantific distributors worse, which is today called for whatever network science or within the machine learning, we could say network analysis and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "Yeah, at least the couple of scientists who contributed to this.",
                    "label": 0
                },
                {
                    "sent": "My oldest brother magician, scientist from social science, psychologists, and so on so forth.",
                    "label": 0
                },
                {
                    "sent": "Here is a Noble prize winner who are working very flattering networks.",
                    "label": 0
                },
                {
                    "sent": "We all know about water there displayed on advanced graph theory and the rest is on screen.",
                    "label": 0
                },
                {
                    "sent": "So as a consequence of these.",
                    "label": 0
                },
                {
                    "sent": "Emerging of this new science.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Existing please.",
                    "label": 0
                },
                {
                    "sent": "For example, this has emerged, which is truly multidisciplinary, advent involving different sampling disciplines involving math, physics, social science, computer science and not natural science.",
                    "label": 1
                },
                {
                    "sent": "However, this caused some problem and since this letter is sent to the students, the PhD students.",
                    "label": 0
                },
                {
                    "sent": "This is how we understand the school basically.",
                    "label": 0
                },
                {
                    "sent": "So this is the reason I'm not talking about my group or what I'm doing.",
                    "label": 1
                },
                {
                    "sent": "Unfortunately, these group of scholars often guilty I quite often do not agree.",
                    "label": 1
                },
                {
                    "sent": "Moreover, they don't talk to each other.",
                    "label": 0
                },
                {
                    "sent": "Test created quite as tensions between different groups and for the students, which is much more difficult actually.",
                    "label": 0
                },
                {
                    "sent": "This should type understanding how to read the papers from the different scientific disciplines.",
                    "label": 0
                },
                {
                    "sent": "There's another problem.",
                    "label": 0
                },
                {
                    "sent": "The second problem, which comes from from that one from the development of the science in the last 56 years, is that even the publishing has shifted.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, so we can, even if we were to publish something unique science with some fucking statements in the title in the offset of the papers, which unfortunately very often.",
                    "label": 0
                },
                {
                    "sent": "Leave the money collection.",
                    "label": 0
                },
                {
                    "sent": "So at least.",
                    "label": 0
                },
                {
                    "sent": "In the case of the random graphs nature science are the home of the 1010 seconds from Python's leading open loop, often to manipulation, and I'll give you one example.",
                    "label": 1
                },
                {
                    "sent": "I want to say.",
                    "label": 0
                },
                {
                    "sent": "Hong Kong weather.",
                    "label": 0
                },
                {
                    "sent": "This money Collations Woodbury preventive care.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So basically this is not full form of very solid paper publishing.",
                    "label": 0
                },
                {
                    "sent": "I don't know science image.",
                    "label": 0
                },
                {
                    "sent": "You can read it basically permanently surpassing yet fragile 95% of the landscaping removed and the gradual steel statement.",
                    "label": 1
                },
                {
                    "sent": "However, targeting removal of only two point 3% of the has to disconnect the Internet.",
                    "label": 0
                },
                {
                    "sent": "And again, as it has a student before whatever the searcher who is reading this is always.",
                    "label": 0
                },
                {
                    "sent": "Be careful because behind that this is just taking.",
                    "label": 0
                },
                {
                    "sent": "You should check whether the statement is correct.",
                    "label": 0
                },
                {
                    "sent": "No, just do it.",
                    "label": 0
                },
                {
                    "sent": "Google Maps you can actually check that.",
                    "label": 1
                },
                {
                    "sent": "If you remove 95% of the beings from 6 billion people.",
                    "label": 0
                },
                {
                    "sent": "Which were initially connected after that, after removing you will have only 56 people who can check email and this is not really the Netflix connector installed.",
                    "label": 0
                },
                {
                    "sent": "This is something we sleep together.",
                    "label": 0
                },
                {
                    "sent": "Same is true for the second statement of these.",
                    "label": 0
                },
                {
                    "sent": "Please quote.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Network science.",
                    "label": 0
                },
                {
                    "sent": "Model factory what the net for pieces is whatever we can have a different definition.",
                    "label": 0
                },
                {
                    "sent": "Anatomy definition would be a phenomenon or our process or data, whatever which could be approximately as a first information with a graph.",
                    "label": 0
                },
                {
                    "sent": "The underlying network action graph again sees.",
                    "label": 0
                },
                {
                    "sent": "It seems this is a very multidisciplinary research here.",
                    "label": 1
                },
                {
                    "sent": "Sam, please invented different names for the basic notion of the open graph.",
                    "label": 0
                },
                {
                    "sent": "For example, vertex and edge in a different scientific community at different different names are used for that point in physics side, and then on the computer science.",
                    "label": 0
                },
                {
                    "sent": "Normally in social science security intact.",
                    "label": 0
                },
                {
                    "sent": "These are the basic problems.",
                    "label": 0
                },
                {
                    "sent": "I will not do with with all of them.",
                    "label": 0
                },
                {
                    "sent": "Of course it's not possible in one dollar 45 minutes, so some of the problems which may provide a space in the recent 10 of 20 years defending network from that data.",
                    "label": 0
                },
                {
                    "sent": "That's very crucial question and just the construction of the network that pending on down that they had invented what you are doing.",
                    "label": 0
                },
                {
                    "sent": "Actually the note would be fine in a different way.",
                    "label": 0
                },
                {
                    "sent": "It can be and you run or our region of interest depending on the under level.",
                    "label": 0
                },
                {
                    "sent": "And at least you're characterizing them.",
                    "label": 1
                },
                {
                    "sent": "And when you have a graph then how to explain the structure?",
                    "label": 0
                },
                {
                    "sent": "The properties of the graph?",
                    "label": 0
                },
                {
                    "sent": "Understanding processes that take place on the networks.",
                    "label": 1
                },
                {
                    "sent": "Each network actually support different processes and then filed, understand, and finally at the models which are connected with both of US first topics and this is so from all these network analysis, filter forward.",
                    "label": 0
                },
                {
                    "sent": "This will I will talk about this part here so very, globally speaking, so that's I will concentrate on this part here.",
                    "label": 0
                },
                {
                    "sent": "Again, this is huge and I cannot cover everything so.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Again, I will reduce to something or be more specific and I will talk about this financial documents that two distinct level or two types of network models.",
                    "label": 1
                },
                {
                    "sent": "One is not well known overhead.",
                    "label": 0
                },
                {
                    "sent": "Now these relational model models.",
                    "label": 0
                },
                {
                    "sent": "And from these two levels.",
                    "label": 0
                },
                {
                    "sent": "How?",
                    "label": 0
                },
                {
                    "sent": "What is it that you don't actually, I will concentrate on the on these type of models and especially the exponential random graph.",
                    "label": 1
                },
                {
                    "sent": "Just to show you.",
                    "label": 0
                },
                {
                    "sent": "How?",
                    "label": 0
                },
                {
                    "sent": "What usually scientists would cover what type of models scientists are working with?",
                    "label": 0
                },
                {
                    "sent": "Before starting.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I will give you 3 examples of three papers which has been have been published recently and which gives our kind.",
                    "label": 0
                },
                {
                    "sent": "Overview of the of the network model.",
                    "label": 0
                },
                {
                    "sent": "The 1st is a human paper publishing silently you 2003 and this number is how much this thing recited.",
                    "label": 0
                },
                {
                    "sent": "It's really cited paper it has this.",
                    "label": 0
                },
                {
                    "sent": "Is it covered different topics but also covers from the different type of models here.",
                    "label": 0
                },
                {
                    "sent": "The Black one graph and then the models of network programming.",
                    "label": 1
                },
                {
                    "sent": "So basically what I will talk today is this one and since this also included in this one which means this part, I will not talk about these models here.",
                    "label": 0
                },
                {
                    "sent": "Another",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Quite nice paper which I recommend to read the Paper Publishing Foundation trained machine learning written by matching learning community.",
                    "label": 0
                },
                {
                    "sent": "These are the with the title survey on this optical network models.",
                    "label": 0
                },
                {
                    "sent": "These are the models which were over used in this paper and again what I will discuss here then just this part of the talk about P1 model exponential random graph model Markov model.",
                    "label": 1
                },
                {
                    "sent": "But I will not discuss these models here, so just one part I will concentrate on the one specific specific apparel models.",
                    "label": 0
                },
                {
                    "sent": "Which are from my point of view, very important of course.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally a paper.",
                    "label": 0
                },
                {
                    "sent": "Which does not do which, do not overview.",
                    "label": 0
                },
                {
                    "sent": "It's not overview network models, but this is the paper from Westport is covered.",
                    "label": 0
                },
                {
                    "sent": "Describing the the library.",
                    "label": 0
                },
                {
                    "sent": "The stuff like that, which I'm certain that you are familiar with and these are the models which does not have it in it.",
                    "label": 0
                },
                {
                    "sent": "Surprisingly, I couldn't find here exponentially.",
                    "label": 0
                },
                {
                    "sent": "Models that several models that offer you there, and he's called watches are some well known models but not exponential random graph model.",
                    "label": 0
                },
                {
                    "sent": "1 Snap snap is a very common but.",
                    "label": 0
                },
                {
                    "sent": "Stanford network analysis.",
                    "label": 0
                },
                {
                    "sent": "Something like that is a is a tool which is very long.",
                    "label": 0
                },
                {
                    "sent": "Good level of incentive for himself or four network analysis and you raise a professor over there.",
                    "label": 0
                },
                {
                    "sent": "I think that social problems.",
                    "label": 0
                },
                {
                    "sent": "Don't look back.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Not before starting with the exponential random graph model, I should just say a few words about the financial family of distribution, because this is.",
                    "label": 0
                },
                {
                    "sent": "Oh, part of the whole concept.",
                    "label": 1
                },
                {
                    "sent": "The exponential family of distribution, something which is well known in statistics.",
                    "label": 1
                },
                {
                    "sent": "It has been done alone almost 100 years ago and it has a huge number of paper and books on the subject.",
                    "label": 1
                },
                {
                    "sent": "Some of the well known distributions belong to include this expansion family includes many of the most common distributions I could hear.",
                    "label": 1
                },
                {
                    "sent": "Some of them these are examples of common distribution.",
                    "label": 1
                },
                {
                    "sent": "Better know their financial well.",
                    "label": 0
                },
                {
                    "sent": "I want to stress here the reason why financial formalism so important because they provide provide general framework for selecting.",
                    "label": 0
                },
                {
                    "sent": "The problem is this and for defining the Yugo samples, autistics usually called sufficient services, so these are the two reasons why we need why actually scientists use exponential family distribution parameters, and then the sample of the sufficient statistics.",
                    "label": 0
                },
                {
                    "sent": "You know, natural way in which they could then models for their support for the data.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the definition family distribution, so these are the basics.",
                    "label": 0
                },
                {
                    "sent": "Other functions of the parameters and A is a lower visual function normal function which is used for normalization.",
                    "label": 0
                },
                {
                    "sent": "So solid exponential family of distributions of the exponential family he said to belong to the exponential family.",
                    "label": 1
                },
                {
                    "sent": "That we go to the connection family.",
                    "label": 1
                },
                {
                    "sent": "If the probability function can be written in these four 2A2, two things I would like to mention.",
                    "label": 0
                },
                {
                    "sent": "The first is that you draw.",
                    "label": 0
                },
                {
                    "sent": "Hey tell which means that we have the family said to be in for.",
                    "label": 0
                },
                {
                    "sent": "However very often it can happen and he will see this in a moment that actually you have much.",
                    "label": 0
                },
                {
                    "sent": "Do you have more?",
                    "label": 0
                },
                {
                    "sent": "Function of.",
                    "label": 0
                },
                {
                    "sent": "In this case, definition family safety with curved and this is used in.",
                    "label": 0
                },
                {
                    "sent": "I will explain you.",
                    "label": 0
                },
                {
                    "sent": "In a meeting, why when it misses you so he said that exponential family.",
                    "label": 0
                },
                {
                    "sent": "How is our define exponential family of distribution?",
                    "label": 0
                },
                {
                    "sent": "How the family?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Quit Lambeau logisticians the Paramenters disappearance of the normalization factor bernouilli.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Really is this way this is apparent matter and again something which is well known, so I will not go to detail.",
                    "label": 0
                },
                {
                    "sent": "I will keep this life.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No, the grass.",
                    "label": 0
                },
                {
                    "sent": "We need we all know how the final graph, but I would like to stress the differences in the division of graph well from the computer science statistics.",
                    "label": 0
                },
                {
                    "sent": "Of course, that if we went into reticle, computer science graph is defined in terms of nodes and edges here is defined in terms of nodes and a corresponding measurement, which is usually a Jesse Maddox.",
                    "label": 1
                },
                {
                    "sent": "Usually identity metrics, so that's the.",
                    "label": 0
                },
                {
                    "sent": "Definition",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And now the exponential random graph model.",
                    "label": 0
                },
                {
                    "sent": "Finally, we will define the exponential random graph models.",
                    "label": 1
                },
                {
                    "sent": "This is Doug.",
                    "label": 0
                },
                {
                    "sent": "Exponential random graph model with the probability distribution briefly with Gen 4.",
                    "label": 1
                },
                {
                    "sent": "I got it so so this is the probability of an item being what being connected or be of existing.",
                    "label": 1
                },
                {
                    "sent": "X is a random metrics random pile up, so it's just semantics, so this is if you have a set of all graphs downsample.",
                    "label": 1
                },
                {
                    "sent": "So this is the whole approach is you don't consider a single graph.",
                    "label": 0
                },
                {
                    "sent": "You consider us at all graphs and samples, so this is the probability that this man is so This is why I'm saying will have this.",
                    "label": 0
                },
                {
                    "sent": "So this specific location we have, these, the probability will have these values, so it's a realization matrix of the adjacency matrix Raptor network.",
                    "label": 0
                },
                {
                    "sent": "It's just this formulation allow or zero values, for example zero or one of the values inside me.",
                    "label": 1
                },
                {
                    "sent": "So this is the set of all of which means that you your graph is not connected, so it's a matrix of just zeros and ones, yes?",
                    "label": 0
                },
                {
                    "sent": "So you're talking about the probability of a connection.",
                    "label": 0
                },
                {
                    "sent": "It's a it's a model.",
                    "label": 0
                },
                {
                    "sent": "As I said, this is an ensemble model.",
                    "label": 0
                },
                {
                    "sent": "You have the set of all and all the questions are.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It is simple actually.",
                    "label": 0
                },
                {
                    "sent": "So here was the major configuration.",
                    "label": 0
                },
                {
                    "sent": "Set of the of the graph, some sub graph, whatever clicks will will will see what will happen.",
                    "label": 1
                },
                {
                    "sent": "Social services.",
                    "label": 1
                },
                {
                    "sent": "These are the methods of plastic folder configuration for the page.",
                    "label": 0
                },
                {
                    "sent": "This is about you, and this is a normalizing constant which you need in order to define probability.",
                    "label": 0
                },
                {
                    "sent": "So the main questions are very simple.",
                    "label": 0
                },
                {
                    "sent": "Actually you would like.",
                    "label": 0
                },
                {
                    "sent": "Again, think about the set of all that's simple guys that this data in in when you do much whatever you don't.",
                    "label": 1
                },
                {
                    "sent": "You just consider the set of all graphs.",
                    "label": 1
                },
                {
                    "sent": "You cannot do anything.",
                    "label": 0
                },
                {
                    "sent": "You need some kind of structure to set you.",
                    "label": 0
                },
                {
                    "sent": "Really, this is a measurable structure in this case, so you need that one.",
                    "label": 0
                },
                {
                    "sent": "So this is actually a measure space and you consider that one that two.",
                    "label": 0
                },
                {
                    "sent": "Again.",
                    "label": 0
                },
                {
                    "sent": "General question why to answering this.",
                    "label": 0
                },
                {
                    "sent": "The first one, given this measure?",
                    "label": 0
                },
                {
                    "sent": "Given this, what are the properties of the graph and the 2nd is?",
                    "label": 0
                },
                {
                    "sent": "Given that on how to find the power so this is one of the question is from the map.",
                    "label": 0
                },
                {
                    "sent": "The other question is from machine learning community or from statistical and this has been developed in the in the last 30 years.",
                    "label": 0
                },
                {
                    "sent": "Really, I may be 100 years along in many papers and it's very well developed.",
                    "label": 0
                },
                {
                    "sent": "The whole topic is.",
                    "label": 0
                },
                {
                    "sent": "Is really multidisciplinary, Ann.",
                    "label": 1
                },
                {
                    "sent": "I will not.",
                    "label": 0
                },
                {
                    "sent": "You will not be surprised when I say that different scientist invented different names for different things, so he remembers the service is called component.",
                    "label": 0
                },
                {
                    "sent": "So from physics from statistical physics and it has some meaning across.",
                    "label": 0
                },
                {
                    "sent": "But I will not go further in that.",
                    "label": 0
                },
                {
                    "sent": "I just want to stress that actually this type of.",
                    "label": 0
                },
                {
                    "sent": "Of type of probability distribution has been studied in physics in statistics in martial law in management.",
                    "label": 0
                },
                {
                    "sent": "Just to so say X is would be some measurable statistics on some configuration of adjacency matrix, so would say for this matrix I would assign this value for example with some of that number pages member of three.",
                    "label": 0
                },
                {
                    "sent": "And this would be the statistics.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you would want yes.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is the Hamiltonian.",
                    "label": 1
                },
                {
                    "sent": "Sign written, I'll skip this one.",
                    "label": 0
                },
                {
                    "sent": "I just want to stress that actually.",
                    "label": 0
                },
                {
                    "sent": "And even not here today, if you read the paper published this year by statisticians, they use the terms phase transition in this set of because terms which are used in physics because actually this is what they want.",
                    "label": 1
                },
                {
                    "sent": "Building",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Examples.",
                    "label": 0
                },
                {
                    "sent": "The simple is.",
                    "label": 0
                },
                {
                    "sent": "Number of edges Andrew have one part of it, so this is a sufficient sophistic.",
                    "label": 1
                },
                {
                    "sent": "What do you think?",
                    "label": 0
                },
                {
                    "sent": "What what model is in?",
                    "label": 0
                },
                {
                    "sent": "Give you the simplest one.",
                    "label": 0
                },
                {
                    "sent": "What is a stimulus one model in in graph theory training?",
                    "label": 0
                },
                {
                    "sent": "So this is the abstract.",
                    "label": 0
                },
                {
                    "sent": "The second one is the number of edges and number of two stars.",
                    "label": 1
                },
                {
                    "sent": "We have two partners, that's this one, but one is the number of edges, number 300.",
                    "label": 0
                },
                {
                    "sent": "This is mine.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Number.",
                    "label": 0
                },
                {
                    "sent": "And as number of neutralize number of our degree number filigree.",
                    "label": 1
                },
                {
                    "sent": "So here you have one environmental two and parameters.",
                    "label": 0
                },
                {
                    "sent": "And probably this is very famous P1 model in social science.",
                    "label": 0
                },
                {
                    "sent": "In social networking, very very these are.",
                    "label": 0
                },
                {
                    "sent": "Numbers, numbers K stars #301 with panic didn't want understand these are just artistic.",
                    "label": 0
                },
                {
                    "sent": "This is what this called Markov Markov graph again.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "So that the rest of my talk.",
                    "label": 0
                },
                {
                    "sent": "I want to call this just to show how they important, how that they have been derelict.",
                    "label": 0
                },
                {
                    "sent": "Who?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "Training this simple Swan.",
                    "label": 0
                },
                {
                    "sent": "The car.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Two different violence.",
                    "label": 0
                },
                {
                    "sent": "I assume that you're familiar, so I will not go into details.",
                    "label": 0
                },
                {
                    "sent": "One is the number of cells number set of Milton, set of edges and the man is the set of proton.",
                    "label": 1
                },
                {
                    "sent": "The probability that the edge will connect to not yes.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just again.",
                    "label": 0
                },
                {
                    "sent": "Why this is called the training?",
                    "label": 0
                },
                {
                    "sent": "Because of that, several papers published almost invisible on the same model.",
                    "label": 0
                },
                {
                    "sent": "Actually I don't remember.",
                    "label": 0
                },
                {
                    "sent": "I think that the first model is.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The models feel better and the 2nd is elevated or they want you be selected.",
                    "label": 0
                },
                {
                    "sent": "We answer as you can find that this model is also called the evidence rainy Gilbert model but.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Usually it's hard to get it ready.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because it proved this.",
                    "label": 0
                },
                {
                    "sent": "They prove very nice tour and saying that there is a parliamentary interface in addition on the one when the giant component component exist in these streets.",
                    "label": 0
                },
                {
                    "sent": "Actually you try to in each diesel for each of these models.",
                    "label": 0
                },
                {
                    "sent": "Before using the models.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second one is to start model.",
                    "label": 0
                },
                {
                    "sent": "And I will do that.",
                    "label": 0
                },
                {
                    "sent": "I will not go into detail, but will the analytical solution has been leveled up recently and this is the paper in which they published analytical solution.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "3rd one is the South model that all this is a focal families is published this paper his paper.",
                    "label": 0
                },
                {
                    "sent": "This model in 86. Review Journal.",
                    "label": 0
                },
                {
                    "sent": "So this is a common problem.",
                    "label": 0
                },
                {
                    "sent": "This is a Surface division services and number of regions, #3 angles, undirected graph.",
                    "label": 0
                },
                {
                    "sent": "He found America without the model behaves strangely.",
                    "label": 0
                },
                {
                    "sent": "They could visit.",
                    "label": 0
                },
                {
                    "sent": "Kind of popular.",
                    "label": 0
                },
                {
                    "sent": "Of them of apologies, the model, but you couldn't prove anything.",
                    "label": 0
                },
                {
                    "sent": "Actually the the proof.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Has appeared almost 10 years ago.",
                    "label": 0
                },
                {
                    "sent": "Nice 2005.",
                    "label": 0
                },
                {
                    "sent": "The paper what they say that along musical solution for this model solution seems to be exactly someone, so I don't see that what is important.",
                    "label": 1
                },
                {
                    "sent": "The solution indicates that the model has no regime in which display moderate levels of clustering Steve allowed to go see it in real networks, so it should be good it will be necessary.",
                    "label": 1
                },
                {
                    "sent": "It is true that things into the construction to avoid this pathology, and this is the problem.",
                    "label": 0
                },
                {
                    "sent": "This pathology we see in all these models, and that's one of the main problems in exponential random graph here or exponential 100 points you say they don't represent reality well, yes, unfortunately.",
                    "label": 0
                },
                {
                    "sent": "What's this?",
                    "label": 0
                },
                {
                    "sent": "We don't understand basically still yet exponential random graph models.",
                    "label": 0
                },
                {
                    "sent": "We don't understand them in the sense that in the sense of what happened.",
                    "label": 0
                },
                {
                    "sent": "Well, what were they?",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "I should be very careful with this understanding if I'm in mathematician.",
                    "label": 0
                },
                {
                    "sent": "This would mean when N goes to Infinity, what how the model if I'm a proficient then I have a data and I would like to fit my data together with practitioners.",
                    "label": 0
                },
                {
                    "sent": "They have plenty nice nice paper written models.",
                    "label": 0
                },
                {
                    "sent": "They can feed the data and so on.",
                    "label": 0
                },
                {
                    "sent": "This side this college fun, but from the theoretical point compute, there's still some open questions which need to be answered.",
                    "label": 0
                },
                {
                    "sent": "Even this year the the paper which has been published papers which have been published this year, still do not answer this question.",
                    "label": 0
                },
                {
                    "sent": "It's really, it's really an open question.",
                    "label": 0
                },
                {
                    "sent": "It's a very difficult.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm running out of time.",
                    "label": 0
                },
                {
                    "sent": "This is the Model B1 visa.",
                    "label": 0
                },
                {
                    "sent": "What I want to stress here is that the.",
                    "label": 0
                },
                {
                    "sent": "How does it and how they develop actually from the formerly the smallest group of people in the group of two people?",
                    "label": 0
                },
                {
                    "sent": "Business called via and is defined with these, so this is it.",
                    "label": 0
                },
                {
                    "sent": "Actually if the network is, the graph is directed.",
                    "label": 0
                },
                {
                    "sent": "You may have four possibilities and descenders.",
                    "label": 0
                },
                {
                    "sent": "So you have mutual, you have a symmetric and you don't have any connection, and assuming that these are independent.",
                    "label": 0
                },
                {
                    "sent": "Somebody else, then you can build the model and this is the model.",
                    "label": 0
                },
                {
                    "sent": "It's a very nice model and a lot of work has been done on these works have been done and so once and for all skip this slide because of the.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But you will have it.",
                    "label": 0
                },
                {
                    "sent": "And if you want you can read it or you can contact me because students and you like to use this model.",
                    "label": 0
                },
                {
                    "sent": "Basically it's a very.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This model has been OK.",
                    "label": 0
                },
                {
                    "sent": "Exercise.",
                    "label": 0
                },
                {
                    "sent": "I went through model or when the people were used to help the student random model.",
                    "label": 0
                },
                {
                    "sent": "This is very easy to answer, but the second is the battle of I didn't talk about these exponential random graph models using the statistiques.",
                    "label": 1
                },
                {
                    "sent": "It's very easy to do.",
                    "label": 0
                },
                {
                    "sent": "Ability distribution function will have this one part for the in another part for old degree distribution out in the League sequence, but nevertheless some of the questions for bees.",
                    "label": 0
                },
                {
                    "sent": "Fun without the paper.",
                    "label": 0
                },
                {
                    "sent": "We just appeared on opportunistic approval here.",
                    "label": 1
                },
                {
                    "sent": "So even for this simple as possible, one of the simplest, most possible got model.",
                    "label": 0
                },
                {
                    "sent": "Yeah you can find papers proving something in this.",
                    "label": 0
                },
                {
                    "sent": "English for this model.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Marco graph it seems that this is the same guys I was wishing I only mentioned that so the idea here is.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's very nice baby.",
                    "label": 0
                },
                {
                    "sent": "I wish I like it so this is the model why This is why is this number of register number of K stars?",
                    "label": 1
                },
                {
                    "sent": "Number printables one really smart why the idea is very simple.",
                    "label": 0
                },
                {
                    "sent": "The proof actually is based on that one and I.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Give you a sheet of getting into the Java Jee you considered to be which is called the temples graph in which your notes are actually the links of the garbage.",
                    "label": 0
                },
                {
                    "sent": "So the notes of this month are delete, assuming that.",
                    "label": 0
                },
                {
                    "sent": "Assume that.",
                    "label": 0
                },
                {
                    "sent": "Because of the fat properties defined in the in the.",
                    "label": 0
                },
                {
                    "sent": "Usual way for the.",
                    "label": 0
                },
                {
                    "sent": "Mark off of my photographs graphic novels you come up with a conclusion.",
                    "label": 0
                },
                {
                    "sent": "Actually yes, history place so that the Greek techniques will be correspond rules for response to the three angles and stars in the in the set in the set in the South.",
                    "label": 0
                },
                {
                    "sent": "Lucky.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I know it's a it's a difficult you cannot understand, but if you read the paper is very simple and straightforward while.",
                    "label": 0
                },
                {
                    "sent": "The idea is like perfect.",
                    "label": 0
                },
                {
                    "sent": "Are you really like it?",
                    "label": 0
                },
                {
                    "sent": "So not considering the graph G But together with G. Considering the graph be another graph which actually the notes of these are the links of the Jeep, and then assuming that this we have market independence on the Markovian properties on this crappy reflects actually prove the fact that your function or your distribution funk.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To Japanese is this?",
                    "label": 0
                },
                {
                    "sent": "Is this some sort of dual problem?",
                    "label": 0
                },
                {
                    "sent": "When you transform it from this is.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We start this is a French model.",
                    "label": 0
                },
                {
                    "sent": "636 and we have this one.",
                    "label": 0
                },
                {
                    "sent": "Weather well known order this could be.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Connected via 100 graphical model, you can find it every textbooks in machine learning, basically in which you stuff Markovian dependence on the variables.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Connectivity.",
                    "label": 0
                },
                {
                    "sent": "This is a paper.",
                    "label": 0
                },
                {
                    "sent": "Actually it's not.",
                    "label": 0
                },
                {
                    "sent": "The paper in the book in which you can, if you're interested in the in the graphical models Pharmacy mini foundation fancy machine learning.",
                    "label": 0
                },
                {
                    "sent": "Actually, there's a lot of work in.",
                    "label": 0
                },
                {
                    "sent": "But we actually think that so the main problem here, I didn't have time to talk about these.",
                    "label": 0
                },
                {
                    "sent": "Basically the main problem here is to compute that.",
                    "label": 0
                },
                {
                    "sent": "That's the main problem.",
                    "label": 0
                },
                {
                    "sent": "You need different techniques approximation to compute, because you need all the realization of the graph all the possible.",
                    "label": 0
                },
                {
                    "sent": "And if you have even independence this is huge and you cannot do it.",
                    "label": 0
                },
                {
                    "sent": "So that's the.",
                    "label": 0
                },
                {
                    "sent": "So all the subway gift, something and different techniques, actually our dialogue.",
                    "label": 0
                },
                {
                    "sent": "That's the main problem here.",
                    "label": 0
                },
                {
                    "sent": "Of course, conditional model, Goshen Field or random field are developed just to avoid these.",
                    "label": 0
                },
                {
                    "sent": "'cause when you consider conditional then you are you actually don't compute.",
                    "label": 0
                },
                {
                    "sent": "Best for the phone network and set these.",
                    "label": 0
                },
                {
                    "sent": "But for for the part of the metric basically so this is the bees.",
                    "label": 0
                },
                {
                    "sent": "You avoid.",
                    "label": 0
                },
                {
                    "sent": "Simulation will do that.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The whole field of exponential random graph models had been exploring the last couple of years and this is some papers which done by foster families, some of them about.",
                    "label": 0
                },
                {
                    "sent": "Of course I mentioned this one here.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Bye bye bye machine learning community but the different.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Different papers offer different groups working in Unison.",
                    "label": 0
                },
                {
                    "sent": "Working with the exponential random graph model papers which I mentioned here are not going to details I have.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "12 minutes more.",
                    "label": 0
                },
                {
                    "sent": "One of the problem is this big analysis issue and this is all with the current curves exponential random graph models, business models actually.",
                    "label": 1
                },
                {
                    "sent": "It may happen that largely or give the probability distribution is placed.",
                    "label": 0
                },
                {
                    "sent": "Either man killed the full graph.",
                    "label": 0
                },
                {
                    "sent": "You don't have this.",
                    "label": 0
                },
                {
                    "sent": "You have this pathology.",
                    "label": 0
                },
                {
                    "sent": "Actually, that's one of the problems would like to solve it.",
                    "label": 0
                },
                {
                    "sent": "Working on that one.",
                    "label": 0
                },
                {
                    "sent": "There's a paper prank of efficiently connecting this problem with instability.",
                    "label": 0
                },
                {
                    "sent": "Or stability defined in a way how this is defined in the in.",
                    "label": 0
                },
                {
                    "sent": "I'm consistent theory definition of the fuel.",
                    "label": 0
                },
                {
                    "sent": "There's something about you just wanna live event for people using differential values.",
                    "label": 0
                },
                {
                    "sent": "Models don't mention fearful want to use it.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And finally, I would like to mention some recent work by statisticians by mathematicians in the field of of the large glass.",
                    "label": 1
                },
                {
                    "sent": "So these are several papers published this year book Reading by author Lowers Who's Extra in Graph Theory.",
                    "label": 0
                },
                {
                    "sent": "They said the question here is if we have an ensemble of objects, the set of all graphs and you have a a measure on that one or probability distribution, how bees behave, how these set with the matter behaves.",
                    "label": 0
                },
                {
                    "sent": "Again with the title of this paper here.",
                    "label": 0
                },
                {
                    "sent": "Is the faces and the table of my.",
                    "label": 0
                },
                {
                    "sent": "Slide here faces and face innovations.",
                    "label": 0
                },
                {
                    "sent": "This again shows that their connection with statistical physics they still work with that with prime proof.",
                    "label": 0
                },
                {
                    "sent": "Actually, what happens in that?",
                    "label": 0
                },
                {
                    "sent": "In the set of all sets of all graphs, one way how to do it is.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Using.",
                    "label": 0
                },
                {
                    "sent": "It holds and this I really like this one and This is why the reason I put it here.",
                    "label": 0
                },
                {
                    "sent": "See if we have adjusted symmetrics you mark you are just Cymetrix to that.",
                    "label": 0
                },
                {
                    "sent": "Square 010 how you do that?",
                    "label": 0
                },
                {
                    "sent": "You divided streets, you impul everywhere.",
                    "label": 0
                },
                {
                    "sent": "In this.",
                    "label": 0
                },
                {
                    "sent": "Put the values 01 in each sub square.",
                    "label": 0
                },
                {
                    "sent": "Of this sampling this point.",
                    "label": 0
                },
                {
                    "sent": "And this is the zero correspond to the zero agency value of 0 Jessie metrics between J and car notes.",
                    "label": 0
                },
                {
                    "sent": "Or one if this belongs to the if the value of the adjacency matrix is 1.",
                    "label": 0
                },
                {
                    "sent": "So then you have a function from the service at which somehow Max Yordesta metrics and then you can define different measure that one and study the.",
                    "label": 0
                },
                {
                    "sent": "The the space and how these space behave when it goes through.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will skip that front.",
                    "label": 0
                },
                {
                    "sent": "This is what my group is working actually and move.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Level, which is now something connected with.",
                    "label": 0
                },
                {
                    "sent": "Remove the layers network and there's some work here aswell with the how to develop an exponential random graph models for the movie layer.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That works.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But I'll skip that one.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Because I think that's that's not how come up.",
                    "label": 0
                },
                {
                    "sent": "I'll I'll, I'll.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "She did this my last life.",
                    "label": 0
                },
                {
                    "sent": "So far from this act, understanding of financial steal, something problem probably.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "We will stay open for a long time.",
                    "label": 0
                },
                {
                    "sent": "As I said, exponential random graphs models graph models have been used.",
                    "label": 0
                },
                {
                    "sent": "I I didn't even shows we are, but having using in social science in machine learning in different roles in physics, I never mentioned that actually or Now what this deep learning.",
                    "label": 0
                },
                {
                    "sent": "All this Boltzmann machine hopeful machine actually belong to the class of the exponential random graph.",
                    "label": 0
                },
                {
                    "sent": "I could even talk about them beast, but this is quite different, completely different subjects.",
                    "label": 0
                },
                {
                    "sent": "I didn't want to mess with that one, but basically.",
                    "label": 0
                },
                {
                    "sent": "This is the same, so it was developed by physicists hope over the furnace is running better and then machine learning or statistician took it and now there are four but basically the mark is very similar and the question you're trying to answer answer or address is very.",
                    "label": 0
                },
                {
                    "sent": "I know what is here, but from my point of view.",
                    "label": 0
                },
                {
                    "sent": "That's something which I would like to work and I'm still working with my students.",
                    "label": 0
                },
                {
                    "sent": "Is organizing hotel nuclear Arsenal.",
                    "label": 0
                },
                {
                    "sent": "That's something which is.",
                    "label": 0
                },
                {
                    "sent": "Michelangelo talk about this multi level.",
                    "label": 0
                },
                {
                    "sent": "When you have a date you have a actors.",
                    "label": 0
                },
                {
                    "sent": "We have a film makers, we have studios or something.",
                    "label": 0
                },
                {
                    "sent": "So this is a classical.",
                    "label": 0
                },
                {
                    "sent": "An example is for full science of the multi level and that's even some of the already.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The paper appeared though, so this is the first page where we fit this disgusting mother for multi level in physics.",
                    "label": 0
                },
                {
                    "sent": "This is called whoopie Multilayers, and recently has become very popular.",
                    "label": 0
                },
                {
                    "sent": "But I didn't have time to talk about that one.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally, I didn't talk anything about.",
                    "label": 0
                },
                {
                    "sent": "Some very basic stuff from machine learning.",
                    "label": 0
                },
                {
                    "sent": "How to connect them to what?",
                    "label": 0
                },
                {
                    "sent": "The subject of my talk and with the network.",
                    "label": 0
                },
                {
                    "sent": "Basically because all these there's a lot of work done in machine learning in network science and white fence, thanks.",
                    "label": 0
                },
                {
                    "sent": "Definition for.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Sadly I'm too very very similar with any questions and I don't think there is a good answer to give, but I will say that I don't love to hear for you here.",
                    "label": 0
                },
                {
                    "sent": "I think the top of the topic that is really curious is a goodness of fit of these models.",
                    "label": 0
                },
                {
                    "sent": "Because yeah, if you if you if you got the best of the right structure as the minimal sufficient would be amazing.",
                    "label": 0
                },
                {
                    "sent": "The best thing you can do to estimation, but how the hell do you know that you got the right model for this network and so the goodness of fit?",
                    "label": 0
                },
                {
                    "sent": "Is the question how do you what does it mean to do a testing?",
                    "label": 0
                },
                {
                    "sent": "And the second question, which is actually very similar, so we have things like this CLT which helps us understand why we see normal distribution everywhere.",
                    "label": 0
                },
                {
                    "sent": "Do we have something similar that easily makes us understand why some types of networks would be more likely to appear in nature?",
                    "label": 0
                },
                {
                    "sent": "So these are the two question because I'm trying to send.",
                    "label": 0
                },
                {
                    "sent": "When would this there we would be applicable, right?",
                    "label": 0
                },
                {
                    "sent": "When could we assume that it would make sense to use?",
                    "label": 0
                },
                {
                    "sent": "OK, yeah, second question.",
                    "label": 0
                },
                {
                    "sent": "The the.",
                    "label": 0
                },
                {
                    "sent": "I don't think that the dancers.",
                    "label": 0
                },
                {
                    "sent": "Yeah, then you can.",
                    "label": 0
                },
                {
                    "sent": "There's no answer to that question.",
                    "label": 0
                },
                {
                    "sent": "There's only examples even in this paper which I manage.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here they only consider a very small number of not general set of the distribution, but very simple distribution.",
                    "label": 0
                },
                {
                    "sent": "So you can prove something for very simple distribution, not for the general an.",
                    "label": 0
                },
                {
                    "sent": "Even for that you have.",
                    "label": 0
                },
                {
                    "sent": "Usually it's I don't want to say that in Matthew assuming many things and then you prove something which whether this is useful or not is another question, but that's.",
                    "label": 0
                },
                {
                    "sent": "From for the second question, what's that it is statistician do or whatever social scientists were that big they are.",
                    "label": 0
                },
                {
                    "sent": "They don't have this.",
                    "label": 0
                },
                {
                    "sent": "What you measure measure for the quality of the fitness.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately they compare they they use this.",
                    "label": 0
                },
                {
                    "sent": "They put some hypothesis and then they use the data to see whether they can predict this hypothesis.",
                    "label": 0
                },
                {
                    "sent": "Filter with the this is the usual thing, but there is no.",
                    "label": 0
                },
                {
                    "sent": "As far as I know.",
                    "label": 0
                },
                {
                    "sent": "Measuring, which is to say OK, your your data or whatever your model or fitting quite well with the data.",
                    "label": 0
                },
                {
                    "sent": "It's a, it's a.",
                    "label": 0
                },
                {
                    "sent": "It's a quite mess.",
                    "label": 0
                },
                {
                    "sent": "Basically because it sounds like yes, it's tricky to use.",
                    "label": 0
                },
                {
                    "sent": "Yes, it's a very difficult and you end up very often with when you use.",
                    "label": 0
                },
                {
                    "sent": "When you find the paramaters, you end up very open with the models in which your graph is either empty or full connections is useless.",
                    "label": 0
                },
                {
                    "sent": "You you know that you should have a natural creature, files, network or whatever, just a few connections, yes, and then you come up with a different technique setting pop with these so the.",
                    "label": 0
                },
                {
                    "sent": "OK, well I have.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "You can use alternate peak.",
                    "label": 0
                },
                {
                    "sent": "I also like to different you.",
                    "label": 0
                },
                {
                    "sent": "Actually you you not you don't work only with the paramaters, but you extend different function of the parliamentary extent is just to have it more reasonable to mortgage right fitting data.",
                    "label": 0
                },
                {
                    "sent": "But why nobody knows just attend.",
                    "label": 0
                },
                {
                    "sent": "Last question, is it true that in your case is the nodes are in a sense independent, so the random assignment of the nodes and everything?",
                    "label": 0
                },
                {
                    "sent": "All these are IID?",
                    "label": 0
                },
                {
                    "sent": "Or is there a dependency structure inside when you decide?",
                    "label": 0
                },
                {
                    "sent": "Who would be connected to it so it 'cause it seems like from the exponential family you showed, I asked how many connections I would have between nodes and in some way that would be.",
                    "label": 0
                },
                {
                    "sent": "It depends what you want.",
                    "label": 0
                },
                {
                    "sent": "If you if you.",
                    "label": 0
                },
                {
                    "sent": "If you have a, if your data is somehow it has some structure of the network, then you don't care if your data is just data would like to infer network.",
                    "label": 0
                },
                {
                    "sent": "Then you can do it in different ways.",
                    "label": 0
                },
                {
                    "sent": "You can assume that the days are some structure and then you model is a is an app in the graphical model.",
                    "label": 0
                },
                {
                    "sent": "If you assume that the dependence between random variables actually reflect your graph, so it depends is defense.",
                    "label": 0
                },
                {
                    "sent": "It depends what color is it?",
                    "label": 0
                },
                {
                    "sent": "Hello microphone.",
                    "label": 0
                }
            ]
        }
    }
}