{
    "id": "kww7gqklc332dcj6ug7gudwqbucppslw",
    "title": "Role of measurements and experimental data in optimised bridge assessment",
    "info": {
        "author": [
            "Aleš Žnidarič, Slovenian National Building and Civil Engineering Institute"
        ],
        "published": "Dec. 14, 2009",
        "recorded": "August 2009",
        "category": [
            "Top->Technology",
            "Top->Business->Transportation and Logistics->Technology"
        ]
    },
    "url": "http://videolectures.net/asfs09_znidaric_rmedoba/",
    "segmentation": [
        [
            "I'm coming to the stage now with another head, so I'm not now anymore.",
            "The organizer of this workshop, but I'm not certain coordinator, but in this case contributor to the arch is.",
            "OK, and I will continue with the other part of the of the equation.",
            "So in addition to the simulation and the theoretical part, how we can improve what was already said, the analysis, the assessment with use of experimental data."
        ],
        [
            "And measurements.",
            "I will just make a short comparison between theoretical modeling and measurements.",
            "What are the benefits of each of the two approaches?",
            "Then I will say something about which way motion systems which we were talking quite a lot already today and we will still hear more about it in the in the next days.",
            "After all, you will be able to see the demonstration tomorrow.",
            "Those of you who are attending the technical tour.",
            "And I will focus on the three main items that we worked on in our cheese, so it's the soft load testing as we call it the traffic loading and dynamic amplification factor.",
            "So basically everything what was already discussed.",
            "On that more theoretical part."
        ],
        [
            "In previous presentations, this is just a brief.",
            "Sketch or comparison between the two approaches.",
            "So the modeling basically can model anything, anything in parentheses, of course, but.",
            "As you can hear, you can use lots of data, so basically unlimited amount of data.",
            "If you have enough computer power can forecast the future with this method that you've heard but is more or less based on assumptions that your model can be only as good as good already.",
            "Assumptions that you were using.",
            "On the other hand, measurements can deal with this kind of assumption problem, so it can measure the real time real life.",
            "What has also other kind of difficulties like measurement in occurs in in accuracies.",
            "Measurements are not always possible, and measurements can also be quite costly.",
            "So these are the parameters of the measurements or the factors of the measurement that we try to tackle and try to optimize.",
            "These parameters of measurements of course both 2 should work closely with each other if we want to get optimize assessment.",
            "So we are dealing here with this kind of model calibration as Marion Expl."
        ],
        [
            "And in his first presentation.",
            "So this is just a bit more in detail because I don't have."
        ],
        [
            "Time I will skip it.",
            "What was the point of work we did in in arches in this area first of all, to simplify and optimize which assessment?",
            "And to and Secondly, to update structural models based on Bridgeway motion measurements.",
            "As I said before, and these are the three."
        ],
        [
            "Factors that I'm going to talk about now.",
            "First I will start bridge briefly with with rich weigh in motion systems.",
            "Many of you know it."
        ],
        [
            "Or those that you don't.",
            "It's a system that uses existing bridges as weighing scales, so when the trucks or vehicles in general cross the superstructure of the of the of the bridge, we measure strains.",
            "Basically, strains could be other things, but predominantly strains we have to detect excellence one way or another and from those using certain algorithms that are constantly under development we can evaluate.",
            "Uh."
        ],
        [
            "All the parameters of the vehicles we use strengthens users as let's say somehow improved gauges based on the string gauges."
        ],
        [
            "Which I installed.",
            "Over the on the under other side of the bridge across."
        ],
        [
            "Cross section.",
            "We can apply additional sensors like here to collect information about the axles which are important to distinguish axle spacings and to define the categories of the vehicle."
        ],
        [
            "You can apply it on different types of bridges.",
            "Just a few examples.",
            "This is a beam deck type of a bridge.",
            "The other one was as."
        ],
        [
            "Le Bridge this was the orthotropic deck bridge in Poland, so it can be applied on different types of bridges.",
            "There are of course some limitations, but in principle you can apply it on great majority."
        ],
        [
            "Of bridges, specially the smaller ones, these are typical results.",
            "You could get all typical data that you can get from way motion systems from X loads.",
            "Gross weights, category vehicles, speed, temperature and all kind of data."
        ],
        [
            "You can also get photo which is important if you have some kind of a difficulties and you have to identify."
        ],
        [
            "Play your problems.",
            "What is important from Bridge point of view regarding the Bridgeway emotion is that we are measuring response of a structure.",
            "That's why we have.",
            "Things that we need when we do bridge assessment.",
            "In this case you can see bridge response, so these are the strange signals of under different sensors.",
            "Which is also important if you display that in the in the other direction, so in lateral direction, you also can see distribution of loads, which is one of those important factors that Bernard was talking before."
        ],
        [
            "The Lane factors how load distributes over lanes.",
            "And this is the whole point of what we call the soft load testing.",
            "So flow testing is nothing else but the diagnostic low testing, which is probably the most popular type of load testing.",
            "Except that it does not."
        ],
        [
            "Used pre weight trucks.",
            "But rather normal traffic from the traffic stream.",
            "So what we do not use is this kind of expensive setup which is hiring.",
            "Lots of lots of trucks which we do not have to close the bridge if which is particularly important.",
            "If we're doing an assessment of existing, but you can afford this kind of measurement if you're doing a new one but closing a bridge for a few days just to do the load, testing is quite difficult to do nowadays.",
            "As I mentioned during this type of measurements we can provide influence lines distribution of loads and also impact factors in."
        ],
        [
            "Will briefly describe all three of them.",
            "Objective of Arch is was to validate this procedure related to."
        ],
        [
            "Diagnostic load testing.",
            "The first important factor is experimental influence line.",
            "Eugene and the other speakers before said that whatever is involved into the simulations in the models is rather conservative because it has to be.",
            "But if we deal with specific structures that we want to assess, we want to know exactly what's happening, and this is an example of a bridge that we did recently.",
            "We did the assessment for it."
        ],
        [
            "The important thing is that it was designed.",
            "This is the scan from the design.",
            "It was designed as a simply supported, so it should have the influence line something like this."
        ],
        [
            "What we measured, and this is the feature of which way motion system that it can provide a measured influence line.",
            "We got this one which is of course much."
        ],
        [
            "Less and when you adjust in your model, the boundary conditions, you can see that this is very close to the fixed support it or the frame type of a structure.",
            "Of course."
        ],
        [
            "The bending moments if we compare this here, we have something like 550 kilometer meters for a. I think it's a eurocodes loading."
        ],
        [
            "If you have this kind of influence line, your bending moment drops to 260.",
            "You have additional."
        ],
        [
            "Serves because of the thickness of this of the superstructure, so you can smoothly speak.",
            "Up here and then, because in this case this was not at the point of the."
        ],
        [
            "Biggest moment so you can move this and then you can get the influence line that you can use.",
            "In your bridge assessments and this, as you can see, it's quite different to the theoretical."
        ],
        [
            "Influence line.",
            "The similar situation we get with the load distribution factors Bernhardt explained before the two extreme cases.",
            "The high load factor highline factors in the loehlein factors, and he already said that the reality is somewhere in between what we can do with this kind of measurements is that we get.",
            "This kind of distribution?",
            "Of loads on each of the sensors we can apply this uncertainties and we can get let's say the measured for the model or the experimental load distribution factors which can then be used to adjust again the traffic loading.",
            "This is just an example of results."
        ],
        [
            "We did this twenty bridges for this loving daughter administration."
        ],
        [
            "So you don't have to read the numbers because this is the summary without doing the soft load testing derating factor, which is the ratio between the capacity in the loading unloading the capacity so capacity and loading.",
            "So it should be greater than one without soft load.",
            "Testing the values were between 0.35 and 0.87, so this would need bridges that needed some kind.",
            "Of repair works if there was no better assessment method.",
            "So when we apply the soft load testing the factors increased to 0.73 to 1.5 two.",
            "And the increase in general was at least 30% and going up to 184% for this kind of bridges, which have much different influence line."
        ],
        [
            "Part of this is that many posted bridges rated as unsafe for normal traffic.",
            "Loads have been rated as safe, which is of course very beneficial for the road ministrations, which.",
            "Always suffer with lack of money for doing rehab."
        ],
        [
            "Dictation measures.",
            "The biggest saving is on smaller and older bridges where you actually don't know what the boundary conditions are, and here you can measure it."
        ],
        [
            "And it is much.",
            "It's less on continuous spans because they are much better defined and the boundary conditions do not influence that much how they really behave."
        ],
        [
            "My last part of presentation is on the dynamic loading and this is related quite a lot of what."
        ],
        [
            "Eugene have said I will not go through this because this is some kind of introduction.",
            "As he said, they did a lot of theoretical studies and simulations at UCD.",
            "We did the."
        ],
        [
            "Experiments.",
            "We use the serum software so the Bridgeway motion software which calculates dynamic amplification factor by comparing measured and static signals.",
            "This is what was said before.",
            "We have tested 6 possible algorithms and we selected one of those which is based on the spectrum that calculates spectrum that calculates hundreds of vehicles, responsive hundreds of vehicles and based on that we filter."
        ],
        [
            "The dynamic signals.",
            "While we have decided to do so, this is an example from the bridge in France.",
            "Conda motorway for those of Slovenia who know where that bridges.",
            "These are different types of vehicles causing different type of response."
        ],
        [
            "This is so from something quite small here.",
            "On the top you have the.",
            "The response of the bridge and here you have the frequency Spectra of this signal up there.",
            "So here you have.",
            "So."
        ],
        [
            "Static part of the signal, which is quite constant.",
            "And here we have the dynamic part of the Spectra."
        ],
        [
            "Which changes."
        ],
        [
            "So we have several signals.",
            "Here we have a multiple presence event.",
            "We had four trucks on the bridge which is quite difficult, but still possible.",
            "So we get four of those very little done."
        ],
        [
            "Mix.",
            "This is the average Spectra of one hour of traffic."
        ],
        [
            "And this is one day Spectra of traffic and you can see that.",
            "This part hasn't changed at all.",
            "So this is the static part of the signal and the dynamic part of course is his is changing and what we do is we filter out this dynamic part of the signal and we remain just."
        ],
        [
            "With the static part, this is how it looks, so this is the measure dynamic signal, the blue one.",
            "This is the filtered out one.",
            "And of course, if you do this properly then."
        ],
        [
            "Whatever you do, the filtering should work and you should have.",
            "Reasonable or?",
            "As accurate as possible ratio between the two.",
            "Of course, because we are dealing with the extreme events, we also visually inspect all the extreme events that you will see then."
        ],
        [
            "In in the charts, so these are now the results I have to correct Eugene because after probably he did report we measured one more site, so we have No 5 results.",
            "This is the one the 24.8 meter beam deck bridge.",
            "So you can see clearly this trend going."
        ],
        [
            "Down.",
            "And the trend is basically the same, it's just the matter how many of those lighter ones are above these thresholds.",
            "This was the 12."
        ],
        [
            "Slab another 11.5."
        ],
        [
            "Meter slab.",
            "A seven point."
        ],
        [
            "Meter slab.",
            "And a 7 * 25 meter beam deck bridge with the continuous slab.",
            "So in all of those you can see these kind of a trend.",
            "This one is maybe interesting.",
            "I don't bring the photo with me, but this was one and it was basically the only one of the heavier ones which actually induced resonance effects on the bridge.",
            "The measurements were taken on the 7th spend, so it had enough time traveling over 6 proceeding spans to induce vibration.",
            "And that's why it was a bit higher.",
            "But nevertheless the total effect is still not."
        ],
        [
            "The extreme one.",
            "This is just the summary similar graph as Eugene showed, so everything goes down.",
            "These are two confidence levels.",
            "That you can see everything is somewhere around or below 1.1 so."
        ],
        [
            "Doing measurements does help optimizing this kind of factors.",
            "This is just.",
            "Illustration for two of them.",
            "This is the bridge, the location of the bridge and Becausw.",
            "Nothing is ideal.",
            "You have quite a lot of.",
            "Irregularities on the payment just on at the expansion joint, and this was one of them.",
            "So quite a high value.",
            "This is something like 10 millimeters local display."
        ],
        [
            "And this is another one which was very good, but the point is, and we're still discussing how to.",
            "How to implement this to conclusion is what is really the effect of the of the quality of the payment and all this local effects on the dynamic amplification factor?",
            "Because as we look at the measurements now, you cannot observe very obvious."
        ],
        [
            "Differences?",
            "So to conclude, knowing real or if you wish, measured or influence lines, load distribution factors and dynamic implications can significantly change the structural model.",
            "You can update it to the real situation.",
            "Dynamic amplification effect are we noted, the design values are too conservative for which assessment artist measurements showed that the AF is below 1.6 with smooth payment below 1.03.",
            "So this is still further reduction from what is proposed based on the generalized simulation results.",
            "And measurements in safety assessment if we use them when we do safety assessment, this can lead to big savings and optimize management.",
            "And should be used for model updating whenever it's possible.",
            "So this kind of measurements also the price of them is not that high that it could not be used for optimized assessment.",
            "And."
        ],
        [
            "With this I thank you for your attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm coming to the stage now with another head, so I'm not now anymore.",
                    "label": 0
                },
                {
                    "sent": "The organizer of this workshop, but I'm not certain coordinator, but in this case contributor to the arch is.",
                    "label": 0
                },
                {
                    "sent": "OK, and I will continue with the other part of the of the equation.",
                    "label": 0
                },
                {
                    "sent": "So in addition to the simulation and the theoretical part, how we can improve what was already said, the analysis, the assessment with use of experimental data.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And measurements.",
                    "label": 0
                },
                {
                    "sent": "I will just make a short comparison between theoretical modeling and measurements.",
                    "label": 0
                },
                {
                    "sent": "What are the benefits of each of the two approaches?",
                    "label": 0
                },
                {
                    "sent": "Then I will say something about which way motion systems which we were talking quite a lot already today and we will still hear more about it in the in the next days.",
                    "label": 0
                },
                {
                    "sent": "After all, you will be able to see the demonstration tomorrow.",
                    "label": 0
                },
                {
                    "sent": "Those of you who are attending the technical tour.",
                    "label": 0
                },
                {
                    "sent": "And I will focus on the three main items that we worked on in our cheese, so it's the soft load testing as we call it the traffic loading and dynamic amplification factor.",
                    "label": 1
                },
                {
                    "sent": "So basically everything what was already discussed.",
                    "label": 0
                },
                {
                    "sent": "On that more theoretical part.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In previous presentations, this is just a brief.",
                    "label": 0
                },
                {
                    "sent": "Sketch or comparison between the two approaches.",
                    "label": 0
                },
                {
                    "sent": "So the modeling basically can model anything, anything in parentheses, of course, but.",
                    "label": 0
                },
                {
                    "sent": "As you can hear, you can use lots of data, so basically unlimited amount of data.",
                    "label": 0
                },
                {
                    "sent": "If you have enough computer power can forecast the future with this method that you've heard but is more or less based on assumptions that your model can be only as good as good already.",
                    "label": 1
                },
                {
                    "sent": "Assumptions that you were using.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, measurements can deal with this kind of assumption problem, so it can measure the real time real life.",
                    "label": 0
                },
                {
                    "sent": "What has also other kind of difficulties like measurement in occurs in in accuracies.",
                    "label": 1
                },
                {
                    "sent": "Measurements are not always possible, and measurements can also be quite costly.",
                    "label": 0
                },
                {
                    "sent": "So these are the parameters of the measurements or the factors of the measurement that we try to tackle and try to optimize.",
                    "label": 0
                },
                {
                    "sent": "These parameters of measurements of course both 2 should work closely with each other if we want to get optimize assessment.",
                    "label": 0
                },
                {
                    "sent": "So we are dealing here with this kind of model calibration as Marion Expl.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in his first presentation.",
                    "label": 0
                },
                {
                    "sent": "So this is just a bit more in detail because I don't have.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Time I will skip it.",
                    "label": 0
                },
                {
                    "sent": "What was the point of work we did in in arches in this area first of all, to simplify and optimize which assessment?",
                    "label": 1
                },
                {
                    "sent": "And to and Secondly, to update structural models based on Bridgeway motion measurements.",
                    "label": 1
                },
                {
                    "sent": "As I said before, and these are the three.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Factors that I'm going to talk about now.",
                    "label": 0
                },
                {
                    "sent": "First I will start bridge briefly with with rich weigh in motion systems.",
                    "label": 0
                },
                {
                    "sent": "Many of you know it.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or those that you don't.",
                    "label": 0
                },
                {
                    "sent": "It's a system that uses existing bridges as weighing scales, so when the trucks or vehicles in general cross the superstructure of the of the of the bridge, we measure strains.",
                    "label": 0
                },
                {
                    "sent": "Basically, strains could be other things, but predominantly strains we have to detect excellence one way or another and from those using certain algorithms that are constantly under development we can evaluate.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All the parameters of the vehicles we use strengthens users as let's say somehow improved gauges based on the string gauges.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which I installed.",
                    "label": 0
                },
                {
                    "sent": "Over the on the under other side of the bridge across.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cross section.",
                    "label": 0
                },
                {
                    "sent": "We can apply additional sensors like here to collect information about the axles which are important to distinguish axle spacings and to define the categories of the vehicle.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can apply it on different types of bridges.",
                    "label": 0
                },
                {
                    "sent": "Just a few examples.",
                    "label": 0
                },
                {
                    "sent": "This is a beam deck type of a bridge.",
                    "label": 0
                },
                {
                    "sent": "The other one was as.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Le Bridge this was the orthotropic deck bridge in Poland, so it can be applied on different types of bridges.",
                    "label": 0
                },
                {
                    "sent": "There are of course some limitations, but in principle you can apply it on great majority.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of bridges, specially the smaller ones, these are typical results.",
                    "label": 0
                },
                {
                    "sent": "You could get all typical data that you can get from way motion systems from X loads.",
                    "label": 0
                },
                {
                    "sent": "Gross weights, category vehicles, speed, temperature and all kind of data.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can also get photo which is important if you have some kind of a difficulties and you have to identify.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Play your problems.",
                    "label": 0
                },
                {
                    "sent": "What is important from Bridge point of view regarding the Bridgeway emotion is that we are measuring response of a structure.",
                    "label": 0
                },
                {
                    "sent": "That's why we have.",
                    "label": 0
                },
                {
                    "sent": "Things that we need when we do bridge assessment.",
                    "label": 0
                },
                {
                    "sent": "In this case you can see bridge response, so these are the strange signals of under different sensors.",
                    "label": 0
                },
                {
                    "sent": "Which is also important if you display that in the in the other direction, so in lateral direction, you also can see distribution of loads, which is one of those important factors that Bernard was talking before.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The Lane factors how load distributes over lanes.",
                    "label": 0
                },
                {
                    "sent": "And this is the whole point of what we call the soft load testing.",
                    "label": 0
                },
                {
                    "sent": "So flow testing is nothing else but the diagnostic low testing, which is probably the most popular type of load testing.",
                    "label": 0
                },
                {
                    "sent": "Except that it does not.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Used pre weight trucks.",
                    "label": 0
                },
                {
                    "sent": "But rather normal traffic from the traffic stream.",
                    "label": 1
                },
                {
                    "sent": "So what we do not use is this kind of expensive setup which is hiring.",
                    "label": 0
                },
                {
                    "sent": "Lots of lots of trucks which we do not have to close the bridge if which is particularly important.",
                    "label": 0
                },
                {
                    "sent": "If we're doing an assessment of existing, but you can afford this kind of measurement if you're doing a new one but closing a bridge for a few days just to do the load, testing is quite difficult to do nowadays.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned during this type of measurements we can provide influence lines distribution of loads and also impact factors in.",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Will briefly describe all three of them.",
                    "label": 0
                },
                {
                    "sent": "Objective of Arch is was to validate this procedure related to.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Diagnostic load testing.",
                    "label": 0
                },
                {
                    "sent": "The first important factor is experimental influence line.",
                    "label": 1
                },
                {
                    "sent": "Eugene and the other speakers before said that whatever is involved into the simulations in the models is rather conservative because it has to be.",
                    "label": 0
                },
                {
                    "sent": "But if we deal with specific structures that we want to assess, we want to know exactly what's happening, and this is an example of a bridge that we did recently.",
                    "label": 0
                },
                {
                    "sent": "We did the assessment for it.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The important thing is that it was designed.",
                    "label": 0
                },
                {
                    "sent": "This is the scan from the design.",
                    "label": 0
                },
                {
                    "sent": "It was designed as a simply supported, so it should have the influence line something like this.",
                    "label": 1
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What we measured, and this is the feature of which way motion system that it can provide a measured influence line.",
                    "label": 0
                },
                {
                    "sent": "We got this one which is of course much.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Less and when you adjust in your model, the boundary conditions, you can see that this is very close to the fixed support it or the frame type of a structure.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The bending moments if we compare this here, we have something like 550 kilometer meters for a. I think it's a eurocodes loading.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you have this kind of influence line, your bending moment drops to 260.",
                    "label": 0
                },
                {
                    "sent": "You have additional.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Serves because of the thickness of this of the superstructure, so you can smoothly speak.",
                    "label": 0
                },
                {
                    "sent": "Up here and then, because in this case this was not at the point of the.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Biggest moment so you can move this and then you can get the influence line that you can use.",
                    "label": 0
                },
                {
                    "sent": "In your bridge assessments and this, as you can see, it's quite different to the theoretical.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Influence line.",
                    "label": 0
                },
                {
                    "sent": "The similar situation we get with the load distribution factors Bernhardt explained before the two extreme cases.",
                    "label": 0
                },
                {
                    "sent": "The high load factor highline factors in the loehlein factors, and he already said that the reality is somewhere in between what we can do with this kind of measurements is that we get.",
                    "label": 0
                },
                {
                    "sent": "This kind of distribution?",
                    "label": 0
                },
                {
                    "sent": "Of loads on each of the sensors we can apply this uncertainties and we can get let's say the measured for the model or the experimental load distribution factors which can then be used to adjust again the traffic loading.",
                    "label": 1
                },
                {
                    "sent": "This is just an example of results.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We did this twenty bridges for this loving daughter administration.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So you don't have to read the numbers because this is the summary without doing the soft load testing derating factor, which is the ratio between the capacity in the loading unloading the capacity so capacity and loading.",
                    "label": 0
                },
                {
                    "sent": "So it should be greater than one without soft load.",
                    "label": 0
                },
                {
                    "sent": "Testing the values were between 0.35 and 0.87, so this would need bridges that needed some kind.",
                    "label": 0
                },
                {
                    "sent": "Of repair works if there was no better assessment method.",
                    "label": 0
                },
                {
                    "sent": "So when we apply the soft load testing the factors increased to 0.73 to 1.5 two.",
                    "label": 1
                },
                {
                    "sent": "And the increase in general was at least 30% and going up to 184% for this kind of bridges, which have much different influence line.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Part of this is that many posted bridges rated as unsafe for normal traffic.",
                    "label": 1
                },
                {
                    "sent": "Loads have been rated as safe, which is of course very beneficial for the road ministrations, which.",
                    "label": 0
                },
                {
                    "sent": "Always suffer with lack of money for doing rehab.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Dictation measures.",
                    "label": 0
                },
                {
                    "sent": "The biggest saving is on smaller and older bridges where you actually don't know what the boundary conditions are, and here you can measure it.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it is much.",
                    "label": 0
                },
                {
                    "sent": "It's less on continuous spans because they are much better defined and the boundary conditions do not influence that much how they really behave.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My last part of presentation is on the dynamic loading and this is related quite a lot of what.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Eugene have said I will not go through this because this is some kind of introduction.",
                    "label": 0
                },
                {
                    "sent": "As he said, they did a lot of theoretical studies and simulations at UCD.",
                    "label": 0
                },
                {
                    "sent": "We did the.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Experiments.",
                    "label": 0
                },
                {
                    "sent": "We use the serum software so the Bridgeway motion software which calculates dynamic amplification factor by comparing measured and static signals.",
                    "label": 1
                },
                {
                    "sent": "This is what was said before.",
                    "label": 1
                },
                {
                    "sent": "We have tested 6 possible algorithms and we selected one of those which is based on the spectrum that calculates spectrum that calculates hundreds of vehicles, responsive hundreds of vehicles and based on that we filter.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The dynamic signals.",
                    "label": 0
                },
                {
                    "sent": "While we have decided to do so, this is an example from the bridge in France.",
                    "label": 0
                },
                {
                    "sent": "Conda motorway for those of Slovenia who know where that bridges.",
                    "label": 0
                },
                {
                    "sent": "These are different types of vehicles causing different type of response.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is so from something quite small here.",
                    "label": 0
                },
                {
                    "sent": "On the top you have the.",
                    "label": 0
                },
                {
                    "sent": "The response of the bridge and here you have the frequency Spectra of this signal up there.",
                    "label": 0
                },
                {
                    "sent": "So here you have.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Static part of the signal, which is quite constant.",
                    "label": 0
                },
                {
                    "sent": "And here we have the dynamic part of the Spectra.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which changes.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we have several signals.",
                    "label": 0
                },
                {
                    "sent": "Here we have a multiple presence event.",
                    "label": 0
                },
                {
                    "sent": "We had four trucks on the bridge which is quite difficult, but still possible.",
                    "label": 0
                },
                {
                    "sent": "So we get four of those very little done.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mix.",
                    "label": 0
                },
                {
                    "sent": "This is the average Spectra of one hour of traffic.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is one day Spectra of traffic and you can see that.",
                    "label": 0
                },
                {
                    "sent": "This part hasn't changed at all.",
                    "label": 0
                },
                {
                    "sent": "So this is the static part of the signal and the dynamic part of course is his is changing and what we do is we filter out this dynamic part of the signal and we remain just.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With the static part, this is how it looks, so this is the measure dynamic signal, the blue one.",
                    "label": 0
                },
                {
                    "sent": "This is the filtered out one.",
                    "label": 0
                },
                {
                    "sent": "And of course, if you do this properly then.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Whatever you do, the filtering should work and you should have.",
                    "label": 0
                },
                {
                    "sent": "Reasonable or?",
                    "label": 0
                },
                {
                    "sent": "As accurate as possible ratio between the two.",
                    "label": 0
                },
                {
                    "sent": "Of course, because we are dealing with the extreme events, we also visually inspect all the extreme events that you will see then.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In in the charts, so these are now the results I have to correct Eugene because after probably he did report we measured one more site, so we have No 5 results.",
                    "label": 0
                },
                {
                    "sent": "This is the one the 24.8 meter beam deck bridge.",
                    "label": 0
                },
                {
                    "sent": "So you can see clearly this trend going.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Down.",
                    "label": 0
                },
                {
                    "sent": "And the trend is basically the same, it's just the matter how many of those lighter ones are above these thresholds.",
                    "label": 0
                },
                {
                    "sent": "This was the 12.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Slab another 11.5.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Meter slab.",
                    "label": 0
                },
                {
                    "sent": "A seven point.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Meter slab.",
                    "label": 0
                },
                {
                    "sent": "And a 7 * 25 meter beam deck bridge with the continuous slab.",
                    "label": 0
                },
                {
                    "sent": "So in all of those you can see these kind of a trend.",
                    "label": 0
                },
                {
                    "sent": "This one is maybe interesting.",
                    "label": 0
                },
                {
                    "sent": "I don't bring the photo with me, but this was one and it was basically the only one of the heavier ones which actually induced resonance effects on the bridge.",
                    "label": 0
                },
                {
                    "sent": "The measurements were taken on the 7th spend, so it had enough time traveling over 6 proceeding spans to induce vibration.",
                    "label": 0
                },
                {
                    "sent": "And that's why it was a bit higher.",
                    "label": 0
                },
                {
                    "sent": "But nevertheless the total effect is still not.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The extreme one.",
                    "label": 0
                },
                {
                    "sent": "This is just the summary similar graph as Eugene showed, so everything goes down.",
                    "label": 0
                },
                {
                    "sent": "These are two confidence levels.",
                    "label": 0
                },
                {
                    "sent": "That you can see everything is somewhere around or below 1.1 so.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Doing measurements does help optimizing this kind of factors.",
                    "label": 0
                },
                {
                    "sent": "This is just.",
                    "label": 0
                },
                {
                    "sent": "Illustration for two of them.",
                    "label": 0
                },
                {
                    "sent": "This is the bridge, the location of the bridge and Becausw.",
                    "label": 0
                },
                {
                    "sent": "Nothing is ideal.",
                    "label": 0
                },
                {
                    "sent": "You have quite a lot of.",
                    "label": 0
                },
                {
                    "sent": "Irregularities on the payment just on at the expansion joint, and this was one of them.",
                    "label": 0
                },
                {
                    "sent": "So quite a high value.",
                    "label": 0
                },
                {
                    "sent": "This is something like 10 millimeters local display.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is another one which was very good, but the point is, and we're still discussing how to.",
                    "label": 0
                },
                {
                    "sent": "How to implement this to conclusion is what is really the effect of the of the quality of the payment and all this local effects on the dynamic amplification factor?",
                    "label": 0
                },
                {
                    "sent": "Because as we look at the measurements now, you cannot observe very obvious.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Differences?",
                    "label": 0
                },
                {
                    "sent": "So to conclude, knowing real or if you wish, measured or influence lines, load distribution factors and dynamic implications can significantly change the structural model.",
                    "label": 1
                },
                {
                    "sent": "You can update it to the real situation.",
                    "label": 1
                },
                {
                    "sent": "Dynamic amplification effect are we noted, the design values are too conservative for which assessment artist measurements showed that the AF is below 1.6 with smooth payment below 1.03.",
                    "label": 0
                },
                {
                    "sent": "So this is still further reduction from what is proposed based on the generalized simulation results.",
                    "label": 1
                },
                {
                    "sent": "And measurements in safety assessment if we use them when we do safety assessment, this can lead to big savings and optimize management.",
                    "label": 1
                },
                {
                    "sent": "And should be used for model updating whenever it's possible.",
                    "label": 0
                },
                {
                    "sent": "So this kind of measurements also the price of them is not that high that it could not be used for optimized assessment.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With this I thank you for your attention.",
                    "label": 0
                }
            ]
        }
    }
}